{
    "A bill for an Ordinance authorizing and approving an amendment to the St. Anthony Urban Redevelopment Plan to add the Sloans Block 7 West Project and to Create the Sloans Block 7 West Sales Tax Increment Area \n (FINANCE & SERVICES) Approves an amendment to the St. Anthony Urban Redevelopment Plan for the Sloans Block 7 West Project in Council District 1. The Committee approved filing this bill at its meeting on 12-16-14.": [
        "'speaker_2': 'I please close the voting and the results. 3939 1098 has been placed on final consideration and does pass. All right. We're moving on to our second public hearing on Council Bill 1099. Councilwoman Fox, would you please put 1099 on the floor?'",
        "'speaker_9': 'Certainly, Mr. President, I the council bill 1099 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and seconded. Public hearing for 1099 is now open. May we have the staff report?'",
        "'speaker_11': 'Hello again, Tracy Huggins with the Denver Urban Renewal Authority. Again, I beg your indulgence, as you will hear many of the same comments I made just a moment ago repeated here is this We do have to do a separate public hearing for each of these projects.'",
        "'speaker_11': 'So this project now is Sloan's BLOCK seven West, which we will be asking City Council to amend the urban redevelopment plan to include the Sloan's BLOCK Seven West Project, as well as to establish the Sloan's BLOCK seven West sales tax increment area.'",
        "'speaker_11': 'Again. The urban redevelopment area was established in August of 2013 and is comprised of approximately 32 acres generally bounded by Stewart Street on the west west Colfax Avenue on the South Perry Street on the East and West 17th Avenue on the North.'",
        "'speaker_11': 'The majority of the area was occupied by the Saint Anthony Central Hospital campus prior to its closure to support much of the redevelopment. Two of the of the hospital campus, two metropolitan districts are in place that will be used to finance a variety of infrastructure improvements.'",
        "'speaker_11': 'However, even with the use of the Metropolitan District financing, there was concern that the key objectives of the redevelopment plans could go unrealized without potential gap financing to support catalytic projects along West 17th Avenue and along West Colfax Avenue.'",
        "'speaker_11': 'In particular, the Colfax Parcel or BLOCK seven is challenged by difficulty in attracting new neighborhood serving retail to a largely blighted stretch of West Colfax and the anticipated extraordinary costs to support structured parking to meet the urban design objectives of Main Street zoning.'",
        "'speaker_11': 'Therefore, at the time the Urban Redevelopment Plan was originally approved, it also approved the creation of a property tax increment area that is coterminous with the Metropolitan District boundaries to support future projects. Any property tax increment generated within the property tax increment area can only be utilized on approved projects.'",
        "'speaker_11': 'The project being considered through an amendment to the Urban Redevelopment Plan is the redevelopment of the western portion of BLOCK Seven, located at West Colfax Avenue and Stewart Street. The Sloan's BLOCK seven West Project site is approximately 1.15 acres within the urban redevelopment area, and in conjunction with the Sloan's BLOCK Seven East Project will complete the redevelopment'",
        "'speaker_11': 'of BLOCK Seven. The project consists of a new 32,600 square foot Alamo Drafthouse Theater and approximately 26 surface parking spaces. The theater building will consist of eight screens, averaging approximately 100 seats per screen. The operator expects the theater to attract approximately 295,000 patrons annually.'",
        "'speaker_11': 'The site will benefit from the use of 145 stalls of structured parking through a permanent access easement agreement granted by the owner of the parking structure immediately north of the site. The redevelopment plan will help to activate a section along heavily trafficked West Colfax Avenue, bringing entertainment service and dining options to the diverse Denver community.'",
        "'speaker_11': 'The project will also act as the gateway to the fully redeveloped South Sloan's Lake area. The Urban Redevelopment Plan authorizes TURA to finance projects within the urban redevelopment area by the use of tax increment financing. The plan amendment will add the Sloan's BLOCK seven West sales tax increment area.'",
        "'speaker_11': 'Jurist staff has reviewed the budgets and proforma submitted by the developer and believes there is a financing gap in the project of $3,400,000. This financing gap will be addressed through sales and property tax increment generated by the redevelopment of the property as well as amounts from the broader property tax increment area.'",
        "'speaker_11': 'Following redevelopment, the site is anticipated to generate approximately $110,000 per year in net property tax increment and approximately $130,000 per year in net sales tax increment. These incremental tax revenues, as supplemented by additional area wide property tax increment of approximately $355,000 per year will be used to reimburse the developer for eligible expenses over a period not to'",
        "'speaker_11': 'exceed 25 years. In approving the Saint Anthony Urban Redevelopment Plan, City Council found the plan to be in conformance with the Denver Comprehensive Plan 2000 and its applicable supplements. Accordingly, any amendment to the Urban Redevelopment Plan must be in conformance with the Urban Redevelopment Plan objectives in order to maintain the continuing conformance with comp plan 2000.'",
        "'speaker_11': 'The general objectives of the Saint Anthony Urban Redevelopment Plan are to reduce or eliminate the blighted conditions and to stimulate the continued growth and development of the urban redevelopment area. The proposed project meets the following objectives of the Saint Anthony Urban Redevelopment Plan to eliminate the present and growing factors which contribute to the blight in the urban'",
        "'speaker_11': 'redevelopment area. To renew and improve the character and environment of the urban redevelopment area and its surroundings by preventing or ameliorating economic, physical and environmental deterioration. To encourage residential retail and commercial development and redevelopment that is socially and economically inclusive and from which the urban redevelopment area and its environs can draw economic strength to encourage and protect'",
        "'speaker_11': 'existing development within and immediately adjoining the urban renewal area. By creating conditions from which these areas can draw new economic strength to more effectively, use underdeveloped land within the urban redevelopment area to encourage land use patterns within the urban redevelopment area where pedestrians are safe and welcome to promote a diverse, sustainable neighborhood economy, including mixed use and'",
        "'speaker_11': 'commercial development opportunities within the urban redevelopment area. Again, there are a number of legislative findings that Council must make before approving this urban redevelopment plan amendment, including that the Sloan's Black Seven West Project is located within the Saint Anthony Urban Redevelopment Area and will promote the objectives set forth in the Saint Anthony Urban Redevelopment Plan that a'",
        "'speaker_11': 'feasible method exists for relocation of displaced individuals and families and business concerns. The project area contains no residences, therefore no individuals or families will be displaced. Additionally, due to the vacancy of the site, no business concerns will be displaced by the project.'",
        "'speaker_11': 'That written notice of this public hearing has been provided to all property owners, residents and owners of business concerns in the resolution setting this public hearing. City Council requested the Urban Renewal Authority to undertake this task. Written notice was mailed first class mail to all known property owners, residents and owners of business concerns in the Saint Anthony'",
        "'speaker_11': 'Urban Redevelopment Area on December 18th, 2014, which is at least 30 days prior to this public hearing. The statute requires that no more than 120 days have passed since the first public hearing before City Council on the Plan Amendment.'",
        "'speaker_11': 'Tonight is the first public hearing before Council on this Urban Redevelopment Plan Amendment. The statute also requires that two years must elapse before council can consider an urban redevelopment plan amendment if they previously failed to approve an urban redevelopment plan amendment for this project.'",
        "'speaker_11': 'This is the first consideration by City Council of an Urban Redevelopment Plan amendment for this project. Also, the plan amendment contains no property that was included in a previously submitted urban redevelopment plan amendment that was not approved by the City Council.'",
        "'speaker_11': 'As such, the requirement to wait at least 24 months since any prior public hearing is inapplicable. On December 3rd, 2014, the Denver Planning Board unanimously found that the proposed amendment to the St Anthony Urban Redevelopment Plan conforms to the Denver comprehensive plan and applicable supplements.'",
        "'speaker_11': 'A letter to this effect has been submitted as part of the record of this hearing and during request the City Council concur with that finding. The Saint Anthony Urban Redevelopment Plan, as amended by the proposed amendment, will afford maximum opportunity consistent with the sound needs of Denver as a whole for the readable rehabilitation or redevelopment of the'",
        "'speaker_11': 'Saint Anthony Urban Redevelopment Area by Private Enterprise. Alamo Sloan's LLC is a developer and a private development entity who intends to undertake the redevelopment project. This project will utilize property tax increment financing accordingly. Denver Public Schools District One has been permitted to participate in an advisory capacity with respect to the inclusion in the plan of the tax'",
        "'speaker_11': 'allocation provisions authorized by Section 31 Desk 25, 107 and nine of the Colorado Urban Renewal Law. And finally, the city and county of Denver can adequately finance and agreements are in place to finance any additional city and county of Denver infrastructure and services required to serve development within the Sloan's BLOCK Seven West Project area for the period'",
        "'speaker_11': 'during which the incremental taxes are paid to the authority. The plan allows for cooperative agreements between the city and borough to address additional infrastructure requirements in city services should they arise. In closing, again, we are very pleased to be working with the city to bring this project forward.'",
        "'speaker_11': 'A recent query of Google Maps revealed that except for several movie theaters that you would not take your children to. There are currently no movie theaters in Denver, west of I-25. This void is clearly recognized with the expected attendance of nearly 300,000 people to this venue.'",
        "'speaker_11': 'With the exciting redevelopment activities that are occurring in West Denver, the opportunity to fill a missing entertainment niche while also providing the type of catalytic project that was originally contemplated, is a win win for this neighborhood and the surrounding community.'",
        "'speaker_11': 'This loans block seven West Project, in conjunction with the Sloan's BLOCK Seven East Project, will help in the broader revitalization of this important corridor. We ask for your favorable consideration of this plan amendment and again will be able to answer any questions you may have.'",
        "'speaker_2': 'Thank you, Ms.. Huggins. We have three speakers for this public hearing, and I will call all three. You can make your way up to the front pew. Tom two franzia, jesselyn, chavez, zanny and sean. Okay, so you three can make your way into the front pew and Mr. de franzia, you can go ahead and begin your remarks'",
        "'speaker_0': '. Thank you again for considering this amendment. Approving the amendment to the Urban Redevelopment Plan will allow for the construction of the Alamo Drafthouse Cinema and also for the redevelopment of the Office Building and construction of retail space. I believe true to the mission of Denver's economic plan, this project will be a driving force that advances economic prosperity'",
        "'speaker_0': '. For this part of Denver by being.'",
        "'speaker_2': 'The catalyst that will.'",
        "'speaker_0': 'Revitalize the West Colfax Business corridor. The news that the Alamo Drafthouse Cinema will also be a part of Sloan's and West. Colfax has raised a tremendous amount of excitement in the neighborhood. We are confident that Alamo Drafthouse track record for success and pioneering projects in other challenged areas will be repeated in the West Colfax Business Corridor and'",
        "'speaker_0': 'surrounding neighborhoods. We're also confident that by anchoring the southern edge of the new Sloane's project, we will bring new customers for businesses currently operating on West Colfax and stimulate the development of abandoned lots and empty buildings. We are excited to create up to 150 new jobs in Act First Source Hiring and utilize small business enterprises in our'",
        "'speaker_0': 'construction. We're also excited to establish ourselves in the Sloane's community as business owners and operators offering film entertainment for an underserved area. The theater will be a great amenity for arts and entertainment, where guests can enjoy made to order food and Colorado microbrews served to the seats at affordable prices.'",
        "'speaker_0': 'Our signature programing, film festivals and free family films that run all summer long are a part of what has made Alamo Drafthouse successful. Just as integral to our success are the valuable services we provide to the communities in which we operate.'",
        "'speaker_0': 'The neighborhood surrounding Sloan's Lake and south of West Colfax have a longstanding history of diversity and community and Alamo Drafthouse Cinema intends to contribute to that. This next statement is taken directly from our guiding principles, which have been in place for many years in our posted in every one of our locations.'",
        "'speaker_0': 'And woven into the fabric of how we conduct our business. We're tied in. And by the way, everybody has a copy of all these principles as well. We're tied to the communities surrounding each location, and we do our part to make those communities better places to live.'",
        "'speaker_0': 'Our locations are unique, serving those neighborhoods in an organic, natural way. They share many similarities, but ultimately, each theater is unique to the community it serves. We enact this principle by being locally managed, hiring local staff, by listening to and engaging with the community around us and putting, as you said earlier, our money where our mouth is'",
        "'speaker_0': '. When making commitments, for example, in 2014, the Alamo Drafthouse, Littleton hosted 47 discounted nonprofit events and school field trips for such groups as the Boys and Girls Club. Muscular Dystrophy Association Make a Hero Foundation Littleton Ballet Building Family Foundation.'",
        "'speaker_0': 'Bemis Library. Girl Scouts of Metro Denver. The School Hotel Echo.'",
        "'speaker_2': 'Miss to differentiate you 3 minutes is okay.'",
        "'speaker_0': 'I want to thank you again and thanks especially to Susan Sheppard for all her hard work that she's put towards this project. Thanks.'",
        "'speaker_2': 'Thank you, Mr. Diferencia. Jesselyn Chavez, R.D..'",
        "'speaker_5': 'Good evening. My name is Jesselyn Charles, and I'm here on behalf of Girls Inc of Metro Denver. I'm excited to be here because we have been an organization that's been rooted in the West Colfax.'",
        "'speaker_4': 'Corridor for 32 years.'",
        "'speaker_5': 'We've been serving girls in that area for our entire history, so we're excited for something like the Alamo Drafthouse to come into our community. The girls that we serve are coming in from the neighborhoods and like was mentioned earlier, there is no there is nothing there for them to access like this.'",
        "'speaker_5': 'So for them to share and are, you know, wanting a safe out of school time, we're really excited to have that come. Alamo Drafthouse, now being placed in Littleton even still has had a great impact on the work that we do.'",
        "'speaker_5': 'They've been extremely generous and providing us with a number of resources in the past year. So we can't even imagine what would be available to us to have them here in our community when we're looking forward to what is coming in the next few months.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_2': 'Thank you. Michelle Chavez. Trevisan. Shana Shea.'",
        "'speaker_0': 'Hi. I'm Shauna Sham, the executive director of the Building Family Foundation based in Littleton, Colorado. I am here to support the Alamo Drafthouse Cinema. Yes, it's a theater, but it's actually grown to quite more. It's a strategic partner, a strategic philanthropic partner and a great neighbor.'",
        "'speaker_0': 'They've been invaluable in supporting our mission of teaching life skills, employment skills.'",
        "'speaker_8': 'Soft skills, leadership skills to youth in the south metro area.'",
        "'speaker_0': 'There, and have been incredibly supportive of our youth film series and our summer film school. So in addition to a movie theater, you're going to be getting a great neighbor and incredible community partner. So I'm just really excited about this expansion and I know they'll have a great impact on on this area.'",
        "'speaker_0': 'So thank you for allowing us to speak.'",
        "'speaker_2': 'Thank you, Mr. Shame. That concludes our speakers. Time for questions of members of the Council. Councilwoman Ortega.'",
        "'speaker_10': 'I'd like to ask Tracy Huggins if she wouldn't mind coming to the microphone. So Tracey, for anybody that is watching who has not been involved in this process, can you explain why we have two separate tax increment districts for what may seem as one project to people looking at it from the outside?'",
        "'speaker_11': 'Certainly. And in fact, this came to us as one project initially for the entirety of the block, but there were a number of unique challenges with the type of development that was looking to occur that caused the development team to actually split it into two separate projects as such.'",
        "'speaker_11': 'Each of them have made a request for tax increment assistance through the Urban Redevelopment Authority, and we will be entering into discrete redevelopment agreements with each of those entities. So with Lyttleton Capital Partners as well as with the The Alamo, we are look, because each project is looking to generate its own increment to pay for its own'",
        "'speaker_11': 'level of expenses. That's why we're looking to have the two separate sales tax increment areas so that they each will be able to take that as a benefit that which they themselves create. In addition, as I said, they will be sharing in the broader property tax increment area that is being created throughout the balance of the site'",
        "'speaker_11': '. But it really is because there are they are two separate projects with two separate re developers, each looking to benefit from the sales tax increment that they themselves generate.'",
        "'speaker_10': 'I'm not sure if you're the right person to answer a question about the parking. So both of these projects are proposing to use part of the parking in the garage that is still existing on the site. And so my question is what other parcels or properties that have already come forward are proposing to use that same garage'",
        "'speaker_10': '? I know, for example, the theater will probably be most highly utilized in the evening when the office building and other uses on the site may not be available. So that probably makes sense. But can you just talk about that for sure?'",
        "'speaker_11': 'The the other primary user of the parking garage will be new residential development that is occurring on what would be one, two, three, four, block five with the parking garage being on block six. So BLOCK five is currently under redevelopment of four new rental residential units.'",
        "'speaker_11': 'That will be the primary user of that, the balance of the parking garage.'",
        "'speaker_10': 'And that's the property that is to the north of the garage. That's under construction.'",
        "'speaker_11': 'To the.'",
        "'speaker_6': 'East.'",
        "'speaker_11': 'Of the garage.'",
        "'speaker_10': 'Okay.'",
        "'speaker_11': 'What would you like me to put on the map?'",
        "'speaker_10': 'That would be helpful.'",
        "'speaker_11': 'Let me see if I can do that. As I. As I say that. And I just click to.'",
        "'speaker_10': 'Show the only other user of the garage besides these two projects that we're reviewing tonight, the residential. And as.'",
        "'speaker_4': 'Far.'",
        "'speaker_11': 'As I know, I'm looking for two other nods in the audience. Yes. That it would be the the residential as well as in the commercial uses on block seven. Okay. So, Councilwoman Ortega, this is a obviously an older picture, but you can see where it says BLOCK.'",
        "'speaker_4': 'Six where the.'",
        "'speaker_11': 'Parking structure is located. Again, the topic of our conversation tonight is block seven. BLOCK five is the site that is currently under construction for the residential with the residential development.'",
        "'speaker_10': 'Okay. Thank you. I have no further questions.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilman Rob.'",
        "'speaker_4': 'Well, that was a very serious question. My question is for the representative from Alamo free movies in the summer for kids and their parents.'",
        "'speaker_0': 'Absolutely. Every day, the summer when the kids are out on summer break prior to noon, we schedule a free family film where parents and kids can come and watch free in the theater.'",
        "'speaker_4': 'Okay. That was a commercial time for you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you. Thank you. Kathryn Moran, Catwoman Fox, thank you.'",
        "'speaker_9': 'Also for Mr. de France here. They don't go far. It's interesting to find out about these free summer movies because one of the concerns I had followed a comment by the district councilwoman last week about the importance of having family friendly development in northwest Denver and around the Sloan's Lake.'",
        "'speaker_9': 'And when I did some research about the movie chain, I discovered that the admission and age policy, by and large not entirely, but by and large, was truly not designed for an area with children. The stated policy that I saw was age policy 18 and up.'",
        "'speaker_9': 'Children six and up will be allowed only with a parent or guardian. No children under age of six will be allowed. And then there was also reference in the Littleton one to the dinner package with a movie that restricted everybody to age 21.'",
        "'speaker_9': 'So I'm trying to figure out I mean, this may be is your way of balancing things, but it does not appear that this is a theater really designed for attracting children.'",
        "'speaker_0': 'Yeah, I could understand your concern by reading the policies. First of all, it's children under six are not permitted in a PG movie, a rated PG movie. Children under six are permitted with their parents. So so we don't completely shut them out.'",
        "'speaker_0': 'And secondly, Alamo Drafthouse is a family theater. We are not a theater where parents come and drop off their teenagers and drop off their kids to hang out and to loiter and to watch movies. We focus on the movie experience as being a family event, and we provide a nice text free talk, free environment in which families'",
        "'speaker_0': 'can watch movies together. And we focus on family programing. We play first run films, all the latest Hollywood Pixar movies and, you know, Family and children repertory titles. We play those as well with regards to our food and beverage service.'",
        "'speaker_0': 'Yes, we do serve alcohol and we do have a strict policy when serving food and alcohol to make sure that everybody in the theater is accompanied by an adult.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman. That's Councilwoman Sheppard.'",
        "'speaker_5': 'Thank you, Mr. President. I've been doing a lot of research on the West Colfax corridor, and I know that the rates of poverty are extremely high as well as unemployment. So Mr. De Franzia referenced the hundred and 50 jobs that he hopes to create on the site.'",
        "'speaker_5': 'And for those who may be watching or in the audience whose ears perked up at the opportunity for some jobs in the site. Tracy. Ms.. Huggins, I was hoping you can explain the first source hiring policy.'",
        "'speaker_11': 'I would be happy to. Thank you for asking me to do exactly that. So any project that receives tax increment assistance through the urban redevelopment, through the Urban Renewal Authority, is required to comply with our first source hiring policy, which is a program that is designed to allow for the first opportunity to interview for any job that'",
        "'speaker_11': 'is created as a result of the project to be made available to low income Denver residents. So we work very closely with the Denver Housing Authority, who then works with the developers first source project coordinator to make sure that all of those job postings.'",
        "'speaker_4': 'Are are.'",
        "'speaker_11': 'Known and made available again from a first opportunity standpoint to low income Denver residents.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'All right. Do we have any other questions for 1099? Seen none. Public hearing on 299 is not closed. Time for comments, Councilwoman Sheppard.'",
        "'speaker_5': 'Thank you, Mr. President. So we were talking earlier about how blighted the West Colfax corridor and how the condition of that street has been such for about 50 to 60 years. And currently on that street and I've spent a lot of time on that street, there is an incredible plethora of boarded up, abandoned buildings, vacant parking lots'",
        "'speaker_5': ', payday lenders, tattoo parlors, more used car lots than you can shake a stick at. I don't know how many used cars one can buy in a year and a bunch of Route 66 era motels that definitely have seen better days.'",
        "'speaker_5': 'This, I believe, will be an exciting opportunity to revitalize this court. I'm very excited about this project. I know that. And Councilman Lopez and I talk about this a lot in north and west Denver, we lose so much of our tax dollars to shopping opportunities and Jeffco entertainment opportunities in Jeffco and other services, because so many of'",
        "'speaker_5': 'our residents travel to Jefferson County, to the Belmar area to receive things that we really want to see happening in Denver. I know that the few times I've gone to a movie when I have time, which is really rare, I've also driven to Belmar.'",
        "'speaker_5': 'So I'm excited about this opportunity because I think this gives a great, great chance for people who already live in our neighborhood to to to dine and have a craft beer and a scratch made meal and enjoy a great movie right in our neighborhood.'",
        "'speaker_5': 'And I can actually walk to this place I'm pretty excited about that might be a bit of a long walk, but I could walk. So I'm very excited about that. I'm excited about the fact that it's well-served by public transportation, such as the West Colfax Bus and also our new West Corridor light rail.'",
        "'speaker_5': 'And I am excited that yet another vacated lot, which is currently kind of a weeded out parking lot, will have the opportunity to be redeveloped into something that is really something that we can all be proud of. And I've had the opportunity to get to know the good folks from Alamo over the last year and have interacted'",
        "'speaker_5': 'with them as well as some of the nonprofits in our area. And, you know, thank you for already hosting a wonderful, very family oriented outdoor summer movie on the shores of Sloan's Lake last year. I can't remember the name of it, but it's pretty funny.'",
        "'speaker_5': 'And and to donate some of the proceeds from the sales of the concessions to one of our area nonprofits, and I know you've also already had some conversations with various community partners about what types of film festivals you might want to sponsor at that location.'",
        "'speaker_5': 'So I am excited about the revitalization opportunity. I'm excited about doing something for, you know, a really underutilized, blighted area on West Colfax quarter. I'm excited about the opportunity for some new jobs and and I'm excited about the way that you partner with the community.'",
        "'speaker_5': 'So I am very happy to support this tonight, and I would urge my colleagues to do so as well.'",
        "'speaker_2': 'Thank you, Councilwoman Shepherd. Councilwoman Fox.'",
        "'speaker_9': 'Thank you, Mr. President. Just perfunctorily, I'm making the motions tonight, and I made the motion on this particular ordinance, but it is not something I personally support in committee. I asked whether the Littleton Alamo Drafthouse had received TIFF money, the tax increment financing money, and the answer was no.'",
        "'speaker_9': 'It was explained to me that it was a different business model. I've long said I support tax increment financing in some cases, but each proposal has to stand on its own merits. It is not, in my opinion, the taxpayer's responsibility to subsidize a movie theater and drafthouse.'",
        "'speaker_9': 'I do want to thank Dora for making all the information about their proposals accessible to me. To its credit, much of the of this Saint Anthony redevelopment does not require TIFF money, and I think that's very important. I was pleased for that.'",
        "'speaker_9': 'I'm also pleased that they were willing to let me take a peek at something very important to me. I've looked at the confidential financials for Alamo, and if projections are right long term, I believe this endeavor can make it without taxpayer subsidies.'",
        "'speaker_9': 'And so I'll be voting against this TIFF proposal.'",
        "'speaker_2': 'Thank you, Councilwoman Fides. Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. Chair. I think a lot of what. Councilman Sheppard. Had expressed the same sentiments that I have along West Colfax. I think this is one of the first developments that are going to pop up that's really going to spur activity along West Colfax.'",
        "'speaker_8': 'Those of you who are familiar with the west side of the city, in the west side of the river, there's not much development out there. And, you know, Councilman is right and Councilman Shepard's right. You know, we do not have very many areas.'",
        "'speaker_8': 'We do not see blight and you do not see weeds growing instead of landscaped. Right. Always. You know, it's it's a good thing to see this happen. This neighborhood needs it. The it's not just about jobs. It's not just about economic development, but it's also about folks getting a return on their investment when they go to the'",
        "'speaker_8': 'bank and borrow against their home to send a kid. College should be worth something, right? They should have some equity, right? Folks on the west side of Denver should be able to have capital as well. Right. And that's what developments help do and that's what it helps spur.'",
        "'speaker_8': 'And I think this is one of those examples. It's long overdue. You know, West Colfax, you know, although you do have the the the old school motel motels, it does have that Route 66 flavor. That's where we that's not where I did.'",
        "'speaker_8': 'But I cruised federal back in the day. But before that, it was cool facts and you still have that. And we have to remember that in Denver that, yes, you have an East and West Colfax and whether it is certain amenities, you know, that come from the city that we are able to take care of on our'",
        "'speaker_8': 'own or things that we have to leverage active financing to make it happen, it's there. And, you know, my hat's off to the Alamo. You know, they came to us very early on to the community, actually. And at first, we were kind of a little weirded out because, you know, you cannot you can't bring in the name'",
        "'speaker_8': 'like the Alamo to a highly Chicano neighborhood. Man, that's a bad name, right? And so they said, no, no, no, no, no, it doesn't have anything to do with the Alamo. And I said it means tree, right? Poplar tree?'",
        "'speaker_8': 'Absolutely. Exactly. And so hopefully there's a lot of trees on that site, but it is going to help spur that that development. And, you know, it may not be one of those Elvis theaters that I went to as a kid over in southwest Denver.'",
        "'speaker_8': 'You drop you off, get in a fight, you know, come back home, pay it all. But you're laughing because you know it's true. But it is meeting a need in that area town. I like Bill Maher, but I wish Bill Maher was in Denver.'",
        "'speaker_8': 'Because if I had a choice. Nothing against Lakewood. Love Lakewood. It's nice Home Depot's down the street, but I'd rather go to the one in Denver. Why? Because it's important to invest in your own neighborhoods and in your own city.'",
        "'speaker_8': 'Because of the youths are our youth are going to be employed. There's a lot of folks that are going to be employed there. It's our side of the city and we need to invest in it. And so, you know, I would love to see development happen there that would keep people and keep dollars in Denver instead of'",
        "'speaker_8': 'taking it out. So, Councilman, this is going to be awesome and I do support this from moving forward.'",
        "'speaker_2': 'Thank you, Councilman Lopez. Councilwoman Robb.'",
        "'speaker_4': 'Thank you, Mr. President. Since Councilman Lopez mentioned East Colfax, thank you for reminding me there's a West End in East Colfax. I would like to just point out, I know it's not my colleague, Councilwoman Ford's favorite project, but all evening, as I've listened to this, I've been thinking about the Lowenstein Theater, a site that was vacant for'",
        "'speaker_4': '20 years on Colfax. And we've struggled. It was it was hard to redevelop. It was financially hard to redevelop. But just to give you an example, the key word to me in this proposal tonight in front of us is the word catalyst.'",
        "'speaker_4': 'That's the only TIFF project funding we did along Colfax. And since then, we've had two new grocery stores on East Colfax, a new Office Depot, a new liquor store, no tax increment in the liquor store. Many new businesses, including Stella, a restaurant that I think maybe came from that, the West, Northwest, Tiki Monk, Sassafras, also opening along'",
        "'speaker_4': 'Colfax. I could really go on in a very long list. So this is a hard site. We have people who came in willing to do the clean up, the planning, a lot of the entitlement work. But the risk of having this site sit vacant is a huge risk because of what else is on East Colfax.'",
        "'speaker_4': 'I will be supporting this tonight. Excuse me, what else is on West Colfax?'",
        "'speaker_2': 'Thank you, Councilwoman Robb. Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. I just wanted to add my $0.02 here as well. I actually grew up in my high school years to the neighborhood just south of this. And it's been that long since we had not seen the kind of investment on the West Colfax corridor.'",
        "'speaker_10': 'I remember Councilman Garcia when he was the councilman of that area, working really hard to begin to see some revitalization of the West Colfax corridor. And Councilman Councilwoman Robb used the word catalyst. I was going to use the word anchor anchor tenant and that's what I see.'",
        "'speaker_10': 'The Alamo. As for the Colfax corridor, I sit on the board of a nonprofit that did the housing Colfax in Irving, and we've seen the city invest in that, as well as the new library that will soon be opening.'",
        "'speaker_10': 'We heard maybe sometime in February, the end of February. They also invested in the project at the West End, done by the Colorado Coalition for the Homeless. So as we see the need for affordable housing in our city, we've seen some city investment in that.'",
        "'speaker_10': 'And we will see both market rate and some affordable housing as part of this St Anthony's redevelopment site. But all of that is bringing even more more bodies, more synergy to the community, as well as all of the residents that live both north and south of Colfax.'",
        "'speaker_10': 'I'm excited about having this theater on Colfax because it's a missing link for our community and the other type of investment that will be made, bringing in more restaurants and other things that I think will continue to help spur other investment along the West Colfax corridor.'",
        "'speaker_10': 'We've seen some of that happening with some city assistance. I think this project will help us see some of that happening just with private investment that will want to come and be part of this corridor. So I am happy to support both of these bills tonight.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega, any other comments? 1099 Scene on Madam Secretary, Roll call.'",
        "'speaker_4': 'SHEPHERD Hi, Susman. Brooks Hi. Brown I know. And each. Lehman Hi. Lopez Hi, Monteiro. Nevitt Hi, Ortega. Rob. All right, Mr. President.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Secretary, please. Those are the only announced results.'",
        "'speaker_4': '12. One day, 12 eyes.'",
        "'speaker_2': 'One day. 1099 has been placed on final consideration and does pass council. We need we now need to vote on Council Bill 1100, which will reach the panel bill that we postponed. Councilwoman Fox, would you please put council bill 1100 on the floor?'",
        "'speaker_9': 'Thank you, Mr. President. I move that council bill 1100 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved. We need a second. It's been moved and seconded. Comments. Councilwoman Fox.'",
        "'speaker_9': 'This is a companion bill and since I didn't support the main one, I'm not going to be supporting this money.'",
        "'speaker_2': 'Thank you, Councilwoman Fox. Councilman Shepherd, did you want to show?'",
        "'speaker_5': 'No further.'",
        "'speaker_0': 'Comment.'",
        "'speaker_2': 'All right. Thank you. In other comments on 1100, seen none. Madam Secretary. Roll Call.'",
        "'speaker_4': 'Shepherd Susman. Brooks Brown. Fox. No. Kenny Layman. Lopez. Monteiro, Nevitt. Ortega, Rob. All right, Mr. President.'",
        "'speaker_0': 'I.'"
    ],
    "Rezones property at 1555 and 1597 Stuart Street from Former Chapter 59 PUD 559 to C-MX-3 (Commercial, Mixed Use, 3 stories) in Council District 1. (NEIGHBORHOODS AND PLANNING) Rezones property at 1555 and 1597 Stuart Street from Former Chapter 59 PUD 559 to C-MX-3 (Commercial, Mixed Use, 3 stories) in Council District 1 (2014I-00050). A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 12-10-14.": [
        "'speaker_2': 'Madam Secretary, please close the vote and announce the results. 1201 Nay Baba has won the council bill 1100 has been placed on final consideration and does pass. All right. We are moving on to the next one, which is Council Bill 1047.'",
        "'speaker_2': 'Councilman Watts, will you please put 1047 on the floor?'",
        "'speaker_9': 'Certainly, Mr. President. I know the council bill 1047 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and seconded council bills 1047, 1075 and 1076 all approved zoning map amendments. The Council is required by law to conduct hearings on zoning map amendments and Council's actions are subject to court review in order to provide a record for court review.'",
        "'speaker_2': 'Testimony is recorded and any items presented to the Council are marked as exhibits and become part of the record. The Council Bill for the Public Hearing for Council Bill 1047 is now open. May we have the staff report?'",
        "'speaker_7': 'So there we go. Thank you, Mr. President. And good evening, council members. I'm Kyle Dalton with the Department of Community Planning and Development. This request for rezoning at 1555 and 1597, Stewart Street is located right next door to what we've been talking about for the past hour in Council District one in the West Colfax Statistical neighborhood.'",
        "'speaker_7': 'It's located on the west side of Stewart Street, all the way to Tennyson Street between Kansas Place and 16th Avenue. And it's directly across from the old St Anthony's parking garage. And Colfax Elementary is just to the south of it.'",
        "'speaker_7': 'And it's the L-shaped or the backwards L-shaped property indicated in the in the yellow dashed line. The property is a former religious assembly structure with attached school facilities, and the property owner is the one requesting rezoning tonight there requesting rezoning in order to facilitate redevelopment of the site and remove an old restrictive specific plan unit development.'",
        "'speaker_7': 'And our staff analysis is based on the rezoning and not any specific development project. They're requesting to rezone to the C three zone district in the Denver zoning code. The C stands for our urban center neighborhood context AMC's indicates that it's a mixed use zoned district and the three indicates the maximum height allowed in the district.'",
        "'speaker_7': 'In terms of number of stories, the property is sandwiched between two neighborhood contexts. To the east is the urban center see neighborhood context as their requesting and to the west is urban neighborhood U. Zone districts to the east are more intense.'",
        "'speaker_7': 'Mixed use districts to the West are less intense residential zone districts. And then all along Colfax are Main Street mixed use commercial zone districts. The current zoning is a plan. Unit development in the former Chapter 59 are known as the old zoning code number 559.'",
        "'speaker_7': 'It was established in 2004 and is based on the R-1 Residential Zone District, with the addition to allow the construction of a dormitory which otherwise wouldn't have been allowed in the r-1. In a very specific site development plan that I saw in just a second, it allows continuance of the existing school as well as that religious assembly'",
        "'speaker_7': 'sanctuary with some remodeling. But the detailed district plan included in the PD does not allow reconfiguration of the site. And so this slide really is the nuts and bolts of why they're here tonight. The this is a site plan out of the the plan, unit development zoning that exists for the property today.'",
        "'speaker_7': 'It acknowledges the existing school and the existing sanctuary at the southeast corner of the property, and it proposed a dormitory at the north end across a parking lot. Well, here they are today, and they recognize they no longer have a need for that sanctuary facility.'",
        "'speaker_7': 'The congregation that was here has long since moved. The school doesn't recognize that that that's a a use that they need for their school. And it's actually a more fitting site for their dormitory where it can be attached to the adjacent school rather than located across the parking lot.'",
        "'speaker_7': 'But again, under the current PD, this is all they can build. So the dormitory is currently off site, a few blocks to the east. They want to move it here and they want to move in that location adjacent to the existing school, but they can't under the current zoning, hence the request to rezone.'",
        "'speaker_7': 'Here's a look at the existing context around the property. The blue indicates the the school. So there's the school on the site as well as Colfax Elementary School just to the south. The hatching to the east is the parking garage and beyond is the the vacant property under redevelopment to the west and the shades of yellow are'",
        "'speaker_7': 'residential zoned districts. And then there's the pink commercial along Colfax. In terms of the building form in the scale of buildings, the site is is right in a transition from lower scale buildings to the west of one and two storey single family homes and some multifamily units further west, as indicated by the top graphic, that middle graphic'",
        "'speaker_7': 'shows the existing school site, 1 to 2 stories and scale. And then to the east is the parking garage. It's a four story building currently there in terms of process. This application was received and we were provided informational notice of receipt in September.'",
        "'speaker_7': 'On September 17th, 2014, it followed the regular schedule for rezoning. So there was a public hearing at the planning board on November 19th, which was properly noticed under the terms of the Denver Zoning Code, at which planning board recommended approval unanimously of this case.'",
        "'speaker_7': 'It went on to the Neighborhoods and Planning Committee who moved it out on December the fourth of 2014 to register. Neighborhood organizations have commented on this case, both of recommending support of the case. That's the West Colfax Association of Neighbors and the West Colfax Business Improvement District.'",
        "'speaker_7': 'And we received no other written comments on the case, and there was no one else has testified on the case. We reviewed it against the five rezoning criteria. And I'll I'll get to the salient points here real fast.'",
        "'speaker_7': 'First, the criterion for a rezoning is that it be consistent with adopted plans. So first, we have the citywide comprehensive plan 2000. There are a number of strategies and comp plan 2000 that address this rezoning, which staff feels that the application is consistent with in terms of promoting infill development.'",
        "'speaker_7': 'That is a quality that broadens the variety of compatible uses that are allowed and that promotes mixed use development, which allows people to live near work and retail and services and that they need in their daily lives. It also relates to the Comprehensive Plan 2000 strategies regarding recognizing the traditional ethnic ethnic neighborhood, which the school has been'",
        "'speaker_7': 'a part of for a long time, strengthening the positive attributes of our neighborhoods and then reviewing and updating city processes for zoning, this this rezoning, all of the old code and out of a putting into a standard zoned district.'",
        "'speaker_7': 'And the Denver zoning code is a is a great implementation of this land use strategy. And for those because of that, we find that the application is consistent with comp plan 2000. Turning to the blueprint, Denver, which is the city's land use and transportation plan adopted in 2002.'",
        "'speaker_7': 'This map shows the Blueprint Denver Plan Map. The pink color is the land use concept indicating that the site is has a mixed use land use concept which encourages a variety of uses, including employment and housing and services.'",
        "'speaker_7': 'Intensity is higher but can vary, and then the diagonal hatching across the site and to the east indicates that it's in an area of change. In our areas of change channel are areas where the city desires to channel growth, where it will be beneficial to the city, and where we should allow an appropriate mix of uses.'",
        "'speaker_7': 'Now again, the current PD limits, development limits the available uses on the site and doesn't implement these recommendations for Blueprint. Denver We do find that rezoning to a mixed use zone district would be more consistent with this blueprint.'",
        "'speaker_7': 'Denver Land Use Recommendation Blueprint. Denver also has recommendations regarding the street types, and here all four streets around the property are local streets. Blueprint Denver doesn't give a specific direction for local streets, but that lower volume designation makes rezoning to a low intensity, mixed use district appropriate.'",
        "'speaker_7': 'And here the applicants have selected the lowest intensity mixed use district in the urban center context, the three story zone districts. So again, we find it most appropriate. Then turning lastly to the West Colfax Plan adopted in 2006, even more specific plan, the West Colfax Plan had its own land use concept, which again is a pink color'",
        "'speaker_7': ', and the property is shown here in the blue dashed line. That pink color stands for the town center and it's designed to be an activity center with mixed use retail, employment, housing, civic amenities like a school in the language of the plan, specifically calls for this town center to vary in scale where the greatest intensity should be'",
        "'speaker_7': '. At the core, it should radiate to lower intensity at the fringe. Again, the sites are at the fringe and so rezoning to the lowest intensity mixed use district, a mixed use three story district is consistent with this plan direction.'",
        "'speaker_7': 'So having reviewed it against all of the plans, we find it consistent with that review criteria. It would maintain uniformity with the Cemex three zone district as applied throughout the city of Denver and through implementing their plans and is further detailed in your written staff report, we find that the rezoning would further the public health, safety and'",
        "'speaker_7': 'welfare of the City of Denver. The fourth criterion is that there be a justifying circumstance here to justify in circumstances that the land or its surrounding environs has changed or is changing to such a degree that it's in the public interest to encourage redevelopment of the area and recognize the change character of the area.'",
        "'speaker_7': 'There are a number of changes happening in this area, some of which you've heard earlier that we find provide a justifying circumstance for this rezoning, including the adoption of the West Colfax Plan and the new Denver zoning code in 2010, both of which have transpired since the time of this PD being adopted.'",
        "'speaker_7': 'There's been a lot of investment in the West Colfax area and the redevelopment of the Saint Anthony site are all changes occurring in the surrounding environs that provide a justifying circumstance for this rezoning. And then finally we review rezonings for consistency with neighborhood context, zoned district purpose and intent.'",
        "'speaker_7': 'The Urban Center Neighborhood context includes a regular pattern of blocks with consistent orientation and mixed uses in the X three zone district is as accurately applied to the site where we do have that kind of pattern of blocks and uses.'",
        "'speaker_7': 'And even more specifically, the Cemex three zone district is intended to apply to areas served primarily by local or collector streets, where a building scale of 1 to 3 stories is desired. So as I indicated earlier with Blueprint Denver indicating that these are local streets around this property, around this property, and with the scale of two and'",
        "'speaker_7': 'a half to three stories to the west, five stories and up to the east here, the Cemex three zone district is that perfect transition and it is also consistent with the intent of the zone district. So again, we find it consistent in having reviewed it against all five criteria.'",
        "'speaker_7': 'We recommend approval.'",
        "'speaker_2': 'Thank you, Mr. Dalton. We have one speaker for this public hearing. And Rabbi Wasserman, you can make your way into the front pew and you can begin your remarks.'",
        "'speaker_0': 'Thank you, Aaron Wasserman, president and CEO of the Yeshiva, as well as a resident of the community for the last 42 years. I first wanted to take the opportunity to thank the Community Planning Development Department, as well as Councilwoman, Councilwoman Susan Shepherd and the rest of the City Council for their work and the recent years of the'",
        "'speaker_0': 'area, as we heard much of tonight. Grateful for that. It's certainly exciting to see all the transformations happening in our neighborhood. And we are thankful for all to all of you to help make this helped this process along.'",
        "'speaker_0': 'I am grateful as well as a resident watching this over many years, growing up in the community and seeing what's going to happen now, it's really amazing to watch. As you know, the Yeshivah has been a proud, active member of the Sloan's Lake community for the last 48 years.'",
        "'speaker_0': 'Since 1967, with activity happening in the area, the Civic sees the opportunity to reinvest in the neighborhood and and the community by renovating the Stewart Street campus and relocating our dormitory, as well as renovating our current facility, which will enhance the neighborhood as well.'",
        "'speaker_0': 'The look and feel as well for our students and our community. We believe connecting the dorm directly with the yeshiva will better be a better solution for our students by providing them security, as well as better connection to the existing school.'",
        "'speaker_0': 'Overall, we look forward to renewing and invigorating our presence in the community for next 50 years. And again, thank you to all of you and to the staff, the city council, staff and council for all the work that you have done.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_2': 'Thank you. That concludes our speakers is now time for questions. Do we have any questions from members of the Council? Councilwoman Shepherd.'",
        "'speaker_5': 'Thank you, Mr. President. This is a question for Mr. Dalton. Do you happen to know what year the PUD five, five, nine was passing.'",
        "'speaker_7': 'I think it was 2004.'",
        "'speaker_5': 'Okay. Would you consider it a detailed beauty?'",
        "'speaker_7': 'Yes, he has a boy. I'm sorry.'",
        "'speaker_5': 'Would you call it a detailed beauty, sir?'",
        "'speaker_7': 'Yes. The former Chapter 59 didn't make the distinction the way the new code does between detailed in general, but it is a highly detailed beauty.'",
        "'speaker_5': 'Am I to understand that we are being asked to change this zoning tonight in order for the current or owner who I believe was the owner in 2004 to move the project from one side of his property, their property to another side.'",
        "'speaker_7': 'That is why they're requesting a reason.'",
        "'speaker_5': 'That's what I'm just asking you to confirm. Yeah. So in this case, what I'm. What I'm asking is. Well, actually, maybe I'll just leave it for the comments that that's my question. Thank you.'",
        "'speaker_2': 'Thank you, Councilman Sherrod. Any other comments on 1047 seen on public hearing on 1047 is now closed. Time for comments, Councilwoman Shepherd.'",
        "'speaker_5': 'Thank you, Mr. President. I am definitely very happy to support this rezoning tonight. The reason why I was asking Mr. Dalton about the detail is because I think it exposes some of the issues that come up around a detailed pad when you get so specific and prescriptive about how a site may be developed that it doesn't leave'",
        "'speaker_5': 'flexibility for changing conditions, changing uses, changing broader implications, that can happen. And I think, if I'm not mistaken, that is why community planning and development has really been moving away from detailed Pwds is because in this case you have the owner of the property having to file for a rezoning just to move a project from one side'",
        "'speaker_5': 'of his property to another. And I find that problematic, you know, and so I think. That there are reasons. Some of which are quite valid for why we as a city are trying to move away from the DFL PD situation.'",
        "'speaker_5': 'So I applaud the recommendation of CPD. Thank you very much to the Orthodox Jewish community and to the Yeshiva for coming forward with this and I'm proud to support this tonight and wish you all the best. And I know the community is growing, so I'm here to help support you as I can.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. Any other comments on 1047 C? None, Madam Secretary.'",
        "'speaker_4': 'Raquel Shepherd. I susman. Brooks Brown. I thought I can eat lemon, i. Lopez Montero. Nevitt Ortega Ortega. Rob I Mr. President.'",
        "'speaker_0': 'II.'"
    ],
    "Rezones property located at 4625 West 50th Avenue and 5030 Vrain Street from PUD #273 to PUD #G11 in Council District 1. (NEIGHBORHOODS & PLANNING) Rezones property located at 4625 West 50th Avenue and 5030 Vrain Street from PUD #273 to PUD #G11 in Council District 1. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 12-10-14.": [
        "'speaker_2': 'Madam Secretary, please for the voting and announce the results. 3939 1047 has been placed on final consideration and does pass. All right. We are moving on to the next one. 1075. Councilwoman Fox, would you please put council Bill 1075 on the floor?'",
        "'speaker_9': 'Thank you, Mr. President. I move the council bill 1075, as amended, be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved. We need a second on the computers council members. It has been moved in. Seconded public hearing for council bill 1075 is now open. And may we have the staff report?'",
        "'speaker_6': 'I think so. Sorry. I just want to make sure I have the right show up. My name is Tina Axelrod. I'm a planning and development supervisor at CPD here tonight to present you a rezoning application for four 4625 West 50th Avenue from PD number to 73 to PDC 11.'",
        "'speaker_6': 'I quickly, quickly orient you to where the subject property is located. We take you from the city view showing that it's in the far northwest corner of the city. Little, little more honed in. It's in Council District one, Susan Shepard's district.'",
        "'speaker_6': 'It is just north of I-70 and west of Tennyson, surrounded virtually all sides by the Willis Coast Municipal Golf Course. It's in the Regis statistical neighborhood. But we often refer to the surrounding neighborhood jointly as the Berkeley radius.'",
        "'speaker_6': 'You can see both there on the on the neighborhood map. There is an aerial close up view of the subject property. The rezoning request in front of you today is for this 5.24 acre site. The current owner is the Eligible Shrine Association and on the property is their current association building, which was completed construction in 1930.'",
        "'speaker_6': 'You can see it there on the western side of the property and the rest of the area is vacant or surface parking lots. Currently, the property is being used as a fraternal club lodge for the Eligible Shrine Association and a special events center as well.'",
        "'speaker_6': 'The applicant on the rezoning application in front of you is the Shrine Preservations Partners, which is a limited liability partnership form to move forward with acquisition of the property based on whether the entitlement is approved in the proposal, in the rezoning application and is for a mix of single unit two unit and multi-unit residential redevelopment, including potential'",
        "'speaker_6': 'reuse of the existing shrine building. The current zoning again is a former Chapter 59 or old code pad number 273, and the request is to rezone into a Denver zoning code, put a new capacity. A general type of PD would be number 11 in our account.'",
        "'speaker_6': 'The current pad is is pretty restrictive, particularly in terms of use. It allows. It was adopted in 1989 pretty much just to freeze what was in place on the property. And that was to allow the club lodge use to continue and to expressly allow the rental, the facility to the general public for special events like weddings.'",
        "'speaker_6': 'And it has been used as such since then. There's also an allowance in the pad for accessory eating and drinking space within the existing training, building up to 20%. And there is actually a carbon cap cabernet cabaret license associated with the property and there is an active eating and drinking space within the building.'",
        "'speaker_6': 'The current pad does not allow any residential use of the property. It does require a minimum of 325 parking spaces, and it provides an access easement along Vrain Street, which is not a dedicated public street to properties to the north.'",
        "'speaker_6': 'There is a provision in the current PD. It's just a one line in the PDA that the southern facade of the existing shrine building must be maintained. The other existing zoning around the subject property to the north and east of the subject property, but west of Tennyson is an E as udc's zoning on those abutting couple of'",
        "'speaker_6': 'residential blocks. That's an urban edge single unit D as a minimum lot size of 6000 square feet. And the little X means that you have both. Both imply an urban house and a suburban house building form allowed. And of course the surrounding existing context in terms of zoning is our municipal golf course, which is zoned OSA open'",
        "'speaker_6': 'space a which just signifies it to city owned or maintained open space or in this case, a recreation facility. In terms of existing land use, I've described already what's occurring on the subject property adjacent in the surrounding neighborhoods.'",
        "'speaker_6': 'We've got, of course, the golf course and primarily single family in the blocks to the north and east of the subject site with a few scattered duplex uses, preexisting 1956 duplex uses in the neighborhood as well. In terms of building form and scale.'",
        "'speaker_6': 'There's a a picture of the existing eligible shrine building you see attached to the red arrow. It's the magnificent building if you haven't been out there to see it, hopefully you've looked at the pictures, but it's got that Moorish Spanish architecture with lots of of the 1928 1930 design still intact on that southern facade that you see'",
        "'speaker_6': 'there in the surrounding neighborhood. There are a variety of one, two, two and a half storey single family homes. The streets do not have sidewalks here. Mostly vehicle access is taken direct directly from the street. There's only there's there's no alley in the block where you see between Vrain and Utica, though, there are alleys on the block'",
        "'speaker_6': 'between Tennyson and Utica. They take a little bit of time to walk you through the the content of the proposed update. This is a fairly complex period and there's a lot of text in it. The PDA draft is in your package.'",
        "'speaker_6': 'It's the document that comes right after the staff report. The primary intent and bringing forward a plan unit, development zone district as described by the applicants in their application, was to preserve and facilitate the adaptive reuse of the existing shrine building.'",
        "'speaker_6': 'In addition to that circumstance, which is fairly unique and special on this property. The party was intended to account for and take advantage of some steep slopes that cut across the property from west to east. And the fact that sub sub area A is labeled on your screen doesn't have the regular pattern either of an urban edge'",
        "'speaker_6': ', an urban neighborhood. It's a big super block. There are no public streets chopping it into what we would typically find in an urban edge, urban neighborhood of a rectangular blocks and lots with alleys. A bit of a challenge in figuring out how to have zoning work on that type of sort of area.'",
        "'speaker_6': 'The other intent of the pad is to achieve compatibility with those existing residential uses on frame and Utica to respect the golf course. As a neighbor, we don't get a lot of new development in Denver at this scale adjacent to a municipal golf course.'",
        "'speaker_6': 'And there were some concerns raised by parks in planning over what that edge should and would look like. So that's addressed by some special standards in the PAD as well that we don't typically see in our standard zoned districts.'",
        "'speaker_6': 'And then the desire to create some type of gateway in terms of form and use along 50th Avenue, which will be the the only vehicle access or the primary vehicle access into this site. The PD Zone District divides the 5.25 acres into three sub areas.'",
        "'speaker_6': 'Again, you see it there on your screen, Saberi, A, B and C. There are different standards attached to each of those sub areas. But overall, the PD does establish a total density cap of no more than 78 dwelling units across the entire PUD.'",
        "'speaker_6': 'So sub area A, B and C, no more than 78 dwelling units can be constructed and maintained. That includes anything that gets built inside the existing shrine building as well as on the grounds around it and what gets built in B and C walking through each of the sub areas and some of the highlights of the zoning'",
        "'speaker_6': 'for each sub area is the largest portion again where the existing shrine building sits almost neatly in the center. As you recall, for general pads, we tie our pads to a to the closest base. So base standard zoned district in the zoning code to try to move and frame the pad to be as close as possible to'",
        "'speaker_6': 'what we would we would require in a standard zone for a sub area, a the base zone district is the urh3a, which is an urban row home, two and a half storey maximum height. The A is for a special allowance for apartment forms that don't play out here.'",
        "'speaker_6': 'We chose the U r RH three for a variety of reasons. Probably the most important reason was to use the applicant wanted to establish multi-unit dwelling uses. They want to divide the existing building, hopefully someday into apartments or condos.'",
        "'speaker_6': 'That's a multi-unit dwelling use. You need at least a row home zone district to get that use. So we started with that. That row home zone is key to allowing the multi-unit to unit and it does allow single unit land uses.'",
        "'speaker_6': 'We use the real home building form from that base zone district and modified it to to make the existing trade building conforming to legalize the building form not just the, not the use inside of it, but just the building height and mass.'",
        "'speaker_6': 'There are some very detailed standards and I'm happy to answer questions that are in the PD zone district that preserve and maintain the integrity of the architectural features of the existing shrine building. And they are fairly detailed, they're fairly rigorous and probably most important, they you cannot demolish that building under the PD.'",
        "'speaker_6': 'You cannot voluntarily demolish the. Building. You can do some very limited edition additions to it on the back end, but those additions can't house dwelling units, they have to be very compatible with the rest of the building and you cannot add or alter the exterior of the southern third of the building, which has all that original rich'",
        "'speaker_6': 'detail still on it. Outside the existing building, the Sudbury A zoning standards essentially allow duplex buildings around subtree outside the building. It's a row house building form, but you can't have more than two structures per building. So it's a bit bulkier than a standard duplex form, but still only two units per structure.'",
        "'speaker_6': 'You could you can go three stories, but a long range street where that is where the existing context starts, you have to step back the mass of anything above 25 feet from the street. So you can't have a sheer wall.'",
        "'speaker_6': 'Three stories tall at the setback from frame. Sudbury, Abbey and Sudbury C are really part of the same block, existing block in the neighborhood. They're an extension of what's a pattern already established and which is continued through the day with some some changes.'",
        "'speaker_6': 'The suburb zoning is based on an urban edge single unit D one zoned district, which is the exact same zoned district as the zoning to the north, except that it allows accessory, dwelling, unit use and form. But even that's limited here.'",
        "'speaker_6': 'If you look at sub area B, there's the Pudi zoning would allow a minimum of 6000 square foot lots. You can you can get a maximum of six lots there. Of those six, you could only do adus on the Southern four.'",
        "'speaker_6': 'So you can't bump up an ADU form or use against the existing neighborhood. You sort of have to take a break for those two northern lots and then you can do 80 is through the concept site plan process and the review of the rezoning application.'",
        "'speaker_6': 'A few essentials were mapped out for the applicants in terms of public street improvements that would be required here. And one of them is to put in a new east west public alley, and you see the dotted yellow line on the screen between sub area B and sub area C.'",
        "'speaker_6': 'That indicates a requirement by the city of Denver for a new east west alley. This was part of an effort to not have this half of the block taken up with a lot of driveways and curb cuts. But to use the alley for rear access.'",
        "'speaker_6': 'So that's in the zoning as well. You were there won't be any curb cuts for front loaded garages or driveways. All the vehicle access will be from the rear of of new homes. Finally, in deference to a predominant building form in the neighborhood, any new single family home in sub area B has to have a pitched roof'",
        "'speaker_6': '. That's a design standard that was added to the pad in deference to a more compatible architectural form that exists in the neighborhood. In sub area C, which is the end cap of the block. The base zone district is E2 C and the pad does some limited variations from that West 50th Avenue rather than rain or Utica becomes'",
        "'speaker_6': 'the primary street. So the homes will typically face 50th that similar to or actually the exact same condition that's found just to the east of Utica. There's a allowance for additional height to incentivize incentivized pitched roof buildings, but those pitch roofs are not required.'",
        "'speaker_6': 'Again, rear alley access will be required. We've done some tinkering of the design standards in the zoning to assure a more pedestrian friendly face on 50th by requiring the entrances to face 50th and not the off to the side.'",
        "'speaker_6': 'Finally, we've got some special design standards sprinkled throughout that apply in the various sub areas, mostly to address the edges between the golf course and the new development zone sub area A We have some heightened quality fence and wall design standards for any fence built along the public golf course boundary or between a building and the golf'",
        "'speaker_6': 'course. And we also have some special building specific rules of height to address a change in slope so that you can build multiple buildings on the super block and generally all have them the same height, even as your slope changes in sub area B and C, that continuation of the existing lot.'",
        "'speaker_6': 'There's some special height and landscaping and screening standards for the edges around the new alley to screen that alley and garage doors that might be visible as you're coming up and down rain in Utica and also in Sudbury, AC.'",
        "'speaker_6': 'We have some special heightened standards for fence and wall design with required landscaping to soften that edge where you transition from single family homes to duplex homes facing West 50th. That in a nutshell, is the content of the PD.'",
        "'speaker_6': 'Obviously, the PD has probably a lot more detail on it and again, happy to take questions. In terms of process, this has gone through the typical process. There's been quite a bit of back and forth between the neighborhood, the general public, the applicants and CPD over this PD prior to this city council hearing and after the neighborhood'",
        "'speaker_6': 'and Planning Committee meeting on December 10th, we got direction from the committee, we being the applicant, CPD and the neighbors to continue working on, covering and maybe gaining some greater consensus on some few outstanding issues, including the issue of density and greater compatibility.'",
        "'speaker_6': 'So I just want to note there were some changes since this has been in committee. For those of you who sit on the committee and to what's in the PD today, specifically what was added to the PD or changed in the PUD since the committee meeting on December 10th is the cap on total density of 78 dwelling'",
        "'speaker_6': 'units in sub area a surrounding the existing shrine building new homes can contain no more than two units per per building. That was a change since committee again to limit the density and in sub area a any expansion allowed the existing building.'",
        "'speaker_6': 'It was clarified that any bump out of that building cannot contain dwelling units. You can make a bump out or an expansion to add excess or common areas, but no dwelling units again to control the the potential for an ever expanding shrine building to to morph out across the site.'",
        "'speaker_6': 'Our review criteria. I'll walk through each hour briefly. We've got additional review criteria for a rezoning to a PD that you're familiar with. We'll also go through this tonight. First and foremost is consistency with adopted plans. There are two adopted plans that are in play here, a comprehensive plan, 2000 and Blueprint, Denver, which was adopted our adopted'",
        "'speaker_6': 'land use and transit transportation plan from 2000 to Comprehensive Plan 2000 provides a great set of general principles and strategies and objectives by which we can hold up this rezoning application and listed. There are a number of specific strategies that CPD has found.'",
        "'speaker_6': 'The rezoning is consistent and would further among them is that that important legacy strategy of preserving Denver's architectural and design legacies certainly that Gord is eligible. Shrine building is a legacy that this PD, as its cornerstone, seeks to preserve and facilitate, hopefully its adaptive reuse.'",
        "'speaker_6': 'In terms of housing strategies from the comp plan, this does offer an opportunity to introduce a greater variety of housing types, including the accessory dwelling units and a limited number, including more duplexes and multifamily units in a corner of northwestern Denver, where a lot of those options don't exist.'",
        "'speaker_6': 'In terms of promoting infill development services and infrastructures are available and adequate in place. The The Street Network will be improved by future development at the subject property according to minimum Denver Street and fire standards. And then land use strategy three be at the bottom.'",
        "'speaker_6': 'I want to point out it states to encourage quality infill development that's consistent with the character, the surrounding neighborhood that offers opportunities for increased density and more amenities and that broadens the variety of compatible uses. Again, CPD found that particularly in sub the efforts in sub areas B and C to craft the zoning that really extends what's'",
        "'speaker_6': 'already there on the rest of the block. But then to look at the opportunity, the unique site around the eligible shrine building, surrounded on all sides, not by existing homes, but by golf course. And that openness as an opportunity to introduce some increased density and offer a broadened or variety of housing types.'",
        "'speaker_6': 'In terms of blueprint, Denver, as you know, Blueprint Denver is comprised of a number of different parts. One of its component part is the future land use map. The future land use concept for the subject property was is a golf course.'",
        "'speaker_6': 'So in other words, the recommendation for future use for the eligible Shrine Association property is is golf course looking looking at this with 2020 hindsight and knowing a bit about how blueprint Denver was a higher level view of the city CBD really since early feels as where the recommendation was based on a mistake of fact that the'",
        "'speaker_6': 'eligible shrine property was part of the Willis Municipal Golf Course. It never was, never is. There are no intentions to acquire this property by the city of Denver. And certainly if we were to zone it to open space, that would be a taking.'",
        "'speaker_6': 'We didn't there's little guidance provided in that other than, you know, an interesting question mark and how how we got there. But it is in a designated area of stability and there are a lot of principles that come into play for reinvestment of redevelopment in a blueprint designated area stability.'",
        "'speaker_6': 'What I want to point out to you and Blueprint Denver, I know we haven't talked about this concept much in city council, but we we talked a lot about it in 2010. And area stability does not mean no change.'",
        "'speaker_6': 'Okay. It's not the opposite of an area of change. Blueprint Denver does very clearly anticipate reinvestment and some level of change in area stability, and it describes areas, areas of stability as being one of two types committed areas and reinvestment areas.'",
        "'speaker_6': 'A lot of what we see in areas of stability are committed areas. They're stable. There's a pattern is there? And the overriding direction the plan gives us is that any future infill and redevelopment should be compatible and consistent with the existing pattern of land use and scale.'",
        "'speaker_6': 'And certainly that's what our zoning does for the most part in our areas of stability. But Blueprint Denver also very clearly note that even in state and I'm quoting Blueprint and even in stable residential areas, there are often areas that would benefit from change.'",
        "'speaker_6': 'These areas due to their lack of reinvestment, have a negative visual impact on the surrounding areas. Blueprint goes on to describe these types of areas as reinvestment areas, and reinvestment areas, according to Blueprint, are places where it's desirable to maintain their character.'",
        "'speaker_6': 'But it is also beneficial to support reinvestment through, quote, modest infill and redevelopment or major projects in small areas. Many Denver neighborhoods, as we look around, contain that are stable, contain both committed and reinvestment areas. And Blueprint acknowledges this now doesn't provide us a huge amount of detailed guidance as to what a major project could look like'",
        "'speaker_6': 'in a reinvestment area. But this pad is in front of you to suggest what a major project could look like in a reinvestment area on this unique peninsula of land, in an area otherwise area stability. We see this as an opportunity area as well to implement blueprint and comp plan policies in regard to introducing those housing types'",
        "'speaker_6': 'I just talked about. And an opportunity for for some increase in density to take advantage of the site and to enable the preservation of the existing building. And some CPD has found in as detailed much more greatly in my staff report, CPD finds that the proposed PDE zoning is consistent with adopted plans.'",
        "'speaker_6': 'As also reported in the staff report. We find that the proposed zoning would result in uniformity of district regulations and further the public health, safety and welfare in terms of the existence of justifying circumstances. CPD finds that this criteria is met due to changes on the unique site, really social and economic changes that has made this institutional'",
        "'speaker_6': 'use, which has been there since 1928 to 1930, just no longer viable for the eligible Shrine Association to maintain this larger facility for its original institutional use. It leaves a zoning in place that was really there specifically to enable that institutional use and nothing else.'",
        "'speaker_6': 'And we feel that with the change in time and demand and the drop in membership for this type of use, there's a need to change the zoning, to acknowledge the changing conditions around this type of use generally and around this property specifically.'",
        "'speaker_6': 'And the consistency with neighborhood context, zone district purpose and intent has really picked up in the additional review criteria for PD. The first is whether the proposed zoning is consistent with the intent and purpose of PD, and that's spelled out in Article nine of the Denver Zoning Code.'",
        "'speaker_6': 'Essentially, a PD, as is, is justified or could be appropriate, where you're seeking more flexibility to respond to unique and extraordinary circumstances, and where in return for that flexibility, there are some significant public benefits that arise out of the PUD zoning.'",
        "'speaker_6': 'So in this case specifically, CPD has recognized the presence of unique and extraordinary circumstances. Obviously the existing eligible shrine building is at the is really the objective fact that makes particularly sub area a unique and special, but so does its geography.'",
        "'speaker_6': 'Surrounded by a golf course as well as the change in slope across of an over three acre parcel. These are not going to be divided into smaller zone lots. It's got to be treated as a whole. So there's some need for flexibility in the way the zoning should work here.'",
        "'speaker_6': 'Also to accommodate some of the needed street improvements resulted in the need for some flexibility in what would otherwise perhaps be standard zoning applied here. The whoever develops this will have to widen Vrain, Utica and West 50th Avenue to our minimum local street standard and improve it, which with curb gutter paving sidewalk tree lawn.'",
        "'speaker_6': 'And as a result, there's some eating up of what would otherwise be developable land area and some flexibility requested in return for the public improvements of some reduction and minimum lot with. So that's the type of flexibility in response to those circumstances.'",
        "'speaker_6': 'In terms of the quid pro quo and what the city of Denver gets out of flexibility and custom zoning with a PD, the significant public public benefits, obviously the mandated preservation of the entire eligible building, which is not something you typically see in a zoning ordinance, but which we negotiated in this case in the city's interest to'",
        "'speaker_6': 'see that building preserved. It does enable easier reuse of the shrine building while ensuring compliance with minimum architectural design standards and guidelines. Other public benefits include introducing at a fairly moderate scale more diverse housing choices, including the ADU, some limited number of apartment or condo units in the existing building, and duplexes where some exist in the Greater'",
        "'speaker_6': 'Berkeley Regis neighborhood, but not a lot exemplary pedestrian connections, amenities and considerations that comes into play with the siting of new homes in this development very sensitively to the golf course, not turning backs or building eight foot walls or putting the vehicle drive access abutting up against the golf course where flipping it so the homes present a'",
        "'speaker_6': 'friendlier face, whether it's backside or front side to the golf course, and then still resulting in a public benefit of compatible development patterns with nearby areas, particularly for the sub areas B and C and assuring in the PD that that is still a benefit.'",
        "'speaker_6': 'Finally, the remainder of the review criteria for compliance with division nine six standards and criteria have been and have all been addressed through the peu de development is not feasible under any other zone district and would require an unreasonable number of variances or waivers and conditions.'",
        "'speaker_6': 'CPD as fact finds that the multiple deviations in this party would result if we tried to craft them around a standard zone district and a lot of variance request or a lot of waivers and conditions. At that tipping point, a PED becomes a much more obvious zoning choice.'",
        "'speaker_6': 'CPD also finds that permitted uses in the PD are compatible with adjacent existing land uses, particularly in some areas B and C as a committed area. The single unit and duplex uses play well with what is existing in the surrounding blocks.'",
        "'speaker_6': 'The introduction of duplex and some limited multi-unit uses and sub area a are there to to add the density to facilitate the rehab and re-use of the existing shrine building and are compatible with what's immediately surrounding it, which is the golf course.'",
        "'speaker_6': 'Finally, permitted building forms are compatible with adjacent building forms or are may compatible through appropriate transitions. And through my previous description of all the PD standards, CPD finds that the proposed rezoning is consistent with this criteria as well and some.'",
        "'speaker_6': 'And thanks for your indulgence and a longer than usual presentation. CPD recommends approval at the PD.'",
        "'speaker_2': 'Thank you. Thank you. Kiran. All right. So we've got 22 speakers signed up for this. And so I'm going to say the first five and please make your way up to the pew so that we can try to make this as efficiently as possible.'",
        "'speaker_2': 'Bill Schwartz, Steve Childs, Glen Sibley, Charles Buck and Jeff Laws. So you five can make your way to the front pew. And Mr. Schwartz, you can go ahead and begin your remarks.'",
        "'speaker_0': 'Mr. President, members of Council, thank you first for staying so late to hear us out on this matter. I come to you as as the Treasurer of the Eligible Shrine Association, as the train, as a Shriners. I find myself in a very ironic situation standing in City Hall City-County building, asking for a rezoning to facilitate the sale'",
        "'speaker_0': 'of a building so that we remain financially solvent as an organization that was founded in 1887 in the Old City Hall down at 14th and Larimer. I look around this room and I see the preservation that has done and been done in a building that was built and broke ground in 1929 as our building was completed in'",
        "'speaker_0': '1929. I look around this room and I feel ashamed at what could be had we preserved our building to the best of our ability. However, I stand here also inspired by what can be when we reuse and repurpose our building.'",
        "'speaker_0': 'We feel that. We can be inspired by the people who have come to us to attempt to purchase our property. We had multiple offers on our property and we had the opportunity to hand select our buyers as people who are connected to the fraternity, as some of them have fathers or other family members who have been Shriners'",
        "'speaker_0': 'in the past. One of the purchasers of our building, his uncle, was a potentate of our fraternity in 1908. Our potentate is the equivalent of a president and most organizations. So we stand inspired by some people that are wanting to purchase a building that is a financial challenge.'",
        "'speaker_0': 'It has been a financial challenge for many years, as those of you who have been to it can see over the past several years, we have attempted to supplement our income to keep the property afloat by holding more events at our at our building.'",
        "'speaker_0': 'Unfortunately, those events have not proven to be profitable enough for us to be able to maintain the building at our current membership levels. Some of you have even attended events at our building and you have seen how large our events can grow inside of our building and the traffic problem that it can create.'",
        "'speaker_0': 'Once those events let out, what we are here today to do is we are here today to ask for your approval of PD g 11 so that the Shriners can move on gracefully to a new facility. Somebody with a vision and the means can come in to save this historical treasure and redevelop this property and commit resources'",
        "'speaker_0': 'into it that will eventually give back to the city and county of Denver. These resources, as CPD has stated in their staff report, will create infrastructure. They will add sidewalks and tree lines so that it becomes more pedestrian friendly.'",
        "'speaker_0': 'For those who have been out there, you know that west of 50th there are no sidewalks. This will add sidewalks so it becomes more pedestrian friendly. It will also add investment back into an area that has frankly been neglected by the Shriners for a number of years.'",
        "'speaker_0': 'Thank you for your time. I appreciate you staying late. Apologize.'",
        "'speaker_2': 'Thank you, Mr. Schwarz. Steve Childs and Mr. Childs, someone has allocated 3 minutes to you, so you have a total of 6 minutes.'",
        "'speaker_0': 'Thank you, Mr. President. Mr. President, members of City Council. My name is Steve Childs. My address is four six South Street, Denver, Colorado, and I am a member of the Shrine Preservation Partners CO Applicant.'",
        "'speaker_2': 'With the.'",
        "'speaker_0': 'Eligible Shrine Association. We are pleased to ask for your support for the beauty and proposed rezoning with the changes Tino Axelrod has outlined. I would like to focus my remarks on three important topics one process and the interaction with our neighbors.'",
        "'speaker_0': 'Two concessions we have made to ensure neighborhood content, context and tree preservation in the iconic shrine building. With respect to the process, we have worked hard to be sensitive to the neighbors and their concerns. We have held multiple public meetings, three design charrette, countless individual discussions with all of our interested neighbors.'",
        "'speaker_0': 'Starting in March of last year, prior to submitting an application for rezoning. We hosted three town hall style meetings in addition to these large meetings we have had. We've also met with smaller working groups to modify the proposed rezoning on as many as six occasions.'",
        "'speaker_0': 'Why I am why am I belaboring this? Because anyone who suggests to you tonight that this rezoning has been hastily pushed through or not enough attention has been paid to neighborhood concerns, is simply not being truthful. Majority of the neighbors either support or neutral on the zoning rezoning.'",
        "'speaker_0': 'Supporters include every neighbor who lives directly across the street from the site and who will be directly impacted. Mostly along and mostly mostly along 50th Avenue. Who have offered support or remained neutral. With respect to changes to ensure compatibility and context, we have agreed to substantial changes to what was originally envisioned for redevelopment of this infill parcel'",
        "'speaker_0': '. Originally, we envisioned multistory, pedestal style retirement apartments or condos for the site. But after meeting with several neighbors, we realized that there was no support for this. By our own calculation, we have reduced density from what was originally envisioned by over 150%.'",
        "'speaker_0': 'Importantly, before this bill was filed for city council considerations, we responded to our neighbors requests and agreed to the following one. A hard cap of 78 units across the entire site parcels A, B and C and the shrine building itself to no expansion to the shrine.'",
        "'speaker_0': 'Building itself on the exterior walls for four additional living units. Three. Only after a single family. And two. And only single family and duplex lofts can be built outside the shrine building. So that's only two buildings to a form.'",
        "'speaker_0': 'You may hear from some tonight that this rezoning allows too much density on a portion of the site. Those same people have made it clear to us that they prefer to see a shrine building torn down and only single family homes built on the site.'",
        "'speaker_0': 'The Shriners. My partners and I all disagree with this approach and prefer this and prefer the approach to preserves the shrine building and adds homes in and around it. No one can deny or hide the fact the parcel is not a precise replica of the nearby neighborhood pattern.'",
        "'speaker_0': 'In essence, it cannot be. The shrine itself makes PASSO a nonconforming with the neighborhood. In order to save and repurpose the shrine, more density is necessary and appropriate and appropriate. Parcel A has no immediate neighbors is surrounded on three sides by a golf course, sits below and away from the existing homes and has a massive looming building'",
        "'speaker_0': 'sitting in the middle of it. The duplex house for whom we have committed to will complement the shrine and prevent the row house canyons. The some of the neighbors have described as offensive. Please also note that we purposely designed parcels B and C to serve as a visual transition or buffer to the more dense parcel a.'",
        "'speaker_0': 'Beyond density. We made other significant concessions to address the concerns expressed by the neighborhood traffic due to the neighborhood concerns about traffic. We agreed to Alley Road and South Park. All housing in this development. We will also limit we will eliminate traffic down these dead end streets such as Utica and brain.'",
        "'speaker_0': 'No home will have street facing driveways or more ever. Even the city engineers did not require. We recommended we commission a traffic study to analyze traffic impacts. Our traffic engineer, charles buck of f h you is here tonight to address any questions you may have of him with regard to design guidelines.'",
        "'speaker_0': 'We have met, discussed and developed consensus guidelines with our neighbors that specify enduring and quality architecture and construction to match the neighborhood in order to put these guidelines into effect. We will restrict the deed.'",
        "'speaker_2': 'When the property is conveyed.'",
        "'speaker_0': 'To us. That deed restriction will establish an archway or metro district which which will become the enforcement mechanism for architectural guidelines. Importantly, this process will ensure the guidelines run with the land and are applicable not only to us, but every future owner of the property.'",
        "'speaker_0': 'I also want to point out that many other important design features requested by the neighbors are already embedded in the PUD requirements for incentives for pitched roof homes, landscaping, fencing requirements, setbacks to minimize sightlines to garages, limits on a number of units per building structure, height and massing limits, setbacks and that and unique bass baseplate, measurements and'",
        "'speaker_0': 'rear loaded garages. When combined with the design guidelines, these elements ensure that vertical development is compatible with and enhancement to Northwest Denver.'",
        "'speaker_2': 'Mr. Childs, your 6 minutes is up. Thank you. Next is Glenn Sibley.'",
        "'speaker_0': 'Good evening, Mr. President. Council members. My name is Glen Sibley. I address 2825 East Alameda in Denver. I'm a Denver native and my father grew up within blocks of the shrine building. I'm here to talk to you about the preservation of the shrine itself.'",
        "'speaker_0': 'The preservation and repurposing of this type of building is never easy. Conversion from an assembly hall to other uses. It's difficult by any standard. The eligible shrine has unfortunately outlived its usefulness. And. Is not cheaply or easily converted.'",
        "'speaker_0': 'I'd like to commend you to the language of the preservation language that's contained in the. Because it's very restrictive and prescriptive about what should be done to allow residential flats, either condos or apartments to be built within the shrine building.'",
        "'speaker_0': 'Preservation and repurposing is the smartest way, in our opinion, to preserve the historical buildings that become available for redevelopment. Historic designations are important, too, but often those provide a trap that leaves a vacant building, not reusable. For any other purpose.'",
        "'speaker_0': 'Once this rezoning is approved, we will begin in earnest to analyze the shrine and what is necessary to convert it to residential uses. I strongly urge you to vote in favor of this rezoning as it is the very best and only way to ensure another 100 years for the shrine.'",
        "'speaker_0': 'I'd also like to take a moment to read a letter that was prepared by Charlie Wyllie, the CEO of St Charles Town Company, with whom we've been working on the historic matters regarding this paddy. As I am regrettably unable to attend tonight's meeting of the Denver City Council, I am writing this letter to communicate Saint Charles Town'",
        "'speaker_0': 'Company's support for the proposed zoning of the eligible redevelopment in Northwest Denver. Over the past several months, Saint Charles has worked closely with Sheraton Preservation Partners on a development plan for the redevelopment of the eligible shrine and surrounding property based on the proposed zoning.'",
        "'speaker_0': 'Saint Charles has extensive experience in repurposing historic structures, including numerous preservation projects in the city of Denver over the past 20 plus years. We have a thorough understanding of the preservation covenants requirements in the proposed PUD and strongly support them on behalf of Saint Charles Town Company.'",
        "'speaker_0': 'I strongly urge the Council's support of the proposed zoning and of this important project so that we might continue to apply our historic preservation expertize in the redevelopment of this property. Thank you very much.'",
        "'speaker_2': 'Thank you, Mr. Sibley. Charles Buck.'",
        "'speaker_0': 'Good evening. My name is Charles back. I'm a traffic engineer with Helzberg Holten Olivier. I was hired by the applicant to do some limited traffic analysis for this proposed development. I'm just really here to answer questions, so I'll be available for that.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_2': 'Next is Jeff Laws. And as Jeff Laws comes up, I'm going to call the next five to the front pew. So those people who spoke, you all can go back to your original seats, Jim. So, Amy, I apologize for mispronounce that.'",
        "'speaker_2': 'David Ramirez, Philip House, Karen Harris and George Marino. And as those five are coming up, you may go home again.'",
        "'speaker_0': 'My name is Jeff Laws. I live at 5086 Vrain Street. I'm not an immediate neighbor, but I'm one house away. And I would also like to point out, as Mr. Lim simply stated, that all the neighbors are within three or 400 feet.'",
        "'speaker_0': 'So while there may be a couple of neighbors that are directly across the property that support it, there at least at least two that are immediately adjacent, that object. Our concerns are three in this case. And we would ask that you either take these concerns in consideration and tabled this motion for further work or decline it tonight'",
        "'speaker_0': '. The first concern we have is the preservation of the shrine. Shrine preservation partners trust but verify. When we got the planning board, we figured out that there was no language in the original PDS that had anything that would require the shrine to be preserved.'",
        "'speaker_0': 'It was sent back. To make sure that language could be constructed. And we now have language that says if the shrine is preserved, it must be done thus and so. However, if you read it carefully, there is nothing in there that says that it has to be preserved.'",
        "'speaker_0': 'We already have one white elephant in my neighborhood. It's called the Ilitch Theater. Often like the Lowenstein Theater, it was talked about for years about being preserved. In fact, it was part of a Peabody, but it sits empty and vacant today.'",
        "'speaker_0': 'Unless there is language inside the page requiring that actually be re utilized. We could end up with a white elephant at the shrine. Our second concern is that the density of the RH units in Zone A surrounding the shrine is completely unknown.'",
        "'speaker_0': 'This is because we do not have a site plan. It seems to me that any development proposal would be carefully considered with a site plan, and we have asked often and many times, why do we do not have a site plan?'",
        "'speaker_0': 'We're always told that this will happen later. Unfortunately happening later means that the public and this council has no input on what that site plan looks like. And so we actually know how many units we do not know how many units are h outside the shrine and how many units are condo apartments inside the shrine.'",
        "'speaker_0': 'That is a huge unknown. And we think that it should be a part of this pretty. The third issue that we would like to bring to your attention is design guidelines. Now, these fellows purport to say that they have a design guideline form that they have developed with input from the neighbors.'",
        "'speaker_0': 'The input from the neighbors consists of one set. Of documents that was given to them by our neighbor, Esther Kettering, and their original draft letter on what that might look like. The neighborhood has never agreed to the design guidelines and I'm finished.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_2': 'Thank you, Mr. Laws. Jim. And I can't say how to pronounce your last name, so I'll say thumbing.'",
        "'speaker_0': 'There goes Jim. Thumbing. Mr. President. Mr. President, members of the council. My name is Jim Thome and I live at 12. Excuse me, 1176 South Jackson Street. I am here. I am a member of eligible. But actually, I am also a practicing residential real estate broker.'",
        "'speaker_0': 'I have been in central denver for 40 years. The peu de approval process that you have before you allows a very significant infill site in denver that is basically a parking lot surrounding a wonderful old building that can no longer realistically be maintained to the style that the shrine would love to have it maintain and have this'",
        "'speaker_0': 'you d redevelop the entire site all at the same time. The density is appropriate for what is in demand in the city and county of Denver right now and what is desired by the people that want to find a home in the city and county of Denver but don't have many choices to find one.'",
        "'speaker_0': 'This move, this change of zoning, will move parking lots to residential taxpaying property. It will complete the access to one of Denver's premier golf courses with one of the neatest clubhouses there is. And it will influence the neighborhood in a way that over time will be positive.'",
        "'speaker_0': 'That will raise the bar for changes that invariably come to different neighborhoods over time, and it will allow it all to be done within a very short period of time, as opposed to piecemeal, like so many of the neighborhoods.'",
        "'speaker_0': 'Bonnie Brae, Cherry Creek. I was I showed the very first duplex built on Fillmore in Cherry Creek North when people said, What's that? And now Cherry Creek North is no, it's interesting, but it's a hodgepodge of design that is no longer a neighborhood for Denver residents.'",
        "'speaker_0': 'It's a lot of out-of-towners. And this is creating a neighborhood for new residents to come and find their home here in the city and county. Thank you.'",
        "'speaker_2': 'Thank you. Mr. Domingue. David Ramirez.'",
        "'speaker_0': 'Collective forgiveness here is gathering her comments more in line with Mr. Law than I'll follow up with her.'",
        "'speaker_2': 'Well, we don't want to change the order, but if you want to if you want to not give comments, that's fine.'",
        "'speaker_0': 'If you want to make a comment. But I think her comments more along with Mr. Laws and my comment would be more appropriate following her not understand.'",
        "'speaker_2': 'Unfortunately, we can't change the order. So you have the opportunity to speak. You can speak right now.'",
        "'speaker_0': 'Not a problem. Afternoon. Good evening, members of council. I'm a homeowner on the 5000 block of Utica at 5055 Utica. I resided on this block for 25 years and have lived in North Denver for 50 years. I've raised four children on this block who've attended neighborhood schools.'",
        "'speaker_0': 'I'm a retired district court judge in Denver. Prior to that, I was a county court judge in Denver, and my career started in the city of Denver as an assistant city attorney, where I supervise the prosecution and code enforcement division for the city.'",
        "'speaker_0': 'Since 2008, I've been employed as a hearing officer for the Department of Community Planning and Development. I have heard a variety of cases involving the Denver zoning and building code. Given an entire career interpreting the code, I've had the opportunity to preside over many cases involving the code in 30 years with city government.'",
        "'speaker_0': 'I have gained some knowledge and experience with the code, including zoning and building in my orders. There are three constants. One Make sure the law is correct as it applies to the facts to protect and consider the public health, safety and welfare of the community.'",
        "'speaker_0': 'And three, do no harm to the community. In my 30 years as a judge and now as a hearing officer for the department, I have been reversed a handful of times, including one of six actions to the District Court in hearing the cases.'",
        "'speaker_0': 'I find on average that the city is correct in its interpretation of the code. However, in many instances the department is wrong. Based on my experience with the city. It's clear that the development under the existing code is not justified.'",
        "'speaker_0': 'It's not consistent, and in my opinion, may not be legal. And I respectfully request that it either be denied, amended or delayed pending further review of all factors noted by my neighbors, including Mr. Laws and Ms.. Harrison. I'm grateful for having the opportunity to work for the city and county of Denver for the past 30 years.'",
        "'speaker_0': 'My career, like my home, is very special. Our neighborhood is unique given its location and bordering Woolas case golf course. It is a neighborhood that should be visited in person and not viewed on a map, a diagram, drawing or slides.'",
        "'speaker_0': 'It's important to note that 50th Avenue is the only access street to the area. All other streets are dead end. Even 50 of dead ends. Every street in their dead ends except 50th on the outside at Tennyson. Changing the width of the street will do nothing.'",
        "'speaker_0': 'They all will dead end after the fact. Currently there are events at the golf course and the Shriners Temple, and traffic is a public safety issue. Emergency vehicles have no quick access to the area. Imagine a 5 to 10 foot increase of the residential units given the same street, same street.'",
        "'speaker_0': 'Conflict of figuration and accessibility.'",
        "'speaker_2': 'Mr. Ramirez, I apologize. Your 3 minutes is up.'",
        "'speaker_0': 'That's fine. No problem. Thank you so much. Thank you.'",
        "'speaker_2': 'Next is Phillip House.'",
        "'speaker_0': 'Thank you, Mr. President. And city council people. My name is Phil Hawes. I'm a property owner in the city and county of Denver. 4444 Morrison Road. But I'm also a longtime member of the Shrine. I've been a Shriner for 38 years, and I have watched the membership grow from when I joined of 13,000 members down to 1300'",
        "'speaker_0': 'members. As you get older, your family moves away, you find that your house is too big. That is where we're at now. If we don't do that, the boards will go up on the windows and it'll sit there and be another Ilitch Gardens.'",
        "'speaker_0': 'So I encourage and I recommend that the city council look at this to redevelop this property with the developers. We've looked long and hard and worked with this developer, and I think that they will do what's right in the neighborhood.'",
        "'speaker_0': 'With that, I encourage you to support the passage of this. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Hawes. Next is Karen Harris. Ms.. Harris, you have 6 minutes. Thank you.'",
        "'speaker_12': 'My name is Karen Harris. I live at 5090 Utica. In addition to being a neighbor affected by this project, I am an architect who has been on both sides of the process of rezoning. I am probably committing professional suicide with this testimony.'",
        "'speaker_12': 'However, the process I have been involved in here is broken, and the result is a document that is flawed in many of the ways good urban planning and a predictable zoning code should guard against. I hope you had the opportunity to read the neighborhood report that was distributed last week.'",
        "'speaker_12': 'We know that it varies drastically from the analysis of CPD in speaking to the need to change the entire process. A difference in observations and interpretations contained in these two documents illustrates just one of the many problems with the proper process.'",
        "'speaker_12': 'There needs to be a transparent and well-defined public process that is moderated by a neutral party familiar with the Denver Zoning Code and the neighborhood. A neighborhood context and character report should be the initial basis of the entire process, not something that a neighborhood should have to find the resources to develop will have to defect when there'",
        "'speaker_12': 'are vastly different interpretations of existing conditions. There needs to be some defined mediation process to reconcile context before moving forward. Public meetings should not be run by the applicant, with only the applicant presenting information and supposed facts. The first draft of the code should not be written without CPD staff having visited the neighborhood.'",
        "'speaker_12': 'The peu de which becomes official zoning laws should be written by the city, not the applicant, and the city should be the entity that answers all questions of the zoning form and measurement. It should be up to the city, not the neighbors, to understand the zoning code and to insist on limited and necessary modifications and waivers to'",
        "'speaker_12': 'its provisions. It should not be the neighbors who must figure out that a preservation buddy has no preservation language in it, and that the applicants probably intended it that way. It should not be up to the neighbors to request that applicant planning board testimony be horrified as the Denver Zoning Code says it shall.'",
        "'speaker_12': 'Only to be told that the city is just fine with unlimited numbers of units built on a property with no open space and no other mitigating constraints. Up until right before this idea was introduced to the Planning Board.'",
        "'speaker_12': 'There was general agreement with the site plans and the project renderings that were being presented and a certain level of trust and good faith which created a reasonably civil discourse regarding this request for major rezoning. However, the applicant's refusal to supply or to supply.'",
        "'speaker_12': 'To simply right into the P. What they had promised and presented to the public has become a mystery as to the contents of the g 11 as written. Subquery is B and C may be sufficiently divine to assure the neighborhood and the city of what can be built.'",
        "'speaker_12': 'Although in hindsight, there was absolutely no reason to have that area included in the Pew D. Simply rezoning that area, with no exceptions, would have provided the consistency and the predictability D we seek, and it would have met the goal of state of stated in the Denver zoning code to limit unnecessary p pds and to the extent'",
        "'speaker_12': 'possible to to strive to get closer to the existing seven districts. Sub area a however, is a very different story. Not only is what is written in the yard a complete departure from the base zone district that is supposed to mimic it is contrary to the very premise of form based zoning code and within the super block'",
        "'speaker_12': 'it excuse excuse the basic urban design standards that are so valued elsewhere in the city, including front loaded garages on new private drives through sub area A with three stories and no setback on the facades with the surprise amendment of total units on the entire, would we have at least gone from infinity to a number?'",
        "'speaker_12': 'However, without a number certain of units outside this shrine building on sub area a it is still possible within the party to create a super block that is nothing but roofs, asphalt, concrete with no pedestrian connections, no street activation, and no transparent transparency.'",
        "'speaker_12': 'And in spite of the rhetoric induced that inducing two unit rowhouses changes things because there is no limit to how close they can be together. It does almost nothing to change the scenario. HQ unit rowhouse is not a duplex form.'",
        "'speaker_12': 'If it were, we could get rid of about 50% of the Denver zoning code. It allows. The only thing it does is it allowed to mark these as duplexes without the pesky requirements of creating a code compliant duplex form with the surrounding open space they require.'",
        "'speaker_12': 'If the idea of a beauty is to take a unique and extra extraordinary situation and create zoning that is predictable and consistent with the zoning parameters in the rest of the city and the Denver zoning code. This would fails to accomplish that task.'",
        "'speaker_12': 'At the very least, it needs an amendment to limit the number of units on some area outside of the shrine building. Thank you.'",
        "'speaker_2': 'Thank you, Mr.. Next is Jordan Moreno. And as Mr. Moreno comes up, I'm going to call on the next five. You can make your way to the front pew. Esther Kettering. Michael Hicks, Robert Schmitt, Dominic Lovely and Mark Brissenden.'",
        "'speaker_2': 'So you five can make your way up to the front pew. And Mr. Moreno, you can begin your remarks.'",
        "'speaker_0': 'Mr. President, members of the Council, my name is George Moreno. My wife and myself have lived at 3428 Westcott place for more than 20 years. We're both Denver natives. I'm a retired Denver public school teacher. I'm also a member of the shrine.'",
        "'speaker_0': 'I am pleased to be here tonight to strongly urge your vote to pass this PUD and rezoning for the shrine building and property. As many of you know, the eligible Shriners have a long and rich history in Denver.'",
        "'speaker_0': 'They have a substantial philanthropic presence in Denver for over 125 years. This redevelopment project is about preserving the rich history of the area while making a very positive economic impact to the Berkeley Regis neighborhood. And on a greater scale, the city of Denver.'",
        "'speaker_0': 'To take this thought a step further, the Berkeley Regis United Neighbors defines the Regis portion of their association as I-70 to 52nd Avenue and federal to Sheridan. Within this area, you will find single family homes, duplexes and even some row homes on Lowell.'",
        "'speaker_0': 'You might hear some in opposition speak to context as just their two streets as a limitation to the neighborhood. However, I feel that we should use the precedents from the Neighborhood Association of the already mentioned boundaries. We understand the importance of balancing the interests of everyone, which is why the development team agreed to design guidelines, limited density'",
        "'speaker_0': 'and did a traffic review to make sure that this development would ultimately fit into the context of this neighborhood. Some may suggest tonight that the entire neighborhood opposes this rezoning. However, this is not accurate. The most glaring example of this is that most of the neighbors on 50th Avenue who will be impacted the most by this project'",
        "'speaker_0': 'have written letters of support and or will speak in support tonight. Moreover, the residents that look directly west across the parking lot who may lose their mountain views have written letters of support and or will speak tonight. The density being requested at 78 for approximately six acres of land constitutes a small residential infill and is a significant'",
        "'speaker_0': 'reduction from the original proposal of approximately 250. The final density is less than one third the original plan. This is a significant compromise on behalf of the applicant and fits in nicely to the character of the Regis neighborhood.'",
        "'speaker_0': 'Pdg 11 reflects more than a year and a half of work by the Shriners and Shrine Preservation Partners, LLC. It is time to approve this Pudi and allow the Shriners to move gracefully to their new home and repurpose and reuse the beautiful shrine building again.'",
        "'speaker_0': 'I strongly urge your yes vote on this PUD and rezoning. Thank you for all that you do on behalf of all the residents of the city and county of Denver.'",
        "'speaker_2': 'Thank you, Mr. Marino. Esther Kettering.'",
        "'speaker_10': 'My name is Chester.'",
        "'speaker_5': 'Kettering and I live at 52 Utica Street. I am a commercial real estate broker and land developer.'",
        "'speaker_10': 'I have been involved with development.'",
        "'speaker_6': 'And sales of land for 38 years.'",
        "'speaker_12': 'Having developed and sold as a principal.'",
        "'speaker_10': 'Well over 12,000 acres.'",
        "'speaker_6': 'At least 2000 single family home sites.'",
        "'speaker_5': 'Several multifamily.'",
        "'speaker_6': 'Projects, at least three major industrial parks and many other projects, including a golf course.'",
        "'speaker_4': 'Never.'",
        "'speaker_10': 'In my.'",
        "'speaker_9': 'Entire career.'",
        "'speaker_10': 'Have I.'",
        "'speaker_6': 'Seen such a major change in density introduced into a stable.'",
        "'speaker_5': 'Predominantly single.'",
        "'speaker_6': 'Family neighborhood.'",
        "'speaker_10': 'With so little detail required.'",
        "'speaker_6': 'During the approval process? This, especially when site plan approval.'",
        "'speaker_10': 'Is simply.'",
        "'speaker_11': 'Administrative.'",
        "'speaker_6': 'Planning is intended to create predictability and to.'",
        "'speaker_9': 'Ensure a.'",
        "'speaker_12': 'Specific.'",
        "'speaker_5': 'Outcome.'",
        "'speaker_6': 'We as neighbors have virtually no assurance of any specific results from the proposed project except density. As to design guidelines.'",
        "'speaker_5': 'In our.'",
        "'speaker_6': 'Frequent communications with the developer. They produced a rather amusing set of documents that referred to things like Cape Cod style Moorish Spanish.'",
        "'speaker_10': 'Influences.'",
        "'speaker_6': 'That. Was almost.'",
        "'speaker_5': 'Comical.'",
        "'speaker_11': 'In an effort.'",
        "'speaker_6': 'To inspire a better quality design.'",
        "'speaker_11': 'Guideline effort.'",
        "'speaker_6': 'I produced some suggested language from projects I've developed in the past. Thinking that.'",
        "'speaker_10': 'This would inspire a better.'",
        "'speaker_6': 'Product. Alas, they simply copied some of the information verbatim in hammered it in to what they had already done. It's a far cry from the design guidelines that we had hoped for.'",
        "'speaker_10': 'It was better, however, than what they produced.'",
        "'speaker_6': 'As to.'",
        "'speaker_5': 'The neighborhood.'",
        "'speaker_6': 'Our density.'",
        "'speaker_5': 'Between Lowell and.'",
        "'speaker_6': 'Sheridan. I 70 and 52nd is under four due per acre and they are proposing 16. I respectfully request counsel, deny approval of this project and recommend re.'",
        "'speaker_12': 'Submittal.'",
        "'speaker_6': 'By applicant of a detailed PUD.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you. Mr. Kettering. Michael Hicks.'",
        "'speaker_0': 'Thank you, Mr. President. And council members. My name is Michael Hicks. I live at 23 one South Jackson Street, and I was approached by an architect to actually speak against this. After due diligence, I could conscious cannot speak against this.'",
        "'speaker_0': 'This group is doing the right thing. I've been to this hall. I was at an anniversary, 50th anniversary for my wife's uncle. And I will tell you, the Nietos and Guerrero's throw a heck of a party service. It was cold and the dance floor was full of beautiful Latinas.'",
        "'speaker_0': 'So it was something I didn't want to leave. I had a difficult time finding the eligible and I had a difficult time leaving the eligible for other reasons. But I will tell you, these guys have done the right thing.'",
        "'speaker_0': 'This developer has worked with the neighborhood. They have created a good process. They have also brought in some of the best people, the Davis Partnership Architects. It's an architectural legacy in Denver. Charlie Wooley, the equitable building, the officers quarters at Lowry, one of the best historical developers in Denver.'",
        "'speaker_0': 'They've done the right thing, and every time they listen and make concessions, this cheese gets moved. How long is a piece of string? How are we going to develop and infill our neighborhoods if we can't have good developers come in and have a process and a dialog with the groups surrounding the development?'",
        "'speaker_0': 'Denver deserves housing. This is a housing infill site. This fits with this neighborhood. This makes this neighborhood complete. I encourage you to pass this, to approve this, to do the right thing. Denver is on a dangerous path. In San Francisco, sometimes it takes ten years to buy a piece of property and developer.'",
        "'speaker_0': 'And do you know what it costs to rent an apartment in San Francisco? Or buy a home. This can't happen in Denver. You have to approve this development. They've done the right thing. They're good people. On a personal note, Councilman Brown, I know you're going to miss these hearings.'",
        "'speaker_0': 'So when you're done and your term is up on Monday night, you walk that couple of blocks to my house. We'll open a bottle of red wine and we'll watch Channel eight. Thank you.'",
        "'speaker_2': 'Thank you, Miss. Thank you, Mrs. Robert Smith.'",
        "'speaker_0': 'My name is Robert Schmid. I reside at 58 Utica Street in Denver, Colorado, adjacent to the eligible shrine property. Besides being a resident of that neighborhood, I'm also an architect and I am the past chair of Air Denver's Zoning Code Task Force during the discussions and work up to the implementation of our new zoning code.'",
        "'speaker_0': 'Members of Denver City Council, thank you for the opportunity to speak with you tonight about this important matter. My email to you all on January 16th outlines my concerns with adopting this podium. Those concerns exist on three levels a disregard of blueprint, Denver community planning and development, support of a flawed PWD document and creating a precedent that'",
        "'speaker_0': 'is destructive to Denver's established residential neighborhoods. First and foremost, this application asks for the establishment of a pad that would cause a development that is out of character with the existing neighborhood. The map on page 21 of Blueprint Denver 2002 notes The Berkeley Regis neighborhood is an area of stability.'",
        "'speaker_0': 'The plan strategy on Plan 20 on page 23 of that document notes, quote, Preserving and revitalizing neighborhood character has been a prevailing concern throughout the planning process. The need to direct and manage the location type intensity of future development is balanced by an equally strong desire to preserve those areas of the city with an established character, unquote'",
        "'speaker_0': '. It is further stated that area of stability phases two concerns character preservation and reinvestment. Although it is recognized that the Shrine property will be redeveloped, that redevelopment cannot damage or alter the context and physical fabric of an established neighborhood.'",
        "'speaker_0': 'My January 16th email also endorses the Green Utica 50th Street Neighborhood Report, which is in response to CBD Staff Report of 25 2014. Preparing and publishing this report was necessary in light of CPD's mismanagement of this matter throughout the entire public process.'",
        "'speaker_0': 'You have heard it tonight and from some who don't live anywhere near this site to one extent or another as to neighborhood support of this PD, making it seem that the applicant has addressed and satisfied concerns of the neighbors.'",
        "'speaker_0': 'Let's, however, be clear about the aspect of acceptance in one way or another, at one level or another, regardless of the depth of desire to preserve the existing shrine building in whole or in part. A majority of the neighbors oppose this PUD as written.'",
        "'speaker_0': 'Anyone coming before you saying anything differently is not being truthful with you. Besides the immediacy of this project's impact on my neighborhood, adoption of this PUD will set a dangerous precedent for future development in Denver that could occur in any of your districts to any of your established residential neighborhoods.'",
        "'speaker_0': 'I urge you to consider your vote tonight and vote not to adopt this PD. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Schmidt. Dominique. Lovely.'",
        "'speaker_0': 'I'm Dominic. Lovely. I live at 5000 Tennyson, probably the corner that is going to be most affected by the traffic of this redevelopment. But I do lend my support to the redevelopment. Currently, I have reviewed the traffic study that was put in place.'",
        "'speaker_0': 'That was my initial concern was how is it going to affect me and my neighbors on 50th and Tennyson? I didn't find the traffic study to be overwhelming, an overwhelming increase in traffic, especially when I look at, you know, all the traffic lights coming at me from sorry, all the car lights coming at me when the big'",
        "'speaker_0': 'events let out of trainers. Now, I'm also a fan of urban density and moreover, I'm a fan of considered urban density. I'm a fourth generation North Denver resident, and I think everybody should have the opportunity to live in this neighborhood.'",
        "'speaker_0': 'I have two young children who go to or who will be going to Centennial in the future. Centennial is a Title One funded school, and I look forward to knocking on every door of the 75 residents that will be there to help us improve the neighborhood.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you, Mr. Lovely. Next is Mark Brissenden. And before Mr. President speaks, I'll call up the remaining speakers Kristy Drum.'",
        "'speaker_0': 'Ellen Metter, Marv Greiner, Julie Eck.'",
        "'speaker_2': 'Jim Tarrant, Jeff Seaman and Sandy Schramm. So you can make your way up to the front pew. And Mr. Burson, you can begin your remarks.'",
        "'speaker_0': 'Thank you. My name is Mark Brissenden. I live at 45, 38. We're now in the court, so I'm not an immediate neighbor to the shrine. I live about a half mile south on the other side of Berkeley Park.'",
        "'speaker_0': 'And when I first heard about this project, I guess it was the density I was worried about. So I started looking at the neighborhood. The block I live on has about 25 or 30 units to the one block that's both sides of the street.'",
        "'speaker_0': 'And so I looked at some of the other areas. The most adjacent area to the shrine, which is the block between Tennyson and Utica, is actually less dense than that. It only has about 17 units, judging by Google Maps anyway.'",
        "'speaker_0': 'Now this project would be in an area that's just slightly larger than one city block, so the density there is going to be more than 60 units per block. So that's about three times what that adjacent block between Utica and Tennyson would be.'",
        "'speaker_0': 'And I think that's that's just too high considering that a zoning zoning should be trying to keep the neighborhood keeping the character of the neighborhood. And also, I don't think it's a good site for that kind of of very high density because of the fact that there's only the one road going in and out.'",
        "'speaker_0': 'It seems like there will inevitably be big traffic jams there at rush hour. And one other concern I have with the project is that there's no mention of trying to save the ballroom, which in my opinion is really the most historically meaningful part of the entire shrine.'",
        "'speaker_0': 'And he would I know it's probably not possible to say that, but it would be nice to have a plan that did that. So I would urge you to not grant the the rezoning now, but try and get one that has a density that's more in keeping with the neighborhood.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you, Mr. Brisson. And next is Christy Drumm.'",
        "'speaker_5': 'Thank you. I'm Christy Drumm.'",
        "'speaker_6': 'I live at 4435 West 50th Avenue, which is right at the corner of Utica and 50th.'",
        "'speaker_10': 'So every day when I look out my windows.'",
        "'speaker_6': 'I will see this new development.'",
        "'speaker_4': 'I share my neighbors.'",
        "'speaker_6': 'Concerns about the.'",
        "'speaker_4': 'Density. But the way I.'",
        "'speaker_6': 'Understand the process is.'",
        "'speaker_5': 'The pad.'",
        "'speaker_6': 'Is one step. And following this, the next step is the final.'",
        "'speaker_4': 'Site.'",
        "'speaker_6': 'Design, layout, approval and discussion, and that we will have the opportunity to have discussions and provide input. So as such, I support this, Peggy.'",
        "'speaker_1': 'And hope we can move forward.'",
        "'speaker_6': 'To those more detailed discussions. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Ellen Metter.'",
        "'speaker_0': 'I live in the Berkeley neighborhood and I do welcome new neighbors and investment in our neighborhood. I'm excited to see changes, growth and improvements in our neighborhood, which is in part unique for its blocks of older homes and yards and many now being rehabilitated.'",
        "'speaker_0': 'It's a very cool neighborhood. You got to come see it if you haven't been there.'",
        "'speaker_4': 'The number of units now being proposed is.'",
        "'speaker_0': 'Out of character for this neighborhood and reflects a much higher density.'",
        "'speaker_12': 'I feel that the density proposed for this development.'",
        "'speaker_0': 'Should be decreased.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you. Next is Marv Greiner. No. Mr. Greiner. Okay. Next is Julie EK.'",
        "'speaker_5': 'I'm Juliet. At 2301 Blake Street, I'm with Davis Partnership Architects, and I'm here to answer any questions that may be technically.'",
        "'speaker_4': 'Involved in the PD.'",
        "'speaker_2': 'Thank you. Next is Jim.'",
        "'speaker_0': 'Charette. My wife, Sandy Schranz. She's yielding her time to me. My name is Jim Strand. I have lived at 5036 Utica Street, adjacent to eligible Temple for 69 years, including 40 years of teaching at North High School. Our family has lived on the Hill for over 100 years.'",
        "'speaker_0': 'My grandfather, a founding member of Eligible, sold them this beautiful property for their shrine in 1925. Even though I've lived next to the shrine longer than any of my neighbors, I share some of the same concerns.'",
        "'speaker_2': 'I just want to apologize for interrupting, but just want to verify the account. The Secretary 3 minutes was not yielded to you so you don't have six. You only have three. So I just want to make sure you're.'",
        "'speaker_0': 'Aware of that. No problem. Go right ahead. Appreciate that. I feel like I'm back in the classroom. As I was saying, I share some of the same fears that my neighbors have had concerning the changes this product will bring to our quiet little neighborhood.'",
        "'speaker_0': 'In spite of these fears, we all need to accept three simple facts. One The shrine is committed to selling this property as they move to a new location. Two. This site will see new constructions soon. And three, the population of our neighborhood will increase.'",
        "'speaker_0': 'The only remaining question to us as a neighborhood is who will be responsible for carrying out this project and how will this be accomplished? This is where I feel very comfortable and confident in giving my support to this project as proposed by the Shrine Preservation Partners.'",
        "'speaker_0': 'This group represents our best chance for a sound, quality redevelopment of this unique property. This group has met with the neighbors many times. They have been very upfront with their plans and they've been very accommodating about making countless changes as relates to our wishes for this project.'",
        "'speaker_0': 'To date, 44 letters of support have been presented. I cannot imagine any other redevelopment group that would have been so willing to listen to us and then make changes to accommodate our wishes. As have the shrine partners. Therefore, my wife Sandy and I wholeheartedly support this over this overall plan for our neighborhood.'",
        "'speaker_0': 'Thank all of you. For the effort you put forth not only tonight, but every Monday night and throughout the week. And thank you for your vote of support for this project.'",
        "'speaker_2': 'Thank you. Thank you, Mr. Shrimp. Next is Jeff Seaman.'",
        "'speaker_0': 'Mr. President, members of council, I'm Jeff Seaman. I'm legal counsel to the developer applicant. And I'm here for questions only. Thank you.'",
        "'speaker_2': 'And our last speaker, Sandy Schramm. No. All right. We had 21 speakers. All right. That concludes our speakers, this time for questions from members of council. Councilman Brooks?'",
        "'speaker_0': 'Yeah. Hey, Mike. Yes. Thank you, Mr. President. I wanted to. Is Steve Charles still in here? I think you're one of the only speakers that didn't get you. Probably want to bring your notes.'",
        "'speaker_2': 'Because I want you to read that last.'",
        "'speaker_7': 'Page as you didn't get a chance to read. You're one of the only speakers. Didn't get a chance to finish up, I think.'",
        "'speaker_0': 'So I just wanted to hear your last testimony. Did you? I'm sorry. You wanted me to read the last email. Yeah, whatever. You didn't finish reading that picture.'",
        "'speaker_2': 'I think where we left off was a.'",
        "'speaker_0': 'Design guideline, so we got down to the shrine preservation. I think the preservation of the shrine. So indeed we have preservation language in this part which will ensure the historic shrine building is repurposed and usable for residential purposes, while at the same time preserving and restoring the unique and ornamental portions of the building original since 1930 and'",
        "'speaker_0': 'as bill drawings which are included in the piece. This flexible language affords us or allows us to enhance and improve the building to ensure that the Shrine Long remains an architectural icon of northwest Denver. Charles Boyer reports that the letter was proffered earlier this evening so for us was not able to be with us today.'",
        "'speaker_0': 'But we believe this reflects the changes needed to ensure the best use of the infill parcel which will allow us to repurpose the Shrine Temple for the next 100 plus years while at the same time improving and blending the property with the existing homes and neighborhood.'",
        "'speaker_0': 'There is no question that the restrictions in the property will ensure the redevelopment fits the context of the existing neighborhood. We remain committed to working and communicating with our neighbors as this process continues forward in the site plan review process on behalf of the African of Shrine Preservation Partners and our Coalition to the Eligible Shrine Association, we'",
        "'speaker_0': 'thank you for your consideration and urge your support for this rezoning.'",
        "'speaker_2': 'Thank you. Was Councilmember.'",
        "'speaker_0': 'Yeah. Thank you, Mr. President. Thank you.'",
        "'speaker_2': 'Thank you. Next, Councilwoman.'",
        "'speaker_0': 'Ortega.'",
        "'speaker_10': 'Thank you. I have several questions. And so I know there are other people that do. So let me try to just plow through them. First of all, I want to thank everybody for your patience in sitting through the previous meetings and for being here tonight so we can hear all perspectives on this issue.'",
        "'speaker_10': 'My first question, I believe, would probably be best directed to Tina Axelrod. So why, Tina, if you can tell me, why does this application have two separate sub areas, B and C?'",
        "'speaker_6': 'It actually has three.'",
        "'speaker_10': 'No, I know. But on that side of. I understand that. But why are those two two separate as opposed to one zone lot, for example.'",
        "'speaker_6': 'Two.'",
        "'speaker_10': 'I mean, this is a PDF. It's different than, you know, the traditional form based zoning that we now have.'",
        "'speaker_6': 'Really to align those different portions of the of the block with a standard zone district that aligned better with the with the proposed use primarily. There was a distinction between the two sub areas between wanting and allowing just single family in Sudbury to be versus allowing single family and duplex in Sudbury, SC So it's easier just to'",
        "'speaker_6': 'draw a line, create a sub area and make that distinction in use between the two primarily.'",
        "'speaker_10': 'Okay. My other question for you is about the the the traffic issue. The one road in there is a project similar to this. And this is the old mail well envelope company down by Cornerback Park. I believe that project had the zoning so it didn't come before this body to be able to be to allow the kind'",
        "'speaker_10': 'of density that exists there. Do you know how many units are on that particular development?'",
        "'speaker_6': 'I do not.'",
        "'speaker_10': 'Come to one. Monteiro, I know this is your district. Do you know how many are on that site?'",
        "'speaker_5': 'You think there's over 400?'",
        "'speaker_10': 'Okay. And that's one road in and out of that site. Okay. I was just trying to sort of understand that issue of traffic flow, if you will, on the land to the west of the site. Is. Wonder the the drawings that have been presented to CPD does that is that where parking for the eligible building is supposed'",
        "'speaker_10': 'to be? Where were they supposed to park that building.'",
        "'speaker_6': 'Under a future development or redevelopment?'",
        "'speaker_10': 'Under the redevelopment efforts being.'",
        "'speaker_6': 'Whatever gets developed and sub area A, the western portion of the PD has.'",
        "'speaker_10': 'To park it.'",
        "'speaker_6': 'So has to park itself within sub area according to the minimum parking requirements of the Denver zoning code.'",
        "'speaker_10': 'And the primary location to do that is on the West Side, correct? That's where the land is.'",
        "'speaker_6': 'If it could be if they were to do just surface parking. Yes. I understand there's capacity actually inside the shrine building to fit some structured parking as well. But that will be up to whatever specific development proposal we get.'",
        "'speaker_6': 'Generally got to park it to the minimum and it's got to be within the boundary, a sub area.'",
        "'speaker_10': 'Okay. So one of the challenges I'm having having been around when we did lots of different pwds is that we would normally this body would normally see a greater level of detail with a PUD application.'",
        "'speaker_6': 'Which is under the former Chapter 59. That's true.'",
        "'speaker_10': 'Right. And and so, I mean, I'm I'm understanding some of the uneasiness that some of the residents have with the lack of specificity of knowing exactly what's where. So one of the questions I have is how many units are going to be and how many units will be on sub area be and how many will be on'",
        "'speaker_10': 'on C?'",
        "'speaker_6': 'Can you we can theoretically answer that question. The easiest answers are in Sudbury, A, B and C, because given the proposed paddy zoning. Members. Sub Area B because of the minimum zone. Lot size of 6000 square feet generally.'",
        "'speaker_6': 'Okay. You could you could fit you could only get six zone lots. Maximum in sub area be single family is allowed so you can get six single family homes. You could also do for a separate dwelling unit. So in theory you can do up to a maximum of 12 or ten.'",
        "'speaker_6': 'Yeah, I can add six plus four equals ten in sub area B, that would be the maximum theoretical allowed. In Sudbury, AC, you also have a minimum 5500 square foot zone lot. You can get a maximum of above a five zone lots with the duplex use allowed.'",
        "'speaker_6': 'That's a theoretical maximum of ten units. So just in Siberia, B and C talking theoretically, if you're to max out your zoning entitlement, you could add six plus ten primary units plus four accessory dwelling units.'",
        "'speaker_10': 'So then that assumes the balance of that goes into.'",
        "'speaker_6': 'A then the balance, if you were to max out A and B leaves you with 58 units to be built in A, now there's nothing in the PDA that says you shall max out B and C, but theoretically, that's one 1 to 1 scenario.'",
        "'speaker_10': 'Councilman. I'll yield to others who have questions and then if you can just put me in the queue to turn back. Certainly. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega. Councilman Canete.'",
        "'speaker_1': 'Thank you, Mr. President. I have two questions. I'm going to start with Tina. First is, you know, there's a lot of concern about there not being enough design guidelines. But I wanted to just check with you. You said something very interesting during your presentation that there was a requirement for pitched roofs.'",
        "'speaker_1': 'Yes. How many zone districts or pads are you aware of where we require pitched roofs?'",
        "'speaker_6': 'I can certainly answer. And in regard to the standard zone districts of similar residential none. So that is a design standard unique that was added to this particular pad just for sub area B for those houses to be built on the zone.'",
        "'speaker_6': 'Lots closest to the existing 13 or 14 houses on that block.'",
        "'speaker_4': 'Got it.'",
        "'speaker_1': 'Another question that I heard was that there's nothing in the Pudi that requires any pedestrian access or infrastructure that you could have a super block of just structures and concrete. Can you speak to that?'",
        "'speaker_6': 'Yes, I can. We have site development standards that are found in the Denver zoning code as well as public works. Minimum standards for private access drives. And they would come into play. So definitely there will be sidewalks on West 50th as it gets improved through this project.'",
        "'speaker_6': 'So from Utica into sub area A that will be local street would sidewalks on at least the northern side that's under the that half of the public right of way is within the control of this development. There will be a private access drive to get into the interior or sub area a you need to have something there'",
        "'speaker_6': '. It's not going to be a local street. But, you know, at a very conceptual level, public works and fire have looked at this and have said, yes, we'll need essentially a loop road to create a you to get through an around the existing building into the if you're going to put houses right up against the golf course'",
        "'speaker_6': ', we need to be able to reach them. And that that would be a 20 foot wide driveway, paved travel way, plus a five foot attached walkway. There are also standards in the Denver zoning code for providing pedestrian connections through the site, particularly from Vrain and Utica.'",
        "'speaker_6': 'We have pedestrian entry requirements for all the residential buildings. That requires essentially a front door facing West 50th and rain and internally doors facing the private drive. Now, I think, to be fair, there's no maximum building coverage in some area like you would see in a single unit zone development on a single lot.'",
        "'speaker_6': 'Typically, there's a 37 and a half maximum building coverage on a 50 by 125 foot lot or a 6000 square foot lot. We don't have that in the Rowe home zone districts. So theoretically, yeah, you can build a lot of building, but by virtue of requiring the roads, the walkways, the utilities, there is a minimum spacing between'",
        "'speaker_6': 'buildings not in the zoning code but in the building code. That's generally a minimum of ten feet between buildings. You can't. Cover 100% of Sudbury, a land that you see today with building. Can it be a lot of hard surfaces while between building walkways, a private drive?'",
        "'speaker_6': 'Yes, but you're surrounded on three sides by green and open space. And everyone. Not every maybe not every unit will have direct access, but many of them will be looped around and accessing through their back door, front door, visually and around the edge.'",
        "'speaker_1': 'Mark Excellent. And then I have just one more question, Mr. President, with your forbearance. All right. So I heard the question about not requiring any preservation. And, you know, I went to the pub. So I want to just read to you a couple of the things that I see in the pub and make sure that I'm reading'",
        "'speaker_1': 'them correctly. So I'm in section 4.1.1, which is page six of 29 for council members. So subsection one says the exterior shall be retained. Subsection two says existing exterior design features and elements original shall be preserved and maintained.'",
        "'speaker_1': 'Subsection four says. Alterations shall not result in the voluntary demolition of the structure or cause damage or alterations other than those allowed. And there are some sections where things are allowed, such as removal of things that were added to the building later in time, you know, things like that.'",
        "'speaker_1': 'So I just I'm confused. So to me, when I read those three statements, it seems very clear that the language shall, shall be retained, shall be preserved, shall not remove, shall not demolish. So are you aware of any limitations to this language that I'm missing?'",
        "'speaker_1': 'Is there another section of the document that somehow says, no, not really. I mean, what what do you think that concern is coming from?'",
        "'speaker_6': 'I agree with your read of the PD that there is an an absolute requirement that the building be preserved and maintain. Now, it doesn't require and nowhere in our zoning does it require an owner or developer to take proactive action to rehabilitate it and reuse it.'",
        "'speaker_6': 'We don't require that in any of our zoning. We don't even require that in our landmark ordinance. The landmark ordinance has similar language you must preserve and maintain in good repair, not essentially let it fall into what's the word neglect and or let it deteriorate.'",
        "'speaker_6': 'Similar kind of bar out. Even though we're not landmarking the structure through the zoning, we're creating a minimum standard of minimum preservation. And so I don't. There's nothing else in the party that would take away from what you read.'",
        "'speaker_6': 'And yet and yes, there is nothing that proactively requires somebody to do something with this building. Once you start in, then everything comes into play in the zoning as to what's the ladder and not allow as to exterior alterations.'",
        "'speaker_6': 'They have a lot more freedom to do things inside.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Thank you, Mr. President. Those are my question.'",
        "'speaker_2': 'Thank you, Councilwoman. Next, Councilwoman Shephard.'",
        "'speaker_5': 'Well, thank you. Council president. So my first question was actually the one that councilman can each just asked and had answered. So that one's out of the way. The second thing is, I really want to go back to this discussion of areas of stability, committed areas versus areas of reinvestment.'",
        "'speaker_5': 'And I've learned a lot more about this during the discussion of this particular rezoning. So, Tina, if you could just go over once again the area like how an area of reinvestment is different than a committed area in an area of stability.'",
        "'speaker_6': 'Can I run and get my copy of Blueprint Denver?'",
        "'speaker_5': 'Please do.'",
        "'speaker_0': 'Oh, shit.'",
        "'speaker_6': 'Okay. I'm sure you all have this under your chairs, right? Okay. So, blueprint ever adopted land use plan? Now you can see I use it like other doctors. There's a number of areas where area stability as described generally.'",
        "'speaker_6': 'I'm I'm saying to you from chapter seven, which is called Areas of stability in areas of change. A lot of what Blueprint really focuses on and is what happens in areas of change. Granted, you know, in the overall scheme of the plan, there's there's a lot less detail perhaps about areas of stability, but there's still a robust'",
        "'speaker_6': 'discussion about areas of stability versus areas of change. Again, Blueprint says areas of stability is includes the vast majority of Denver, primarily the stable residential neighborhoods and their associated commercial areas where limited change is expected during the next 20 years.'",
        "'speaker_6': 'Right from Blueprint. The goal for the areas of stability is to identify and maintain the character of an area while accommodating some new development and redevelopment. And then there's a section on page 122 that talks about the types of areas of stability.'",
        "'speaker_6': 'That's what the heading is called. And it says While residents of many parts of Denver want to maintain the character of their neighborhoods, these predominantly residential areas do not have all similar characteristics. The areas of stability can be thought of as belonging predominantly to one of the following two categories committed areas and reinvestment areas.'",
        "'speaker_6': 'So committed areas are stable neighborhoods that may benefit from the stabilizing effects of minor infill development rather than large scale major redevelopment. For example, reinvestment in the Washington Park neighborhood is not necessary to improve its character. Tools appropriate for this neighborhood seek primarily to maintain present character and to motivate modest redevelopment of selected areas such as commercial'",
        "'speaker_6': 'corridors or neighborhood centers. Infrastructure, which is generally adequate, needs to be maintained. That's the general description of committed areas. They still face many different challenges. These committed areas, for example, some neighborhoods have primarily concerned about the transitions or lack of transitions between commercial and residential areas.'",
        "'speaker_6': 'Some neighborhoods are focused on traffic issues. Other neighborhoods are more concerned about replacement housing that has a design incompatible with the rest of the neighborhood. The challenge in these latter neighborhoods is to preserve character without preventing residents from upgrading their homes to meet contemporary standards.'",
        "'speaker_6': 'That's the end of the description of committed areas and Blueprint Denver on page 122. Then it goes into a description of reinvestment areas, reinvestment areas or neighborhoods with a character that is desirable to maintain, but that would benefit from reinvestment through modest infill and redevelopment or major projects in a small area.'",
        "'speaker_6': 'These areas would encourage investment, but in a more limited and targeted way than in areas of change. Residents in these areas face a variety of challenges and opportunities. Examples of challenges include concern about deteriorated and poorly maintained housing stock, inappropriate land uses, or inadequate buffering between uses, lack of services, lack of curbs and gutters and other infrastructure'",
        "'speaker_6': 'and maintaining affordable housing. Opportunities for improvement in reinvestment areas can also vary widely. Examples include redeeming vacant land for a neighborhood park or redevelopment. Redeveloping underutilized land to provide needed services. Blueprint Denver, however, does not identify specifically committed areas or reinvestment areas.'",
        "'speaker_6': 'Tools are provided in this plan for both approaches. The appropriate tools for each neighborhood can be selected to deal with a single issue or multiple issues through a small planning process, for example. In fact, many neighborhoods contain a mix of these types of committed and reinvestment areas and will not cleanly fit into the into either of these'",
        "'speaker_6': 'approaches. That's my reading to you.'",
        "'speaker_4': 'Not mapped.'",
        "'speaker_6': 'It's not map. No.'",
        "'speaker_5': 'It's something that is determined. How like.'",
        "'speaker_6': 'Ideally.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_6': 'E a for a planning process.'",
        "'speaker_5': 'Through a site like.'",
        "'speaker_6': 'For example, through a small area plan. So you've seen a number of small area plans come before you in the last few months. And those are essentially taking a closer look from the Blueprint 30,000 level of areas that change their ability to start breaking down into smaller, more to the ground level of where change should occur and'",
        "'speaker_6': 'what that change should look like even within an area stability. Here, we're presented with an application for a change in zoning to a small area, five and a quarter acres within a larger neighborhood, Regis or Regis, Berkeley. And being asked to consider whether reinvestment of the type enabled by this zoning is appropriate.'",
        "'speaker_5': 'Okay. Thank you for that very detailed response.'",
        "'speaker_2': 'Be good counsel. Thank you. All right. Next, we have Councilwoman Fox.'",
        "'speaker_9': 'Thank you, Mr. President. I had a question for each side. First of all, was it Mr. Sibley who read the letter from Mr. Wooley? Who was that?'",
        "'speaker_0': 'Yes.'",
        "'speaker_9': 'Is as Mr. Sibley still here?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_9': 'If you could come to the microphone. I have two questions on this issue. First, I'm a little confused about how Mr. Wooley fits into all this. Is he going to be the developer?'",
        "'speaker_0': 'Mr. Wally has helped us and guided us in this process, and he may or may not be the developer of the developer of the shrine itself.'",
        "'speaker_9': 'Okay, then I do have a second question. Has there ever been discussion of any type with any suggestion of ways to access public money for this development?'",
        "'speaker_0': 'No, we have not.'",
        "'speaker_9': 'Thank you. And is Mr. Ramirez still here? No, no, no. Then I am going to just pose this question to the people who were who were in opposition, because it was very curious to me, although people can claim this all the time, I really wanted to know what the rationale was in Mr. Ramirez comment about his comment'",
        "'speaker_9': 'that he felt that this period could be illegal. And I wanted a legal explanation of why he thought it would be illegal. Is there anyone who could speak for him in his rationale?'",
        "'speaker_2': 'Hmm.'",
        "'speaker_9': 'And let's move on.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Rob. Councilman Brown tried to chime in, but his name didn't pop up as okay if I put him in.'",
        "'speaker_4': 'I'm happy to yield.'",
        "'speaker_2': 'Go ahead, Councilman Brown.'",
        "'speaker_0': 'I'm in trouble now, Bill. Couple of questions on the your is a reminder to my colleagues Bill Schwartz was the first speaker tonight. How long was this property? How long was it put on the market? And was it listed with a realtor?'",
        "'speaker_0': 'How was it sold is what I'm getting at. It never hit the it never hit the market. We had three answer unsolicited offers within a matter of two weeks. And it was, you know, for the two by four to the forehead that said, hey, there are people interested in this property.'",
        "'speaker_0': 'And we evaluated all three offers and chose who we chose for the reasons. So the word got out, obviously. Absolutely. It's a it's an iconic property. So just as soon as they heard the shrines for sale, we I fielded a number of calls from realtor since then.'",
        "'speaker_0': 'Commercial realtors. What is the stacks tax status that you were five or would three see? We're not a5a1 seat three. We're what we are a51c ten domestic fraternal corporation. However, the building is held by a5a1 seat two, which is a property holding company for a domestic fraternal corporation.'",
        "'speaker_0': 'All right, let's get right to it. Are you paying property taxes? No. We have not paid property taxes since we bought the property in 1924. So we can talk about change and that will be a change. That will be a very large change.'",
        "'speaker_0': 'We welcome that change in terms of taxes, I can assure you. What happens if this fails tonight? What are the the plans of your organization? The plan is to scramble like mad. We have we've scrambled for the past three years.'",
        "'speaker_0': 'We've had additional events held at our facility over the past three years to attempt to supplement. We have failed miserably at that. We're a fraternity that operates a philanthropy. We're not event managers and we're not facility managers. And it's very sad to say, but we've lost about $300,000 over three years trying to operate this facility and trying'",
        "'speaker_0': 'to maintain it. It's just not working anymore. We just financially cannot continue to bleed that kind of money. And finally, of the three prospective buyers, why this outfit? The first one came to us and he had a very vague plan and he made actually a higher offer with a 30 day cash close.'",
        "'speaker_0': 'And he said we asked him what he wanted to do with it and he said, I think I'm going to live in it. And to us, we've been very good stewards of our properties in the past there at 18th and Sherman, which is still a is known as the eligible mosque.'",
        "'speaker_0': 'That was our first building. And now this property, we've been very good stewards of our property and we did not want to dump the neighbors with a person that we didn't understand their own plan. We didn't know what their intentions were.'",
        "'speaker_0': 'We didn't want to just take the money and run. We've been invested in this neighborhood since 1924. So that, combined with the connection of the three folks that we chose, are all Denver natives. One, they've graduated from high school here.'",
        "'speaker_0': 'They've spent a lot of time here, not to mention the connection. One of them, his uncle, was the president of our organization in 1908. And the other two, they have family members and fathers who were Shriners. And so that personal connection that we have, shrine family, what we would consider shrine family involved in the and the redevelopment'",
        "'speaker_0': 'of our building gave us a warm enough feeling that we chose to go with them rather than more money. Interesting. Do you guys have a secret handshake, Ernie? We might have a great answer for the walls of the old city hall to talk, huh?'",
        "'speaker_0': 'Well, thank you very much.'",
        "'speaker_2': 'Thank you, Councilman Brown. Next is Councilwoman Rob Bell.'",
        "'speaker_4': 'Typically, this is going to be very boring after Councilman Brown's questions. This is really basic. But I want to understand some Area B and I don't know Tina or Steve or Glen who wants to answer this. But some area B, you got that alley running east.'",
        "'speaker_4': 'West is the one right next to the homes. How do you access a rear garage or do those houses that I assume face the street have curb cuts?'",
        "'speaker_6': 'The PD and sub area B does the zoning does require a vehicle access from the rear of the zone lot. So it's either got to be from a public alley or not not the rear. I'm sorry. Let me try to strike that.'",
        "'speaker_6': 'Let me answer. The zoning requires for sub area B that vehicle access be taken from either a public alley or a private access drive, and it cannot be directly from Raine or Utica.'",
        "'speaker_4': 'So there there might also be a North-South drive.'",
        "'speaker_6': 'Exactly.'",
        "'speaker_4': 'Yeah. That dead ends.'",
        "'speaker_6': 'It'll be a private driveway, essentially. That's what the zoning backs you into.'",
        "'speaker_4': 'And so the reason I ask is so all of the those are the single family lots. Correct. All of those will face either rain or Utica.'",
        "'speaker_6': 'Correct.'",
        "'speaker_4': 'Okay. I didn't realize there was that much width there, but. Okay, I got that. Then I wanted to go back to the design guidelines. And Juliette, did Davis partnership write the design guidelines? They did not.'",
        "'speaker_2': 'Could you come to the podium, please?'",
        "'speaker_4': 'Because I know, at least with one of the developers at ninth and Colorado Davis was working on the way we worked on that was we were.'",
        "'speaker_5': 'Not hired to work on the design guidelines for this project. The three partners.'",
        "'speaker_4': 'Worked up with that on those guidelines. And and so Tina, why aren't these design guidelines in the PUD? As Robin said, the pitched roofs, there are things that address design in the PWD, but these particular design guidelines.'",
        "'speaker_6': 'Well, typically, as as council members might be aware, we don't get to the level of detail of architectural style which we understand and qual and minimum quality materials for residential buildings. In our zoning, we haven't treaded into that territory.'",
        "'speaker_6': 'And so it felt more like the domain of design guidelines. And you know, in those design guidelines typically are done outside the zoning code. Sometimes we do for large reinvestment or redevelopment areas. You know, draft city required design standards or guidelines.'",
        "'speaker_6': 'But that's typically because there's guidance specifically in a plan or guiding document like a GDP or a small area plan to get us to design guidelines. We didn't really have that call here for something above and beyond what the zoning would require in terms of building form and massing and scaling beyond what we took.'",
        "'speaker_6': 'We've put in the in the pad so we didn't feel a need for city adopted design standards.'",
        "'speaker_4': 'I appreciate the difficulty. If you go back to the old style PD pre new Denver zoning code, sometimes we did write materials in it and then there still was such a broad range. We got something called Don't in Colorado, but I'm commenting, I'm just trying to I had another question along that line.'",
        "'speaker_4': 'Could someone from the project talk to me about the design guides guidelines and give me some specific because we don't have a copy of them here. I hear they're to be recorded after the transaction. And I, I really I heard some comments that weren't positive about them.'",
        "'speaker_4': 'So I'm curious. Well, what's in them that's.'",
        "'speaker_0': 'Are we we. Crafted design guidelines to be relatively simple and straightforward. Ms.. Kettering commented on those, and she was correct in saying that we inserted her comment to our design guidelines verbatim into those design guidelines. We have suggested that we, prior to putting those in place, will continue to work on those.'",
        "'speaker_0': 'I would agree with the comment that while they're not perfect, they're our best effort to get something done that made sense to us and preserves the. Character of the neighborhood by prescribing materials and building forms and the like.'",
        "'speaker_0': 'That makes sense. But in looking at, for instance, the Denver Tech Center guidelines, which go close to 100 pages, I think we did not become that prescriptive.'",
        "'speaker_4': 'Yes, some landmark neighborhoods have guidelines, residential landmark areas, and I would hope there'd be a little bit like that trying to match materials to what's there. But while I have you there, Glenn, in terms of working with Charlestown Company on the restoration renovation of the Shrine, have have you discussed grants from the Historical Foundation?'",
        "'speaker_4': 'Historic tax credits, both of which would require some level of designation.'",
        "'speaker_0': 'We have discussed that we haven't made any applications as we don't own the property yet.'",
        "'speaker_4': 'And does that still remain a possibility?'",
        "'speaker_0': 'Absolutely. Charlie has given us good guidance on that, that that is possible. We have not assumed that that would occur because we can't really make that assumption going in. But we we're going to explore those opportunities thoroughly.'",
        "'speaker_4': 'Okay. And then, Mr. President, if I could just continue, because it sort of addresses things I've read or that were said tonight. This is for Tina. Thank you. Oh, Mr. Sibley. One of the letters I read just today talked about why do we why are we using the Urban Rowhouse District as a model in Area A?'",
        "'speaker_4': 'I should have looked this up before I came. Do we have an Edge Rowhouse District? You know, I think of the townhomes along Mayfair Park, which is in sort of an edge area.'",
        "'speaker_6': 'We have an edge town townhouse zone district. Do we have an edge? I'm looking at a fellow colleague because I can't I don't have the book and I can't remember. Is there an edge row home? No.'",
        "'speaker_4': 'An edge has a townhouse. Different townhouse.'",
        "'speaker_6': 'The townhouse building for is different from the townhouse was more suburban form it. It tends to allow garage facing primary facade, you know garage doors on the primary street facing facade. And that's probably the key distinguishing factor. It still requires an individual entry to each unit.'",
        "'speaker_6': 'So it is attached to single family attached. But that's the primary difference is that's a little shorter.'",
        "'speaker_4': 'That's helpful. And I'll address that in my comments. And then finally, you limited the you RH to two units in Area A, but is Garden Court still a form allowed and how can a garden court have only two units?'",
        "'speaker_6': 'You can still have a garden court. It would just be it would likely be surrounded by more than two duplex structures, if you can imagine, you know, maybe you would have had a row of six units in a row, six units facing a court if you broke up.'",
        "'speaker_4': 'I see two, two to 2 to 2.'",
        "'speaker_6': 'You can still do a garden court.'",
        "'speaker_4': 'Okay. I know those are all technical, but it really gets to how the technical things address that concerns. So thanks. Okay.'",
        "'speaker_2': 'Thank you, Councilwoman Robb. Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. I was also curious about the Urban Rowhouse Zone District and how that differed in some areas. And I'm glad I'm glad that you asked that question. Councilman Robb. One of the questions, and I think I may have missed it in your comments and this is from Bill from the Shriners.'",
        "'speaker_8': 'I'm curious, the gentleman talked about the Latinas in there dancing and having a good I've spent a lot of time community events. You had a lot of local artists come from all over the place doing things like that.'",
        "'speaker_8': 'I know it gets packed at times and there's a lot of traffic in the neighborhood. And then you do have a lot of you know, sometimes it's a small event, sometimes a huge event. And I've been there for both.'",
        "'speaker_8': 'When how often do you have those had those big events and how many cars show up estimated that are parked either on the property in the lot or even in an adjacent street?'",
        "'speaker_0': 'I can tell you that over the past year we had approximately seven events that went over 600 people. And if you take a look at what our building is actually approved by the fire marshal for its 1485 people.'",
        "'speaker_0': 'However, our current PD 273 only requires 325 spots. So you do the math real quick. 1485 people allowed in the building, 300 spots for cars to park. So the rest of the cars spill out into rain. Utica, 50th across Tennyson.'",
        "'speaker_0': 'We've actually had people as far away as about a half mile last year, aka mechanical held of a company conference there. And every single one of their people, I think, drives a company owned vehicle. And we had about 800 of their employees there.'",
        "'speaker_0': 'And so we had about 675 cars everywhere, and they walked from the neighborhood and they're very intrusive when we do have large events.'",
        "'speaker_8': 'Okay. And so and I'm trying to figure out how many cars are we planning for? And me and I don't know if this is a question for Tina. And I think you said something earlier. I didn't get to write it down partly because I was I was trying to figure out where you have your little hat with'",
        "'speaker_8': 'your fares man and the little go cart. I don't know where that is, but I was trying to figure out where you put that so I can cruise it around while you were in here.'",
        "'speaker_0': 'But.'",
        "'speaker_8': 'Couldn't find it. However, I do have a question, Neal. Thank you. I do have a question as to how many how many parking spaces are we looking at with this particular zone district? How many would the capacity be?'",
        "'speaker_6': 'The minimum parking requirements, default to the standard zone district requirements. So for multi-unit dwellings, for example, in the existing building, if those were to be carved up into individual dwelling units, multifamily dwelling units in a urban row, home zoned district, anyone have their zoning code with them by chance?'",
        "'speaker_6': 'I don't know why. Kyle Dalton from our our department does.'",
        "'speaker_8': 'A black binder. Wow.'",
        "'speaker_6': 'I have the plan. He has the code. We make a good team.'",
        "'speaker_8': 'I mean, you don't have to be exact, but just an estimate, I to know what I'm trying to figure out.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_8': 'Kind of like capacity or something similar. And if it's actually.'",
        "'speaker_6': 'It's it's not going to be as many as 325 I don't think.'",
        "'speaker_8': 'But it won't be 600 either, right?'",
        "'speaker_6': 'No, you only you need one. Thank you. A minimum of one parking space per dwelling unit for the multifamily. You need one parking space for each of the duplex units in a structure. If you do purely single family development, the code and all zoned districts, including the PWD, it doesn't have a minimum parking requirement.'",
        "'speaker_6': 'But as you know, most market built single family homes provide at least one or two spaces.'",
        "'speaker_0': 'Pointed at me. Okay.'",
        "'speaker_8': 'And the half would probably go for the go kart. So there we have it. Anyway, thank you very much. I really appreciate that. So I really appreciate that. And Bill, thank you for answering that question as well, too.'",
        "'speaker_8': 'Thank you, Tina.'",
        "'speaker_2': 'Thank you, Councilman Lopez. Councilman, no data.'",
        "'speaker_10': 'Okay. So I just have to ask questions that were not asked. So the first one would be for Tina. So since the design process is separate from the zoning, can you explain the process and the inclusion of neighborhood input into that process with.'",
        "'speaker_10': 'Your department.'",
        "'speaker_6': 'Sure. Correct me if I'm wrong, but I think you're referring to the site development plan review process that would follow the zoning entitlement. And when a specific.'",
        "'speaker_10': 'Esthetic to the design guidelines and where the neighborhood wants some input into the design guidelines, which, you know, I heard some of those got included in the EPD application, but there it sounds like that was a recommendation from one person, but it didn't really have broad input from the neighborhood.'",
        "'speaker_10': 'And because it is a separate process, I want to know.'",
        "'speaker_6': 'Okay, I'm going to have to defer to the applicants to respond because they're not part of the zoning. So wouldn't be picked up in any subsequent site development plan review or zoning review by the city, any design guidelines that are attached as covenants to the land and administered and enforced by nature.'",
        "'speaker_6': 'We are outside the city process, so I would have to defer to them to suggest what the vehicle and what that review process would look like.'",
        "'speaker_10': 'So who wants to take that one?'",
        "'speaker_0': 'Mr. SEMA Yes, thank you. Councilwoman Ortega. The design guidelines that have been developed to date are posted on the website for the project.'",
        "'speaker_10': 'Our commitment to the neighborhood know where to access that if they want to submit.'",
        "'speaker_0': 'I believe so and I'll give it to you. It's W WW Shrine Preservation Partners AECOM. Cleverly enough, those design guidelines were developed, we thought, in concert with at least some of the neighbors. I think just in the last week and tonight, we've heard for the first time that they aren't considered to be sufficient.'",
        "'speaker_0': 'I think I can speak on behalf of my client, the developer, that we will continue to work on those much more important and work on those with the neighborhood. Much more important, though, our commitment to the planning commission, planning board, to you folks, to Councilwoman Shepherd and others has been that when the property is conveyed from the'",
        "'speaker_0': 'Shriners to the developer, we will restrict the deed to require that those design guidelines be enforced no matter who does the vertical construction. So if we do the vertical construction or we sell individual lots, those design guidelines will apply and they'll be enforced by either a nature way that's established or a metro district that way.'",
        "'speaker_0': 'Or Metro District will likely also have a design review committee, which will include at least one neighbor, and that will give the neighborhood yet another opportunity to have some input on what that vertical development looks like in the end.'",
        "'speaker_10': 'So I'm talking about the front end though, and I listen pretty carefully to all of the input and I heard that there is a concern that. There really hasn't been. And I know you all have had a pretty lengthy process of talking with the neighborhood, but I heard some concerns about not really being able to weigh in'",
        "'speaker_10': 'on the design guidelines. It sounds like most of the discussion was more around density and preserving the building and you know, all of that stuff. So, so that's where I was going. And I thought I had heard Tino mention that there was a separate process with the city.'",
        "'speaker_10': 'So that's part of why I'm asking this question about where is there the opportunity for additional neighborhood input into the design so that you all reach that you know, that comfort level with one another on on where this goes with the design.'",
        "'speaker_0': 'There is no formal process for that. But I can speak, I believe, on behalf of the development group and commit that we will continue to work with the neighbors on those design guidelines. Again, it comes as some surprise to me that there's this much consternation about those we did, we thought, develop those in concert with neighbors who'",
        "'speaker_0': 'were interested in participating. I've seen a number of letters in the last week that suggest perhaps we didn't include enough people. You're right. We did spend a lot of time on density and other matters, but I'll be happy to commit my developer client here to continuing to work with the neighborhood to refine those design guidelines so that'",
        "'speaker_0': 'they meet everybody's satisfaction.'",
        "'speaker_10': 'Okay. And I have one last question. And, Mr. Sibley, are you a representative of the development team? Okay. Would you mind coming to the microphone, please? I don't recall hearing anything about what the mix was of the housing units in terms of how many are proposed to be sales versus how many would be rental.'",
        "'speaker_10': 'Are they all proposed to be for sale units? Can you speak to that?'",
        "'speaker_0': 'All of the units that will be built in new construction are planned to be for sale units.'",
        "'speaker_10': 'Okay.'",
        "'speaker_0': 'So units in the shrine, which would be up to 19 units, I think we have in there to 20, would be the maximum in the shrine. We haven't made a determination on whether those will be for rent or for sale.'",
        "'speaker_10': 'So 19 to 20 units only would be in. Am I hearing you say 19 to 24 sale units would be in the shrine and then the remainder would be rental? Now we understand what that means because.'",
        "'speaker_0': 'Units in the shrine.'",
        "'speaker_10': 'Because when I asked about numbers earlier, I heard that we probably are looking at somewhere in the ballpark of 20 on site A and B, I'm sorry, say B and C and then on A, which is the building we're looking at, probably more like 58 units in the building, unless I understood.'",
        "'speaker_0': 'That 58 units on the site in total in segment eight.'",
        "'speaker_10': 'So am I hearing you say that Segment A can have development on the site in addition to what will be in the building?'",
        "'speaker_0': 'Yes.'",
        "'speaker_10': 'Okay. That wasn't really clear during the presentation to me earlier. So that's why I'm asking these questions. So given that you're looking at. The majority of these units being for sale. You know, we have an inclusionary housing ordinance that covers for sale units.'",
        "'speaker_10': 'Yes. So can you speak to what that commitment is to the affordable units?'",
        "'speaker_0': 'Well, our our current plan was to and our current forma suggests that we will opt out and pay the opt out fee for that. We are meeting later this week, although I saw an email that may have changed that meeting with Paul Washington and his group at the Economic Development Officer, the mayor.'",
        "'speaker_0': 'And we are going to discuss how we might approach that either in the opt out or by placing units on the side.'",
        "'speaker_10': 'So it's not clear whether you're going to do them on site or I heard you say your preference would be to do the opt out.'",
        "'speaker_0': 'Well, our current pro forma suggests will opt out. That's nothing to do.'",
        "'speaker_10': 'Yes. Okay. Thank you. I have no further questions.'",
        "'speaker_2': 'Thank you. Can you guys want to take a capsule in Rob's back up.'",
        "'speaker_4': 'Thank you, Mr. President. One final round of questions. I was looking at the staff report because a lot of the communication I received is refutes the staff report. And as you go through the areas of stability piece that Councilwoman Shepherd was asking about, you point out the blueprint.'",
        "'speaker_4': 'Denver in this is page 17 of the staff report for council tonight. Blueprint Denver provides guiding principles, respect value development patterns, relationship of building to street location a garage driveway got that respect valid attributes of an area, existing buildings, those adding distinctive character.'",
        "'speaker_4': 'I get that. Expand transportation choices in the following one Minimize traffic impacts on neighborhood streets, including less cut through traffic. After you go through that, just a couple more bullets. I won't read it. Says it. CPD Staff Finds the proposed rezoning furthers the above goals.'",
        "'speaker_4': 'Can you address the thinking on the transportation piece? Those two bullets about expand transportation choice in minimize traffic impacts.'",
        "'speaker_6': 'Okay after preface response to your councilwoman Robb with there's only so much that zoning can do to implement our plans.'",
        "'speaker_4': 'Right. That's fair. I, I thought about that as a possible answer.'",
        "'speaker_6': 'Okay. To the extent that zoning has jurisdiction and and influence on on implementing the principles that you cited from Blueprint Denver as to future land use and development, you know, expand transportation choices, including access to transit, I would have to say, admittedly, this proposed zoning in its place doesn't do too much to expand the actual choice of'",
        "'speaker_6': 'transportation. The choice of transportation is there. Is there. And it's not going to change by virtue of this development. There is there is transit. There is a bus line of 50 that which stops at 50th. And Tennyson is the 52 line.'",
        "'speaker_6': 'It's not high frequency service, but it's regular service. And it does bring folks from the far reaches of northwest Denver and Adams County into downtown and beyond. You know, the addition of people at the shrine property, you know, would have the choice of using transit to come downtown.'",
        "'speaker_6': 'Certainly busses there doesn't do much to expand the choice. You know, if you're reading it that way, minimize. You want to talk about the other bullet or. Yes. Minimize traffic impacts on neighborhood streets, including less cut through traffic.'",
        "'speaker_6': 'Well, here there's there's really one way and one way out, which is West 50th. There are some existing homes there that will, you know, will be on 50th after this development comes. And it's not creating cut through traffic.'",
        "'speaker_6': 'It's using 50th as a local street to get to to the collector Tennyson. It doesn't encourage cut through on rain or Utica. There's going to be very little directional traffic to the north because you can't get anywhere. So unless you're going to a home that already exists on rain or Utica, by virtue of this development, you're not'",
        "'speaker_6': 'going to create any incentives to cut through the existing neighborhood. Everyone's going to use 50th to get to Tennyson, to get to the rest of the wherever you're traveling to. And we have found that there is sufficient capacity on 50th once it improved with even the existing stop sign there to handle the addition of.'",
        "'speaker_4': 'Units, 50th is who's going to improve 50th the city.'",
        "'speaker_6': 'The developer. The developer as a yeah. As mitigating the impacts of additional density on that site.'",
        "'speaker_4': 'And that will be required during the.'",
        "'speaker_6': 'Site development.'",
        "'speaker_4': 'Plan. Got it. Okay. All right. So what I think I'm hearing you say, just let me repeat it back is Blueprint Rec provides those principles. And as much as land use can address them, their address. That's what the CPD statement below is.'",
        "'speaker_6': 'Correct?'",
        "'speaker_4': 'Okay.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Rob. All right.'",
        "'speaker_2': 'Many more questions on 1075. Seeing none, public areas not closed and time for comments. Councilwoman Sheppard.'",
        "'speaker_5': 'Thank you, Mr. President. I really, really want to thank everyone for turning out tonight. I feel that we have had an extremely thorough, full and fair discussion of all of the issues that are relevant to this site. Thank you to the neighbors.'",
        "'speaker_5': 'Thank you to the Shriners. And thank you, Shriners, for your continued philanthropic work, by the way. And thank you also to the development team for participating in this piece. I, I want to I want to start by saying this is probably the most unique rezoning application I have certainly considered since I've been on council.'",
        "'speaker_5': 'This is an extremely unique area, and if you haven't had a chance to go see it in person, I highly recommend that you do have to add it at least three times, most recently this late this past week.'",
        "'speaker_5': 'I have walked every part of this property. I have been all through this building. I have looked at the beautiful ballroom floors, the beautiful fixtures in the ballroom and throughout the building, discussed some of the I mean, it's there's so many unique design features and elements to this building.'",
        "'speaker_5': 'It is truly one of the most interesting historic assets in all of northwest Denver. Councilman Brown, I don't know about the secret handshakes. We didn't discuss that. But I will tell you, if you don't go through this building with a guide, you will certainly get lost in all of the passageways.'",
        "'speaker_5': 'Is a very labyrinthine building and up. Councilman Lopez, I didn't see any of the little mini mini carts, but there is a whole wall of phases going back 100 years. And I bet if you ask nicely, they might let you try.'",
        "'speaker_5': 'Went on. Anyway, colleagues, if you haven't had a chance to read the history of the site that's included with our our packet materials, you really should because it's really fascinating reading. So I'm I am going to support this rezoning tonight and let me tell you why.'",
        "'speaker_5': 'Thank you, Ms.. Axelrod, for your very thorough presentation on Blueprint Denver and and where and how this piece fits in. I think some of the really salient points to me is our goal to preserve really unique heritage sites that speak to our history.'",
        "'speaker_5': 'First and foremost, I believe that we need to while we're doing that, though, to preserve flexibility, to address changing demographics and lifestyle, as also considered in that document document we have discussed tonight the opportunity for a diverse mix of housing opportunities at this site, including townhomes, single families, duplex, potentially condos and or apartments in the main shrine'",
        "'speaker_5': 'building. We also talked about the need to negative to to decrease negative visual impact. And I'm going to talk about that a little bit later. Thank you so much for all the news to all the neighbors who have worked so diligently on this project and given so much feedback due to directly due to your efforts, the shrine'",
        "'speaker_5': 'has been returned. The redevelopment has been reduced from 90 units to now a hard cap in this part of 78 units. No expansion of the current shrine building will be allowed per this PD. And only single family and duplex forms on areas.'",
        "'speaker_5': 'B and C and then the area west of the shrine itself. Regarding the issue of design guidelines, could they be stronger? Yes, I think they could. And I would highly, highly encourage the development team to continue working with our neighbors around that issue.'",
        "'speaker_5': 'But I will call your attention to a fair number of design guides that are currently enshrined. No pun intended in this pod application, or maybe pun intended those. I will call out and I may forget some are regarding additional setbacks, reductions in height and massing in order to sculpt the edges of some of these sub areas.'",
        "'speaker_5': 'Allow for more open space. Allow for views. A very specific language about fence and wall design and screening of garages. Also, some areas, a requirement for a pitched roof, which, as Councilman Ken each pointed out, is, I believe, no in no other zoning designation across this entire city, and then additional incentives for pitched roofs and some of'",
        "'speaker_5': 'some of the other areas. I want to acknowledge some of the comments made tonight. Miss Harris, your comments about the process and actually Mr. Laws as well. You know, we had a meeting about this, I think it was November and discussed this in detail.'",
        "'speaker_5': 'I will tell you that I have met and discussed this with the chair of the Community Planning and Development, Brad Buchanan, no less than three times. And I've had very serious discussions, and I know this has provoked many internal discussions about how we can improve our processes around this.'",
        "'speaker_5': 'And there is the full commitment, both from myself and from CPD, to make some changes to address some of your very specific concerns. I think that the part of Ms.. Axelrod's presentation that I found to be most relevant is this discussion of.'",
        "'speaker_5': 'Areas of stability, committed areas versus areas for reinvestment. I think it's very apropos for this site. We've talked a lot about the single family home character of this area. But the other thing that we need to acknowledge is that there is a huge historic building also right in the middle of this neighborhood that contributes to the character'",
        "'speaker_5': 'of this neighborhood. And one thing that we didn't bring up, in addition to the golf course that surrounds the peninsula, there's a clubhouse. It's very active during parts of the year. So there's a lot going on in this neighborhood in addition to the single family homes that already exist.'",
        "'speaker_5': 'There is the episodic use of the shrine as an event center that often brings a lot of traffic, which, as Mr. Lovely pointed out, is really not so nice as those traffic lights leave his house and continue or leave the area and continually shine into his house.'",
        "'speaker_5': 'I really thought that what Tina said in relation to the areas of reinvestment was important. Talking about minimizing inappropriate uses. Redeeming vacant land and potentially considering major projects in small areas. If this area is primarily single family use.'",
        "'speaker_5': 'And a neighborhood. I would argue that a large events center is not really an appropriate use for this site. And I would further argue that considering this as some sort of potential commercial use is also inappropriate. I would argue that going to a residential format would actually be a better use of the land, more consistent with neighborhood'",
        "'speaker_5': 'context than the current commercial use which is out of place. So I think that's an important point. One other thing I would like to say is that. The shrine itself. It's an amazing building. I talked about it. The lady is aging and not so gracefully.'",
        "'speaker_5': 'Mr. Schwartz, I heard a little bit of the pain in your voice about wishing that your building built approximately the same time as this one was in better shape. I've been all over that building. There's 50, 60 years of deferred maintenance on it.'",
        "'speaker_5': 'I hear you when you say you can't afford to keep that building. You've got to get out of there. And I would say in a broader context to all community members in this room, as well as community planning and development in this next go around updates to our planning documents.'",
        "'speaker_5': 'We've got to have a much broader conversation about these huge legacy institutional uses that exist throughout our city that are becoming obsolete as time goes by. And I'm talking about some of these fraternal organizations, as well as many of our churches that are financially going under, which, unfortunately, in many of our church situations are often zoned for'",
        "'speaker_5': 'single family uses. But they're on the huge pieces of land. As is this. We have to have broader, deeper, more intelligent discussions in our planning process about what will happen to these types of places as the inevitable happens.'",
        "'speaker_5': 'I wish we could all still belong, that we all still belong to fraternal organizations. And we all went to church and synagogue more regularly. I bet we'd be a better place, but that's not the case right now anyway.'",
        "'speaker_5': 'I think one of the most interesting things I heard tonight actually was from Mr. Lovely, and that was the phrase considered urban density. I don't know if you coined that or if you got that from somewhere else. You made it up.'",
        "'speaker_5': 'Okay. Well, I may I will ask your permission to use it quite a lot from now on going forward. This is not been an easy process. It's been very anguishing for many involved. I have lost a lot of sleep over it.'",
        "'speaker_5': 'I know a lot of the people in these pews have to. This is going to be potentially this will be a big change in this neighborhood. But this decision is not being made lightly. I hope you can tell that by the quality and the character of this discussion tonight, by the attention of all these folks in this'",
        "'speaker_5': 'on this dais and by the questions that is answered and I have been asked and discussed. So I really feel that I know it's going to be hard. I know it's going to bring a lot of change. But I think it's the right move at the right time for this place.'",
        "'speaker_5': 'And once again, Shriner's, thank you for all you've done to hold down the fort in that area. Should this pass tonight? I wish you all the best. I bet your next building will probably be nowhere near as interesting, but it'll be a lot easier to take care of.'",
        "'speaker_5': 'And I'd like one of those visits anyway. Thank you so much. I know that they're my other colleagues. Probably have things to say as well. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Shephard. Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. My comments will be brief. I I've been paying attention to this particular rezoning. It's been in the Northwest Denver Tribune. It's been written about it. You know, a lot of folks have emailed me about it from one side or the other.'",
        "'speaker_8': 'And, you know, I'm starting to see this happen in a lot of different neighborhoods where they're becoming absolutely desirable or folks are really wanting to live the lifestyle that a lot of us natives have growing up in in Denver, which is still laid back.'",
        "'speaker_8': 'Denver's a big city. It's a great city. It's a beautiful city, but it's still local, right? It still acts as a as a small town. Has that feel? Has that community feel? You know, I'm a West Sider. I spent most of my time just at the Mile High Stadium.'",
        "'speaker_8': 'I marched and rode First Avenue Barnum Federal. But, you know, occasionally I'd be catch me wandering in the north side and catch me wandering around eligible shrines, seeing Roberto Gregory and seeing, I think at one point flocking JIMENEZ And a lot of things, a lot of going to weddings at the eligible shrine, going to see community events'",
        "'speaker_8': ', dances, dinners, things like that. That's where the community went to celebrate. And that's the neighborhood that I remember. I remember Elegies. I remember 38. I remember Federal Theater, remember all that, those the things that are the soul of our city.'",
        "'speaker_8': 'Those are the neighborhoods that are the soul of our city. And it's very delicate. And each time we see something like this come up for a rezoning or you see new plans, and a lot of us feel real touched by that, sometimes we get a little defensive about it.'",
        "'speaker_8': 'And not to simplify the opposition's argument, because I think you have a great argument to the you know, it's absolutely worthy. I heard it in these chambers and I'm glad folks showed up to do it. But, you know, times are changing.'",
        "'speaker_8': 'Denver is becoming more populated and as as is becoming more populated. And this isn't a question about affordable housing, but it does impact the affordability of housing availability, housing in our city. Yet for folks who live around it, it could be it's a huge change.'",
        "'speaker_8': 'It's different and it means more traffic. It means you need to have different folks in the neighborhood. It's a completely almost a different. Kind of lifestyle for the folks that are living there. But understand that as we grow, you have to know that you have to plan.'",
        "'speaker_8': 'Now, I'd be a little bit afraid if we did this with the old Chapter 22, the old zone districts. I'd be a little nervous about it, but some of the zone districts that we have now and some of the things that folks in planning are looking at are much more fine tuned and allow for more creative development'",
        "'speaker_8': '. What I am going to plead, although I'm seeking I'm going to support this rezoning. I'm going to plead to the folks who are potentially, you know, working around the shrine. Keep the shrine original. Keep it as a celebration of the neighborhood of who we are.'",
        "'speaker_8': 'Keep it for the neighborhood, for Denver. Those are the memories, all those faces that are in there. Right. All those weddings do your best. To keep one of our diamonds. Brilliant. One of our old buildings were old landmarks.'",
        "'speaker_8': 'I almost wept when I heard that Paris on the plot was going to close and it closed. I got sad when when they move dealerships, even though it's in a good spot. I miss it. This is one of those things that we hold very sacred to our city.'",
        "'speaker_8': 'And hopefully it's in good hands. If I know any better that you know the back and forth, the little proposed ideas about Charlie Willie stepping in, you know, he did a good job with the loans team theory. He actually, you know, it was sitting empty on East Colfax.'",
        "'speaker_8': 'And to be quite honest, I had never been there until I went to go see my first show where Los Lobos played there. And it was amazing. And I wondered why the heck I never set foot in that theater before.'",
        "'speaker_8': 'And so it's one of those. It could be one of those. Venues. It could be something that the neighborhood says, this is who we are and it's what we're proud of in the States. So having said that, I want to make it too long of a speech.'",
        "'speaker_8': 'I promise I'd have shorter remarks. But there you go. I support it. Thank you.'",
        "'speaker_2': 'Thank you. Councilman Lopez, Councilwoman Fox.'",
        "'speaker_9': 'Thank you, Mr. President. I certainly understand why this facility needs to be sold. I understand the maintenance challenges that you have. At the beginning, I was certainly wide open to doing that. The comments of the neighbors, not people who are Shriners, but the neighbors started to sink in.'",
        "'speaker_9': 'And I will admit that the final answer when I asked a question following the role Mr. Wooley would play and then whether they would be accessing public money in any way. And then 2 seconds later, I got I heard the answer to Councilwoman Robb.'",
        "'speaker_9': 'Yes. They were going to be looking at tax credits, historic tax credits and such that I got the no answer. She got the answer to my very same question. So I am not feeling comfortable about this period and the way things are being presented and whether they are fully baked at this point.'",
        "'speaker_9': 'Because it appears to me that we're getting different, different answers. Plus the fact that Councilman Lopez talked about the great example. I remember going three through three variations of having the city taken to the cleaners more and more each time on the Lowenstein project.'",
        "'speaker_9': 'Not a good experience in my memory, and I don't want to sit here and worry about this one. So I will be voting no tonight.'",
        "'speaker_2': 'Thank you, Councilwoman Fox. Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. I was trying to figure out if there was another site anywhere comparable to this in the city. So as we're talking about, you know, looking at something that is I mean, most most of the neighborhoods that are stable neighborhoods, when we talk about development opportunities, they're generally on the edges of the neighborhood.'",
        "'speaker_10': 'And and this site is very unique. I was asking Councilwoman Robb if if she knew this street that I was trying to think of where one of our former school board members lives. It's sort of on the west end of the Denver Country Club.'",
        "'speaker_10': 'It's a very unique area. There's a there's a swimming pool down there that just some of the residents I think there are like three or four residents that live in that little area. You drive down a hill to get there if if somebody's ever assembled all those single family homes.'",
        "'speaker_10': 'That's the only thing I could think of that might be somewhat comparable. That's on the edge of a golf course, but it's surrounded by, you know, single family homes where someone might be able to develop it in in a similar way.'",
        "'speaker_10': 'And I don't know that we would look at that the same, but be that as it may. The one thing I think is important is to continue to urge the development team to keep the conversation open with the neighborhood about the design standards or guidelines, whatever you want to call them.'",
        "'speaker_10': 'So that what this looks like in the end is something that's compatible with the neighborhood. Hopefully it looks somewhat similar to the existing building, but I think that dialog, continuing that dialog is an important part of this conversation.'",
        "'speaker_10': 'You know, we're challenged in this city other than all the land that we have at Green Valley Ranch. And, you know, most of Stapleton is is almost completely built out now. We are a landlocked city, and there are constant pressures that are brought before us with people wanting to develop in the city of Denver.'",
        "'speaker_10': 'Everybody wants to live in the city and it's becoming so unaffordable, which is part of why I asked about the affordable units. Many of us on this day a struggle to ensure that we are working to find opportunities for affordability within the city so we don't become a city of only those who can afford to live here'",
        "'speaker_10': '. And so part of those development pressures that we have are, you know, people wanting to build and looking at opportunities to have housing here. But it's important to also look at ensuring that we have that affordability and and opportunities for all folks in this city to be able to live here.'",
        "'speaker_10': 'And, you know, we struggle with that. We work on that through through other means. You've heard us talk about, you know, social impact bonds that we have had. Some discussions about and we'll be seeing more of that come forward in terms of the kinds of programs or projects that we're going to support with that.'",
        "'speaker_10': 'But this particular project is unique because of its proximity to residential single family residential homes. It about a golf course. I'm a little concerned about having parking abutting up to the golf course. But you know, again, that's part of why the design discussions become really important between the neighborhood and the developer.'",
        "'speaker_10': 'I think there's been a lot of work that's gone into this. I know you've all been working on this for quite some time. I'm comfortable with the discussion in terms of where we have landed on this. I want to thank Councilwoman Sheppard for her efforts in trying to keep the conversation alive between the development team and the'",
        "'speaker_10': 'neighbors and in working. And I think you need it needs to be acknowledged. I mean, I think lots of times people start here because, you know, you're going to end here. But the fact that there was a lot of movement on this project in terms of where it did start and and where we're at in terms of'",
        "'speaker_10': 'the number of units that will be on site. Obviously, with any development team and with the financing folks that look at them, they always want to make sure that the parking is part of a project. I know lots of times our zoning code will say one thing on parking, but the financing team says no.'",
        "'speaker_10': 'If you want to sell them, you've got to have the the the parking units. And so I believe that piece will work itself out. So I will be lending my support to this application tonight as well. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilwoman Robb.'",
        "'speaker_4': 'Thank you, Mr. President. I do want to thank Councilwoman Shepherd for her work, everybody who testified either for or against, including the development team, because at committee, there was a sense, as Tina Axelrod said, that more work needed to be done.'",
        "'speaker_4': 'And I'm glad to see that more work would be done has been done. As I read through the documents and letters before me and my staff and I went up and drove around the neighborhood to to look at it is so unique.'",
        "'speaker_4': 'The first time I ever saw the shrine was, I think when Rick Garcia left council and I went to his farewell party and I went point what's in there? Because it was pretty cool. But I think all of this material has been about trying to figure out what the context of this neighborhood is and should be.'",
        "'speaker_4': 'Is context about number of units? Is it about peaked roofs? Is it about sidewalks? Is it about traffic? Is it about preserving the shrine? Is it about materials? Is it about whether parking by the golf course? And by the way, I think I read that it can't you can't have parking right along the golf course.'",
        "'speaker_4': 'And when you put that all together and try to figure out what is going to fit in, there is not exactly a perfect answer. The one thing we know, and these are broad general contexts is this is an edge context text.'",
        "'speaker_4': 'I don't think anybody disagreed with that tonight. An edge context is right between urban and suburban, and it even allows suburban forms and urban forms. I was really glad to hear because I had some question about it based on the letters that I had received.'",
        "'speaker_4': 'Why we chose Urban Rowhouse in instead of a townhouse form. Because if I lived there, I'd much prefer not having the garage right on the front of the building so that all you saw from the street was the garage.'",
        "'speaker_4': 'The other thing that has become apparent to me through this discussion is that the PWD zoning is definitely appropriate for this site. That's a case that needed to be made. And Susan Shepard spoke to specific pads or you did, Debbie, about what we used to do.'",
        "'speaker_4': 'And this also applies to the guidelines. I referred to a very difficult rezoning that thankfully happened before I was on council. But we all face these tough decisions. It's right at ninth and Colorado on the west side of the street.'",
        "'speaker_4': 'We had local architects. We had pictures. We had specified materials. No one likes this particular development. Even though we had it all laid out. So what assures the quality that we want in this neighborhood? Because it's clearly a quality neighborhood and I would argue it's a quality of the development team.'",
        "'speaker_4': 'The difference between eyes that I see between the project I'm referencing and the one tonight is we have a local team, not a team out of Texas, not that there are good developers in Texas, but we have a team that understands the context of the area of the area.'",
        "'speaker_4': 'They may not agree with everyone to the point of every bit of that context, but they understand and they understand what Denver's going through. And then finally, I spent a lot of time thinking about the question that this zoning doesn't require that the shrine be renovated.'",
        "'speaker_4': 'It's based on the renovation and the zone of the shrine, but it doesn't require it. And I got to thinking exactly what Tina said before I came over. I don't know. One zoning that requires a developer to develop.'",
        "'speaker_4': 'You know, that's why we have so much going on in Cherry Creek. Lots of those things are zoned seven years ago, so there's no guarantee there. But I definitely believe that it's much more likely the shrine will be renovated if we pass this rezoning tonight rather than if we wait for the great unknown.'",
        "'speaker_4': 'So I will be supporting it.'",
        "'speaker_2': 'Thank you, Councilwoman from Councilwoman Canete.'",
        "'speaker_1': 'Thank you, Mr. President. I will be very brief, which most of the points were covered by my colleagues, particularly Councilwoman Sheppard, who was very thorough in describing all of the ways that this developer has compromised and the benefits of those compromises.'",
        "'speaker_1': 'I just felt it was important for full disclosure because I live closer to this site than anyone else on this council. I live a half mile exactly south in the Berkley neighborhood. And so this is my neighborhood. And, you know, contrary to something I read or heard about biking, I bike up this hill all the time.'",
        "'speaker_1': 'I can't describe it as fun and I can't say that I'm always on my bike the entire hill. But but I do, as do many others, I think spend time in this in this vicinity. So and, you know, as I was thinking, you know, Councilwoman Ortega mentioned something.'",
        "'speaker_1': 'She was trying to think of a similar site and immediately jumped into my head. I am five houses across the street and five houses from the Ilitch development. The significant difference being connectivity right there. You have a complete grid here.'",
        "'speaker_1': 'You certainly do not. But, you know, in fact, the Ilitch Theater is is not shuttered and boarded up anymore. It's actually got an occupancy permit. And I saw Charlie and the chocolate factory there last summer and many people saw many other films.'",
        "'speaker_1': 'So it is an active site in and in fact, it took a really long time, but the density around that historic building made it possible for that historic building to be preserved. So so I find that to be very similar to this situation, a much smaller building, but also very high cost and a piece of history.'",
        "'speaker_1': 'The band show was preserved and there was opposition, you know, from that neighborhood about that density. There's both row home townhome as well as apartments and in that site and it works. You know, it's a place where neighbors begin to integrate and they begin to walk through an experience.'",
        "'speaker_1': 'Yes, it looks different than the historic homes. There are no pitched roof requirement there. But certainly we have you know, you have I think that's your biggest win, to be honest with you. The pitched roofs, most neighborhoods would really like to get that kind of requirement.'",
        "'speaker_1': 'So so I say all this to say that, you know, I, I, I experience that kind of edge habitat where I live. I hope that you will come to be a part of that process. I think there was a little semantic disagreement about or not disagreement, but confusion that design guidelines are not formal.'",
        "'speaker_1': 'But the site plan will get at many of the issues that folks are describing as design. So there is a formal process that will address many of the things folks are concerned about. It just isn't called design guidelines.'",
        "'speaker_1': 'So, you know that that I think may may be helpful. So I hope folks do stay engaged. And I hope that you will find as much benefit from the combination of historic preservation and new density as, as I have found, being near a very similar development.'",
        "'speaker_1': 'So with that, I will be supporting this rezoning. And I want to appreciate Councilman Sheppard's leadership in making sure that so many concerns were addressed. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman, can each any other comments on 1075? I mean, right before we do the roll call, I want to tell you, I thank you for your patience. I can't imagine you're going to stick around after this one.'",
        "'speaker_2': 'But the council does have one more public hearing. So I would just ask that you would be quiet as you were leaving so we can go directly into that last public hearing. So thank you for that. Madam Secretary, roll call.'",
        "'speaker_5': 'Shepard Sussman.'",
        "'speaker_4': 'Brooks.'",
        "'speaker_0': 'Hi.'",
        "'speaker_4': 'Hi, Fats. No carnage, layman. Hi. Lopez. I monteiro Nevitt. Hi, Ortega. Hi, Rob. Hi, Mr. President.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Madam Secretary, please call the body and ask the result.'",
        "'speaker_4': 'To advice one nay.'"
    ],
    "Corrects the legal description of the legislative map amendment that rezoned property from C-CCN, PUD, or C-MU-10 with waivers and conditions to proposed zone districts C-CCN-4, C-CCN-5, C-CCN-7, C-CCN-8, or C-CCN-12 in Council District 10. (NEIGHBORHOODS & PLANNING) Corrects the legal description of the legislative map amendment that rezoned property from C-CCN, PUD, or C-MU-10 with waivers and conditions to proposed zone districts C-CCN-4, C-CCN-5, C-CCN-7, C-CCN-8, or C-CCN-12 in Council District 10. The Committee approved filing this bill by consent on 12-11-14.": [
        "'speaker_2': 'One nay. 1025 has been placed on final consideration and pass. All right. We are moving on to our last public hearing of the night, 1076. Councilwoman Fox, could you please put 1076 on the floor?'",
        "'speaker_9': 'Certainly, Mr. President, I know the Council Bill 1076 be placed upon final consideration and do pass.'",
        "'speaker_2': 'But it has been moved and seconded. The public hearing for a council bill 1076 is now open. May we have the staff report?'",
        "'speaker_7': 'Good evening, Kyle. Kyle Dalton again with community planning and development. I'm pinch hitting for tonight for Sarah Showalter, my capable but ill colleagues. So I will give her the credit for a very brief presentation here at the end of the day.'",
        "'speaker_7': 'This rezoning request is to correct a technical error in the Cherry Creek North rezoning we did at the end of October in 2014. It's been initiated by our department community planning and development, and it clarifies that areas of land that were formerly rights away, that have been long since vacated, were included in the legislative re rezoning action'",
        "'speaker_7': 'that you took in October 2014. There's a this is a technical correction to the legal description in the ordinance that described that zoning we did back in October. It's in Council District ten in the Cherry Creek North area.'",
        "'speaker_7': 'This map that's in your packet shows the specific alleys and streets that were platted but have long since been vacated that are private property today and that were intended to be included in that rezoning in October 2014. And this just clears that up in all of the properties that are to be clarified that they were zoned in'",
        "'speaker_7': 'October are going to the same zoning that surrounds them, that that entire private property that they're adjacent to enjoys already. But even though it's just a technical error, it requires all of the process of a rezoning other than going to planning board.'",
        "'speaker_7': 'So it has been properly noticed at the time of receipt of application at the Neighbors and Planning Committee. Tonight, we have we have posted signs in the neighborhood. We've sent written notification out. I've gone to the Cherry Creek Steering Committee and answered their technical questions about this.'",
        "'speaker_7': 'We have received no written public comments on this rezoning. Just one slide on the review criteria, which is in summary, we reviewed it the same way review. We reviewed the rezoning in October for all of Cherry Creek North.'",
        "'speaker_7': 'And so we based our analysis on that analysis where we found it consistent with the adopted plans and this clarification, we're just rezoning those vacated rights away to the same zoned districts that about them. The justifying circumstance in this case is the correction of an error in the official zoning map.'",
        "'speaker_7': 'Otherwise, our analysis is identical to the analysis we provided and in October, in which there has done a good job detailing in the written staff report. So having reviewed it against the criteria we recommend approval of.'",
        "'speaker_2': 'Wonderful. All right. We have no we have no speakers. And so directly to questions. Councilman Neville.'",
        "'speaker_0': 'Yeah, just a point of order, Mr. President. This is not located in District one, so I don't know if we're we can actually consider this tonight because this.'",
        "'speaker_5': 'District one show. What are you talking about?'",
        "'speaker_2': 'I guess we can make an exception.'",
        "'speaker_0': 'All right. Any. Oh.'",
        "'speaker_2': 'They're lining them. All right. Councilman Lopez.'",
        "'speaker_8': 'I have a comment.'",
        "'speaker_2': 'Okay, so any other questions? You know the question on 1076. Seen on public hearing now closed. Time for comments. We'll start with council woman. Rob.'",
        "'speaker_4': 'Please vote for this.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Councilman lopez.'",
        "'speaker_0': 'For this man. Yes.'",
        "'speaker_2': 'All right. Great presentation. Any other any other comments on that? Councilwoman Shepherd.'",
        "'speaker_5': 'Thank you to all of my colleagues for listening to so much passionate testimony tonight regarding so many projects in District one. I appreciate your indulgence.'",
        "'speaker_2': 'Any other comments? 1076. Seen none, Madam Secretary. Roll call.'",
        "'speaker_4': 'Rob Shepherd.'",
        "'speaker_5': 'Sussman.'",
        "'speaker_4': 'Brooks Brown. Hi, Fats. I can eat lemon. Lopez, Montero. Nevitt. Hi, Ortega. Hi, Mr. President.'",
        "'speaker_0': 'I. Yeah.'",
        "'speaker_2': 'Kathleen Brooks. Come in, Brown. You voted. You didn't need just you to punch that, if you could, please. All right, Madam Secretary, please cast a vote in. Now the results.'",
        "'speaker_5': 'Lebanese.'",
        "'speaker_2': 'Lebanese 1036 have been placed on final consideration and does pass. On Tuesday, February 17th, 2015, Council will hold a required public hearing on Council Bill 1094, changing the 11 classification for BLOCK One, the South Lake subdivision. Finally one located in southeast corner of 17th Avenue and Stewart Street, a required public hearing on Council Bill 1095, changing the'",
        "'speaker_2': 'zoning classification for 1673 South Emerson Street. And on Monday, March 2nd, Council hold a quiet public hearing on Council Bill 1096 Change in Zoning Classification 7200 East 36th Avenue. Any protest against Council Bill 1094 1095 must be filed with the Council offices no later than noon on Monday, February nine, 2015.'",
        "'speaker_2': 'And any protest against Council Bill 1096 must be filed with the Council Offices no later than noon on Monday, February 23rd, 2015. Seeing no other business before this body, this meeting is adjourned.'",
        "'speaker_1': 'Denver eight TV. Your city. Your source.'",
        "'speaker_0': 'Denver. Eight on TV and online. Stay connected to your community, your city, your source.'",
        "'speaker_6': 'You are watching Denver eight TV.'",
        "'speaker_1': 'Your city. Your source.'"
    ]
}