{
    "A resolution approving a proposed Amendatory Agreement between the City and County of Denver and Axon Enterprise, Inc., f/k/a Taser International, Inc., to extend the term, increase the maximum contract amount and add additional terms and conditions for body worn cameras, supporting equipment, software, and data storage and Tasers for the Denver Police and Denver Sheriff Departments. Amends a contract with Axon Enterprise, Inc., formerly known as Taser International, Inc., by adding $15,996,615.10 for a new total of $22,097,650.10 and five years for a new end date of 12-15-25 to purchase body worn cameras, supporting equipment, software, and data storage and Tasers for the Denver Police and Denver Sheriff Departments (202054764). The last regularly scheduled Council meeting within the 30-day review period is on 12-21-20. The Committee approved filing this item at its meeting on 11-18-20. Pursuant to Council Rule 3.7, Councilmember CdeBaca called out this resolution at the 11-30-20 Council meeting for a one-week postponement to Monday, 12-7-20.": [
        "'speaker_0': 'All right. Thank you, Councilwoman. And thank you for the staff answering the questions. The next item up we have is Council Resolution 1356. Councilwoman Ortega, we you please put Resolution 1356 on the floor for adoption. We've got you muted.'",
        "'speaker_0': 'But I just hit the button. Madam President, I move that council resolution 20 1356 be adopted. Thank you. It's been moved and seconded. Questions or comments by members of Council. Councilwoman CdeBaca.'",
        "'speaker_4': 'Thank you, Madam President. Just wanted to make sure that we do a vote count on this one. I received over 150 communications this weekend requesting that we either split this up and have separate contracts for the Tasers and separate for the body cams, or that we do not approve this tonight, that we should be waiting.'",
        "'speaker_4': 'People requested for us to wait until we have our report from the Independent Monitor investigating the use of the tools that we currently have. And so I want to go on record as a no for this this evening.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Madam President. I just want to make note for folks that as a result, particularly of Senate Bill 217 this year, it's a requirement that we have body cameras. The current contract we have has already expired in June.'",
        "'speaker_3': 'And so to not approve this contract would put us out of compliance with the state statute that all of us supported the upgrade in the cameras. The cameras that they're currently using are five years old and they have poor quality, particularly at night.'",
        "'speaker_3': 'The new cameras, which are actually the minor cost of the contract, the new cameras have much better video quality at night under low light conditions and will be much better for our purposes. And again, I remind you that we're required to have them.'",
        "'speaker_3': 'And but the major part of the cost is the storage, which is managed by the vendor. So turning down this contract would leave us not only out of compliance with state law, but it would also leave us without a way to access the video that is taken even by the existing body cameras.'",
        "'speaker_3': 'So for that reason, I urge all of us to support this as we supported Senate Bill 217. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilman Hines.'",
        "'speaker_2': 'Thank you, Mr. President. I actually have some questions. Since this has been called out. I wonder if I could. Get someone to answer. I'll just ask and then you can decide who to direct this to. So we had heard in public comment today a few people saying that the body cameras had never led to a charge or'",
        "'speaker_2': 'conviction. I wonder. I wonder if anyone can can comment on that, that that seems a little interesting to me, but just because it seems interesting to me doesn't mean that it is true or untrue. So someone else can provide some context.'",
        "'speaker_2': 'That would be wonderful.'",
        "'speaker_0': 'Great. It looks like we have cheese paisan cued up if if that's correct. To answer that question and I just want to remind folks as well, if we can stay on the topic of the actual resolution and the contract, it would be much appreciated.'",
        "'speaker_0': 'We've got three public hearings lined up tonight as well, so go ahead, Chief Payson.'",
        "'speaker_2': 'Thanks, Madam President and Councilman Hines. Again, the purpose of the body camera is to document the incident. The purpose is not for conviction in court. It's to document the incident. Use that as evidence that the evidence supports a conviction.'",
        "'speaker_2': 'And that's what the outcome would be. Of the video evidence itself. But to say that the fact that this that's not the purpose of the body. Okay. And I wonder if also this vendor is not from from Colorado.'",
        "'speaker_2': 'I don't think they're even based in the United States. Not that that's a huge deal. If we don't have a vendor that can perform the service in Denver. Do you know if if there is a locally based vendor, that that could perform the service?'",
        "'speaker_2': 'So we did look at it. We looked at different vendors five years ago, six years ago, seven years ago. And again, based on testing and evaluating the different body worn cameras, this is the one that that met our needs to unbundle.'",
        "'speaker_2': 'Something like this would be extremely difficult. Just it's a workflow issue with the data and the video storage. When we're talking about documenting the the incident, we share this information with the district attorney on criminal cases involving their office.'",
        "'speaker_2': 'It's shared with the city attorney on criminal cases involving their offices. There's 37 terabytes of information so that the data storage itself is quite extensive. And I think you and the. Is it possible to upgrade the existing body cameras or.'",
        "'speaker_2': 'And that's that's also something that I've I've heard from from people who are reaching out about this contract. So, no, there is not a way to upgrade the current BWC to the newer cameras, would provide better video footage, better coverage in those low light situations, as well as movement capturing the rapidly evolving situations.'",
        "'speaker_2': 'So I guess the best analogy that I could give you would be a cell phone. Obviously, there's cell phone upgrades, including cameras on cell phones that have taken place, upgrades in the technology. And it's not just purchasing a cell phone and you can have unlimited data.'",
        "'speaker_2': 'It is the service plan that goes with that. So that's an analogy that may help understand the costs associated with this. And then to try to put it into context, it's that 37 terabytes of data that needs to be handled, you know, to document when if an officer handles 20 calls for service in a day and a'",
        "'speaker_2': 'specific date, the specific time when a individual arrest or to document the evidence in a particular case, being able to retrieve that exact file for the district attorney or the city attorney. That's where a lot of the complexities in this type of data storage and management takes place.'",
        "'speaker_2': 'Thank you, Chief. One other thing that people were asking about was about training. I noticed in the contract that there there is a component of training and it appears that there are also some VR headsets for. I think I think the contract calls for empathy training.'",
        "'speaker_2': 'Can you talk a bit about the the training component associated with this contract? And can you talk about what what is this? What what is empathy training where the VR headset is meant to perform? So, Councilman, this is something that both the Denver Sheriff's Department and the Denver Police Department really believe in.'",
        "'speaker_2': 'Sheriff DEGGANS talks about leading with our humanity. We want to be more we want our officers and deputies to be more empathetic when engaging with our community again, to have a better understanding of where individuals are coming from.'",
        "'speaker_2': 'This is a technology upgrade that would help us in that endeavor from resolving a potentially challenging situation and de-escalating it. One from the officers perspective. But then you can utilize that exact same scenario from the individual who is in crisis perspective for that empathetic view.'",
        "'speaker_2': 'And that's something that is also part of this. Is it possible for the public to see that kind of training or to have access to the training manual or something along those lines? ABC News did a story on this national news.'",
        "'speaker_2': 'And you're welcome. I'll get you the link. Yeah. Thank you, Chief. And thank you.'",
        "'speaker_0': 'For.'",
        "'speaker_2': 'For being on the hot seat. I know the sheriff sheriff is also here. Thank you first for taking all the questions. And the the last question that I have is about. What happens if if there's a Taser? Taser has become axon.'",
        "'speaker_2': 'What happens if there if there continues to be a you know, what if they do that, I think was they change their legal name. But what if the the company is purchased? I guess two questions right now. Who owns the the 37 terabytes?'",
        "'speaker_2': 'Then second, if the company gets purchased, who owns the 37 terabytes? So City Attorney's office, do you want to weigh in? It's my understanding that the city of Denver owns the data. And that that's spelled out quite explicitly in the contract that if another country or excuse me, another company comes in and purchases a parent company, that'",
        "'speaker_2': 'that Denver would retain that. Right.'",
        "'speaker_0': 'So we have we have Steve promoted. Go ahead, Steve.'",
        "'speaker_2': 'Hi, this is Steve on at the city attorney's office. In answer to the question, who owns the data, it's very clear in the contract, the city and county of Denver owns the data, which is primarily, well, almost exclusively video footage.'",
        "'speaker_2': 'If the contract were assigned to someone else, those contractual provisions would carry over and the city and county of Denver would continue to own the 37 terabytes of data. So there's no there's no way for Nexon or Taser or some other company for while they happen to be storing the data.'",
        "'speaker_2': 'They're not they don't they can't use it for their own purposes or they can. Published snippets of any of that video footage or associated metadata. That's correct. If they did that as a last week, be in breach of the agreement.'",
        "'speaker_2': 'Thank you. Thank you. Thank you, Mr. Horne.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Torres.'",
        "'speaker_1': 'Thank you, Madam President. Hello to Steve Hunt's dog. My questions are probably more for Chief Payson. Chief, if you're still on. Mm hmm. We've got him. Okay. The funding request total. Maybe this isn't or I'm hoping you know this.'",
        "'speaker_1': 'The funding request total. This is not a supplemental funding request, is it? Or is this using existing 2020 funding from the department's?'",
        "'speaker_2': 'You are correct. This is not a supplemental request. Or Laura, would you like to answer that question? Yes, absolutely.'",
        "'speaker_4': 'Good evening. Members of Council Laura Walker, deputy.'",
        "'speaker_0': 'Director of safety.'",
        "'speaker_1': 'So this is subject to the annual appropriation.'",
        "'speaker_4': 'Within the general fund budget. And we currently do have our budget within the.'",
        "'speaker_2': 'Police and sheriff's general fund budget.'",
        "'speaker_4': 'And 2021.'",
        "'speaker_1': 'The 1.1 million of this contract. That's for a may invoice. Why was that overdue or not paid? And what was it for beyond the original contract? Yes, they are. Thank you for that question. So we had originally started all of the contract amendments.'",
        "'speaker_4': 'And the extension of the contract back in January.'",
        "'speaker_1': 'But due to complications with COVID.'",
        "'speaker_4': 'As well as understanding the Senate Bill 217 and incorporating Sheriff.'",
        "'speaker_1': 'Into the contract. Those conversations occurred.'",
        "'speaker_4': 'Throughout the summer. And so that 1.1 million we were invoiced and made for the additional body cameras.'",
        "'speaker_1': 'In the police department from 800 body cameras in the original contract to.'",
        "'speaker_4': '870. So that was all just part of the the police body camera contract.'",
        "'speaker_1': 'Okay. Thank you, Laura. So, Chief, I don't have an issue in sharp begins with the body worn camera request, but I do have a couple of questions about tasers, which are 3.6 million of the request our use of tasers.'",
        "'speaker_1': 'Part of the requirements of Senate Bill 217.'",
        "'speaker_2': 'No, they're not.'",
        "'speaker_1': 'The. How long has Deepdale been using tasers?'",
        "'speaker_2': 'We've been using Tasers for nearly a decade.'",
        "'speaker_1': 'Okay. Have. Have we? Well, in Denver, I know nationally we've we've seen deaths from Taser use. Have we seen any in Denver?'",
        "'speaker_2': 'I have not seen any incidents where a taser has been the cause of the death in our city.'",
        "'speaker_1': 'Okay. And then have we done a race or ethnicity assessment of Taser deployment?'",
        "'speaker_2': 'So our use of force and this was something that one of the use of force committee members brought forward. We publish on our website all of the use of force, including the demographics of the officer and the demographic of the individual that force would have been used upon, and that is published annually on or before February 1st'",
        "'speaker_2': 'of the following year.'",
        "'speaker_1': 'Okay. Okay. Thank you. Those are all my questions, Madam Chair. Madam President.'",
        "'speaker_0': 'I thank you, Councilwoman. Up next, we have Councilman Flynn.'",
        "'speaker_3': 'I think that the president just want to close the loop on a few things, chief. Paisan, is it the case that the new camera, this new upgrade includes a feature that would automatically start the video? Assuming the officer hadn't already started, it would start the camera or when either the taser or the firearm is on the holster'",
        "'speaker_3': 'by the officer.'",
        "'speaker_2': 'Correct, Councilman. And I want to make sure that we're really clear on this point. So thanks for bringing this up again. The city of Denver and the Denver Police Department were early adopters of the system. And in 2019, for example, we've had over 600,000 interactions with our community or calls for service and a fraction of a percent'",
        "'speaker_2': '. A fraction of a fraction of a percent. The officer forgot to turn on the camera. I think 34 incidences out of the entire 622,000 potential calls for service here. What this additional technology does is it serves as a failsafe, doesn't change the policy.'",
        "'speaker_2': 'Officers are still required to turn them on per policy to include the arrest, documenting of evidence, all of the stated purposes of the body worn cameras. This additional feature that essentially works as a failsafe that correct those most critical situations.'",
        "'speaker_2': 'We don't want that to be the small fraction of a percent where an officer forgot. We need those to be turned on a body worn system for that accountability for what are demanding. What has been to 17 is requiring.'",
        "'speaker_2': 'We want to make sure that those are captured.'",
        "'speaker_3': 'Thank you, Chief. I wanted to be clear because some of the email that we were getting, it was a singular email that was being sent to us by by dozens of volunteers. And there was some information in there that wasn't quite what this what this contract actually is.'",
        "'speaker_3': 'The policy is always that the camera is on when there's public interaction. It's not the case that we only use the camera when when a taser or a firearm is on holster. Correct.'",
        "'speaker_2': 'You stated that. Correct counts, right? Okay.'",
        "'speaker_3': 'The reason I asked that, Madam President, was to address Councilman Himes question about whether you could split the contract up between the cameras and the Tasers. And because of this interaction, I would suggest that that would that would not be a very good thing to do, even if it were possible, because we want that functionality.'",
        "'speaker_3': 'The cost of the 60 million average is out over the five years to about $3.2 million per year. Laura And I assume that what you're saying is that this is subject to appropriation each year of that annual amount that we're not fronting the entire 16 million next year.'",
        "'speaker_3': 'Is that correct?'",
        "'speaker_1': 'That is correct, sir.'",
        "'speaker_3': 'Thank you. And just to correct one, one other misstatement that was in the email we got and was repeated here. There was at least one case that I know of personally where an officer was charged criminally with an assault using body camera as evidence.'",
        "'speaker_3': 'And that case ended in an acquittal. But there was at least that one case that I do know of. Sheriff Diggins, one other thing. One other reason for this expansion is that Senate Bill 217 requires us to equip certain deputies who work in the corrections area to wear body cams.'",
        "'speaker_3': 'And so we need to acquire more of them. And these are the ones that are now available. Can you tell us how many of your deputies expect you expect to be equipped with this?'",
        "'speaker_2': 'Ken, ultimately, at the conclusion of 2023, we expect that all deputies that have either public interaction or who work in a place where we have people in custody will be outfitted with a body camera. Senate Bill 2217 does call for both of those in subsection D of Section 24th, 31, 92 of that bill.'",
        "'speaker_2': 'It specifically states that any time there is an anticipated use of force, that a deputy has a body camera. And as you are all aware, that can happen at any time with our staff. So we're looking to be compliant with the provisions of the law by 2023.'",
        "'speaker_3': 'Thank you, Sheriff. Thank you, Madam President. Again, voting down this contract would put us out of compliance with state law. So I urge all my colleagues to vote yes.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilwoman CdeBaca, we have you back up.'",
        "'speaker_4': 'Yeah. Thank you, Madam President. And just wanted to clarify that last comment. We already are in compliance with 217. This is upgrading cameras. And so I'm curious for Chief Payson, how many cameras are we do we currently have that we're retiring as we purchase this new technology?'",
        "'speaker_4': 'And what happens to those old cameras?'",
        "'speaker_2': 'So, Councilman, the cameras that we currently have are entering their service life and they would be returned to the vendor as we get the new cameras.'",
        "'speaker_4': 'And so how many is that? How many are we retiring and how many are we getting online?'",
        "'speaker_2': 'So the again, the requirement is that every officer and again, this is built out in compliance with 217 to get us all of our officers, the body cameras that they need. But let me just go backwards for a second.'",
        "'speaker_2': 'This is not just using this amount of money to go from the BWC twos to the BWC threes. It is similar to a purchasing a phone. So if you purchase a phone, it doesn't mean that you get to make phone calls or stream video or send text messages.'",
        "'speaker_2': 'You need that service plan, that data agreement. So much of the cost associated with this is associated to that data agreement. And the upgrade is just part of part and parcel of the contract itself.'",
        "'speaker_4': 'Do you have numbers of how many body cameras you're retiring and how many new ones are coming online?'",
        "'speaker_2': 'We'll get you that number. Councilman.'",
        "'speaker_4': 'Do you have an itemized breakdown of the costs for the cameras, the tasers and the evidence dot com service?'",
        "'speaker_2': 'Again, this is all part of the greater the greater amended contract itself, the data storage, the workflow process here. We do not have that breakdown for you.'",
        "'speaker_4': 'Do they just break down those costs or is that just something you don't have in front of you?'",
        "'speaker_2': 'They don't break down those costs, nor do I have that in front of me. Again, I can't emphasize enough about the data aspect of this that the agreement is about the data access, including the equipment itself.'",
        "'speaker_4': 'And a quick clarification. SB 217 requires broadly that the activation of body cameras in any service call or any interaction with the public happens by 2023. Did you say that we're already complying with that? Or do they only turn on when a weapon is holstered?'",
        "'speaker_2': 'We are currently in full compliance with activating on those and you can take a look at that in our policy manual that talks about when body worn cameras are to be turned on. Section 11910. It talks about the activation we currently do activate.'",
        "'speaker_2': 'Now, the issue would be if we do not renew this contract, we did not go with the amended contract, we wouldn't have the data. So we have a body worn camera, we'd have the camera itself. But you would not be able to have the video footage of that or access to that video footage.'",
        "'speaker_2': 'So I can't stress enough that this is more than just going from an old camera to a new camera. This is about that data, the video, the workflow, being able to access that. Know an officer would respond to, say, 20 calls for service.'",
        "'speaker_2': 'Today, they're being able to access the specific call that was involved in a criminal case or in a complaint. That's where you have to be able to manage that workflow, be able to access that and utilize the evidence that the body worn cameras had captured.'",
        "'speaker_4': 'And how about the tasers? How many are we retiring and replacing, or does this just add and how many does it add?'",
        "'speaker_1': 'Chief. I can answer that one.'",
        "'speaker_4': 'We are currently replacing 1000 Tasers in 2021. Got it. And do we anticipate upgrading any other weapons within the next year?'",
        "'speaker_1': 'There's nothing else in this contract.'",
        "'speaker_4': 'So just this contract, we're just upgrading tasers.'",
        "'speaker_1': 'Within this contract. Yes.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilman Flynn, your backup.'",
        "'speaker_3': 'Thank you, ma'am. I just wanted to make it really clear that, yes, we would be out of compliance with 217 without this contract for the points that the chief subsequently mentioned, which is that we would have cameras, but we would not have the ability to use the video, which is, frankly, the more crucial part, having a camera'",
        "'speaker_3': 'that you can do nothing with, it's pointless. And what we need is the backdrop that action gives us with this contract. And as of now, the contract expired June 30th. So technically we already lack that. But we're we're in a bridge period right now.'",
        "'speaker_3': 'So, again, I urge people to vote. Yes. Thank you.'",
        "'speaker_0': 'Very good. Thank you. Councilman Flynn. Councilman Hines, we'll be back up, but we're doubling back and we belabor this quite a bit last week. And so hope you've got a quick, quick question here and we can go ahead and vote on this.'",
        "'speaker_2': 'Never mind, Madam President.'",
        "'speaker_0': 'You sure you don't? We got them all here. All right. Very good. Madam Secretary, roll call, please.'",
        "'speaker_1': 'CdeBaca. Now. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Flynn. I think.'",
        "'speaker_2': 'I. HINES No.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Can I? Ortega, I. Sandoval. I. Sawyer, I. Torres, I. Black. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced.'",
        "'speaker_1': 'Results to raise the Lebanese.'"
    ],
    "A resolution approving a proposed Memorandum of Understanding amending the 2019-2021 Collective Bargaining Agreement between the City and County of Denver and Denver Fire Fighters - Local 858, IAFF, AFL-CIO, to defer salary increases, suspend the Citys contribution to Post Employment Health Plan, and suspend pay for selected holidays and uniform allowance in 2021.  Amends the collective bargaining agreement with Denver Firefighters Local 858 to defer salary increases, suspend the City's contribution to Post Employment Health Plan, suspend selected holidays, birthdays and uniform allowance. The last regularly scheduled Council meeting within the 30-day review period is on 12-21-20. This resolution was approved by the Committee on 12-2-20.": [
        "'speaker_0': '11 eyes. Council Resolution 1356 has been adopted. The next item up is Council Resolution 1416. Councilwoman Ortega, would you please put Resolution 1416 on the floor for adoption and remove the Council Resolution 20 1416 be adopted. Thank you.'",
        "'speaker_0': 'It's been moved and seconded. Questions or comments by members of Council. Councilwoman Sawyer. You're good. All right. I tried to make sure I.'",
        "'speaker_4': 'Got about 15 screens happening here. Give me just 1/2. Let me pull up my next screen. Thanks so much.'",
        "'speaker_1': 'Hang on.'",
        "'speaker_0': 'No worries.'",
        "'speaker_4': 'There we go. Okay. Thanks so much for your patience. I really appreciate that. So I called this out for a vote because I'm going to be a no vote tonight. I spoke to Chief Fulton and David Foster of 858 tonight.'",
        "'speaker_4': 'And we talked through my reasons, which are mostly just consistency. I'm incredibly grateful for all that our firefighters do and the relationship that we have with them. And I don't mean to belittle or demean that in any way.'",
        "'speaker_4': 'And I want to thank every single one of the brave individuals that our fire department in our fire department for putting their lives on the line for our community. However, just like the Police Protective Union contract, this ammo you includes raises.'",
        "'speaker_4': 'And given the city's financial status, I just can't support that. While I recognize that this is a different circumstance because Local 858 was already owed raises under the terms of their contract, I'm just not comfortable giving one set of employees raises while others see pay cuts during an unprecedented financial and public health crisis.'",
        "'speaker_4': 'Council staff and Denver's career service employees were furloughed this year, and they'll be furloughed again next year. And let's be honest, a furlough is a pay cut. All members of this council, except one give back, are raises and salaries for those furlough days in solidarity with our coworkers.'",
        "'speaker_4': 'And I will commit to doing that again next year. But no raises means no raises. And so in the interest of fairness and on principle and consistency, I cannot support this MRU. Just like I did not support the pay contract.'",
        "'speaker_4': 'So I'm going to be a no vote tonight on this and I just wanted to go on record as saying that. Thanks so much, Madam President.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Thank you, Councilman Sawyer. Councilman Herndon.'",
        "'speaker_2': 'Thank you, Madam President. In just I will be in support of this, and I'm going to remind my colleagues that this is a different set of circumstances than with the pay of the sheriff's, because Local eight five did not have to come forward to renegotiate.'",
        "'speaker_2': 'But recognizing the fiscal challenges that they that the city is in, they wanted to be a partner in and recognizing that they wanted to as well make some sacrifices. And so I applaud them for doing that. If we vote this down, then their current contract will remain in effect and the current contract will give them a salary'",
        "'speaker_2': 'increase next year. And we will lose the savings that we're going to get with this contract if we approve it tonight. So once again, thank those eight, five eight for coming forward. And I certainly hope my colleagues to support this today, as I will.'",
        "'speaker_2': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Madam Secretary, roll call.'",
        "'speaker_1': 'Sawyer? No. Torres. I. Black I. CdeBaca. I, Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Hines.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Cashman. I can each. I. Ortega.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Sandoval. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_1': 'One name. 12 eyes.'",
        "'speaker_0': '12 eyes. Council Resolution 1416 has been adopted. The next item up is Council Bill 1364. Councilwoman Torres, please go ahead with your questions on Council Bill 1364.'",
        "'speaker_1': 'Thank you so much, Madam President. Perhaps Lauren Harvey is in the queue. Yes. Hi, Loren. So I just wanted to go through a couple of the questions. I was able to email you these earlier so you get a sense of what they were going to be.'",
        "'speaker_1': 'But because we didn't get to see this come through committee, because it was over the holiday week, I just I had questions about what's been spent so far in terms of rental and eviction assistance and how DHS is distributing this money.'",
        "'speaker_1': 'And additionally, what does DHS consider to be eviction assistance?'",
        "'speaker_4': 'Thank you so much, Councilman Torres, and I do appreciate you sharing some of your questions ahead of time. So pertaining to our general assistance program. Within that bucket, the amount of funding that has been spent on the evictions and rental assistance through October of 2020 is $625,131.'",
        "'speaker_4': 'And we did see a sharp uptick, especially in September and October, which we believe has to do with some COVID related issues. And we anticipate that continuing through November and December, which is why we wanted to request the supplemental to get out as much assistance as possible to folks.'",
        "'speaker_4': 'We also we do have that broken out into a few different specific assistance under that. But to your question, the way that it's paid out is through direct payments to the landlord in those cases when it's a rental or eviction assistance for a rental.'",
        "'speaker_4': 'And can you remind me of what your last question was? Sorry about that.'",
        "'speaker_1': 'Right. How DHS is distributing both the rental and eviction assistance. So kind of the procedural process that you all go through.'",
        "'speaker_4': 'Sure. So by ordinance, this is meant to be shorter term assistance. So basically we take applications and we look at it through some of our qualifications. So the income qualifications as well as if it's something where the person would be requesting assistance on a short term basis.'",
        "'speaker_4': 'So the duration by ordinance is for no longer than 90 days of assistance. So it's really a short term assistance for that person. And we also look at if they have, they also have to like show us that they don't have other means of paying for whatever the need is.'",
        "'speaker_4': 'And if for some reason they are not necessarily qualifying for this particular assistance. We do work closely with partners and other agencies. We work closely with TrueCar to try to connect folks to where they might be able to get further assistance.'",
        "'speaker_4': 'And is that answering your question about how we get this out?'",
        "'speaker_1': 'It is. It is. And I guess I'm just I just want to make sure I'm understanding is are the recipients of the funding already signed up for benefits through Denver Human Services or new people walking in the door explicitly for this funding?'",
        "'speaker_1': 'Just trying to distinguish this portal from that through a portal.'",
        "'speaker_4': 'I'm sure. So I could ask for that data. I don't know if we. To be honest, I don't know if we ask when somebody applies, if they are receiving other benefits. However, I'm not aware that we disqualify somebody for this assistance just because they might be receiving other benefits.'",
        "'speaker_4': 'But I can just double check with our folks, if that's a question we ask if they're receiving other benefits. But I'm I'm not I'm not aware that that disqualifies somebody.'",
        "'speaker_1': 'At this juncture for this assistance. Okay. Thank you, Lauren. Appreciate it. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Torres. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call out an item for a separate vote.'"
    ],
    "A bill for an ordinance changing the zoning classification for 22, 24, 26 and 28 South Garfield Street in Cherry Creek. Approves an official map amendment to rezone property from PUD 470 to G-RH-3 (planned development to row house) located at 22, 24, 26 and 28 South Garfield Street in Council District 10. The Committee approved filing this item at its meeting on 6-2-20.": [
        "'speaker_0': 'In the council, their names and cities of residents, and if they feel comfortable doing so, their home addresses when called upon. Please wait until our meeting. Host promotes you to speaker. When you are promoted, your screen will flash and say Reconnecting to meeting.'",
        "'speaker_0': 'Please do not leave the meeting. You will be reconnected and will need to turn on your camera if you have one and your microphone. If you signed up to answer questions, only state your name and note you are available for questions of counsel.'",
        "'speaker_0': 'Speakers will have 3 minutes. There is no yield in of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. You will see your time flash on the screen when you have 30 seconds left.'",
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilwoman Ortega, will you please put Council Bill 285 on the floor for passage? And we might need you to unmute, Councilwoman. Okay. Sorry. So we're ready to move.'",
        "'speaker_1': '25 to 85.'",
        "'speaker_0': 'Mm hmm. So, Madam President, I move that council bill 285 be placed upon final consideration and do pass. Thank you. It has been moved again. Thank you for the second. The required public hearing for Council Bill 20 0285 is open.'",
        "'speaker_0': 'May we please have the staff report?'",
        "'speaker_2': 'Hi. Good evening. Members of Council Jason Morrison, senior city planner with Community Planning and Development. First rezoning in front of you this evening is at 22, 24, 26 and 28 South Garfield Street. The request is from an old code PDP 472 RH three, which is within the Denver zoning code.'",
        "'speaker_2': 'That's General Urban narrow house district of up to three stories. Rezoning is in council districts ten. It's within the Cherry Creek neighborhood. And the subject site is on South Garfield Street between East Ellsworth Avenue and Bayard Avenue. The subject site consists of a four unit pad, which was adopted in 1999.'",
        "'speaker_2': 'The property owners at 28 South Garfield Street, which is one of the four units desires to construct a horizontal addition to the rear of their property, which is not allowed under the current PWD for 70, but would be allowed under the grade three zone district.'",
        "'speaker_2': 'The proposed rezoning two grades three is consistent with the Zone District purpose, and you'll find that it is also an extension of the surrounding context as well as the existing grade three zone districts. As I mentioned, the current zoning is a former Chapter 59 PWD.'",
        "'speaker_2': 'It's adjacent to grade three to the north and east and adjacent to multiple pads to the west and to the south. 5470 allows for four adjoining units with two car garages within the maximum building coverage can't exceed 60%.'",
        "'speaker_2': 'And there is a height limitation of two stories and 36 feet maximum height. The subject property is within the Cranmer Park View plane. Therefore the subject site has a height maximum of 131 feet maximum. However, the proposed zone district of the RH three has a lower height, maximum of 35 feet.'",
        "'speaker_2': 'The site is currently occupied by multi-use residential surrounding uses, including multi-unit residential, two unit residential and single unit residential. This is an image of a bird's eye view of the subject property. And we're looking east. And these four images represent some of the multi-unit two unit and single unit residential adjacent and nearby the subject site.'",
        "'speaker_2': 'The Map Amendment application was unanimously recommended for approval by Planning Board and moved forward by committee. The property has been properly posted and since the staff report was published, we received one comment in opposition concerning over construction in the neighborhood.'",
        "'speaker_2': 'As you know, there are five of you criteria when analyzing the appropriateness of a request. And we'll start with consistency with adopt plans. In addition to Plan 2040 and Blueprint Denver, there is one neighborhood plan and that is the Cherry Creek Area plan.'",
        "'speaker_2': 'But first, we'll take a look at comprehensive plan 2040. The proposed MAP amendment is consistent with several strategies from Plan 2040 listed here and detailed in the staff report. Specifically, the request is consistent with strategies under the equity vision element because it will enable development of housing units close to transit and mixed use developments.'",
        "'speaker_2': 'It will also create a greater mix of housing options in every neighborhood. The request is also consistent with strategies under the environmentally resilient vision element for several reasons. The site is at an infill location where infrastructure is already in place, and it will encourage the creation of a mixed use community where residents can live, work and play'",
        "'speaker_2': 'in the Cherry Creek neighborhood. The requested rezoning is shown on the context map within Blueprint Denver as General Urban. The requested grade three zone district is consistent with the future context that is mapped in this area. The future place of this area is mapped as low, medium residential, which is generally a mix of low to mid scale'",
        "'speaker_2': 'multi-unit residential options where building heights are generally up to three stories in height. South Garfield and East Ellsworth Avenue are on designated local streets. Bayard Street is to the south is a residential collector. With the allowance of building forms of up to three stories.'",
        "'speaker_2': 'The requested grace three zone district is consistent with the future place mapped in this area. This request is also consistent with the blueprint growth strategy, which maps this area as all other areas of the city. These areas are anticipated to see 20% of new housing growth and 10% of new employment growth by 2040.'",
        "'speaker_2': 'Finally, when thinking Big Picture Blueprint Blueprint Denver recommends rezoning properties from the former Chapter 59 zoning code, as well as custom zoning to the Denver Zoning Code, which is proposed with this application. I'm looking at the Cherry Creek Area Plan.'",
        "'speaker_2': 'General recommendations from the plan include creating a connected, distinctive and green and prosperous neighborhood. The subject site is located in the Cherry Creek East Sub area, which is characterized as moderate density residential. Furthermore, the subject site falls within the urban residential land use category, which is defined as containing a variety of housing types, including low and mid-rise'",
        "'speaker_2': 'multifamily. And the subject site also falls within the three storey maximum building height category. Jerry. Its three is consistent with the general recommendations and sub area recommendations of the Cherry Creek Area plan. The proposed rezoning will result in uniform application of zoned district building form, use and design regulations.'",
        "'speaker_2': 'It will also further the public health, safety and welfare by implementing adopted plans, providing additional housing units that are compatible with the neighborhood. The adoption of the Denver zoning code in 2010 and the retention of a former Chapter 59 zone district on the subject.'",
        "'speaker_2': 'Property, including custom zoning, is an appropriate justifying circumstance for this proposed rezoning. The requested grades three zone district with the neighborhood is consistent with the neighborhood context description, zone district, purpose and intent. And based on those findings, CPD recommends approval, but because all review criteria have been met.'",
        "'speaker_2': 'Thank you very much, President Gilmore.'",
        "'speaker_0': 'Thank you, Jason, for the staff report. Council has not received any written comments on Council Bill 285 and we have three individuals signed up to speak this evening. And our first speaker is Jessie Parris.'",
        "'speaker_2': 'Yes. Members of council cannot be heard. My name is Justin Harris and I'm representing for Denver Homicide. While Black Stocks a movement for self defense as the best in command for social change as well as the party of Colorado and Mile High News and I will be the next mayor of Denver in 2023.'",
        "'speaker_2': 'I am in favor of this rezoning tonight. It meets all the criteria. So there's nothing I can say that's going to change your mind on this. Um. I just hope the person complains about the construction. Isn't too upset about this.'",
        "'speaker_2': 'Know. So I'm in favor of this. I know it should be approved tonight. It's. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. Next up, we have Cathy Doherty. And you might have to unmute, Tess.'",
        "'speaker_2': 'I think that testimony got mixed up. Is this? This is David.'",
        "'speaker_0': 'Okay, David, I've got you on the list as well, so you got to know.'",
        "'speaker_2': 'Yeah. Okay. So I put at four. I just really wanted to say that it's important that we how our words are used to to to create zoning, just as it's important how our words are used when talking about our homeless population.'",
        "'speaker_2': 'Right now we are currently moving these people and every time they get moved, someone dies. If you know someone's going to die by the actions you take and they do die, you are a murderer. Michael Hancock is a murderer and he needs to be taken out of office.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Next up, we have Tess Dougherty.'",
        "'speaker_4': 'Hi. Sorry about that mixed up. I don't know how that happened. So I. So in the plan, in the staff review, you had said that this would bring greater use of housing availability. And I'm just curious if we're if we're prioritizing that here, how we've so egregiously not been prioritizing that in other parts of the city.'",
        "'speaker_4': 'And then it also the Prairie Cherry Creek Area plan that it creates a connected and prosperous neighborhood. And I know that right now Denver is not feeling like we're connected or prosperous when it comes to our unhoused neighbors.'",
        "'speaker_4': 'So I'm again curious how this we're placing priority on this and not our unhoused neighbors. You also noted that additional housing units that are compatible with the surrounding neighborhoods and custom zoning. So we are custom zoning here, but we're not doing the same for our unhoused neighbors.'",
        "'speaker_4': 'And I'm just I just I really am at a loss for how we. Where our priorities are lying if someone. Feels like they could comment on that at all. That would be great. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers for this first public hearing. Questions from members of Council on Council Bill 285. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Madam President. Jason, just so I'm clear on as I read through the staff report, essentially the owner of one of the four units in this building, which is has four separate units in one building, is in a period that was approved a couple decades ago and wants to expand, but cannot because of the some specific'",
        "'speaker_3': 'restrictions in the pad. And is this zone district that we've chosen here, is this a comparable in the 2010 code? Would this be considered comparable to the layout or the restrictions that originally were in the PD?'",
        "'speaker_2': 'Great. Thank you, Councilman Flynn, for your questions. To answer your first question. QUESTION You're absolutely right. I'm one of the owners within the foreign unit. PD would like to have an expansion on the rear of their units. And so there is a restriction within that study.'",
        "'speaker_2': 'And so with the Denver zoning code, they would be allowed to have that expansion into the rear of their property. In terms of a comparable zoned district, is this is absolutely comparable when you look at the height and storeys as well as the height and feet, as well as the primary building forms that are allowed within the'",
        "'speaker_2': 'city and then also within the Denver zoning code. So it is a very comparable solution. When working with this resident to get out of the former Chapter 59 zoning code.'",
        "'speaker_3': 'All right. Thank you, Jason. That's that's what I want to be clear on it. We're not creating a new set of entitlements here. We're just allowing some flexibility that A doesn't allow, but with a zone classification from the 2010 code that most fits what had been developed there.'",
        "'speaker_3': 'Is that correct?'",
        "'speaker_2': 'That is correct. And also, if you do look at the surrounding zoning, those properties that are within the immediate vicinity that have come out of the former Type 59 zoning code, they are overwhelmingly grades three. So it is very consistent with what we're seeing in the pattern in the neighborhood as well.'",
        "'speaker_3': 'All right. Thank you, Madam President. That's all I have.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn. The public hearing for Council Bill 20 dash 0285 is closed. Councilman Hines.'",
        "'speaker_2': 'Madam President, I'm here for comments. You ready?'",
        "'speaker_0': 'Yep. I am ready.'",
        "'speaker_2': 'Okay. Thank you, Madam President. I am colleagues. This is in my council district. I want to. I want to urge your support of this of this rezoning. I want to read some just some quick comments from the chair accused the registered neighborhood organization that is over this area.'",
        "'speaker_2': 'I know that there was there was some action on Twitter and we got some emails opposing the rezoning. So I think it's important for us to take to voice to the comments and support from the the R.A. that that oversaw this process.'",
        "'speaker_2': 'So the Church Trade Association Board supports the rezoning for these reasons. One, he obtained signatures from all corners in the the the feud indicating their acceptance of the zone two. He had obtained agreement from other neighborhood neighbors on his side of the block.'",
        "'speaker_2': 'Three The rezoning did not require a height change or other change that his neighbors might have deemed problematic, as Mr. Morrison and CPD validated just a moment ago, for Deborah is trying to convert a few days to RH three and in this case RH three, so that the change is consistent with city planning.'",
        "'speaker_2': 'The one of the principal city planners in Orange was kept informed and five the posting for the rezoning was visible for months. No objections have been made to Cherry Creek East Association during that time, to the best of my knowledge.'",
        "'speaker_2': 'And and so I recognize that there are some concerns about housing affordability. It really just doesn't apply. First of all, it doesn't apply because it doesn't fit any of the criteria. But second, this this one owner just happens to want to add space to the back of his unit.'",
        "'speaker_2': 'And so that's really the extent of this rezoning. And and so, colleagues, I hope that I hope that I have I hope that this rezoning has your support. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Hines. And seeing that all of the criteria have been met for this rezoning, I'm happy to support it as well and would ask our colleagues to do so. Madam Secretary, roll call.'",
        "'speaker_1': 'Hindsight. Cashman. I can each. I. Ortega, I. Sandoval. I. Sawyer, I. Torres, I. Black. I see the. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Madam President. I.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2201 Arapahoe Street in Five Points. Approves a map amendment to rezone property from PUD 570 to D-AS-12+ (planned development to matching downtown zoning), located at 2201 Arapahoe Street in Council District 9. The Committee approved filing this item at its meeting on 10-27-20.": [
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results. 13 Eyes. 13 Eyes Council Bill 20 Dash 0285 has passed. Councilwoman Ortega, will you please place Council Bill 1133 on the floor for final passage? Excuse me, Madam President, I move that council bill 20 1133 be placed on final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved. And I get a Second Amendment right on the required public hearing for Council Bill 20 Dash 1133 is open. May we please have the staff report?'",
        "'speaker_2': 'Certainly. Thank you, Madam President. I'm Brandon Shaver, senior city planner at CPD, presenting an official estimate for 2201 Arapahoe Street. The request here is a former Chapter 59 PD 570 rezoning to DHS 12 Plus, which is downtown Arapahoe Square and 12 plus stories dependent on building for.'",
        "'speaker_2': 'This request is in council districts nine in the five points neighborhood. It is at the northwest corner of 22nd and Arapahoe Streets. The land area is just under 19,000 square feet and is currently an industrial warehouse building used for brewing and distilling purposes.'",
        "'speaker_2': 'The proposal is to rezone to DC 12 plus to match the zoning of the surrounding area. And looking at the existing zoning, it is 570. What is surrounding is entirely des 12 plus which is. Which is a district that was legislatively created in 2016 and mapped in this area.'",
        "'speaker_2': 'However, it is Cp's practice to only resume properties that have standard based zoning. So in this case, as this property had custom zoning, it was not rezoning 2616 legislatively. The party was approved in 1995. It is highly tailored to the current use and the existing building and also allows be it uses in the former chapter 59 zoning'",
        "'speaker_2': 'code. The maximum height, if redeveloped, is 200 feet and the maximum floor area ratio is matched to the existing use, which is 0.841 to 1. Of the existing land use again is industrial as they operate brewery and distillery.'",
        "'speaker_2': 'Adjacent land uses include industrial commercial retail, mixed use multi-unit residential and then some vacant parking lots as well. These photos give you a sense of the building form and scale with the subject property on the bottom left and the bottom right.'",
        "'speaker_2': 'And then in comparing the current zoning versus what is proposed, you can see that three building forms would be introduced. The height and stories could vary depending on the building form that is used. But generally speaking, the proposed district would generate a more pedestrian and active and urban development with low lower street setbacks and higher to ranges'",
        "'speaker_2': 'and high transparency requirements. This area is also covered by the Arapaho Square Design Standards and Guidelines, which were also approved in 2016 and they were amended last year. These design standards and guidelines are intended to promote a vibrant sense of place and encourage an active pedestrian environment, much like the downtown neighborhood should.'",
        "'speaker_2': 'And also the Downtown Design Advisory Board provides guidance on any new projects or major exterior building and site improvements in this area. Speaking to the process Information Notes was sent in April. This was moved forward unanimously by planning board in early October, and to date we have received a letter of support from the Ball Park Collective, R.A.'",
        "'speaker_2': 'and also eight letters of support from the public. Moving to the criteria. There are four plans for the first consistency with adaptive plans criterion beginning with Plan 2040. This does meet a lot of the goals and strategies that are related to providing safe and convenient access to a variety of amenities.'",
        "'speaker_2': 'Building a network of well connected, vibrant, mixed use centers and corridors. And promoting small, locally owned businesses and restaurants that reflect the unique character of Denver. Moving to Blueprint Denver. This is mapped as part of the downtown neighborhood context.'",
        "'speaker_2': 'This is the most dense and active context in our city and includes the highest intensity residential and large employment center. And it really does give prominence to the pedestrian realm. This is mapped as a high residential area. These areas have a high mix of uses and intense building heights with the high lot coverage.'",
        "'speaker_2': 'The street types are both downtown arterials. There are numerous bus lines that go along Broadway and along Park Avenue West that also focus on transit. And then there's also a high focus on pedestrian and bike connectivity in this part of downtown as well.'",
        "'speaker_2': 'This is within the high and high medium residential area growth area strategy.'",
        "'speaker_0': 'And blueprint Denver.'",
        "'speaker_2': 'Where we expect 15% of new housing and 5% of new employment by 2040. The Northeastern China plan was adopted in 2011 and describes this area as mixed use with having a sizable employment base and a variety of mid to high density housing options.'",
        "'speaker_2': 'The recommended building height here is a maximum height of 12 storeys with up to 20 storeys if a point tower building form is used. And then like I said before, there are enhanced building forms, standards and supplemental design standards and guidelines which are consistent with the plan direction.'",
        "'speaker_2': 'Lastly, we have the downtown area plan for 2017. Which part of this area as being an ideal location for a greater range and density of users? It recommends small area plans and improvements to the pedestrian realm to reinvigorate and revitalize the neighborhood.'",
        "'speaker_2': 'And the proposed proposed district is consistent with this guidance. The reasoning is also consistent with the next two criteria, as it will result in the uniformity of district regulations. And it will also for the public health, safety and welfare by implementing those plans that I just mentioned, facilitating increased housing density close to downtown and providing better health'",
        "'speaker_2': 'outcomes through increased physical activity. There are two justifying circumstances for this rezoning, one being change or changing conditions within this area. There are a number of development projects that are in the pipeline in a number of public and public improvements that have been made to this part of downtown in anticipation of future growth.'",
        "'speaker_2': 'Also, as I said, this property does contain a former Chapter 59. Zoning is a concern and could justify the circumstance. Lastly, the request is consistent with the downtown neighborhood context and the zone. Different purpose and intent statements which are further detailed in the staff report.'",
        "'speaker_2': 'With that. CPD staff recommends approval based on training. All review criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you, Brendan, for the staff report. Council has not received any written comments regarding Council Bill 20, Dash 1133 and we have four individuals signed up to speak tonight. Our first speaker is Brian Dunn.'",
        "'speaker_2': 'It even has a council. My name is Jeffrey McCall. Pierce and I met with Jesse.'",
        "'speaker_0': 'Wait just a second, Jesse. We had a gentlemen before you. I'm sorry. It's Brian Dunne.'",
        "'speaker_2': 'Hi. Are you able to hear me and Jimmy?'",
        "'speaker_0': 'Uh huh. Go ahead, Mr. Dunne.'",
        "'speaker_2': 'Great. Thank you. My name is Brian Dunn, and I represent great divide brewing to rise on the property at the northeast corner of 22nd Street and wrap on the street, which is currently zoned PD 570. This request is for the rezoning of the property from 572 Diaz 12 plus great view to request City Council's approval of the'",
        "'speaker_2': 'rezoning in order to return the property to the surrounding zoned district because the manufactured beverage is now an allowed use. Nate Diaz 12 plus Zone District. Prior to a zone map amendment changing the zoning for the neighborhood from b8a to Diaz 12 plus the manufactured malt beverage was not an allowed use under the prior zoning of Bay'",
        "'speaker_2': 'De, which prompted the original update. If the rezoning is approved, it would remove the PD or remove the property from a PD zoning designation and put the property into the zoning district prevailing in the neighborhood. Currently, a majority of the properties surrounding the property in question are zoned DE 12 plus.'",
        "'speaker_2': 'There is no current plan to develop the property or businesses to burn packaged beer, and it's our intent to stay in the neighborhood for a long time. It's our hope to rezone the properties so we have the same zoning as our neighbors with a DC 12 plus zoning designation.'",
        "'speaker_2': 'Great divide has worked hand in hand with the city neighbors and various other interested parties to ensure that the rezoning reflects the best use of the property that will continue to enhance and harmonize with the neighborhood. Therefore, we respectfully request that City Council approves the proposed rezoning.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Brian. Now we've got you up. Jesse. Jesse Paris.'",
        "'speaker_2': 'Yes. Thanks to a council president. My name is Jesse Michelle Pearson, represented for Denver Homicide, a local black star action film for self-defense. Positive action for social change as well as. Okay. Email. But live in eight and Christopher Hampton's district and I will be the next mayor of Denver in 2023.'",
        "'speaker_2': 'I'm just resigning tonight. Um, yeah. And question is where a mass of troops have been occurring. Olga and Jesus saved the last spring shelter right behind us. I'm concerned that our house neighbors that are in this area are going to continue to be criminalized and terrorized.'",
        "'speaker_2': 'That's for existing and public space. And I cannot support this rezoning tonight, especially zoning, that there's no guarantee that this is not going to become a 12 story building in our rapidly gentrifying neighborhood, a town of which I grew up in five points.'",
        "'speaker_2': 'So I cannot support this rezoning tonight. Thank you.'",
        "'speaker_0': 'Thank you, Jesse. Next up, we have David Hagan.'",
        "'speaker_2': 'Milo.'",
        "'speaker_0': 'Mm hmm. Go ahead, David.'",
        "'speaker_2': 'I'm David Hagan. And I do not support this or basically the same things that Jesse work on. And I also wanted to say that when we. Continue to move these homeless folks and our unhoused neighbors and we continue to allow them to die.'",
        "'speaker_2': 'We are all responsible. We now know that the mayor's responsible. Is the city council going to do something or are they going to be responsible as well? That's all I have to say. Thank you.'",
        "'speaker_0': 'Thank you. Next up, our last speaker is Tess Storti. All right. We're trying to see if we still have tests. On with us or not.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Go ahead, Tess.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Yes, go ahead. You just have to unmute. Okay. It looks like. Test was maybe frozen. If I could ask my colleagues or I just need some indication, it seems like some of our folks are frozen and others are not.'",
        "'speaker_0': 'Are you all okay? I see some movement there. Okay. There you go. Tests. You were frozen there for a second. Your audio isn't working. Test. Okay.'",
        "'speaker_1': 'So I'll give it one.'",
        "'speaker_0': 'More try here. And if I could just remind folks if they would please speak to the criteria of the the rezoning. We much appreciate it.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'I'm sorry to us. We're not able to get your. Audio work in there. And so maybe will we have one more public hearing? And so hopefully we'll be able to get your audio fixed for that one. And so that you might need to log out tests and log back in so we can get you on the on'",
        "'speaker_0': 'the third public hearing.'",
        "'speaker_1': 'That's where.'",
        "'speaker_4': 'You stay. If she was seeing or supporting.'",
        "'speaker_0': 'I. Let me say. I think she was against shit signed up against. So we can record that for the public record at least that our fourth speaker test story was signed up in opposition of the rezoning. And that concludes our speakers tonight, questions from members of council.'",
        "'speaker_0': 'Councilwoman CdeBaca, we've got you up first.'",
        "'speaker_4': 'Thank you, Madam President. I have a couple of questions for Brandon. Brandon, can you explain to me the context of the 2016 legislative reason and why this property owner was not, you know, spoken to to bring into that zoning even with the PD?'",
        "'speaker_2': 'Yes, great question. So it's my understanding that when there are legislative rezonings, that there are somewhat preliminary discussions with property owners that have custom zoning within that area, depending on the complexity of their zoning. A lot of the times you'll see that those areas just remain custom zoning and the legislative rezoning does not affect their property, and'",
        "'speaker_2': 'they come at a later date to rezone to a standard district.'",
        "'speaker_4': 'And so there's no functional change being asked for because there's no development plan. And so I'm curious how you ascertain that this met the criteria of advancing the the public health, welfare and safety without a plan. How did you how did you or CPD ascertain that it was consistent with that criterion?'",
        "'speaker_2': 'Can you can you speak to which criteria are you talking about? Just the further furthering public safety and for peace?'",
        "'speaker_4': 'Yes. If there's no plan, how exactly does this rezoning accomplish that?'",
        "'speaker_2': 'So I think that the current you speaks to that and then I think that furthering public health and safety and welfare is also covered and blueprints and in all of the neighborhood plans that speak to this area being more pedestrian friendly and active uses on the ground floor.'",
        "'speaker_2': 'So even without any development being proposed at this time, staff felt that the current use is still furthering public health, safety and welfare.'",
        "'speaker_4': 'But the reasoning. There's there's not actually a plan. So we're judging the current use. We're judging the plan. As if it were the current use.'",
        "'speaker_2': 'I'm not sure what the question is exactly, but I will say that the current use was that the current zoning was put in place for this use. We have since adopted plans that say that this is an okay use for this area and that I think is the reason why the applicant is wanting to come out of'",
        "'speaker_2': 'the custom zoning because we have plans in zone districts that will allow for their current use.'",
        "'speaker_4': 'And so tell me a little bit more about the parking requirement that changes with this zoning. Is there a new requirement for a building going from one story to 12 stories?'",
        "'speaker_2': 'There are parking requirements that are dependent upon the building form used, which at this time there is no redevelopment proposed. So I am not exactly sure what the required parking would be based on whatever the project is going to get redeveloped into, which is not, I think, the applicant's intent at this time.'",
        "'speaker_4': 'And so can I speak to the the applicant? Can you tell us a little bit about what your plans are long term for this parcel? There may not be a development planned right now. Is there a development planned within the next five years or a sale planned?'",
        "'speaker_2': 'Neither. Our intent is to continue to operate it as a as a brewery. We've been there for 26, 27 years, and that's where our beer is brewed. So that's our business. And we intend to be there for a while.'",
        "'speaker_2': 'We intend to stay in the business and there is no development plan because we need the building to do what we do.'",
        "'speaker_4': 'And so outside of bringing it into consistency with everything else around it, you're not seeking a functional change.'",
        "'speaker_2': 'No, there's no functional change. We under the PD were allowed to brew beer, but it was a sort of a we knew we needed the PD because it wasn't brewing, wasn't allowed under Bar De is now allowed under DEA 12 plus and we just felt like it's something that we should fix at some point.'",
        "'speaker_2': 'There's no reason why we shouldn't be essentially the same zoning as is all all the neighbors the city supported. The city likes to remove puddles. It's easier for the city to manage. So we're just. There's no hurry. There's just it's just something that we need to do.'",
        "'speaker_2': 'Or we're stuck in a zoning that really is a little bit clunky and it doesn't make any sense to have it.'",
        "'speaker_4': 'Brandon, would this ever have to come back to us? If it passed today to us on it to 12 stories and it was sold in a year, would it ever have to come back to City Council for another decision?'",
        "'speaker_2': 'The question. First, to clarify this, this district is a little bit tricky and that as 12 and then plus. So there are three different voting forms that are associated with this of varying heights. But if this was approved by council tonight, when the property is redeveloped, they would not be coming back for another approval.'",
        "'speaker_2': 'And there is the downtown design review board would be looking at the projects when they want to do something else with the property.'",
        "'speaker_4': 'And what was the reason for zoning this area? The 12 plus.'",
        "'speaker_2': 'So I think this this this zoning that surrounding in this area largely came from the downtown area plan. In 2007, it recognized Arapahoe Square as kind of the new downtown neighborhood. So what is it? Nine years after that plan was adopted, then this part of the city was went through a planning process, complete with new zoning and'",
        "'speaker_2': 'new design standards and guidelines.'",
        "'speaker_4': 'And since that 2016 legislative rezoning brought by Councilman Brooks, how many of the parcels have actually taken advantage of that zoning?'",
        "'speaker_2': 'That's a great question. I think there are at least three projects that are in the pipeline that are taking advantage of the zoning and the different building forms. But I don't think that we've seen anything come out of the ground yet.'",
        "'speaker_4': 'And how many parcels were included in that total reason?'",
        "'speaker_2': 'I am not certain, but it's a pretty big area.'",
        "'speaker_4': 'Hundreds.'",
        "'speaker_2': 'I would say so.'",
        "'speaker_4': 'And where is the closest or how far away is the next 12 storey building?'",
        "'speaker_2': 'I'm not certain I can look at a map and get back to you on that. I would guess within a couple of blocks.'",
        "'speaker_4': 'It's I think it's at least three or four blocks, maybe even five. Everything around there is one or two stories. And so if you could clarify and look at something, that would be helpful. That's it for my questions, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman CdeBaca. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Madam President. Brandon, could you clarify a couple of things for me here about page five seven? Because I'm a little confused. This was this PD was put in in what, 1995, I think the staff report said.'",
        "'speaker_3': 'And but it says that the maximum height is 200 feet. But there's only a rather small building on there. I don't know that. You might know that. Actually, maybe Mr. Dunn can answer this, but my question is, why was this PD entitled in 1995, 25 years ago, for a 200 foot, 200 foot height?'",
        "'speaker_3': 'Do we know the history on that?'",
        "'speaker_2': 'No. It is my understanding that the height restrictions under the peu de or whatever the be, whatever there was an existence under.'",
        "'speaker_3': 'The old the old being.'",
        "'speaker_2': 'Correct.'",
        "'speaker_3': 'Okay. So you already have a height, you already have an entitlement to build a 200 foot building, correct?'",
        "'speaker_2': 'That's correct. Yes.'",
        "'speaker_3': 'Okay. So, Brandon, what I what I'd like you to explain to me and to the rest of the folks here under the D. A. S dash 12 plus. It looks to me like the general director for that zone district is eight stories, 110 feet.'",
        "'speaker_3': 'And then you can go up to 150 feet with a height incentive. How? Explain how that works.'",
        "'speaker_2': 'Yeah, great question. Like I said before, this is one of the trickier zone districts where the number doesn't quite line up with this number of stories in the height. So, yes, so that. So the base building form, which is the general building form, allows for eight stories in 110 feet.'",
        "'speaker_2': 'The next building form is the general with the height incentive, which allows for 150 feet. There is not a story count to that. The history behind that is that that incentive is granted when you make all of the parking not visible from the street and then you're allowed to go up to, I believe, 250 feet.'",
        "'speaker_2': 'But the point tower building setback, which gives you the setbacks and the solar access to the street.'",
        "'speaker_3': 'Okay, that sounds rather complicated. So the height, the incentive here is for parking contained within the building and concealed.'",
        "'speaker_2': 'Yes. That's intended to promote underground parking or parking that's not visible from the street.'",
        "'speaker_3': 'I see. Okay. And so the current entitlement is 200 feet in general. How many stories would that be?'",
        "'speaker_2': 'You know, it's a 16 foot ground floor and then maybe 12 foot four points above that, maybe a ten foot 12, 15 story building.'",
        "'speaker_3': 'Okay. So we already have an entitlement here for a 12 story building.'",
        "'speaker_2': 'Correct.'",
        "'speaker_3': 'Okay. But it's pretty. All right. I think I understand it now. Thank you. Thank you, Brandon. That's all, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn. Councilwoman Ortega. Thanks to President Brandon. So if the site were to be developed either under the existing zoning or under the proposed zoning to take advantage of maximum density, that could not be done without having some parking requirements.'",
        "'speaker_0': 'Correct?'",
        "'speaker_2': 'I will have to double check on that. But I believe that all of the downtown neighborhood context districts do not have minimum parking required.'",
        "'speaker_0': 'Okay. Unlike some areas of our city. And I think that's consistent with the five, seven and the former bay zones, which a number of these were converted over to other zoning categories. Okay. Thank you. I was just trying to get that point clarified.'",
        "'speaker_0': 'Thank you. Thank you, Madam President. All right. Thank you, Councilman Ortega. The public hearing for Council Bill 20 Dash 1133 is closed. Councilwoman CdeBaca. And so this is in your your district. Did you want to comment on it?'",
        "'speaker_4': 'Yes. Thank you, Madam President. This is a tricky one. And I think Councilman Flynn was pointing out the current PD essentially giving them the same height if they wanted to. But there would they would have to, by default, come back to council for any other development here, because the PD is so specific.'",
        "'speaker_4': 'So I imagine a 12 or 16 storey brewery.'",
        "'speaker_2': 'And.'",
        "'speaker_4': 'Nobody is that specific. And this is a critical parcel of land, as commentors mentioned, right across the street from affordable housing, right down the street from Jesus saves in one of our areas of town that is experiencing the most heavy pressure of gentrification and displacement.'",
        "'speaker_4': 'I think it would be irresponsible for us to approve a plan a rezoning tonight without a plan knowing that the specificity of the PD is really the only thing that would allow this to come back in front of us.'",
        "'speaker_4': 'I think that, you know, this is a case where it's important for council colleagues to exercise what we call among ourselves as council courtesy. I often hear council members speak about this, giving each other council courtesy in their vote, where they defer to the council member whose district that the zoning is in.'",
        "'speaker_4': 'And I would hope that in this situation, council members recognize that we know the pressures of our district better than anyone else on this body. And right now, in a crisis, a housing crisis, a global pandemic, there is a situation where this brewery could potentially go out of business, could potentially want to sell, and they would be'",
        "'speaker_4': 'able to do that and sell it to someone who would build 16 stories of luxury developments. Right. In a place where we might want to have some ability to determine what will truly advance the public safety welfare of our community.'",
        "'speaker_4': 'And so I'm asking that council members exercise council courtesy on this vote. There is no functional change that we are prohibiting the applicant from achieving and it would give us an opportunity to make sure that when we change this party in a critical area of town, we have a plan in front of us to be responding to'",
        "'speaker_4': 'not just potential and something that doesn't exist, something that exists in the ether, as most of our plans do and as most of our plans have facilitated more and more gentrification. I would hope that we take this moment not to allow that to happen in this area, and I ask my colleagues to vote no on this.'",
        "'speaker_4': 'A no vote will not hurt the applicant. It will not hurt the business of the applicant. It can only give us another opportunity to assess the the criteria related to public welfare of this neighborhood. Thank you.'",
        "'speaker_0': 'Thank you. Councilman CdeBaca, I wanted to pause for a second and see. I believe we have Kirsten Crawford, our city attorney, on the line, and then also Adam Hernandez, if you want to address the council, Curtis, see?'",
        "'speaker_4': 'President Gillmor I guess my question hit me.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'I'm.'",
        "'speaker_0': 'Or you or Adam Hernandez. This is a unique request that we haven't entertained in a rezoning in my, I guess, recent memory, talking about any sort of courtesies on that because of the quasi judicial nature of zoning. So if you might want to just for the public record, reiterate the criteria that that we can only look at'",
        "'speaker_0': 'this through the criteria that is presented to us through community planning in development.'",
        "'speaker_4': 'And let me ask Gilmore. I'm not asking people to not judge this rezoning based on the five criteria that we are legally required to judge it against. I am asking this body to understand that there is no one else body who knows that the metrics or the measure of number and three, three and four better than the'",
        "'speaker_4': 'council member representing the district criterion three is to further public health, safety and welfare. Criterion four is justifying circumstances. What I have explained to my council colleague as the representative of this district is that we are squandering an opportunity to ensure that anything in this area does meet those two criteria because there is no associated plan and'",
        "'speaker_4': 'the impact of not approving this is a zero. We won't hurt the current applicant's business or any plans that they have in place. It only guarantees us an opportunity down the road to advance the public health, safety and welfare in any new project that comes this direction.'",
        "'speaker_4': 'So I'm asking my colleagues to use the five criteria and to listen to the expertize of the person who represents this district.'",
        "'speaker_0': 'Thank you, Councilwoman Kirsten.'",
        "'speaker_4': 'Yes. Hi. Thank you and good evening, everyone. It is a good question. I, I would just like to weigh in, but then also give Adam Hernandez an opportunity to give some perspective on this as well. But each council member must cast their vote in accordance with the criteria.'",
        "'speaker_4': 'So each of you sitting as a crazy judicial officer must review the criteria and make your own determination. And so, from a legal perspective, you can't defer your vote, so to speak, to another member of the body. And maybe Adam wants to provide some perspective as well.'",
        "'speaker_2': 'Hello. Councilmembers Adam Hernandez, Assistant City Attorney. No, I agree with with Kirsten here. The rezoning is a quasi judicial decision of council. There are five criteria to look at, according to the Denver zoning code. If council believes that the criteria have been met, they should vote to approve.'",
        "'speaker_2': 'And if they feel the criteria has not been met, they should vote to deny. But that is the choice that each councilmember has to come up with. And as the staff report is recommending approval, you know, it'd be incumbent for council members if they do want to vote against to to give some some reasoning on the record'",
        "'speaker_2': 'on why they don't agree with that review criteria.'",
        "'speaker_0': 'Okay. Thank you, Kirsten and Adam, for weighing in on that. We've got a few more folks in the queue. Councilman Ortega. Thank you, Madam President. So I was the council member of this district when this zoning was created, when this very business opened.'",
        "'speaker_0': 'It's one of our older breweries that's been in the city of Denver. And over a course of time, this whole area known as the Arapahoe Triangle, was was planned for more growth and development, in large part because there were so many parking lots, vacant parking lots.'",
        "'speaker_0': 'People wanted to see the opportunity to have more housing brought into downtown, have more commercial brought into downtown. You know, prior to that, the only area that we had that we had seen any growth in was in initially lower downtown in the central Platt Valley as the city worked to rezone and and see that area developed, which'",
        "'speaker_0': 'took, you know, almost 30 years because some of those buildings are are still under construction. I can remember when I ran in 2011, you could stand on the Millennium Bridge and it was all pretty vacant. And that's all filled in right now.'",
        "'speaker_0': 'But I just want to say that given the fact that this particular. Property has zoning entitlement already. Yeah. You potentially could argue that they would have to come back to do something different than than a brewery. But we have been since for based zoning was created.'",
        "'speaker_0': 'We have been rezoning property after property after property across the city without development plans, unlike what we used to get prior to that. And if we want to see details that give us. Clear information on what people are going to develop on their properties.'",
        "'speaker_0': 'Then we should go back and change the zoning, as I've argued over and over, because we do make decisions in a vacuum. But. We've been doing it under the farm based zoning, which is what we have in place today.'",
        "'speaker_0': 'And until we change it, that's what we're going to continue to receive. So I would argue and we actually had this conversation excuse me, back when Councilman Espinosa was beginning to have to kind of lead that effort in assisting us to look at some changes to the zoning code.'",
        "'speaker_0': 'We've had multiple conversations as new members have come on wanting to see that done as well. But until we do that, we still have the sort of pre-scripted guidance by which we're supposed to make these decisions. And I would argue with my colleagues who feel like we should be making more informed decisions based on details that we'",
        "'speaker_0': 'need to change the code. And until then, we're we're kind of stuck with the environment that we're in. And so for all those reasons, I will be supporting this tonight because, number one, this is the area that has been proposed for growth.'",
        "'speaker_0': 'There has been so much development around this immediate area. The whole, you know, ballpark neighborhood has has grown tremendously, which this is located within. And so I don't know why we would single this one out. And if we wanted to advance the public health, safety and welfare of this particular property, then we should buy it.'",
        "'speaker_0': 'But land in this area of town is very expensive. And unless the city owns the property to give much clearer guidance on what we want. This is a public public market. And so I have a hard time with saying we should vote it down just simply because there is other there are other factors in the area.'",
        "'speaker_0': 'And, you know, a lot of people thought that we would not see development in the area because the shelters were there. And just the opposite has has occurred. You know, even with the shelters in the area, there has continued to be a lot of development.'",
        "'speaker_0': 'Yeah, we all want to see more affordability. It's why I have committed my my life to be on this nonprofit board. That's work to create affordable housing around our city. But I think we have to control the land, too, to really mandate what we want to see happen.'",
        "'speaker_0': 'Thank you. Thank you. Councilman Ortega. Councilman Clark.'",
        "'speaker_2': 'Thank you, Madam President. I had raised my hand before the attorneys jumped in. So I just want to say thank you to the attorneys for jumping in. I agree with everything that council member Ortega just said and just wanted to be clear that I think that this is this clearly meets the legal criteria for rezoning, and that'",
        "'speaker_2': 'is what we are charged with looking at here. Does this meet the criteria or not? It does. And I will be voting to support this. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Clark. Councilman Herndon.'",
        "'speaker_2': 'Thank you, Madam President. The chair of the Land Use Committee. We see rezonings come through all the time. And we've had these conversations, that committee. And I'm just going to quickly reiterate what everyone else has said. It's our charges, the criteria.'",
        "'speaker_2': 'And for another council member to insinuate that we should base our decision out of anything outside of that, I think is grossly irresponsible and is not something we should even consider. I talk fairly about and as Councilman Ortega says, if we have concerns about changing it, then let's go through that route.'",
        "'speaker_2': 'But it shouldn't be discussed on a monday night about changing it. We have our criteria in front of them. I believe that this has been fully met, so I will be supportive of it. And thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Likewise. Thank you, Brandon, for the for the staff report. And it does meet all of the criteria that it should be evaluated on. And I will be supporting it tonight as well. Madam Secretary, roll call, please.'",
        "'speaker_1': 'Peter Barca? No. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'All right. Cashman. That's a night.'",
        "'speaker_0': 'And I.'",
        "'speaker_1': 'Can eat. Right. Ortega Sandoval. Yes. Sawyer. I. Torres. I. Black I. Sandoval. No. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_1': 'Two nays a Lebanese.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1055 Locust Street in Montclair. Approves a map amendment to rezone property from E-SU-Dx to E-SU-D1x (allows for an accessory dwelling unit), located at 1055 North Locust Street in Council District 5. The Committee approved filing this item at its meeting on 10-27-20.": [
        "'speaker_0': '11 eyes council bill 20 dash 1133 has passed. Council Member Ortega, would you please put Council Bill 1134 on the floor for final passage? Madam President, I move the Council Bill 1134 be placed on final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. The required public hearing for Council Bill 20 Dash 1134 is open. May we please have the staff report?'",
        "'speaker_2': 'Can you hear me?'",
        "'speaker_0': 'Mm hmm. We can hear you. It's thank.'",
        "'speaker_2': 'Perfect. Good evening, council members. My name is Bunyan's. I am an associate city planner with a family planning development. Before you today, we have 1055 North Locust Street. It's currently zoned ECD and the applicant is requesting ESU one X, which is for the 80 year.'",
        "'speaker_2': 'One moment. There you go. It's currently in Council District five in Minnesota and it is in the Montclair neighborhood. The applicant is requesting do you one X and the site itself is approximately over 8000 square feet. And it's a single unit residential.'",
        "'speaker_2': 'The current zoning is skewed, sits surrounded predominately by the civil union zone district, as you can see. And the existing line is single unit residential, which is predominantly in this part of town. So the subject property is in the upper right corner of the slide and as you can see, some of the existing single unit homes in'",
        "'speaker_2': 'the vicinity. So before you is this. In this case. It went before the planning board on September 22nd, and it was approved unanimously at that specific hearing. As a as a present, there's been two comments of opposition and as well as one comment in support have been received and they are part of the staff report.'",
        "'speaker_2': 'The primary concerns related to the group living. Some of the opposition's that primary concerns were related to the group living text amendment, which does not have any direct relation to this application and no residential care or group living uses.'",
        "'speaker_2': 'I propose that this specific time as well as there is concerns around notification. One specific property owner mentioned that they weren't notified, but they were outside of the required 200 foot requirement. When we're notifying property owners, both of these individuals were notified by staff as well as the the applicant notified these two individuals as well.'",
        "'speaker_2': 'So whenever we're reviewing a specific map amendment, we look at five specific criteria that are taken from the Denver zoning code. The first one is consistency with adopted plans, and we're looking at four specific plans. The first one is Comprehensive Plan 2040 Blueprint Denver, a land use and transportation plan of 2019 Housing and Inclusive Denver 2018, and'",
        "'speaker_2': 'the East Area Plan of 2020, which was recently approved last month. There are several strategies found in comprehensive plan 2040 that are specified in staff report. And with that, I would jump into the Blueprint Denver Blueprint. Denver classifies this area as urban edge, which is primarily residential, and houses are typically low scale single and two unit residential'",
        "'speaker_2': 'with some small scale multi-unit residential. As well as blueprints classified as area is low residential, which is predominantly single unit and two uses and accessory dwelling units are appropriate as well as Locust Street is a local street, which is primarily served by residential uses.'",
        "'speaker_2': 'Within the blueprint, there are specific policy that talk about accessory dwelling units. Housing policy number four specifies that diverse diversity housing choice through the expansion of accessory dwelling units throughout all residential areas, as well as housing policy five, which is remove barriers to constructing accessory dwelling units and create context sensitive form standards.'",
        "'speaker_2': 'When we're looking at the housing for an inclusive Denver plan of 2018 specifically and recommendation two under the legislative and regulatory priorities, it does mention including expanding expanding the development of accessory dwelling units. The proposed MAP amendment of said is consistent with the housing and inclusive Denver recommendation because it would expand availability and allow the development of'",
        "'speaker_2': 'an accessory dwelling in. As well as when we're looking at the East Area plan. Their specific policy and strategies mentioned in this plan about access are going units such as Policy six, which talks about ensuring East Area neighborhoods are inclusive places by thoughtfully integrating compatibly design, missing middle housing as well as accessory dwelling units as well as'",
        "'speaker_2': 'strategies 6l6d which talks about the expansion of ADU throughout all residential areas. And then we're looking at more specifically at the Montclair neighborhood sections of the plan strategy, M.C. l1e, which does mention integrate accessory dwelling units in appropriate locations criteria two, three, four and five, which is uniformly of disregulation, furthering public health, safety and welfare, justifying circumstances'",
        "'speaker_2': 'inconsistent with neighborhood context, district purpose and intent are all specified in the staff report and therefore CPD recommends approval based on all funding and review criteria have been met and I'm available for questions. And the applicant, Christian OVERBY, is also here to answer any questions you may have.'",
        "'speaker_0': 'All right. Thank you very much, Edson, for the staff report tonight. Council has received one written comment on Council Bill 1134. There are no submitted comments in favor of the application and one submitted comment in opposition of the application.'",
        "'speaker_0': 'All members of Council that are present have certified that they read each of their submitted written comments. Do any members of Council need more time to read any of the written testimony that was submitted? CNN council secretary let the record reflect that all written testimony, both in favor and in opposition of Council Bill 1134 has been read'",
        "'speaker_0': 'by each member of council, and all written testimony will be submitted to the official record of the hearing. Tonight, we have three individuals signed up to speak, and our first speaker is Jesse Paris. You're up, Jesse.'",
        "'speaker_2': 'Thank you and good evening. Members of council. My name is Jesse Paris and I'm represented for Denver Homicide Allow Blacks, Dogs and movement for Self-defense, Positive Action, Comments, Results and change as well as the Unity Party of Colorado.'",
        "'speaker_2': 'And Mile High News now live in District eight in Christopher Herndon's district. And I will be the next mayor of Denver in 2023. I am in favor of this rezoning tonight. I support it. I will continue to support 18th century dwelling units.'",
        "'speaker_2': 'I just want to know if this the first zoning proposal for District five. If so, I could please answer those that question. I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'Thank you, Jessie. Our next speaker is Tess. Dottie Dougherty. Sorry, Ted Storti. And I think we're going to need to promote tests from attendees and to the panelists.'",
        "'speaker_1': 'All right, Tess. Dougherty. There you go.'",
        "'speaker_0': 'All right. We seem to be having some technical difficulties getting tests. Into the meeting. We'll try it one more time here. All right. Or unfortunately unable to get Cass her audio to work here. Our next speaker we have is David Hagan.'",
        "'speaker_0': 'And it doesn't look like we have David with us anymore. So unfortunately for the with the technical difficulties tests was against this.'",
        "'speaker_1': 'Rezoning.'",
        "'speaker_0': 'I believe so that we can have that for the the record. That concludes our speakers questions from members of Council on Council Bill 1134 Councilwoman Sawyer.'",
        "'speaker_4': 'Thank you so much, Madam President, and thanks. And then I know that there has been a bunch of confusion with some comments that were sent in. So I just wanted to ask a few questions to kind of clarify what's going on here.'",
        "'speaker_4': 'So this is an AEW reasoning, and some of the comments that came in were around an application that came through for a different property, also in the neighborhood that was for and residential, a large residential care facility. So can you just talk a little bit about the difference between an 80 year rezoning and a zip pin for'",
        "'speaker_4': 'a large residential care facility just to kind of get on the record the difference between what we're doing here and what that is.'",
        "'speaker_2': 'Yeah. So for a specifically residential care large facility, there is a notification requirement that has to go out to property owners. Similarly, whenever there is a rezoning, whether that's an accessory dwelling unit or another specific type of rezoning, it does get notified to the property owners.'",
        "'speaker_2': 'And so sometimes you have to property on properties that might be adjacent to each other, that might be applying for different things, that property owners get notified. And so for you, there is specific requirements on the property owner has to live on site for example, which is different from a residential care large facility which is more operated'",
        "'speaker_2': '. There's a specific operator that will be in charge of that. And so a lot there is there is a lot of concern. Property owners that gave me a call and then two specifically that submitted letters of oppositions that were just mixed the two.'",
        "'speaker_2': 'And we're concerned about a large group home being placed at this location, and we're concerned that a group home would also have an ADU. And so with with that, I was able to clarify to some of those those all those property owners that gave a call, as well as the ones that submitted letters of opposition, that there'",
        "'speaker_2': 'is no group home or large residential care facility at the specific location as well as the applicant reached out to those individuals. The two that submitted letters of opposition also clarified that as well.'",
        "'speaker_4': 'Awesome. I really appreciate it. So in an 80 you then this is a. A an accessory dwelling unit is one small unit that goes in the back of a property that is a single family dwelling. Is that correct?'",
        "'speaker_2': 'That is correct. And it is only allowed in the 35% of the zone.'",
        "'speaker_4': 'Okay, great. And if there was a, you know, a large residential care facility that was, you know, an assisted living facility where there were up to 20 people living there, would they be allowed to have an 82 on that property?'",
        "'speaker_2': 'It would.'",
        "'speaker_4': 'They wouldn't.'",
        "'speaker_2': 'The answer is no, they wouldn't. They wouldn't.'",
        "'speaker_4': 'That's right. Under our zoning code, they wouldn't. That's right.'",
        "'speaker_2': 'It wouldn't be allowed.'",
        "'speaker_4': 'Okay, cool. Thank you. And so then would they if there was a short term rental on this property, what are some of the short term rental limiting factors that go in that are in play here?'",
        "'speaker_2': 'So some of the short term that that the property owner has is submit a short term life license approval. And so they would have to go to accessing and licensing for that specifically as well as some of the requirements would be that the property owner has to live in one of the units, which is a requirement.'",
        "'speaker_2': 'But if they're applying for a short term license, such as for an Airbnb, for example, that he can't live in the primary section every be the 80, it has to be like a specific room within the primary structure.'",
        "'speaker_4': 'Right? So they've got to live on the property if they were going to use this as a short term rental. Right?'",
        "'speaker_2': 'Correct.'",
        "'speaker_4': 'Cool. Exactly. And then if they were going to use this as a long term rental, they would would they have to live on the property then as well?'",
        "'speaker_2': 'Correct. They still the property has to live on either the primary structure or the accessibility unit.'",
        "'speaker_4': 'Awesome. Thank you so much for that information. Okay. And then I'm just trying to check and see if there are any other as I go through kind of these questions. So in terms of kind of other confusing things about the group living proposal in general, that people are confused.'",
        "'speaker_4': 'So there are there are no there are no you know, I'm just quoting a letter that we received today in opposition and I'm quoting here directly violent offenders, convicted felons, sex offenders allowed to living on this property because it's an adu by virtue of the fact that it's an Adu.'",
        "'speaker_4': 'Right.'",
        "'speaker_2': 'Correct.'",
        "'speaker_4': 'Right. Great. Thank you. It is not. I'm just quoting again from the email we received today directly proposed transitional housing in the middle of a family neighborhood. And that's a direct quote. Is that correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_4': 'Great. Thank you. It is, again, I'm quoting directly from an email I'm reading from here that we received today. It is not a quote, proposed plan to erect a large eight bedroom building in the midst of a single family neighborhood.'",
        "'speaker_4': 'Correct.'",
        "'speaker_2': 'That is correct. And the applicant is here and you can answer that one specifically.'",
        "'speaker_4': 'Well, I mean, it's an 80 you. So I just wanted to clarify yet that that's the case. So. Perfect. I just wanted to make sure and on the record that we got it very clear that the emails that we received were just a misunderstanding based on some incorrect information that was shared on next door and were not'",
        "'speaker_4': 'true and were, you know, just based on misunderstanding. So I just wanted to make sure that that was on the record. Thank you so much, Edson, and thanks, Madam President.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Sawyer. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Madam President. The this in my memory, which could be I could maybe not be recalling one instance in the past, but in my memory, this is the first 82 rezoning that we've had that is not on a parcel that backs up to a public alley.'",
        "'speaker_3': 'I'm not sure about all of the Chaffey part ones that we did a blind to rezoning recently, but I'm not used to seeing an 80 you request on a parcel that doesn't have an alley access. So just to be clear, ads and this is a a detached adu that's being proposed.'",
        "'speaker_2': 'That's what the applicant is pursuing.'",
        "'speaker_3': 'Okay. Does this with this rezoning allow an attached adu?'",
        "'speaker_2': 'It would.'",
        "'speaker_3': 'It would also. Okay. All right. Because I do have a concern about lack of valid access to a building. And as you said, in the rear, 35% is do we have in the code, anywhere in the code, a requirement for a at least a minimum side setback that would provide clearance for fire access or for whatever would'",
        "'speaker_3': 'have to get back to that other dwelling unit in the rear. 35% of the lot when there is no alley.'",
        "'speaker_2': 'Let me look this up.'",
        "'speaker_3': 'I think what it says in the staff report is that in this zone, there is a minimum of five foot side setback. I believe is what I read. I don't I don't have enough skills.'",
        "'speaker_2': 'You are correct. And it would be five feet.'",
        "'speaker_3': 'Okay. I don't have enough skill on Google Earth to measure what this particular parcel is, but do you happen to know what the size of the setback is that it looks like on the satellite photo? That it's probably in excess of that now, but I'm not sure.'",
        "'speaker_3': 'And maybe the owner or applicant could answer that, madam.'",
        "'speaker_2': 'I don't have that on the top of my head. Okay. We could ask the applicant.'",
        "'speaker_3': 'Okay. And then my last question has been for you is in the staff report, the ADU height can be a maximum of 24 feet, but in that zone, the maximum height in the rear, 35% of the lot is at least when it's the primary structure is 17 to 19 feet.'",
        "'speaker_3': 'But the ADU can exceed that up to 24 feet. So if it's a separate structure, in other words, it can be taller than what the primary structure could be back there. That doesn't seem to make sense to me, but that's what it says in the staff report.'",
        "'speaker_2': 'Let me look it up real quickly, and we can ask the applicants some questions just to verify that. That is correct. I have the Denver zoning code up, so I can specify that really quickly.'",
        "'speaker_0': 'Okay. Okay. And we're getting the applicant promoted.'",
        "'speaker_3': 'It seemed like from all the discussion, Madam President, that we're talking about a detached structure. I just wanted to confirm that because like I said, my I do have a concern about the lack of valley access. And this is the first time I've seen any to you that that is not a detached state to you, that it's'",
        "'speaker_3': 'not on an alley.'",
        "'speaker_0': 'Perfect. All right. Well, Councilman Flynn, we do have the applicant promoted here, and so hopefully I can answer your question.'",
        "'speaker_2': 'Hey. Hi. Can you introduce?'",
        "'speaker_0': 'Yep. Thank you for calling.'",
        "'speaker_3': 'Just introduce yourself and tell us, is this an attached day to you or a detached.'",
        "'speaker_2': 'Okay. Hi. My name is Christian OVERBY. Yes, I'm the property owner. I've owned it for about 12 years. So you've actually pinpointed a very critical piece here. My goal was simply to allow the ag view, and I've looked at it both ways, attached and detached.'",
        "'speaker_2': 'And it is a tricky design problem. I'm an architect, so I've looked at it both ways and I haven't come to any conclusions. It was more a matter of let's let's figure out what the options are and try to figure out what was possible.'",
        "'speaker_2': 'So so I mean, in some ways you're asking me kind of like what the last one was like. So I like the idea of the Adu just because it allows more people to live in the neighborhood. And it is a walkable neighborhood, as Ed Small probably explained for the other parts of this.'",
        "'speaker_2': 'So I kind of looked at it both ways. I tend to lean towards less driveway, so I want to kind of walk to the front, partly because it's one you're paving less of the lot. I think it's under the current zoning code.'",
        "'speaker_2': 'It's a whole lot easier to put it in the back. But then I've got this long driveway like I have now that makes it goes all the way to the back. And I look at it and say, Why?'",
        "'speaker_2': 'Except that? Well, because that's where the garage goes. Right.'",
        "'speaker_3': 'And you would also already run for sewer and water.'",
        "'speaker_2': 'Well, yes, all that is important. Right. So right now, it's it's a small house. And, you know, my goal is to actually, one, make it a more valuable property, but also a nicer property. So and a lot more people live there.'",
        "'speaker_2': 'All right.'",
        "'speaker_3': 'Thank you, Christian Edson, you have your hand up again. Do you did you have the the answer to that?'",
        "'speaker_2': 'Yes, I do.'",
        "'speaker_3': 'Okay. What is it.'",
        "'speaker_2': 'The one eight when we're dealing with the height specifically in the Urban House building form in the first 65% of the lot, the front basically you're allowed to go up to about 30 to 35 feet in height. But when you go into the like, let's say you have a very large attached and primary structure, and if that'",
        "'speaker_2': 'primary structure somehow gets into the rear 35%, for example, then at that point it can go up to 19 feet, 17 to 19 feet. Okay. So it would start off if you were looking at it, it would start off about 30 or 35.'",
        "'speaker_2': 'And then if that structure would dip down to 19, if it was one, which structure.'",
        "'speaker_3': 'Okay. But then the detached adu that's in the rear, 35% of of the parcel could go up to 24 feet.'",
        "'speaker_2': 'Correct.'",
        "'speaker_3': 'Okay. That's that does seem a little odd to me. That might maybe something that CBD could look at going forward. If the primary structure can't go up to 24 feet why cannot life in 80 you. Right? Right. What difference would that make?'",
        "'speaker_3': 'All right. Thank you, Madam Price. And that's all I had.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilwoman, can each.'",
        "'speaker_4': 'Thank you, Madam President. Edson I don't know that you're going to know the answer to these questions, but I just wanted to get them out there. I heard Councilman Flynn asking some questions about being in the back of the of the lot.'",
        "'speaker_4': 'Are you aware of single family homes that can be in the back 35% of their lot or that already exist in the back? 35% of their lot.'",
        "'speaker_2': 'No, I don't. Okay.'",
        "'speaker_4': 'I'm familiar with with a number of them. The second question I had is about existing 80 use or there's an other term for them. I was trying to look it up and I can't remember what it is, but where you walk through the yard of the first home to get to the home in the back in northwest'",
        "'speaker_4': 'Denver in particular, there's a number of those in historic districts, in fact, but not all of them back onto alleys. And so I was just curious if you're familiar, I'm not sure what the term for that is, but.'",
        "'speaker_4': 'But existing housing stock that already has this form.'",
        "'speaker_2': 'Their account.'",
        "'speaker_3': 'I think Random House, maybe.'",
        "'speaker_4': 'Random House. Thank you, Councilman. Yeah. Edson, were you going to say something else? Thank you. For Councilman Flynn. I mean, did you have anything to add about that?'",
        "'speaker_2': 'There is some existing church homes as well where you do have to go through an existing driveway, for example.'",
        "'speaker_4': 'Okay. Thank you. That's all, madam.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilwoman Sandoval.'",
        "'speaker_1': 'Thank you, Madam President. So I have a question. I have heard that community planning and development is actually having people who apply for accessory drawing units go through concept, design and review process at the same time. Because a lot of times people are going through the accessory dwelling unit rezoning process.'",
        "'speaker_1': 'And then by the time that they get to concept and submit their site development plan, their denied because of some issues. Do you know this site has gone through a site development plan yet?'",
        "'speaker_2': 'Not that I know of. And we can ask the applicant if they submitted.'",
        "'speaker_1': 'Have you think they're starting to have has has community planning and development talk to you about that? Because I am the kind of person who is on the entire neighborhood for accessory dwelling units. And so we've started they've started doing that recently.'",
        "'speaker_1': 'And I was just wondering if if you were too early in the queue to have had that happen or if that that's been made that's often been offered to you yet.'",
        "'speaker_2': 'That hasn't been offered to me personally. I know that we sometimes have some applicants that come in and are interested in like some sort of concurrent review, and we just specify to them that they're always comes with some challenges and you assume the responsibility of doing a concurrent review.'",
        "'speaker_2': 'So. Personally, I haven't dealt with one specific case, but there's been other partners who have dealt with it specifically, and I can get you a better answer as well.'",
        "'speaker_1': 'So I would just say in for future reference, I think it would be good policy that I know this has been talked to to me before. So I it'd be good for all of us to get on the same page because I don't think we'd be having a lot of these discussions at council if when this happens'",
        "'speaker_1': '. But I do know that all of the accessory dwelling units that are coming through right now in my council district are also going through the site development plan review process so that before they come to council, we have this information.'",
        "'speaker_1': 'And maybe that's just because I'm a little bit more involved in zoning because I have a planner. But it really is helpful when we get to this point because a lot of times we can ask specific questions such as this, and they've already gone through the site development plan with development services.'",
        "'speaker_1': 'So just a little FOIA of something.'",
        "'speaker_4': 'And Christian.'",
        "'speaker_1': 'To you, the applicant, you haven't met with development services yet and you haven't offered a site development plan, is that correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_1': 'Okay. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Sandoval. The public hearing for Council Bill 20 Dash 1134 is closed. Comments by members of Council Councilwoman Sawyer.'",
        "'speaker_4': 'Thanks so much, Madam President. I think, you know, it's I don't have a lot to say here. It's pretty clear that 80 views are the compromise between sort of the the adding gentle density to the neighborhood and making sure that we maintain that kind of character of that that thing that people love about our neighborhoods.'",
        "'speaker_4': 'So for East Denver, Far East Denver in particular, east of Colorado Boulevard, the thing that people truly love about this area is that the yards are big, is that the houses are a little bit smaller, is that, you know, it's a little bit quieter.'",
        "'speaker_4': 'We get that sort of feel of living in almost the suburbs. But we live 5 minutes from world class restaurants and museums and downtown Denver, and it's amazing and that's what makes it unique and that's what we love about it.'",
        "'speaker_4': 'And that said, we have to find the balance where we bring in that added density so that we are adding housing, so that we are bringing, you know, that that lower price point that people can afford, that missing middle housing into our neighborhoods as well.'",
        "'speaker_4': 'And the answer to that is to use. And so I do support this and with a word of caution that I think it's really important we talk about the fact that, you know, that not capital affordable that lower a affordable housing only works that middle missing middle housing only works if we're using these 80 years for long'",
        "'speaker_4': 'term rentals and not short term rentals. And so I think it's important to just point that out again. And with that, I hope that my colleagues will support me in this. I think it meets all of the criteria.'",
        "'speaker_4': 'And so I'll be voting yes.'",
        "'speaker_1': 'Thanks so much.'",
        "'speaker_0': 'Thank you, Councilman Sawyer. And it does look like it meets all the criteria. And thank you, Edson, for a great presentation. Madam Secretary, roll call.'",
        "'speaker_1': 'Sawyer, I. Torres. I. Black I. CdeBaca, I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Hines.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Can each I. Ortega. I. Sandoval. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results.'"
    ]
}