{
    "A proclamation in recognition of Dale Coski upon the occasion of her retirement. A proclamation in recognition of Dale Coski upon the occasion of her retirement.": [
        "'speaker_0': 'We have two proclamations. This evening. I would like to call on Councilwoman Fox to read proclamation number 498.'",
        "'speaker_5': 'Thank you, Madam President. Proclamation number 14 498 in recognition of Dale Carnegie upon the occasion of her retirement. Whereas Dale Caskey was hired by the Denver Police Department as a patrol officer on January 1st, 1982. And. Whereas, Dale served for three years as a Denver police officer and during her tenure was severely injured in the line of'",
        "'speaker_5': 'duty in September 1983. And. Whereas, Dale was hired by the Agency for Human Rights and Community Relations on January three, 1985, as a community relations consultant and worked as Dale Service Dog Perseverance, also known as Percy, has the distinction of being the first service animal in the state of Colorado in 1984.'",
        "'speaker_5': 'And. Whereas, in 1985, Dale, with Percy on her side, testified before the state legislature to create laws for service dog access. And that year the legislation was created, passed and signed into law by Governor Richard D Lamm. And where whereas I worked with the former manager of safety.'",
        "'speaker_5': 'Beth McCann to create the Denver Disability Parking Enforcement Program in 1993, helping to ensure disabled parking access and enforcement for people living with disabilities and where it has since the program's inception. Dale Caskey, as the coordinator of the Disability Parking Enforcement Program, has trained and supervised 40 volunteers advocating for the rights of people living with disabilities.'",
        "'speaker_5': 'And. Whereas, on June 30th, 2014, Dale Caskey will retire as a full time employee from the Agency for Human Rights and Community Partnerships, fulfilling 32 years of dedicated service. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council recognizes Dale remarkable and inspirational.'",
        "'speaker_5': 'Constant contributions over the years and on behalf of Denver residents wishes her well in retirement. Section two that the clerk of the city and county of Denver shall test and fix the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Dale Caskey.'",
        "'speaker_0': 'Thank you, Councilwoman, for your motion to adopt.'",
        "'speaker_5': 'I move that the proclamation be adopted.'",
        "'speaker_0': 'Thank you. It's been moved and multiply. Seconded comments. Councilwoman Fox.'",
        "'speaker_5': 'Thank you very much. I am extremely proud that Dale is both a constituent and a friend. She has been a role model to me showing how you can overcome adversity and certainly in developing new areas of leadership. The handicapped parking regulation was really, I think, just a brainchild of Dale Caskey, and her goal has always been to'",
        "'speaker_5': 'help those who truly need the spaces be able to handle them. Not only did she deal with the with service dogs at the state legislature, there was a change in the state law that also regulated who and under what circumstances were able to get the handicapped parking stickers.'",
        "'speaker_5': 'And Dale was a true leader in that. I worked with her on that issue. And I feel that we made some some valuable changes at the state level because of her insight on this issue. It pains me to say that I wish her well in retirement because that means she's retiring.'",
        "'speaker_5': 'She is going to be used as a full time resource for me to rely on, as I have for so many years. But Dale, I know we won't be saying goodbye, and I truly hope you'll stay active with the Denver Denver's handicapped parking enforcement community.'",
        "'speaker_5': 'You cannot be replaced.'",
        "'speaker_0': 'Thank you very much, Councilwoman Pat's Councilwoman Lehman.'",
        "'speaker_5': 'Thank you, Madam President. Dale, I just like to say it has been an incredible experience working with you. And every time we need to walk and talk, it is just.'",
        "'speaker_0': 'Enlightening.'",
        "'speaker_1': 'To me.'",
        "'speaker_5': 'And I would like to thank you for all you've done and know that you will continue doing it in so. Thanks so much.'",
        "'speaker_0': 'Okay. Councilwoman One Chair.'",
        "'speaker_5': 'Thank you, Madam President. I also want to say hi, Dale. I remember the first time we met when I was a council aide, and I learned all about the commission from people with disabilities. And I truly believe that you and your leadership have really taken the level of community support.'",
        "'speaker_5': 'It's gone up. I just want to say that every time I've ever seen you, I always get so happy and you've just brought a light into the city, and I wish you all the very best. It's been my honor to be able to know you and call you when I have questions about handicapped parking or we have'",
        "'speaker_5': 'some problems that we need to resolve. One thing that's always been very, very important to me is that you've always been an advocate. And if people were parking where they weren't supposed to or they had somehow they had obtained a handicapped tag that they should know of, you were always just such an advocate, and you always did'",
        "'speaker_5': 'it in such a great way. So thank you so much and I wish you all the very best. And then to Percy, to I want to know if he's going to be sitting back in. Having a go with that?'",
        "'speaker_3': 'Yeah. Oh. Oh.'",
        "'speaker_5': 'Okay. Well, I want to hear about it when you come to the microphone. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Kennish.'",
        "'speaker_1': 'Thank you very much, Madam President. I haven't worked with Dale as long as some of my colleagues have. But I know you through sending developers your way to think about public spaces and how we can make public spaces more accessible and think beyond just minimum ADA recommendations, which is how architects think and think more about serving people'",
        "'speaker_1': ', which is how you think and you think on behalf of the city. So I appreciate those folks that you've met with on those issues. And also, I just wanted to thank your your partner behind every great woman. It's a support network and so really appreciate that you've you've had such a supportive family and hope that you get'",
        "'speaker_1': 'to enjoy them in your retirement.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Madam President. Dale, I've known you a very, very long time. Back to when you were a Denver police officer. And I just want to say thank you for all your years of service to the citizens of the city of Denver, both as a police officer and in your work at the Commission on Disabilities.'",
        "'speaker_6': 'I think lots of lives have benefited from your hard work, and I wish you Godspeed in your retirement. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. And it looks like we're ready for roll call, Madam Secretary.'",
        "'speaker_5': 'Fox.'",
        "'speaker_4': 'Hi, Herndon. I can eat Lemon Lopez. ALL Monteiro. Hi, Nevitt. Hi, Ortega. Rob Shepherd Brown, I. Madam President.'",
        "'speaker_0': 'I. And we have Councilman Lopez. Thank you, Madam Secretary. Carlos, close the voting. Announce the results.'",
        "'speaker_4': '12 eyes.'",
        "'speaker_0': '12 eyes. The proclamation is adopted. Councilwoman Fox. Is there somebody you'd like to ask up to the podium?'",
        "'speaker_5': 'I would very much like to hear from Dale Kosky.'",
        "'speaker_0': 'We've got a portable microphone here.'",
        "'speaker_5': 'And they are some might not have been able to hear about Kokomo. So if you'd also introduce Kokomo.'",
        "'speaker_0': 'Okay. This is Kokomo. She's my fourth dog. They don't live as long as I do. So but and all of them have just been so valuable to me. First of all, I want to thank career service for 29 years that they took a risk on me.'",
        "'speaker_0': 'I really didn't know what I was doing when I was coming into human rights community partnership. And they they dared to go and take that risk with me. And I couldn't do this all alone. I just had great support.'",
        "'speaker_0': 'My partners in human rights, community partnerships, my church community, all the coworkers that have dealt with me and with the departments that I work with, and that's traffic engineering right away, enforcement and the court system. They've been great.'",
        "'speaker_0': 'And I want to give thanks to the legislation, the state legislators, for going in the service dog bill. And that's where I first met Councilwoman Robb, Councilwoman Ford is that I'm sitting at the head of that that committee and I didn't even know that she was my city council or my state legislature then and then later became'",
        "'speaker_0': 'my city councilwoman. I'd give her a hard time because I tell her I'm her something Democrat. And. So and then I've got to give recognition to the organizations that go and train people that train puppies and then get advanced training for the service dogs, because they've really been a lifeline to me and to so many other people'",
        "'speaker_0': '. You know, in when I was first injured about 31 years ago, it'll be 31 years in September. I really lost a lot and I didn't know the amount that I lost. But the first time that I ever cried was when the police department came and forced me to retire.'",
        "'speaker_0': 'And it wasn't from losing a leg. It wasn't from losing independence. It was from losing that. And. Since that time. I'll tell you, God and I have gotten into it. I mean, we've gone round and round and and with the whys and everything else, and we've gotten in wrestling matches.'",
        "'speaker_0': 'And, you know, sometimes God, even you think I win on the whole thing. And sometimes we're on we're not on speaking terms. And and, you know, I think the things that I think that's okay. But the one thing that I have never stopped talking to God about or never stopped thanking God and thanking God and thanking God'",
        "'speaker_0': ', and that has been for the public support. I mean, it is just I've seen a side of the public that a lot of police don't see, and that was just people coming out of the woodwork and they still do.'",
        "'speaker_0': 'And that support has meant everything. And I have been extremely lucky to have worked with the public, to have worked for the public, and that has been an extreme blessing to me. And is it awesome, right. And responsibility.'",
        "'speaker_0': 'And it's one that all of us have everybody on council gets to do it and to to great public, to everybody here, to the police here, that they get to work for the public. And I feel truly blessed.'"
    ],
    "A proclamation designating the week of June 23 through June 27 as Bike Week and Wednesday, June 25, as Bike to Work Day in Denver.\n": [
        "'speaker_0': 'And like I said, I continuously thank God for that and I thank you for allowing me to work with the city that way. Thank you. Thank you very much. Very moving. We have another proclamation, and I'd like to call on Councilwoman Shepard to read proclamation number 527.'",
        "'speaker_1': 'With with pleasure, Madam President. Proclamation 527 series of 2014 designating the week of June 23rd through June 27th as Bike Week, and Wednesday, June 25th as Bike to Work Day in Denver. Whereas the city and County of Denver partners with the Denver Regional Council of Governments, local bicycling, bicycling organizations and cycling enthusiasts each year to plan activities'",
        "'speaker_1': 'and events intended to promote bicycling. And. Whereas, Bike to Work Day is an annual event designed to encourage people to ride bicycles for transportation consistently, to reduce congestion, improve air quality, and benefit public health. And. Whereas, the Department of Public Works hosts the Civic Center Park Breakfast Station, one of the largest in the region where cyclists celebrate'",
        "'speaker_1': 'their commute to work with free snacks, raffle prizes, music and educational outreach offered by the bicycling organizations. And. Whereas, Registration for Bike to Work Day by staff of the city and county of Denver has more than doubled from 2013, with 400 registrants and growing for the 2014 event.'",
        "'speaker_1': 'And. Whereas, the Department of Public Works is a major contributor in the planning and implementation of Denver's bicycle infrastructure, adding at least 15 miles of new bikeways annually, and this year installing Denver's first protected bikeway on 15th Street downtown with vertical separation between bikes and cars.'",
        "'speaker_1': 'DPD Denver Public Works plans to install more protected bike lanes are contributing to Denver's rank as a top bicycling, bicycling city and its inclusion in the National People for Bikes Green Lane Project. And. Whereas, the city now has more than 140 miles of on street bike lanes and SROs and more than 100 miles of off street trails'",
        "'speaker_1': ', offering recreational opportunity along scenic routes and is in the midst of closing a major missing link in Denver's Bike Network with the new pedestrian and bike bridge across I-25 to the Colorado Center and light rail station. And. Whereas, Denver is supporting bicycling in other new and creative ways, testing for the first time this year the viability of'",
        "'speaker_1': 'on straight on street bike corrals and bike sharing stations where people gather with the goal of supporting local businesses and making bike riding more attractive for Denver's residents. And. Whereas, bicycle and pedestrian safety and infrastructure continues to be a top priority for the Denver City Council of the City and County of Denver, which is supporting funding for'",
        "'speaker_1': 'additional and expedited multimodal improvements that will increase bicycling in our city. Now, therefore, be it proclaimed by the City Council, the City and County of Denver, Section one that the by the council designates the week of June 23rd through June 27th as Bike Week and June 25th as Bike to Work Day Section two that the clerk of'",
        "'speaker_1': 'the city and county of Denver shall attest and affects the seal of the city and county of Denver to this proclamation, and that a copy here to be forwarded to the manager of Public Works.'",
        "'speaker_0': 'Thank you, Councilman Shepard. Your motion to adopt.'",
        "'speaker_1': 'Thank you. I move that proclamation 527 series of 2014 be adopted.'",
        "'speaker_0': 'It has been moved and seconded. Comments by Council Councilwoman Shepherd.'",
        "'speaker_1': 'Thank you, Madam President. I am pleased to once again be asked to read this proclamation and sponsor it, which gives me great pleasure, because as folks who know the work that I do well know that I am absolutely committed to increasing ability and walkability both in my district and across the city and county of Denver.'",
        "'speaker_1': 'It is imperative that we give our residents every option possible to not have to have a car and to be able to move through our city. And that, you know, contributes, obviously, to reducing our carbon footprint, helps public health outcomes, puts more eyes on the street and and can long term lead to some easing, I hope, of'",
        "'speaker_1': 'our parking problems. But this is this day on Wednesday of this week is a particularly great day that we have a chance to, you know, all get in our spandex or or not don our helmets and ride down into the city.'",
        "'speaker_1': 'And as you may know, there's many free breakfast stations and snack bars along these routes. So I encourage folks who are going to be participating to avail themselves of all the free food and other activities that are organized around this event, especially at seven.'",
        "'speaker_1': 'Senator Park. But I also want to say that this is just, you know, one day and one week that we celebrate. But we've really made tremendous strides during this council term on really increasing safety, comfort, connectivity and infrastructure for cyclists in the city and county of Denver.'",
        "'speaker_1': 'In 2013, this very body voted to make that the number one priority. And because of the advocacy that we did, we were able to get additional planners and engineers designated into public works department to work on increasing our bicycle network.'",
        "'speaker_1': 'And I want to thank all of my colleagues, the mayor's office and also public works for teaming together and collaborating together to reach that goal. And I did mention earlier in the proclamation that we were chosen in a very competitive process with other cities this year as one of six to participate in the Green Lanes Project.'",
        "'speaker_1': 'Our first thing that we've done in that project is to install that vertically buffered, protected bikeway on 15th Avenue, which is all of you know, is an extremely busy street with a lot of traffic, a lot of turning movements, busses, but also bikes.'",
        "'speaker_1': 'So that extra vertical protection, you should go out and try it if you haven't had a chance to do it yet, because it really, you know, even though it wouldn't keep a car from coming into the lane, it makes the cyclists feel safer and gives a lot more predictability to both the cyclists and the motorists about where'",
        "'speaker_1': ', you know, each mode user is supposed to be on the street. And I and I encourage you to try it if you haven't had a chance. And lastly, I'll just say, you know, cycling is is fun and it's a great way to connect with community members.'",
        "'speaker_1': 'And so I hope that folks will not only try it this week, but, you know, at several other times during the summer. Do you happen to have that photo? So this is a funny photo. But let me let me explain the reason why I'm posting this today.'",
        "'speaker_1': 'So many of you know that we've got the heads up campaign happening right now, which is an education campaign targeted for all mode users to both be aware and alert while they are driving, walking or cycling or skateboarding or what have you both for their own safety and to be looking out for the other mode users on'",
        "'speaker_1': 'the trail. So I just want to say that this morning I was biking actually on the bike and pedestrian path at Crown Hill Park and I came across this mode user who was cruising down the bike path at zero miles an hour.'",
        "'speaker_1': 'He's obviously a fairly vulnerable user because of his size, so I just want everyone to head's up lookout. Be careful. You'll never know exactly who else you might be sharing the road with. Now, at least this stately gentleman has his helmet on.'",
        "'speaker_1': 'So I do encourage everyone who's going to participate in bike to work day activities this week to be very safe and wear your helmets and look out for the other vulnerable users who might be sharing the trails with you and the roads.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Shephard. Looks like we are ready for the roll call.'",
        "'speaker_4': 'Shepherd I Brown Fats I Herndon can each laman lopez. Monteiro Nevitt. Hi, Ortega. Hi, Rob. Hi, Madam President. Hi.'",
        "'speaker_0': 'Madam Secretary. Close to voting now to results for Vice 12 eyes. The proclamation is adopted. California shivered. Is there anyone you'd like to ask up to the podium?'",
        "'speaker_1': 'You know, forgive me. I'm not sure who the recipient is. I don't. Oh, Emily Center. There she is. Okay. Thank you, Emily. Emily Snider from the Public Works. She's our bike and pedestrian planner in the city and she's magnificent.'",
        "'speaker_1': 'Good evening. Madam President, members of council, thank you again for the proclamation on Bike to Work Week and Bike to Work Day. We're excited about another successful year leading up to this. We've had several milestones in this city.'",
        "'speaker_1': 'Councilman Shepherd mentioned our protected bike lane on 15th Street just this month. We've also implemented our on street bicycle wayfinding signage that provides destination direction and distance.'",
        "'speaker_5': 'Based.'",
        "'speaker_1': 'Signage for cyclists out there on our streets with partners on councils such as Councilman Leavitt's office and some of our merchants associations. We've also installed the first on street bicycle parking corral in which we've taken one bicycle, one car parking space and made it available for 12 bicycle parking spaces and with other members of the community, such'",
        "'speaker_1': 'as the downtown Denver Partnership and bike Denver. We've made it more than just this Wednesday those to. Asians have been working on a campaign called Bike to Work Wednesdays and getting more people on bikes more often. But I think the biggest thing that I wanted to recognize this year is the increase in staff participation.'",
        "'speaker_1': 'As the proclamation mentions, we have doubled the enrollment in to work day by city staff and that would not have been possible without one of our new bike planners, Rachel Bronson, who really spearheaded an efforts of many organized representatives from many different departments across the city, very enthusiastic people and staff that have committed their agencies and encouraged'",
        "'speaker_1': 'their agencies to participate on that day. So it's a great thing for us to encourage all of the cyclists in Denver to participate in Bike to Work Day. But I was thrilled that we have even more representation from the city.'",
        "'speaker_1': 'So thank you very much. And we look forward to your continued support and getting more people on bikes.'",
        "'speaker_0': 'Thank you, Emily. Okay, that's moving on. Let's move on to resolutions. Madam Secretary, will you please read the resolutions.'"
    ]
}