{
    "A bill for an ordinance designating 6400 Montview Boulevard as a structure for preservation. Approves an individual Denver landmark designation for property located at 6400 Montview Boulevard in Council District 8. The Committee approved filing this item at its meeting on 1-5-21.": [
        "'speaker_0': 'Councilmember CdeBaca. Will you please put Council Bill 20 1560 on the floor for passage?'",
        "'speaker_2': 'I move that council bill 2015 six be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved. May I get a second? Thank you, Councilwoman Ortega. The required public hearing for Council Bill 20, Dash 1516 is open. May we please have a stop? The staff report, please.'",
        "'speaker_2': 'Evening Council. My name is Jenny Button. I'm a senior city planner in community development and planning or excuse me, community development. We share my screen here real quick with you guys. Is that coming through okay for you?'",
        "'speaker_0': 'Mm hmm. Thanks, Jenny.'",
        "'speaker_2': 'Okay, great. And tonight, I'm presenting on the proposed historic designation of the residential property located at 6400 Mt. View Boulevard in the South Park neighborhood. The ability to designate individual landmarks and historic districts. And the city and county of Denver was set forth in the 1967 Landmark Preservation Ordinance.'",
        "'speaker_2': 'Since then, the city has designated 351 individual landmarks and 56 historic districts scattered across the city, as you see indicated on the map. This equals roughly 7000 buildings or 4% of the city that are designated landmarks. The designation process is community driven and applications can be submitted by a variety of persons.'",
        "'speaker_2': 'For this property, the owner submitted the designation application. The owner is Rebecca Rodgers again. This is located in the South Park Hill neighborhood. This is Council District Number eight, Christopher Herndon. And the current zoning is U.S.. A property must meet the following criteria for historic designation.'",
        "'speaker_2': 'It needs to be more than 30 years old or of exceptional importance. It needs to meet at least three out of ten significance criteria, maintain integrity and be considered by the Landmark Preservation Commission for relation to historic context or theme run through each of these criteria with you this evening.'",
        "'speaker_2': 'The structure built in 1936 is more than 30 years old. It also makes three significant criteria that you see highlighted on the screen, made see to embody the distinctive physical characteristics of an architectural style or type, it needs to be a significant example of the work of a recognized architect or master builder, and it also represents to'",
        "'speaker_2': 'represent an established and familiar feature of a neighborhood, community or contemporary city due to its prominent location or physical characteristics. These criteria illustrate what makes a property a 6400 Montague Boulevard significant for historic designation, which is primarily its design excellence.'",
        "'speaker_2': 'And let's go through each of these criteria. More detail now. The Single Unit residence at 6400 View Boulevard embodies the distinctive, visible characteristics of the Spanish eclectic style. It possesses several identifying features, including an asymmetrical facade stucco cladding with decorative brick tile roof with multiple levels, elaborate chimney top arches above principal windows, arched front entry with decorative'",
        "'speaker_2': 'ironwork instances, balcony with UN railing and primary facade and second story covered porch and round tower at the rear that you can see just above the trampoline there. The Spanish eclectic style often also includes elaborate landscaping features, and this property is no exception, with its flagstone walkway depicting moon phases leading to the front entry, which you can'",
        "'speaker_2': 'see in the second image from the left and flagstone back patio with sun imagery. It is one of a few Spanish eclectic style houses in the South Park Hill neighborhood. Its construction occurred at the tail end of the popularity of Spanish style in the United States that spans 1915 to 1940.'",
        "'speaker_2': 'The property is a significant residential example of the work of recognized architect J. Roger Music and master builder Harry Bittman, often designing in partnership with his older brother G. Meredith, music and civic and religious commissions such as the Masons Stamp Theater and Library on the Loretto Heights campus, which is currently under redevelopment.'",
        "'speaker_2': 'This venture represents the only known Spanish eclectic style residence designed by J. Roger Music in Denver. It is consistent with his residential designs and that it is a straightforward interpretation of the Spanish eclectic style and includes a prominent main entrance, accented with a large decorative round.'",
        "'speaker_2': 'It differs in its use of stucco as opposed to brick or stone, which is more commonly found in music's residential designs. A graduate of the Beaux-Arts Institute of Design in New York City, music's commercial, civic and religious designs have gained more recognition to date, including the Berkeley Park Chapel that was recently designated as Denver Landmark and the'",
        "'speaker_2': 'Colorado State Capitol Annex. Music was a Denver based architect from the late 1920s to late 1960s. He partnered with Master Builder and property owner Harry M Bittman on the design and construction of 6400 Mathew Boulevard. Simmons career in Denver spanned from 1928 to 1967 and included both residential real estate development and construction.'",
        "'speaker_2': 'He served as president of the Home Realty Company, was a founding member of Quality Home Builders Inc and formed the Bittman Construction Company in partnership with Jay Roger. Music on the design of this property influenced Bittman to build a similar Spanish eclectic style residence at 4833 East Sixth Avenue in 1937 that is not credited to Jay Roger'",
        "'speaker_2': 'Music. This influence took place early in Batman's long lasting career, making this a significant example of his work. And lastly, for the significance criteria, the property represents and established a familiar feature of the neighborhood due to its physical characteristics as the only true two storey Spanish eclectic style residence and its prominent location along Mountain View Boulevard.'",
        "'speaker_2': 'Miami Boulevard between Colorado Boulevard and Monaco Parkway consists of large residences and lots designed to be prominent with more modest residences tucked into the side streets. This stretch of road and green space that comprises Mont View Boulevard is part of Denver City, beautiful movement, parkways, historic district, which you can see indicate on the map shaded in Brown'",
        "'speaker_2': '. The property at 6400 Mountview Boulevard stands out among the other large residences along the Parkway that are primarily Tudor revival and ranch styles constructed of brick. Its stucco clad walls and distinctive design elements stand in contrast to its surroundings, making it a familiar feature of a South Parkdale neighborhood.'",
        "'speaker_2': 'In respect to change over time, the property retains a high degree of integrity and has experienced minimal alteration. It retains integrity of location, setting, feeling and association as it is in its original location, is still used as a private residence, and the surrounding residential context has been largely unaltered since original construction of the property.'",
        "'speaker_2': 'Integrity of design, materials and workmanship have been impacted with the replacement of the original windows and garage doors. However, key character defining features of the structure like the tile roof, decorative metalwork and brickwork, stucco cladding, arch surrounds, decorative flagstone walkway and back patio and a rear second story porch and tower are preserved so the property retains the'",
        "'speaker_2': 'identity for which it is significant. Lastly, the property made several historic contacts with the 1936 period of significance. A historic context refers to the cultural, social, religious, economic and or political conditions that existed during a certain time provides the background necessary to understand how and why a structure or a district may have historic architectural, geographic or cultural'",
        "'speaker_2': 'significance. In other words, the context is not what makes a property or property significant, but rather provides a framework for understanding what does make it significant. In the case of 6400 Montague Boulevard, the property is significant. Bruce Architecture, Design Excellence.'",
        "'speaker_2': 'As for its historic context, it was constructed during the Great Depression and represents residential development by the affluent that happened at that time in Denver neighborhoods. It was also built during the time when racial segregation caused by real estate development was occurring in Denver and cities across the nation due to redlining efforts that began with the creation'",
        "'speaker_2': 'of the Federal Housing Administration in 1934. Harthill was an overwhelmingly white, populated neighborhood. At the time, this property was developed and the building's original owner fit that demographic. The property also relates the theme of housing near Denver's parks and parkways.'",
        "'speaker_2': 'The Park and Parkway System is part of the city. Beautiful movement was designed to be an integrated system of stately public buildings and appealing surrounding neighborhoods. Development of the property at 6400 MATTHEWS Boulevard occurred much later than the most active years of the original design and implementation of Denver City beautiful movement in the early 1900s.'",
        "'speaker_2': 'However, it still falls within this context through development of Montague Boulevard as a city beautiful parkway stemming from City Park in bookending at Monaco Street Parkway. As you can see in the image on the screen. In summary, the property meets all criteria for historic designation.'",
        "'speaker_2': 'It is 84 years old. It meets three designation criteria. See the map? It maintains its integrity and relates to several historic contexts. Five individuals submitted emails in support of the designations and acquisition. Therefore, staff recommends approval to designate 6400 Mathew Boulevard as a structure for preservation.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'All right. Well, thank you, Jenny. And tonight, council has received four written comments on Council Bill 1560. There are four submitted comments in favor of the application and no submitted comments in opposition of the application. All members of Council that are present have certified that they have read each of the submitted written comments.'",
        "'speaker_0': 'Do any members need more time in order to read all of the written testimony that was submitted? Seen none. Council Secretary. Let the record reflect that all written testimony, both in favor and in opposition of Council Bill 1560 has been read by each member of Council and all written testimony will be submitted to the official record of'",
        "'speaker_0': 'the hearing. We have five individuals signed up to speak this evening and our first speaker up is the applicant, Rebecca Rogers.'",
        "'speaker_2': 'Hi. Good evening. Thank you for considering my house for designation. My journey to designate my home at 6400. Mt. View began several years ago. In 2014, I joined the board of Historic Denver because I was passionate about preserving and celebrating the unique history of Denver.'",
        "'speaker_2': 'As I learn more about the history of this great city, I felt more passionate about working to preserve its unique and limited historic structures and neighborhoods. As a result, in 2015, I hosted a community meeting at the Park Hill Library to educate people in the neighborhood about historic districts.'",
        "'speaker_2': 'I firmly believed Park Hill was a perfect place to create a historic district and hope others would feel the same. Out of this meeting, a group of approximately ten neighbors started meeting twice a month to work towards creating a historic district.'",
        "'speaker_2': 'I was really hoping that we would all agree on an area to tackle for the district that would include my house. But we had voted and we had all decided that instead of that we would try and tackle the first subdivision in Park Hill.'",
        "'speaker_2': 'As we started our efforts in earnest to work on the district, I pledged to seek to have my home individually designated and as the neighborhood historic district has taken many turns and even even more years, I decided to move forward with work on my own designation.'",
        "'speaker_2': 'When I moved to Denver in 2003 from Milwaukee, I was looking for a neighborhood one like the many neighborhoods that existed in Milwaukee with the large trees, the parkways and the historic homes. I was surprised to discover not many such neighborhoods existed, and when I happened upon Park Hill, I fell in love.'",
        "'speaker_2': 'I would drive to the neighborhood just to take walks and a house, watch up and down the streets. Even back then, home prices were high, especially for a young, single woman. I eventually found a starter home at right off of Colfax and Jasmine.'",
        "'speaker_2': 'I fixed up the house and started to move to larger fixer uppers. That led me to a house on 23rd and forest, and then another one in 17th Avenue Parkway and Cherry. And then finally to 6400 Mountview. We have now been in our house at the new home since 2013.'",
        "'speaker_2': 'We have completed many projects in that time, including stucco repair, masonry, repair of roof restoration, electrical upgrades, replacing many missing bathroom floors, renovating bathrooms and kitchens just to name a few projects. Everything has been done in a way that we hope celebrates the home's historic character and architectural style.'",
        "'speaker_2': 'We want to designate our home to ensure that it is around for generations to reflect Park Hill's diverse historical architecture along Mount View Boulevard, as Jennifer just spoke about being one of the last houses along that boulevard. Our house stands out not only because of its prominent location on the southeast corner.'",
        "'speaker_0': 'That's the time we have allocated. We appreciate your comments. Our next speaker up is Kristi minnillo.'",
        "'speaker_1': 'Good evening. My name is Christy. Minnie Yellow and I live in Denver.'",
        "'speaker_2': 'I prepared the application on behalf of Rebecca, so I am available to answer any questions council may have.'",
        "'speaker_0': 'All right. Thank you, Christy. Our next speaker is Shannon Stage.'",
        "'speaker_2': 'Good evening, council members. Thank you so much for having us tonight. My name is Shannon Stage and I am the preservation coordinator at Historic Denver. We are a membership based nonprofit that provides assistance and resources to help preserve places that matter to our community.'",
        "'speaker_2': 'Our address is 1420 Ogden Street, Denver, Colorado. We are thrilled to be here tonight to show our support at City Council for the Bittman, our House designation at 6400 Mt. View. As outlined in the preamble of our city's preservation ordinance, one reason we have a designation program is to foster good urban design, and this property is being'",
        "'speaker_2': 'designated for its design excellence. Has Jenny mentioned and what it contributes to our shared fabric of our city, particularly due to its location at the intersection of two of our city's notable parkways, Mt. View Boulevard and Mt. View Parkway, which are both a part of the National Register and local designation Parks and Parkway System.'",
        "'speaker_2': 'It reflects design, excellence and artistic merit through its strong and intact Spanish eclectic style and is the only example of this style designed by J. Roger Music, a notable Denver architect responsible for a number of high quality buildings in Denver.'",
        "'speaker_2': 'This house will be the first residential structure designated on Montague and only the fourth home in Park Hill to be designated, despite the fact that Park Hill has encompasses more than 10,000 homes in total. Among these 10,000 homes, there is a great variety of architectural styles, inspiring stories and historic themes.'",
        "'speaker_2': '6400 Views sits within this larger context of Park Hill neighborhood history from its early development in the 19th century through the first decades of the 20th century to the postwar boom that expanded the neighborhood to the north, to the area's role in the civil rights movement and resident and church led efforts to fight unjust real estate practices'",
        "'speaker_2': 'and promote integration. I want to commend Rebecca Rodgers and her family for their stewardship of their house so far and their efforts to pursue this designation with the help from many other consulting that who prepared the designation application.'",
        "'speaker_2': 'We hope Rebecca and her family's action will inspire others in the neighborhood to take similar action, as Parkville is home to many terrific resources, but so few designations. Thank you all. Thanks so much tonight.'",
        "'speaker_0': 'Thank you, Shannon. Our next speaker up is Jessie Perez.'",
        "'speaker_3': 'Hello.'",
        "'speaker_0': 'Go ahead, Jesse. I think you might have to unmute again.'",
        "'speaker_3': 'Uniform. Only the speaker. Mm hmm. Anyway, my name is. Just listen, Paris. I'm up against the Denver homicide law last night. Law for self-defense, positive for suffocation. It was the Unity Party of Colorado in a mile high. No, that would be the next mayor of Denver in 2020.'",
        "'speaker_3': 'Group. So here we go again with another historic preservation. I know historically prejudiced and racist neighborhood, but yes. South Park you. So we're going to pass this preservation because it meets all the criteria of whatever criteria is based on it's going to meet the criteria.'",
        "'speaker_3': 'So there's nothing I can tell you that changed your vote on this. I would just like to acknowledge the fact that the presentation didn't do any kind of justice or injustice in regards to the fact that this was red lives.'",
        "'speaker_3': 'And this house is one of the main houses that would put a red line in. It was involved included in that red lining. You mentioned it bravely, but then it kind of we didn't go into detail about it.'",
        "'speaker_3': 'So but those are going in in our home. Prior to 1970, black people were not allowed to live past Colorado Boulevard. The first black people moved to Park Hill, what is now South Park? The North Park Hill in the 1970s.'",
        "'speaker_3': 'So this is very recent that we were allowed to even live in this neighborhood and campaigning in 2019. And every single door in this neighborhood and this area is still pretty much a red line. Maybe a few black families stay in South Park.'",
        "'speaker_3': 'Majority of the black families live in North Park. You. And this is by design. So even 40, 50, 50 years later, we still see the effects of rail line in in the 21st century. So I would be doing all my people with the service if I did not bring this up and let people know the historical significance'",
        "'speaker_3': 'of this. As I stated previously, nothing I'm going to say is going to change. The vote on this is pretty much been bought and sold. So I just want to let people know. Redlining is still in effect in the 21st century.'",
        "'speaker_3': 'This neighborhood was off limits to black people for a number of years. A number of decades. And I do not feel comfortable in this neighborhood. Still to this day, like I said, I knock on doors in this neighborhood doing my campaigning for city council about large.'",
        "'speaker_3': 'I do not feel welcome or at home if you don't know how to start with that. This meets the criteria. So once you get past. Thank you for your time tonight. By.'",
        "'speaker_0': 'Thank you, Jesse. Our last speaker is David Hagan.'",
        "'speaker_3': 'Hi. Good evening, City Council. Thanks for having me on here. I want to just reiterate what Jessie had said. I'm assuming that the only black people that entered that house prior to 1970 worked at that house to either clean or cook.'",
        "'speaker_3': 'And I think that that should be stated that we're well aware of the white supremacist past of that neighborhood. And since it was brought up that the home was part of integration, I think that we should also be aware that that that home housed a whole lot of unhoused right now.'",
        "'speaker_3': 'So I don't know how many bedrooms and whatnot are in there, but I'm pretty sure half of downtown could sleep in that house. That's all I have to say. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers tonight, questions from members of council. All right. Going once.'",
        "'speaker_1': 'Going twice. All right.'",
        "'speaker_0': 'The public hearing for Council Bill 20, Dash 1560 is closed. Comments by members of council. Councilman Herndon.'",
        "'speaker_5': 'Thank you, Madam President. I am very familiar with this property. I take my view several times. It's a beautiful house for those who have not had the opportunity to drive it, and it certainly meets the criteria. We got a little off comment with a little bit of false information, but I'll let my colleagues, your interested, read the'",
        "'speaker_5': 'history of Baku when it comes to integration and the work that that community has done. So I just want to just briefly talk about that, since I don't want people to think everything that's said here during public comment is true.'",
        "'speaker_5': 'But I also want to commend Rebecca Rogers and her family. She's a tireless advocate for making things historic beyond just her household, as she was talking about in the park community. So I want to thank her and her continued efforts for that.'",
        "'speaker_5': 'I will be supporting this and I would ask my colleagues to do the same. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Herndon and I likewise will be supporting this structure for preservation. It does meet all of the significant criteria necessary. Madam Secretary, roll call, please.'",
        "'speaker_1': 'Herndon, I. Hines.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Cashman, Ryan. Can each i. Ortega. I. Sandoval. I swear. I, Torres. I. Black eye. CdeBaca. I, Clark.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_1': '13 Eyes.'",
        "'speaker_0': '13 Eyes Council Bill 20 Dash 1560 has passed there being no further business before this body. This meeting is adjourned. Enjoy your evening.'"
    ]
}