{
    "A bill for an ordinance changing the zoning classification for 10353 East Mississippi Avenue in Windsor.\nApproves an official map amendment to rezone property located at 10353 East Mississippi Avenue from B-1 with Condition to S-MX-3 (business district in the former chapter 59 zoning to suburban, mixed-use) in Council District 5. The Committee approved filing this item at its meeting on 10-29-19.": [
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilwoman swear. Will you please put Council Bill 1155 on the floor?'",
        "'speaker_1': 'I move that council building council bill 19 dash 1155 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been. Thank you very much. It has been moved and seconded. Comments. Well, I think we're out of order here. So this is the first one. This is Mississippi. I'm sorry. So I forgot. We had two. This one comments by members of council.'",
        "'speaker_0': 'Councilman Herndon, I'll let you explain what we're doing. Yes.'",
        "'speaker_2': 'Thank you, Mr. President. Further request of the applicant. I am asking my colleagues to vote no to defeat this bill. The application is being withdrawn.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Are there any other comments on this one? All right, Madam Secretary, council members, this reminder to please vote no. Madam Secretary, roll call.'",
        "'speaker_3': 'Black. CdeBaca No. Flynn Gillmor Nick Herndon, no. Hines No. Cashman. Kenny Ortega. Sandoval.'",
        "'speaker_1': 'Sawyer No.'",
        "'speaker_3': 'Torres Mr. President. No.'",
        "'speaker_0': 'No. Madam Secretary, please go to the voting, announce results. It looks like we're still missing.'",
        "'speaker_3': 'One more. Missing one.'",
        "'speaker_0': 'We re missing.'",
        "'speaker_1': 'It was me. She closed it and.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2220 Blake Street in Five Points. Approves an official map amendment to rezone a portion of the property located at 2220 Blake Street from R-MU-30 with waivers and conditions to C-MX-5 (residential, multi-unit in the former chapter 59 zoning code to urban center, mixed use) in Council District 9. The Committee approved filing this item at its meeting on 10-29-19.": [
        "'speaker_0': 'Okay. So Sandoval was also a no. So, Madam Secretary, you are close to voting in those results. 11 is 11 nay is constable. 1155 has been defeated. All right, Councilman Sawyer, will you please put Council Bill 1156 on the floor?'",
        "'speaker_1': 'Absolutely. I move that council bill 19, dash 1156 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you very much. It has been moved and seconded. The public hearing for council bill 1156 is open. May we have the staff report?'",
        "'speaker_9': 'Certainly. Good evening, council. I'm Brandon Shaver presenting official map amendment application four 2220 Blake Street rezoning from r m 30 with waivers and conditions to see him x five The subject property is located in Council District nine within the five points neighborhood.'",
        "'speaker_9': 'The request is for CMCs five, which is urban center neighborhood context mixed use five storeys maximum height. The subject property is currently a restaurant with just over 9300 square feet and land area and is requesting the rezoning to allow for more flexibility in signage.'",
        "'speaker_9': 'Existing zoning on the site is AMI 30 with waivers and conditions. I'll get to that in the next slide. This is surrounded by more AMI 30 with waivers and conditions as well as x five ncm x eight, both with billboard use overlays.'",
        "'speaker_9': 'So AMI 30 is a primarily residential district which allows for higher density multi-unit as well as consumer retail and service uses. The waivers on the site are for uses that require special review, open space, setbacks in height. There is also a condition that requires two affordable housing units.'",
        "'speaker_9': 'But this has been satisfied with the construction of the multi-unit building which was constructed in 2005. There is also a party wall agreement with the neighboring property, which requires a ten foot setback for solar access if the subject property is ever redeveloped.'",
        "'speaker_9': 'As to not block views from the condo building, which has windows built to the side interior property line, current land use of the subject property is commercial retail in the form of a restaurant adjacent land uses include more commercial retail, office, parking, multi-unit, residential and entertainment cultural uses that cause field.'",
        "'speaker_9': 'The subject. Property is also a contributing structure within the Ball Park Historic District. Therefore, any additions or alterations to the structure would require special review by the Landmark Preservation Commission. It is highly unlikely that the Commission would ever approve demolition of the structure and any additions will require consent from the registered neighborhood organizations.'",
        "'speaker_9': 'One here is the Reno Arts District. The photos to the right give you a sense of the building foreman's skill in the area. There are a number of single and two story historic warehouses and commercial structures interspersed with multi-unit residential buildings of up to six stories in height.'",
        "'speaker_9': 'This table is side by side comparison of the existing zoned district versus the proposed, and you can see they're fairly similar. So speaking to the process, informational notice of this application was sent out in early May and CPD received a revised submittal in July.'",
        "'speaker_9': 'Planning Board Notice was sent out on October 1st and the board voted unanimously to move the application forward at their October 16th meeting. It was again moved forward unanimously at the Luti committee on October 29th. The property was properly noticed and as a present, three letters of opposition have been received from residents in the condo development south'",
        "'speaker_9': 'of the subject property. These letters are concerns that the proposed zoning could result in a five storey building that would block sunlight access. And as I said previously, the current zoning already allows for 65 feet and the party wall agreement is in place to provide a side interior setback should the subject property ever undergo redevelopment or have'",
        "'speaker_9': 'an addition. And also to that point, I think a couple of these letters spoke to why CPD didn't want to pursue a waiver at this site. And the reason that we did not go forward with a waiver is because a waiver is essentially a rezoning and we do not rezone to districts that are former Chapter 59, which'",
        "'speaker_9': 'this is now under the criteria, starting with consistency with adopted plans. These four plans impact the subject property. This rezoning is consistent with a number of strategies and Plan 2040, including using urban design to contribute to economic viability and supporting the creation and expansion and economic viability of Denver food businesses and encouraging mixed use communities.'",
        "'speaker_9': 'More detail and discussion of consistency with these goals can be found in the staff report. Moving to Blueprint Denver The subject property is mapped as a downtown context. It is important to note that the boundaries of context have limited flexibility as long as it furthers blueprint.'",
        "'speaker_9': 'Denver's strategies and the intent of the context map. The plan states that neighborhood context should be consistent across an area and not very at the parcel level. Therefore, as a number of surrounding properties have an urban center neighborhood context, this request is consistent with the blueprint context map.'",
        "'speaker_9': 'The future place for the subject property is a high residential area. These places have a high mix of uses throughout contained buildings with high lot coverage and give high priority to pedestrians and then future street types. Both 22nd and Blake Streets are downtown arterials.'",
        "'speaker_9': 'The subject property is part of the growth strategy as it is within a high residential area in a downtown or urban center neighborhood context. These areas are expected to take on 15% of new housing and 5% of new employment by 2040.'",
        "'speaker_9': 'Moving to the northeast downtown neighborhood. The plan, which was adopted in 2011, recommendations from this plan include creating mixed use areas that place high importance on pedestrian access and promoting the use of design elements that link buildings to the street environment.'",
        "'speaker_9': 'The request for a mixed five is consistent with these recommendations and the future land use and maximum building heights identified in this plan. Lastly, the downtown area plan recommends that this area transform into a dense, vibrant, mixed use district that is highly activated by pedestrians.'",
        "'speaker_9': 'So the requested zone district is consistent with these goals as well. Staff also finds that the requested rezoning meets to the next two criteria, as it will result in the uniformity of district regulations and will further public health, safety and welfare primarily through the implementation of adopted plans and fostering the creation of a pedestrian friendly mixed use'",
        "'speaker_9': 'area. Near high capacity transit. This rezoning is justified. As the city adopted the Denver zoning code in 2010 and the property retained old code zoning. The proposed rezoning is also consistent with the urban center neighborhood context that exists in the surrounding area and the CMC's purpose and intent statements.'",
        "'speaker_9': 'So at that, CPD recommends approval based on planning. All review criteria have been met.'",
        "'speaker_0': 'Thank you very much. We have two individuals signed up to speak this evening. First up is Lee Driscoll. Good evening and thank you very much for your time. I am Lee Driscoll, the applicant. I want to thank the both city council and the City Planning Department for helping me through this process, which is very interesting and complex'",
        "'speaker_0': 'and helped me learned a lot about the comprehensive plans. Anyway, I really just wanted to be available for any questions and if there are any to answer them. Thank you. Thank you very much. And next up, Jesse Paris.'",
        "'speaker_10': 'Good evening. Members of council, members of the audience, those watching at home. My name is just LaShawn Paris. And I ran for city council where a large almost 15,000 votes with no money. And I'll be running to be the next mayor in 2023.'",
        "'speaker_10': 'And I'll represent for Denver homeless out loud black stars and more self defense positive actually commit for social change, universal African People's Organization as well as the Unity Party of Colorado and Mile High. No, I was against this initially because I thought it was going to be another rezoning for more property that people cannot afford to live'",
        "'speaker_10': 'in. But if it's just an expansion to a restaurant, I think I'm willing to work with that. I just want to know what's going to be here exactly and how high of stories it is going to be, because I heard something about it could build up to five stories.'",
        "'speaker_10': 'I would like some clarification about that. And then also, if there was a traffic study done in this area, because the traffic is already bad enough in this area and this area is pretty trashed at night and it gets blamed on the on house neighbor.'",
        "'speaker_10': 'So I would like to know what exactly is going to be expanded with this restaurant. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council on this item?'",
        "'speaker_1': 'Councilman CdeBaca Thank you, Mr. President. Mr. DRISCOLL Would you mind answering that question of what is the plan for this area? It seems like it's just for signage, but I would.'",
        "'speaker_0': 'Certainly. Would you like me to face council? No. First question.'",
        "'speaker_2': 'Our application is purely.'",
        "'speaker_0': 'Submitted for the purpose of being able to be more flexible on the signage. Maybe there are variances to this signage in all the surrounding blocks except for ours, which has the perverse effect of making the block look dark and scary at night and and defeats many of the purposes of all the floor plans that are cited here'",
        "'speaker_0': 'to make the neighborhood safer, more vibrant, more mixed use to to help connect Rhino and LoDo and all of those things. We the. The irony is that we have we did on the property. We sold it in 2015.'",
        "'speaker_0': 'We took back a 40 year lease. We believe strongly that having a better signage will attract more people to the block. And I've been supported by all the other neighborhood, all the other businesses who would like to do the same, but they don't have the time and energy to invest in doing this.'",
        "'speaker_0': 'I am lucky to have. I was also encouraged by the city planners to take the zoning approach so that we could set a precedent that would make it possible for other businesses on our block. We are very lucky.'",
        "'speaker_0': 'We have a very strong brand, which is the Cherry Cricket, but two businesses, the restaurant directly across the street from us has failed three times. There's a of excellent pizza location just to the south of us that does well but could do much better in my view, if they had signage that was consistent with the rest of'",
        "'speaker_0': 'the neighborhood. So that's really our goal. The. The irony of the whole thing is that the more successful we are, the less likely that the properties ever to be developed because we will keep our lease for the next 35 years.'",
        "'speaker_0': 'So it will stay exactly as it is. If we have our way.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Cashman? Yeah. Thank you, Mr. President. For CPD plan. Thank you. So you said if something were to get built there in the future, it has a ten foot setback. Correct? What? How close to the property line is the nearest I is an apartment building or a condo building close?'",
        "'speaker_9': 'It's a condo building. And they're both buildings are built to the property lines.'",
        "'speaker_0': 'Okay. So there they have no setback strength. A new building would be ten, ten feet away.'",
        "'speaker_9': 'That's correct.'",
        "'speaker_0': 'Okay. Thank you. I just have trouble with giving an entitlement that's not being asked for. I mean, as opposed to making an exception in the other direction and just giving the sign waiver. Even though it violates an internal policy of CPD, it just doesn't make sense to me.'",
        "'speaker_0': 'Well, here you go. Here's. Here's three extra stories that you haven't asked for.'",
        "'speaker_9': 'Well, I wouldn't see it as quite entitlement change. The current zoning allows for 65 feet.'",
        "'speaker_0': 'Is that right?'",
        "'speaker_9': 'And the proposed zoning is 70 feet in maximum height.'",
        "'speaker_0': 'Okay, great. Thank you for the clarification. Thank you, Councilman. Councilman Sandoval.'",
        "'speaker_1': 'Yes, thank you. Can you talk to me about the ballpark? Historic district. So what are the design guidelines and standards for that? I'm not familiar with that one as much.'",
        "'speaker_9': 'I'm not quite as familiar either, other than any project that goes through that in that district has to go through a design review from the Preservation Commission.'",
        "'speaker_1': 'Do you buy time to know if this is a contributing structure?'",
        "'speaker_9': 'That is a contributing structure.'",
        "'speaker_1': 'Demolition is impossible.'",
        "'speaker_9': 'Probably wouldn't happen. Correct.'",
        "'speaker_1': 'Perfect. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. All right. Seeing no other questions, the public hearing for councilmen 1156 is closed. Comments by members of council. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. When I first heard that this was regarding the cricket, I thought I was asleep at the wheel. I'm glad to know that the Cherry Cricket not in Cherry Creek is is the particular property in question and that the Cherry Creek Cherry Cricket will continue as a.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Hines. Any other comments? Right. Seeing no other comments. I'll just add my thank you to staff for all your hard work in putting this all together. I think this clearly meets the criteria and I will be voting yes.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_3': 'Thank you for your patience. Black CdeBaca I Gilmore I Herndon High Hines I. Cashman can each. Sandoval, I. Sawyer Ortega. Mr. President.'",
        "'speaker_0': 'Did we get Torres?'",
        "'speaker_3': 'Torres. I'm sorry, I. Sorry.'",
        "'speaker_0': 'And I'm an I. Thank you, Madam Secretary. Please. Because the voting and not the results.'",
        "'speaker_2': 'And then.'",
        "'speaker_3': 'You have a nice.'",
        "'speaker_0': '11 eyes counterpart. 1156 has passed. On Monday, December 16, the Council will hold a required public hearing on Council Bill 1259, designating the Tilden School for Teaching Health Historic District as a district for preservation. A 30 minute courtesy public hearing on Council 1176 amending Chapter 48 of the Denver Revised Municipal Code by adding Article nine entitled Fee'"
    ]
}