{
    "A proclamation recognizing May 19th as Hepatitis Testing Day and July 28th as World Hepatitis Day.": [
        "'speaker_0': 'Thank you, Councilwoman Sussman. And then one last announcement this past Wednesday, May 8th, was Councilwoman Neches birthday. So happy belated birthday. We're going to move on from announcements. There are no presentations and there are no communications. But we do have one proclamation this evening.'",
        "'speaker_0': 'Councilman Lopez, will you please read Proclamation 473?'",
        "'speaker_6': 'Thank you, Mr. President. Proclamation number 473 series of 2019 recognizing May 19th as hepatitis testing day and July 28th as World Hepatitis Day. Whereas May 19th is National Hepatitis Testing Day and July 28 as World Hepatitis Testing Day, HEP Hep C is recognized as the most common blood borne viral infection in the United States.'",
        "'speaker_6': 'And. WHEREAS, mortality due to hep C is increasing in Colorado partnership, particularly among people born between 1945 and 1965 with over 19,000 hepatitis C related deaths occur annually in the United States. And. WHEREAS, Hepatitis B accounts for almost 14,000 annual deaths in the United States, there are currently about five I'm sorry, 15,436 people in Colorado living with'",
        "'speaker_6': 'chronic unresolved hepatitis B infection, and fewer than one third of people with chronic hepatitis B are aware of their infection. And. Whereas, Hepatitis B and C cause an estimated 61% of liver cancer. Hepatocellular carcinoma. HTC and the United States and the opioid epidemic is feeling an increase in HPV and HCV positive cases, whereas hepatitis C has infected'",
        "'speaker_6': 'an estimated 50,975 Coloradans. As many as 2.7 million American residents and more than 130 million people worldwide, and is a leading cause of cirrhosis, liver cancer and liver transplants in the United States. And. Whereas, hepatitis C can be prevented, testing can identify existing infections, and early diagnosis and treatment can save lives, money and resources.'",
        "'speaker_6': 'And. Whereas, Liver Health Connection is available as a statewide resource for education testing, linkage to care, patient navigation helpline and other support services. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one at the city, the Denver City Council agrees that preventing and treating viral hepatitis as an important public health'",
        "'speaker_6': 'initiative that will improve the quality of life for Denver residents affected by the virus. Section two The Denver City Council proclaims May 19th as hepatitis testing day and recognizes July 28 as World Hepatitis Day. Section three, the clerk of the city and county of Denver shall attest and affects the seal of the city and county of Denver'",
        "'speaker_6': 'to this proclamation, and that a copy be transmitted to Nancy for executive director of the Liver Health Connection.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_6': 'I move that proclamation 473 series of 2019 be adopted.'",
        "'speaker_0': 'Has been moved and seconded comments by members of council and Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. Every year I have the honor to bring this forward. I think we've carried it since 2009, perhaps every every year. And it's absolutely critical that this that this proclamation come across our desk and in these chambers, because hep-C is absent, there's a cure and it's preventable.'",
        "'speaker_6': 'And the more people that we get out, particularly the high risk populations to understand Hep C and especially our young people and especially folks that get tested, it's absolutely critical we can prevent these deaths. There's been a lot of research, a lot of resources and just, frankly, a lot of good education.'",
        "'speaker_6': 'I have seen, you know, I think it was Councilman Garcia at the time represented Council District One who carried this. And in his absence, he wasn't able to. And I took it on and and I took it on because it's dear to me, my grandfather, whose picture I have right here along with my grandmother, my my daughter'",
        "'speaker_6': ', my grandfather was born in Ault, Colorado, northern Colorado. My family's from and went to go serve in World War Two. He was a beet worker and really and he went to go server and he served our country in Germany and came back injured and spent his time in Fort fought against Fort Carson.'",
        "'speaker_6': 'But he he had a blood transfusion after his injury. His Jeep had rolled over an explosive. And the folks who were in the energy besides him were killed. And he rolled over on his knee and crushed his is his his knee had an injury.'",
        "'speaker_6': 'They gave him a transfusion. We didn't know that that was the cause of his cirrhosis until he had it. And my grandfather has not been with. He played the role. My father has not been here since 2000. My second was his birthday.'",
        "'speaker_6': 'And I wish that we had the advances and the technology to be able to treat it. Early on, my grandfather would still be here with me and I would really appreciate his advice. Nowadays, they just don't make them like that anymore.'",
        "'speaker_6': 'And it's sad that my grandfather only got to see 72 years of life. There are a lot of people and we're losing our war to generation. There are a lot of baby boomers. There are a lot of folks who need to be tested.'",
        "'speaker_6': 'Everybody needs to be tested. We all should be tested for things like this. So we know and once we know that early detection, we can treat it and we can save lives because there's somebody's grandson that needs his grandfather or grandmother or mother.'",
        "'speaker_6': 'Right. And it's absolutely critical that we make this is the part of our everyday awareness. I thank you, Nancy. And I used to be the Hep C connection. So thank you all for carrying this. It's been an honor to carry this for you.'",
        "'speaker_6': 'This is my last time I'm carrying this proclamation. And I and with the same amount of energy that I carried the first time around, I'm going to ask people to please get tested. Please educate others about hep C and other viral infections like this.'",
        "'speaker_6': 'With that, I know that on. Let me see. May 19th. Are we in the web? Sorry. May 17th. C testing is going to take place free. Hep C testing is going to take place in the web building from 830 to 330.'",
        "'speaker_6': 'So we'll make sure that more information is passed on. I'll be on my website. Mr. President, I'll have Nancy come up and explain the rest of that. But thank you for allowing me to carry this proclamation one last time.'",
        "'speaker_0': 'Thank you. Councilman Lopez. Thanks for bringing this forward. Madam Secretary, roll call. LOPEZ My.'",
        "'speaker_1': 'Black eye.'",
        "'speaker_0': 'Flynn All right.'",
        "'speaker_1': 'Gilmore, I. Herndon.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Cashman. Kenny. I knew Ortega. My assessment.'",
        "'speaker_3': 'Right.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_0': 'All right. Madam Secretary, please. Because voting announced results 1111.'",
        "'speaker_1': 'Nice.'",
        "'speaker_0': '11 Proclamation 473 has been adopted. Councilman Lopez. Is there somebody you'd like to bring up to accept the proclamation?'",
        "'speaker_6': 'Yes. None other than Miss Nancy Steinfurth, if you want to come up.'",
        "'speaker_3': 'Thank you, everyone, for your support of the resolution tonight. And thank you especially to Councilman Lopez, who's been our champion for many years. We're going to miss you. I would like to encourage everyone to join us at our event on May 17th.'",
        "'speaker_3': 'So because the Web building isn't open on Sunday, we're a Sunday. We're doing this event on Friday from 830 to 330. We're offering free testing for hepatitis C to anyone who's interested. So members of the public, people who work in the building, audience members, anyone who's watching television.'",
        "'speaker_3': 'We would love to have you come down and get tested. It's free. It is a simple, simple finger prick. We give results in 20 minutes and then we provide information on what the next steps are in the process.'",
        "'speaker_3': 'Because like a lot of viruses, this isn't a one step and you're done. You then have to have other testing. One of the great achievements of the medical field is that there is now a cure. There's actually a few cures for hepatitis C.'",
        "'speaker_3': 'It is in as short a timeframe as eight weeks with one pill a day and no side effects. And so that's a remarkable thing to be able to say. We can cure this, we can eradicate it, but you can't do it until everyone is tested.'",
        "'speaker_3': 'You had a risk factor. Some of those risk factors are getting a tattoo in an unsafe setting. People don't think about that that often. But if you are sharing works because you're doing it in a basement, well, that's kind of risky.'",
        "'speaker_3': 'So that is one of the criteria. World War. In addition to World War Two veterans, Vietnam veterans, about 10% of them have hepatitis C, and that's because they hadn't even identified the disease until 1989. And so anyone who had a blood transfusion, plasma transfusion in the field, trans transfusion, MASH unit care, that was a risk factor.'",
        "'speaker_3': 'And so that represents 10%. Over the last couple of years, the VA has treated 100,000 veterans for their hepatitis C infection, and they are committed to treating everyone who is a veteran. And so that's a great opportunity. In Colorado, the Department of Corrections is also treating everyone in the Department of Corrections that has hepatitis C.'",
        "'speaker_3': 'Unfortunately, it was as a result of a lawsuit. But hey, we'll take a win wherever we can get it. Colorado Department of Corrections will also treat everyone. And so all of these great opportunities are coming together and we hope everyone in the audience takes advantage of it.'",
        "'speaker_3': 'If you can't make it to the web building, we're also testing at Pride Fest, which is in June and then will be testing at Skyline Park on Friday, July 26. So it's not the 28th, but we figured the largest number of people would be there.'",
        "'speaker_3': 'We could get people walking up and down the mall, people out for lunch, break, etc.. And that's thanks to Councilwoman Ortega. So thank you very much for sponsoring that. I appreciate all of your support over the years. And thank you again.'",
        "'speaker_0': 'Thank you. All right. That concludes our proclamations this evening. We're moving on to bills for introduction. Madam Secretary, will you please read the bills for introduction.'"
    ],
    "A bill for an ordinance approving a proposed Agreement between the City and County of Denver and the Housing Authority of the City and County of Denver, to provide assistance to low-income homeowners for the construction of accessory dwelling units. Approves an intergovernmental agreement with the Housing Authority of the City and County of Denver, Colorado for $500,000 and for two years to provide soft second mortgages of up to $25,000 to low-income homeowners participating in the West Denver Single Family Plus program to assist in the development of accessory dwelling units (ADUs) to serve as an income-generation and anti-displacement tool in Council Districts 3, 7, and 9 (OEDEV-201846549-00). The last regularly scheduled Council meeting within the 30-day review period is on 5-20-19. The Committee approved filing this item at its meeting on 3-27-19.": [
        "'speaker_1': 'So do you council president. We can do the comment first if you'd like.'",
        "'speaker_0': 'All right. Let's go ahead and do that. Councilman Lopez, Mayor Secretary, if you put that one on our screens, Councilman Lopez, you want to go ahead with your comment on two, four or five?'",
        "'speaker_6': 'Yeah. Thank you, Mr. President. I just wanted to highlight this. This is something great. This is a great program. It's the West End for Single Family Plus one program. This is out of the out of a great office, an idea.'",
        "'speaker_6': 'Renee Martinez Stone had this opportunity. This is something that we've been working on with OED as part of the city. I brought this program, this funding for this program, asked as a request of council. The last time around, we weren't able to get it, but we were able to identify funding in the general fund for this program'",
        "'speaker_6': '. What this program does is it identifies well, that's actually part of the West Denver Renaissance Collaborative. We started in 2016 as a partnership between the Housing Authority and and the city of Denver to really look at a solution involving involuntary displacement in West Denver and looking at a to use as a model, especially in this area.'",
        "'speaker_6': 'Right. In a lot of a lot a lot of area, a lot of land area and zone districts in West Denver is actually open to use now that we we still have need to use our additional dwelling units, converted garages, things like that allows folks to be able to stay in the community, live at home, or even'",
        "'speaker_6': 'rent out the 81, live out of the house or the other way around, and pay off that mortgage and those house payments. They serve about 65,000 residents and 25,000 households over ten neighborhoods and three council districts, three, seven and nine.'",
        "'speaker_6': 'There's a little bit of a little more background information, statistics, housing and affordable housing, involuntary displacement and use. And, you know, as two top priorities in this city, we had about 6000 residents that have been contacted, contacted about West Denver, single family plus one.'",
        "'speaker_6': 'There's been 60 series anchor inquiries about the program. Five are already moving forward in the process. Those moving forward are in VR Park in Westwood. Three out of five applicants moving forward are under 80%. AMI now the first three years of the program was the DITO funding was a third of was a third of the Westwood Renaissance'",
        "'speaker_6': 'sorry West Denver Renaissance Project budget. We've invested 600,000 over the last four years. And what time that the WDC has leveraged leveraged 2.6 million in additional project funding and outcomes on top of community priorities. Like I said last October, I requested for another 300 K to go to the West for a single family plus program to make'",
        "'speaker_6': 'sure that it was funding. Funding funded through the pilot phase. It wasn't. We were able to get 150 identified through the general fund. My ask of this council and folks who are here is to remember that this program works.'",
        "'speaker_6': 'This is a viable program. It's a program that we can really take advantage of in West Denver with all those own districts that allow for Adus. We purposefully did that back in the day because there there are a lot of folks that are living out of converted garages already that are not in code.'",
        "'speaker_6': 'There are a lot of folks that are still living with their families that can continue to still live with their families. It allows for like a multigenerational cultural exchange. And also it's a solution. It's a real solution. A part of the solution to our affordable housing crisis is.'",
        "'speaker_6': 'Now, I want to make sure that as we have these discussions in the future, that we look at models like this, this is viable. Yes, they are expensive. And that's why this is important for us to be able to step in to help with this program.'",
        "'speaker_6': 'I want us to see I want us to see light in the budget every year. We really have to invest our resources and innovative ideas like this, ideas that were born out of out of these neighborhoods and our folks that are on the ground in these neighborhoods.'",
        "'speaker_6': 'Yes, there are other tools and mechanisms that we're investing into. But this program in particular has proven to be a success. And I think it's going to be really, really helpful in some of these numbers. So you're seeing displacement with the threat of gentrification.'",
        "'speaker_6': 'So I just want to just highlight this, bring it out how these statistics are in front of us. And I hope that the administration and data will work and will continue to fund this industry extremely important programs. So with that, I just wanted to say thank you, you guys.'",
        "'speaker_6': 'I'm so not used to saying. Dito I feel weird saying it already. Dito So yeah. Economic development.'"
    ],
    "A resolution approving and providing for the execution of a proposed Grant Agreement between the City and County of Denver and the United States of America Department of Housing and Urban Development concerning the Continuum of Care Bedrock 2019-2020 program and the funding therefor. Approves a grant agreement with Department of Housing and Urban Development (HUD) to accept $629,750 and through 10-31-20 to provide rental assistance to individuals experiencing homelessness through the Continuum of Care Bedrock program, citywide (SOCSV- 2019-48905). The last regularly scheduled Council meeting within the 30-day review period is on 6-3-19. The Committee approved filing this item at its meeting on 5-1-19.": [
        "'speaker_0': 'Excellent. Thank you. Councilman Lopez. Madam Secretary, would you please put 402 up on our screens? And, Councilman Ortega, you want to see if there's somebody here who can answer your question?'",
        "'speaker_3': 'Yes. And I see someone coming forward. So my question is, if this is related to a specific project or does it cover multiple projects?'",
        "'speaker_6': 'Vince Rivera Denver Human Services. Yes, this is a consolidated grant. So it's two projects. It's actually the Lowry Project and the Veterans Project.'",
        "'speaker_3': 'And is the Veterans Project one on Federal Boulevard and.'",
        "'speaker_0': 'One on the federal? It's the veterans is it's.'",
        "'speaker_6': 'Facilitated by Bayard. So they have a few different.'",
        "'speaker_3': 'Okay. I'm just trying to clarify if this is related at all to Del Norte, who administers housing for veterans and on federal? No, if it's not, then we're okay and let it go forward. Otherwise, they need to abstain.'",
        "'speaker_3': 'It's not. Okay, great. Thank you. I have no further questions.'"
    ]
}