{
    "A proclamation welcoming the 108th National Western Stock Show, Rodeo and Horse Show to Denver. Welcoming the 108th National Western Stock Show, Rodeo and Horse Show to Denver.": [
        "'speaker_3': 'And so that's a great story, Councilman. Thank you very much. I don't see any other announcements, presentations. Madam Secretary, do we have any presentations?'",
        "'speaker_2': 'None, Madam President.'",
        "'speaker_3': 'Communications. Do we have any communications?'",
        "'speaker_2': 'None, Madam President.'",
        "'speaker_3': 'But we do have two proclamations this evening, and I'd like to invite Councilman or see Councilwoman Monteiro to please read Proclamation 1022.'",
        "'speaker_6': 'Thank you, Madam President. Proclamation number 13 1022 is welcoming the 108th National Western Stock Show, Rodeo and Horse Show to Denver. And it reads, We're at the annual National Western Stock Show, Rodeo and Horse Show. We'll ride into town with the parade on January 9th and will open the annual event for the 108th time on January 11th'",
        "'speaker_6': 'with various activities happening through January 26th, 2014. And. Whereas, the National Western Stock Show is a storied treasure of Denver's past with a unique and colored history dating all the way back to 1906. And. Whereas, Mayor Robert W Spear declared Wednesday, January 31st, 1906, as Denver Stock Show Day, an official holiday in the city of Denver so'",
        "'speaker_6': 'everyone could partake in the first ever stock show there was on this day that banks, department stores and other businesses in every corner of Denver shut their doors at noon while streetcars hustled from the 15th Street loop every 3 minutes to the stockyards site.'",
        "'speaker_6': 'And the Burlington Railroad rushed special cars from the Denver Union Depot for a round trip charge of $0.25. And. Whereas, in addition to exhibiting prized livestock farming technology and other important components of Colorado with rich agricultural traditions, the National Western Stock Show's earlier years also included entertainment shows from popular figures like Buffalo Bill Live boxing events from'",
        "'speaker_6': 'professional fighters like Jack Dempsey and Jess Willard, and tug of war contest between the Denver and Omaha Police Departments. What if most unusual forms of entertainment occurred between 1913 and 1916 were small titles? These were judged by the same rules as the livestock and the ever so popular naked baby contest.'",
        "'speaker_6': 'And.'",
        "'speaker_2': 'WHEREAS.'",
        "'speaker_6': 'WHEREAS, the first ever Catch a Calf event was held in 1935, where crowds cheered as young boys ran around the arena and their attempts to wrestle calves down by their collarbones with the lucky winners taking their prize calves home, feeding them, raising them and showing them off at next year's stock show.'",
        "'speaker_6': 'It wasn't until more than 35 years later when young girls were finally allowed to participate in the 1974 Catch a Cab. I mean, Catch a Calf of it, which is now one of the most famous and treasured events of the show.'",
        "'speaker_6': 'And. Whereas, today, the primary mission of the National Western Stock Show is to educate urban and suburban citizens about the importance of understanding and preserving Colorado's Western heritage in agriculture, providing city kids a hands on experience with farm animals, and to host one of the world's largest professional rodeo and horse shows.'",
        "'speaker_6': 'And. WHEREAS, A National Western stock show provides ranchers and farmers an opportunity to share the latest information on livestock, including scientific and genetic research. In addition, more than 350 vendors fill the showgrounds with food and a variety of products for sale.'",
        "'speaker_6': 'And. WHEREAS, the inaugural National Western Stock Show was January 1906, attracting 15,000 visitors over six days. Now the event attracts more than 600,000 visitor visitors annually from all 50 states and 35 foreign countries and more than 15,000 head of horses, cattle, sheep, swine, llamas, bison and other animals that are represented.'",
        "'speaker_6': 'And. Whereas, the most recent economic studies suggest that the National Works Western Stock Show contributes approximately 100 million to the Denver economy. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council hereby enthusiastically welcomes the 108th Annual Master, National Western Stock Show, Rodeo and Horse Show'",
        "'speaker_6': 'to Denver and extends their best wishes for another exciting and successful year and encourages Denver residents to saddle up and enjoy the show. Section two that the clerk of the city and county of Denver shall attest and affix a seal of the city and county of Denver to this proclamation and that a copy be transmitted to Paul'",
        "'speaker_6': 'Andrews, president and CEO of the National Western Stock Show, Rodeo and Horse Show.'",
        "'speaker_3': 'Thank you, Councilman Monteiro, for that great history. Your motion to adopt.'",
        "'speaker_6': 'Thank you. Madam President, I move that proclamation 1020 to be adopted. Second.'",
        "'speaker_3': 'It has been moved and seconded comments by members of Council Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you, Madam President. It really does seem like just yesterday that I was up here reading a similar proclamation, and I've had the honor of being able to do this through the years. And I want to say that each year it becomes more and more special as National Western Stock Show has worked so hard to be such'",
        "'speaker_6': 'a notable member of our community. Last year at this time, I was happy to announce a National Western stock show was going to stay in the city and county of Denver, and that was well received news by our community at large.'",
        "'speaker_6': 'This year I'm happy to announce that there's been so much work done by the National Western Stock Show in preparation for our another 109 years here in in in Denver, Colorado. National Western recently signed a memorandum of understanding and I'll let our CEO Paul Andrews talk about that when he comes up.'",
        "'speaker_6': 'National Western has always been has also created a citizens advisory committee that's made up of neighbors that are from Global Swanson, Elyria, and they've met twice. And and I'm sure Mr. Andrews will talk about that as well. And so I wanted to wholeheartedly say that it's always been always my honor to be able to read this proclamation'",
        "'speaker_6': '. And I'm excited for another exciting National Western Stock Show, and I hope that my.'",
        "'speaker_3': 'Colleagues.'",
        "'speaker_6': 'Will join me in supporting this. Proclamation.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilman Brown.'",
        "'speaker_7': 'I thank you, Madam President. The National Western does play a huge role in our community, and sometimes I think we forget that. And tonight, I would like to especially thank Paul and Ron for putting together the celebration of life for Clara Davis.'",
        "'speaker_7': 'That was a special event. You did it very quickly. And Clara Davis loved horses. In fact, she competed at the National Western. And I just want to thank you from all of us, Paul Enron, for putting together that celebration of life of Claire Davis.'",
        "'speaker_7': 'Thank you. Thank you, Madam President.'",
        "'speaker_3': 'Thank you, Councilman Brown. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Madam President. I'd like to ask that mining be added. And then, Mr. Enders, when you do come up, if you could let us know whether or not you are still looking for people to work this upcoming stock show.'",
        "'speaker_8': 'I want to wish you the best of luck with your 108th season. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Ortega. It has been moved and seconded. I don't see any other comments and I think, Madam Secretary, we are ready for roll call.'",
        "'speaker_2': 'Montero I. Nevitt Hi, Ortega. Rob Shepherd II. Brooks High brow, high five. Ty Herndon. Can each layman. Hi, Lopez. Hi, Madam President.'",
        "'speaker_3': 'I am Councilman Nevitt.'",
        "'speaker_9': 'My apologies. There you go.'",
        "'speaker_3': 'There you go. Thank you very much, Madam Secretary. Close of voting, Nance. The result?'",
        "'speaker_2': '13.'",
        "'speaker_3': 'Nice, 13 eyes. The proclamation is adopted. Councilwoman Monteiro, is there somebody you'd like to call up to the podium?'",
        "'speaker_6': 'Absolutely. I see a cowboy hat out there.'",
        "'speaker_3': 'And if you can come on out, it's a cowboy. Do it.'",
        "'speaker_6': 'Yourself. And.'",
        "'speaker_5': 'Yes, thank you. I am Paul Andrews, the president and CEO of the National Western. Thank you so much for the great proclamation since this is our 108th year. How about we just bump up that economic impact to 108 million instead of 100 this year?'",
        "'speaker_5': 'What do you think would be an area anyway? A lot of activity, as has been noted here tonight over the course of the last year. And much more activity will occur in the coming ten or so months. As was alluded to, we have signed a memo you with some very significant partners that share our vision.'",
        "'speaker_5': 'The first and most significant is the city and county of Denver through the DCC. They are an IMO you partner along with Colorado State University, the Museum of Nature and Science and History, Colorado. So all of us are focused on the vision of how to create a complex ride around I-70 and right.'",
        "'speaker_5': 'And that will forever live to both be an educational beacon for agriculture as well as a celebration of our Western heritage. So we're focused on that. And we have engaged a citizen advisory committee on that. We've met a few times now and are continuing monthly meetings that is being chaired by Maria Garcia Berry and Terrence Carroll.'",
        "'speaker_5': 'I think a couple who you all know very well on the hiring side, I'm happy to announce we hired our 1,000th person just about two days ago. So the call went out from all of you about three weeks ago to encourage constituents in your neighborhoods to apply for jobs.'",
        "'speaker_5': 'We now are fully staffed and ready to take on the more than 600,000 individuals. And in reference to Claire Davis, we also have created an event in her memory that will be the 2014 Clare Davis Memorial Gamblers Choice Horse Show.'",
        "'speaker_5': 'Clare was a individual that would have competed in that event over time. She would not have been competing in it this year, but her class would have risen up to that. So that's a night we will celebrate her.'",
        "'speaker_5': 'We have the event center will be donned with a yellow ribbon in her memory and that is a night to celebrate her life. We also have many new things like the National Western Nursery this year where you can come see pigs and sheep and goats and alpaca and baby chicks with their moms.'",
        "'speaker_5': 'It's the first time in the event center, so that'll be something that's very exciting. Evening a dancing horses will be a performance that Silvia's or beanie from Cavalier the old show from Cirque du Soleil she'll be voice commanding her Arabian stallions and as you all know the rodeos, 28 of them are second to none.'",
        "'speaker_5': 'We have the. Last rodeos in the world in Denver, Colorado. The energy in our building. The Denver Coliseum is second to none. And I say that with all sincerity. Denver should be very, very proud of the energy that rodeo brings to this community.'",
        "'speaker_5': 'And finally, we'll announce tomorrow that we have a partner that has bought the grounds admission for everyone on January 21st. Tuesday it will be Friday at the National Western Stock Show, the first of its kind provided by MetroPCS.'",
        "'speaker_5': 'So everyone will be allowed grounds admission that day for free. And that announcement will go out in a press release tomorrow. You all get it today? Again, thank you very much for having me. If there is anything I didn't cover.'",
        "'speaker_5': 'Madam Chair, please open the floodgates.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'Thank you very much, Mr. Andrews. And thank you for all you do for our city. It's wonderful to have you.'"
    ],
    "Approves changes to the zoning classification from M-RX-5 to M-MX-5 for property located at 8822 Beekman Place (aka 4936 Verbena Street) in Council District 11. (Land Use, Transportation & Infrastructure) Approves changes to the zoning classification from M-RX-5 to M-MX-5 of property located at 8822 Beekman Place (aka 4936 Verbena Street) in Council District 11. The Committee approved filing this bill at its meeting on 10-29-13.": [
        "'speaker_3': 'We reconvened, we have one more required public hearing. This evening's speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. If you are here to answer questions only, just let us know.'",
        "'speaker_3': 'Come to the podium and note that you're available for questions. Each speaker will have 3 minutes unless another speaker has yielded his or her time, which would result in a total of 6 minutes on the presentation monitor on the wall.'",
        "'speaker_3': 'When the yellow light comes on, you will have 30 seconds to conclude your remarks. And when the red light appears, your time is up. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_3': 'Speakers are prohibited from using profanity or making personal attacks during their comments. Audience Members Please remember that council members use electronic devices of various kinds to access the materials relevant to the public hearings. Be assured, however, that by mutual agreement and common practice of this Council, these devices are not being used for texting, emailing or other communications'",
        "'speaker_3': 'during public hearings. We I'm going to just open the public hearing for 757. We don't need we do not need a motion on the floor as the motion has already been opened, and we just postponed it until this very evening.'",
        "'speaker_3': 'So I'm just going to ask Mr. Mesereau to come up and give us the staff report.'",
        "'speaker_6': 'Good evening, Teresa Lucero, with community planning and Development. This is a zone map amendment for property located at approximately 8822 Beekman Place. The proposal is to rezone the property from master plan context residential mixed use with a five storey height limit to master plan context mixed use with a five storey height limit.'",
        "'speaker_6': 'The property is located in northeast Denver in Council District 11, in the Stapleton statistical neighborhood. It is generally northeast of the Northfield Shopping District, north of I-70, south of Rocky Mountain Arsenal and west of Central Park Boulevard. The property itself is about four acres.'",
        "'speaker_6': 'It is owned by Forest City Stapleton, and they are requesting the rezoning to enable some commercial mixed use land uses. So the master plan context was specifically written for the Stapleton neighborhood, and it is for redeveloping areas, redeveloping in phases over a longer period of time and contains a variety of residential densities and mixed use centers embedded'",
        "'speaker_6': 'in areas larger town centers, higher density office and industrial and employment centers. So again, the proposal is for master plan context mixed use five storey height limit. The current zoning is master plan context. Residential mixed use. The land use is vacant.'",
        "'speaker_6': 'The North Stapleton GDP, which is our most current planning document for this property, does designate the area residential mixed use. The surrounding building form and scale is between, well, actually one in three stories. We've got a new apartment building going in across the street from this property that is a three story apartment building.'",
        "'speaker_6': 'You'll see as soon as we get to the photos. This is the context. It looks very vacant currently, but you'll see the lines that are on it for residential development. To the north west of the site, you see the Northfield commercial area and noble Sysco Foods off to the east of the property.'",
        "'speaker_6': 'We've kind of already been through what the surrounding uses are, but the surrounding zoning is Emmerich's five and I am x five, which is an industrial mixed use district in the Master Plan context and Annex five and for the Northfield Shopping Center, the old Chapter 59 commercial mixed use zone district.'",
        "'speaker_6': 'Again, the site is vacant. The we already talked about the noble Cisco and the Northfield. So I'm not going to get into that. But here are the photos of the surrounding development, brand new housing going in to the north and west, Northfield Shopping Center to the south.'",
        "'speaker_6': 'Noble Cisco is the top picture on the left. The site itself is the vacant property in the center on the I'm sorry, on the right where utilities are being installed. And then the bottom right is the three story apartment complex under construction directly across the street from the site.'",
        "'speaker_6': 'So this application was that planning board on October 16th, they recommended unanimously approval. Excuse me. I need a drink.'",
        "'speaker_3': 'Of.'",
        "'speaker_6': 'Water. Something about this room dries my throat out. Ludie, on October 29th and of course, here, January 6th for this public hearing, the RINO's notified our Northern Airport corridor. Associates. Associates. Stapleton Master Community Association. Stapleton United Neighbors and I and see of course notification signs were posted on the property 21 days in advance of this hearing.'",
        "'speaker_6': 'And to date, we have no public comments. You know, the review criteria, consistency with adopted plans, uniformity of district regulations, furthering the public health, safety and welfare, justifying circumstances and consistency with neighborhood context, zone, district purpose and intent.'",
        "'speaker_6': 'The pertinent plans are current plan 2000 Blueprint, Denver, the Stapleton Redevelopment Plan and the North Stapleton General Development Plan. I won't get into the details of consistency with the plans. It's a detailed in your staff report. Blueprint Denver.'",
        "'speaker_6': 'This is single family residential. You see the old open space through the map. That was the original layout in Blueprint Denver. Blueprint Denver talks about a city containing neighborhoods that offer a variety of housing types, complementary land use types.'",
        "'speaker_6': 'All of Stapleton on the Blueprint Denver map is an area of change. There are no street classifications for any streets but Northfield Boulevard on the Blueprint Denver map, and it is an undesignated local street. Now that's superseded by the GDP, and we'll talk about that in a second.'",
        "'speaker_6': 'The Stapleton Development Plan, this area is designated part of District six, which designates the area a mixed residential and employment zone. Talks about a town center, a walkable scale, and significant outdoor amenities that under the Stapleton, the land use concept for the North Stapleton GDP.'",
        "'speaker_6': 'This is a GDP that was completed in 2012. The land use concept is residential mixed use, so could be residential could be mixed use. The street classifications for Northfield Boulevard were updated to to what it is a major arterial and willow and Xenia streets which are the two streets on either side of our property were designated collector'",
        "'speaker_6': 'streets. That's why staff thinks this state thinks this is a prime location for commercial mixed use rather than residential. So CBD finds that the rezoning is consistent with current Plan 2000 Blueprint, Denver, the Stapleton Development Plan and the North Stapleton GDP.'",
        "'speaker_6': 'That there is no effect on uniformity of district regulations. And by implementing our plans in this manner, we are furthering the public health, safety and welfare. The justifying circumstances are changing conditions. This is a desire to continue the redevelopment of our former airport.'",
        "'speaker_6': 'So this is a very appropriate justifying circumstance for this rezoning. And we already talked a little bit about neighborhood context to the master plan context actually being written for the Stapleton redevelopment, the zoned district purpose in intent, the mixed use zone district with this being on collector streets and arterial streets, is the more appropriate zoned district for'",
        "'speaker_6': 'commercial uses that will extend from the existing commercial uses to the West. So staff believes this proposal is consistent with the neighborhood context and the zone district purpose and intent. We therefore recommend approval.'",
        "'speaker_3': 'Thank you very much, Ms.. Lucero. We have three speakers signed up. I'd like to call on the first one. Mr. BABCOCK.'",
        "'speaker_5': 'Thank you very much. Madam President, members of Council, good evening and happy New Year. My name is Bob Gorelick. My address is 609 South Gaillard Street in Denver here this evening in support of Council Bill 757, representing fourth City Stapleton, the applicant and the property owner.'",
        "'speaker_5': 'When you first take a look at the zoning and you think we're coming from an m master plan district, our residential mixed use five stories two an m Master plan district mix mixed use five stories. You think, why are we doing this?'",
        "'speaker_5': 'Why is it really worth going through this entire effort? And the reason is quite simple. We've gone through two general development plans on the site over the last six years. This has always been a commercial corner. It's across the street from the largest.'",
        "'speaker_5': 'Commercial center we have in that part of town, Northfield. We're right across the street from Macy's. Some of our users that are looking at this corner are for convenience stores with filling stations. The difference in the bricks versus the zoning is not in use.'",
        "'speaker_5': 'They both allow the convenience store, but only the Amex allows the building form for a drive thru and with a filling station we have to have a drive thru. So that's the purpose of this entire rezoning. We need a filling station.'",
        "'speaker_5': 'There are none in this part of town. For our future residents, they have to drive all the way out to Quebec Street. And for people living south of this area, they have to go to Quebec Street to fill up their car.'",
        "'speaker_5': 'So we'll get this on board. And then in another month and a half to two months, you're going to be considering a rezoning for almost 800 residential units. That'll come on after this commercial corners develop. So that's the intent and that's the purpose of this rezoning.'",
        "'speaker_5': 'If I can answer any questions, let me know.'",
        "'speaker_3': 'Thank you, Mr. Garlic. Jeffrey Washington. If it were.'",
        "'speaker_5': 'Just the. Jeffrey Washington. I live in Denver. I, I didn't know every detail before I signed my car to speaking against this. And basically my reason for wanting to speak out against this was because I seen that they would change the residential use to commercial use.'",
        "'speaker_5': 'And being with the rise in housing costs we have now, I don't think is wise to change residential uses to commercial uses. But after I spoke to Mr. Goldie, door recessed. I can see how this makes sense to go ahead and approve this.'",
        "'speaker_5': 'But I just want to keep in council's mind that housing is short and Denver and you know, we just need to be mindful of that when we're doing these zoning changes. We need more housing and the way to do that is just to build more housing to bring the overall market rate of housing down in Denver.'",
        "'speaker_5': 'But again, after I spoke to Mr. Gold, look, I can see why this makes sense and the need for gas stations, though.'",
        "'speaker_3': 'Thank you, Mr. Washington Sekou.'",
        "'speaker_7': 'When I was Chairman Saker representing the Black Star Action Movement for Self Defense Advocacy Group for poor, working, poor and homeless people. Initially I had talked to Mr. Gillick and listening to the staff report. Initially I was for this thing, but as I was sitting there, there was a pain of conscience that says There's something wrong with'",
        "'speaker_7': 'this thing. See because. In that Northfield area where the shovels is going to go up and where this gas station or whatever that's going to be proposed because not really locked down is what's going to go up there.'",
        "'speaker_7': 'But when you open up the eyes and the window for this rezoning thing, it's pretty much whatever we decide happen can happen. And so in the process of building that north built, when you look at the commercial properties up in there, there is not.'",
        "'speaker_5': 'One black outlet, not one.'",
        "'speaker_7': 'And here we go with the 7-Eleven.'",
        "'speaker_9': 'And we know that's not no black ownership of that.'",
        "'speaker_7': 'So what are we really talking about here when we open up here? All right. Because now it becomes very sly, slick and wicked because it's a continuation of the ethnic cleansing of that area.'",
        "'speaker_5': 'And it's why only.'",
        "'speaker_0': 'Is good enough for us to shop there, but it's not good enough for us to live there.'",
        "'speaker_7': 'And so you have a responsibility here, regardless of your good intentions, to start building housing for local.'",
        "'speaker_5': 'People who can afford that to live there so they can shop there. And until we get that, what are we going to go on and make this a priority for the rich and nothing for the poor? And so I'm calling on the people who are allies of the poor I'm talking to.'",
        "'speaker_5': 'I'm talking.'",
        "'speaker_7': 'Susan. I'm talking to my friend Debra. And really, I really need your help on real deep calcium clinics. We got to step up the pressure and we got to use these zoning issues to put poor people on the agenda and speak to these developers about what is expected of the city.'",
        "'speaker_7': 'Otherwise, it's going to end up quite only are you going to push out the pool and are you going to increase the police budget to arrest.'",
        "'speaker_5': 'And make them move and make them feel uncomfortable here? And I don't see that commitment. I need the same urgency that you put on marijuana laws to apply to poor people. And it needs to be done now, because I'm telling you, there is a rumbling unmet need and the people who have nothing to lose are not satisfied'",
        "'speaker_5': '. And we're not satisfied with the leadership that will be presented here.'",
        "'speaker_7': 'Because.'",
        "'speaker_3': 'Mr. Speaker.'",
        "'speaker_5': 'I think.'",
        "'speaker_3': 'Your time is up.'",
        "'speaker_0': 'Speaking on our.'",
        "'speaker_3': 'Behalf, Mr. Speaker, for your time. Thank you. Okay. That concludes our speakers questions from members of council. Councilman Ortega.'",
        "'speaker_8': 'I'm not sure who is the appropriate person to answer this question, but I'd like to know how many acres are available for redevelopment out at Stapleton that has not already seen a GDP done on it.'",
        "'speaker_4': 'To. Our number crunchers.'",
        "'speaker_6': 'I'm sorry.'",
        "'speaker_3': 'Some of that.'",
        "'speaker_5': 'But.'",
        "'speaker_6': 'It's all got GDP except the area north of 56th Avenue, which is about a quarter of a section. You know, it's actually let me get down to the next. Well, I hit that slice.'",
        "'speaker_8': 'Any idea roughly how many acres we're talking about in that area?'",
        "'speaker_6': '225. Okay, hide this slide. I'll show you.'",
        "'speaker_8': 'So one of the things that I think might be important here is to ask I don't know if it's for city or who, but I understand the Stapleton Redevelopment Corporation is disbanding and maybe have an update be brought to committee in terms of what's the you know, what's the role of the community and how these go through'",
        "'speaker_8': 'the community process? I don't know. Councilman Herndon, you might have some insights that you can share with us on this.'",
        "'speaker_5': 'Thank you, Councilman Ortega. Actually, I was going to leave this for the comment section, but I was going to invite my colleagues to come to LUDI next Tuesday. The 14th for City will actually be doing a presentation on the redevelopment of Stapleton and answer any colleagues questions they have about that.'",
        "'speaker_5': 'So this was very timely and I was going to announce that during the comment section.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_3': 'Councilwoman Shephard.'",
        "'speaker_2': 'Mr. Gorelick. I just wanted to clarify something, because I'm not sure if I understand correctly. Did you say that you under the current zoning, you can build a filling station, but that it wouldn't be a drive through?'",
        "'speaker_5': 'You know, it's true. It's kind of an interesting aspect of the zoning code. We can do a convenience store with a filling station under the current zoning, but all uses in the arcs have to be enclosed. So yeah, we could do a filling station, but it has to be enclosed.'",
        "'speaker_5': 'It's a break in the zoning code so we can.'",
        "'speaker_2': 'I don't know if that doesn't even make sense to me. So could you.'",
        "'speaker_3': 'Explain that a little bit?'",
        "'speaker_2': 'Because how else would you get into the filling station?'",
        "'speaker_6': 'Well, that's why we're rezoning the property. There is a land use limitation. I don't know why I'm losing my voice, but there is a land use limitation in the oryx that requires enclosure of a drive thru uses.'",
        "'speaker_1': 'Like the enclosure for enclosure.'",
        "'speaker_2': 'That's crazy. Was this something that was not caught during the zoning code revision?'",
        "'speaker_6': 'I think this was something that was deliberately written into the zoning code so that these types of uses would go into mixed use commercial rather than residential mixed use areas.'",
        "'speaker_2': 'I see. That was a way.'",
        "'speaker_6': 'Of my understanding of it, my interpretation.'",
        "'speaker_2': 'Okay. Very interesting. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Robb.'",
        "'speaker_2': 'Thank you, Madam President. Yeah, I was going to get at the same thing. And it's it's sort of appropriate to follow Councilwoman Shepherd, because that was a good question. Mr. Garlic, I was just going to ask you, the way it was said, made it sound like we didn't conceive of the zone districts very well.'",
        "'speaker_2': 'But really what I interpret you're saying is we didn't map this corner correctly to allow that.'",
        "'speaker_5': 'That's correct. The zoning just adjacent to this to the west is m m x and this site probably should have been m m x as opposed to our. It was never the intent to have this as a residential corner.'",
        "'speaker_5': 'It's across from Northfield. So no, you're correct. It should have been mapped initially.'",
        "'speaker_2': 'And then I had another question, since we're changing this from the remarks, and yet you said, which is really a come in zoning, that you're going to come back here and rezone for 800 residential. Did we also mis map an area and make it mixed and not residential or.'",
        "'speaker_5': 'No, no. This is the zoning we'll be bringing in in the next 6 to 8 weeks is referred to as filing 45. It's in response to our newest general development plan, our new GDP. It's difficult to anticipate what all these uses are going to be years out.'",
        "'speaker_5': 'When we did the initial GDP, so now we've revised it and we need to bring our zoning into compliance with the general development plan. So that's the next one you'll see. If I said 800 units, it's 789.'",
        "'speaker_2': 'Okay. I'm glad you're precise there. If I could just come quickly. Council President In addition to having the Stapleton plan there, obviously given our omnibus zoning amendment, that's sort of coming through at the same time, we're going to plan some time to discuss GDP sort of in a work session at.'",
        "'speaker_3': 'Ludy as well. Okay. Thank you, Councilwoman Robb. That's good information. I don't see any other questions. So I am going to close a public hearing for Council Bill 757 and ask for comments by members of Council. Councilman Herndon.'",
        "'speaker_5': 'Thank you, Madam President, and I certainly would hope I can get my colleagues supporting this endeavor. It is amazing to think that DIA is almost 20 years old, as they will be next year, and to think we have not.'",
        "'speaker_5': 'Had an airport in Stapleton for that long. The redevelopment of Stapleton is over halfway complete. The tiff ends in 2025. And it is just remarkable to think that so much has been accomplished that I thought it was wise to have four city come in and brief council on what has happened there.'",
        "'speaker_5': 'I certainly want to encourage my colleagues to come and ask a lot of questions and come out for a drive to it is amazing. I think what we have done with a former airport and this is a this is certainly known worldwide for city has been approached by several entities that want to know exactly how they have'",
        "'speaker_5': 'done this and made this a success. Certainly have been road bumps along the way, but I definitely think overall they have they have done good work and there's still more good work to be done. I would also like to encourage people that spoke tonight, if you're unfamiliar with Cleats, which is a bar in Northfield, Stapleton, owned by'",
        "'speaker_5': 'Lauren Belt, an African-American couple, as well as Tipsy Cupcakes, another minority owned business in Northfield, Stapleton. That's just the two of the few that I'm aware of. So wanted to make sure that people were aware where we have great large chains such as Macy's and Northfield, but we also have local minority owned business there as well.'",
        "'speaker_5': 'Thank you, Madam President.'",
        "'speaker_3': 'Thank you, Councilman Herndon. And seeing no other comments, I think we're ready for roll call.'",
        "'speaker_2': 'Herndon I can eat lemon. Lopez All right. Montero Nevitt, I. Ortega, I. Rob Shepherd. Brooks High ground fights. Hi, Senate President.'",
        "'speaker_3': 'I am Councilwoman Ortega. Get your vote out there. Thank you very much, Madam Secretary. We close the voting and not the results.'",
        "'speaker_2': '12 Eyes.'",
        "'speaker_3': '12 Eyes Counts Bill 757 passes. I have a couple of announcements. On Monday, January 13th, Council will hold a required public hearing on Council Bill 975, which renews for ten years a contract with Comcast for a non-exclusive cable television franchise agreement.'",
        "'speaker_3': 'And we will have the one hour courtesy public hearing on the same night regarding the 64 subpoena station area plan in Councilman Herndon's district. And seeing no other business before this body. This meeting is adjourned.'",
        "'speaker_9': 'Your first quarter.'",
        "'speaker_1': 'Denver 82.'",
        "'speaker_5': 'New.'",
        "'speaker_2': 'York City. Your source? Denver eight is about your city.'",
        "'speaker_3': 'Tell us what you think.'",
        "'speaker_1': 'I enjoy watching your programs because they explain everything thoroughly. The show really keeps me.'",
        "'speaker_9': 'Current with the city government.'",
        "'speaker_6': 'I think the Denver News showed.'",
        "'speaker_9': 'That you have each weekend.'",
        "'speaker_0': 'As an informative and concise time.'",
        "'speaker_5': 'To.'",
        "'speaker_1': 'Talk back to your television. Call or email us for your direct connection to Denver TV.'"
    ]
}