{
    "A proclamation in support of the Ukrainian people and condemning the Russian invasion of Ukraine.": [
        "'speaker_0': 'Wonderful. Thank you so much. And thank you, Councilmember Sandoval, for bringing attention to this really important topic. And I'm glad we're closing out March, making sure that we're showing our support and advocacy. Thank you. Next up, we have Councilmember Flynn.'",
        "'speaker_0': 'Would you please read Proclamation 20 to Dash 338 for us?'",
        "'speaker_5': 'Yes. Thank you, Madam President. The proclamation number 22, dash 0338. In support of the Ukrainian people and condemning the Russian war on Ukraine. Whereas Ukraine declared its independence from the Soviet Union on August 24, 1991 and was recognized by the United States as a sovereign nation on December 25, 1991.'",
        "'speaker_5': 'And. Whereas, in 2014, the Russian Federation invaded and annexing Crimea and invaded part of Donbas areas of sovereign Ukraine. And. WHEREAS, the United Nations General Assembly formally recognizes the territorial integrity of Ukraine, including Crimea, Luhansk and Donetsk. And.'",
        "'speaker_5': 'WHEREAS, under orders from Vladimir Putin. Russia began amassing troops and military equipment near Ukraine's borders in 2021. And on February 24, 2022, Russia launched a full scale war on Ukraine, resulting in widespread civilian suffering. And loss of life.'",
        "'speaker_5': 'And. WHEREAS, the General Assembly of the United Nations on February 28 condemned the Russian aggression against Ukraine by a vote of 141 to 5, with 35 nations abstaining. And. Whereas, Russia continues to attack Ukraine, committing war crimes through targeting of civilians, creating a humanitarian crisis by forcing 10 million Ukrainians to leave their homes.'",
        "'speaker_5': 'And. WHEREAS, the Russian government is engaged in large scale media censorship. And a propaganda campaign campaign to obfuscate the invasion of Ukraine and the subsequent Russian battlefield losses. And whereas, Russia continues to attack civilian targets, including including daycare centers, facilities, prisons, hospitals, apartment buildings and a shopping center.'",
        "'speaker_5': 'And. WHEREAS, more than 100,000 people remain at risk in the besieged city of Mariupol, where food and water remain scarce. And. WHEREAS, Russian troops have abducted and killed international journalists in violation of the Geneva Convention. And. Whereas, municipal mayors and city leaders are being targeted and kidnaped by Russian troops, further terrorizing communities, interfering with basic services and'",
        "'speaker_5': 'undermining democracy and even the most basic local levels. And. Whereas, Russia has attacked civilian protesters in Kherson and zappers gear. And. Whereas, according to the United Nations, 1104 civilians have been killed with another 1754 injured as of this past weekend.'",
        "'speaker_5': 'And more than 4 million Ukrainians have been forced to flee as refugees to other countries. Now, therefore, be it proclaimed by the Council of the City and County of Denver. Section one. The Denver City Council supports the independence of the Ukrainian people and the sovereignty and territorial integrity of Ukraine.'",
        "'speaker_5': 'Section two. The Denver City Council condemns the unilateral invasion of the sovereign state of Ukraine by Russia at the direction of Vladimir Putin. Section three. The Denver City Council recognizes the plight of Ukrainian refugees and supports the United Nations High Commissioner for Refugees.'",
        "'speaker_5': 'Refugee relief organizations and all countries welcoming the influx of refugees. Section four that the Clerk of the city and County of Denver shall attest and affixed to seal of the city and county of Denver to this proclamation and transmitted to Oksana makarova.'",
        "'speaker_5': 'Ukraine's Ambassador to the United States. Ukrainian National Women's League of America. Branch number 38 in Denver. And Martina. Marina Dubravka of the Ukrainians of Colorado.'",
        "'speaker_0': 'Thank you. Councilmember Flynn, your motion to adopt this evening.'",
        "'speaker_5': 'I move the proclamation 20 2-0338 be adopted.'",
        "'speaker_0': 'Thank you. We've got it moved and seconded comments by members of council. Councilmember Flynn.'",
        "'speaker_5': 'Thank you, Madam President. In times like this. When the attention of the world and the anxiety of people all over the world is focused on the humanitarian crisis in Eastern Europe caused by a war of choice. It prompts us all.'",
        "'speaker_5': 'Or it should. To reflect on our interconnectedness. With everyone in the world. We come from all over the world. My wife, Harriet, is a second generation American. Her mom's parents were born and her mom's grandparents were born in Finland, but her dad's parents both were born her her dad, grandpa, her grandparents I'm sorry, her dad's parents both'",
        "'speaker_5': 'were born in what was at the time around the turn of the century, the late 1800s was the Principality of Galicia. Which is now part of it is in western Ukraine. And part of it is in eastern Poland.'",
        "'speaker_5': 'It is exactly ground zero. Where much of this fighting is taking place. And she is said to be several times. Watching the news over the last month. That is, without doubt, some of her relatives. Our refugees right now.'",
        "'speaker_5': 'Some of her blood relations. Some may have been killed. Peace. According to the great Irish playwright George Bernard Shaw, peace is not only better than war. But infinitely more arduous. We are all at a distance here, at least at a loss.'",
        "'speaker_5': 'As to what we can do. In this crisis. Abraham Lincoln once predicted in a famous speech. That quote, the world will little note nor long remember what we say here. He was famously wrong, of course, when he said that at Gettysburg during another war.'",
        "'speaker_5': 'But I am certain that he is correct when he says that about what we're saying here this evening. I am fairly certain that President Putin of Russia will never even hear of the words that we are voting on tonight.'",
        "'speaker_5': 'I have no illusion about that. However, it was back in the early sixties that MIT mathematician Edward Lorenz developed the chaos theory, popularly known as the Butterfly Effect, which says that even the gentlest fluttering of a butterfly swings in China.'",
        "'speaker_5': 'Could eventually contribute to a convergence of events that result in a tornado in the Midwest of the United States. So with that in mind, I ask the 13 butterflies up here to flutter our wings. And express outrage. And what is happening in Ukraine.'",
        "'speaker_5': 'And to urge others to join in and do what they can in the cause of peace. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Flynn, Councilmember Black.'",
        "'speaker_6': 'Thank you, Councilman Flynn, for writing that proclamation and for your really beautiful remarks that you just read. It does matter that we're all here standing up with Ukraine. I agree with you about the butterfly effect. People all over our country want to stand in solidarity with Ukraine and it does matter.'",
        "'speaker_6': 'President Zelensky last week gave a speech and he implored people across the world to stand against this war coming in, come in the name of peace, come with Ukrainian symbols to support Ukraine, to support freedom, to support life.'",
        "'speaker_6': 'Come to your squares, to your streets. Make yourselves visible. And her heard. The world must stop this war. So on Sunday, most councilmen join me in hosting a Ukrainian solidarity event at Baby R Park. A special thank you to council members Gilmore, Ortega, Cashman, Flynn and Clark for joining us there.'",
        "'speaker_6': 'We had Ukrainians in Colorado there and a number of other organizations. It was a very, very special event filled with prayer and solidarity. And it was held at Baby R Park, which is in my district. It is a very special park.'",
        "'speaker_6': 'It's a memorial of the Nazi massacre of 200,000 Jews and Ukrainians who were murdered at the Babi Yar Ravine in Kiev, Ukraine, during World War Two. The park honors the victims of that massacre, but it also sends a message to all of us that we cannot stand by and remain silent and allow these crimes against humanity to'",
        "'speaker_6': 'happen, these crimes against our Ukrainian brothers and sisters. So that is why we are here with our butterfly wings, hoping that, you know, that we stand with you. And if there's anything we can do, we will. And we do have our Ukrainians of Colorado representatives here today, and they do have weekly events and fundraising opportunities and volunteering'",
        "'speaker_6': 'opportunities. And I'm going to ask all council members to share those on their social media networks so we can get more support for them. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Black, Councilmember Hines.'",
        "'speaker_1': 'Thank you. Council President. I recognize Councilmember Flynn's point about how President Putin might not care about what we do. It is important for us to make a statement. And and I think it is important for my constituents to feel very strongly about this, rightfully so.'",
        "'speaker_1': 'So while he may not know of our proclamation, I believe, as the butterfly effect, I also believe it is important for us to be intentional in our values. And I see that we're doing that today. I also want to point out that the United Nations 141 of the United Nations member states, 141 countries, voted to denounce Russia'",
        "'speaker_1': 'for its invasion. And there has not been that much unity in the United Nations over something that might theoretically be controversial in quite some time. I also want to mention that the governor Polis has has said that Colorado will welcome the Ukrainian refugees, and I certainly think that Denver will do its part as well.'",
        "'speaker_1': 'So I want to thank the governor for for that statement and his continued statements denouncing Russia and supporting Ukraine. And. Thank you. Council president.'",
        "'speaker_0': 'Thank you. Councilmember Hines and I want to thank Councilmember Flynn for bringing this proclamation forward, to think of allowing us to weigh in and add some items to it. And then Councilmember Black for your organization and wonderful hosting on Sunday of a very solemn and important event for us to never forget what has happened previously and then'",
        "'speaker_0': 'recognize what is happening and how history is repeating itself, unfortunately, in different ways. And so thank you for all of your work on that and happy to support it this evening. Madam Secretary, roll call can each.'",
        "'speaker_2': 'I. Sawyer. I. Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon High Cashman. Ortega, I. Sandoval.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Torres I. Work. I. CdeBaca. I. Clerk.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 Eyes Proclamation 20 2-3 38 has been adopted. Council Member Flynn We have 5 minutes for the proclamation. Acceptance of you. Go ahead and introduce the folks that will accept it this evening.'",
        "'speaker_5': 'Thank you, Madam President. We have here in the chamber tonight Marina Dubravka of the Ukrainians of Colorado. And she is and I invite her to bring up I think I see Mark Dillon back there and come up to the microphone and you have 5 minutes for remarks.'",
        "'speaker_7': 'It's so nice to see familiar faces. I would like to start with. Great gratitude to Congresswoman Sandra Bullock and Congressman Kevin Flynn to for inviting us here. And. Making this this proclamation. That's. It's very it's very emotional. And I know that.'",
        "'speaker_7': 'Putin may not hear this proclamation, but butterfly effect will go through the Internet waves, and I'm pretty sure it will reach him at some point. If not, then Ukrainian soldiers will remind him every time, every day, every second, what the freedom means and democracy and fighting for that.'",
        "'speaker_7': 'That in the 21st century, on the middle of the Europe, civilized nations are facing right now huge wave of refugees from Ukraine and. The genocide. In the middle of the Europe in Mariupol on. Donbass area. Kiev area. Just you name it.'",
        "'speaker_7': 'It's endless. And that is. The most heartbreaking. The pain inside. Does not go away. Does not go away. And that's been. Over a month. Oh. So every one of us. Dealt with. Saving our families there and. France unique?'",
        "'speaker_7': 'Sure. Johanna. She's our president of. National. American League of Ukrainian Women. Yes, she actually her relative was in Mariupol and he was able to escape. I would like, you know, to share that experience. Hi. Yeah, I'm I'm actually the president of the Ukrainian National Women's League here in Denver.'",
        "'speaker_7': 'And my relative in Mariupol was a distant cousin, like a third cousin, but he happened to be a priest, a parish priest in Mariupol. So he stayed even when there were opportunities to leave because he felt committed to his congregation.'",
        "'speaker_7': 'But ah, he also had his two of his children with him and somehow, ultimately, after 12 days of being locked up with no water, electricity or food, they somehow managed to get out through one of the green corridors.'",
        "'speaker_7': 'And I honestly don't know if he's actually made it to Western Ukraine, where he is originally from. But I also do want to thank everyone for passing this proclamation. And I appreciate your energy and time that you put into this.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Madam President of the Council and members of the Council, I can really add to what a council man, a Flynn and council member, Black Ops said, as well as my colleagues, that we would prefer not to be standing here today.'",
        "'speaker_1': 'We would prefer to. Be leading much more ordinary lives. We would prefer that there was no need for a proclamation of this nature. We would prefer that there not have been 10 million displaced people in the center of Europe.'",
        "'speaker_1': 'We would prefer that. 4 million refugees had not had to cross into other countries for safety, including 2 million children. We would prefer all these things, but that was not our choice. Things were done. Things were done to people.'",
        "'speaker_1': 'People we have a connection to. We. Power with the deepest respect to this Council for taking the action and expressing the sentiments that I think stand not only for the people here assembled, but for many, many Denver rights, many Coloradans.'",
        "'speaker_1': 'About 20,000 are of Ukrainian heritage. Many, many more have traveled to Ukraine, have relatives in Ukraine. Have taught work that in Ukraine. It is a country. Not that much larger than Colorado, about the size of Texas. It is a country that has cherished democracy for 30 years and now has to defend it.'",
        "'speaker_1': 'If we stand with them, we are confident that they will be able to do so. Thank you.'",
        "'speaker_0': 'Thank you very much. And we appreciate you being here. And please know that we do understand that fragile democracy and that that's why it's so important that we uphold democracies throughout the world and support and that our love and support and prayers.'",
        "'speaker_0': 'But beyond that, the philanthropic and the donations of medical equipment, money that can go to help. And so, as Councilmember Black had alluded to, we'll make sure that each one of our council offices share that information out so that we make sure and maximize getting that help and support.'",
        "'speaker_0': 'And so please know that we're with you. We're in solidarity with you. And thank you for being here this evening.'"
    ],
    "A resolution approving a proposed Third Amendatory Agreement between the City and County of Denver and Integral Recoveries, Inc. to amend provisions, extend the term, and to expand the scope of collections.\nAmends a contract with Integral Recoveries, Inc. to add two years for a new end date of 2-1-2024 and expands the scope of collections to include cases owing less than $300.00. No change to contract amount (COURT-202261912). The last regularly scheduled Council meeting within the 30-day review period is on 4-18-22. The Committee approved filing this item at its meeting on 3-15-22. Pursuant to Council Rule 3.7, Councilmember Torres called this item out at the 3-29-22 meeting for a one-week postponement to 4-4-22.": [
        "'speaker_0': 'Thank you. Now I'll do a recap under resolutions. Councilmember Torres has called out Resolution 278 for a vote under bills for introduction. No items have been called out under bills for final consideration. No items have been called out under pending.'",
        "'speaker_0': 'No items have been called out. Madam Secretary, please put the first item up on our screens for us. Thank you. Council Member State Abarca, will you please put resolution 278 on the floor for adoption?'",
        "'speaker_2': 'Yes, I move that resolution 20 2-0278 be adopted.'",
        "'speaker_0': 'Thank you. It has been moved and seconded questions or comments by members of Council Councilmember Torres.'",
        "'speaker_2': 'Thank you, Madam President. I call this out with a bunch of questions. In reading the contract amendment language and I did, we have somebody from Denver County Court. Great. Couple of questions for you.'",
        "'speaker_0': 'And we'll ask you when you come up. Please make sure and speak into the mic and introduce yourself for the public record.'",
        "'speaker_4': 'Thank you. Kristin Wood, I'm the court administrator for Denver County Court.'",
        "'speaker_2': 'I thank you for being here. So I didn't get a chance to fight this when it was coming through finger. And if what I'm understanding is correct, correct me if I'm wrong. This is putting into place a collections system for fees or fines under $300 in Denver County Court.'",
        "'speaker_4': 'Correct. We've had a collection systems in place for several years since I believe 2011. During the budget cuts, the budget shortfalls, we re-engineered our collections process entirely. And we have been collecting on amounts that have been owed that are delinquent to the city and county of Denver.'",
        "'speaker_4': 'Over that $300, it was going to take extensive programing hours to program a collections capability where we interface with that provider for under $300. So this amendment is requesting that expansion to that amount that's under $300.'",
        "'speaker_2': 'And was the amount over 300. What was in the collection fee matrix, 30% of the referred amount. That's the the the fee for the service.'",
        "'speaker_4': 'For the under 300.'",
        "'speaker_2': 'Now over what we currently provide.'",
        "'speaker_4': 'Currently. Let me pull up the contract. It's a structured amount. It's a flat rate amount for those that are under that. That $100 amount for those that are over 25%, that goes to Integral, which is the company that provides the collections process.'",
        "'speaker_4': '5% is reverted back to the city and county of Denver. So it's a 30% total amount.'",
        "'speaker_7': 'Okay.'",
        "'speaker_2': 'So why was the decision made to start to capture this piece?'",
        "'speaker_4': 'With the $300 to under $300, the under $300 represents approximately 90% of the fees that are owed to the city and county of Denver by way of costs and finds that are assessed as a result of either a traffic infraction or a criminal or municipal sentence.'",
        "'speaker_4': 'And so, generally speaking, 90% of those of those costs, the balance remaining that are referred, are approximately 90%.'",
        "'speaker_2': 'And what happens now to those if they're not referred to a collection, we.'",
        "'speaker_4': 'Have collections investigators that work with individuals and they establish a payment plan, and that is an ongoing process. As long as those individuals remain in compliance, we continue to work with them in that payment plan when it's 90 days or more delinquent, and we cannot continue to work with that individual or their refusing to work with us'",
        "'speaker_4': ', we will work for them. Out to collections.'",
        "'speaker_2': 'What percentage go beyond 90 days?'",
        "'speaker_4': 'I can get that information for you with respect to the amount that is over, that $300, the number I can give you the amount that has been referred for 20 for the entire year of 2021, that is over that 300 amount.'",
        "'speaker_4': 'We've referred $2.7 million to collections. The amount that this entity has collected for us is $2.3 million.'",
        "'speaker_2': 'And for for those who owe less than 300, is there an average of what is owed or is it is it run that spectrum?'",
        "'speaker_4': 'I think it runs the spectrum. I'm happy to provide that information. We would run a script to get you that information from our database.'",
        "'speaker_2': 'Okay. I have a lot of questions to give you an opportunity to respond to those rather than a vote tonight. I'd actually like to postpone this to next week, and I can send you the the questions that that I've got and then bring this back through next week for for discussion, if.'",
        "'speaker_4': 'That's not a problem.'",
        "'speaker_2': 'That's all right. Okay. The the the final question that I have is, was any equity study or assessment done to see if this would be a disproportionate impact to low income residents? No.'",
        "'speaker_4': 'There wasn't. We can certainly factor in some information with respect to the individuals that are owing that are referred to collections. And I can provide some demographic information for you if you'd like to send me those parameters on what you're looking for.'",
        "'speaker_4': 'We're happy to include that in the query.'",
        "'speaker_2': 'Okay. Thank you. You're welcome. Council President. I can't remember if there's something formal for me to do.'",
        "'speaker_0': 'Yeah. I'm going to thank you, Kristen, for being here. And thank you, counsel pro Tem Torres, for the questions. And. Madam Secretary, do you want us to do anything additional? I know since we invoke 3.7, it can just be held over.'",
        "'speaker_0': 'But we have a motion on the floor.'",
        "'speaker_2': 'Yes. If we can just have Councilmember CdeBaca withdraw the motion, we can go ahead and let Councilmember Torres invoke Council Roll 3.7 and postpone that for one week. Okay. I move to withdraw resolution 22, dash 0278.'",
        "'speaker_0': 'All right. Thank you, Councilmember CdeBaca. We're good, Madam Secretary. All right. Wonderful. We'll see you back here next week. After Council Pro-Tem Torres's questions are answered. Councilmember Hines, I've got you in the queue, and you might have additional questions for our representative, so go ahead, please.'",
        "'speaker_1': 'Thank you, council president. And thank you, Council Pro-Tem Torres for your calling this out. Would the court please in responding, will you respond to the full body? I'm I'm interested in the answers to the questions as well. Thank you.'",
        "'speaker_0': 'Thank you. Very good. All right. Thank you. Will that make sure and request the court send that information over to the entire council once they've gathered it? All right. We have no further action on to 78. It will be back on the agenda next week.'",
        "'speaker_0': 'That concludes the items to be called out this evening. All the calls for introduction are ordered published. Council members, please remember this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote.'"
    ],
    "A bill for an ordinance amending Article II of Chapter 15 of the Revised Municipal Code for purposes of approving a new redistricting plan for the eleven council districts of the City and County of Denver for the municipal election on April 4, 2023, and for any general or special council election held thereafter. Describes the district boundaries depicted on Map D. The Committee approved filing this item at its meeting on 3-14-22.": [
        "'speaker_0': 'Good evening. Tonight we have one public hearing for those who are participating in person when called upon. Please come to the podium. On the presentation monitor, you will see your time counting down for those who are participating virtually when called upon.'",
        "'speaker_0': 'Please wait until our meeting. Host Promote you to speaker. When you are promoted your screen will ask permission to allow us to promote you. Please accept the promotion. When you accept the promotion. Your screen will flash and say, Reconnecting to meeting.'",
        "'speaker_0': 'Please don't leave the meeting. You will be connected and will need to turn on your camera if you have one. And your microphone. You will see your time counting down at the bottom of your screen. Once you finish speaking, you will change back to participant mode and see your screen flash one more time.'",
        "'speaker_0': 'All speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so. Their Home Address. If you've signed up to answer questions only, please state your name and note that you are available for questions of counsel.'",
        "'speaker_0': 'Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. Speakers must stay on the topic of the hearing. Must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Council members say to Barker, Will you please put Council Bill 20 to dash to 99 on the floor for final passage?'",
        "'speaker_2': 'I move that council bill 22 dash to 99 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 2-2 99 is open and we have Council Member Sandoval who chaired the working group. She'll do the presentation this evening.'",
        "'speaker_3': 'Thank you, Madam President and colleagues. I just wanted to give a presentation for the public hearing before we hear from the community. I had the honor and privilege of chairing this process, and I had two amazing colleagues helping me along the way.'",
        "'speaker_3': 'I would like to acknowledge Councilman Herndon and Councilwoman Black for your dedication and all the time that you put into this process. And I'd also like to thank Emily Lapel from our central staff. So next slide, please. So this slide is really tiny because we ended up doing a lot in a very short amount of time.'",
        "'speaker_3': 'The first thing that happened was in March of 21, the council president assigned the Redistricting Working Group, which was made up of myself, Councilman Herndon and Councilwoman Black. We started working and figuring out the process. We met with Dr. Theobald from UCC US, who is a redistricting specialist.'",
        "'speaker_3': 'She gave us guidance and helped us along the way. We came up with the idea for a meeting in a box and community engagement strategies and data collection. We created a media plan website and outreach tools. We recruited staff.'",
        "'speaker_3': 'We had two interns along the way to help us analyze all of the information that we got in July of 21 City Council. We elected new leadership, and at that time, I officially became the chair of the Redistricting Working Group.'",
        "'speaker_3': 'We went to think of to give an update. We started our community outreach process, which is define your Denver and what define your Denver meant for residents was we asked them what they thought their communities of interest were.'",
        "'speaker_3': 'Once and then in August, the clerk referred a ballot measure to change the ballot reform, which ultimately changed our election. We purchased the map dated software and part of the aptitude software that was so important it was able to give a direct translation.'",
        "'speaker_3': 'It was not Google translation. It was actually translated into your native language, the entire website, which was very important for us as the small working group. It also had, for the first time ever, a public portal so that the public part could participate in map drawing.'",
        "'speaker_3': 'Last time, ten years ago, we had two licenses. We had one and both of them were here on the fourth floor. So if you wanted to create a map, you had to figure out and come down to the fourth floor of the city and county building and use our software.'",
        "'speaker_3': 'And so with the purchase of map data, we were able to have a public facing portal. We started working on the resolution and principles of procedure. And at that time, I met with each council office to gain your feedback on what your council district, what you thought of your council district, things that were challenges, things that were'",
        "'speaker_3': 'benefits and burdens. We filed our resolution for principles and procedures, and then finally we received a data received data from the Census Bureau in September. And normally, this data usually comes out in the spring. And once again, this data did not come out until September.'",
        "'speaker_3': 'In October, we adopted our rules and procedures, the year resolution. We had internal meetings with GIS to go over our map to to our represent a bill where we talked about our communities of interest. We worked with CSU students on the maps of the communities of interest.'",
        "'speaker_3': 'We were able to train city council and staff on our redistricting software. We completed our defined year Denver process, which was communities of interest and opened up the map attitude. So we had a demo on our website. Then in the December of 21 this are clear can read Carter did repressing Diem and came up with their new'",
        "'speaker_3': 'precincts, which are the base of all of our work that we have to do for City Council in January through the end of January, from January 1st through the end of February into January. The public was able to submit and draw their own maps.'",
        "'speaker_3': 'And then from February, City Council submitted their maps that we debated all in February. We had public meetings. We had public vetting of the proposed maps. We had many debates. In March, the committee we approved to to move forward.'",
        "'speaker_3': 'And on first reading, we have the map here in front of us. And today, the day after Cesar Chavez Day, we are here for a public hearing to adopt our final map. Next slide, please. We had some unique challenges this time around when it came to redistricting.'",
        "'speaker_3': 'We had a COVID 19 pandemic. We had the surge of Akron. We had, for the first time ever in Colorado history, we had a state independent redistricting commission. We had delayed census information. And we had a ballot initiative in November of last year which changed our municipal elections from May to April.'",
        "'speaker_3': 'Next slide, please. Although we had a lot of challenges in 2021, we were able to do a lot of work. We hosted a mapping drive. We received 154 maps. We hired a facilitator for the first time in Denver history.'",
        "'speaker_3': 'We had a facilitator working on providing input for the public meetings and round the public meetings. We created outreach materials for each council office to work with. We worked with the Office of Social Equity and Innovation. We had two weeks of training for City Council, and we also provided training for the first time ever on magnitude software'",
        "'speaker_3': 'for the public. Next slide, please. Some of the highlights from 2021 were the resolution where we increased the number of public hearings. We required language, language access. We incorporated language surrounding communities of interest, which had never happened before.'",
        "'speaker_3': 'We were able to have the aptitude redistricting training. We were able to have represented Borg, which is the anti gerrymandering software, which was the base for a lot of our maps. We received 154 maps and it was the first municipality in the country to use represent Apple in official capacity at this level.'",
        "'speaker_3': 'Thanks to Dr. Theobald and her suggestion on using that software, we created a social media meeting, media and a meeting in a box which was translated into two different languages for councils to use. Next slide, please. The redistricting timeline for this year, which is only three months.'",
        "'speaker_3': 'We had the public create maps. City Council created their maps. We vetted those maps with a facilitator. We had guys created Dashboard with equity data layers for the first time ever in redistricting history in Denver. We had two virtual meetings, four in person, so a total of six meetings, which was more than the last time ten years'",
        "'speaker_3': 'ago. We received weekly updates from our facilitator about the meetings or the public meetings that were held. That never happened before in the history of redistricting. We deliberated on our maps and ultimately we are here today. One last thing we will do in April is central staff will work with our communications person in Central to come up'",
        "'speaker_3': 'with a final report which will go into the city archives. When we started digging into this ten years ago. When Emily and I took on this adventure in 2020, in the midst of a pandemic and started doing research, the note keeping and the record keeping of our council is not very robust, and that is something that I'",
        "'speaker_3': 'hope to change with this process, that we leave better tools for those who come after us in ten years. Some of the highlights from 2022. Next slide, please. We had, as I mentioned, the six meetings. We had three over 389 participants.'",
        "'speaker_3': 'We represented 54 neighborhoods. We had a community report for the first time ever that was put in the record highlighting what happened at the community meetings. We had a dashboard that was able to talk about equity and incorporated information from Denver Human Services.'",
        "'speaker_3': 'And to date, we have received 269 public comments from Denver residents. Next slide. I just wanted to remind the public and my colleagues that these are the rules that are set per charter. Draw 11 council districts. Have them be as equal in population as possible.'",
        "'speaker_3': 'Must contain contiguous territories. Must be compact. Compact as possible. Must contain whole election precincts, and must be approved by this evening. March 29, 2022. Other considerations that we had to take. Next slide, please. Other considerations that we had to take into consideration is the deviation.'",
        "'speaker_3': 'So each council district must have as much as the equal population of the 11 council districts. The one with the largest population and the one with the smallest cannot have any 10% larger. Race and ethnicity should be taken into consideration, and district lines must follow obvious geographic boundaries to the greatest extent possible.'",
        "'speaker_3': 'What else we took into consideration in our resolution is that we would respect collegial and statistical neighborhood boundaries to the greatest extent possible. And we heard that often throughout our meetings is how important it was to keep our neighborhood boundaries hold, that we would preserve logical communities of interest and the core existing constituencies traditionally represented to the'",
        "'speaker_3': 'greatest extent possible. And we would do our best not to have to incumbents in the same council district. Next slide. And this slide is Map D draft two, which will have our public hearing this evening. And I would just like to thank the public for your patience as we went through this process in the middle of a'",
        "'speaker_3': 'pandemic, where oftentimes we did we had to pivot at the last minute, as many, all of us have, and thank the leadership of City Council for giving me this opportunity to create new tools and a different experience for the residents of Denver when it came to the redistricting process.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. For the staff report. For the report, we have six individuals signed up to speak this evening. All of them are joining us virtually. And our first speaker is Shannon Hoffman.'",
        "'speaker_2': 'Hello. Can I be heard? Yes. Thank you.'",
        "'speaker_4': 'Good evening, members of council. My name is Shannon Hoffman and I live in District ten. Thank you for directing me to speak tonight instead of last week. That was a very helpful phone call from the city manager's office directing me to speak here.'",
        "'speaker_4': 'Thank you for rebooting the zoom last week before I still attempted to make comment and essentially silencing me. Thank you for this entire redistricting process and the changes described in the presentation. Thank you for doing what not only I would describe, but other community members have described as a low bar for engaging community members in this process'",
        "'speaker_4': '. And thank you for telling community members who did take the time to engage in this complicated process that they were, quote, signed on to a letter they didn't read or understand that when they came to a community meeting, they were, quote, trying to disrupt the process and that if we supported one particular map that was more equitable'",
        "'speaker_4': 'than others, we were, quote, spewing propaganda of one councilmember. Thank you for coming into the community input process with six votes already supporting one map. Thank you for supporting a map which the person who drew it didn't even show to committee the day it was thoroughly reviewed.'",
        "'speaker_4': 'And no supporters of the map used one data layer to indicate why they supported it. Thank you for.'",
        "'speaker_2': 'Voting to approve tonight.'",
        "'speaker_4': 'A map that will create seven districts with more than 50% white people. Two more districts with 45% white people. And a city that was the first in the country for displacing Latinos. Thank you for approving a map that will put districts three, eight, nine, ten and 11 all at or above the 65,000 person threshold.'",
        "'speaker_4': 'When we know census undercounting occurred last year and we know we are being overdeveloped with luxury units in a rapidly growing housing crisis. Thank you for prioritizing yourselves and your reelections over our community voice and our community needs.'",
        "'speaker_4': 'Thank you for all of this, because the fire that is raging in my chest and my belly after this experience is growing. So thank you for that. My community members and I are ready for the community to lead this process.'",
        "'speaker_4': 'We want an independent redistricting commission with the democratized power to make decisions about these maps. And we want more than that. We want co governance with the people who cannot pay 1600 dollars a month for rent, with the people who sleep outside, with the people who can't breathe there outside.'",
        "'speaker_2': 'With the people who can't.'",
        "'speaker_4': 'Get to their hourly wage job on time because of our transit system. So, community, I hope you are ready to fight because these seats are ours. This money is ours, this map is ours. And thank you so much for this process.'",
        "'speaker_0': 'Thank you. Our next speaker is Darryl Watson.'",
        "'speaker_1': 'When it's not. Yes, President, the devil can say all. Gilmore Miembros del Kinsale. Darryl Watson Soy Owen Resident ID Adrian Tanyas Steal the street all the way back up inside they came a bolo is de central mango e crazy in as easily as we heard is my spaniel annoys me when I'm wrong.'",
        "'speaker_1': 'I mean my presentation is going to be in what I refer to as Spanglish. A little English and a little Spanish. Durante El Proceso de recherche three Tashjian la palabra marlene seh or traders two one people was used Paradis CRU beer honorable in the Emperor's Day Stoke on sale it doesn't matter.'",
        "'speaker_1': 'The insult was made to face to face a car rally by tweet or retweet. Words have impact. That term was despicable. It was shameful. It's no shame because this city rightfully honors Cesar Chavez yesterday and throughout this week.'",
        "'speaker_1': 'Korea competition to win on the way by palabra hero Gina. I have known each of the members of council malign with that insult challenging their leadership during redistricting, put community first and demonstrated respect for the process. Let me share why they are heroines, not only for their people, but for this city.'",
        "'speaker_1': 'One of our heroines has focused her life to fighting for the rights of the immigrants, indigenous people and other marginalized communities. The other has spent her time elevating the voice of youth in MONDELLO in Toda La Ciudad or the Arena stepped up during COVID pandemic to expedite care for her community.'",
        "'speaker_1': 'Saving the lives and protecting the health of many. She also successfully led this redistricting process during a global pandemic. No less Fenomeno de Nuestro de my hero, Lina Patriota, three decades ago. Encourage us to imagine a great city, a great city, not because of our buildings on Weber, Equipo de Baseball or Nueva Aeropuerto.'",
        "'speaker_1': 'Our focus was always about the people. That has been our focus during the redistricting process. She knew then, and it is important to remember now that people are what makes Denver a great city. She has committed her life to this work.'",
        "'speaker_1': 'That's Las personas in Denver. I personally thank each of you for your example and your life of service to the other members of Council. Congratulations for leading a successful redistricting process. The voices of the silent majority often gone heard in these public hearings.'",
        "'speaker_1': 'On behalf of them, I thank you for your service and your leadership. I encourage Council to vote yes on map draft two, which is gracious. Everyone has notice.'",
        "'speaker_0': 'Thank you. Our next speaker is Jesse Paris.'",
        "'speaker_1': 'Oh, yes. Good evening. Members of council may be heard. Yes. Yes. My name is Justin the song pair some represent for Blackstar action moment for self-defense positive I come chains as well as the Unity Party of Colorado, the East Denver Residence Council and Frontline Black News.'",
        "'speaker_1': 'And I'll be the next hour of Denver in 2023. I'm against the redistricting map that was chosen to be published tonight. I attended a meeting on February 23rd at Emanuel High School, where about 60 people were in attendance.'",
        "'speaker_1': 'And the consensus of that meeting was Matt E Amanda Sandoval's math majority of the people that were there were in unison with that map. And to see today that the Council has voted against that map and opted for map D is very disingenuous to the process, the climate.'",
        "'speaker_1': 'She did all kinds of outreach with communities. The communities voice is not being heard. Like I said, I attended a meeting on the 23rd. The consensus of that meeting was map. It was had the least deviation from the previous map or our current map since 2015.'",
        "'speaker_1': 'And to see that you are voting for D is, like I said, is very disingenuous to the process. So I'm against map B because this is not the meeting in your high school was Map E and now you're choosing to go with B.'",
        "'speaker_1': 'So as Shannon Hoffman alluded to, this whole council needs to be replaced. This whole mayor needs to be replaced. Really, this whole system needs to be replaced and replaced with a system of justice. This process was not just the voices of the people are being silenced.'",
        "'speaker_1': 'The same people actually clamor. Being marginalized and disenfranchized in every area of society are once again being marginalized and disenfranchized in this process. So thank you for allowing me the time to speak. Please vote against Matt. The vote no on Matt.'",
        "'speaker_1': 'That is not what the community wanted. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Christina Xie.'",
        "'speaker_4': 'All right. Can you guys hear me? Yes. All right. Well, thanks for letting me speak this week on the process, since you had first and second last week specifically asking me not to speak on this process, even though the process was still going on last week.'",
        "'speaker_4': 'So a good portion of council is back, the same that from the start. Without providing any real transparency for the public. What was the purpose of the community input meetings? If you're going to ignore the questions and comments completely brought up during the meetings was not an active participant towards the beginning of the process because really shouldn't'",
        "'speaker_4': 'be our job to make sure council is still working for the people. The only reason why I started looking to them is because someone from the mayor's office made his opinion very loud and clear at a meeting that but not with basis and maybe not fact, but someone from the mayor's office was there just to shut down'",
        "'speaker_4': 'one map and then put maybe E or F was highly suspicious and made want to look into nothing more. And if you've heard the same verbiage, supporting methods, because that was the only that was full transparency was provided for a council member providing a 40 minute video breaking down layer by layer.'",
        "'speaker_4': 'Why then? That was not the way it was. It seems like the mayor's office actually had some plans at the public meetings to a conversation. So why are you supporting this? Not that the mayor's office has been pushing.'",
        "'speaker_4': 'You've not provided transparency to the public on the map you're voting on tonight. So again, I ask equity for whom are you protecting majority minority districts? Are maps complying with the Voting Rights Act. Why did the request to include community voting data in the public report get shot down by a council member with?'",
        "'speaker_4': 'Well, I don't know what that's going to do. I could get data shows, community input, which should be taken into consideration. Picking a map that will affect all of us for the next decade is supposed to serve the people.'",
        "'speaker_4': 'Stop degrading and deflecting defined. Gerrymandering is not the same thing as showing us how your math prevent gerrymandering and to say Denver voters. Voters are color blind and insinuate racism is not an issue in Denver. It is extremely dangerous for others.'",
        "'speaker_4': 'It's a privilege to think that way. But for people of color, we know that reckless rhetoric leads to senseless murders. Why aren't you taking community input into consideration of making these decisions? Why are you protecting this community? Why aren't you protecting the tax payers who claim to care about your actions?'",
        "'speaker_4': 'Do not align with your words. You claim to care about saving taxpayer dollars and then go and increase the deficit budget. I've already told you over and over again they don't protect us when we terrorize and traumatize us and you somehow decide it from community input of police brutality to increase their budget.'",
        "'speaker_4': 'We want to talk about Ukraine. Why don't you focus on what needs to be done in this city? I mean, focus on the civilians being targeted in Denver by DPD and now we're paying these large settlements and counting as the terrorizes local communities.'",
        "'speaker_4': 'Any solutions for that or are you just lip service for the mayor's office? Why has nothing improved in the last few years? Your Band-Aid solutions do nothing to protect this community. Does it matter what I say? You guys are going to vote the way you showed up.'",
        "'speaker_4': 'You would vote from the start in favor of the mayor's office. Outside of the personal gain from your position, I just want to know, is the city something you're proud of? Are you proud of the homeless crisis created by the city you want to talk about humanitarian crisis, look at your own city.'",
        "'speaker_4': 'Are you proud of that? You're continuously. Some of our city corporations are displacing people. Thank you.'",
        "'speaker_0': 'That's the thing. We have a lot of treat. Speaker Our next speaker is David Hagan.'",
        "'speaker_1': 'Oh, thanks. Wait, no, I'm not going to. Thank you, counsel. Not going to thank you for bringing me up here tonight. I'm not going to thank you for being here tonight because I don't want to be here. I'm not going to thank the people that have spoken about the people tonight.'",
        "'speaker_1': 'I'm going to go ahead and thank Candace Owens, the one that went before Jesse Perez. I think. I think that was his name, Candace Owens. Let's go over how this whole thing has gone tonight. We talked about data and September rules in October.'",
        "'speaker_1': 'We spoke to guys. We did this. We were the communities of interest. God, we are good. We are for the people of Denver. My God. Listen to me. I am going to speak highly about myself. We went to community interest.'",
        "'speaker_1': 'We define. We define your Denver. We went by these precincts. We went through these public maps. And then in February, we went through these council maps, public meetings, public vetting. And then a day after Cesar Chavez Day, I think I about threw up when I heard that.'",
        "'speaker_1': 'Unbelievable that this is the that we're looking at. I think that everybody's spoken about the fact that this is not the map we should be looking at. This is not equitable. This is not this is not the way that Denver should be looking for the next ten years.'",
        "'speaker_1': 'This is the way that we whitewash Denver and continue to gerrymander to produce a map of Denver that is not of the people. This is a map for that view. This is a map for the the wealthy. This is a map for whoever it is that's pulling your strings.'",
        "'speaker_1': 'This is not a map for the people. I had something put together to say, but I mean, I just didn't really feel it necessary. Like like like was said prior to. To me, it doesn't matter what I say.'",
        "'speaker_1': 'It doesn't matter what anybody else says. You all just figured you get one person to come up here and and and jerk us all off, and then we'd be stand behind your map. Now, the truth is, the proof is in the pudding.'",
        "'speaker_1': 'I think this how they say it. I like what Shannon's. I will actually talk about Shannon for a second. She spoke about a fire in her belly. That fire is not only in her belly, it is elsewhere. There may only be a few people up here tonight, but there are many, many more that are going to come'",
        "'speaker_1': 'and take every one of your asses out of those seats, because this is not representing Denver. This is not for the people. This is not for anything other than whoever it is that pulls your strings. And I don't know why y'all are the mayor's minions, but you are.'",
        "'speaker_1': 'You do whatever he says you like. The wonderful person said before me. How much? 14 million. That's just the start. We're at the beginning and it's just 14 million. That's what your redistricting map is going to do. We're going to do more money to those asshats and 14 million to this group.'",
        "'speaker_1': 'And there's a 50 person lawsuit coming out of that, right? 50 people. That was only, what, 11 or 12? 14 million.'",
        "'speaker_0': 'That's the time where they're.'",
        "'speaker_1': 'Going to take that. Want to try?'",
        "'speaker_0': 'Our next speaker is Katie Blakey.'",
        "'speaker_2': 'Council members. My name is Katie Blakey and I live in District ten. I wanted to start by thanking the council members who put some sort of effort into creating a strong map. So to those of you who considered equity, population growth, census undercounts.'",
        "'speaker_2': 'Communities of interest. Community feedback. Thank you. I don't like math. There are a lot of reasons, but most personal to me is that it breaks up my home. A defined community of interest. Capitol Hill. Now I know that many maps broke off Capitol Hill.'",
        "'speaker_2': 'Well, I wasn't thrilled about it. I recognized that with some maps. This meant they would allow marginalized voters in Denver to retain some sort of power and would distribute future growth more equitably. I'm okay with my neighborhood being split if it serves some sort of greater good.'",
        "'speaker_2': 'The greater good does not include the reelection schemes of incumbents. I'm particularly disappointed in those who broke up my neighborhood because math is hard or because we live in the real world, not Narnia, or because they just didn't want to put in the effort to listen to their community and make an equitable map.'",
        "'speaker_2': 'Decisions like these should be made for the benefit of the residents of Denver, not for politicians who don't even know the names of the neighborhoods surrounding their area. This process has been painful. Understand that council is working with some difficult circumstances and I don't want to dwell too much because to be quite honest, this whole process has'",
        "'speaker_2': 'been really distressing and exhausting. So thank you to the few council members who really engaged. Thank you so much to the community members. Most council members ignored who showed up throughout the whole process and worked a whole lot harder than most council members to come up with the massive benefits done right.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers this evening. Questions for members of Council on Council Bill 22, Dash 299. Seen no questions. Councilmember Ortega, do you have a question or do you have a comment?'",
        "'speaker_4': 'It's actually a.'",
        "'speaker_0': 'Comment, but. Okay. Clarification from the city. Okay. Can we if it's a a comment, I want to make sure we stand for clarification or clarification. Okay. We'll disregard then mean gaveling out and closing the public hearing. Go ahead, Councilmember Ortega, with your.'",
        "'speaker_0': 'I apologize. I think I was. That's okay. At the same time, you know, if that's okay, I thought I gave it enough beats, but no, that's that's totally fine. So please go ahead with your. So I want to ask the city attorney to just clarify the process of redistricting and the role that the mayor's office plays in'",
        "'speaker_0': 'the process, because this has historically been a city council led process under our charter. And so I wanted to just get your sort of confirmation or clarification of that.'",
        "'speaker_1': 'Sure. Councilman Ortega Archibong, a Legislative Council councilman under Charter 3.1.2. Redistricting in Salt Lake City Council.'",
        "'speaker_0': 'Thank you. Thank you, Madam Chair. All right. Now the president. Councilmember Ortega, appreciate that clarification. Now the public hearing is closed. Comments by members of Council on Council Bill 22, Dash 299. Councilmember Ortega. Thank you, Madam President. I just wanted to first acknowledge that we did have, in fact, a very open and transparent process.'",
        "'speaker_0': 'It started as early as we were able to begin with without having had the benefit of the census data, which is what is critical, as well as the new precincts that have to be done based on the the new districts that are done at the state level.'",
        "'speaker_0': 'And so the fact that the federal government did not produce the census data as early as they normally do, it created an expedited process. And I do want to thank Councilwoman Sandoval, as well as Councilwoman Black and Councilman Herndon, who were the the three the committee that that move the process forward to all of us.'",
        "'speaker_0': 'I did work on a map. I had posted it, but I never shared it as a map that I submitted. I guess it was shared on the on the map tattooed site, but it was not submitted for consideration because I did have conversations with my colleagues whose districts would be impacted, and there were concerns about why they'",
        "'speaker_0': 'would not support it. So I did not take it further to try to count the votes among other members whose districts were not being impacted with the changes I was proposing. So I chose not to submit it. So I think in in the background, there were lots of us looking at different ways to try to bring a'",
        "'speaker_0': 'map forward that created the balance of representation so that it was equalized, as we're basically mandated to do, and also taking into account that these boundaries will be in place for the next, you know, 10 to 12 years, because by the time we get the next census data, it's typically two years after the, you know, the ten'",
        "'speaker_0': 'year cycle of when this process happens. So I will be supporting the map that came forward. It did change from the very beginning that it was introduced. I shared my thoughts with. One of the members who was a catalyst in bringing that forward.'",
        "'speaker_0': 'That individual actually helped me shape the map that I worked on and ended up posting. But at the end of the day, it comes down to do we have the votes to move a map forward that adheres to all of our rules and guidelines?'",
        "'speaker_0': 'And this map, in fact, does that. So I will be supporting it tonight. Thank you, Councilmember Ortega. Councilmember Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I want to go back to August of 2011. So we were barely four weeks into my first term. And and I remember Council President Nevitt coming up to me and saying, hey, I would like for you to be on redistricting.'",
        "'speaker_1': 'And I'm like, Great. What exactly does that entail? Four weeks into my council term and we were six new council members, four district council members, along with council members Ortega and Kennedy, each at large. And we put together a map, that one I'm very proud of, because for the 2015 and 2019 elections, that was the city council'",
        "'speaker_1': 'map that got us the council that we have before us, which is Councilman Flynn, who talked about probably the most diverse and representative council we've had. But the work that we did a decade ago, compared to the work that we just did in the past few months, doesn't even compete or compare.'",
        "'speaker_1': 'And I appreciate Councilwoman Sandoval just highlighting some of those ways we were ensuring that community was going to be first and foremost during this process from and finding and reaching out to a redistricting expert to touch on community several different ways and paper through mailing, through virtual, through representative all the different ways we could in the middle'",
        "'speaker_1': 'of a pandemic. No and no less. With virtual meetings and person meetings. And so I'm so proud of this process. And so Catwoman Sandoval, Councilwoman Black, Emily Lapel. We cannot tell you. Thank you enough for the work that they did, because on the small group, I saw all the effort that they put in and how much they'",
        "'speaker_1': 'cared for this process, and you cannot thank them enough. So just a process in itself. I want to tell them thank you because they're not going to hear it enough for all the work that they put into it.'",
        "'speaker_1': 'And I'm proud of the map that we have before us. And yes, it is a map of their sponsor. But there were other maps that I didn't support that had they gotten the majority of votes, I believe would have been effective maps as well.'",
        "'speaker_1': 'I do believe that Map D is the best are the ones we had before us. No map is perfect. We have requirements through populations separating neighborhoods. But to my colleagues who did this, to the community that did this, thank you as well.'",
        "'speaker_1': 'And I. I hope that my colleagues support met in person to take them on present.'",
        "'speaker_0': 'Thank you. Councilmember Herndon. Councilmember Sandoval.'",
        "'speaker_3': 'Thank you, Madam President. I just wanted to talk on map D and say that in this map in Council District one, we lose the West Colfax neighborhood. And I heard from the Jewish community not long ago. My office is working on a cultural district, cultural and landmark district for the Jewish Orthodox Jewish community in West Colfax.'",
        "'speaker_3': 'And they had were nervous about representation. And I remember ten years ago that they were also worried about representation because West Colfax was going to be split. Now it's going to be made whole again. And so for those residents who are watching in West Colfax, I still have the honor and privilege of representing you in this next'",
        "'speaker_3': 'year, up until July of 23. And it has been an honor to work with those communities. And at the same time, it has also been an honor to work with counsel, mentors, that cultural and landmark district for our residents in the Jewish community who have been in the West Colfax neighborhood for 150 years, and just want to'",
        "'speaker_3': 'say thank you for all of the feedback on all of the maps and all of the processing. I think one thing that I've learned through the entire process is there's a lot of passion involved in this, and it's because it's home is where your heart is, and when your heart is in something, you will elicit a lot'",
        "'speaker_3': 'of passion and feelings and emotion. And so I know that I personally have a lot of passion and feelings, and I know the North Side and Denver is where my home is and where I'm raising my kids. And so it's been an honor and privilege to be part of this process.'",
        "'speaker_3': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. Councilmember Flynn.'",
        "'speaker_5': 'Thank you, Madam President. I want to thank Councilman Herndon for raising the point that I believe I raised in committee when the maps were all before us in the committee the whole few weeks back. The map that was approved after the 2010 census and put into play for the 2015 election gave the voters of Denver the ability'",
        "'speaker_5': ', as you see up here on the dais. To elect their representatives who almost precisely reflect the demographics of Denver. It's remarkable. And it's my expectation that map D while no map is perfect. We necessarily have to split some neighborhoods because of where the population numbers fall and where the precinct lines fall.'",
        "'speaker_5': 'But while no map is perfect, it's my expectation that Map D will produce the same way that the map of 2011 for the 2015 election produced. A council that looks like this city. And with that, I will vote for my party.'",
        "'speaker_5': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn, and see no other council members in the queue. I'll go ahead and round out the comments before we do our roll call vote. I would like to really sincerely thank all of the community members who participated in the redistricting process.'",
        "'speaker_0': 'We had more participation by community members than ever before in the history of our great city, and we knew that this was going to be a very difficult process and one that everyone wasn't going to be happy with.'",
        "'speaker_0': 'The Final Map. Councilwoman Sandoval, Councilman Herndon and Councilman Black, along with Emily Lapel from our legislative staff, have been stellar in their coordination, in their leadership and ensuring that we had a good process that followed all of the requirements that we had to make sure we checked the boxes on.'",
        "'speaker_0': 'And as already stated, that this is the first time in Denver's history that city council use technology. And we expanded the community outreach during this process to ensure that we heard from our community and we started this back with the community in October of last year.'",
        "'speaker_0': 'And I know that this council did the work, that we followed the process. And it's indicated indicative that when Councilman Herndon and I had a combined office hours on the 18th of this month, we didn't have anybody show up.'",
        "'speaker_0': 'And that is indicative to me that community members understood our process. They understood the requirements that we had to make sure that we met for the redistricting maps and that they understood the difficult work that we had to do.'",
        "'speaker_0': 'And then again tonight, we had six speakers for this one map. We could have easily had 50, 75 to 100 community members. We it's a required hearing. We would stay here and listen as long as it takes to make it through all of the speakers.'",
        "'speaker_0': 'And we have done that. And so I know that we have followed the process, we have done the work and I am happy to support D this evening. Madam Secretary, roll call on Council Bill 22, Dash 299, please.'",
        "'speaker_2': 'Can each. I. Sawyer. I black. I see tobacco. No. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Flinn.'",
        "'speaker_1': 'I. Herndon. I. Hinds.'",
        "'speaker_2': 'Cashman. Ortega, i.'",
        "'speaker_3': 'Sandoval, i.'",
        "'speaker_2': 'Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': 'One 812 Eyes.'",
        "'speaker_0': '12 Eyes Council Bill 20 2-299 has passed our pre adjournment announcement on Monday, April 25th. Council will hold a required public hearing on Council Bill 22, Dash 246 Changing the zoning classification for 2039. South William Street in University are required public hearing on Council Bill 22, Dash 249 Changing the zoning classification for 41, 51 and 4155 Jason'"
    ]
}