{
    "A proclamation designating the week of June 25 through June 29 as Bike Week and Wednesday, June 27, as Bike to Work Day in Denver.": [
        "'speaker_3': 'None, Mr. President, about communications. None, Mr. President.'",
        "'speaker_0': 'All right. We do have two proclamations. Councilman Susman, will you please read Proclamation 695?'",
        "'speaker_6': 'Certainly, Mr. President. Thank you. This is a proclamation designating designating the week of June 25th through 29th as bike to work week, whereas the city and County of Denver partners with the Denver Regional Council of Governments, local bike organizations and bike enthusiasts each year to plan activities and events intended to promote awareness of the benefits of bicycling'",
        "'speaker_6': '. And. Whereas, Bike to Work Day is an annual event designed to encourage people to ride their bicycles for transportation on a consistent basis to reduce congestion, improve air quality, and benefit public health. And. Whereas, the Department of Public Works hosts the Civic Center Park Breakfast Station, where people on bikes can celebrate their commute to work with free'",
        "'speaker_6': 'snacks, raffle prizes, music and educational outreach offered by organizations in the region. And. Whereas, the Department of Public Works celebrates continued progress building out its citywide bike network and ramping up efforts in the coming years to implement 25 miles of bikeways annually as recommended in Denver's Vision Zero Action Plan.'",
        "'speaker_6': 'And this year, installing a new grade separated cycle track on Brighton Boulevard in the River North District and adding new bike lanes on Ulster Street, Florida Avenue, 19th Avenue and 20th Avenue, and whose plans to install additional bike infrastructure and to upgrade existing bike infrastructure are contributing to Denver's designation as a top bicycling city.'",
        "'speaker_6': 'And. WHEREAS, The Department of Public Works continues to build out the city's bicycle network to provide people with convenient and connected access with the goal of ensuring every household is with a two minute bike ride or a one quarter of a mile of a comfortable and low stress facility to make bike riding an attractive way to get'",
        "'speaker_6': 'around for more commuters. And. Whereas, Denver will keep growing the city's bike network and we'll plan improvements this year for 50 miles of bikeways, which will be rolled out in the city over the next several years, thanks to our Denver voters who overwhelmingly approved the Denver 2017 Geo bond in November of last year.'",
        "'speaker_6': 'Oh. Whereas the bicycle and pedestrian safety continues to be a top priority for the Denver City Council of the City and County of Denver, which is supporting funding for additional and expedited multimodal improvements that will increase bicycling in our city.'",
        "'speaker_6': 'Now, therefore, be it proclaimed by the City Council, the city and County of Denver, Section one, that the council designates the week June 25th through June 29th, 2017, as Bike Week, and June 27th as Bike to Work Day and encourages citizens to stay safe this summer no matter what your mode of travel and Section two that the'",
        "'speaker_6': 'clerk of the city and county of Denver shall attest, and a the seal of the city and county of Denver to this proclamation and that a copy here of before awarded to the manager of public works.'",
        "'speaker_0': 'All right thank you that Sussman your motion to adopt I.'",
        "'speaker_6': 'I moved to adopt proclamation 18 dash 0695.'",
        "'speaker_0': 'All right. It has been moved in second and comments by members of council council on assessment.'",
        "'speaker_6': 'Thank you, Mr. President. Yes. This is always a very big pleasure of mine to be able to make a proclamation like this. The city is investing in our bikeways, and we need to make even more investments that we are.'",
        "'speaker_6': 'We encourage this constantly, thanks to the good citizens who voted for the Go Bond will be adding many more, many more bike miles to the city. And if you are not a biker, just realize that if we build more bikes, somebody is going to use it.'",
        "'speaker_6': 'And that's going to be one less car on the road. So please, I ask my fellow council men and women to join me in proclaiming this week to be bike week.'",
        "'speaker_0': 'Excellent. Excellent. Councilman Clark.'",
        "'speaker_8': 'Thank you, Mr. President. I'm very excited about this. I regularly ride my bike to work, but it's great to have a day to celebrate it. And I think, Councilwoman Sussman, for bringing it forward. Everybody on the city side who does stuff.'",
        "'speaker_8': 'But I really want to give a shout out to our Dr. COG partners who put a lot of time and effort and resources into really I think we have I think you might have spoken to up the size of the biggest bike to work days in the country and it's really exciting to see.'",
        "'speaker_8': 'And so hopefully lots of people will get out there, try a bike. It is so much better than being stuck in your car honking at people. You get the fresh air, you can bike on our awesome tree lined streets and enjoy it and then hopefully stick with it.'",
        "'speaker_8': 'If everybody just found one day of the week that they could get on a bike and get out of their car. We are 20% reduction in traffic and congestion on our roads. It would make your other four days in the car just as spectacular as your one day on your bike.'",
        "'speaker_8': 'So I hope everybody will participate and and see if they're able to make this a regular part of their commute. Thank you, Mr. President.'",
        "'speaker_0': 'It is such an incredible stat that no one heard it, but nine out of ten people hate traffic, and I hope they understood what you just said. Okay, Councilman Flynn.'",
        "'speaker_9': 'Thank you, Mr. President. Actually, I thought it was 11 out of ten people who hate traffic, it seems sometimes. Thank you to Councilman Clark for mentioning Dr. Craig and their leadership on this. But I also want to add to that our thanks to the employers and nonprofits and the other organizations that provide services along the way, refreshment'",
        "'speaker_9': 'bike corrals and other other services for the folks who are taking part in it and hope it gets bigger and better each year, not only for participants, but for those who who provide the sponsorships and the and the refreshments along the way.'",
        "'speaker_9': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Flint. Councilman Black.'",
        "'speaker_6': 'Thank you, Mr. President. Councilman Clark. Thank you for inspiring people to ride their bikes. So in District four, I started a movement called No Drive Fridays. So beginning in February, I have ridden my bike to work every day and we have a social media campaign and every community meeting.'",
        "'speaker_6': 'We're getting people to ride their bikes on Friday because it is the number one complaint I think of people in Denver is the traffic. And the argument is, as Councilwoman Sussman says, if you're riding your bike, that's one less car on the road.'",
        "'speaker_6': 'So super excited about that. In the fall, we have all the elementary schools lined up to do a competition on Fridays to see how many people will not drive, have their parents drive them to school. I'm really excited about that.'",
        "'speaker_6': 'And as always, I will be biking to work on Wednesday. It's ten miles from my office. Councilman Clark told me, if you get sweaty, just start pedaling. But I told them. But then my bike stops and it's supposed to be 99 degrees that day.'",
        "'speaker_6': 'So if any of you have meetings with me, I will be sweaty. Thank you.'",
        "'speaker_0': 'Thank you for that warning. Okay. Councilman Clark is a little unfair because he has an electric bike thing that. Pedals for him. So I love this proclamation. Thank you for bringing it forward, Councilwoman Sussman. It's a it's a real issue.'",
        "'speaker_0': 'You know, just this week, we kicked off because of an incredible community leadership and city leadership. Brand Boulevard, for the first time has sidewalks and bike lanes. And I think it's indicative that we're going in a new direction in the city of Denver that no neighborhood is is okay if it does not have sidewalks and bike lanes'",
        "'speaker_0': '. And so we want to make an investment in the rest of the city. And I think it's critical that we move in this direction and hopefully. Councilman Clark, as we've been talking about, there would be some plans to get us moving much faster in that direction to get bike lanes and sidewalks all over this city.'",
        "'speaker_0': 'The last thing I'll say is there have been a lot of issues with cars and bikes and a lot of people being frustrated by folks who who are riding bikes and you honking at them actually happened to me with my three kids on Saturday, someone frustrated and honking at us and we were actually in the bike lane'",
        "'speaker_0': '. I don't know what they're honking and I couldn't believe it. But for those of you who are honking in a vehicle, a 6,000 vehicle. To someone riding a bike. I think you need to put yourself in that person's shoes or bike and think about.'",
        "'speaker_0': 'There's not a connected for. There's not a lot of connected facilities throughout this city. It's really hard to bike through the city. You should be honking and saying, Hey, thank you because it's one less car in the street and you are.'",
        "'speaker_0': 'Decongest in our streets. And so I think we need to be very respectful of people walking. And I think we need to be very respectful of people biking in the streets. So with that. Thank you for bringing this for Dr. Sussman, Secretary Rocha Sussman.'",
        "'speaker_3': 'Hi, Black Clark. All right. This from Rosa Flynn. I feel more Herndon. I can eat. Lopez. All right. New Ortega. Mr. President, I.'",
        "'speaker_0': 'Was wondering these results.'",
        "'speaker_3': '12 eyes.'",
        "'speaker_0': '12 eyes. Did somebody vote? No, we had a. Oh, okay. Absent, sir. Okay. Sorry, guys. Okay. 12 hours it passes. And now. Madam. I mean, Dr. Sussman, is there anybody wanted to bring up?'",
        "'speaker_6': 'Yes. Someone from public works can come up to the podium. Tell us all about it.'",
        "'speaker_11': 'Hey, good evening, everyone. My name is Dan Raine. I'm staff at Public Works and I work on the Bikeway program. I don't think I can match the great dialog y'all had here tonight about cycling, but the mission is is managing our public right away for people throughput.'",
        "'speaker_11': 'Whether you're walking, you're cycling, taking transit or driving a car. And we really have to focus on that with 40 plus people moving here day. We don't have the time and money to ruin Denver by widening our public right of ways and and taking away these local amenities.'",
        "'speaker_11': 'And look, this is that we really appreciate. So we are very focused on creating.'",
        "'speaker_10': 'Grid networks.'",
        "'speaker_11': 'To allow folks to be able to get around by bicycle even easier than they do now. Using our trail, great trail systems, a trunk line. The voters have spoken and we have a lot of work to do. Go ahead.'",
        "'speaker_11': 'Oh, well, and, you know, this week is really just about encouraging folks to to give it a try. My commute 17 miles. And so I take the train mostly every day, but I'll even ride in on my shopping for an electric bike.'",
        "'speaker_11': 'But I'm not there yet, but it'll take me a little longer. But if anyone wants to be at Civic Center Park in 5 a.m. as we start setting up, we're really grateful for the partnership of Dr. COG, but we're really especially thankful for sponsors like delectable egg kind bars and so many other folks.'",
        "'speaker_11': 'Denver Library. Safe Routes to School or Vision Zero program. And everyone pulling together and supporting sustainable transportation.'",
        "'speaker_0': 'Great. Thank you so much. And thank you, Councilwoman Tester.'"
    ],
    "A bill for an ordinance approving a proposed Intergovernmental Agreement between the City and County of Denver and The Housing Authority of the City and County of Denver, to launch the new Lower Income Voucher Equity (LIVE Denver) program. Approves an $1,180,000 intergovernmental agreement with the Denver Housing Authority (DHA) through 12-31-23 to launch the Lower Income Voucher Equity (LIVE Denver) program to create immediate affordable housing options for employed workers by connecting vacant rental units with income-qualified Denver residents.  The Committee approved filing this item at its meeting on 5-23-18.": [
        "'speaker_0': 'Councilman Flynn again has called out for a comment council bill 660 and so has Councilwoman Black. Updating election procedures to include creating a fiscal impact estimates pro and con information for citizens on municipal initiatives. All right. Under pending, we have nothing called out.'",
        "'speaker_0': 'So let's put the first item up. Madam Secretary. Thank you. 592 and come. Yes. I'm sorry. Did you say something? Okay. Castle Martel, will you please put a 592 on the floor?'",
        "'speaker_5': 'Mr. President, I move that council vote 18 059 to be ordered published.'",
        "'speaker_0': 'All right. It has been moved and seconded. Councilman Flynn, would you like to make a comment?'",
        "'speaker_9': 'Yes, Mr. President. And with all due respect to Laura and the folks in the housing office and to Ishmael Guerrero, who I just noted in announcements, is doing a great favor in my district. I wanted to call this out because as well, when we talked about the five year housing plan, I also brought this up.'",
        "'speaker_9': 'I believe that this program, well structured as it is, and I believe that it would work in what it is attempting to do is the wrong approach to trying to to attempt to address the affordability of rental housing in the city.'",
        "'speaker_9': 'The principle is that we have empty units at a higher rate, not luxury apartments necessarily, but apartments that are for rent at a rate that they're going vacant. And so what we are doing is we're raising money from the city and maybe from some corporate sponsors to subsidize those higher rents.'",
        "'speaker_9': 'It won't necessarily be the rent that the landlord has opposed to that right now. It's what they call a reasonable market rate rather than fair market rate. But the principle is that we are perpetuating the problem of high rents in this city when we help to subsidize the occupancy of vacant apartments.'",
        "'speaker_9': 'When the market principle would be that the landlord ought to lower the asking rent until it gets filled. And I don't believe we will ever. Have affordable rents in this city as long as we continue to fill vacant apartments with subsidies.'",
        "'speaker_9': 'The corporate sponsors, the corporate partners that are recruited through this program, I'm not going to name them. I know who some of them might be. Instead of contributing to this program. Why don't they pay their workers more? Why are they contributing to a fund where we're going to subsidize higher end apartments for these low paid workers when'",
        "'speaker_9': 'these companies should be paying their workers a living wage? That's the answer to affordability ultimately in this city is that people earn a living wage. And so I wanted to call it out to vote no. Thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. I think Councilman Flynn raises some valid questions and concerns. We know it takes a long time to bring these units online. And having been on the board of a nonprofit housing development organization that has gone through the low income tax credit process, sometimes three and four and five times, to secure part of your'",
        "'speaker_5': 'financing to ensure that you have the affordability in your development. This program actually makes units available that makes them available to lower income people today because they're available today. I share the concern about some of those that are at the higher end.'",
        "'speaker_5': 'I do know that they have identified units across the city. They're not all downtown, brand new top high end market units there. They're across the city. And I think just given the time that it does take to bring these units online, it's important that we have as many options for people who are struggling to live in this'",
        "'speaker_5': 'city today as possible. And this is just one of many programs that Denver will have. And as you all know, we now have $30 million to work with to that date. Will will bond upfront and be able to ensure that we have the resources to to fast forward those projects that are in line to get their tax'",
        "'speaker_5': 'credit funding. And we know that it just takes a lot more subsidies for these developments to reach lower income populations. And this is one of those one of many options available to people in our community. So I will be supporting this tonight.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Ortega Well said.'",
        "'speaker_11': 'Councilman Espinal Yeah, I just wanted to explain my vote as well. I think I'm going to be sort of abstaining because there are some there's some administrative aspects of this that that are worthwhile creating that will actually help us, at least me in my imaginations, about what we can do better.'",
        "'speaker_11': 'On the housing affordable housing front that's actually benefited by this, this, this effort and not unlike the 30th and Blake and none of this what I'm saying right now makes any sense other than maybe to a few that I've actually spoken to on sort of my big picture ideas on how we can sort of more robustly help'",
        "'speaker_11': 'address this effort. And I promise you, I will be coming forward with something much clearer on that. This program, the Live Denver program, this money on this effort is creating the structures that that I want to tap. And and so for that reason, I can get behind it.'",
        "'speaker_11': 'But to to to my colleague, Councilman Flynn's point, this is not a sustainable approach. It is nice because it sort of addresses an immediate need. But I have long sort of railed since the linkage fee that our multifamily apartment building businesses are existing in a sweet spot.'",
        "'speaker_11': 'They are not taxed as businesses on property tax. They pay a 7% tax, not a 29% commercial tax rate. And yet they are very much businesses at the scales that we're talking about in the sort of types of businesses where we're we're we're sustaining by maintaining high rents in the market, by subsidizing vacant units elsewhere.'",
        "'speaker_11': 'So this is not programmatically the right way to address affordable housing. And so but it is unfortunately the best we're being given at this point. But I am still committed to working with this administration, with others in this industry, within the apartment industry and the contracting industry and the development industry, to actually help us take a different'",
        "'speaker_11': 'and more Denver unique approach. And and again, more on that very soon. I'm working on a video to sort of try and explain my ideas in a nutshell, something that you can take with you and understand that there is a tool out here.'",
        "'speaker_11': 'We just haven't created it or used it yet. Thanks.'",
        "'speaker_0': 'All right, Councilman.'",
        "'speaker_6': 'Thank you, Mr. President. It's no secret that I had some real concerns about this program since it was announced in a very political and media oriented fashion without the input of the impacted residents, it was intended to help.'",
        "'speaker_6': 'And so. It's, you know, tempting to say I don't want to reward poor process and poor decision making with support at the end, because I think, honestly, it is it is one of the worst examples of how policy has come about in my time in terms of making promises without data, not having equitable access to the information'",
        "'speaker_6': 'for this council or for members of the community until most of the details were finalized. So that's it's it is hard, but I'm not in the business of, you know, trying to to judge retrospectively. I have to judge the price, the product, the final product that's in front of me.'",
        "'speaker_6': 'And this program is a risk. It is a risk that it will reward, you know, market behavior of high pricing. It also has the potential to capture some folks who aren't captured with our current voucher programs. And so I will say to Councilman Flynn's concern that we do have a longstanding practice in housing of providing scattered site'",
        "'speaker_6': 'housing and market rate housing that's vacant and in downturns. It does help to bolster, you know, a market that, you know, might have, you know, apartments might have gone under. They you know, Section eight vouchers are are sometimes an important part of a business model for apartments in hot markets.'",
        "'speaker_6': 'They start turning residents away. So we have a history of of using, you know, payments that follow an individual rather than a subsidy to a building. And one of the benefits of that type of an approach is that it does mix incomes.'",
        "'speaker_6': 'So there is a lot to weigh on both sides here. I think where I come down and it's a tough call is that they the staff that has has has shepherded this program over the last few months has been very serious about taking input.'",
        "'speaker_6': 'And so a number of changes were made to this program, both ensuring that it would serve a distribution of incomes, not just folks at the highest level, making sure that people would have to have the same income verification requirements that we have very low income people do in the Section eight program, which is you have to verify'",
        "'speaker_6': 'your income every year. If you get $100,000 job, your subsidy shouldn't stay the same. So all of those types of changes that were made and I outlined some of them in the committee meeting, I think demonstrate an attempt to really be responsive here at the end to making this a more moderated program that mitigates some of those'",
        "'speaker_6': 'risks and creates more equity between this program and other programs. I'm still concerned I did check the contract and it still just has a resident of the subsidized units as a participant. It doesn't have a representative of renters interests.'",
        "'speaker_6': 'And I will say that not every resident has the same policy ability. And I think it's important to have both voices. It's important to have someone who's receiving the subsidy and knows how the process works, who can speak from the lived experience.'",
        "'speaker_6': 'It is also important to have someone who on a daily basis has policy and analytical experience with policy outcomes. One of the things we were concerned about in committee with this program is that it did not have a clear set of guidelines on which it would be evaluated.'",
        "'speaker_6': 'So for example, what happened to the market rate pricing in the unit, in the buildings where these units are located that should be tracked? Don't just tell me what happened to the resident, but tell me what were happening to the rents in the remainder of that building.'",
        "'speaker_6': 'Did they go up? How did they change? How did that differ from the rent we were paying? Did they go down? I mean, there's a lot of speculation about what's going to happen to market rents. And so if we lock in a two year contract and we do end up in a downturn, I want to know if'",
        "'speaker_6': 'the rents around that unit are going down. So there's a lot more work that needs to be done. I this contract doesn't obligate this board to come back to this Council for approval in the future. It is kind of a we give the money over and then this advisory board operates through the contracts that are put in'",
        "'speaker_6': 'place. I would encourage you to seek input beyond the contract requirements. I would encourage you to come back and take input on how the programs should be evaluated, since that was not yet concluded. We need to get that on paper and you need to have all the criteria by which we will be looking at success.'",
        "'speaker_6': 'I am one more thing. Just that sets me at ease in this in this careful balance is that this is a one time infusion as far as we've been told at the Housing Advisory Committee, where I represent this council, there are no funds allocated in 2019 into this program until they have a chance in 2019 and 2020'",
        "'speaker_6': 'to see the results. So I think that's an important way to manage the risk of the city and potentially unintended consequences. I frankly, I'm voting for it because I hope it succeeds and I hope that it doesn't have the unintended market impacts, but I hope that it will house families who would otherwise be struggling.'",
        "'speaker_6': 'And that is why I think it's worth taking some of these other risks, because the need is so great. So I appreciate all of the work over the last few months, especially to to get a public input process.'",
        "'speaker_6': 'Back on track. And I hope that that input process remains more transparent and more inclusive of the impacted communities then than we had in the first in the first chapter of this program's development. So with that, I will be supporting it tonight.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. Councilman Black.'",
        "'speaker_6': 'Thank you, Mr. President. I'd like to thank Councilwoman Coinage for staying on top of this and really advocating for it to make sure that it had a lot of improvement. So thank you for your vigilance. Excuse me. I will be supporting this because it's going to help 125 families who don't have a place to live.'",
        "'speaker_6': 'And helping 125 families get into an apartment as soon as possible is not going to change the market of the apartments in the Denver metro area. That is not a game changer. There are tens of thousands of apartments, so 125 of them.'",
        "'speaker_6': 'Getting some help is not going to change the market. I'm also pleased that many of the apartments that step forward are in my district and they are no in no way luxury apartments. And they're going into some nice mixed neighborhoods with some nice schools.'",
        "'speaker_6': 'And we have transit and grocery stores and parks, and it will be a nice place to live for a lot of people. And I have a lot of confidence in Denver housing authority managing this program. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Black. I'll just make a couple comments. Number one, I think, Councilwoman Ortega, you said something that's really important and a lot of folks don't know. From conception to completion of an affordable project years 2013, Walton took eight years to get done.'",
        "'speaker_0': 'That's far too long for a crisis. We need units now. We need them right away. And it's one of the things, one of the reasons I'm so supportive of this. I appreciate Councilman Flynn's concerns and hurt them in committee.'",
        "'speaker_0': 'But I am supportive of this because I think we can help people now. Thank you for saying 125. Councilwoman, can each thank you for your your vigilance in this. And I would just ask that the program maybe come back to our housing committee, you know, to to report back on how the program's going so that we can'",
        "'speaker_0': 'keep keep keep up with it. All right. So no other comments. Madam Secretary, welcome.'",
        "'speaker_3': 'Flynn Now, Gilmore, I Herndon. I can reach lopez. I knew Ortega. I Sussman by black clerk by Espinosa. Mr. President.'",
        "'speaker_0': 'I please. I was wondering about the results.'",
        "'speaker_3': 'I'm just making sure to tonight's one nay, one abstention tonight.'"
    ],
    "A bill for an ordinance amending Article 1 of Chapter 15 of the Revised Municipal Code of the City and County of Denver to update municipal petition procedures, including the creation of a fiscal impact estimate and ballot information booklet for municipal citizen initiated and referred measures, providing more specific deadlines, conforming circulator requirements to recent court decisions, and lowering the age for an individual to circulate a petition.   Updates election procedures to include creating a fiscal impact estimate and pro and con information for citizens on municipal initiatives and referenda, modeled on the state blue book, to clarify deadlines, to make other changes in response to court decisions and to engage younger individuals in the petition process.  The Committee approved filing this item at its meeting on 6-12-18.": [
        "'speaker_0': 'One way, one abstention, five, 95, 92 has been ordered published. Okay. We now have 66. So can you bring that up and have comments by members, by council? Councilman Flynn and Councilwoman Black.'",
        "'speaker_5': 'Is this for a vote?'",
        "'speaker_0': 'No, it's just comments. Councilman Flynn, go ahead.'",
        "'speaker_9': 'Thank you, Mr. President. I called this out just for a brief comment. I wanted to thank the Denver clerk and recorder for bringing this forward. This is long overdue, and I'm very happy that she has advanced this. What we will do is start producing a blue book.'",
        "'speaker_9': 'Folks are familiar with the blue book that comes from the state that informs voters on the pros and cons and the issues involved in all of the measures. Right now, under TABOR, we only issued we have only been issuing information on TABOR related questions on the ballot.'",
        "'speaker_9': 'And I remember folks looking through that publication and saying, well, where's the information on on the green roofs or on the social consumption? Where do I get the, you know, the the back and forth on that? And I wanted to thank clerk and recorder Deborah Johnson for this really simple and overdue idea, and I intend to fully'",
        "'speaker_9': 'support it. Thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn. Councilman Black.'",
        "'speaker_6': 'Thank you, Mr. President. On this election eve, this is a great time to have the vote on this. I would also like to thank our director of elections, Amber McReynolds, who worked with the clerk and recorder. And I have been talking to them about this for a very long time.'",
        "'speaker_6': 'So I'm really, really excited because an informed electorate is a very important electorate and we've had a lot of ballot measures both locally and statewide that have really had an impact, good and bad, in our city, in our state.'",
        "'speaker_6': 'And so information is powerful. So the fiscal impact of every ballot measure and as Councilman Flynn said, a blue book sort of showing the pros and cons of every issue. So thank you for working on that. The fiscal impact we talked about, committee talked about at committee.'",
        "'speaker_6': 'Councilwoman Kane each brought up the point that the fiscal impact will just be looking at the fiscal impact on the state, on the city and county of Denver, not on our overall economy. But today we had our green roof initiative and council meeting, and the city is going to have to hire seven full time people to manage'",
        "'speaker_6': 'the implementation of our Green Roof program. And so had we known that last year, that would have been the first part of the fiscal impact statement that would have been on the ballot, which would have provided more information to voters.'",
        "'speaker_6': 'So. Thank you very much, Amber McReynolds and Clerk Deborah Johnson. All right. And everybody, if you haven't, vote again, please vote tomorrow. It's lasting.'",
        "'speaker_0': 'Yes. Amen to that. Okay. Comes from Lopez.'",
        "'speaker_4': 'Thank you. Words were taken right out of my mouth on the congratulations. I wanted to make sure that our elections division and McDonald's have been recognized for their hard work. Yes. And informed the electorate is the an electorate that actually makes things happen in the city.'",
        "'speaker_1': 'Well, I just.'",
        "'speaker_4': 'Don't want to repeat anything else, but just great work. It's long overdue. Long overdue.'",
        "'speaker_0': 'Thank you, Councilman Lopez. All right. It looks like that is. We don't have any pending. Okay, great. Let's see all other bills for today. This concludes the items need to be called out. All of the bills for introductions are published.'",
        "'speaker_0': 'We're now ready for the block. Votes on resolutions and bills and final consideration, except for Council Bill 560 for the Cooperation Agreement, which is a companion bill along with Council Bill 563 approving one on one Broadway, the Urban Redevelopment Plan.'",
        "'speaker_0': 'After the public hearing this evening, Council Bill 563 will vote on this with the companion bill. All right, council members, remember, this is a consent or block vote. You will need to vote I. Otherwise, this is your last chance to call in and offer a separate vote.'",
        "'speaker_0': 'Councilman Flynn. Will you please put the resolutions for adoptions and the bills for final consideration of final passage on the floor?'",
        "'speaker_9': 'Me?'",
        "'speaker_0': 'Councilman Ortega, I'm sorry.'",
        "'speaker_9': 'Okay? We look so much alike.'",
        "'speaker_5': 'I would be happy to allow him.'",
        "'speaker_0': 'His head was a friend of yours, so I saw him. Sorry.'",
        "'speaker_5': 'Okay. Here we go.'",
        "'speaker_0': 'I talked to her about start singing Ebony as president.'",
        "'speaker_5': 'I move that the following resolutions and bills on final consideration be moved forward. Council Bill 1865 zero. 1865 618 five 4518 546. 18 5:47 a.m. I doing this right? These are all the resolutions. 18 548. 18, 549. 18.'",
        "'speaker_5': '558. Five 5118. Five 5218. 616. 18. 627. 18. 647. 18. 655. 18 six 4818 six 5318 six, 54 and 18 657. Those are on to be ordered published and the bills on final. We'll get to those. Are. You see?'",
        "'speaker_5': 'Do we have 654 five suits? 64?'",
        "'speaker_3': 'No, no, no.'",
        "'speaker_5': 'Okay. 18 564. No, that is the one we have the public hearing. Yeah, we got. Okay. So 18 five, 83, 18, 60, 60. 18 589. All to be placed on final consideration and do pass.'",
        "'speaker_0': 'All right. I mean, I'm secretary for the second work.'",
        "'speaker_3': 'All black. Clark Espinosa. Hi. Flynn.'",
        "'speaker_10': 'I.'",
        "'speaker_3': 'Gilmore. I. Herndon. I can eat. Lopez. I knew Ortega. Susman. Mr. President.'",
        "'speaker_0': 'I know this was a very intense results. 1212 hours resolution to have been adopted in the best place for finding consideration and do pass. Tonight there will be require a public hearing council of 63 approving one on one Broadway urban redevelopment plan.'"
    ],
    "A bill for an ordinance approving the 101 Broadway Urban Redevelopment Plan and the creation of the 101 Broadway Urban Redevelopment Area and the 101 Broadway Property Tax Increment Area and Sales Tax Increment Area. Approves the 101 Broadway Urban Redevelopment Plan authorizing the creation of an Urban Redevelopment Area and tax increment areas to support the redevelopment of an underutilized and blighted site situated at the northwest corner of 1st Avenue and Broadway in Council District 7. The Committee approved filing this item at its meeting on 5-15-18.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct your comments. Members of Council please refrain from profane and obscene speech. Direct your comments to Members of Council as a whole and refrain from individual personal attacks.'",
        "'speaker_0': 'Council woman are taken. Will you please put 563 on the floor?'",
        "'speaker_5': 'Mr. President, I move. Is that 563 okay, I move that council bill 563 be placed on final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for 563 is open. May we have the staff report? Tracey, I can.'",
        "'speaker_6': 'Good afternoon, Mr. Good. Good evening, Mr. President. Members of City Council. My name is Tracy Huggins. I am the executive director of the Denver Urban Renewal Authority, who is here this evening requesting City Council approval of Council Bill 563 to approve the 1 to 1 Broadway Urban Redevelopment Plan establishing the 1 to 1 Broadway Urban Redevelopment Area'",
        "'speaker_6': 'and the 1 to 1 Broadway sales and property tax increment areas. Here we go. The proposed 21 Broadway urban redevelopment area is comprised of three parcels separated by an alley of approximately 31,500 square feet and is situated at the northwest corner of First Avenue and Broadway in central Denver.'",
        "'speaker_6': 'The site includes the historic First Avenue Hotel, which is designated an historic landmark by the Denver Landmark Preservation Commission and is now eligible to be included on the National Register of Historic Places. The site is located in Council District seven.'",
        "'speaker_6': 'The First Avenue Hotel was designed by Charles Quayle and built by the Fleming brothers in 1906 as a 150 single room occupancy hotel. At the time, it was the largest building in the town of South Denver and the central hub for commerce on South Broadway.'",
        "'speaker_6': 'In 1909, the Fleming Brothers formed the Fleming Brothers Bank, whose headquarters were located at the First Avenue Hotel, along with the headquarters for their construction company. In 1978, the upper floors of the building were condemned for residential occupancy due to due to the lack of electricity and water connections.'",
        "'speaker_6': 'The ground floor of the building was restored in the 1980s and functioned in 2004. The building became vacant and fell into disrepair. The building was purchased in 2008 by a local restauranteur who opened a highly popular restaurant. You may remember this building as the former home of the El Diablo restaurant.'",
        "'speaker_6': 'The upper floors, however, remain vacant due to building safety issues. The city foreclosed on the building in 2013, and the owner filed Chapter 11 bankruptcy. The property was purchased by a new entity at an auction in December of 2015, and that entity plans on redeveloping the site.'",
        "'speaker_6': 'A fundamental consideration in approval of an urban redevelopment plan is the finding that the area is blighted as required by the urban Colorado Urban Renewal Law, to provide evidence supporting counsel's determination that the proposed urban redevelopment area is blighted due to commissioned matrix design group to conduct a condition study.'",
        "'speaker_6': 'That study, dated May 2018, will be filed with the count with the city clerk as part of the record of this public hearing. In summary, the Blight study found the following five factors that constitute blighting conditions slum deteriorated or deteriorating structures unsanitary or unsafe conditions.'",
        "'speaker_6': 'The existence of conditions that endanger life or property by fire or other causes. Buildings that are unsafe are unhealthy for persons to live or work in because of building code violations, dilapidation, deterioration, defective design, physical construction or faulty or inadequate facilities, and the existence of health, safety, safety or welfare factors requiring high levels of municipal services or'",
        "'speaker_6': 'substantial physical, underutilization or vacancy of sites, buildings, or other improvements. These blight factors, individually and collectively impair or arrest the sound growth of the municipality and constitute an economic and social liability and a menace to the public health, safety, morals and welfare of the area.'",
        "'speaker_6': 'The proposed urban redevelopment plan seeks to eliminate blight through the creation of the 101 Broadway urban redevelopment area. The main goals of the Urban Redevelopment Plan are to eliminate blight, renew and improve the character of the area, encourage residential, retail and commercial development.'",
        "'speaker_6': 'Encourage and protect existing development more effectively. Use underutilized land. Encourage land use patterns where pedestrians are safe and welcome. Encourage participation of existing property owners in the redevelopment of their property. Encourage high and moderate density development where appropriate.'",
        "'speaker_6': 'Encourage the re-use of existing buildings, including historic preservation and adaptive reuse. Provide a diverse mix of dense housing options, and improve and provide employment centers near transit. In bringing this urban redevelopment plan forward, DURING has sought to align the goals and objectives of the Urban Redevelopment Plan with the existing city plans for the area, including the Denver'",
        "'speaker_6': 'Comprehensive Plan 2000 Blueprint, Denver and the Baker Neighborhood Plan. In reviewing the Urban Redevelopment Plan, the Denver Planning Board found that the Urban Redevelopment Plan conforms to Plan 2000 and its approved supplements by furthering several citywide objectives, particularly those focused on historic preservation, adaptive reuse, quality infill development, and the provision of affordable housing.'",
        "'speaker_6': 'The one on one Broadway Urban Redevelopment Project includes the restoration of the four story historic landmark building. Combined with the construction of a new five story addition, together they will deliver approximately 106 affordable workforce housing units. The units will be studios and one bedrooms at a rent attainable for persons earning not more than 60% of the area'",
        "'speaker_6': 'median income. In addition to the housing units, the project will deliver approximately 10,000 square feet of ground floor, retail and restaurant space. The project will also include the construction of approximately 20 surface parking spaces. The Urban Redevelopment Plan authorizes TURA to finance projects within the urban redevelopment area by use of tax increment financing.'",
        "'speaker_6': 'The sales and property tax increment area will be coterminous with the boundaries of the urban redevelopment area. During staff has reviewed the development, budget and performance submitted by the developer and believes there is a financial gap of approximately two and a half million dollars.'",
        "'speaker_6': 'This financing gap will be addressed by reimbursing eligible costs through sales and property tax increment generated by the redevelopment of the area. Following redevelopment. The area is anticipated to generate approximately $25,000 per year in net property tax increment that would be generated only by the commercial portion of the property and approximately $290,000 per year in net sales'",
        "'speaker_6': 'tax increment. These incremental revenues will be used to reimburse the developer for eligible expenses over a period not to exceed 25 years. As property tax increment is being contemplated under the plan, state law requires the Urban Renewal Authority to negotiate agreements with the other taxing entities.'",
        "'speaker_6': 'Dora has negotiated these agreements with the other two property taxing entities. First is Denver Public Schools. During has presented the development plan to DPS in order for them to determine what, if any, impact the plan would have on their ability to deliver services to the area.'",
        "'speaker_6': 'The analysis conducted by DPS concluded there would be no material impact and have agreed to allow all available property tax increment generated through the DPS mill levy to be retained by Doura for use in supporting the project. In addition, the other taxing entity is the urban drainage and Flood Control District and has also presented the development plan'",
        "'speaker_6': 'to urban drainage and flood control in order for them to determine what, if any, impact the plan would have on their ability to deliver services to the area. Similar to Denver Public to the Denver Public Schools evaluation, urban drainage has concluded there would be no material impact and have agreed to allow all available property tax increment generated'",
        "'speaker_6': 'through the urban drainage and flood control district mill levy to be retained by Daera for use in supporting the project. In considering the approval of the 1 to 1 Broadway Urban Redevelopment Plan, City Council must make the following legislative findings, as required by the Colorado Urban Renewal Law.'",
        "'speaker_6': 'A that the urban redevelopment area described in the plan is found and declared to be a blighted area as defined in the Colorado Urban Renewal Law. And the conditions of blight constitute an economic and social liability and a menace to the public health, safety, morals or welfare.'",
        "'speaker_6': 'This is a legislative finding by the City Council. Based upon the blight study and other evidence presented to City Council. That the boundaries of the urban redevelopment area have been drawn as narrowly as feasible to accomplish the planning and development objectives of the plan.'",
        "'speaker_6': 'If any individuals or families are displaced from dwelling units as a result of adoption or implementation of the 101 Broadway Urban Redevelopment Plan, a feasible method exists for the relocation of those individuals or families in accordance with the act.'",
        "'speaker_6': 'If business concerns are displaced by the adoption or implementation of the Urban Redevelopment Plan, a feasible method exists for the relocation of those business concerns in accordance with the Act. The project area contains no residents, therefore no individuals or families will be displaced.'",
        "'speaker_6': 'Additionally, due to the vacancy of the project site, no business concerns will be displaced by the project. Written notice of this public hearing has been provided to all property owners, residents and owners of business concerns within the boundaries of the urban redevelopment area.'",
        "'speaker_6': 'In the resolution setting this public hearing. City Council requested Dura to undertake this task. Written notice was mailed first class mail to all known property owners, residents and owners of business concerns in the one and one Broadway urban redevelopment area on May 24th, 2018, at least 30 days prior to this public hearing.'",
        "'speaker_6': 'No more than 120 days have passed since the first public hearing before City Council on the plan. And tonight is the first public hearing before council on this urban redevelopment plan. This is the first consideration of an urban redevelopment plan for this site, and thus the City Council has not previously failed to approve an urban redevelopment plan'",
        "'speaker_6': 'for this site. This is the first consideration by City Council of an Urban Renewal or an urban redevelopment plan for this area. And as such, the requirement to wait at least 24 months since any prior public hearing is inapplicable.'",
        "'speaker_6': 'Conformance with the Denver Comprehensive Plan. On May 2nd, 2018, the Denver Planning Board unanimously found that the Urban Redevelopment Plan conforms with the Denver Comprehensive Plan and it's applicable supplements. A letter to this effect has been submitted as part of the record of this hearing.'",
        "'speaker_6': 'The one on one Broadway urban redevelopment plan will afford maximum opportunity, consistent with the sound needs of Denver as a whole for the rehabilitation or redevelopment of the urban redevelopment area by private enterprise. The project area is owned by Digital Cowboy LLC, who intends to undertake the redevelopment project.'",
        "'speaker_6': 'The Urban Redevelopment Plan does not consist of any area of open land which is to be developed for residential or nonresidential uses or any agricultural land. The Urban Renewal Authority has notified the boards of each taxing entity whose incremental property tax revenue would be allocated under the Urban Redevelopment Plan and have negotiated agreements governing the sharing of'",
        "'speaker_6': 'incremental property tax revenue. The city and county of Denver can adequately finance and agreements are in place to finance any additional city and county of Denver infrastructure and services required to serve development within the 121 Broadway urban redevelopment area for the period during which the incremental property taxes are paid to the authority.'",
        "'speaker_6': 'The plan allows for cooperative agreements between the city and borough to address additional infrastructure requirements should they arise. And finally, no acquisition by eminent domain is authorized by the Urban Redevelopment Plan. In closing, Dura is very pleased to work with the city to bring forward this urban redevelopment plan for this important site.'",
        "'speaker_6': 'The one one Broadway Urban Redevelopment Plan captures many citywide goals, objectives and strategies that are found in the Denver Comprehensive Plan 2000 Blueprint Denver and the Baker Neighborhood Plan, which specifically recommends the historic First Avenue Hotel as a building along the South Broadway corridor that should be preserved and reused.'",
        "'speaker_6': 'And tonight, we ask for your favorable consideration on the ordinance approving this urban redevelopment plan. Thank you.'",
        "'speaker_0': 'Thank you. Excellent. As always, we have three speakers this evening David Zucker, Jesse Paris and Chairman Sekou to come to the front. Mr. Zucker, you're up first. You have 3 minutes.'",
        "'speaker_11': 'Thank you. Mr. President, members of City Council. I'm the applicant, and I'm only here if there are questions that I may be able to answer.'",
        "'speaker_0': 'All right. Thank you. All right, just. You have 3 minutes.'",
        "'speaker_8': 'Good evening, members of Council. My name is Jesse Perez.'",
        "'speaker_4': 'Somewhat black star action movement for Self Defense in Denver. Homeless Sellout. We are actually in favor of this. I just have a few questions. I want to know how many affordable units? What is the ammo percentage and how many people will be housed?'",
        "'speaker_10': 'And then just in case, where would where will the relocation be if there is displacement?'",
        "'speaker_4': 'And what is the timeline for this development? You.'",
        "'speaker_0': 'All right. Thank you. Chairman Sekou, you have 6 minutes.'",
        "'speaker_7': 'My name's Sherman, second lecturer, Action Movement for Self-defense, resident of the city of Denver for 67 years. One raised five points and we are honored to represent poor, working, poor senior citizens, youths and students. I'm neither for or against this thing, but have some questions about the historical context in which we're working on that has set this'",
        "'speaker_7': 'up as a historical designation. And what does that really represent in terms of history? One, the continuation of that history of 1901 to today. To see if there's been any fundamental changes in ideological and cold conducts of the character, of the people, of the resident, which are what this is all about.'",
        "'speaker_7': 'It's just like building we build new to. It was about the people who lived there. And who's going to enjoy the advantage of this as we go about reconstructing bustling city resources and giving developers pretty much free pass?'",
        "'speaker_7': 'Because it is obviously slanted for commercial development and benefit of developers and the rich. And the demographics of the demographics of the area has changed. Was not that exclusive of the neighborhood no more, you know, where it's not no longer a white only neighborhood which refused to allow black people to come into that hotel?'",
        "'speaker_7': 'I know that's a hidden thing nobody want to talk about. But then we look at the spirit of what has been happening. If the spirit has transformed the people and it's been an update because I refuse to support a white only white supremacy development.'",
        "'speaker_7': 'That's okay. But. Fitz. And I don't have a lot of facts. Present company included. Not included. But the history of this whole thing that. This represented here and given us the report. We know they have a history of lying and cannon and bullshit.'",
        "'speaker_7': 'We're not telling the truth. No.'",
        "'speaker_0': 'No, no, no cussing in the in the hearing.'",
        "'speaker_7': 'Oh, I'm sorry. I've got to stop from looking at the movie on my own. And they talk about Robert Redford. But anyway. Five 63.2 and excuse me for the interruption, but speaking truth to power in regards to semantics, that's what it is.'",
        "'speaker_7': 'So here we go. Question mark. Somebody could help him with this. Tell me, what is the median income of the area? How much money do people actually make? In order to afford this day and those that put it within the context of.'",
        "'speaker_7': 'Poor people. And do they fit into that? And as far as 60% of that, am I depending on how that is? Poor people can't get that kind of money. To be affordable in that. So now we've got class and interest needs to be considered because what are we really doing?'",
        "'speaker_7': 'Is this another scheme to build stuff to enhance middle class and upper middle class and forget the poor? And it is for the poor. How are they going to afford it? At 60%? Am I? I mean, talk to me, but perhaps someone could answer that question so I can lay that story to rest.'",
        "'speaker_7': 'So that it doesn't become. I unintended consequence because we refuse to look at it thoroughly. So let's see. I got 2 minutes. Oh, this is it. Here we go. Now, what's so important to this thing is how much money we're going to collect on this increment tax thing.'",
        "'speaker_7': 'We'll do it well. And basically, we're talking about $350,000 per year for 25 years. That's come to a total of approximately $7.8 million over 25 years. So you'd like more money in today's terms. But when we know the value of terms in the United States and the currency is continuing to fall, but now is worth a dollar'",
        "'speaker_7': ', is worth $0.13 in real dollars was going to look at for five years. And what is that money going to do when we put a current value on the money that it ain't worth nothing? So then what? Do we do it now?'",
        "'speaker_7': 'So what we do with it now, we're going to get shown up cheaper dollars over a 25 year period. The dollar ain't never been worth a dollar in one sense. And now a form of dollars to $0.30 for real.'",
        "'speaker_7': 'Do you see what's happening here? So don't buy into the numbers. Look at the economic forecast and how that's working before you decide to sign off on this, because again, that becomes a question of being without being profane bull crap.'",
        "'speaker_7': 'How about that? So if we go. Left leg is in a lucky lapse of capitalist interests. Developers has to be checked, and the question becomes for poor people, when are you going to represent our interests primarily as opposed to class interests?'",
        "'speaker_7': 'And your voters. Who vote for you because you represent their class interests. And with no real clue. No class. Thank you.'",
        "'speaker_0': 'Thank you for your time. All right. This this concludes our comments from the speakers, questions by members of council. Councilman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. The first question for David Zucker, if you wouldn't mind coming back to the microphone. So can you clarify, is 106 the total number of units that are being constructed? That's two.'",
        "'speaker_11': 'Structures. That's correct.'",
        "'speaker_5': 'Okay. And so they will all be affordable. Yes. So by by receiving tax increment financing, do you also have to go through the chapel process to get low income tax credits?'",
        "'speaker_11': 'Well, the two aren't connected, but we are. So we've been awarded a an allocation of 4% credits in October.'",
        "'speaker_5': 'Okay. So you're doing studios in one bedrooms. What is the size of the one bedrooms?'",
        "'speaker_11': 'The one bedrooms are about 450 square feet. Okay.'",
        "'speaker_5': 'And will all of them have kitchens?'",
        "'speaker_11': 'Yes. Okay. Full kitchens.'",
        "'speaker_5': 'Okay. That's good to know. I have a question about the alley that runs between these two structures. Is that being vacated? No. So you're going to keep. That alley as an access to your parking.'",
        "'speaker_11': 'Yes.'",
        "'speaker_5': 'Okay. So so you're doing this as two separate buildings. Will they be connected over the the alley?'",
        "'speaker_11': 'The two buildings are connected on the same property. So there is a parking parcel that that Tracy Huggins mentioned with 28 parking spaces on the east side of that, the original First Avenue Hotel that had 151 units. Those there was an adjacent, approximately 6000 square foot parcel on that parcel will be building additional units.'",
        "'speaker_11': 'So the two buildings, new and historic, will be touching.'",
        "'speaker_5': 'They will be touching. Will they be connected?'",
        "'speaker_11': 'They will be connected.'",
        "'speaker_5': 'They will be connected. They will be touching. But the alley won't be vacated so they'll they'll be touching over the alley.'",
        "'speaker_11': 'No, they're touching adjacent to each other and east of the alley. So if you can imagine a typical Denver city block, that's that's 125 feet deep. The existing building takes up, let's just say 62 and a half feet of that.'",
        "'speaker_11': 'That east west block leaving, allowing room for a new building to be adjacent and connected to the old building. All of which is to the east of the alley.'",
        "'speaker_5': 'Okay. So as I'm looking at the. I think it's the third. I'm looking at Slide 11. It shows the big red line that has the entire property. And so I'm I'm having a hard time envisioning how you do the two buildings and have them touch and not not impact the access.'",
        "'speaker_11': 'Councilman Ortega on the of the can't see the screen is it possible to switch back to the to the.'",
        "'speaker_0': 'Yes, she can. She can.'",
        "'speaker_11': 'I think an easy way to ask that question is what are you doing with the the other parcel that is in the boundary but across the alley. So the. So if. Thank you. In the in the picture behind me.'",
        "'speaker_11': 'Right.'",
        "'speaker_5': 'The I'm looking at.'",
        "'speaker_11': 'The four story building is the historic building. To the to the as you're looking at it to the left of that is a new five story building that will be constructed on the photograph above. You'll see that what it currently occupies, what will be the adjacent building, was a non contributing, non historic building of two stories.'",
        "'speaker_11': 'That building has been demolished, allowing for the the new construction building to be built to the left or to the west of the alley is the the parking where 28 spaces of of public parking will occur.'",
        "'speaker_5': 'Okay. So I want to ask a cool about parking, so thank you for clarifying that. So 20 spaces total. 120 units. 820.'",
        "'speaker_11': '106 units.'",
        "'speaker_5': '306 units. 20 parking spaces. So how do you. Number one, get the financing if they're not all parked. And how do you know that you're going to attract folks that don't need cars?'",
        "'speaker_11': 'Well, this is as one of the most transit rich locations really a first and Broadway. The belly button of of of Denver. So there is better than 15 minute headway time during rush hour as it's 5 minutes between both Broadway and Lincoln.'",
        "'speaker_11': 'There's great bike infrastructure already in place just to the south of this. There's dedicated bike lanes on on Broadway, on the east side, and then a a ten minute walk. And I've made the walk a bunch of times myself to get to the to the Alameda train station, a light rail station.'",
        "'speaker_11': 'So this this is a population where if they're making $35,000 or so, not having to own a car, it really is significant significant to their their ability to have discretionary income. So as we see it and we have we operate other properties in downtown, not none of them today is 100% affordable as this is.'",
        "'speaker_11': 'But we know that as the price declines, so as we get smaller, one bedrooms and studio units, the propensity to own a car is less and less.'",
        "'speaker_5': 'So I'm raising these questions because some of us had an opportunity when we went to Seattle with the Downtown Denver Partnership to tour some of the micro units there.'",
        "'speaker_11': 'I was with you.'",
        "'speaker_5': 'The difference was they didn't have kitchens. They all had a shared kitchen. But what we learned from talking to residents was many of them came with their calves and they were challenged to figure out where to park their cars.'",
        "'speaker_5': 'And and I know that it's a chicken and an egg situation about, you know, if we build them with less units, will they not come with cars? Do your lenders finance even though you know you can't park all your units?'",
        "'speaker_5': 'I mean, there are some of those challenges. And I know for example, in Council President Brooks's district where along the Brighton Boulevard corner where we've seen a lot of new development that has gone in there and it's close to a TOD Station.'",
        "'speaker_5': 'You see cars parked all up and down Arkin's court on both sides of the road. And when that road gets vacated, I don't know where those people are going to park their cars. So, you know, on one hand, we need to have enough parking spaces for people coming into these units because it exacerbates the parking challenges in'",
        "'speaker_5': 'the neighborhood and it contributes obviously to the congestion as as we keep building, you know, more and more dense projects in in the city. So my question was just about how how you. Secure the financing. Does that does the lender require you to park more.'",
        "'speaker_11': 'Of the unit? That was a well-crafted question and good background. Let me, if I may, just to give fullness to the answer. As you may have picked up in the Seattle examples, and I toured one of those two of those with you.'",
        "'speaker_11': 'Both of them were more than 50% master leased to Amazon employees. The Amazon employees earn, as I found out, about $125,000. Those are people that have cars. There's also an inverse relationship, obviously, between those and you probably know this between those of higher incomes and their propensity to use mass transportation.'",
        "'speaker_11': 'There's a direct relationship between those of lesser incomes and the propensity to use transportation. So we're correlated in the right way if we're going to have fewer parking spaces. And then there's simply the virtue. What virtue do we want and do we want the virtue of affordable housing?'",
        "'speaker_11': 'And I'll answer your question directly by just these rhetorical questions as well. So what's the greater virtue? Is the greater virtue being able to deliver these affordable units, or is it to deliver more parking? Building a structure would have been truly prohibitively expensive, with parking spaces costing perhaps 50 or $60,000.'",
        "'speaker_11': 'And we analyzed that at length. So to us, the virtue wasn't building 60 apartments and 60 parking spaces. It was to build more affordable units and fewer parking spaces. Answer your question directly. Typically with with a lender, as long as we are delivering at the zoning minimum and the zoning minimum because of the historic structure and call'",
        "'speaker_11': 'it being grandfathered in for the existing residential, the requirement was only 12 parking spaces, so were almost twice as much.'",
        "'speaker_5': 'Okay. And David, just one last question. Can you tell us what the price point of the with the anticipated price point would be for the studios and then for also the one bedroom.'",
        "'speaker_11': 'Studios will be in the range of $945 and a one bedroom will be about 1025. So eligible to those that are earning in the range of 35 to $42000 annually.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Espinosa.'",
        "'speaker_11': 'And I apologize because you're going to repeat the answers, but they're just brief. What was the target? Amazon target am i is 60% below. So and what did you say was going to the future of that? The adjacent the parcels to the east of I mean, to the west of the the alley.'",
        "'speaker_11': 'Again, the parcel is parking surface parking, including the old Buffalo Wild Wings place. So again, the the, the house with the wraparound commercial space that the prior owner had demolished that. Okay. I didn't realize until that picture that it was one of those Franken house things.'",
        "'speaker_11': 'Is the project contingent on other subsidies in order to achieve this affordability? It is. The Office of Economic Development has been great to work with and is delivering a loan that's committed at this point of four two and a half million dollars.'",
        "'speaker_11': 'So the combination of the tiff and that loan is sufficient to hit this, achieve the support in addition to the 4% tax credit, the historic state, the historic federal tax credit, as well as a state historic tax credit.'",
        "'speaker_11': 'So this is I think that there as well as a an owner carryback note in the about amount of about four and a half million dollars. So it's this is a layered financing. Yeah. And I'm not the infill that you're proposing is sort of consistent with how our downtown used to be where it and it had a'",
        "'speaker_11': 'even when we even well when cars were around so I'm not terribly concerned about that scale and the influx of cars because you're right, it.'",
        "'speaker_0': 'Is an area that.'",
        "'speaker_11': 'Is eminently walkable, bikeable transit options in abundance here. And there's grocery there, drugstore, drugstore across the street. There's entertainment all over that place. There's groceries about five blocks to the south. You know, it is a, you know, qualify easily for your subsidies and it will serve the population that you're you're targeting.'",
        "'speaker_11': 'So, yeah, I just. Thanks for the answers, though. Sure. As a as if if I may. And give one piece of information which which Councilman Ortega and Councilman Espinosa is a manifestation of the amount of demand where we we calculated that south of Colfax, north of I-25.'",
        "'speaker_11': 'Four blocks on either side. We projected perhaps 5000 individuals that could income qualify that currently work but but commute into the community now. So in addition the manifestation of the demand is that after only two weeks of a banner on the side of the building, we have 51.'",
        "'speaker_11': '52 I won't say income qualified, but income tested qualified residents on a waitlist. So there's a lot of demand. And it's gratifying to know that despite the fact that we're more than a year away, that residents are there.'",
        "'speaker_11': 'Ready. Yeah, I appreciate that that that additional information because that is I appreciate that this somehow being your business model because and I appreciate Tracy going through this process because as you know, if you took down the land in 2013.'",
        "'speaker_11': 'Correct, 15, 2015, there is a mention in this about 2013, the the the property value. This would be eminently developable. Would it be. It would is it's my opinion that this would be is in is is correct. It would be eminently developable as a market rate project.'",
        "'speaker_11': 'Correct? Yeah. Thanks for asking. That I think was actually December of 2016, the Zocalo and fortunately the the the family trust that that's acquired this with us. We could have been under construction and leased a long time ago had we not chose to do and had this investor and partner not made the the decision to have greater'",
        "'speaker_11': 'community impact and first bank our lender as well. This is not an easy project for any of us that are that are involved in this. Had it been a market rate project, we would have been doing a lot better financially and probably would have been under well under construction at this point.'",
        "'speaker_11': 'So the Zocalo finds that these if we can have affordability and deliver affordability in in our projects in River North were well we're one of the first projects that we'll voluntarily submit to affordability to get a an increase of height and we hope and Solon Lake to do a project that's 50% affordable 50% market rate so as'",
        "'speaker_11': 'we can we we do and for this community impact for these buildings that will be in the community for 100 years, it is important for us to continue that spirit of community impact. So it's been boarded since 2013 and that's really too long for such a prime corner.'",
        "'speaker_11': 'Thanks.'",
        "'speaker_0': 'All right. Thank you. Councilman Espinosa, I don't know if you heard about that increase of height over there, but. Okay, Councilman, new statement.'",
        "'speaker_8': 'I just want to thank you for your leadership and dedication in housing here in Denver, especially the affordable housing. You've been a real inspiration to all of us and a model for other developers for affordable housing. So I really appreciate and I know this project will be great.'",
        "'speaker_11': 'Thank you. Thank you.'",
        "'speaker_0': 'All right.'",
        "'speaker_5': 'Councilman, taking one last very quick question, David. Will you be able to take Section eight for anybody that might have a portable voucher?'",
        "'speaker_11': 'We'll be talking to the Denver Housing Authority. So I don't we haven't had a specific discussion about it, but that discussion, I'm sure, will be had. Okay.'",
        "'speaker_0': 'Thank you. Great. Okay. This concludes our questions and closes the public hearing. Four 563 Now comments by members of Council Council President Pro Tem.'",
        "'speaker_8': 'Thank you, Mr. President. This is a beautiful historic structure, a landmark in the community that has sat empty and has been falling apart. And here we have an opportunity to save the structure, to house people when we have a crisis for housing and housed them where they work.'",
        "'speaker_8': 'We talked earlier today with the Bike to Work and Bike Week this week about ways that we can ease congestion. And there is no easier way to do that than to provide opportunities for people to live where they work, especially on a corridor like Broadway.'",
        "'speaker_8': 'That is a major corridor for people who do not live anywhere close to where they work. This site is by rail. It's on the highest level of service, bus service that Denver has. The other day, when I flew back from the airport late, late at night, the trains had stopped running when I got to Union Station.'",
        "'speaker_8': 'But the zero line on Broadway had not. And that was how I got home. So this is our highest level of service bus. There is going to there is a protected bike lane on part of that, but funded by the voters in the bond, that protected bike lane will be a critical part of our infrastructure connecting to'",
        "'speaker_8': 'the Cherry Creek superhighway. For bikes, it is right by a grocery store and right by every amenity that you could possibly want to live by. And we need places for all of the people who work on this corridor to live and for all the people living in downtown or working in downtown to live.'",
        "'speaker_8': 'And this is it, 106 units, 60% am I workforce housing? And, you know, I think one of the other things to point out about the cars is this is the the the example that we talk about when we talk about two possible strategies is you have all of the transportation networks there.'",
        "'speaker_8': 'You have a parking plan in place. There is not a pool part of what sinks some of these projects, what we're experiencing near something like the country club towers that are adding hundreds of new people and have tons of parking.'",
        "'speaker_8': 'Nobody's using it because there's a sea of free parking there. There isn't. Here we have a parking plan in place that is permitted or metered. And so there's a perfect. Perfect example of all of the things that we talk about coming all together.'",
        "'speaker_8': 'And on top of that, it's within walking distance of our rainbow crosswalk, one of the most inclusive community now in Denver with that on the street. So I'm very excited about this. I want to thank you, Tracy, for all the work putting this together, your very thorough presentation and going through why this clearly qualifies for the program'",
        "'speaker_8': '. And David, for for you and all your work in putting something like this together here, I think is a perfect example. I wish we could do this 20 more times tonight. I'd sit here till 4:00 in the morning if we can do that.'",
        "'speaker_8': 'So I'm very excited about it. Thank you for all the work and everything that's taken to put a project like this together, all the different pieces to make it really work. I would encourage all my colleagues to please vote yes on this.'",
        "'speaker_8': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. The other confluence and our city of transportation and the river is such a beautiful place. Councilwoman Ortega.'",
        "'speaker_5': 'I just want to make a few brief comments. First, I want to thank Tracy and David for your efforts. We know that to do affordable housing, it takes multiple layers of financing. And thank you for walking through that with us so that we could understand the layers that this project entails.'",
        "'speaker_5': 'This is part of my old council district, District nine, in the Baker neighborhood, and I'm very familiar with the property. And yes, it has been a challenge property for a long time. And so I'm excited to see this particular use of it moving forward and it will absolutely meet a need in this city and for folks in'",
        "'speaker_5': 'the neighborhood, as you indicated. So I will be supporting this tonight and just thanks for your efforts. And I know you've done your homework with the Baker neighborhood as well, which is a very active community. So the fact that they're not here says a lot about the work you've done with them.'",
        "'speaker_5': 'So thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Ortega. Hey, we're approving a tax increment area, and I think this needs to be said. States and cities are doing away with tax increment financing all over this country. And I think we're still using viable ways for social good and social impact to use TIFF.'",
        "'speaker_0': 'And I think that's incredibly important and so I'm really excited to see this come to fruition. I think the developer, Dave, would tell you without tax increment financing wouldn't have been possible. And so I'm glad we could use this tool effectively for our residents in the city of Denver.'",
        "'speaker_0': 'Seeing no other speakers. Madam Secretary, roll call.'",
        "'speaker_3': 'Clark. Hi. Espinosa. Hi, Flynn. Hi, Gilmore. Herndon. I can eat. Lopez. I knew Ortega. Sussman. I black. Mr. President, I. Clark. Sorry. No, wait. Let me start with you.'",
        "'speaker_1': 'These guys go to prison.'",
        "'speaker_0': 'All right. There we go. We got 11. All right. Madam Secretary, please close the voting, announce the results.'",
        "'speaker_3': '11 eyes.'",
        "'speaker_0': '11 eyes counts for five. Six three has passed council on Ortega. Will you please? Oh, I'm sorry. Congratulations. Councilman Ortega, will you please. But don't we have to do four, five, 64? Yes. Yeah. Will you please put.'",
        "'speaker_5': 'I thought we called it out.'"
    ]
}