{
    "A resolution approving a proposed Contract between the City and County of Denver and Flagship Airport Services, Inc. concerning janitorial services at Denver International Airport. Approves a contract with Flagship Airport Services Inc. for $182,986,361.33 and for three years, with two one-year options to extend, for janitorial services at the main terminal and concourses at Denver International Airport (201953023). The last regularly scheduled Council meeting within the 30-day review period is on 1-19-21. The Committee approved filing this item at its meeting on 12-16-20.": [
        "'speaker_1': 'Yes, Madam President, I move the resolution 20 dash 1530 be adopted so I can thank you.'",
        "'speaker_0': 'It's been moved. And we've got the second from Councilman Hines. Councilmember Flynn. Your motion to postpone.'",
        "'speaker_4': 'Yes. Thank you, Madam President. I move that consideration of council resolution 20 dash 1530 be postponed to Tuesday, January 19, 2021.'",
        "'speaker_0': 'All right. Thank you. Comments by members of Council Councilmember Flynn.'",
        "'speaker_4': 'Thank you, Madam President. Airport staff contacted me shortly before the meeting and asked that this bill be delayed to that date. And they asked me to read a brief statement explaining why. So this is from DIA or Dan?'",
        "'speaker_4': 'I still call it DIA. Dan celebrates individuality and the uplifting of all races, ethnicities, national origins, ages, abilities, religions and LGBTQ A-plus plus communities. We support access, inclusion, equity and diversity and have worked hard to reflect that in the contracting ad.'",
        "'speaker_4': 'Then we understand that this contract has raised concerns in the community and wish to take time to listen to their concerns and to discuss the intent of this contract and its novel approach to not just including minority and women owned businesses in contracts, but helping them to succeed.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn. Madam Secretary, roll call on the postponement.'",
        "'speaker_1': 'When I.'",
        "'speaker_2': 'Herndon. I Hines.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'All.'",
        "'speaker_2': 'You need.'",
        "'speaker_0': 'I think.'",
        "'speaker_2': 'Ortega.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Sandoval. I. Sawyer.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Torres, I. Black. I see tobacco. I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 eyes. Consideration of Council Resolution 20 Dash 1530 has been postponed to Tuesday, January 19. The next item up is Council Resolution 20, Dash 1472. Councilwoman CdeBaca, please go ahead with your questions on 1472.'",
        "'speaker_3': 'Thank you, Madam President. We actually got the answers to these questions right before. Thank you.'",
        "'speaker_0': 'Okay. All right. Thank you. The next item up, did you get your questions answered on 1531 as well?'",
        "'speaker_3': 'No, that one. I still have questions on, so. Okay.'",
        "'speaker_0': 'All right. Great. If you wouldn't mind going ahead with your questions on 1531, then.'",
        "'speaker_3': 'Yes. Thank you very much. I believe Laura Walker's on the call and I had a couple of follow up questions from their responses. I was curious about this contract because it seems like this company has had the contract for quite a while, and we were told that they're the only vendor who can provide this service.'",
        "'speaker_3': 'And I'm wondering when the last time it was that it went out to bid. And what is the challenge? Why aren't other vendors able to to provide this service?'",
        "'speaker_0': 'All right. Thank you, Councilwoman and I on my seat here I have Joe. Separate. And I see we've got Laura walked her up as well. So whoever wants to answer that question.'",
        "'speaker_3': 'Good afternoon, members of Council. I will let us take both Josep Prieto from Technology Services, take the lead on answering those questions. And I believe we also have Steve Hahn on as well.'",
        "'speaker_1': 'Yes. This is Steve on. I'm on Joe. I'm happy to go. The question is, when was it last sent out to bid? This was a contract it was entered into in 2008. And I spoke with some people from technology services and we don't have couldn't find the records of the RFP from 2008 so.'",
        "'speaker_1': 'We can't tell you whether it did or didn't go out for competitive process at that time. But in the resolution request, it was designated as noncompetitive.'",
        "'speaker_3': 'And why is that?'",
        "'speaker_1': 'Why is what?'",
        "'speaker_3': 'Why is it noncompetitive?'",
        "'speaker_1': 'So it's. It's. Was marked as noncompetitive, I assume. And Joe, you might want to chime in because because records couldn't be found from a competitive process in 2008. Joe, can you confirm that? Yeah. I looked into al fresco, I believe, for notes and comments when the original contract was initiated.'",
        "'speaker_1': 'And I believe that it was noted as a. Professional preference or a sole source. So that's the information I passed along in the resolution request. Sexual preference or a sole source by Denver Police Department.'",
        "'speaker_3': 'And can you explain to the public watching what that means?'",
        "'speaker_1': 'That means in lieu of doing a solicitation process, the agency's subject matter experts have deemed a certain product to. Meet all the needs. That other products can't meet. I guess in essence, it's it's they deemed it as the product that meets all the needs that other other products cannot meet.'",
        "'speaker_3': 'And what are those needs exactly? What does this system do? So this system is explorer? Yeah, this is our records management system. So this is our system in which the police uses. It is in our vehicles. It is in our.'",
        "'speaker_3': 'On our iPhones. And it keeps track of all the all of our criminal records. It integrates to all of our our.'",
        "'speaker_1': 'It's.'",
        "'speaker_3': 'Out of our other criminal justice tech technologies. It integrates with our jail system. It integrates in with our court system. So it tracks all of our our police records. And so do other cities use this company or did this company come into existence just for us?'",
        "'speaker_3': 'Other cities do use first term. I don't know which which ones do use it. And also the Mayor Hancock, he added in in zero eight and 2012 regarding the competitive selection policy. So back what happened in 2008, I'm not sure what did happen in 2008 regarding the competitive selection process.'",
        "'speaker_3': 'And are they a local business? Joe, do you know where they're located?'",
        "'speaker_1': 'I do not know where they're located, but I certainly can find out and let you know.'",
        "'speaker_3': 'And so is there a plan for this to go out to bid next time, or are we keeping it a sole source contract? And what what prevents us from finding out if other people will provide this service? It's my understanding that this amendment is for three years.'",
        "'speaker_3': 'So through 2023 and we are currently in the process of looking at public safety technology consultants and just looking at taking a look at our CAD system or our system and just looking at how all of these systems integrate.'",
        "'speaker_3': 'So we'll know more and you know, in the future regarding.'",
        "'speaker_1': 'What we want to do, regarding.'",
        "'speaker_3': 'The future of arms and CAD public safety technologies.'",
        "'speaker_1': 'Every time we do an amendment, we ask those questions whether this should be built out. If there are other competitors on the market. And I believe if this information is in the resolution request that I submitted, we do take it.'",
        "'speaker_1': 'We do analyze the market. And there are other products on the market. But then we get into the expense it would cost to rebid and possibly go with a new vendor. And that gets into implementation services, data migration, training, etc., etc..'",
        "'speaker_1': 'So that that is analyzed every time we do an amendment and taken into consideration before we just extend the current contract.'",
        "'speaker_3': 'And so real quick on this, because it came up with another safety database. Is this a data system that the independent monitor has default access to? No. The independent monitor does not have access. I don't believe the independent monitor has access to this to the system.'",
        "'speaker_3': 'What you're thinking of is the evidence scheme system, which we're working through. No, I'm actually just thinking generally of all of the systems an independent monitor should probably have access to. And I'm wondering why why an independent monitor wouldn't have access to police records.'",
        "'speaker_3': 'These are all of the criminal justice records that I can definitely look into that question and get back to. Thank you very much. That's it from my questions. Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. Next up, we have Councilman Hines.'",
        "'speaker_1': 'Thank you, Madam President. The. We've gotten some email about. This money is not coming from the budget. I think this was also a public comment not coming from the Denver Police Department budget. We vote on every contract that's over a half million dollars, regardless where it's budgeted.'",
        "'speaker_1': 'Is this in the Denver Police Department or in the Department of Safety 2021 budget?'",
        "'speaker_3': 'This contract is currently budgeted within the 2021 budget of technology services. And just after that I can speak more to that.'",
        "'speaker_1': 'I echo exactly what you just said. This is not an expansion to the tax budget. It is a current, currently budgeted maintenance payment. And it has always been since 2008 in the technology services budget. I don't know. Off the top of my head, I can find that out for you.'",
        "'speaker_1': 'I guess that that might be a tough question, but let's say in 2020, was it a decade in technology services at the time? It's not like we moved it out of the police department. If it wasn't in safety in 2020 and now in technology services in 2021, I guess is definitely my question.'",
        "'speaker_3': 'That's correct. It was never in the police department for.'",
        "'speaker_1': 'To my knowledge.'",
        "'speaker_3': 'So definitely not in 2020.'",
        "'speaker_1': 'And I don't I don't know the the authenticity of of Wikipedia. But they say that verse a term is a is a company based in Canada and they've got several different police departments on Wikipedia article. So I would I would certainly encourage that we have shorter periods of time between contracts like a 12 year no bid contract'",
        "'speaker_1': '. That seems it seems like a long time. So I would encourage safety and technology services to to look at this before it comes up, before council again, so that we can see if we can find a U.S. or even better local vendor.'",
        "'speaker_1': 'And and and we can come up with a more a more detailed explanation as to why other vendors don't don't fit our needs. Thank you. Madam President.'",
        "'speaker_0': 'Thank you, Councilman Hines. All right. So in other questions on that resolution, we're going to move forward. The next item up is council resolution 20, dash 1482. And thanks, Joe and Laura for helping out with the previous one.'",
        "'speaker_0': 'But we have Councilwoman Ortega. Please go ahead with your comments on 20 Dash 1482.'",
        "'speaker_5': 'Thank you, Madam President. Rather than calling out all of the Oracle contracts, I just picked one to make some comments about. So, first of all, I want to just commend Dottie and I want to thank Jason Gallardo and some other Dottie staff who met with me last week to walk through the changes that they have made to'",
        "'speaker_5': 'the contracting process and to the transparency of providing quarterly reports and information on these on call contracts. As you know, if there are no EMB goals attached to any of them, we approve them on the front end and we never know what happened to them.'",
        "'speaker_5': 'You know how much they utilized, you know, just all those details. And so these quarterly reports will have a lot more information. We talked about some things that are missing in the reports that they're going to work on for the next quarterly report that we do get.'",
        "'speaker_5': 'But I think this is a huge. In addressing equity. And as you know, with the mayor now mandating every agency to incorporate equity into their work. This is a huge part of unbundling contracts, making sure that we are spreading the wealth with the vast amount of money that comes through this city for contracting and ensures that we'",
        "'speaker_5': 'are working with local businesses for this this work to be done. That's basically it. I mean, I could get into a lot of other things. But the bottom line is, is that we've made some pretty huge steps in correcting some.'",
        "'speaker_5': 'Deficiencies in the transparency of us doing our contracts. And you all know that I hate to call contracts, but I know this is a way and just for the public that's listening. You know, we've got 45 on call contracts tonight on our agenda.'",
        "'speaker_5': 'But what happens is there's like a mini bid process. So they're not all for the same category, the same type of work. And when we have a specific project, they'll be like a mini bid process that will be done to then figure out of the, say, ten people in this one category that got approved, they'll then define'",
        "'speaker_5': 'the scope of work on the project and then select one of those ten companies that would then do the work. And part of the transparency, that's important. Ensure that we don't keep using the same companies over. And those same companies keep using the same subcontractors over and over.'",
        "'speaker_5': 'But that. More of our local businesses into the mix and that we're far more successful in spreading that wealth and making sure that we are. Working with everybody in our community. So thank you, Madam President. Those those are my comments on this.'",
        "'speaker_5': 'I don't intend to call it out for a vote, but just wanted to make those statements. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Ortega. We have Councilman Sawyer up next.'",
        "'speaker_3': 'Thanks, Madam President. I think, you know, many people know I agree with Councilwoman Ortega's statements. I absolutely cannot stand the giant blank check contracts that have come through and vote no on them every time. It really concerned me.'",
        "'speaker_3': 'And just because from a transparency and accountability standpoint, we don't know where that money goes. We get quarterly reports on them and that's great. And I very much appreciate that. But, you know, it's it's very hard to track.'",
        "'speaker_3': 'It's very hard to kind of to keep track of where that money is going. And so this is a lot of extra work on the part of our staff, and it's a lot of extra work on the part of the Dismas staff that pulled this together for them.'",
        "'speaker_3': 'So I really want to thank Adrina and her team for the work that they did, as well as Jason and Ulysse and his team. They came together and and really revamped this entire process for us and listened to our feedback and our concerns and redid this entire thing.'",
        "'speaker_3': 'And I just wanted to give them a huge shout out and say thank you, because in terms of transparency and accountability, they made huge strides forward with these contracts. So thank you all very much. Thanks, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_4': 'Thank you, Madam President. I would just add quickly, I want to commend Councilwoman Ortega as she has been working on this for a long time. That's been a subject of interest to me as well. But I just am traveling in her slipstream.'",
        "'speaker_4': 'She's really taken the lead on it. And I want to recognize that as Councilwoman Sonya just did the work of public works or Dotty in improving the reporting. And I just wanted to point out to members that DIA is going through the same process, and I've been working with them to make similar reports on their own calls'",
        "'speaker_4': 'so that there will be much more information and data and transparency available to all of us.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn, and appreciate the work of Dottie and Jason and their entire team. It's good to see us evolve with these contracts. So see in other questions. The next item up is Council Bill 20 1524. Councilwoman CdeBaca, go ahead with your questions.'",
        "'speaker_3': 'Thank you, Madam President. Is there anybody here who can speak to this? What this is actually intended to collect donations for or what type of donations we're anticipating?'",
        "'speaker_0': 'Yes. We have Rachel Barden and then Tristan Sanders on. So I'll let them choose.'",
        "'speaker_3': 'I'll defer to Tristan since he's the subject matter expert on this. Thank you, Tristan.'",
        "'speaker_1': 'Yeah. I can't wait to get back to. Thanks for your question. So my name is Tristan Sanders. I'm a public health manager in the Community Behavioral Health Division here. And the specific reason that this came about is actually related to a lot of work that we do with grants and we work in the communities providing emergency food'",
        "'speaker_1': 'assistance, connecting food pantries to different resources. And through our connections with other organizations, like whether they're funders or quasi state governmental entity entities, they often are looking to support the work that we're already doing in communities through the form of donations.'",
        "'speaker_1': 'And until about as long as I've been here, we've not had a mechanism to accept that. And in talking with the Division of Finance, this was a way to do that. So we would actually be able to get funds from organizations or funders that we could then put towards communities that we're supporting through a variety of our'",
        "'speaker_1': 'work.'",
        "'speaker_3': 'And how will those donations be communicated to the general public? How will we know who's donating and what it's for?'",
        "'speaker_1': 'Yeah. So we bother maybe a couple of ways, actually. First, we don't solicit any of these donations. These are not like, you know, we're we're not out asking for these donations. Generally, it is through committees and like community based coalitions where these other organizations come and say, how can we support this effort?'",
        "'speaker_1': 'And short of being able to give donations directly to community members, they often are looking for an entity that can accept those donations and then put it back into communities. So one way is through all of our reporting with the projects that we get, these donations for which we are required to do specifically for the grants that'",
        "'speaker_1': 'we receive, we have to report all of our grant activities and all of our other money that may come in supporting those activities. And then second, having this actually in its own revenue account, you know, at any time, this could obviously be audited or looked at and we could go through line by line what revenue came in'",
        "'speaker_1': 'through donations and then exactly how it was spent, which, again, we've not been able to do previously.'",
        "'speaker_3': 'Thank you for that. And our office would like to request that when donations come in, it be reported to us what they're coming in, who they're coming in from and what it's coming coming in for. I could easily see this becoming a place where, you know, our friends down at the Denver Downtown Denver Partnership donate to ramp'",
        "'speaker_3': 'up some of the cleanups, the sweeps. And I don't want to see it become that. And so I want to make sure that we're being very careful about who we are accepting donations from and what it is to do.'",
        "'speaker_3': 'And just one would like to make sure that our office is on notice about that. Thank you. That's it for my questions on this one.'"
    ],
    "A bill for an ordinance designating certain properties as being required for public use and authorizing use and acquisition thereof by negotiation or through condemnation proceedings of fee simple, easement and other interests, including any rights and interests related or appurtenant to properties designated as needed for the Sand Creek Project. Grants the authority to acquire through negotiated purchase or condemnation any property interest as needed in support the Sand Creek Project, including easement interests, access rights, improvements, buildings, fixtures, licenses, permits and other appurtenances, for the portion of the vacated North Ulster Street right of way located at 8101 E. 40th Avenue in Council District 8. The Committee approved filing this item at its meeting on 12-15-20.": [
        "'speaker_0': 'All right. Thank you, Councilman. And thank you, Kristen, for joining us tonight. The next item up is Council Bill 20, Dash 1534. Councilmember Herndon, will you please put council bill 20, Dash 1534 on the floor for publication?'",
        "'speaker_1': 'Yes, Madam President. I move the council bill to 0-153 for be ordered published. Okay.'",
        "'speaker_0': 'Thank you. It has been moved and seconded by Councilman Hines. Questions or comments by members of council. Council members say the.'",
        "'speaker_3': 'Thank you, Madam President. I am curious about how this one is different than the eminent domain authorization that we passed in July and discussed at length for the Sand Creek Project. Is Lisa Lumley able to or somebody from real estate able to explain the difference between this eminent domain authorization?'",
        "'speaker_5': 'Evening Council. Councilwoman. Yes. So what, you approved the the larger land acquisition ordinance back at the end of July. As we were moving through the process with our appraisals, what we realized is there was an error in the legal description.'",
        "'speaker_5': 'And the error is that as we had started this project a couple of years ago, it overlapped with the vacation of Ulster, which runs adjacent to this property. And so this land acquisition ordinance is a cleanup, if you will, that will include the approximately 15 feet that runs alongside this property.'",
        "'speaker_5': 'It would it completes the trail. Otherwise, it would leave a gap in the trail, but it also would create a weird leftover remnant for the landowner right now, because it means that we would be the Ulster is the westernmost part of his parcel.'",
        "'speaker_5': 'And then what you did approve is further east. And so this is the 15 foot gap.'",
        "'speaker_3': 'Thank you very much for that. And. Madam President, I would like a separate vote on this one. I did not support the the vote in July and would like to go on record as not supporting this second piece.'",
        "'speaker_0': 'All right. Perfect. Thank you, Councilwoman. Seen no other? I'm sorry, Councilman Hines.'",
        "'speaker_1': 'But thank you, Madam President. Just a quick comment. I did not support the original vote, but there's no need to leave an owner with 15 feet of space. So I will support this one. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Hines. So, you know their hands raised. Madam Secretary, roll call, please.'",
        "'speaker_2': 'CDEBACA No. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I. Hi. Hi. Cashman i.'",
        "'speaker_2': 'Kimmage.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Ortega.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Sandoval, I. Sawyer.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Torres, I.'",
        "'speaker_3': 'Black eye.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': 'When they 12 eyes.'",
        "'speaker_0': 'One day, 12 eyes council bill 20 dash 1534 has been ordered published. The next item up is Council Bill 20, Dash 1554 Councilwoman Sade Ibaka. Please go ahead with your questions on 20 Dash 1554.'",
        "'speaker_3': 'Thank you, Madam President. This one is a little bit confusing to me, and I just had some questions about if we're floating a check essentially for dollars we expect from HUD later in the year. And if it is, where is the five year action plan for the Community Development BLOCK grant dollars mentioned in the bill request?'",
        "'speaker_3': 'I couldn't find it in any emails or on the granicus posting or on on our Denver Gov website. And I know we spend CDBG dollars in multiple city departments. And so I'm just wondering where to find this information and what we're doing here.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. I think Rachel Barden is going to take it first.'",
        "'speaker_3': 'I, I knew myself, but I think that I'm not sure if there's anyone from Dito who can speak specifically to the five year action plan and provide that to you. But that is they should have that available to send via email if it is not posted in granicus.'",
        "'speaker_3': 'To answer your question. Go ahead. Is it public on our Denver Gov website or will it be at any point? That is a good question and I don't know if our friends in are available at school.'",
        "'speaker_0': 'I think we have Matt. Khan's. Okay. Well, there you go.'",
        "'speaker_1': 'Yeah. Hi. Thank you. And I may call on Rachel King. She's on here and actually oversees our action plan. We do have an annual action plan. That is, it actually has either a five day or more public comment period.'",
        "'speaker_1': 'We usually do not do the annual action plan unless, one, there is a substantial amendment, substantial amendment to the action plan so that when we received the covered CDBG dollars, we had to do another public annual action plan with that.'",
        "'speaker_1': 'But usually the action plan is not sorry, it's not made public until March or so because we have to wait until we receive the actual dollars and the award that we're going to get from the federal government. And usually that number is not quantified and solidified until February or March.'",
        "'speaker_1': 'And then we will go to the public public comment period with that action plan every year. What you're referencing, I believe, Councilwoman, is when we mentioned the five year action plan for this dollar amount we were talking about annually, over the past five years, we've received between six and $7 million.'",
        "'speaker_1': 'And so we don't see that this two and a half million dollars. We were really talking from a risk perspective. We don't see advancing two and a half million dollars as being a substantial risk to the city, because every year for the past five years, we typically have received close to $7 million.'",
        "'speaker_1': 'And that's what what we are referencing when we talked about the five year sorry, the five year plan on that. But if Rachel Zane, I'm sure she can talk about the action plan a little bit more. Sorry, Rachel King with Dito.'",
        "'speaker_3': 'So just before Rachel respond to that. So if we haven't approved the plan on how to spend the dollars, what are we advancing the dollars for in this instance?'",
        "'speaker_1': 'Sure. So we run a January through December program here at DITO for our CDBG, HUD dollars and the action plan, which unfortunately is not really established until late Q1. Early Q2 covers January through December, but we also receive program income every year from our loan portfolio and we do have some carryover dollars some years.'",
        "'speaker_1': 'And so this money just really allows us, for example, the sofa that just went out on both host side and our No. $5 that we use in our Nest neighborhood team that was close to one and a half million dollars total.'",
        "'speaker_1': 'I believe that we typically need to front that money when we encumber that full amount. So if we have a $100,000 contract, we need to encumber that $100,000, which will last for the full year. But we don't typically even receive money from HUD until July, sometimes, sometimes later, sometimes earlier.'",
        "'speaker_1': 'So it really this advance really helps us cover some of those admin costs, some of the contracts that we typically do toward the end of the year to start on January 1st. Now we do have some carryover dollars.'",
        "'speaker_1': 'But but, you know, it doesn't always work out from a timing perspective. And sometimes we have a lot of money that might carryover and sometimes we have very little because of the power building acquisition and some other acquisitions that we did as well is because of the limited program income we've been receiving due to COVID.'",
        "'speaker_1': 'We have a loan deferral program and some other items where businesses just aren't able to pay off their loans as often and frequency frequently as they typically do. We just don't have as much carryover funds this year, so we're asking for the advancement of two and a half million to really help us cover the first six months'",
        "'speaker_3': '. And will we get will we get some kind of report on what we spend the advance on and which departments spends because you guys spend out of post and correct.'",
        "'speaker_1': 'Correct. Yeah, it really we it really depends on the timing and what projects go forward. We also sometimes, as you mention, we might have, you know, programs in host and and coming out of Dito that we start the contracting process in as we need to have the money available but the project may or may not even exist'",
        "'speaker_1': 'or be finalized with the contract until later in the year. But we do need to make sure that we have some of those funds intact, especially on the construction lines or even the service ones that take a full year.'",
        "'speaker_1': 'So the two and a half million, I mean, I guess we could do a we typically don't from an advance standpoint, don't know exactly what projects that two and a half million covers because we pull the money together from multiple years or multiple, multiple items.'",
        "'speaker_1': 'Right. So if we if we have a large acquisition, we might use some of the two and a half million we might use some of the carryover money from the year before. We look at it more of a first in first out approach.'",
        "'speaker_1': 'But but we could easily, you know, start start to develop a report that, you know, if we have two and a half million dollars worth of projects in the first six months, likely those would be the ones that that this advance is covering.'",
        "'speaker_3': 'Got it. And thank you for that. And I, I just urge my colleagues to hear what was said and to acknowledge that, you know, the city is doing exactly what small businesses and nonprofits in the community have been asking the city to be able to do.'",
        "'speaker_3': 'It's very difficult to deliver on grants when you have to front the money or deliver on services when you have to front the money or where you have to wait until a prime gets paid. And so we're doing exactly what people are asking us to do.'",
        "'speaker_3': 'And I hope that in in fronting the money or floating this check, knowing that the money will come in later, that we extend that same courtesy to others as we go forward doing business. That's it for my questions.'",
        "'speaker_3': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman CdeBaca. Next up, we have Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Madam President. Matt, I just wanted to ask if if you have known projects already identified either programs or projects that this money will be used for. If you could share that with us. And then can you just clarify that these moneys that were advancing are aligned with what is in the five year plan that was'",
        "'speaker_5': 'submitted to HUD for laying out what what we intend to do with these HUD dollars over the next five years.'",
        "'speaker_1': 'Yes, absolutely. On your second question for sure, we we do have the five year plan and we do have an annual action plan that we put forward every year. So we we do not fear from that plan unless there is a substantial change.'",
        "'speaker_1': 'And so typically that will take another action plan amendment, which requires another public comment period. So, so usually we do a single annual action plan and then and then work on that five year plan as well. So we do not anticipate that these two and a half million dollars being advanced would veer outside, that they can't veer'",
        "'speaker_1': 'outside of what we what we would typically fund in our CDBG action plan unless we were to amend that plan.'",
        "'speaker_5': 'So with these dollars, what percentage is going to housing and homeless services versus the the desire for jobs and job creation?'",
        "'speaker_1': 'So, so so it varies year over year, but typically we have an agreement with hosts when they split off, we have an agreement with hosts that they will receive at least 30% of the total funding. And usually even before hosts split off, it was around a third, a third, a third.'",
        "'speaker_1': 'If you think of it from a nest perspective and public service perspective, a housing perspective and business development perspective. We tried to we tried to stay within that realm. So we have an agreement to keep at least 30% in host.'",
        "'speaker_1': 'But as payoffs and other loans pay down and pay off, if there are any outside payoffs that occur and we receive large amounts of money, that's when our executive directors of each agency will get together and determine the best need for for that additional funding that we can anticipate.'",
        "'speaker_5': 'Does. Does this include home and hopper or is that sort of set aside separate as separate?'",
        "'speaker_1': 'So Home Hub, ESG, a few others common hardware specifically are HUD, but they are 100% host. Dito does in fact, doesn't receive those dollars.'",
        "'speaker_5': 'And the ESG goes to them as well, right?'",
        "'speaker_1': 'Correct. Even though I don't believe that Rachel would have to correct me, I don't believe that's a hide. Maybe it is. Sorry, I'm not an expert on ESG.'",
        "'speaker_5': 'It is. It's. I used to go through human services now.'",
        "'speaker_1': 'Understood.'",
        "'speaker_5': 'Host Okay. That's all I have. It would be helpful to know where we can see the one year plan as well, not just the five year plan. I thought at one point we were you guys were providing that to us on a regular basis.'",
        "'speaker_5': 'And you may be because I'm on the committee that that goes to. So I don't remember seeing the one year plan come before us.'",
        "'speaker_1': 'And we can do that. If Rachel King is on, she can raise her hand and jump on. We did because we received this CDBG COVID. She received two rounds of it very recently. Just a couple of months ago, we did another public comment period for our action plan because as I mentioned, because we received the additional COVID'",
        "'speaker_1': 'money, it was considered an amendment to that action plan. And so we did redo our due action plan pretty recently. Rachel, I see that you're on.'",
        "'speaker_5': 'And it's thank you. And I just want to ask quickly if this also includes like a bunch of the the contracts or the the funding that has been brought before City Council on the shelters and some of those other services.'",
        "'speaker_5': 'The security, I know it has included the shower, some of the food. Those kinds of things. Is that all part of the dollars that you got from from HUD as well? Or some of it is, but most of it is not.'",
        "'speaker_3': 'My understanding with the host budget is they are primarily utilizing the FEMA and coronavirus relief dollars.'",
        "'speaker_5': 'First.'",
        "'speaker_3': 'As priority and then moving into their allocations.'",
        "'speaker_5': 'Of the HUD.'",
        "'speaker_3': 'Coronavirus dollars. Our 2020 action plan that we just amended, as Matthew indicated for the third time this year in 2020, does include all of the housing uses of.'",
        "'speaker_5': 'Those coronavirus dollars from HUD.'",
        "'speaker_3': 'But for our 2021 action plan, which is what these CDBG dollars will be covering. We have not gotten into the action plan.'",
        "'speaker_5': 'Process.'",
        "'speaker_3': 'Quite yet for that, but we are getting ready to start that at the end of January.'",
        "'speaker_5': 'Okay. And then if you could just send us a link to where we could see that one year plan, that would be really helpful. Definitely. Thank you. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Councilman Ortega.'",
        "'speaker_5': 'Madam President.'"
    ],
    "A bill for an ordinance setting the salary of the district attorney for the second judicial district.  Amends Section 18-95 of the Denver Revised Municipal Code to amend the salary of the District Attorney for the four-year term beginning 2021 through 2024. The Committee approved filing this item at its meeting on 12-15-20.": [
        "'speaker_0': 'Thank you, Councilwoman. And thank you, Matt and Rachel, for fielding those questions. The next item up is Council Bill 20, Dash 1553. Councilman Hampton, will you please put Council Bill 20, Dash 1553 on the floor for final passage?'",
        "'speaker_1': 'Yes, Madam President, I move that council bill 20-1553 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and I think I heard the second from Councilman Hines first on there. And so comments by members of council. Councilwoman CdeBaca.'",
        "'speaker_3': 'Nope. That that one handle. Thank you.'",
        "'speaker_0': 'All right. Madam Secretary, roll call.'",
        "'speaker_2': 'CdeBaca.'",
        "'speaker_3': 'Sorry. Click that one on and off too quickly. No.'",
        "'speaker_2': 'Thank you, Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Hines.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Cashman. I can h.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Ortega. I. Sandoval. I swear. I Taurus. I.'",
        "'speaker_3': 'Black eye.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce results.'",
        "'speaker_2': 'One need 12 eyes.'",
        "'speaker_0': 'One there, 12 eyes council bill 20 dash 1553 has passed. That concludes the items to be called out. All other bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'"
    ]
}