{
    "A bill for an Ordinance approving an Agreement with the State of Colorado, Department of Transportation for a major road construction project, known as I-25/Santa Fe & Alameda Avenue Interchange Project.\n (INFRASTRUCTURE & CULTURE) Approves an intergovernmental agreement with the Colorado Department of Transportation for land transactions and underpass construction for the South Platte Regional Trail and roadway improvements between South Jason Street and South Huron Street for the I-25/Santa Fe and Alameda Avenue Interchange Project in Council District 7 (201626220).  The last regularly scheduled Council meeting within the 30-day review period is on 5-9-16. The Committee approved filing this bill at its meeting on 4-6-16.": [
        "'speaker_4': 'RTD has stepped away from it and funding it, which I'm very disappointed with, and I'll continue to work with RTD to try and bring them back into the fold on that and that the city is poised to pass on acquiring at a very low cost, if maybe any cost, the landing pad, the future landing pad for that'",
        "'speaker_4': 'bridge, making it virtually impossible then to build without condemnation of private property. That land exchanges is the sale is happening soon. And I just wanted to go on record saying that it is absolutely critical that the city secures the landing site.'",
        "'speaker_4': 'We have worked hard. We have a massive infrastructure project. Parks and public works have worked really hard to line up a great bike ped connection to that light rail station for all of West Denver along Alameda. And it will all be for nothing if we lose that landing pad, if we can't get that bridge built, because what'",
        "'speaker_4': 'it will do is, in effect, cause bicyclists and pedestrians to cross Alameda at a very busy juncture with all the on ramps for I-25 and Santa Fe and Commerce coming through twice, two additional times without that bridge to be able to use the current infrastructure which is on the north side on the underpass.'",
        "'speaker_4': 'So will I be voting to support this project? Because I believe that it is a critical step in getting us there. I don't want this this to go through without taking a moment to acknowledge that the bigger picture is about to slip away from us.'",
        "'speaker_4': 'And we have to make sure that we we deliver on the promise of access to public transportation for the west side of Denver. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Flynn, your comments.'",
        "'speaker_6': 'Thank you, Mr. President. Pro tem. I'm going to support this tonight, but I do want to reiterate a comment that we made in committee to city staff, which generally does a really good job on on these infrastructure projects.'",
        "'speaker_6': 'And this is a really, really good project. But the one thing that disappoints me about it is that it is utilizing 1345 square feet of Vanderbilt Park for one of the bridge, Piers. And the replacement land is about five blocks away and it's a little wedge of land at Alameda and La Pam right next to right across'",
        "'speaker_6': 'the west side of the river. And I don't think that's a suitable location for replacements. Like we build something in Civic Center Park on a thousand square feet and we compensated by by putting a thousand square feet somewhere off in the distance.'",
        "'speaker_6': 'I would I would really like the city staff to work on these issues when they come up again to find replacement park land that is adjacent and contiguous to the park that's losing the land. Thank you.'",
        "'speaker_2': 'Thank you, Councilman. That does it for that council Bill. Councilman Kennedy, under Bill's introduction, you have called out Counsel Bill 291 regarding marijuana caps on locations. What do you want? What would you like us to do with this bill?'",
        "'speaker_8': 'Thank you, Mr. President. I would like to put it on the floor for the purposes of entertaining a technical amendment that's going to be offered by Councilwoman Gilmore.'",
        "'speaker_2': 'All right, Councilman Cashman, will you please put Council Bill to 91 on the floor? It will be ordered published.'",
        "'speaker_4': 'Yes. Thank you, Mr. President. I move the council bill to 91, be ordered published.'",
        "'speaker_2': 'All right. We have a second has been moved in second comments by members of council. And then let me just proceed by saying Councilwoman Gilmore, Councilman Espinoza, Councilman Cashman and Councilman Flynn all chimed in. The council this hour to call this bill out is really go with comments and you can make your comments at that point.'",
        "'speaker_2': 'So go. Go for counseling. Or I mean, I'm sorry, Councilman.'",
        "'speaker_8': 'I defer to Councilwoman Gilmore.'",
        "'speaker_2': 'All right, Councilman.'",
        "'speaker_7': 'Thank you, Councilwoman. I was just wanting to go ahead and put my amendment on the floor. Is it okay to put my amendment on the floor or. I don't necessarily have a comment.'",
        "'speaker_2': 'Okay. Council members. If you have an amendment, please indicate so on your touch screen. I think everybody's got it. And when you offer your amendment, please indicate the color of the paper used to distinguish your amendment. Counsel. I think we have that on the floor.'"
    ],
    "A bill for an ordinance concerning the licensing of marijuana businesses, amending the Denver Retail Marijuana Code, Article V of Chapter 6, D.R.M.C. and the Denver Medical Marijuana Code, Art. XII of Chapter 24, D.R.M.C. by capping the total number of licensed locations where marijuana cultivation and sales may be permitted in the city, adopting new procedures for the issuance of retail marijuana cultivation and sales licenses, prohibiting the issuance of new medical marijuana cultivation and sales licenses, and adopting other related amendments. (Special Issues: Marijuana Moratorium) Amends the Denver Revised Municipal Code concerning marijuana facilities and caps the total number of licensed locations. This bill was approved for filing by  Councilwoman Kniech.": [
        "'speaker_2': 'Councilwoman Gilmore, will you please withdraw your amendment so we can file a new motion?'",
        "'speaker_7': 'Yes, Mr. President. Pro Tem Lopez. I withdraw my amendment and would like to move forward with my new amendment.'",
        "'speaker_2': 'Okay, Councilman.'",
        "'speaker_8': 'Second, I agree.'",
        "'speaker_2': 'Thank you. All right, go for it. Councilwoman Gilmore, why don't you move to amend?'",
        "'speaker_7': 'All right. Thank you, Mr. President. Pro Tem Lopez. I move to amend Council Bill 16 Dash 0291 in the following particulars on page six, line 26, add the letter S to the word license, and on page eight, line 18, strike the words stores and insert cultivation facilities.'",
        "'speaker_7': 'And this amendment would correct some typos in the bill as originally introduced. Thank you, Mr. President. Pro Tem Lopez.'",
        "'speaker_2': 'Thank you, Madam President. Second is comments by members of council. Okay? Yeah. Councilman Flynn, did you try me?'",
        "'speaker_6': 'No, I did, because I was on the wrong screen, but. May I?'",
        "'speaker_2': 'Absolutely. Yeah. We're stuck on the vote screen. I think because we were. Well, why don't you go ahead.'",
        "'speaker_6': 'And if I could just ask Councilwoman Gilmore the changing stores to cultivation facilities, what is the effect of that?'",
        "'speaker_7': 'Thank you, Councilman Flynn. The the change is in my original amendment. It was written that we would have two separate lists, one for the top five statistical neighborhoods for stores, and the second list, the top five statistical neighborhoods for cultivation facilities.'",
        "'speaker_7': 'And then after that, it lists all of the different types. And in the original amendment, it had listed marijuana stores in with the cultivation facilities. And so we wanted to clarify that that was indeed two separate statistical lists, one for stores and one for cultivation facilities.'",
        "'speaker_6': 'Thank you very much. That that clears up very well.'",
        "'speaker_2': 'Thank you. Councilman Flynn, I am showing that there are comments on this particular motion. Councilman Gilmore, I presume that you did not chime in to make another comment, did you?'",
        "'speaker_7': 'No, I did not.'",
        "'speaker_2': 'Okay. I'm just going to go down the down the line, Councilman Cashman.'",
        "'speaker_4': 'Just for an amendment when it's time.'",
        "'speaker_2': 'Okay. And Councilman Flynn.'",
        "'speaker_6': 'Okay. You just referred to just four comments on the bill at large when we're ready.'",
        "'speaker_2': 'Okay. Thank you. All right. Roll call on the amendment.'",
        "'speaker_3': 'Gilmore, I can each new Sassaman. All right. Black. Brooks Clark. All right. Espinosa Flynn.'",
        "'speaker_6': 'Hi.'",
        "'speaker_3': 'Mr. President. All right.'",
        "'speaker_2': 'Madam Secretary, please close the voting in an.'",
        "'speaker_4': 'Excuse me, Mr. President. I wasn't called for Kashmir by Lebanese.'",
        "'speaker_2': 'Okay. Let's make sure the system is running well. 11. Of. 11 eyes the motion or the. Amendment is a. Added. Council members. Are there any other additional amendments to be offered to this bill? Please bring in Councilman Espinoza.'",
        "'speaker_1': 'Mr. President, pro tem, I move that council deem council bill two 9291 be amended in the following particulars. On page 15, line six, add new sections 14 and 15 after the word 2015. Accordingly. Section 14, that Section six dash to ten of the DRC shall be amended by adding the following, adding the language underlined to read as'",
        "'speaker_1': 'follows Section 210 Licensing Requirements Provisions Applicable to all licenses. Applicant B application forms and supplemental materials. All applications for local licensing shall be made upon forms provided by the director and shall include such supplemental materials as required by this Article five The Colorado Retail Municipal Marijuana Code Correction and rules adopted pursuant there to including by way of'",
        "'speaker_1': 'example proof of possession of the licensed premises disclosures related to ownership of the proposed businesses. Business. Fingerprints of the applicants building plans. Floor plans designating the proposed license premises outlined in red security plans. And a community engagement plan that includes at minimum the following information one the name, telephone number and email address of the person affiliated with'",
        "'speaker_1': 'the applicant who is responsible for neighborhood outreach and engagement to the names of all registered neighborhood organizations whose boundaries encompass the location of the proposed license premises, and a statement that the applicant shall contact the registered neighborhood organizations prior to commencing operations.'",
        "'speaker_1': 'Three An outreach plan to contact and engage residents and businesses in the local neighborhoods where any license is located. For a detailed description of any plan to create positive impacts in the neighborhoods where the licensed premises are located, which may include, by way of example, participation in community service, volunteer service and active promotion of any local neighborhood'",
        "'speaker_1': 'plans. Five Written Policies and procedures to timely address any concerns or complaints expressed by residents and businesses within the neighborhood surrounding the licensed premises. Six Written policies and procedures designed to promote and encourage full participation in the regulated marijuana industry by people from community communities that have been previously that have previously been disproportionately harmed by marijuana prohibition'",
        "'speaker_1': 'and enforcement in order to positively, positively impact those communities. To the extent any of the foregoing, supplemental materials have been included with the applicant state license application and forwarded to the city by the State Licensing Authority, the director may rely upon the information forwarded from the State without requiring resubmit all of the same materials in conjunction with'",
        "'speaker_1': 'the local license application. The director may, at the director's discretion, require additional documentation associated with the application, including additional requirements for any community engagement plan as may be necessary to enforce the requirements of the Colorado Retail Marijuana Code.'",
        "'speaker_1': 'And this Article five. Section 15, that Section 6 to 18 of the DRC shall be amended by adding a new subsection F underlined to read as follows f all applications for the renewal of any license shall include a community engagement plan as required in Section 210.'",
        "'speaker_1': 'So the year. Can I comment?'",
        "'speaker_2': 'Do we have a second? Can each go for it? Make a comment. Go for it.'",
        "'speaker_1': 'I just want to explain that this amendment would require would add a requirement that the community engagement plan be included with all applications for any type of license under the Denver retail marijuana code.'",
        "'speaker_2': 'Are there any other comments? Okay. On the screen it says Espinoza. Cashman. But I think that that's for additional amendment. All right. So there's no other comments on this one, Madam Secretary, roll call in the amendment.'",
        "'speaker_1': 'Espinosa Hi.'",
        "'speaker_4': 'Flynn Hi.'",
        "'speaker_3': 'Gilmore I. Cashman Hi. Carnage New assessment black eye. Brooks.'",
        "'speaker_4': 'Clark Hi.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_2': 'I am secretary. Please close the voting and announce the results.'",
        "'speaker_3': '11 eyes.'",
        "'speaker_2': '11 eyes. The amendment. Passes. All right. Are there any other amendments that need to be offered up? Yes, Mr. Chairman. Councilman Cashman, you have an amendment.'",
        "'speaker_4': 'Thank you, Mr. President. Pro tem. Councilwoman Ortega is unable to be here this evening and asked me to read the following amendment. Mr. President, I move to amend the Council Bill 16 to 91 in the following particulars on page 15 Line six, after the number 2015 insert and the notification provisions required by Section 12, Dash 96 B'",
        "'speaker_4': 'as amended by this ordinance. And just a quick comment, Mr. President.'",
        "'speaker_2': 'Go forward. Make that.'",
        "'speaker_4': 'Comment. I just wanted to explain that this amendment would amend the bill to clarify that in addition to new applications, the R.A. notification requirement in the revised Section 12, Dash 96 B also applies to all applications that were pending on May 1st, 2016, when the premises proposed to be licensed is in an I.A. or I.B. Industrial Zone'",
        "'speaker_4': 'District.'",
        "'speaker_2': 'All right. Do we have any other comments from members of council? Councilman Sussman.'",
        "'speaker_11': 'Just. Just a question. If they were if they are required of those who are now pending, I thought I understood Councilman Espinosa's to say it must be part of the application upon upon applying, so they need to redo their application.'",
        "'speaker_11': 'Is that what is required by this bill?'",
        "'speaker_4': 'No. This is just last week. Councilwoman Ortega passed a notification piece and it was apparently unclear from the wording of that. I said it applied to the pending as well. So a city attorney drafted this to be sure that the pending were included in the are in notification.'",
        "'speaker_8': 'All right. Thank you very much.'",
        "'speaker_2': 'Thank you. Thank you. Councilman Susman, Councilman Creech.'",
        "'speaker_8': 'Thank you, Mr. President. I just wanted to clarify that the burden of implementing this amendment is actually on the department to notify the R.A.. The prior amendment we discussed the Espinosa Amendment puts the burden of a community engagement plan on an applicant.'",
        "'speaker_8': 'So there are slightly different approaches. Both of them will help inform and give opportunity to communities to engage better but different different burdens in terms of who's carrying each of them out. Thanks for the clarification.'",
        "'speaker_2': 'Thank you for that clarification, Councilwoman. Are there any other comments? None on this particular amendment, Madam Secretary. We have a roll call on the amendment.'",
        "'speaker_3': 'Councilwoman Cannick. His name is up.'",
        "'speaker_1': 'And still up.'",
        "'speaker_2': 'Okay. Okay. Thank you. Let's do it. Okay. Roll call.'",
        "'speaker_3': 'Cashman. I can eat my. Sussman. Black Eye Brooks. I'm Clark Espinosa. Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Gilmore. I. Mr. President. I knew.'",
        "'speaker_1': 'Up.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_2': 'I. Key. Madam Secretary, can you please close the voting? Announce the results.'",
        "'speaker_3': '11 eyes.'",
        "'speaker_2': '11 eyes. The amendment passes. Councilman Flynn, you have an amendment, mind you. Go ahead and make that motion.'",
        "'speaker_6': 'Mr. President. Pro tem. No, I don't. I clicked in in order to comment on the bill, but I think we need to move it to the floor as amended first.'",
        "'speaker_2': 'Oh, that's right. Okay. All right.'",
        "'speaker_1': 'Um. Yeah.'",
        "'speaker_2': 'All right, Councilman Cashman?'",
        "'speaker_4': 'Yes. Thank you, Mr. President. And I move the council bill to 91, be ordered, published as amended.'",
        "'speaker_2': 'All right. It's been. Moved and seconded. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. Last week in the room here, we ended up being deadlocked, 6 to 6 on a bill that was very similar, but lacked an element that some of us wanted to see in terms of providing a reduction in the density of some of the facilities that are in some of the neighborhoods that are are'",
        "'speaker_6': 'pretty hard hit economically. And after the bill lost last week. I wanted to give a shout out to the council member sitting next to me, Councilwoman Kennish. We went back and forth for a couple of days and we came up with a provision that I think starts to address the ability to d densify some of the neighborhoods'",
        "'speaker_6': 'that are so concentrated and maybe diffusing them a little better. And so I just wanted to give a shout out to my colleague next to me. I've heard I've worked with a lot of folks over over the years.'",
        "'speaker_6': 'And, you know, you've heard the expression that person's not the sharpest knife in the drawer. I've said this, too, to Councilwoman Kenney. She's face during a meeting that she is very highly analytical, she's very creative, she's very thoughtful.'",
        "'speaker_6': 'And even when she comes up with something I don't like, which it might be this bill. I cannot criticize her intellectual rigor. And so I said to her at an early meeting that she is, in fact, the sharpest knife in the drawer.'",
        "'speaker_6': 'So I just wanted to thank her for the work that. Yeah, go ahead. I just wanted to thank her for reaching out and working with me and Mr. President and colleagues. I did prepare an amendment that you see before you, and it is in reserve only if this bill were to fail again tonight.'",
        "'speaker_6': 'I had an amendment that I would propose through a motion to reconsider if it were to fail. So. So it's still held in abeyance. So that's why I have. Mr. President. Thank you.'",
        "'speaker_2': 'Thank you. Other comments on Council Bill 291. Councilman Espinoza.'",
        "'speaker_1': 'Yeah, I just I have I wanted to say that during the last five months, we've heard from numerous neighborhoods that have voiced concerns that the facilities were impacting their communities and not easy to contact. So the amendment that I'm glad that my colleagues overwhelmingly, unanimously supported start to address what I've been sort of railing on the entire'",
        "'speaker_1': 'time, which is having some sort of direct community benefit, you know, commitment through these establishments. And so I want to thank Ashley Kilroy with the with the with the city Marly, and I'm going to butcher your last name.'",
        "'speaker_1': 'So with the city attorney, the marijuana industry and the community members who've helped in this in this final crunch time in actually getting that amendment crafted to the point where we could get to get this consensus. So I think everybody on both sides of the debate who showed up time and time again and I appreciate and members'",
        "'speaker_1': 'all the members of council appreciate your participation in the process. Thank you.'",
        "'speaker_2': 'All right. Thank you, Councilman Espinoza. Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. Pro Tem. I will be supporting the bill this evening as amended. And I just wanted to say that regardless of what we do tonight, we are not making a number of neighborhoods in the city whole in the way that they need to be made whole.'",
        "'speaker_4': 'Globeville, O'Leary and Swansea are mentioned prominently. There are other neighborhoods who are suffering lack of housing and infrastructure of of all manner. And as I said, whatever we do tonight, we need to this to be the beginning of a renewed commitment to those neighborhoods in a variety of ways.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman. Councilwoman Gilmore.'",
        "'speaker_7': 'Thank you, Mr. President. Pro Tem. I wanted to first thank my colleagues in my absence. Last week I was traveling and unable to be here. And I want to thank Councilman Clark for reading my amendment and my colleagues passing at 9 to 3.'",
        "'speaker_7': 'You know, when I was first elected, I didn't really understand the saying that if you're doing things how you should be doing them. Nobody will be happy. And I think with this bill, that really comes full circle. There are a lot of issues that my colleagues have spoken to around neighborhoods that have an undue concentration.'",
        "'speaker_7': 'And there are a lot of different issues that are affecting those neighborhoods. And, you know, my own neighborhood where I live of Montebello. I understand this very much so. But knowing that there are going to be hard decisions going forward, because when the zoning is set up in such a way that you may have industrial right across'",
        "'speaker_7': 'from or in very close proximity to residential versus in the Montebello community you have an industrial park, but there's also the perception that you are very close to residential and honestly close to some schools. And so where we can continue that conversation as a community working towards making sure we're making good decisions for first the communities and'",
        "'speaker_7': 'folks quality of life, but then also realizing that the industry has tried to educate us and tell us their side and be good neighbors for the most part. I know that you always have examples where that's not happening, but I haven't had those people reach out to me.'",
        "'speaker_7': 'I haven't had them want to come talk to me. And so I look forward to continue the conversation. And you know, my colleagues, we this is really the honeymoon period is a little bit over because we've had to have those hard conversations.'",
        "'speaker_7': 'But I have to say that at the end of the day, we were able to come together to put a beginning. Chapter two, a chapter on marijuana in the city and county of Denver that is going to be more chapters are forthcoming because this is a point in time.'",
        "'speaker_7': 'This is a baseline. But I'm really proud of my colleagues that we are able to disagree in a manner that was respectful and that we were able to have those hard conversations. And so I just wanted to bring that forward.'",
        "'speaker_7': 'Thank you, President Pro Tem.'",
        "'speaker_2': 'Thank you, Councilman Gilmore. Thank you, Councilman Gilmore. Councilman Brooks.'",
        "'speaker_1': 'Yeah, thank you, Mr. President. And, you know, I'm just I'm going to be you know, data led with my decision globally is Swansea absorbs 10% of all facilities in the marijuana industry and 10% of the licenses, and they represent less than 1% of the population.'",
        "'speaker_1': 'That's overconcentration. That's over saturation in the community. And as hard as everyone has worked on this bill, at the end of the day, we're adding to that and I just can't support it. So I will not be supporting this.'",
        "'speaker_1': 'The real work is going to happen with community leaders, folks in the city on the ground going forward to say, how do we move this community in a in a in a in an area, in a situation where it's a benefit for the community?'",
        "'speaker_1': 'I keep hearing benefits, but I don't see benefits. I see a community that's upset all day today talking to community members, trying to figure out a way and realizing that there's just not enough votes to get to the place that we need to get to.'",
        "'speaker_1': 'I appreciate the folks who have made some helpful measures to do community outreach and things like that. But at the end of the day, you know, this is a net loss for the community today. So I'll be voting against this.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman Brooks. Councilman Espinoza, I see you up in the queue. Yeah. 1091.'",
        "'speaker_1': 'I forgot a name, so I hope Christian doesn't mind me calling him out, but he worked hard with Marley as well and bringing the industry to the table and addressing the concerns that had been brought up time and time again.'",
        "'speaker_1': 'So thank you, Christian, for for your work as well. Thank you.'",
        "'speaker_2': 'The Councilwoman Black.'",
        "'speaker_11': 'Thank you, Councilman Espinosa. Just a few things. I just want the community to know that this is not a vote on whether we like marijuana or not or whether we think it's good for the community or not. We are voting tonight to greatly restrict this industry.'",
        "'speaker_11': 'And as Councilwoman Gilmore brought up, it's a compromise and it's not perfect and nobody is completely happy. But with Councilwoman Cornish's leadership, we have really forged ahead on a compromise. Again, it's extremely restrictive. Two thirds of the Grove facilities that we have today would not be allowed in the future.'",
        "'speaker_11': 'So if they move away, they won't be able to come back in into those areas. Many of us on council want to have an ongoing council committee to address future issues. There's a lot of support for that. This only addresses one thing, but there are many more issues related to marijuana and we are committed to addressing those'",
        "'speaker_11': '. The industry is reaching out council and Espinosa's amendment is now part of this bill. It's really going to be great for the community now. But I also want to point out that Globeville, Elyria and Swansea are about to undergo undergo an incredible transformation with millions, if not billions of dollars being invested into that community.'",
        "'speaker_11': 'My concern is with gentrification of that community. And I think what we really need to look after with the people who live there today is to make sure that they reap some of the benefits of that gentrification. So with that, I will be supporting this amendment, and I appreciate everyone's passion on this.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Black. Councilman Flynn.'",
        "'speaker_6': 'Nothing much, because I will I'm going to pass on the roll call until I see that it will get seven votes. Because if it does not get seven votes of I would vote no so that I could then bring it up on reconsideration.'",
        "'speaker_6': 'I just wanted the members to understand that because I do think it's important that we come out with a bill tonight. I know that we have another bill on the agenda that would extend the the date until June 1st, I believe.'",
        "'speaker_6': 'But I think everyone here and probably everyone there wants to want us to move on with this. But my amendment would just to address Councilman Brooks concern. My amendment, I think, would address. The overconcentration in certain neighborhoods by having a slightly lower cap set than the one that is set in the ordinance that we have here.'",
        "'speaker_6': 'And I may offer that next week. Thank you.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Noon.'",
        "'speaker_5': 'Thank you, Mr. President. I also would like to commend Council on condition all the hard work that she's been through to to bring this bill together to the floor and and especially Councilwoman Gilmore and her amendment to try to address the saturated areas.'",
        "'speaker_5': 'I've listened long and hard to my constituents, and I've had responses from hundreds of my constituents. And they're really clear to me that they feel like we need a cap on the licenses and locations and on marijuana. But they are gravely concerned about the pending of how increasing the number of pending applications will increase those those licenses'",
        "'speaker_5': 'and locations. I'm also very, very concerned about the saturated areas. I heard a lot of comments, but it's very different from what we heard last week as well as from other residents about the Globeville Swansea situation, about the oversaturation there.'",
        "'speaker_5': 'So really concerned about that. I think if we have some more discussion, if this bill does fail tonight, we have some more discussion. I think we'll come back with another bill will not be supporting this bill tonight.'",
        "'speaker_2': 'Thank you, Councilman. New Councilwoman Kenny.'",
        "'speaker_8': 'Thank you, Mr. President. I gave a lengthy comment last week, and I'll keep this one brief, but I first want to say that I am very supportive of this bill as amended with the new pieces that were added this week for probably the fourth or fifth week in a row, if you count the weeks of committee, this'",
        "'speaker_8': 'council members beside myself have shaped this bill, so we can call it a Frankenstein, if you will, with a bunch of different creators. But it's definitely not my bill. It is a bill that has been shaped by many of you.'",
        "'speaker_8': 'And so I want to thank you for those contributions. I think it is difficult to say that you have heard concerns from communities. You have added pieces that directly relate to those. And then to see some of those same individuals still not support the bill at the end.'",
        "'speaker_8': 'And even that is the case with some council members who added pieces to the bill and still do not support it. I think that there is no timeline on good ideas. And so to the extent that my willingness to continue to work with the communities that have come forward is going to continue beyond this bill.'",
        "'speaker_8': 'And I, in Globeville in particular, I have been working for four years on an open space already. And so my it's not the first time I've had a conversation about the need for investment in Globeville. With this bill and this is not necessarily the most important investment that these neighborhoods need.'",
        "'speaker_8': 'As Councilman Cashman and Councilwoman Black have both mentioned. Right, the infrastructure like sidewalks, the affordable housing to make sure that families who are there now can continue to stay in the neighborhood. Each of those things is important, too.'",
        "'speaker_8': 'And if there's one thing that I think is unfortunate is that we have. Pitched the plight of an entire community on one minor aspect. And it's not that this is not an important aspect, but it's not the only aspect this community has raised.'",
        "'speaker_8': 'But it is now gotten ten times more attention than the conversation about sidewalks, than the conversation about bus stops, than the conversation about housing, than the conversation about gentrification. And that is, I think, unfortunate, because when I have dialoged with those community members, those issues have in fact been very prominent in some cases even more prominent for'",
        "'speaker_8': 'some of them. So those conversations can continue and they will continue and they will continue in spite of this bill. I want to just because several of my colleagues have raised the concept of spendings one more time, I do just want to clarify.'",
        "'speaker_8': 'I think that we received revised data as of Friday, and it's it's simply just not the case to state that that that there is a flood of of new locations going into some of the neighborhoods that have been prominent.'",
        "'speaker_8': 'There are two pending locations in Elyria, Swansea, and there is one pending location in Globeville when you look at stores and grows. So that's a total of three, one of which is already expired. And if they don't receive an extension from the city would be denied.'",
        "'speaker_8': 'That may be too much and I accept that. But I do believe that the the the characterization that there's a flood of new locations going in is is just simply not accurate and not supported. I also would disagree that this bill expands, you know, and it brings new those pending applications where pending before we brought this bill'",
        "'speaker_8': 'up, they were pending in the mayor's moratorium. So it's simply not accurate to say that this bill is adding any facilities to these communities. Those facilities were on their way. That is really important. There is no provision in this bill that gives someone an ability to open more locations than existed prior.'",
        "'speaker_8': 'This is really, really, really important, and I hope the media is paying attention. This bill will dial down the number of cultivation locations by 3030. It prevents transfers of locations into areas near these neighborhoods. So not just no new locations can go in.'",
        "'speaker_8': 'Existing locations cannot move right next to the residential areas in these neighborhoods. Those do not add. They subtract. They explicitly subtract. And I do. It's absolutely appropriate to have differences, opinions about whether the bill goes far enough or whether it does not.'",
        "'speaker_8': 'But this bill adds no location, no location that wasn't on its way the day we started this debate. All right. And I just want us to be really honest about that. We can all disagree, but let's use the same data.'",
        "'speaker_8': 'With that. I know that we're not done. We have a second reading ahead if we make it through tonight. I am hopeful that council members who can't get there tonight will can continue to understand the places that this bill makes improvements.'",
        "'speaker_8': 'If we did not have this bill, there would be no change in the rules. Remember, a no vote is not a vote for stricter rules. There is no stricter rule bill out there. A no vote is a vote for no rules at this point.'",
        "'speaker_8': 'So I believe this is a very aggressive bill working very hard to protect communities. And I hope that we can move it forward to second vote and then bring some closure next week. With that, I hope to encourage all of my colleagues to vote yes tonight.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Kenney, Councilman Flynn.'",
        "'speaker_6': 'I think, Mr. President, I just wanted to chime in to offer a correction to one thing that Councilwoman Kenney said, maybe inadvertently, but the reduction in cultivation facilities under this bill is not 30. But 15. Thank you. So the knife has dulled a little bit maybe.'",
        "'speaker_6': 'But just so just for the audience here and for the folks on Channel eight to explain what we did from the last bill, I just take a moment to explain how it works. And if I'm incorrect, the sharp knife next to me will correct me.'",
        "'speaker_6': 'This bill calls for a lower cap, eventually on cultivation facilities, not on stores, on cultivation facilities of 15. And the way it will be achieved is through honors. The principle that Councilwoman Kennish brought to me that my competing bill did not do.'",
        "'speaker_6': 'And I see the merit in her argument, and that is that if we simply put a lower cap in and wait many years until enough shops and growers go away, that we densify these neighborhoods, then Denver will not the city will not have played a role or had an opportunity to play a role in licensing new entrants'",
        "'speaker_6': 'into the market, new entrepreneurs and cetera. And that's an important thing that we want to preserve. So the way this ratchet down will work is that for every two locations that go away, the city will hold the blind lottery and issue one license.'",
        "'speaker_6': 'So if in a year seven locations go away, then three new licenses would come up that subsequent that that subsequent year. So that's how the ratchet down works. I don't know how long it will take to reach the 15 reduction, but my hope and my belief is that they will leave some of the most highly saturated neighborhoods'",
        "'speaker_6': '. So thank you for that one correction. Councilwoman Commission.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Thank you, councilman. Councilwoman, can each.'",
        "'speaker_8': 'Thank you, Mr.. Councilman Flynn. Two sharp points next to each other. I don't know if that makes us a carving fork or what, but I appreciate your correction. And I do just want to make a comment because I know a couple of folks mentioned, you know, they might have an interest in a deeper reduction.'",
        "'speaker_8': 'We don't know how long the attrition will take. And I think that it's important. I don't want to give false promises to the community. I mean, we could pretend that this bill would dial down by 100 locations. But if we don't actually see attrition occurring, if the businesses aren't relocating outside of the city or being revoked, then'",
        "'speaker_8': 'that would be a political move, in my opinion, to have a very high number in the bill because it sounds tough, but then to actually not see the attrition occurring to get to that number. So so I would suggest to folks that it is prudent to vote for this bill, as stated, to see how long it takes'",
        "'speaker_8': '. And if we see that attrition is occurring in this industry, we can always revisit this bill. There's no time period in which the council can't pick up this bill again. I don't know that there's a strong appetite to do that quickly, but to the extent we watch how the first lottery occurs and we see how many cultivation'",
        "'speaker_8': 'facilities are leaving through attrition, we will have a much better a better view. It would be very easy to just pick a much bigger number, but I think we're being honest with our constituents when we pick a number that maybe is in the realm of possibility.'",
        "'speaker_8': 'We've, you know, looking at the data over the past three years, we've had an attrition of like 7 to 9 businesses who've surrendered their licenses. So that is partially why I picked the 15 number and not something much bigger.'",
        "'speaker_8': 'Even though it might have looked a lot better, I wanted to make sure that we were being honest and realistic about what the rate at which these businesses might leave. As it may be sooner and quicker in the future, the industry may get more competitive.'",
        "'speaker_8': 'We may see changes at the state that change that pace. And if that's the case, then I think it's fine to revisit it. But I suggest that it's best for us to move forward with a realistic number tonight that may actually be in the realm of the next few years.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Councilwoman Black. Yeah.'",
        "'speaker_11': 'Thank you. Just one more reminder to everyone. Under the current moratorium, the pending applications are being processed. And so if we don't pass something tonight, they are going to be continued to be processed. So if we don't vote on something tonight, those pending are still going to go through.'",
        "'speaker_11': 'So I think we should think seriously about this compromise and we may not get something better if we continue to delay it. Thank you.'",
        "'speaker_2': 'All right. Are there anybody else that's wanting to chime in? Is there anybody else don't have speaking here? All right. You know, I wanted to chime in. You can't laugh that hard. I wanted to chime in. I honestly.'",
        "'speaker_2': 'I really respect my colleague, Councilwoman Kan, each for her hard work. For her transparency and for her inclusiveness. I think any time I've ever had a question on the bill or some idea, I've been able to walk into her office and she sits down and brings out maps in front of me.'",
        "'speaker_2': 'So I know you've worked really hard, Councilwoman, and I think everybody in this room honors and respects that and your and your willingness to be inclusive. And I think folks have come your direction to the middle a bit.'",
        "'speaker_2': 'I also wanted to. Say something in regards to, you know, my comments last go around last week. True. They still stand today. And to address some of these assumptions. We were in there until we were in here until about 130 in the morning.'",
        "'speaker_2': 'Debating. And I always want everybody in these chambers and everybody who will either read or watch this to know that there is no hysteria here. There is no I a fear of the usage of marijuana. Oh, the fear of legalizing marijuana.'",
        "'speaker_2': 'I think all of us up here in this great city and county that we serve and that we live in are 100% behind regulating this industry and the fact that we should regulate it. And we are following the lead of the voters who had said regulate this like alcohol.'",
        "'speaker_2': 'Keyword regulate. And we've had some national attention about that. And we keep getting hit up by media outlets on the national side, I was last week on in a Spanish language broadcast that was national. Saying it was very important that we balance that we have balance in these regulations.'",
        "'speaker_2': 'It's very important that we do regulate this. I know Denver is completely different from the rest of the country. And first. And. The top in the world and how we regulate this. We have more dispensaries in shops than Amsterdam, so it's important that we do it.'",
        "'speaker_2': 'And also want to remind folks that it's important that the cities around Denver do the same thing as well. There is no real opt out of this. And I want to urge our neighboring municipalities and governments to do the same thing.'",
        "'speaker_2': 'In regards to that balance and being able to say that on a national scene. The world watched in Spanish anyway. I also believe that the industry does not need to be balanced in areas of the city that are dying for revitalization.'",
        "'speaker_2': 'That are wanting to move forward. And maybe it is a few licenses, but for some of these communities, it's too many licenses. I don't want to just cast off their comments as some kind of hysteria. They live in these communities.'",
        "'speaker_2': 'And their voices are important. And I. In looking at Globeville, Larry and Swansea, and what our city has in store for them. And looking towards the future with the North Denver Cornerstone Collaborative with, you know, hopefully some revitalization that takes place with infrastructure and connect ability with I-70.'",
        "'speaker_2': 'With the National Western Stock Show. There's a lot of attention in these communities. But it's also at a critical state. Their opportunity to move forward with the rest of Denver depends on partly on some of these other issues, and that's industry is one of them.'",
        "'speaker_2': 'And having said that, you know, I thought long and hard. And I am still on the side of, of, of, of balancing this industry a little more. And regulating it a little more, especially in these neighborhoods. I think enough is enough with locating some of these new bookstores and cultivation sites in these neighborhoods.'",
        "'speaker_2': 'So I will not be supporting this bill moving forward without that. Thank you, Madam President. Madam Secretary, roll call.'",
        "'speaker_3': 'Black eye?'",
        "'speaker_1': 'BROOKS No.'",
        "'speaker_3': 'Clark. Hi. Espinosa. I Flynn.'",
        "'speaker_6': 'Past.'",
        "'speaker_3': 'Gilmore. I Cashman. I can eat i. New. Sussman, I. Flynn, I. Mr. President?'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'Uh. You did.'",
        "'speaker_3': 'Madam.'",
        "'speaker_2': 'Got it? Yeah. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': 'Eight eyes, three nays.'",
        "'speaker_2': 'Eight eyes, three nays. The motion passes as amended and is ordered published. It is now time for block votes. All other bills for introduction are ordered published. Councilman Cashman, will you please put the resolutions on the floor for adoption?'",
        "'speaker_4': 'Yes. Thank you, Mr. President. I move that the following resolutions be adopted in a block, all from series of 2016 to 20 8 to 20 6 to 27 and to 32.'",
        "'speaker_2': 'All right, we have a motion and a second. Madam Secretary. Roll call.'",
        "'speaker_3': 'Clerk. All right, Espinosa.'",
        "'speaker_2': 'You made it.'",
        "'speaker_3': 'Flynn I. Gillmor, I. Cashin I need new. Sussman My black. Brooks.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_2': 'Hi. Madam Secretary, please close the voting. Announce results.'",
        "'speaker_3': '11 eyes.'",
        "'speaker_2': '11 eyes. The resolutions have been adopted. Councilman Cashman, will you please, please put the bills on final consideration on the floor for final passage?'",
        "'speaker_4': 'Yes. Thank you, Mr. President. I move that the following bills be placed upon final consideration and do pass and a block again from the series of 2016 20426 149.'",
        "'speaker_2': 'All right. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_3': 'SUSSMAN Hi, black eye. BROOKS Hi. Clark Hi. ESPINOSA Hi, Flynn. I more I question. Hi. Can each new. Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please. Actually, Councilman Brooks. Councilman, you're hanging fire. All right. There we go. Madam Secretary, please close the voting and elsewhere.'",
        "'speaker_3': 'Vote results. 11 eyes.'",
        "'speaker_2': '11 eyes. The bills on final consideration have passed. We have one free recess announcement tonight. There will be a required public hearing on Council Bill 215 designating 4655 Humboldt Street, the stadium arena as a structure preservation. Anyone wishing to speak on this matter must see the Council Secretary to receive a speaker car to fill out and return'",
        "'speaker_2': 'to her during the recess of council. If there are no objections from members of council, we will take a brief 15 minute recess. That's convene at 715. Thank you.'"
    ],
    "Approves the landmark designation of 4655 Humboldt Street (Stadium Arena) as an individual structure for preservation in Council District 9. (NEIGHBORHOODS AND PLANNING) Approves the landmark designation of 4655 Humboldt Street (Stadium Arena) as an individual structure for preservation in Council District 9. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 3-30-16.": [
        "'speaker_11': 'So the purpose of the landmark designation ordinance, which was passed in 1967, is to designate, preserve and protect historic resources, foster civic pride, stabilize and improve the esthetic and economic viability of the community. And to promote good urban design within the city of Denver, there are 335 individual landmark buildings and 51 historic districts.'",
        "'speaker_11': 'Those districts are comprised of about 6600 buildings. Out of the 160,000 primary buildings within the city, they can take a variety of forms commercial properties, firehouses, schools, churches or neighborhoods. Applications are submitted either proactively through surveys or grassroot community efforts, or also through demolition and certificate of non historic status reviews.'",
        "'speaker_11': 'In terms of who can apply by ordinance, it can be the owners of the property. The managers of CPD. Members of City Council. Or three persons who are residents or property owners within the city of Denver. Once a property is landmarked, it is designated as is.'",
        "'speaker_11': 'There are no requirements to improve the property and the only time that there is review is for exterior changes. Only a building isn't frozen in time. There are abilities to change, but we only review work on the exterior, not on the interior.'",
        "'speaker_11': 'Typically, structures that are determined to be contributing demolitions are discouraged for those parts. For this particular designation, there was one applicant who was the owner of the property. It went to Landmark staff, which we reviewed and determined that it was sufficient.'",
        "'speaker_11': 'It went to the Landmark Preservation Commission for a public hearing, which at that point they could terminate the procedure or they could recommend it going forward, which they did. And we are currently at the public hearing. The Landmark Preservation Commission notifications of of renos and all the legal notices were met for this particular designation.'",
        "'speaker_11': 'The property is 4655 Humboldt. We are designating everything that is in blue and that is the designation boundary. However, the only contributing structure within this is the stadium arena. The applicant for this is the city and county of Denver and it is supported by the owner of the property, which is of the building as well as the'",
        "'speaker_11': 'owner of the land, which is the Western Stock Show Association. There are currently several non contributing additions on this building. There's the stadium hall from 1991, the education hall and the exhibition hall. All of those would be allowed to be demolished, which is part of the the master plan for the National Western.'",
        "'speaker_11': 'The period of significance are when this building is important is from 1908 to 1951, when the stadium arena was the primary entertainment venue of the National Western Stock Show. In order for a property to be listed as a or designated, it has to maintain its historic and physical integrity and then meet two out of the three following'",
        "'speaker_11': 'categories in history, architecture and geography, as well as relate to a theme of Denver history. In order to maintain physical integrity, it has to convey its historic or architectural significance, and that is typically defined by the location setting design materials, workmanship, feeling and association.'",
        "'speaker_11': 'The Stadium Arena's integrity is compromised by the construction of I-70. However, the stadium arena has historically been surrounded by transportation corridors, whether it was East 46th Avenue or the railroad to the west of it. It also maintains its physical integrity, although it's partially covered by non contributing additions.'",
        "'speaker_11': 'These additions attach very lightly to the building. And it's actually quite remarkable that the oval shape is still seen through it, even though there are attachments around it. In addition to meeting its physical integrity, it needs to meet history, and it does actually under all three of the criteria.'",
        "'speaker_11': 'It has a direct association with the historical development of the city. The National Western Stock Show is an important part of the city's history, and this is an iconic building within the National Western Stock Show complex. It is also the site of a significant event as the statue has been held for over 100 years.'",
        "'speaker_11': 'And this was the major event space of it. And it's also hosted thousands of other important events within Denver history. It is also associated with groups of persons who are directly or substantially associated or had an influence on society.'",
        "'speaker_11': 'This ranges from governors and senators to business people who have advocated for the construction and use of this particular building. It also meets it under architecture in two different two different areas as being an embodying, embodying distinguishing characteristics of an architectural style and portraying the environment of a group of people who.'",
        "'speaker_11': 'Characterized by distinctive architectural style. So it has a neoclassical style is seen in the curved cornices, the geometric embellishments on the brick walls, the hipped roof towers, and the regular symmetrical form and fenestration. It's also an important and early example of steel skeleton architectural design.'",
        "'speaker_11': 'It's also emblematic of the architect of the agricultural society. It is a descendant of the round barns and show barns that were historically used within the agricultural community. And finally, it meets geography as a prominent location and is making a special contribution to Denver's distinctive character.'",
        "'speaker_11': 'It's near the juncture of I-70 and I-25, and it is visible on I-70. It's also a well-known landmark within the city of Denver, within the global Elyria, Swansea, a neighborhood and within the national western complex itself. And finally, it makes a special contribution to the character of Denver.'",
        "'speaker_11': 'The National Western Stock Show is an important part of Denver, and this is its iconic building. The landmark designate, the Landmark Preservation Commission, also deemed that it met the history and context criteria under transportation and livestock industry being related to the National Western Stock Show, the city beautiful movement in Denver, and the development and growth of the'",
        "'speaker_11': 'Globeville, Illyria and Swansea and neighborhoods. At the public hearing, there were three letters of support for the designation. There was a ten minute presentation by the applicants and owners and three public speakers. All were in support of the designation application.'",
        "'speaker_11': 'The Landmark Preservation Commission reviewed the criteria and determined that it met its historic and physical integrity, that it met its criteria under history in all three areas under architecture into and geography into. They also felt it related to important historic contexts and themes in Denver history.'",
        "'speaker_11': 'And the Landmark Preservation Commission voted 7 to 0 to recommend the landmark designation move forward to City Council.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Hmm.'",
        "'speaker_2': 'We have three speakers signed up to speak this evening. I'm going to call those three if you come up to the bench. That'll help speed up the proceedings. Liz Adams. Kelly Lead. John Olsen, Miss Adams, we will start with you.'",
        "'speaker_11': 'Members of Council. Mr. President, Pro Tem. My name is Liz Adams and my address is 1660 Lincoln Street, Suite 1800. I'm here tonight to share comments from Paul Andrews, the president and CEO of the National Western Stock Show.'",
        "'speaker_11': 'He has sent sends his apologies that he couldn't attend tonight. Here are his comments. Members of city council. As a property owner, the National Western Stock Show is in full support of historic designation of the stadium arena in 1909 1909, when the Western Stock Show Association built the arena, then called the National Amphitheater.'",
        "'speaker_11': 'This building was considered the most modern and prestigious place to show cattle in the country. It positioned Denver to become the livestock center of the West. For over a century, the Grand Champion steer has been shown in the stadium arena.'",
        "'speaker_11': 'It is a tremendous honor to show cattle and other livestock in such a historic place, and those who win in that arena know that they are forever etched in history with the other winners from the past 110 years.'",
        "'speaker_11': 'As we look to the future, we hope that the arena will continue to be a showpiece of the property. The Western Stock Show Association supports this landmark designation and looks forward to continued partnership with the city on preserving this and other important historic assets of the National Western Center.'",
        "'speaker_11': 'Redevelopment takes place. Thank you. Paul Andrews, President and CEO, National Western Stock Show.'",
        "'speaker_2': 'Thank you, Mr. Adams. Mr. Kelly. Lead.'",
        "'speaker_5': 'Members of council. My name is Kelly LEED, and I'm the executive director of the new Office of the National Western Center. It's a great honor and privilege to be here tonight to make a few comments about the application.'",
        "'speaker_5': 'The city and the entire team working on this project have made a commitment to honor and interpret the rich history of the Natural Western Stock Show. As the site evolves and redeveloped, this has truly been a partnership. This is the first win of many in a continued partnership between the city, the Western Stock Association, Community Planning Development'",
        "'speaker_5': ', the National Western Citizens Advisory Committee, historic Denver History, Colorado, Colorado State University, and the Denver Museum of Nature and Science to preserve and protect the resources at the future campus. The symbolism of this tonight shouldn't be lost. The Arena was the first permanent building built by the Western Structural Association and was a marvel for its time.'",
        "'speaker_5': 'Now it is the first historic landmark and one of many will be bringing forward to this council. The intent, future development in and around the arena and rehabilitation of the arena itself serves to complement and showcase the arena as a prominent, iconic and historic place at the National Western site.'",
        "'speaker_5': 'We've worked hard with our partners to determine an appropriate landmark boundary that would protect the views of the arena's historic features and also allow for historic growth around the building as envisioned by the master plan. On behalf of the Mayor and our entire team and all our partners, I encourage you to support this local landmark designation.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you, Mr. Leigh. Mr. John Olsen.'",
        "'speaker_10': 'Members of council. Thank you very much. My name is John Olsen. I'm at 1420 Ogden Street, Suite 202, and I am the director of preservation programs at Historic Denver. And on behalf of Historic Denver, I am very pleased to offer our support for the designation of the 1909 Stadium Arena on the National Western Stock Show.'",
        "'speaker_10': 'I'm also truly happy to be here at Council for a well supported designation. Historic Denver has been actively involved in conversations related to the National Western site since 2011, advocating for the historic buildings and site features which convey the deep history of the site and provide much of its unique character.'",
        "'speaker_10': 'In 2011, we provided the city, the stock show and other stakeholders important background and contextual information about the history of the site and its historic buildings. And from 2013 through 2016, we have participated in the master planning process as a matter excuse me, as a member of the National Western's Citizens Advisory Committee, this character and associated cultural'",
        "'speaker_10': 'identity of the site are critical assets to the stock show and to Denver as a whole. The designation of the stadium arena, the first official stock show structure constructed and the oldest actual building still used much for its original purpose is the first a very and very important step in the preservation plans for the site.'",
        "'speaker_10': 'The designation will enable the city and the National Western's Doctoral Association to earn grants for further analysis of the building and to design specific restoration or rehab actions necessary to reactivate the building for ongoing year round use. We congratulate the City of Denver and the North Denver Cornerstone Collaborative specifically and the National Western Stock Show Association for'",
        "'speaker_10': 'their work towards this very important action and offer our gratitude for their commitment to the stadium arena and the heritage of this uniquely Denver site. Thank you for your consideration to vote in favor of creating this very new Denver landmark.'",
        "'speaker_2': 'Thank you. Thank you, Mr. Olsen. That concludes our speakers questions from members of council. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. Could I ask her a question or two? And the first one is, do we know? I read through the staff report and I did not. It looks like we don't know who the architect was.'",
        "'speaker_6': 'Have we been able to is he just not a he or she just not a famous architect?'",
        "'speaker_11': 'We don't know. There was actually a consulting firm that was hired to to write this. And I know they spent an extensive amount of time looking and trying to find the architect, and they simply couldn't find it. There's connections with the Chicago.'",
        "'speaker_11': 'Cattle in the stockyards. Yeah, sorry. There's a lot of connection between them and they think it was maybe inhouse designed by them, but we couldn't find anything.'",
        "'speaker_6': 'Also, then when I looked at P at Slide, I think it's eight with the blue box, the area being designated. Can you tell me, does that boundary being designated, does that restrict what can happen on the on the on the grade on the on the empty space, on the parking lot that's within that box?'",
        "'speaker_6': 'Or does it just affect the building?'",
        "'speaker_11': 'So the intake, so the entire blue box, that's the designation boundary. It would have design review for what would occur there. It doesn't necessarily say that nothing could occur there, but there would be design review for that, what's within that box.'",
        "'speaker_11': 'And we felt it would preserve the view sheds of because the building itself is oval and we wanted to preserve that.'",
        "'speaker_6': 'Great. That that's an excellent that's what I wanted to hear. KELLEY Can I ask you one thing to follow up on that? Can you tell us what are what are the project plans for the the stadium hall and the exhibition hall and how that might play into the designation?'",
        "'speaker_5': 'Sure. So the the other buildings you're referring to that are attached, correct? I mean, ultimately, those buildings would be demolished or torn down. They will be replaced with new facilities. And, you know, for those that have toured the 1909 building, there was a lot of care taken that those attachments to the old building.'",
        "'speaker_5': 'It won't be that hard to disassemble those buildings without damaging the 1909 building. So that's one. But, you know, those buildings, the ancillary buildings would be torn down. And then we'll go through a process. The master plan talks about the 19 or nine building as if you've been to the Pike Street Market up in Seattle, which is'",
        "'speaker_5': 'a year round food market. We've talked about that as a possible use, celebrating Colorado farmers and ranchers and products from all over the state. We'd have John Elway throw the ribeye instead of the salmon, of course, but we don't know.'",
        "'speaker_5': 'I mean, we're going to go through a process, but it's a it's a it's an incredible building that needs to be shared with future generations. And our goal is to preserve it.'",
        "'speaker_6': 'That's only because the Broncos don't really have a starting quarterback at the moment.'",
        "'speaker_5': 'So we'll get Mr. Sanchez an opportunity to throw one as well then.'",
        "'speaker_6': 'Do you know, have we studied whether those buildings, those ancillary buildings, can they be detached without damaging the exterior of the of the 1909?'",
        "'speaker_5': 'We believe so. I mean, again, we'll you know, part of the exercise is to get a grant to obviously study the structural integrity of the 1909 building. But just in our walks around the old building and how those ancillary buildings were attached, again, there was a lot of care given.'",
        "'speaker_5': 'It's literally lightly touching the building with with with very minimal invasive connections so that we can hopefully disassemble that without much damage to the 99.'",
        "'speaker_6': 'But thanks very much. Appreciate that's all the script.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Espinoza.'",
        "'speaker_1': 'Uh, a question for Kelly as well. The So do you have an actual set aside or project budget or one of those tasks that you've got many tasks over there at the stock show for restoration or real rehabilitation of this building?'",
        "'speaker_1': 'Because those old pictures show clear, a lot of clear story windows and things that are all lost to history. I agree there's a real light touch, so I'm just trying to figure out, do we have an actual plan in place yet?'",
        "'speaker_5': 'So the current budget, the 856 million covers phases one and two of the project, which includes land acquisition, some infrastructure in and around the site. The 1909 stadium arena actually falls in phase three, so we do not have designated funds specifically for its restoration.'",
        "'speaker_5': 'So part of this designation allows us to start to go after grants. And the first would be a structural assessment, and then we'd be looking at other grants to restore the building. But my hunch will be that we would look for partners to work with us as we identify the final use of that, that old building.'",
        "'speaker_1': 'Yeah. So just be I'm sure you're well aware the restoration that occurred at the capital and the rehabilitation of Union Station, somewhere in between, there would be nice to sort of restore the grandeur, the sort of exterior glory of that and the ramifications that that has on the interior.'",
        "'speaker_1': 'If those clearer story and all those windows were reintroduced would be pretty impressive. And then when you're doing your research, you mentioned Pike Place do take a look at Atwater Market in Montreal has similar sort of relationships to a two expressway freeway mass transit in a sort of moderate to low income community.'",
        "'speaker_1': 'But it is a year round indoor outdoor market in a climate that is not unlike Denver's. So it's a very good analogy. Plus, it has a walkway. I mean, actually both a canal and a bikeway get immediately within walking distance as well.'",
        "'speaker_1': 'So it's a very, very good analogy for this and.'",
        "'speaker_5': 'We'll add that to our list.'",
        "'speaker_1': 'Thank you. And just one more comment. But John, you mentioned well supported application. And I just want to go on record that those prior years that you've also been here while I've been on council were equally well supported in that they had tons actually tons more community support than I see here, a unanimous votes by landmark.'",
        "'speaker_1': 'And so just because it's owner designated doesn't take away from the fact that those were also well supported applications.'",
        "'speaker_10': 'I would absolutely agree. The the aspect of of of, you know, the aspect of saying that this is a well supported application. We have several of these that happen all the time. And of course, the ones that get a lot of press and the ones that fill up the the council chambers are generally the one.'",
        "'speaker_10': 'They're a little bit more contentious. But, you know, it would be wonderful if we actually had many, many more people here for an event like this, because I think this is going to be a really good feel good story for the entire city of Denver.'",
        "'speaker_10': 'And also, you know, obviously for the National Western Stock Show and the whole future that it begins here with the with the preservation of this very important.'",
        "'speaker_1': 'Piece.'",
        "'speaker_10': 'Of the National Western stock. And then we can take that and then and run with all of the other things that are planned for that site.'",
        "'speaker_1': 'Awesome. Thank you. Thank you, President Pro Tem.'",
        "'speaker_2': 'You know there are any other questions for Constable 215. All right. This public hearing is closed. Comments by members of council. Let's start with Councilman Brooks, because it's in District nine. Then we'll go with Councilman Flynn. Go for it, Councilman.'",
        "'speaker_1': 'Thank you, Mr. President. First I want to say, uh, do not let the absence of Globeville area Swansea, a citizens advisory committee at the National Western Show for you. Because they're not here. Someone we're here just got a blow to the stomach around marijuana and they left.'",
        "'speaker_1': 'But there is a ton of support around this project. And, you know, this is one of those collaborative projects that you just got to be proud of, of the owner, the neighborhood, the community, the support of to see all coming together.'",
        "'speaker_1': 'And so really excited about that. And it's a job well done for thinking about places to emulate. Granville Island in Vancouver is another man, just great space that encompasses a lot of what you talked about. I think the process that happened with.'",
        "'speaker_1': 'The community here folks at the national western in D.C. see Kelley his team. Historic Denver landmark commission actually meeting at the site. I've never seen that before was it's a best practice. I don't know how many times you can pull that off, but that was great to see.'",
        "'speaker_1': 'Commissioners actually walked the site with lay folks like myself. And and you could really and I'll just mention one piece. The 1909 arena sits within another structure that was built several years later with just I mean, inches it did not touch the 1909 arena.'",
        "'speaker_1': 'Inches of space between it and you could really go in and notice the difference which kept that structure in place. I've been to the 1909 arena many times. Never have I really sat in the seats. I mean, people are literally back there.'",
        "'speaker_1': 'Little people. Little people. So to be able to see the historic nature was just incredible. And so I will be supporting this. I hope we you know, this is this is something I think the community can come around.'",
        "'speaker_1': 'But I think on an a macro level, to see more and more historic structures be supported by owners community, the historic community is is is a hope for the future. So I hope we see a lot more of these.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Brooks. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. Pro tem, it's it's really an honor to be had any role at all in designating structure for landmarking that is as significant as this one. And I know that there are going to be changes, interior changes.'",
        "'speaker_6': 'But when you walk into that building and I was going to say it takes you back, but it doesn't really take you back into the past. It takes you into the heart and soul of what made this city.'",
        "'speaker_6': 'And that's what's so beautiful about it. And it's it's just an honor and a pleasure to be able to vote. Yes. And that's really all I wanted to say, Mr. President. Thank you.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Espinoza.'",
        "'speaker_1': 'Yeah. I just wanted to thank the stock show and everybody involved with, you know, bringing this designation, an owner designated application. It's it's just, you know, it doesn't have to happen. And it did. And so I thank you for that because it's an important piece of Denver history.'",
        "'speaker_1': 'And then, Councilman Brooks, just four words, high fructose corn sirup. That's the difference between back then and now. So I hope in the future, Kelly, as you're making this the food mecca of the world or agricultural mecca of the world, we sort of try to address our sugar problem.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman. Councilwoman Black.'",
        "'speaker_8': 'Thank you. And thank you all.'",
        "'speaker_11': 'We had a great discussion in our committee meeting and delved more deeply into the topic. And I just wanted to say thank you for all of your hard work. Clearly, we're all really excited about this. So thank you.'",
        "'speaker_2': 'Thank you, councilwoman. Councilman.'",
        "'speaker_5': 'I just want to congratulate you also, Kelly, for the leadership you bring to the National Action Center. And the development is going to be quite an asset and a really jewel for Denver. And not only the new facilities and new partnerships you're bringing to the side, but also the most important thing, preserving this historic part of the'",
        "'speaker_5': 'important part of the structure. So graduations and we look forward to a great, great National Resource Center.'",
        "'speaker_2': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. I'm very excited and pleased to have the opportunity to support this designation. And I want to give just a little bit go a little bit East Coast here. So when I came out in 1971 to Colorado, I really expected I would be in the midst of the Wild West and there would be simulated'",
        "'speaker_4': 'gunfights on the streets and there would be all this stuff. And I was quite seriously really surprised at how little respect the city seemed to have for its Western heritage. You know, we had the I discovered the stock show early on, you know, for several weeks each year, but then that feeling kind of went dormant.'",
        "'speaker_4': 'And I am really looking forward to seeing the transformation out on the National Western Center grounds and expect that we will finally give Denver's Western heritage a real showcase that it deserves. So, again, I'm real happy to support this.'",
        "'speaker_2': 'Thank you. Councilman Cashman, are there any other comments? All right. I just wanted to say I am glad this is going to be designated. I think it's an amazing arena. I remember walking in before we had the the amendment on.'",
        "'speaker_2': 'Well. Before to see. And it's falling apart. So I am glad that this is going to get designated. I'm glad we have resources pouring into this. This is one of those structures that we just cannot lose. It's overshadowed by the skyline most of the time.'",
        "'speaker_2': 'But we cannot lose this. This is an amazing arena. So much history has been here. And I'm looking at both of you in different capacities. You've worked really hard and to help make this happen, you, sir, as well.'",
        "'speaker_2': 'But also, I think one thing that we can one group that we cannot thank you enough and is the voters of our city. We wouldn't be here if it weren't for that. So thank you.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_2': 'Councilman Brooks?'",
        "'speaker_1': 'Yes, I'm I'm sorry. I just want to say every time and a big issue comes up in this part of the district, I never say this enough, but I just got thank Councilwoman Monteiro. Who. Yeah, she teed up everything.'",
        "'speaker_1': 'I mean, I've only been over this for six months, and so I just want to thank Councilwoman Monteiro and her leadership for 12 years in this district. Thanks.'",
        "'speaker_2': 'Thank you, Councilman. Madam Secretary, I think that's it. Can we have a roll call on Council Bill 215?'",
        "'speaker_3': 'Brooks Clark. All right. Espinosa. Hi. Flynn. Hi. Gilmore. I can.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_3': 'I can eat.'",
        "'speaker_1': 'You.'",
        "'speaker_3': 'SUSSMAN Black eye. Mr. President.'",
        "'speaker_2': 'All right. BROOKS You're hanging fire. Sorry. All right. Madam Secretary, close the voting. And as a result, 11 eyes. 11 Eyes Council Bill 215 has passed. On Monday, May 16, Council will hold a required public hearing on Council Bill 216 Changing the zoning classification for 1400 Race Street.'",
        "'speaker_2': 'Any protests against Council Bill 216 must be filed with the Council offices no later than noon on Monday, May 19. Seeing that there's no other business before this body today, this meeting is adjourned.'"
    ]
}