{
    "A bill for an ordinance amending Section 14-131 of the Denver Revised Municipal Code (DRMC) to delete the residency requirement for the Municipal Public Defender Commission. \nThe Committee approved filing this item at its meeting on 6-19-19.": [
        "'speaker_0': 'called out. Did I miss anything? All right, Madam Secretary, please put the first item on our screens. Councilman Flynn, please go ahead with your comment.'",
        "'speaker_7': 'Thank you, Mr. President. I just wanted to know that I'm going to vote I to pass this forward to final reading, to publish it. But I do want to determine and I've asked staff to help with this as to how many of our boards and commissions still have a requirement to be a Denver resident to serve.'",
        "'speaker_7': 'Here we are opening up one of our commissions to service by people who do not live in Denver. And I don't know how other council members have approached this, but I know in southwest Denver and on the West Side in general, we have been seeking to have more of our own residents serve on these boards and commissions'",
        "'speaker_7': '. So I want to understand a little bit better before final next week what kind of efforts we've taken in that regard. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Madam Secretary, if you please put the next item on our screens and Councilwoman, can each go ahead with your comment?'"
    ],
    "A bill for an ordinance amending the Building and Fire Code of the City and County of Denver. Amends Article II, Chapter 10 of the Denver Revised Municipal Code to add amendment package 6 to the Denver Building Code and Denver Fire Code Amendments, to implement a new occupancy group, the R-X Occupancy Group, that generally provides for residential occupancy in sleeping units with an associated detached community building. The Committee approved filing this item at its meeting on 7-2-19.": [
        "'speaker_6': 'Thank you, Mr. President. Bill, 6 to 8 looks innocuous enough. It's a little change to the building and fire code of the city and county in Denver. But sometimes embedded in mundane city regulations are either barriers to those who are fighting for an equal opportunity to live and thrive in our community and opportunities.'",
        "'speaker_6': 'And so this is one of those changes which has been needed for some time to help pave the way for more tiny home villages. I want to first commend our building officials, Scott Prisco and his team, and all the folks who found ways to do variances repeatedly to be able to build the first tiny home village and'",
        "'speaker_6': 'then to move it to a new fight site. But we don't want there to have to be special exceptions each time. And so this building code amendment is a first step to making sure that relocated buildings can be built without foundations where they meet certain zoning requirements that will go through in a parallel ordinance that is going'",
        "'speaker_6': 'to be hopefully before this council at the end of the summer and into the fall. But it will also just enshrine some other minor changes to the bathroom codes and other things that will hopefully lower the barriers for tiny home villages.'",
        "'speaker_6': 'So I'm not calling this out for a vote, but I just want to call it out to thank the staff who is really my partner in finding a path to get this before the council much quicker than it would have if it waited for the rest of the building code amendments in the fall and to the beloved'",
        "'speaker_6': 'village and the folks with their team, both architects and construction folks who've really helped the city understand the kinds of flexibility needed to make temporary uses like this a little easier to get through the city system. So with that, I'm excited that this is on consent and it's the final reading.'",
        "'speaker_6': 'So after this, they will be able to take advantage of it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Kenny. That concludes the items to be called out this evening. Our bills for introduction are ordered published and we're now ready for the block vote on resolutions and bills on final consideration. Council members remember that this is a consent or block vote and you will need to vote by otherwise.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2701 Lawrence Street in Five Points. Approves an official map amendment to rezone property from G-MU-3 to U-MX-2 (general urban multi-unit to urban, mixed-use), located at 2701 Lawrence Street in Council District 9. The Committee approved filing this item at its meeting on 5-14-19.": [
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Calls me Cashman. Will you please be accountable for four, four, four, nine on the floor?'",
        "'speaker_5': 'And first, God bless you, Mr. President. Yes, I'd be glad to. I move the council bill 19 0449 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The required public hearing for council bill 449 is open. May we have the staff report and you are not? Teresa Lucero I also have it on fairly good authority that today is your birthday, my goodness.'",
        "'speaker_0': 'And you are hanging out late with us on your birthday.'",
        "'speaker_4': 'Indeed, Mr. President.'",
        "'speaker_0': 'Well, happy birthday and thank you. Thank you for your hard work.'",
        "'speaker_4': 'Yeah, my name is Kyle Dalton. I'm with the Department of Community Planning Development, and I am substituting for my colleague who was out sick tonight with a public hearing for 2701 Lawrence Street. This application is located in Council District nine in the five point statistical neighborhood, and it is requesting to rezone from the general urban multi-unit, residential'",
        "'speaker_4': 'zoned district of up to three stories to the U.S. Max two zone district, which is an urban context district that allows a mix of residential and commercial uses, but only up to two stories. The Zone District is intended to promote and protect residential neighborhoods while allowing transitional commercial development that allows townhouse, general and shopfront building forms up'",
        "'speaker_4': 'to a maximum height of two stories and 30 feet. I'll go through some slides that describe the existing context. I'll explain the process, and then I'll go through the five review criteria for a rezoning application. So this site is located at a transition point between primarily mixed use zoning to the north and the West, illustrated in the'",
        "'speaker_4': 'pink color and multi-unit residential zoning to the south and the east and the orange color. So it's currently zoned Gma3, which as I mentioned, is a multi-unit residential district which generally does not allow commercial. The existing the existing building on the site is a one story commercial building that was built before the zoning was put in place'",
        "'speaker_4': '. It's allowed to continue as a commercial building, but it cannot expand and there are limitations on the reuse of the structure for other commercial uses. So they're seeking to rezone in order to expand the one story commercial building to a two story commercial building, which they cannot do under the current zoning, which they could do if council'",
        "'speaker_4': 'approves their rezoning. Tonight, in terms of the land uses of the surrounding area, that red color on the site indicates that it is an office building today. You see near the north and west, generally red and purple colors that are office commercial industrial again to the east.'",
        "'speaker_4': 'In the south are the orange colors indicating residential. The deeper yellow color, deeper orange is multi-unit residential. So again, this is right on the edge between a residential area and a mixed use commercial area. Here's some pictures of the existing context around the site.'",
        "'speaker_4': 'The top is the subject site that one story commercial building around it. You see a mix of residential and commercial structures in the surrounding area ranging in height from 1 to 2 stories and occasionally three stories. In terms of the process.'",
        "'speaker_4': 'This application was first filed last August for a different zone district for a more intensive mixed use three storey zone district. They revise their application and submitted a new application to us in January of this year for the zone district that you have before you tonight, the UMass two story zone district.'",
        "'speaker_4': 'After review, a notice was published of the Planning Board Public Hearing and the planning board heard it had a public hearing which they unanimously recommended to approve the application. The Land Use Transportation Infrastructure Committee move this forward on May 14th and the public hearing tonight has been properly noticed in accordance with the code.'",
        "'speaker_4': 'In terms of the public feedback we received on this application, there's one letter support from a registered neighborhood organization, Curtis Park Neighbors, Inc., who have included an executed good neighbor agreement that they have reached together with the applicant.'",
        "'speaker_4': 'And there are four other comment letters received for the original request for up to three stories mixed use, all in support of the proposal. So there are five review criteria that staff have to review, planning board after review and making their recommendation and that City Council ultimately reviews in making the final decision.'",
        "'speaker_4': 'I'll walk through them briefly one at a time. There's much more detail in your staff report that Theresa submitted to you. So first, is that a rezoning application must be consistent with adopted plans. There are three plans that city councils adopted that apply to the Site Comprehensive Plan 2040 Blueprint, Denver 2019 and the Northeast Downtown Neighborhoods Plan'",
        "'speaker_4': ', which was adopted in 2011. I'll briefly walk through each of them. The comprehensive plan 2040 adopted earlier this year has a number of goals and strategies that we found advanced and were consistent with this application, including promoting infill development at a center city location where infrastructures and services are already in place and promoting small, locally owned businesses'",
        "'speaker_4': 'that reflect the unique character of Denver. So we found that it was consistent with comp plan 2014. Turning to Blueprint Denver 2019. Again, there are a number of stated goals in Blueprint Denver that we found that this application was consistent with, including supporting a welcoming business environment and enhancing the overall character and sense of place of neighborhoods'",
        "'speaker_4': '. But Blueprint Denver also includes a lot of mapping that I'll go through as it relates to this application. First Blueprint Denver mapped the city in terms of neighborhood contexts and this map and blueprint. Denver identifies this site and that light orange strip as being in the general urban context, which is a transition between the urban center context'",
        "'speaker_4': 'to the north and west and the urban neighborhood context to the south and east. Generally speaking, to a blueprint, Denver describes the general urban context as being primarily multi-unit residential, along with one and two, yet residential and commercial embedded in the context.'",
        "'speaker_4': 'And there are regular grid block patterns of streets. The urban neighborhood context that the applicants have requested is rather similar in that a regular grid block pattern is present of streets. A generally has more smaller multi-unit, residential and commercial embedded within one and two unit residential.'",
        "'speaker_4': 'They are asking for a UMTS two zone district, which is consistent with this context description, but it's also consistent, generally speaking, with the mapping of this area. Given that blueprint, Denver does indicate that context are mapped broad scale at a citywide scale and not block by block, and that some limited flexibility can be used in interpreting whether'",
        "'speaker_4': 'to approve a rezoning, an application based on the application that the applicant submitted and the feedback that we received from the neighborhood and the neighborhood organization that this was an appropriate zoned district for the site. We found it consistent with the blueprints general direction in this area blueprint Denver also identifies future places in this site is is'",
        "'speaker_4': 'at the edge of a high medium residential future place which is described as something having a mix of low to medium scale multi-unit residential areas with embedded mixed use distributed throughout the place. Heights are generally up to eight stories in the general urban context, or up to five stories in the urban context.'",
        "'speaker_4': 'Again, with the request for a two storey zone district. This is within the maximums that are proposed by Blueprint Denver. A Laurence Street is a residential collector street, which is primarily residential with other uses, and it generally is a higher traffic street than a local street.'",
        "'speaker_4': 'It collects movement from local streets and conveys them to arterial streets. The Cross Street 27th is a local street, which is designed for high property access and not high movement of vehicles. And then Bluebird Denver identifies different growth areas within the city.'",
        "'speaker_4': 'It channels most growth to regional centers, community centers and corridors and some other districts. But it also acknowledges that other areas of the city which this is mapped, as are expected to see some growth, more limited growth and blueprint.'",
        "'speaker_4': 'Denver sets a target of around 20% of new housing growth or 10% of new employment growth by 2040. In areas such as this one. So on balance, looking at all of the plan criteria, we did find that the application was consistent with Blueprint Denver.'",
        "'speaker_4': 'Finally turning to the Northeast Downtown Neighborhoods Plan adopted in 2011. It provides guidance both about land use and height. The land use concept here is urban residential, which is a higher density residential, primarily with some complimentary commercial called for in the plan, a mixture of various housing types.'",
        "'speaker_4': 'It's located in areas that transition from residential neighborhoods to more intense, mixed use neighborhoods as this one is. And in the height map, it's recommended for up to three stories in height. So again, with a few emacs toos on this story zone district proposed here, we found that it was consistent with these plan recommendations.'",
        "'speaker_4': 'There also are additional plan goals and objectives identified in the plan that highlight the goals of, of and of retaining existing buildings, whether they're historic or not, and that generally promote the kinds of built form character that the mix to zone district would enable.'",
        "'speaker_4': 'The plan also specifically calls for re-using existing commercial buildings for commercial purposes and accommodating them on a case by case basis in consultation with the neighborhood. And again, as I mentioned earlier, this applicant did consult with the neighborhood, reached agreement in terms of both a letter and a good neighborhood agreement for the use of this existing commercial'",
        "'speaker_4': 'building. So we found it consistent with the specific goals of this neighborhood plan. So that concludes our analysis of the first criterion. The second is that district regulations must be uniform because their rezoning to a standard zone district that applies the same standards as in any other home to zone district in the in the city, there would'",
        "'speaker_4': 'we would be applying the zone district regulations uniformly. Rezoning must also further the public health, safety and welfare. And we found that this application would, by allowing a moderate level of reinvestment in this site, consistent with the area character and consistent with the adopted plan direction of the city.'",
        "'speaker_4': 'The fourth is that there must be a justifying circumstance, some change that justifies the request to rezone the property. In this case, there are at least two that this site meets. Since the date of the approval of the existing zone district in 2010, there have been changed and changing conditions in the surrounding area, including some nearby residential'",
        "'speaker_4': 'development and commercial development that generally would support an increase of a second story into this office building and also the neighborhood plan adopted in 2011, pointing in the direction of of different zoning possibilities in this area are appropriate change conditions to justify rezoning the property.'",
        "'speaker_4': 'Finally, the rezoning has to be consistent with the neighborhood context and the intent and purpose of the zoned district as articulated in the zoning code. Again, there's more detail in your staff report, but as I indicated earlier, we did find that the site was an appropriate site for an urban neighborhood context, for mixed use, for up to'",
        "'speaker_4': 'two stories. And so we found it consistent with this criterion and having reviewed it against all five criteria and found that it met all the process requirements of the code, we recommend approval.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening. So if you signed up to speak on this one, please come up to the front bench and I'll call you up. First up is Justin Fries.'",
        "'speaker_5': 'Good evening. Justin Frieze, studio architecture representing the client. So just a little background on this building. It is kind of a collection of some bungalow houses and commercial building. That was the City Laundry established back in the late 1800s.'",
        "'speaker_5': 'It's been a commercial laundromat in some form up until I think about the seventies. The reason for the rezoning request is that the current zone district would not allow any commercial development or expansion as a coworking space as they try to expand or change walls on the inside of the building.'",
        "'speaker_5': 'It requires a special use for a variance permit. Any time a construction permit is filed. For that reason, we submitted originally a you are agmx3 zoning that still only allowed for about 50% mixed use. So then we went back to the neighborhood with a um x three and two planning and discussed that one.'",
        "'speaker_5': 'The U three district was pretty broad and there's one building in the district that's the Greyhound bus depot building that allows that use. So in back and forth with the neighborhood, the, um, x two, which they've utilized throughout the neighborhood on a couple of a couple of smaller projects, seemed to be the best fit.'",
        "'speaker_5': 'There was still some uses within that district that the neighborhood was a little bit hesitant on. One was drive thrus, another one was something more of a autobody garage type of use. So the Good Neighbor agreement that was signed between Curtis Park neighborhood and the owner of the building Limited those uses as as as the planner mentioned'",
        "'speaker_5': '. The neighborhood plan mentions dealing with these embedded commercial structures on a case by case basis, which we think we've kind of step through the process, noting that along the way. And I believe that's all I have for you.'",
        "'speaker_5': 'I'm here to answer questions and so is the owner. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pearce.'",
        "'speaker_9': 'Good evening. Members of council. My name is Jesse Paris. I'm represented for Denver Homicide. Low Black Star Action Movie for self-defense and Positive Action Commitment for Social Change. And I was an at large candidate for the May 2019 election.'",
        "'speaker_9': 'I was on top of the ballot, almost got 15,000 votes with no money. I was needed for against this one. Very familiar with this building, the laundry, you know, as an east side native, you get familiar with these things when you've been in the neighborhood for 20 plus years.'",
        "'speaker_9': 'My questions were what is going to be the AMI level for the housing that was proposed for this this rezoning and exactly what businesses are going to be here? Because right now, this is a hub for a lot of nonprofits that do a lot of awesome work in the community.'",
        "'speaker_9': 'And I would hate to see that be lost. So so, Michael, please answer my question, as I would greatly appreciate it. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jeff Baker. Sir Geoff Baker. All right, that concludes our speakers. Are there any questions from members of council? Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_3': 'Kyle, could you.'",
        "'speaker_7': 'If you know the answer, why was why was this not given an appropriate Southern district to have the use in 2010 to have the use be conforming in the first place?'",
        "'speaker_4': 'Sure. So in 2010, when city council rezone about 75% of the city, the criteria that they established for that process through their zoning code task force were threefold. One was existing conditions. So if they were zoning only to existing conditions, they might match the commercial use that was there.'",
        "'speaker_4': 'But the other two were adopted plans and then existing entitlement. And so the existing entitlement here was R3, a multi-unit residential district that's very similar to the zone district that they have now. And then they adopted plans. Urban, residential, we're generally speaking about a mix of either multi-unit, residential or commercial.'",
        "'speaker_4': 'So on balance, at the time, the council decided to lean more towards the previous entitlement than the current use of.'",
        "'speaker_7': 'The current year. So what we're doing or what the request is, is to apply a district designation that acknowledges the current use.'",
        "'speaker_4': 'Right. And the other way.'",
        "'speaker_7': 'That's always present.'",
        "'speaker_0': 'Thank you, Councilman Flynn. All right. Seeing no other questions. The public hearing for Council Bill 449 is closed. Comments by members of Council Councilwoman CdeBaca.'",
        "'speaker_2': 'This is a great space.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_1': 'This is a great space that has.'",
        "'speaker_6': 'Housed many community organizations, as Jesse mentioned, honors that honor the history.'",
        "'speaker_1': 'And legacy.'",
        "'speaker_6': 'Of this building and continue to use it in a way that open space to community. I fully support this reason and would love to see.'",
        "'speaker_1': 'More people who are doing reasons that.'",
        "'speaker_6': 'Actually respect the communities that they're in and reason in this manner.'",
        "'speaker_0': 'Thank you, Councilwoman CdeBaca. See no other comments. I'll just add. Thank you very much for being here and pinch hitting on your birthday. Appreciate it. Thank you to the staff for the great staff report. I think that this clearly meets the criteria and I'll be voting yes this evening.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_2': 'CdeBaca I Black.'",
        "'speaker_3': 'Flynn I.'",
        "'speaker_2': 'Gillmor.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon, i.'",
        "'speaker_4': 'Hanes I.'",
        "'speaker_2': 'Cashmere. I can eat. Ortega. Sandoval.'",
        "'speaker_1': 'I saw you. I. Torres. Hi.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please. Because voting and Notes Results.'",
        "'speaker_2': '13 eyes.'",
        "'speaker_0': '13 I accountable for for nine has passed. On Monday, August 19th, Council will hold a required public hearing on Council Bill 576 changing the zoning classification of 4600 South Kipling Street and a required public hearing on Constable 577 changing the zoning classification for 1634 1640, 1642, 1650 and 1680 Sheridan Boulevard.'"
    ]
}