{
    "Approves a rezoning of 2157 Downing Street from PUD 96 to U-MX-3 in Council District 8.  (LAND USE TRANSPORTATION AND INFRASTRUCTURE) Approves a rezoning of 2157 Downing Street from PUD 96 to U-MX-3 in Council District 8.  The Committee approved filing this bill at its meeting on 3-11-14.": [
        "'speaker_3': 'hearings. Councilwoman Kennish, will you please put Council Bill 153 on the floor? Thank you, Madam President. I move that council bill.'",
        "'speaker_2': '153 be placed on final consideration and do pass.'",
        "'speaker_3': 'Thank you. It has been moved and seconded. Council Bill 153 approves a zoning map amendment. The Council is required by law to conduct hearings on zoning map amendments and Council's actions are subject to court review to provide a record for court reviews.'",
        "'speaker_3': 'Testimony is recorded and any items presented to the Council are marked as exhibits and become a part of the record. They may be picked up from the council secretary after 30 days or after the conclusion of any court cases.'",
        "'speaker_3': 'Speakers We already told you how to begin your remarks. The public hearing for Council Bill 153 is open. May we have the staff report?'",
        "'speaker_1': 'Good evening. Courtland Heiser with Denver Community Planning and Development here to present a proposed rezoning for 2157 Downing Street. The proposal is to rezone from the existing planning and development number 96 to aumx3 zone district. This map shows the location of the proposed rezoning within the city, within Council District eight and within the Five Points neighborhood.'",
        "'speaker_1': 'This closing view shows the specific location of the property. It's located near the corner of Downing and 22nd Avenue. This would be the eastern edge of the San Rafael neighborhood within five points. And it's a block or two north of the current reconstruction project for exemplar Saint Joseph's Hospital expansion, which shows up pretty well in this aerial'",
        "'speaker_1': 'from 2012. The property. The current uses restaurant and lounge named Randalls. The property is a fifth of an acre in size. Current zoning is already mentioned as Pudi A96 and the request is to rezone to a you mix three zone district.'",
        "'speaker_1': 'First, a little bit of information about pad 96. This was created in 1983. The intent was to enable the renovation and expansion of Piers Supper Club, which is a long established use at the time that many of you may remember, the development standards, as was common of this era of planned unit developments, were specific to the proposed'",
        "'speaker_1': 'renovation of Piers. This means that the use that was proposed at the time is the only use that is allowed by the PWD. The only thing you can have in this building is a restaurant and lounge. Similarly, all of the development standards are also specific to how the building was constructed and renovated.'",
        "'speaker_1': 'Setbacks, building heights. Everything is exactly what you see on the ground. The request is to rezone to a standard zoned district urban neighborhood mixed use three stories max height the umx3 district. This map shows the context for the zoning in the area and as you can see, the adjacent properties along Downing Street already have the UOM three'",
        "'speaker_1': 'zoning that the applicant is seeking an exception to. This is the property due north which also has PD zoning as a liquor store zone feud 616 and then to the west, across the alley is a USC A1 zone district and a residential area within San Rafael.'",
        "'speaker_1': 'In terms of current uses, current use in eating and drinking, establishment adjacent uses to the north, there's a liquor store to the south, a vacant lot to the east across Downing Street, multifamily residential building and to the west.'",
        "'speaker_1': 'Single family residential homes across the alley. These images show each of those uses. So the subject property is in the image at the bottom. The image at the top is the liquor store to the north. On this slide.'",
        "'speaker_1': 'The image at the top is the multi-family residential building across the street, Khobar Towers, the property shown in the image. At the bottom of the page here is the vacant lot to the south of the subject property. Here's a view of the property from the parking lot looking towards Downing Street.'",
        "'speaker_1': 'And then the image at the bottom shows the single family homes that are located across the alley to the west. In terms of process planning, board had its public hearing on this application back in February and recommended approval, then went to Ludy and City Council tonight.'",
        "'speaker_1': 'The public outreach followed CPD's standard notification process for rezonings, which included notifying all of the registered neighborhood organizations in the area, as well as affected city council members and notification signs were posted on the property prior to both the planning board and city council public hearings.'",
        "'speaker_1': 'We have received one letter of support that coming from the Uptown Hospital District Urban Design Forum that's included as an attachment to your staff report and to date, zero letters of opposition. This slide outlines the five review criteria for rezoning.'",
        "'speaker_1': 'We'll go through each of these. The first is consistency with adopted plans. There are four plans that apply to the subject property. We'll walk through each of them now. The first is comp plan 2000. The proposed rezoning is consistent with a number of comp plan 2000 strategies related to environmental sustainability, mobility, land use and legacies.'",
        "'speaker_1': 'One thing that most of these strategies have in common is promoting mixed use development and infill in existing neighborhoods and increasing the range of services available to existing neighborhoods. Blueprint. Denver has a land use concept for this property of commercial corridor.'",
        "'speaker_1': 'That's how it treats all of the properties on the stretch of Downing and identifies it as an area of stability. As you may recall, Blueprint Denver does identify two flavors of areas of stability committed areas, which is really all about preserving the existing character and reinvestment areas, which are areas where some amount of redevelopment, infill reinvestment would'",
        "'speaker_1': 'be necessary to meet the planned vision. We would consider Downing Street a reinvestment area within an area of stability because of the difference between the existing development and the plan vision that set forth the Street classification and Downing Inn blueprint.'",
        "'speaker_1': 'Denver is mixed use arterial. The next plan on the list is a rather old one the Welton Downing Triangle Plan, which was adopted back in 1986 but was re adopted with Comp Plan 2000. This plan provides guidance for the triangle shaped area that's roughly bounded by California 20th AV and Downing, and it identifies the subject property as'",
        "'speaker_1': 'belonging to Sub Area nine, the City Park West Edge. And according to the plan, the Sub Area features a mix of office, retail and residential uses that have developed over time and work quite well together. The plan recommends studying the zoning in this area for possible revisions to help ensure that future development is of a scale that's'",
        "'speaker_1': 'compatible with the corridor and the adjacent neighborhoods. This, you know, recommendation was fulfilled largely when the city was re zoned in 2010. The R for zoning that was prevalent in this area at the time was remapped and sundowning.'",
        "'speaker_1': 'Most of the properties received um x three zoning, which is intended to be compatible with the adjacent residential neighborhood. The last plan on the list is a northeast downtown neighborhoods plan adopted in 2011. It has a recommendation recommendation A-2, which specifically addresses Downing Street and talks about moderate intensity development along Downing and some other corridors within that'",
        "'speaker_1': 'plan area help helping to transition to adjacent residential neighborhoods. The plan also provides specific guidance in the form of land use and building height maps. The recommended land use at the site, according to the Northeast Downtown Neighborhoods Plan, is mixed use and the maximum recommended building height is three stories.'",
        "'speaker_1': 'So upon conducting this review, CPD has found that the rezoning is consistent with all four of the applicable land use plans in this area. Moving on to the second criteria uniformity of district regulations. This rezoning would bring an old code PD into a standard Denver's zoning code districts.'",
        "'speaker_1': 'Therefore, the staff opinion is that it would increase the uniform application of district regulations. The third criteria is to further the public health, safety and welfare. And the finding is that by implementing the city's adopted land use plans, that we would be furthering the public health, safety and welfare.'",
        "'speaker_1': 'The fourth criteria is justifying circumstances. The justifying circumstance that was selected by the applicant was changed conditions. Evidence of the change in conditions can be seen a block or two to the south with the extensive reconstruction of the exemplar Saint Joseph's campus, as well as Downing Street itself.'",
        "'speaker_1': 'Only a few years ago, Downing in this area was shaped in a semi-circle sort of configuration has since been straightened out. The neighborhood is changing quite a bit, and the final criteria is consistency with neighborhood context, zoned district purpose and intent.'",
        "'speaker_1': 'And staff does find that the proposed rezoning to use Max three would lead to development that is consistent with context and zoned district purpose and intent. So upon conducting this review, CPD does recommend approval of this proposed rezoning based on the finding that all of the review criteria have been met.'",
        "'speaker_3': 'Thank you very much. We have four people signed up to speak and I will call you one, one after the other. David Bergner.'",
        "'speaker_1': 'David Bergner. I represent the applicant and I reside in the city of Denver. I'm just here to answer any questions you may have.'",
        "'speaker_3': 'Okay. Thank you very much, Mr. Berger. Robert Miller.'",
        "'speaker_1': 'My name is Robert Miller. I live in the city of Denver. I represent the ownership as well.'",
        "'speaker_3': 'Thank you. Thank you very much.'",
        "'speaker_1': 'We are here to answer any questions you may have.'",
        "'speaker_3': 'All right. Thanks very much, Mr. Miller. Charles Brandt, again.'",
        "'speaker_1': 'My name is Charles Braddock, and I live at 2105 Lafayette Street. I'm the chairman of the Hospital District Urban Design Forum. The area surrounding the proposed rezoning is probably the most studied zoning area in the whole city of Denver, and that's mostly because of our constituents that the Hospital District Urban Design Forum and also the immense amount'",
        "'speaker_1': 'of work that Carl and Madison did years ago during the process of creating the current zone map. Careful consideration was given to what appropriate zoning for that block of Downing Street should be, and it was the consensus that it should it should be as the proposed rezoning for tonight, when the proposal was made, that that would be'",
        "'speaker_1': 'dissolved and a baseline zoning be reinstituted. Our organization looked at the proposed rezoning very carefully, and it was our unanimous opinion that the rezoning should occur. I'd be happy to answer any questions.'",
        "'speaker_3': 'Thank you very much, Mr. Brannigan.'",
        "'speaker_4': 'Sekou and. Oh.'",
        "'speaker_0': 'Kevin Sekou Flextronics, a movement representing poor, working, poor and homeless people.'",
        "'speaker_1': 'We stand opposed to the rezoning of this particular property. And there has been articles written on this particular article on this particular property because of its historical relationship to the black community. That building has been there for over 50 years, serves three generations of black people.'",
        "'speaker_1': 'The rezoning will allow them to tear the building down and they have every intention of tearing the building down. Now, Councilman Brooks has received a lot of emails and opposed to not only the sale of the building, but the tearing down of the building and for whatever set of reasons.'",
        "'speaker_1': 'And that's pretty much going to have to be between his conscience and God. He has chosen to align himself up and align itself with developers, the ones who pay his political bills. And he's not from the area. He's from Boulder and California.'",
        "'speaker_3': 'We are we are we are not going to address council people directly or to speak to.'",
        "'speaker_1': 'No problem the.'",
        "'speaker_3': 'Council person directly.'",
        "'speaker_1': 'No problem. So here we go. Continued gentrification of the neighborhood. And it doesn't apply to the comprehensive plans because one of the aspects of the comprehensive plan was to safeguard the integrity of the neighborhood, both the five point plan, the comprehensive plan, 2000 and on down the road, these aspects of their and this does not qualify for'",
        "'speaker_1': 'that. So why have these plans if we're not going to go along with them? It's been hundreds of thousands of dollars on plans that we're not going to do when money comes in and impossible. So now this is a question of integrity.'",
        "'speaker_1': 'That means what do you do when nobody listens? What do you do when nobody's showing up? Well, I'll close with a statement from Nelson Mandela when he was speaking to the white population in South Africa back in 1964 after the Charlottesville massacre.'",
        "'speaker_1': 'He said, you can come and you can oppress and you can murder and kill us and destroy our people. But I bet you you can't get out. But you can't get out. So come on, bring it down. I dare you.'",
        "'speaker_3': 'Take your seat, Mr. SOCO. Because when you take your seats, take your seat now.'",
        "'speaker_1': 'And you can.'",
        "'speaker_3': 'Take it back. Okay. Questions from the council. Councilman Brooks?'",
        "'speaker_1': 'Yeah. Thank you, Madam President. I'm Carl Cortland Houser. You know, one of my questions is not about the plans, because obviously they're congruent and consistent. But my question, this is the first rezoning where we did have a tenant who was not fully on board.'",
        "'speaker_1': 'Right. And so in the city of Denver, one of the things that we want to do is make sure that we have businesses that we're not putting out. And and there are some certain legal restrictions because, you know, there's an agreement on a tenant agreement with the owner and things like that.'",
        "'speaker_1': 'And so have you had this situation before? And what does CPD do in that type of situation? Well, the the rezoning itself isn't the mechanism that puts a business out of business. You know, the DOMA X three allows the exact use that was already there, the restaurant lounge.'",
        "'speaker_1': 'You could have that, um, x three. So it isn't the rezoning per se that, you know, creates that situation, but it does give in this case, you know, more flexibility to the owner of the property to do other things with it that are also allowed by the zoning.'",
        "'speaker_1': 'So my understanding is in this particular situation, an amicable agreement was reached. Yeah. You don't you don't have the the tenant business owner here tonight opposing the rezoning. Yeah. You know, and so this one, this worked out because some folks came together and the owner worked great with the tenant.'",
        "'speaker_1': 'But my fear is some of these in the future. And I'm just wondering, every plan that we went through was consistent. It was. Right, right. But there are those issues that do come up with with tenants. And I'm just wanted to CPD get involved with that at all.'",
        "'speaker_1': 'Is there any kind of review that happens that you when you're in the pre application stage with the owner at all to have that conversation? Not directly, no. The in this case, it is certainly a factor in this particular rezoning.'",
        "'speaker_1': 'A much more common situation that we find with these parties is that there isn't a tenant for the property and the the PD restricts the landowner from doing anything else with it. If you know, I have another rezoning that you'll see here in a few weeks where there's a property under the pad, he he only has two'",
        "'speaker_1': 'uses instead of one, but he can't find a tenant under those two uses and so needs to amend the pad to make it less restrictive to be able to lease. So that's a more common situation, I would say, than this one in my experience.'",
        "'speaker_1': 'So. So let me just ask one more question. The only way the tenant will have any any power is if he own a, you know, part of the building or anything like that. Right. If he was the owner and deciding on how to because he was around, he had no.'",
        "'speaker_1': 'Okay. Let me ask a question then. David Berger. Madam President, if that's okay.'",
        "'speaker_3': 'Go ahead.'",
        "'speaker_1': 'David. You know, as you know, this was contentious with some individuals in the community. Can you talk a little bit about the agreement that you came up with? The tenant, Randall and I, we came up with an agreement where we would forfeit the rent due to us from him for a period of three months.'",
        "'speaker_1': 'And he was paying 50 $500 a month in order for him to stay in business to save that money for the relocation of his restaurant. And that's what he's done. We have agreed to help him with the architectural plans to tenant finish of his new spot, which I have provided him.'",
        "'speaker_1': 'And he I think he is committed to the city. We've also offered to do some kind of artwork commemorating the building, as it was when it opened in 1947. The original owner, Mr. Pierre, has declined for us to do that.'",
        "'speaker_1': 'I don't know why, but the offer was out there and Randall accepted it and he was really looking forward to it. However, that was not something Mr. Pierre wanted. Last day of the restaurant was Saturday, and he had a party that he invited me to and I went and it was a good party and a lot of'",
        "'speaker_1': 'fun. Learned a lot. And Randall and I have become friends. And and. And did you guys have a contractual agreement for that? We did. That's okay. We did. Okay. Thank you.'",
        "'speaker_3': 'But the other question, Councilman. Okay. Thank you, Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Madam President. So, first of all, I guess I want to ask somebody from the planning office whether or not Landmark has looked at this property.'",
        "'speaker_1': 'They did look at it, yes. And it's not located in local landmark district. The building itself is also not designated.'",
        "'speaker_2': 'And the deed was it.'",
        "'speaker_6': 'Identified as a contributing building that was that warranted designation itself, even though it might not be in a historic.'",
        "'speaker_2': 'District.'",
        "'speaker_1': 'I asked that question as well, and their opinion was that the renovation that occurred in the eighties had significantly altered the building to such an extent that it would no longer be considered contributing if it were eligible.'",
        "'speaker_6': 'So even the use of it is not considered as part of that, even though the condition of the property itself has changed?'",
        "'speaker_1': 'That's correct. I don't believe that the use factors into that determination at all. It's just about the character of the structure. Okay.'",
        "'speaker_6': 'And then I just want to ask the property owner a question. So I'm assuming the lease with the previous tenant had.'",
        "'speaker_2': 'Expired.'",
        "'speaker_6': 'And that was why you.'",
        "'speaker_2': 'Worked out the arrangement.'",
        "'speaker_1': 'It was a month to month lease and our obligation to him was 30 day notice.'",
        "'speaker_6': 'Okay. And can you just say what you plan to do with the property?'",
        "'speaker_1': 'We are going to develop and build the 14 unit townhome project seven. Two buildings with seven units each.'",
        "'speaker_2': 'And to do that, you need to.'",
        "'speaker_6': 'Demolish the property.'",
        "'speaker_1': 'Correct. Okay.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Thank you. Carrie Ortega. That concludes our speakers and questions. I will close the public hearing and call on council members. Councilman Brooks.'",
        "'speaker_1': 'Thank you. Madam President, this this was a really interesting rezoning, as you guys saw in the presentation. From every viewpoint, this past, the planning and it lined up with with all the documents to get approved for the rezoning.'",
        "'speaker_1': 'But sometimes when we go through rezonings, the piece that we we fail to look at is all of the community aspects. And this certainly became apparent in this rezoning. Every registered neighborhood was on there and they were on board with it.'",
        "'speaker_1': 'But we didn't really talk to the the folks who come in to Randolph's every Saturday night and Friday night, and this is a viable business. And so Randolph's folks reached out to me and Councilwoman Ortega asked the excellent question and we did have historic Denver.'",
        "'speaker_1': 'Go and look at the building, see if there is any significance that we could kind of save or landmark. But you also understand that you have to be the owner of the property to do that. There are some ways around that, but obviously you you have to own the property and that didn't work out.'",
        "'speaker_1': 'And so I really encourage the burners to really talk to Randolph, to figure out a solution, a way that they could kind of come together. And I think in any development, you've got to collaborate with the community in the burners that do that.'",
        "'speaker_1': 'Randall was able to receive three months and turn around. That's Councilman Lopez at home. He received three months rent. And one of the things he asked us is, was there a location on Welton in five points that we could help him get into?'",
        "'speaker_1': 'So then we began to meet with the Office of Economic Development, Paul Washington. We looked at Charlie Cousins daughter, Dr. Rene Cousins King property. We also looked at Odell Berry's property and we agreed on a property that we could help them transition into.'",
        "'speaker_1': 'And OED is helping with some of the renovation. And so what started as really a tough story and a, you know, a rezoning that had a lot of conflict, I think we came around with some solutions and the property owner was great in that they bent over and said, hey, how can we how can we help out'",
        "'speaker_1': '? They are a they're architects. And they really helped with the designs of the new building and things like that. And so really appreciate that. And and going forward, I think in the future when we have these kind of conversations, I think, you know, for CPD and and other folks, a good question to ask is, you know, where'",
        "'speaker_1': 'are the tenants? What's the terms of the lease, have they been notified and things like that? Because this was a real surprise to the entire community. But we came up with a solution because the owners worked really well and Randall was nimble enough to to help start his business and on Welton.'",
        "'speaker_1': 'And so I'm glad that we came to a solution and I will be supporting this rezoning and thank you for for trying to save Spurs. I got phone calls from a lot of people who who I didn't get any emails, by the way.'",
        "'speaker_1': 'School didn't know what he was talking about, but I got phone calls and folks said, you know, I remember pears. I remember when I used to be there and and we felt like it was good enough to to preserve to preserve that history, to still have it in the five points.'",
        "'speaker_1': 'So it's a good news story.'",
        "'speaker_3': 'Thank you, Councilman Brooks. And see no other comments. I think we're ready for a roll call.'",
        "'speaker_2': 'Brooks Brown I thought I heard in each right. Lemon Lopez All right. Montero Nevitt I. Ortega Rob Shepherd, madam. President. Hi.'",
        "'speaker_3': 'Madam Secretary. Close the voting. That's the results of 12 eyes. The bill is passed. And thanks, everybody. See no other business for this body? This meeting is adjourned. Denver 87.'",
        "'speaker_2': 'Your city, your source.'",
        "'speaker_0': 'Denver eight on TV and online. To stay connected to your community. Your city. Your source.'"
    ]
}