{
    "Approves the Mayoral reappointment of Nadine Caldwell to the Stapleton Development Corporation Board of Directors for a term effective immediately and expiring 6-30-18, or until a successor is duly appointed.  (GOVERNANCE & CHARTER REVIEW) Approves the Mayoral reappointment of Nadine Caldwell to the Stapleton Development Corporation Board of Directors for a term effective immediately and expiring 6-30-18, or until a successor is duly appointed. The Committee approved filing this resolution by consent on 3-17-16.": [
        "'speaker_5': 'Thank you. This is a re-appointment of native Caldwell to the Stapleton Development Corporation. I just wanted to thank Nadine as the representative on Stapleton Development Corp. from Aurora. She has such a lengthy list of accomplishments, particularly in redevelopment of these brownfield sites.'",
        "'speaker_5': 'She was on the Lowry Redevelopment Authority. She was on the Fitzsimmons Redevelopment Authority, and she has been the Aurora representative on our Stapleton Development Corp.. She served on Aurora City Council, all during the construction of Denver International Airport.'",
        "'speaker_5': 'And she is I think she's been on Stapleton Development Corp. since the inception. And I just wanted to thank her for her service. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Can I, uh. Can I say any more? She's a remarkable asset to that team. All right. We're going to go to the next 1105. Councilwoman Ortega, would you like for us to do with this a question?'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_7': 'Run. Would you mind coming forward a little from Denver Human Services? So this is a contract for right of passage in the amount of $3,520,000, $20,080. And what I'm trying to understand is how many youth annually will that serve?'",
        "'speaker_7': 'And is this different from. The fact that we are closing the Family Crisis Center. Will these be some of the same kids? Will they be different kids? Help me understand.'",
        "'speaker_5': 'And I'm going to do a quick calculation here to get you the answer to your first question.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_6': 'It looks like that's about.'",
        "'speaker_5': '16 kids a month. That that can handle the cost are approximately 6000 to $7000 per month for having a kid in that level of care. And I'm.'",
        "'speaker_9': 'Sorry, I'm.'",
        "'speaker_5': 'Ron Mitchell. Good evening, everybody. The the second part.'"
    ],
    "Amends a contract with Rite of Passage, Inc. for an additional $3,520,080 for a new total contract amount of $4,300,300, to provide placements and case management services to youth in out-of-home care (2015-21670-02).": [
        "'speaker_9': 'Of your question. The FCC. They may have taken some of those kids in the past. So that that is a possibility. What happened is, is that that particular facility that specialized.'",
        "'speaker_5': 'In juvenile delinquents and the the division began using them for shelter.'",
        "'speaker_9': 'Care, essentially. So when kids when there's a limit reached at the detention facility, those kids have to go somewhere. It's a state law and they can put them into the custody, the department, or they can send them home with plans.'",
        "'speaker_5': 'And they put a number of those kids in the shelter program, and some of those kids end up staying there for treatment purposes.'",
        "'speaker_7': 'How many can they house on a given night? Do you know.'",
        "'speaker_9': 'At that facility? I don't know. They have about a 500 bed. Yeah, it's a very big facility.'",
        "'speaker_7': 'They located in Denver.'",
        "'speaker_5': 'They're located east of Denver. They're on the other side of four seven. The East.'",
        "'speaker_7': 'River.'",
        "'speaker_5': 'Yes.'",
        "'speaker_7': 'So. Okay. Thank you. I have no further questions.'",
        "'speaker_1': 'Thank you, Ron Ortega. All right, Madam Secretary, those were the resolutions around the bill's introduction. 173 Councilwoman Gilmore would like for us to do with this.'",
        "'speaker_4': 'Thank you, Mr. President. I would like to request a one hour courtesy public hearing on Monday, April 4th, 2016, on Council Bill 173, which approves the I-25 and Broadway station area plan. And Councilman Jolin Clark regrets that he's not able to be here in person and make this request, but he's on spring break with his children.'",
        "'speaker_4': 'So he's being a good dad right now. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Ma'am, there are no objections from members of council, and I see none will ever be required. Public courtesy one hour courtesy of public hearing 173 Monday, April 4th. Okay, go. The next one 183. Councilwoman Gilmore, would you like for us to do this?'",
        "'speaker_4': 'I just have a comment, Mr. President.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_4': 'Thank you, Mr. President. I want to make sure that constituents in District 11 and the viewing public understand that I'm sponsoring this tax amendment that will allow multi-family residential to extend from 62nd Avenue up to 64th Avenue in District 11 at the 61st and Penna transit oriented development site.'",
        "'speaker_4': 'It's a two block increase, and it will ensure that we have the density that is required to ensure that we have the retail development that we are currently lacking in District 11 and to really serve the commuter rail as a robust stop.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. In the comments or questions. 183. Seeing nine. We've got one more bill for introduction 169 Councilman, to tell you, would you like for us to do this?'",
        "'speaker_7': 'I need this out for a vote for the purpose of an abstention. I'm on the board of a nonprofit that receives some of the. From time to time, some of the Ryan White funds. And so I will be abstaining.'",
        "'speaker_1': 'You guys.'",
        "'speaker_7': 'I serve on that board.'",
        "'speaker_1': 'Councilman Brooks, can you make the motions for us tonight?'",
        "'speaker_9': 'Certainly, sir.'",
        "'speaker_1': 'Can you have 169 ordered published?'",
        "'speaker_9': 'Yes, I yes, I put 169 to be ordered.'",
        "'speaker_1': 'Published, moved in. Sacrament. Did you want to add anything else, Councilwoman Ortega? No. All right. We got any other comments? 169. Scene nine. Madam Secretary. Roll Call.'"
    ],
    "A bill for an ordinance changing the zoning classification for 725 West 39th Avenue.\n\n (NEIGHBORHOODS AND PLANNING) Rezones property located at 725 West 39th Avenue from I-A, UO-2 and I-B, UO-2 (Industrial 3,000 to 4,500 sq. ft. zone lot; Use Overlay allowance for billboard) to C-MX-20 (Urban Center, Mixed Use, 20 stories) in Council District 9 IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 12-9-15.": [
        "'speaker_1': 'The public hearing for Councilor Bill 937, as amended, is open. May we have the staff report?'",
        "'speaker_11': 'Good evening, Tim Watkins, Community Planning Development Case Manager for rezoning case number 2050 934 Property located in North Denver Council District nine. In the southwest quadrant of the Globeville neighborhood and specifically within the 41st of Fox station area.'",
        "'speaker_11': 'In fact, very close to the platform, as you can see here in this vicinity graphic, you see the property outlined in red just adjacent south to the 41st and Fox Station Area Platform Park. And you see the pedestrian bridge connecting Globeville to Sunnyside and Highland neighborhoods where continued pedestrian access has been made possible with a pedestrian bridge'",
        "'speaker_11': 'that is shown at 38th and anchor, which connects pedestrians further south to the city of Cordova Car Park in the South Platte River. The Gold line of transit line will connect from Denver Union Station North with this being the first stop to the north sometime this year in 2016.'",
        "'speaker_11': 'And there's also RTD bus Route eight, which connects along Fox Street between downtown North Denver and into Adams County. Fox Street is also anticipated as a future study for future bike route. Here's another view of the station, park and ride and infrastructure platform and pet bridge that's under construction and soon to open.'",
        "'speaker_11': 'And here's the property. The request is for 1.44 acres to be zoned. Access would be at 40th Avenue from Fox Street to the property via 40th Avenue, and the owners requesting zoning that would allow for transit oriented development.'",
        "'speaker_11': 'The current zoning is I.B. or heavy industrial with the yellow two billboard use overlay and a or light industrial also with a billboard use overlay and the requested zone district is c mixed 20 or urban center mixed use with the 20 storey maximum.'",
        "'speaker_11': 'This is a zone district that encourages compact, walkable and diverse uses that can be supported by collector arterial streets and multimodal transit, and is intended with design standards to encourage street active uses and pedestrian scale at ground level uses that very much complement pedestrian activity along walkable streets in a transit oriented development environment and up to 20'",
        "'speaker_11': 'storeys. Look at the existing land use context is predominantly industrial today. However, that is changing. And just as an example, the area north of the site is shown is industrial. Our current land use mapping, but that is converting to parking, transit or in development facility to support surrounding redevelopment and transitional use into mixed use development.'",
        "'speaker_11': 'There are also some vacant properties, parking areas and a little bit of scattering of commercial retail and even a few multi-family low rise. Users in the area. The site is shown here in the center in plan view. To the north you see the park and ride facility under construction and advanced stages of construction.'",
        "'speaker_11': 'To the east is light industrial parking and retail. To the west as industrial and the rail corridor. And to the south is industrial use. The applicant has reached out to the. Registered neighborhood organizations listed here. And that has resulted in a letter of support from United Community Action Network.'",
        "'speaker_11': 'Or you can and all of the written and posted notice requirements have been met. And this was a case that came before council with a request for. A modified request to modify the application, which Council approved on February 29th, and the hearing was rescheduled to this evening.'",
        "'speaker_11': 'Let's look at the review criteria beginning with consistency with adopted plans. Comp Plan 2000 encourages conserving land by promoting infill development and promote sustainable centers of live work activity through mixed use development, especially near transit station areas to provide for diverse housing needs and in correlation with public transportation.'",
        "'speaker_11': 'The concept land is a blueprint. Denver is transit oriented development, which is land use that correlates directly with mass transit, encourages a balance mix of uses ranging from compact mid to high densities. And this is in an area of change where there are public benefits can be achieved by channeling growth.'",
        "'speaker_11': 'To these areas, such as improved transit, access for jobs, housing and services, and fewer and shorter automobile trips. Blueprint Denver Street Classification for Foxx Street is mixed use Collector Street, north of 40th Avenue and then between I-25 and Fourth Avenue.'",
        "'speaker_11': 'It's actually a mixed use arterial. Collect your streets, support access between neighborhoods while arterials are focused, or support longer trips between regional destination or urban areas throughout Denver. Both street types are intended to support walking, biking and vehicle mobility with features such as tree lawn sidewalks on street parking in alleys.'",
        "'speaker_11': 'And 40th Avenue is a local and designated street. The Globeville Neighborhood Plan supports land uses and building heights that are recommended in the 41st and Fox station area plan and just reinforces what's already adopted in the 2940 and Fox Station Area Plan, which shows the concept land use as mixed use office residential, 3 to 20 storeys, and'",
        "'speaker_11': 'that is defined as land use, supporting employment services and residential uses within walking distance, in particular within walking distance of of nearby services in transit. Second Review criteria uniformity of district regulations cm x 20 would result in uniform application of district building, form, use and design regulations, and it would further public health, safety and welfare by implementing'",
        "'speaker_11': 'recommendations and the vision for urban center and transit oriented development at the 41st and Fox Stationery fourth review criteria as a change or changing circumstance of the change or changing condition of the property as a justifying circumstance. Specifically, the station platform, the PED Bridge in the Park and Ride facility are nearing completion and that service will soon'",
        "'speaker_11': 'be available along this important transit corridor. There are nearby properties that were recently resigned to see them x 20 cm x 12 and CMS eight. And there have been recent developments at 39th and FOX and 42nd and Delaware.'",
        "'speaker_11': 'This DMX or urban center is part of the urban center context encourages compact, walkable and diverse areas, and this meets the vision, not necessarily the land uses today or the context today of industrial, but meets the desired neighborhood vision or context of an urban center.'",
        "'speaker_11': 'A transit oriented development station area and CM 20 specifically encourages a street active and pedestrian skilled ground level uses to support walking, shopping, public gathering, near transit and up to 20 stories. So CPD is finding is that all review criteria have been met.'",
        "'speaker_11': 'We recommend approval and planning board also unanimously recommended approval. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Watkins. All right. We have three speakers for this today. I call all three. You can make your way up to the front pew. That Texas. Amanda monroe I believe that white and then Whitney. I'm so sorry I got cut off.'",
        "'speaker_1': 'And then we have David Roy Bell. So, Mr. Texan, you can begin your remarks.'",
        "'speaker_5': 'Thank you. That is tax of 4535 Julian Street, Denver, Colorado Council Members. Instead of rezoning this pastoral parcel, you should purchase it as a site for a new homeless shelter and mental health treatment center. After all, apparently you have millions of dollars for a new performing arts complex for the rich.'",
        "'speaker_5': 'Once again, the wealthy come before the needy. Perhaps you could levy a 1% design and construction tax to first purchase the land. A construction tax on developers in the Arapahoe Square area, out of which you've just driven the homeless in order to facilitate profits for the 1% and 1% tax would seem only fair.'",
        "'speaker_5': 'But maybe you just don't understand the plight of the homeless. In this regard, it might be helpful if, given the walkability of this zoning site. If you took a walk along of South Platte near this zoning site where you've driven our least fortunate citizens through your camping ban.'",
        "'speaker_1': 'Thank you, Mr. Tech, sir. Ms.. Monroe Whitney Europe.'",
        "'speaker_12': 'Hi. Amanda monroe, Whitney. I am the granddaughter of the property owner of 75 West 39th. I live in Denver 45 if I sell to Yosemite. I believe that this amended zoning change that was done on February 29th was not commuted, communicated correctly to the Monroe Investment Company LLC, which is my family's who owns the property.'",
        "'speaker_12': 'I do believe that Tim Watkins did answer all the questions to the best of his knowledge and in his capacity. But I do also believe that the person that is supposed to be here tonight, which is he is not, has communicated the reasoning of zoning it half and half did not communicate it well whatsoever to my mother'",
        "'speaker_12': ', who is the manager of the Monroe LLC. I'm completely against it. I would rather have it zoned all commercial residential that way. It also falls in line with the Fox Street trans oriented development that the city wants. And that is all I have to say.'",
        "'speaker_12': 'And I do have a question. We are able to change the zoning if this is finalized tonight, correct?'",
        "'speaker_1': 'We'll have we'll have councilmembers speak to that when it comes to comments.'",
        "'speaker_12': 'Okay. Thank you.'",
        "'speaker_1': 'Famous Monroe Whitney. Next, we have David Weigel. Hello.'",
        "'speaker_9': 'How are you doing? Members of council. I just want to address the offensive training of the Klan. I feel that the clans presence and history needs to be acknowledged by the government in schools. And on that, I just feel that the expansion of the city cares more about the people that are coming here than the people that'",
        "'speaker_9': 'built the legacy here. Where this redevelopment is happening right across in District one, they have a huge redevelopment from the skate park and none of that is going to be affordable and towards putting in a redevelopment area. I'm not in favor of it because I come from the Sun Valley neighborhood and at the time that little raven'",
        "'speaker_9': 'was being expanded as a $2 billion project that capitalized between Highlands and downtown. And that's another capitalization of the river area in my neighborhood. The Sun Valley is get ready to get hit next. And I'm not in support of this.'",
        "'speaker_9': 'Capitalizing and making a high, high income area nor affordable housing. And now the homeless that are down there that can't be at the homeless shelters, you know, where are they going to go now? And I'm just not not in favor of this.'",
        "'speaker_9': 'And, you know, a lot of the developers, when you live in a neighborhood, when your neighborhood's going to be redeveloped and these are redevelopment come, you know, it's pretty much the same stuff telling you plans and people are powerless, people are oppressed and you know and now Swansea A they've been going through this for so long they're'",
        "'speaker_9': 'burned out the Sun Valley, we've been going through this for all seven and you know, we don't, we don't want people that are going to come redevelop our neighborhood. We want people that are going to come be a part of the community.'",
        "'speaker_9': 'And that's the thing about it. Our communities, again, so broken by these new redevelopments because they come move in, they don't reach out to the original people there and the people that are there, they don't want to reach there.'",
        "'speaker_9': 'And it's just, you know, I just feel there's more community involvement in our city's changing so drastically. And I just hope that it could be a better, fairer Denver and make our city great, you know, for all of us.'",
        "'speaker_9': 'And, you know, I love Denver and I plan on staying here the rest of my life. Thank you. Members of council. Thank you.'",
        "'speaker_1': 'That concludes our speakers. Now time questions from members of council. Council members?'",
        "'speaker_9': 'Yeah. Tim Watkins can. Tim. I had a had a bunch of other questions. Kind of philosophizing on all of this, this redevelopment and the some of the issues. But because of Miss Monroe, who came up and spoke, I mean, that kind of changed everything.'",
        "'speaker_9': 'Is is the person who who called for the rezoning here.'",
        "'speaker_11': 'The applicant representative is not here this evening, and I don't fully understand what scheduling conflict may have. Occurred.'",
        "'speaker_9': 'But they didn't send a representative or.'",
        "'speaker_11': 'I think the intention was to be here, but I think they could be on their way.'",
        "'speaker_9': 'Okay. And so when you put forward the recommendation that this be a split rezoning, the. You know, the property owner was not consulted in it.'",
        "'speaker_11': 'So we received a request to modify the application and put that forward to council. And I did speak with the property owner and had the understanding that the property owner was aware and supportive of this.'",
        "'speaker_9': 'Okay.'",
        "'speaker_11': 'As well as the representative.'",
        "'speaker_9': 'Okay, look. Mr. President, can I call it Miss Moral?'",
        "'speaker_5': 'Good.'",
        "'speaker_9': 'So obviously we're getting conflicting stories here. So I'm trying to understand your grandparents, I believe it.'",
        "'speaker_12': 'Was it was my grandfather and actually his dad that had bought the property in the fifties. And just to let the people know that we're here talking about development. I mean, we helped build Denver and Colorado Springs and everything.'",
        "'speaker_12': 'We're a rental construction company. Okay. And we closed our doors in 2014. We've been open since the early fifties, early, late 40. Sorry.'",
        "'speaker_9': 'Okay. And so are you aware that your Grimm father talked to Mr. Watkins?'",
        "'speaker_12': 'My grandfather. It was my mother. She is the manager of the Monroe LLC. The property is owned by three members of the family Roderick Monroe, Peggy Monroe and Vickie Monroe. Vickie Monroe is the manager.'",
        "'speaker_9': 'Okay. Are you aware that your mother talked to? I am. And and consented?'",
        "'speaker_12': 'I am. And I'm still going to disagree with it because I do not think that the person that is supposed to be representing us who's not here tonight gave her clear communication of the reasoning of zoning in half and half.'",
        "'speaker_9': 'Okay, well, you understand our conflict as well that I did. Okay.'",
        "'speaker_12': 'I just wanted to go on record and voice my opinion just because I'm highly invested in this, too. I've been the property manager there now for two years since my uncle passed away and close the doors. Okay. So this and I mean, I grew up there.'",
        "'speaker_12': 'Yeah.'",
        "'speaker_9': 'So and I don't believe that this forfeits your right on the other parcel to Rizzo.'",
        "'speaker_12': 'That's what I'm concerned about. This deal proposed. The deal doesn't go through. I'm hoping that we have the opportunity to to go back to our original. Rezoning application, which was the CRM max 24, the entire property.'",
        "'speaker_9': 'Okay. I'm pretty sure that it can't, but thank you. Thank you. Mr.. Mr.. Watkins, just real quick. You know, we've kind of talked about this before, and there's two, two different questions that I want you to kind of talk about, and maybe they'll be addressed in Blueprint.'",
        "'speaker_9': 'But then I imac's kind of zoning in flexibility within the IMX. There were some mention of it in in the Globeville plan, and I know you and I have had many conversations on the restrictions within IMX in the city, but just wondering, was that a part of the conversation at all with the with the applicant?'",
        "'speaker_11': 'The applicant has always requested the sea or urban center mixed use zoning and the 20 story in it. Really this is about phasing for the applicant and the desire to keep the southern portion of the property in productive industrial use and have flexibility to keep it productive and solvent in terms of lease ability while the phase one'",
        "'speaker_11': 'to the north is under construction. Did you have a question specific to the uses allowed under IMAX and whether that zone district was considered or.'",
        "'speaker_9': 'I know the uses and you could if r if we had flexibility in our IMX zoning and especially in identifying the IMAX, you could do an IMAX rezoning here, but we don't have that within our zone districts.'",
        "'speaker_11': 'Correct. Well, the IMAX goes up to eight storeys. That's right. Right. So there's not and so if if maybe they're interest in taller than eight storeys, push them to the CMCs.'",
        "'speaker_9': 'But I'm just wondering, Max, and wondering about the conversation and blueprint and in saying could there be more flexibility, Max, to go up to 20, the examples that we've seen from cities like Vancouver that have, you know, multiple housing units, have an ability to do light manufacturing, have retail on the bottom, all the things that we kind'",
        "'speaker_9': 'of, you know, want in our city, you know, this is a part of the city that we are rezoning from industrial into commercial a lot. And if there are not some opportunities for us to, you know, fit the mold and see if there's a go between a hybrid or, you know, we're going to be in trouble.'",
        "'speaker_9': 'So just was seeing if that was an opportunity. The last piece is this this zone district is recommended in the plan to 3 to 20 storeys. And we we've had a lot of conversations and I don't think that this has been mandated yet with the city.'",
        "'speaker_9': 'But minimums is minimum has minimums have been a part of the conversation.'",
        "'speaker_11': 'You know, you've raised two very interesting points that could be very interesting citywide conversations. And just harkening back to your how do we define Emacs and how is our understanding of IMX evolving and how could that be reflected in both the CMS districts as well as the Emacs districts?'",
        "'speaker_11': 'So that's I think a very. Exciting opportunity to explore that as well as. The point you just raised on the minimum heights. And in fact, I believe Councilman Espinosa brought that up on previous Fox area rezonings. And our response at that time was that there could be a conversation and might have implications citywide and beyond the specific'",
        "'speaker_11': 'rezoning and the specific station area. So two very interesting topics related to planning and zoning that council might wish to further explore.'",
        "'speaker_9': 'Yeah, I'll address it in my comments. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilwoman Black.'",
        "'speaker_8': 'Thank you, Mr. President. I honestly am confused. So I thought the property owner initiated this rezoning. And are you, Mr. Monroe, are you one of the property owners? I have a.'",
        "'speaker_1': 'Daughter, Ms.. One right where I need to.'",
        "'speaker_8': 'So I would just like some clarification as to.'",
        "'speaker_12': 'Okay, originally the property was bought by my grandfather and my great granddad back in the early fifties. Once my grandfather passed in 2006, the property was then put together in a monroe LLC which consisted of the children and his wife.'",
        "'speaker_12': 'If anything were to happen to the children at all, his wife and vice versa, we all know how that goes. So as of right now, the property is owned by Vickie Monroe, Peggy Monroe and Rod Monroe. And I am the daughter of Vicki Monroe and granddaughter of Peggy Monroe.'",
        "'speaker_12': 'And Pat Monroe, the original owner.'",
        "'speaker_8': 'And so. Though they were the owner there. The owners requested the rezoning.'",
        "'speaker_12': 'My mother did. She is the manager. But like I said, I have been explicit. And is that this rezoning of half and half? The person that is representing us is not here. And I do not think that he has communicated the reasoning behind doing half and half and still instead of the full singer Max 20 And no'",
        "'speaker_12': ', we were never told about IMAX. At least I wasn't. And I've been in communication with our representative and my mother throughout this whole thing, except for the February 29th Amendment.'",
        "'speaker_11': 'So.'",
        "'speaker_4': 'Yes.'",
        "'speaker_11': 'So I spoke with Vickie Monroe about the purpose of the application modification request and felt that she had an understanding of it and that she. Was inclined to approve it. And I understand that there are some differences among some of the family members.'",
        "'speaker_12': 'And like I did say, Tim has answered all the questions to the best of his knowledge in his capacity. But like I said, the person that's representing us has not represented it correctly. And what is the mode of operation in doing this?'",
        "'speaker_12': 'This is why it's about tonight.'",
        "'speaker_11': 'And the applicant representative who submitted the request to modify the application. I communicated with him as well as Vickie Monroe at the same time, and I felt that there was collective understanding, but not necessarily agreement among family members.'",
        "'speaker_8': 'Okay. Thanks.'",
        "'speaker_1': 'Council. I want to tell you.'",
        "'speaker_7': 'Thank you, Mr. President. Unless you're somebody that deals with zoning and land use issues on a day in and day out basis, it's complex and not easy to thoroughly understand. So I could understand someone being told, This is what we want, this is what it does.'",
        "'speaker_7': 'Without going into a lot of detail and thinking, Oh, that sounds all right. But you know, the devil is always in the details. So I had a number of questions it's hard to be able to ask them without the applicant being here.'",
        "'speaker_7': 'So that's what makes this really kind of kind of a screwy process. I don't know how we justify moving something forward without the applicant even being here to address some of the questions that we have. So, I mean, Tim, I could ask you a few of the questions that I think might be helpful in just understanding what'",
        "'speaker_7': 'would be proposed for this particular zone category and at this location. So for example, is there open space requirement on this size lot? And if not, what would is the size threshold that requires open space to be incorporated?'",
        "'speaker_11': 'There is not an open space requirement for the CME zone districts and that's more associated with a general development plan.'",
        "'speaker_7': 'So the fact that there's no park in the neighborhood, the fact that we're putting so many residential units, at least when we did the Central Platte Valley, we made sure there were two very large parks that would not only serve the new development, but it would serve the entire Highlands neighborhood that was park deficient.'",
        "'speaker_7': 'So we're creating a community that has no place to go other than their own units. And so.'",
        "'speaker_11': 'If I could respond to that. The 41st and Fox stationary plan does envision parks, but it doesn't necessarily. Explicitly state which parcel should be purchased for park. So there's an understanding that there should be proposed parks and open space areas, but that those are.'",
        "'speaker_7': 'What if we're rezoning all of the land and we're not? Requiring any set aside of any of the development for open space, then chances are it could be all gone and we get no open space for the massive amount of density that we're allowing.'",
        "'speaker_11': 'There was a set aside at 4400 North Fox Street, part of that.'",
        "'speaker_7': 'The Denver Post say you.'",
        "'speaker_11': 'Think you just need 2570.'",
        "'speaker_7': 'But that's for that development. Right.'",
        "'speaker_11': 'But publicly accessible. Okay.'",
        "'speaker_7': 'Let me go on to my next question. What is the parking requirement for this Todd category per unit?'",
        "'speaker_11': 'It is 0.75 parking spaces per residential unit.'",
        "'speaker_7': 'Okay. And was there any talk at all about commitment to affordable housing in the city's discussion with the proposed the proposer of this application?'",
        "'speaker_11': 'The development concept is is not advanced enough to speak specifically to affordable housing opportunities. So there's not really the properties in a transaction mode and development would be intended after that transaction is finalized.'",
        "'speaker_7': 'So we have no idea. Exactly how many stories are being proposed. The zoning allows up to 20 stories, but we have no idea what is being proposed. That's a goofy part about this process, is not having any knowledge of exactly what we're being asked to approve other than, you know, within this grandiose framework, if you will.'",
        "'speaker_7': 'Let me move on to my next question. In your conversations with the applicant, what specifically did the city do to address public health, safety and welfare with? Consideration of the close proximity to the commuter rail line, which is just immediately the other side.'",
        "'speaker_7': 'The other side of the. I'm sorry. I meant cargo. It's immediately west of the RTD commuter rail line.'",
        "'speaker_11': 'Yes. My understanding is those conversations are still underway among city agencies and looking at health risks and how to address appropriately. So that's.'",
        "'speaker_7': 'So in the meantime.'",
        "'speaker_11': 'Encouragement, previous encouragement, those discussions are still underway.'",
        "'speaker_7': 'But there's nothing happening when an applicant comes through the city to ask them to consider looking at how they might be willing to address that.'",
        "'speaker_11': 'Not during the rezoning phase. There is not currently.'",
        "'speaker_7': 'Okay. That process is ongoing. We will have a some recommendations that come out of that by. July. But in the meantime, we have lots of applications coming forward along corridors that will be building high density housing right next to rail.'",
        "'speaker_7': 'We're not addressing any of the kind of details that ensure that we are in fact protecting human life and addressing public health, safety and welfare. So I'm just I will keep asking this question wherever we have commuter rail lines that run alongside cargo lines.'",
        "'speaker_7': 'And, you know, my hope is that we have people willing to do some things until we do have some clear recommendations in place. Um. I think that's it. Thank you.'",
        "'speaker_1': 'Thank you, gentlemen. I'm going to jump in real quick. Tim, the applicant is the the the the Whitney family, correct? I would say who's the applicant? Because we said the applicant's not here. The applicant's representative is not here.'",
        "'speaker_1': 'That's correct. Because there was never intended for the applicant to actually be.'",
        "'speaker_11': 'Indeed the applicant property owners out of state.'",
        "'speaker_1': 'Okay. So so Miss Monroe in if I just want to ask you. So you you just disagree. So your grandmother is for the I might be using a wrong terminology, but she's the head of the estate, correct?'",
        "'speaker_12': 'She has the most units.'",
        "'speaker_1': 'Most units. Okay. So you just disagree with the direction. I just want to make sure and because you're your argument is not with what CPD has done, because you said that Tim has answered all the questions.'",
        "'speaker_12': 'That I do. I want to make that clear. Tim has answered all the questions to the best of his knowledge in his capacity. That's what's very important here. He is a staff member of yours. He doesn't know our personal business.'",
        "'speaker_12': 'He does not know. Absolutely. And so in his capacity, he has done an excellent job. And I love his pictures. I love how he's presented us. So, yeah, my grandmother is the majority owner of the property and both my mom and her brother Rod have 29.1.'",
        "'speaker_1': 'So if I may correct me at this wrong, you just disagree with the direction that they move that they're going forward with. Or do you feel your representative who's representing has not and has not represented your family, in your opinion, in the best interests?'",
        "'speaker_12': 'Absolutely. To the best for our best interests. The representative that is supposed to be here has not represented why we are doing this rezoning this way.'",
        "'speaker_1': 'But you feel that way. You know, you obviously cannot speak for your parents or your grandmother. That's just the way that you feel about it.'",
        "'speaker_12': 'That is how I feel. And my grandmother, I spoke to her about it. She does. She's like this. The uncle just sits on the west side. I've been involved with our property since I was born and I've been even more involved in it for the last two and a half years.'",
        "'speaker_12': 'I've done all the phases in at the environmental. I've done everything with it. So that's fair.'",
        "'speaker_1': 'Thank you for advice. What make you think? Well, we've got a lot of people in here. Councilman, new Europe.'",
        "'speaker_5': 'Has been as question in addition to your grandmother, the other two family members who have ownership, how how do they.'",
        "'speaker_1': 'Feel about this rezoning?'",
        "'speaker_12': 'My mom is in she she agrees with it, but I do not think that she was communicated properly. And why we are rezoning it this way. My mom has always wanted to do the zone full, commercial, residential, and then all of a sudden this half and half started coming about, which I didn't understand what was going on'",
        "'speaker_12': '. And I do not think she does and I do not think that she is clear on it. Tim Watkins has told her, told her the benefits of it. He has told me we have had similar conversations. But the representative, like I said, who is not here this evening, has guided my mom in in in a in a'",
        "'speaker_12': 'in a way that is representing us to the to the best.'",
        "'speaker_5': 'What about the third family member of this ownership?'",
        "'speaker_12': 'I have asked him I have shown him all the documents and he says, just let me know when it's bad.'",
        "'speaker_11': 'Okay. Thank you.'",
        "'speaker_12': 'Mm hmm. Um, I think Tim also wanted to.'",
        "'speaker_3': 'Address your.'",
        "'speaker_12': 'Question. Do you want.'",
        "'speaker_4': 'To estimate to the podium?'",
        "'speaker_5': 'Tim. You like to. As something.'",
        "'speaker_11': 'Yes, if I could. So, Amanda, we met with the applicant representative, your mother, you and I, the four of us together. And we had a lengthy conversation about what it would mean to modify the application and reduce the area to be zoned to 20.'",
        "'speaker_11': 'And the pros and cons. And we explored what follow up steps to further research that would be required. And I did some follow up research, and I reported back to all of you. And I felt that that was a very open and transparent conversation between the applicant, representative, you, your mother and myself.'",
        "'speaker_11': 'And every attempt was made to continue that conversation. And then I did have a follow up conversation with you separately and your mother separately. And I felt that everyone had the same understanding, and it just came down to choices.'",
        "'speaker_11': 'Do we choose to rezone the property in its entirety or have half options? And so I felt that there was a slight mischaracterization of the. The applicant representative terms of not communicating the purpose and intent.'",
        "'speaker_7': 'To me are going to talk into.'",
        "'speaker_11': 'The area to be resolved. So that's.'",
        "'speaker_12': 'Think. Did you have any.'",
        "'speaker_7': 'Other questions, Councilman?'",
        "'speaker_11': 'No, thank.'",
        "'speaker_6': 'You.'",
        "'speaker_3': 'Councilman Cashman.'",
        "'speaker_5': 'Thank you. This is pretty simple for me. I don't see how to possibly resolve this without an applicant here. I mean. Tim is. Staff. Ms.. Munroe is not an applicant. So what. What are. And anybody who knows can answer this.'",
        "'speaker_5': 'What are our options for delaying this vote?'",
        "'speaker_1': 'It's funny you mention that. I was just having a conversation with David, so I won't speak for David if you want to chime in.'",
        "'speaker_5': 'David Broadwell, Assistant City Attorney. One option you have available to you is to continue the public hearing and postpone the matter until a date certain to get the applicant here. This is we don't really have a precedent. I don't ever recall an applicant not being here informed, representing their application on any prior actions we've taken.'",
        "'speaker_5': 'I believe that there that options available to you in this city. CPD staffer Nate. Know some reason why that couldn't occur, but that's a procedural option available to you. Or else you can just go go ahead and proceed to a vote on the merits.'",
        "'speaker_1': 'So. Councilman, just looking at CPD, they said that is an option that we could do if that's what this body wants to do.'",
        "'speaker_5': 'Is there something we need to do to make that happen, sir?'",
        "'speaker_7': 'We need a plan.'",
        "'speaker_1': 'Yeah, we would. Yeah. David, I'm. I almost feel like we need a motion. Correct me if I'm wrong, David, to postpone until a date. Certain, but we need to have what we need to save the date certain now.'",
        "'speaker_1': 'Or would we?'",
        "'speaker_5': 'A postponement needs to be to a date certain. That's always a problem in terms of looking at your advanced calendar. But but also again, the point is we haven't gaveled closed the hearing. So if you want to hear from more people on behalf of the application, you need to keep the hearing open so we don't have to'",
        "'speaker_5': 're post notice of the hearing itself. So it'd be a motion to postpone and continue the hearing until a date to pick a date.'",
        "'speaker_1': 'Well, we got people in the queue, so let's do this. Councilman Cashman, if there are any outstanding questions that councilmembers have now, let's get those out of the way so we don't have to ask the questions later on.'",
        "'speaker_1': 'And then we can if the sentiment is there, once the questions are done to postpone to a date certain, we could do that. Councilwoman Gilmore, you're up.'",
        "'speaker_4': 'Thank you, Mr. President. Tim, I have a couple of questions for you, please. When you're communicating to property owners or the applicant, is that done via email so that there's a record of it or is it verbal communication or how is there a process in place to ensure that there isn't miscommunication from the interested parties?'",
        "'speaker_11': 'Well, that's a good question. And there has been a mix of in-person communication and phone conversations as well as emails. And I did strive to copy all parties and sometimes didn't have a correct email address, but attempted to forward afterwards.'",
        "'speaker_11': 'But when I'm the call is placed to me from the property owner, applicant, and then the property owner applicant's daughter, I take those calls and I have direct conversations, but I haven't. Summarize the conversation and emailed it to both parties after the phone call.'",
        "'speaker_4': 'Okay. And so there is no I mean, so then with with you saying that there there isn't necessarily an official sign off of the interested parties on a confirmation that they clearly understood what was conveyed to them necessarily.'",
        "'speaker_4': 'I mean, you're communicating with them over the telephone. There's not a process to create a summary and send it back out to them or verify that that they're understanding it explicitly.'",
        "'speaker_11': 'Well, I rely on the application which the property owner entity has listed and then the applicant representative is listed. And as a case manager, a primary obligation is to communicate directly with the applicant representative who then coordinates with property owners.'",
        "'speaker_11': 'But when property owners call and ask to have a conversation, very much pleased to to respond and. Sure.'",
        "'speaker_4': 'Yes. Okay. One additional question on the original, the packet of information for Monday night. There's a document in here that it's the rezoning guide and the rezoning application. So it's page three of three and it has listed I, I believe it's I think it says Vicki Monroe and that it's the property owner interests percentage of area of'",
        "'speaker_4': 'the zone. Lots to be re zoned and it indicates that she is 100% owner. Of that zone lot and. I guess it might be appropriate for for Miss Monroe, Whitney for or someone to clarify if it's actually three folks that are owners of the zone lot or if Ms..'",
        "'speaker_4': 'Monroe is the 100% owner.'",
        "'speaker_12': 'No, that's not true. My mom is not a 100% owner of specific zone. Lots and specific places of of the property. The entire property. There's never been any any direct. Okay. Vicki owns this part. Right? Owns this part.'",
        "'speaker_12': 'My grandmother, Peggy owns this part. No, it's never been like that, ever.'",
        "'speaker_4': 'Okay. All right. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Gilmore. Councilman Espinosa.'",
        "'speaker_9': 'And I guess this is for Mr. Monroe. Just sort of reading between the lines. It sounds to me like the developer interest development interest is seeking new zoning on their interest, but members of the extended family would like the entirety of the family's land to be resolved.'",
        "'speaker_9': 'Is that correct?'",
        "'speaker_12': 'Can I repeat your question? Your question was, is that that a developer wants.'",
        "'speaker_9': 'I'm trying to figure out and I'll ask Tim, because you said he explained this as the best way forward. I'm trying to figure out how we go from a giant L-shaped property that goes from 39th to north of 40th to something that is only the upper half of that when you're sitting here telling us is that you'",
        "'speaker_9': 'would rather see the entirety of that parcel. Is that what it was mentioned here in in passing was that this preserves some industrial use of the lower the southern half of the parcel while allowing developed redevelopment potential of the northern half.'",
        "'speaker_9': 'And so I can see where we would make that split if we didn't want to create a non-conforming situation on the Southern half. But I'm not because of the sort of tenor of what has been described here, etc..'",
        "'speaker_9': 'It sort of sounds like it is been conveyed in different ways. And I'm trying to understand how it is that we got to just the northern half TMX 20 because I can see in my development experience because my understanding is historically there were two development interests, two development developers interested in this parcel.'",
        "'speaker_9': 'And so and I don't know if both the development interests are still interested in this parcel or we're now talking about one. Now we're just securing redevelopment potential for that portion of the land. So how did we get here?'",
        "'speaker_9': 'Because I do think that if there is no nonconforming if the if you if the building business is shuttered, like you said in 2014, then there is no non-conforming sort of situation. So it does make sense that if we're going to rezone, we'd just rezone the entire portion.'",
        "'speaker_9': 'Part of me wonders why we didn't just do this as a legislative reason for all of this area. But because this is like the eighth one of these things that I've seen in the last four, eight months.'",
        "'speaker_12': 'Yes. Yeah. I've done my I've done my research on even the property that is north of the light rail, the gold line. They've all been resolved and they still work at the capacity that they were working at originally.'",
        "'speaker_12': 'So their zoning was is grandfathered in. My, my and my mother's questions, big questions where is if we did change the zoning to complete SIMEX 20 that the AIA and the IP zoning be grandfathered in? We never really got a clear, concise answer to that.'",
        "'speaker_9': 'And then I give you a clear, concise. No, I use. Once that rezoning occurs. Now you can't you can't do certain uses there because you've it's not allowed and it's not permitted in that zone district. So you don't just get grandfathered in because the building looks a certain way or acted a certain way.'",
        "'speaker_12': 'Right. We have we've had renters on the property until the February 29th, and I'm trying to get renters in there. Now that were of the same.'",
        "'speaker_9': 'You didn't. That would create a problem that were renters. Yeah. That's why that's what.'",
        "'speaker_12': 'He did that if we don't see him next 20 that abuse would not be we would not be able to use that.'",
        "'speaker_1': 'Miss Whitney, I don't want to stop your conversation, but, councilman, I want to make sure that you have more so she can come converse with.'",
        "'speaker_9': 'You, because that that sort of explains to me because, like I said, I didn't it was either one of two situations. And I think it's very clear that that it's it's it's it's a functional issue on why you're ending up in this sort of redefining of the boundary.'",
        "'speaker_9': 'And it to me now makes more sense why we would do something like this. And it isn't. You're just so for your sake. Yeah. Yeah. Coming back and going through this process and the southern half is not is going to be fairly straightforward.'",
        "'speaker_12': 'I was here in the future. I've been to the meetings.'",
        "'speaker_9': 'Yeah. It's going to be fairly straightforward on the on the southern half in the future. What you like you'll never see CPD sort of willfully doing is creating non-conforming situations and that's what you're sort of asking for. But if you want to continue leasing it as a use by right the way it is, that use by right'",
        "'speaker_9': 'actually goes away when you change the zone district. Which is what we're talking about tonight. If I had if I said anything wrong, I stand corrected, but I think I got it right. So thank you. Thank you. No more questions.'",
        "'speaker_1': 'Councilwoman Sussman.'",
        "'speaker_4': 'Okay. I just like I have a couple of.'",
        "'speaker_7': 'Simple questions for Ms.. Monroe.'",
        "'speaker_4': 'You are not the owner of the property. You are not the applicant of the property.'",
        "'speaker_12': 'No, Keith, get out. I get close. Originally was the applicant. Okay.'",
        "'speaker_7': 'And so.'",
        "'speaker_4': 'You're. And we don't know. How the applicant or the owner feels about this. We just have your testimony that says they don't like it. Was there a reason.'",
        "'speaker_12': 'Why I disagree with it? But we don't know if the owner does or the applicant. But there's like I said, there's three owners. One is the manager and she is the one that made the decision. But you are not the owner and you are not the applicant.'",
        "'speaker_12': 'Okay. Thank you. Thank you.'",
        "'speaker_1': 'All right. We are round two of questions, Councilman Ortega.'",
        "'speaker_7': 'Thank you. I just wanted to ask him if he clearly communicated that if for any reason this rezoning, this zoning application goes down, that the property owner would have to wait a year before they could re file an application for this property.'",
        "'speaker_11': 'To the same zoned district. And is that all CMC's own districts or just CMC's toe? Just toe could not be applied for for one year.'",
        "'speaker_7': 'Okay. So if they applied for something different, they could they could apply on the site. So has that changed in 2010 when the citywide rezoning happened? That you could apply for a different zone category or some district, and it would still be okay to do it within the one year time frame.'",
        "'speaker_11': 'I'm sorry. I'm just receiving notice that the applicant representative is here so might be here. But see, amex toe could not be applied for for one year if you denied the rezoning request this evening, but other zone districts could be applied for within one year.'",
        "'speaker_7': 'So you're saying the applicant is here in the room.'",
        "'speaker_11': 'Here at the building? I suppose I'm just getting messages as I'm communicating.'",
        "'speaker_7': 'If the applicant is in the room where you please raise your hand. We're having this conversation in circles with this. Okay.'",
        "'speaker_12': 'So he's the representative? Not that.'",
        "'speaker_1': 'Yeah, he's.'",
        "'speaker_7': 'He's the applicant on behalf of the property owner. Right. Okay. Yeah. I was just trying to clarify and understand that if this went down, it sounds like we're probably more willing to move to postpone it if the applicant representative doesn't show up before we finish this discussion.'",
        "'speaker_7': 'If. They are able to change the zoning to a different category if it went down.'",
        "'speaker_11': 'The applicant is here. Who representative is here?'",
        "'speaker_7': 'Okay. Okay.'",
        "'speaker_6': 'Art Vasquez, 2943 Tampa Street. I am the applicant for the zone change and I apologize for not being here earlier.'",
        "'speaker_7': 'Oh, you missed out on all our questions.'",
        "'speaker_6': 'Oh, no, I saw I saw I had somebody watching and telling me all the questions. So.'",
        "'speaker_7': 'So is there a reason you weren't here when we started this?'",
        "'speaker_6': 'Yes, there is. I had a flat tire and couldn't get all state to show up, so I had to find somebody to give me a ride to get fix the flat, fill it in my tire and drive here and hope that maybe Tim might give me a ride home if my tires flat when I leave.'",
        "'speaker_4': 'Okay.'",
        "'speaker_7': 'Um, I don't know that we want to start this round all over again. It's your prerogative, Mr. President. Thank you.'",
        "'speaker_1': 'If. Well, actually, who's up next is Councilman Brooks. So, Councilman Brooks, you're next in the queue. Did you want to ask some question?'",
        "'speaker_9': 'Yeah. You know, I was prepared to postpone this just because I don't know if I've ever had a situation in five. Years and I've been on council where this has happened. Thank you for showing up. Thank you. Things happen.'",
        "'speaker_9': 'So let's just cut to the chase. We we have a member of the family who is objecting to the parcel. Kind of splitting the split parcel rezoning that we did February 29th, saying that you're not clear. You haven't been representing well.'",
        "'speaker_9': 'So, first of all, I want to give you the opportunity to talk about the person you are representing as the owner and their wishes to split this parcel as CPD did.'",
        "'speaker_6': 'Okay. Thank you. Let me start by saying that the owner of this property is the Monroe Investment LLC and the manager and decision maker of that is. Vickie Monroe, which is Amanda's mother. She has full authority to make decisions up to this point.'",
        "'speaker_6': 'These are the decisions she has made. Number one, she signed a listing agreement to sell the property. Number two, she's accepted an offer to sell the property. Number three, she's authorized me and hired me as her representative to change the zoning.'",
        "'speaker_6': 'At the time that we decided to change zoning, we wanted to change the zoning to CMCs 24, all of the property. We made an application to do so. We then later change that application to change the zoning for half of the property.'",
        "'speaker_6': 'The reason being is that each and every buyer that was interested in the property. Was only interested in the property if they could keep the industrial zoning on the half the land that had all of the improvements. The reason for that is because those improvements are not conducive.'",
        "'speaker_6': 'With the zoning, we'd want a change so they could actually rent that property out and subsidize while they develop the other half. And then they would later changes zoning on the second half so that they could further develop that.'",
        "'speaker_6': 'This is such a big parcel. There is no way there is any developer that's going to develop this property and develop 2.8 acres this close to downtown and spend $100 million to develop it. Plain and simple, the developers that are want to develop this property, want to develop it in stages.'",
        "'speaker_6': 'That is the reason why they want to do one half of the current zoning the way it is x 20 and leave the current half industrial. So to answer your question, I have full authorization to represent the family on the zone change.'",
        "'speaker_6': 'This was a decision made by the decision maker. It was an intelligent decision based on the facts and based on the fact that we have a buyer who's willing to buy the property and only wants to buy the property if only half the zoning has changed.'",
        "'speaker_6': 'Mr. BROOKS.'",
        "'speaker_9': 'Okay. You have a letter of support from you can, which is conglomeration of global response, the neighborhood leaders. Yes, we do. When you sat down with them, you talked about what you wanted to do. Did you talk about the future of the property?'",
        "'speaker_9': 'Did you talk about affordable housing? Did you talk about some of those?'",
        "'speaker_6': 'Absolutely, we did. As you know, the environment has changed. Because of the of the current legislation is not all that well makes it easy or easy for lawsuits to be filed for condominiums to be built. This is the reason why so many apartments are being built, and we have no condominiums being built.'",
        "'speaker_6': 'We have a high demand for housing right now. And the problem is that we have single family homes, that the newest single family home that you can buy the lowest price. And in Denver is 400,000. Do you hear what I'm saying?'",
        "'speaker_6': '400,000. The reason for that is because we cannot build condominiums. Now, I do understand that city councils change that for the city and county of Denver. But the banks still do not want to lend because the state law allows for two homeowners in an eight to sue.'",
        "'speaker_6': 'And no investor wants to take the risk. So what we decided to do is said, okay, if we're going to build apartments, let's build apartments. Here's the problem. The problem lies in the fact that we have almost a 20% vacancy rate because of the glut of apartments versus single family and condominiums that are being built in the'",
        "'speaker_6': 'city and county of Denver. It's a problem. Affordable housing is the probability here. We've had conversations about it right now with where the vacancy rate is and where rates are dropping for rent rental rates. It's not likely that we're going to build apartment buildings for the open market.'",
        "'speaker_6': 'It may not make sense right now. The current buyer that we have right now is wanting to close and take that risk. And they are talking about affordable housing. And we have met with the neighborhood groups and talked about affordable housing.'",
        "'speaker_6': 'Obviously, in a capitalist society, you're going to have an entrepreneur go with whatever the best route is to get a return on their investment at this current time. It looks like affordable housing may be that route. Now that I can't guarantee which route the investor is going to take.'",
        "'speaker_6': 'I can only tell you that in the open market. Apartments are not desirable at this current time. Mr. Brooks.'",
        "'speaker_9': 'Yeah. Thank you.'",
        "'speaker_1': 'Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. You know, a month ago, we adopted this amended parcel, and it was for precisely the reason that you just outlined. I'm reading it right here. And Ms.. Monroe, it sounds like we amended it precisely to do what you say you wanted.'",
        "'speaker_5': 'So I'm very confused as to why you would be opposing this. And this is Vasquez.'",
        "'speaker_6': 'Yes. Right. Mr. Arthur Vasquez? Yes.'",
        "'speaker_5': 'Arthur Vasquez. The buyer is buying the entire parcel, correct? Correct. The Family LLC is not retaining any of it. Correct. Okay. And so what we heard Amanda say earlier was that that they wanted to that that she wanted to preserve the right to maintain the industrial activity on that southern portion, I believe.'",
        "'speaker_5': 'And she's she's nodding your head. Yes. No.'",
        "'speaker_6': 'She the the idea was that the industrial the south half has all of the improvements. Correct. Which are conducive to the current zoning in order for those improvements to meet the criteria for the open market for TMX 20, that it would require over $500,000 of improvements.'",
        "'speaker_6': 'Sure.'",
        "'speaker_5': 'Sure. Amanda. I'm sorry. And I. You're among. I forget your accent. Your last name is what? Can you come forward again? Yes.'",
        "'speaker_1': 'Monroe. Whitney.'",
        "'speaker_12': 'It's Monroe. Whitney.'",
        "'speaker_5': 'Whitney. Okay. Thank you.'",
        "'speaker_12': 'The where I'm now confused is that if we were to do all Cemex 20, that the industrial zoning would be grandfathered in. And so even if we were rezoning TMX 20, that I could still rent the property out to, say, a construction company that is had the same use as we have done there since the fifties.'",
        "'speaker_12': 'Okay.'",
        "'speaker_5': 'And you could not let me down. Okay. Okay, hold on. But the Family LLC is selling the whole parcel. You won't be leasing any of it. That's what I don't understand.'",
        "'speaker_12': 'That's what's under contract right now. It's under contract. That does not mean that it's been sold.'",
        "'speaker_5': 'Right. But if you sell the whole thing, you won't be leasing. You're the family won't be leasing any of it. You'll be out of it. Okay. Okay. Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Councilman Flynn. Councilman Espinosa.'",
        "'speaker_9': 'Yeah. So the Bayesian explanation that was just provided by the applicant is consistent with what I was getting at in my previous comments questions, which is a viable approach to redevelopment of the site. The question I have for you, Mr. Monroe, is do you understand that where you can have a non-conforming situation in a zoned parcel is'",
        "'speaker_9': 'if that operator continues, it has continuous operations. So it's really the same person or business entity that is operating in that facility from the prior zoning into the new zoning. What happens when you re zone and you then get a new person to lease that space?'",
        "'speaker_9': 'That's when you lose that. That becomes decoupled and you have to get into it's a change of use and all these other things. So to preserve this development scheme, you have to do this sort of split right rezoning.'",
        "'speaker_12': 'I was under the impression that not only would we have the industrial and I'd be grandfathered in. And I was also told that if the property is vacant for one year, then the commercial residential scheme next, then it goes into effect immediately.'",
        "'speaker_12': 'And if I was to make any improvements on the property after the reason to CMCs, then those buildings or any improvements ought to be CMC's 20. Not industrial. Okay. Those are that is what I have been told this entire time.'",
        "'speaker_12': 'Okay.'",
        "'speaker_6': 'Mr. Espinosa may make a comment. Sure. Number one, the prior use has to be maintained as the exact same use. And if it isn't what, even if even if we changed, the only becomes a use which is a legal nonconforming use.'",
        "'speaker_6': 'If that use doesn't meet the criteria of being the same use, not just general industrial use, the same use, it is lost. So for instance, right now there is a it's power equipment that's being rented there. So if it now it's vacant.'",
        "'speaker_6': 'So if we don't get another power rental equipment, a renter and a taxicab driving company want to be there, it does not meet the requirement to fit within that zoning. And let me just say something to move this thing forward.'",
        "'speaker_6': 'I've worked with Amanda and she is part of the family. She has zero say in what happens with this property. She has zero authority. She is not on the LLC, nor is she any not even a member of the LLC.'",
        "'speaker_6': 'She is discontent and she is unhappy with the decision her mother's made. So her presence here is merely to disrupt what is going forward because of her personal opinion. She has zero and I am speaking on behalf of the family and I will swear under testimony that she has zero authority for the family.'",
        "'speaker_6': 'She is merely here to disrupt this hearing and to prevent this zoning from going forward. And she has no argument why it shouldn't happen and no authority.'",
        "'speaker_9': 'One related question the do you know if this site would meet the criteria for medical for a marijuana grow?'",
        "'speaker_6': 'Which you mean on the current zoning to the current industrial building. I'm not 100% sure. I'm not an expert on all of the uses for industrial, but I do believe that the current zoning of industrial now you got to remember, this is a unique property.'",
        "'speaker_6': 'So let me preface it by saying that we have two separate parcels. We have one parcel with two separate zone lots here. So we have a B zone lot, which is the lot we're looking to change. So it's I, b, so b I zoning.'",
        "'speaker_6': 'There were like 18 changes here, max 20 the zoning that we're not looking to change is an I a zoning. So I am not 100% sure whether or whether or not it is allowed for medical marijuana to grow.'",
        "'speaker_6': 'I would think that I a my understanding is that it may be something that would allow a possible grow at this facility. I will say this, that the there hasn't been any any ownership interest previous ownership interest in a grow.'",
        "'speaker_6': 'I can't speak for the future buyers.'",
        "'speaker_9': 'Okay. Thank you.'",
        "'speaker_1': 'We've been at this for an hour. Councilman Cashman, hopefully this is the last question so that we can move forward on this.'",
        "'speaker_5': 'Yeah, I agree. Thank you, Mr. President. You know, I'm not an expert on public hearings, but my experience is that anyone is allowed to testify in a public hearing. And if it wasn't for Ms.. Monroe Whitney being here, we'd have long ago postponed this for for a week or two.'",
        "'speaker_5': 'So if I were you, I'd buy her a drink after the hearing.'",
        "'speaker_6': 'I'll buy her three drinks.'",
        "'speaker_5': 'That's very generous of you. My question is, you mentioned affordable housing. And when you say affordable, what level are you talking it? 80%, Amy. 6030. Where where where are we aiming?'",
        "'speaker_6': 'Well, here's the here's the deal, Mr. Cashman, one of the buyers, other than the buyer that had the acceptable offer, wanted to come and do a tax credit program. They that's what they specialize. And the current buyers are not experts in that.'",
        "'speaker_6': 'So they're going to seek outside counsel on how they can move forward. They are buying this property in the hopes that the market continues to move upward and onward. And as it looks now, when you look at the current rental rate for open market, you're requiring about $2.40 a square foot for the project to make sense.'",
        "'speaker_6': 'If you built a five story building minimum there. And those numbers aren't crunching right now. So when they buy this property, their next step is to go to other experts within the community and talk to them about the tax credit program.'",
        "'speaker_6': 'One of the persons that we've spoken to is a guy by the name of Andrew Romero that works for, I believe it's KeyBank, and he's an expert in these tax credit programs, and that's going to be the next step for the buyer.'",
        "'speaker_6': 'Again, I can't speak on completely on behalf of the buyer, but that's the information that I received from the buyer on their intention.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'All right. See no other questions. Public hearing is now closed. And let's see for how long these comments go. Councilman Brooks, you're up.'",
        "'speaker_9': 'You know, I wish I could say, you know, in my 25 years of doing being on council, but in my five years, I've never witnessed anything like this. And I I'm glad that your tire or whatever it was got put together and you got here because.'",
        "'speaker_9': 'Well, I'm giving councilman you get you. I don't think you're.'",
        "'speaker_1': 'Yeah. You go into that breakdown with that.'",
        "'speaker_9': 'But, you know, there's several comments that I wanted to make on, you know, I it makes zoning, you know, minimal allowable uses and standards here in our zoning code but. You know, I'll just say that just because we've been at this an hour that I am, I'm thrilled that you met with the neighborhood association.'",
        "'speaker_9': 'I'm thrilled that Armando Payan, who is a huge advocate in this area, knows this area, lived in this area for 50 years, is supportive of this. And that that speaks volumes for me. Who is, you know, a person who's really concerned about this area.'",
        "'speaker_9': 'You know, obviously, our context is zoning. We try and encourage folks who are thinking about development to think about the values of the community. We can't force those values upon you. Open space design. Ground floor activation. Affordable housing.'",
        "'speaker_9': 'But those are our values. And I think you got some of that from Armando in the U.K. And so I appreciate that this reasoning lines up perfectly with our plans in the Globeville area plan. And the one thing that I wanted to say is the importance of small area plans in our city.'",
        "'speaker_9': 'And I know my colleagues to the left of me are excited to see some smaller plans in their neighborhood because this is the result of it is an environment where you have community support and and things begin to happen.'",
        "'speaker_9': 'So in the context of this public hearing and what we're supposed to be, you know, judging, does this meet the criteria of the planning, the plans that we have in front of us? In my mind, it does and it does perfectly.'",
        "'speaker_9': 'And we just passed our Globeville planning day. Was it a year ago now? Almost a year and a half ago. And so those are plans that are hot off the presses and excited. I'd love for CPD to start thinking about minimums, and one of the reasons is, is because when we start talking about different economic cycles, people'",
        "'speaker_9': 'are going to build to what the market is allowing them to do. And it has been a you know, it would be perverse if we had all this investment in rail and a three story would stick project was developed there.'",
        "'speaker_9': 'And so I really I really believe that we need to think about the investments that we're making public publicly and put it that way. And so I'm supportive of this. I know this was kind of a crazy hearing.'",
        "'speaker_9': 'I've never heard one like this, but I appreciate you being here. I think you got educated on, you know, kind of some of the stuff that we do here. And I hope that wish you all the best with your family.'",
        "'speaker_9': 'And thank you, sir, for being here representing the family. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, Councilwoman Black.'",
        "'speaker_8': 'Thank you, Mr. President. I just want to say thank you for clarifying everything. I do understand it now. And Miss Monroe, I think the. This rezoning actually will achieve what you're looking for, that the property can still be used for industrial use.'",
        "'speaker_8': 'So I think it's a good outcome for everyone. So I will be supporting it.'",
        "'speaker_1': 'Thank you, Councilwoman Black. Councilman Espinosa.'",
        "'speaker_9': 'Not only because we've already talked this line that I'm going to articulate something that I mean, I said early on one of these rezonings and I've sat on my hands through most of them, and it has sort of nothing to do with this.'",
        "'speaker_9': 'But everything to do with this is there's a station area plan. There's a Globeville plan. There's no guidelines and standards. There's no minimum built tos that Alvis is talking about. There's no way to sort of ensure we're maximizing the TOD potential for this site.'",
        "'speaker_9': 'So once again, I'm going to support a rezoning and hoping for the best, but it's really up to the development community to come through in this situation because we don't have any. We have visions, we have plans, we have no obligatory requirements to meet them.'",
        "'speaker_9': 'And that's really unfortunate. But I do think that this is actually the best way to sort of achieve the balance of the use by right on the industrial with the redevelopment potential on the 20 storey parcel. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. Just briefly for Councilman Brooks. This hearing will be second place in my memory to the day I believe it was the rezoning on the Diamond Cabaret back in the eighties when I witnessed from the press table councilman, former councilman, Irving, look, do a bump and grind during his testimony.'",
        "'speaker_5': 'So this is second place.'",
        "'speaker_1': 'Thank you, Councilman Flynn, for that visual. All right, Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I just wanted to first state that, you know, since this is an area of change and it is a Todd location, this is also part of what was envisioned in the Globeville Station area plan.'",
        "'speaker_7': 'I will be supporting this tonight. One of the challenges with this area is that Fox Street is going to be very much like Brighton Boulevard, where the development is coming in. And then we're worried about how do we address so much traffic on this one road because we're putting in so much density and we haven't really adequately'",
        "'speaker_7': 'talked about or addressed how we're going to deal with that. And, you know, it's kind of a chicken and an egg. And I think it's important to ensure that CPD is having that conversation around exactly what is being done as each development is coming in to be part of those improvements so that we have the appropriate right'",
        "'speaker_7': 'of way to be able to move traffic and hopefully it's one of the corridors or we'll have some bike lanes as well. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. I tell you. Any other comments? 937 as amended. CNN. Madam Secretary, roll call.'",
        "'speaker_3': 'Brooks Espinosa. Hi, Flynn. I. Gilmore, I. Cashman. I knew Ortega. Sussman All right.'",
        "'speaker_7': 'BLACK Hi.'",
        "'speaker_3': 'Mr. President. Hi.'"
    ],
    "Rezones property located at 5050 South Syracuse Street from B-8 with waivers, UO-1, UO-2 to S-MX-12 in Council District 4. (NEIGHBORHOODS AND PLANNING) Rezones property located at 5050 South Syracuse Street from B-8 with waivers, UO-1, UO-2 to S-MX-12 in Council District 4. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 2-17-16.": [
        "'speaker_1': 'Madam Secretary, please positively announce the results tonight. Tonight, 1937, as amended, has passed. All right. That's not the tempo for the next two. All right. Next, we have two bills, 69. Councilman Brooks, would you please put accountable 69 on the floor for final passage yet?'",
        "'speaker_9': 'Yes, Mr. President, I place Council Bill 69 to be placed on the floor for final consideration and do pass.'",
        "'speaker_1': 'Moved and seconded. Public hearing for Councilor Bill 69 is now open. May we have the staff report?'",
        "'speaker_7': 'Tourism research with community planning and development. How I ended up in the wrong place. So this is a rezoning located at 5050 South Syracuse Street. The request is to rezone from B eight with waivers and use overlay one and use overlay to two suburban mixed use 12 stories.'",
        "'speaker_7': 'Eight is the former chapter 59 zone district waivers will get into, and the use overlays are for adult uses and for billboards. So this is located in Council District four in the Hampton South neighborhood, generally north of Bellevue Avenue, south of Union Avenue, east of Interstate 25, and west of Goldsmith Gulch.'",
        "'speaker_7': 'It is within a half mile of the Belleview Station Transit Station. The property is about an acre or 55,000 square feet. Currently a restaurant use and the waivers are for fabrication and wholesale and warehousing and reducing the four area ratio from 4 to 1 to 2 to 1.'",
        "'speaker_7': 'Property owner is requesting rezoning to get rid of that far limitation. So again, the request is to rezone from eight, which was a heavy business zoned district and very intense business zoned district with waivers. Use overlay one and use overlay two to suburban context.'",
        "'speaker_7': 'Mixed use 12 storey height. So the suburban context is characterized mostly by single unit and multi-unit and commercial strips and office parks. Single unit is generally suburban house forms. Multi-unit are primarily located on archer arterials and collectors, and the block pattern can vary from a modified grid to in some of the office parks like in this location'",
        "'speaker_7': ', very different block shapes and sizes depending on the street on the street system. So again, the context surrounding context is B eight with waivers u0102 The land use is restaurant. It is a one storey building currently. So the waivers that we're talking about do apply to all of the surrounding properties as well.'",
        "'speaker_7': 'Waive the right to fabricate anything other than art goods, custom clothing, costumes, custom furniture, jewelry and needlework. Waive the right to sell at wholesale and warehouse, but reserve the right to sell at retail. Waive the right to the amount of gross floor floor area allowed in the Bay Zone District, which was that four times the size of'",
        "'speaker_7': 'the property or the zone lot, and instead have a two times the area of the zone lot requirement. And then the addition of the you will want and you ought to use overlays, allowing adult uses and billboards. And so all of these waivers are the same for the surrounding properties.'",
        "'speaker_7': 'Again, it is an existing restaurant adjacent to another restaurant to the south, and then surface parking and office buildings of varying heights. You'll see that in the pictures here. The restaurant itself is in the upper right hand corner.'",
        "'speaker_7': 'The surface parking lot to the east is the middle of the right. The restaurant across the private drive is lower. Right. A five story office building across Syracuse and the lower left. And then a 12 story office building to the northeast of the property, surrounded also by surface parking.'",
        "'speaker_7': 'So that there is no registered neighborhood organization in the area other than I.N.S. and the Denver Neighborhood Association. So those are the organizations the applicant reached out to. And all of the written notice and posting has been correctly done for both the planning board hearing, the plan committee hearing, and for this hearing and of course, written notice'",
        "'speaker_7': 'of the receipt of the application. As soon as the application was thought to be complete on November 5th, we notified council and the registered neighborhood associations and to date we have no public comment on this application. So you know the criteria very well.'",
        "'speaker_7': 'Let's get into them. The plans that are relevant. Our current plan 2000 and Blueprint Denver Current plan tells us to enhance the existing business centers, particularly the DTC Denver Tech Center, which is our second largest employment center, to preserve and enhance the vitality of our business centers and to encourage quality infill development that's in character with the'",
        "'speaker_7': 'surrounding area. Blueprint Denver Land use concept for the property is employment, where we typically see office warehouse, some light manufacturing and some high tech uses as described in Blueprint. And there are definitely fewer residences with some commercial and industrial uses and the property is in an area of stability.'",
        "'speaker_7': 'Future street classification for Syracuse Street is mixed use arterial, where we want to see a high degree of mobility and these types of arterials generally interconnect major urban centers like downtown, major shopping centers, major office centers and Syracuse Circle itself is a private street, so we would consider that a local street.'",
        "'speaker_7': 'Staff believes that the criteria for consistency with adopted plans is met and that we, by getting out of the customs zone district of waivers, that we are furthering the uniformity of district regulations. And by implementing our plans, we are furthering the public health, safety and welfare.'",
        "'speaker_7': 'The justifying circumstances has changed conditions. The applicant cites the obsolescence of this, of the waivers on the property changing in the property from the restaurant to the office use and the new zone district, allowing care for the property to redevelop in character with the surrounding area.'",
        "'speaker_7': 'Staff believes this is the appropriate and justifying circumstance. So as far as consistency with the zone, district purpose and intent, we talked a little bit about the suburban and context, the single unit, multi unit in strip centers and office parks, the multi-unit and commercial uses primarily on arterials and collectors and the varying block shapes and sizes depending'",
        "'speaker_7': 'on the whether it's a modified grid or not, even a grid street system. And then the mixed use zone district does promote safe, active, diverse uses and is appropriate on major arterials, which is, of course, or South Syracuse.'",
        "'speaker_7': 'So with that staff recommends approval of this rezoning, believes all the criteria are met.'",
        "'speaker_1': 'Thank you, Miss Cicero. We have one speaker tonight, Michael Campa.'",
        "'speaker_5': 'Good evening, Mr. President. Members of the Council. My name is Michael Campa and I'm representative of the applicant. And I am here and thank you. In the interest of time, I will remain available to answer any questions. Thank you.'",
        "'speaker_1': 'That concludes our speakers. So questions from members of the Council, Councilwoman Ortega.'",
        "'speaker_7': 'I have one question in all of the drawings that were in the PowerPoint. It shows the boundaries actually encroaching into Syracuse Street. Is that intentional or help me? Yeah, I guess if you could address. When we rezone property, we do rezone the street to the center line of the street.'",
        "'speaker_7': 'Okay. Okay. I hadn't always noticed that in many of the other applications that have been brought forward. No, that's the way we do it. So that there is no in-between. There's always the zone district right up next to another zone district.'",
        "'speaker_7': 'All right. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega. Councilwoman Black.'",
        "'speaker_8': 'Thank you, Mr. President. I have a couple of questions for Mr. Champa. This building is in the Denver Tech Center, and this council is often asking questions about development plans, and you actually have development plans. So I think it would be interesting to hear from you about the architectural controls that are enforced by the Denver Tech Center'",
        "'speaker_8': 'and also to talk a little bit about your parking situation.'",
        "'speaker_5': 'Okay. As you are probably aware, the Denver Tech Center has a very strict set of architectural controls. We've been through two of four meetings with them already. The building will be essentially a glass curtain wall facility. And rather than going to the sea of parking sort of approach that some of the buildings out there have, all the'",
        "'speaker_5': 'parking will be contained in a structure within the building envelope. So there will be virtually no surface parking on the site. As to the traffic movement, we had a number of discussions with the tech center as to how best to orchestrate the traffic on the site.'",
        "'speaker_5': 'And the parking in particular is three and a half spaces per thousand, which is one space per 200 and some square feet.'",
        "'speaker_8': 'Okay. Thank you. And another thing I found interesting about this project is you're fairly close to the Bellevue Light Rail station. And can you tell everyone here about your thoughts on getting people to and from that light rail station?'",
        "'speaker_5': 'We are the property is about a ten minute walk from the Bellevue Light rail station, which is easily walkable. We also have a bus stop at the property. We are looking at a bike station there and we are also talking with the tech center about the shuttle to transfer some of the building occupants to the light rail'",
        "'speaker_5': 'station.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Black. Any other questions on 69? CNN public hearing is now closed. Time for comments, Councilwoman Black.'",
        "'speaker_8': 'Thank you, Mr. President. This is in my district. It's currently a restaurant called Garcia's of Scottsdale, which has been there since I was in high school. So I'm sad to see it go, although I haven't been there since the eighties.'",
        "'speaker_8': 'Anyway, the Denver Tech Center is an office park. It's a very thoughtful development. The developer and I have met several times. I've been out to see the property and I think it's very thoughtfully done. One thing we didn't bring up is the fact that it's going to be LEED certified as well, which I think is another great'",
        "'speaker_8': 'aspect of the building. So I think it's very appropriate and I will be supporting it this evening. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Black. Any other comments on 69? Scene on Madam Secretary, Roll Call.'",
        "'speaker_3': 'Black Eye. Brooks Espinosa. Hi, Flynn.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'Gilmore Cashman. Hi. New Ortega says Hi, Mr. President. Hi.'"
    ],
    "Rezones portions of 601 South Bannock Street, 801 South Broadway, 99 West Kentucky Avenue from T-MU-30 Waivers and Conditions UO-1/I-B UO-2 to C-MX-16 UO-1/C-MX-16 UO-2 in Council District 7. (NEIGHBORHOODS AND PLANNING) Rezones portions of 601 South Bannock Street, 801 South Broadway, 99 West Kentucky Avenue from T-MU-30 Waivers and Conditions UO-1/I-B, UO-2 (transit, mixed use, 30 stories, use overlay allowing adult businesses and billboards) to C-MX-16 UO-1/C-MX-16 UO-2 (urban center, mixed use, 16 stories, use overlay allowing adult businesses and billboards) in Council District 7. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 2-17-16.": [
        "'speaker_1': 'Madam Secretary, please quote a very nasty result tonight. Tonight, 69 has been placed on final consideration and does pass. All right. We've got one more. That is Councilor Bill 87. And Councilman Brooks, would you please put 87 on the floor for final passage?'",
        "'speaker_9': 'Yeah. Thank you. Mr. President, I move that council bill 87 be placed on the floor for final consideration and do pass.'",
        "'speaker_1': 'Thank you. The public hearing for accountability seven is now open. May we have the staff report?'",
        "'speaker_10': 'Good evening. Council President members of city council ryan winterberg with Community Planning and development here for rezoning 2015 i00136 It's portions of 601 South Panic 801 South Broadway and 99 West Kentucky. And the request is from TMU. Three waivers and conditions.'",
        "'speaker_10': 'You are one, and if you go to two CM 16, you are one, and CMCs 16 you are two. So to orient you to the site, it is in Council District seven in South Central Denver. Zooming in a bit, it's within the Baker Statistical neighborhood.'",
        "'speaker_10': 'And I'm zooming in a little bit farther to the location so we can see that our subject site is located essentially at the intersection of Interstate 25 that we see at the south and the consolidated main line that we see there to the west.'",
        "'speaker_10': 'It's located between the Denver Design District, which is the area just to the north and the CMS. So sort of sandwiched in between those two things. And it's less than 1000 feet from two light rail stations to Alameda Station in the I-25 and Broadway station, which of course, are served by five light rail lines and some of'",
        "'speaker_10': 'the best bus transit accessibility in the city. So we really do see a great opportunity for transit oriented development in this area. Okay. So the request on the property is 4.52 acres total. It's currently owned by RTD, but D for Urban.'",
        "'speaker_10': 'So that's the developer of the Denver Design Center to the north currently has an option with RTD to purchase the property beginning in the spring. RTD has authorized this rezoning application. It's currently used as an unimproved surface parking lot and it does feature some detention area in the lower left hand corner.'",
        "'speaker_10': 'So while the approval of a rezoning is not the approval of a specific development project, the property owner and applicant's representative are requesting a resounding in order to change the mix of uses and generally facilitate a transit oriented development consistent with the Denver Design Center to the North.'",
        "'speaker_10': 'And interestingly, the application does propose to maintain the UO one where it currently exists today and maintain the use of two in areas where it currently exists. And we'll see that in just a moment. So the request before you is to see an X 16, which is within the urban center neighborhood context, allowing mixed uses and buildings'",
        "'speaker_10': 'generally up to 16 stories in height. So now we'll walk through the existing context. So now into the existing zoning and this is where I can kind of point out the split between the two zone districts that exist on the site today.'",
        "'speaker_10': 'We can see to the north there's kind of a split in between the property. That's where the IFB used to exist today. And then the area to the south is where the TMU 30 waivers and Condition zero one exists.'",
        "'speaker_10': 'So TMU 30 is a former Chapter 59 zone district, and it's intended to be applied in transit, mixed use areas, near light rail stations, and the district controls building massing to a maximum of 5 to 1 and a maximum building height of 220 feet.'",
        "'speaker_10': 'So again, kind of regulated both by FLIR and maximum height. And we'll see there is a view plane that does apply to the site in just a moment. So however, the two new 30 zone district standards don't include, for example, what we know today to implement body, including build to requirements, active ground floor uses, transparency and entrance'",
        "'speaker_10': 'requirements. And so the rule one that also applies to this particular area allows for adult uses along with distance and spacing requirements. And now to the I.B. that we see at the northern portion of the property. It is a general industrial zone district allowing both the industrial and general building forms.'",
        "'speaker_10': 'The IB zone district permits maximum density through an R ratio of 2 to 0 and maximum building heights only one adjacent to protected districts. And this particular site is not adjacent to a protected district. The zone district as well does not implement the build to requirements, the transparency and active ground floor standards that we would expect in'",
        "'speaker_10': 'many tod areas throughout the city. And the 202 that's the billboard use overlay does apply within that particular area and it would allow for the installation of a billboard with distance and spacing requirements as well as the availability of a permit.'",
        "'speaker_10': 'Okay. So now into the existing context, we can see that the requested TMX 16 zone district is applied pretty consistently across the Denver Design Center to the north and to the east with both the UO one and the YOU oh two zone district overlays.'",
        "'speaker_10': 'We can see a general tapering and heights as we move closer to Broadway, going down to eight stories and five stories respectively, and then the implementation of some of the Main Street Zone district standards along Broadway. So in recognition of that Main Street corridor.'",
        "'speaker_10': 'Okay. So there are two general development plans that apply to the particular property. So the first one is outlined in red. This is the Denver Design District GDP. It was approved in 2009. And then we can see outlined in blue just to the site is the Cherokee redevelopment of the former Gates rubber factory GDP.'",
        "'speaker_10': 'So it's important to note that the Cherokee Games redevelopment GDP was approved for a very specific development concept, largely to the south of the interstate. We just have a very small portion of the site that applies to it today.'",
        "'speaker_10': 'And the majority of the site was not developed within the context of the GDP and urban design standards and guidelines that also apply. We have a new property owner that has purchased the majority of the site and they're seeking a new redevelopment concept within the framework of the Denver zoning code.'",
        "'speaker_10': 'So we do anticipate that the Cherokee Gate's GDP will be repealed at some point, and the urban design standards and guidelines will be substantially modified. So we're not going to be talking about them today in terms of consistency with adaptive plans for this particular piece of property, since they will no longer apply.'",
        "'speaker_10': 'Okay. So for the GDP, that does regulate the majority of our site. The Denver Design District GDP was approved in 2009. It's approximately 80 acres and it's bound to the north on Alameda, to the east on Broadway and to the west by the consolidated mainline in the south on the interstate.'",
        "'speaker_10': 'And it's intended to transform this auto oriented commercial context into a pedestrian friendly, mixed use TOD and includes a number of goals and strategies to implement that vision, including high quality streetscapes and open space, higher densities near transit stations with appropriate controls tapering down to residential neighborhoods, balancing modes of transportation and high intensity mix of uses.'",
        "'speaker_10': 'And additionally, there is a connection contemplated through the site to link up the I-25 and Broadway station area just to the south. So urban design standards and guidelines also apply to the Denver Design District. You GDP area. They are concurrent areas.'",
        "'speaker_10': 'They are again intended to create high quality TOD that integrates with the surrounding community and restores the urban fabric. They are administratively reviewed by CPD staff and our particular portion of the site that's within this UDC boundary is in sub area five, which is the office district.'",
        "'speaker_10': 'It's the commercial core of the area with the highest intensity office uses and a mix of other uses. And again, that gateway connection that's contemplated to the I-25 station just to the south, along with a multimodal trail, is reinforced to this document.'",
        "'speaker_10': 'Okay. So in terms of the existing view plane, the Washington Park View plane applies to the subject property and it originates in Washington Park and is intended to protect views of the mountains generally. The farther you move away from that origin point, the higher permitted building heights grow, and it would specify maximum building heights for all structures'",
        "'speaker_10': ', so including rooftop equipment, that sort of thing as well. And for our particular site, maximum building heights are estimated at 122 to 146 feet across the subject site. So while the requested CMF 16 zone district does permit buildings up to 200 feet in height, the view plane will ultimately regulate the maximum building height for a building, so'",
        "'speaker_10': 'likely below the maximum height of the zone district. So in terms of existing land use, we can see that our subject site is unimproved surface surface parking in detention. We can see commercial and retail at the Denver Design District to the north and the east.'",
        "'speaker_10': 'That's the pink. You see. That's a pretty auto oriented context. We see some scattered warehouse commercial and office buildings to the east that generally orient to Broadway. Can we see substantial surface parking and vacant property to the south of I-25 and retail and warehousing to the west of the consolidated mainline that some some larger sort of big'",
        "'speaker_10': 'box retail there. So this is not a site that a lot of people would experience as a bicyclist or a pedestrian. So to orient you to what it looks like a little bit so you can see the photo in the upper right hand corner is looking north along the site.'",
        "'speaker_10': 'So the consolidated main line is just on our right hand side. And then the photo in the lower right hand corner is looking south underneath the Interstate 25 flyover. So now within the surrounding context, we can see some of the development that's pretty typical of the Denver Design Center that you may be more familiar with.'",
        "'speaker_10': 'So lower scale office, commercial and retail. And then the photo in the lower right hand corner of some of the smaller scale warehousing and commercial operations that that front on to South Broadway. Okay. So in terms of process, the following six registered neighborhood organizations have been notified throughout the process, and we have received two letters of support'",
        "'speaker_10': 'from the Baker Historic Neighborhood Association and the Platt Park Peoples Association supporting redevelopment of the site, as well as the multimodal connections that may be implemented through adaptive plans. And no other public comment has been received as of today's date.'",
        "'speaker_10': 'So we did send a notice of receipt of application to Arnaud's and City Council on December 2nd. On February 3rd, the Planning Board unanimously recommended approval. On February 17th, the Neighborhoods and Planning Committee moved the bill forward. The City Council first reading was February 29th and signage of today's City Council public hearing and notice to Arnaud's was'",
        "'speaker_10': 'properly posted on March eight. Okay. So now in terms of the five rezoning criteria, we'll walk through all five, the first of which is consistency with adopted plans. And there are five adopted plans that apply to our subject property.'",
        "'speaker_10': 'The first of which is comprehensive plan 2000. And we did find that the rezoning is consistent with comprehensive plan 2000, looking to a number of strategies, including the promotion of mixed use infill development, the identification of areas where increased density and new houses are desirable, and transit oriented development that makes effective use of existing transportation infrastructure.'",
        "'speaker_10': 'Now once a blueprint. Denver So you'll see that our subject site is actually omitted from the concept land use map. But we don't think that this was particularly intentional. We think it's likely due to its former function as a rail spur, where redevelopment was not contemplated at the time of the plan.'",
        "'speaker_10': 'But we can look to the surrounding land use recommendations in the Denver Design Center to inform the appropriate mix and intensity of uses for our subject site so we can see the purple area to the north and the east of our site is called out as town center and town centers are intended to meet a variety of'",
        "'speaker_10': 'shopping, entertainment, service and employment needs, and they're large enough to serve several neighborhoods. They are a destination and it uses include shopping and commercial uses at a high intensity. But unlike many shopping centers, town centers are intended to be pedestrian focused focal points for nearby neighborhoods.'",
        "'speaker_10': 'We can also see that our site is split between an area of change and an area of stability. Areas of change, of course, where Blueprint Denver recommends channeling growth to increase access to jobs, housing and services and benefit the city as a whole.'",
        "'speaker_10': 'And we do see that the area of stability roughly follows the I-25 corridor, which likely indicates that this stable transportation corridor wasn't contemplated for redevelopment. But that line where the area change and area stability meet, that's generally the boundary of the Denver Design Center GDP.'",
        "'speaker_10': 'So it's likely intended this entire area was contemplated for redevelopment. So we do find that the rezoning request to connect 16 U1 and TMX 16 year or two is consistent with recommendations in Blueprint Denver and in terms of future street classifications.'",
        "'speaker_10': 'Since this particular site doesn't have any frontage on the right of way, it has very little street context. We do look to this surrounding area to inform the appropriate mix of uses and intensity, and South Broadway is called out as a mixed use arterial street.'",
        "'speaker_10': 'So this is a higher capacity street featuring a high intensity and mix of uses. And Interstate 25 is called out as an undesignated arterial other. Because I 25 has very little presence at this particular site. It is elevated.'",
        "'speaker_10': 'We don't feel has a great contextual purpose to guide us in this particular location. So we do find that it is appropriate to apply the high intensity mix of uses through the proposed TMX 16, UO one and two zoning at this particular site.'",
        "'speaker_10': 'Okay, so two neighborhood plans also applied to the subject site. The bigger neighborhood plan was approved in 2003 and it includes framework goals that apply to the entire neighborhood as well as sub area strategies. There's more detail in your staff report, but you can see that framework goals generally recommend creating and maintaining an appropriate balance of land'",
        "'speaker_10': 'uses to preserve stable areas, but developing vacant land in a manner that is compatible with the surrounding lands and encouraging a mix of uses that assure availability of neighborhood services and amenities to reinforce the role, identity and needs of the neighborhood.'",
        "'speaker_10': 'So in terms of the sub area, our particular site is within the retail centers. Sub area retail centers are destination business areas, often including retail and offices, and they may include some moderate density housing, but they are predominantly intensely commercial.'",
        "'speaker_10': 'The area is intended generally over the course of the plan horizon to develop to more intense uses in the future. So the plan does recommend this long term redevelopment should be facilitated by a flexible framework in zoning standards that we see proposed before you today.'",
        "'speaker_10': 'And the retail center sub area also makes several urban form and urban design recommendations to address the urban context and to establish a pattern and character for the long term evolution that is both intense and dense but also pedestrian friendly.'",
        "'speaker_10': 'So we find that the rezoning requests to connect 16 year one in year two is consistent with both this land use guidance and these Urban Forum recommendations, where we find that the current mix of zoning, the 2030 waivers and conditions and IP doesn't really compel this pedestrian oriented character.'",
        "'speaker_10': 'The Alameda Stationery Plan adopted in 2009 also applies to our subject site, and it did not supersede the adoption of the Baker Neighborhood Plan. So we do look to the totality of recommendations. So the format of this plan includes recommendations that apply to the entire area based upon the principles of transit oriented design as well as some'",
        "'speaker_10': 'sub area strategies. So the principles of TOD that are shown here include redefining the station's nature as a destination, place and oriented density closest to the Alameda station and Broadway station areas for that appropriate mix of uses. So in terms of land use and building heights recommendations from the Alameda Station area plan, you can see that our'",
        "'speaker_10': 'site is called Out in Office Employment Land Use Concept. So this is really an area that recommends channeling office and commercial uses to create create an employment center and a diversity of employment options for the neighborhood. So we do find that CMF 16 is consistent based upon these land use recommendations.'",
        "'speaker_10': 'Our subject site is also recommended for a maximum height of 14 storeys. So without a 14 storey zone district option, we do find that the requested CMCs 16 zone district does fulfill that building height recommendation, of course, coupled with the Washington Park View plane that will ultimately cap building heights likely below 14 stories.'",
        "'speaker_10': 'And the Alameda Station Area plan also makes a number of urban design recommendations related to a future Bannock street connection that we can see running north and south through the site and linking up to the I-25 and Broadway station that are not implemented, not captured by the current mix of entitlement.'",
        "'speaker_10': 'But we do find that the CMCs 16 zone district would implement. So our site is also within the Denver Design District, as I mentioned earlier. And you've seen the goals presented already today and our subject site is within Sub Area five.'",
        "'speaker_10': 'Again, that's the Office District, which is the commercial core of the project high intensity office uses. And of course general development plans are able to provide guidance to subsequent rezonings of properties within that GDP area. So we do find that the requested TMX 16 zone district is consistent with this mix of land uses.'",
        "'speaker_10': 'And in terms of building heights, we see that the Denver Design District GDP also recommends building heights of up to 14 stories for our subject site, again regulated by the Washington Purview Plan. So based upon the analysis, we do find that the rezoning is consistent with adopted plans.'",
        "'speaker_10': 'In terms of uniformity of district regulations, we find that the application of the CMC's 16 you a one and your two zone districts will result in the uniform application of some district standards across the city as well as the Denver Design Center.'",
        "'speaker_10': 'Well, they will be applied uniformly. We also find that the rezoning will further the public health, safety and welfare through the implementation of adopted plans. In terms of justifying circumstances as stated in your application, change or changing conditions is called out and we do find a number of change conditions both at a regional scale as well as'",
        "'speaker_10': 'at a site specific scale. So as presented today, there are numerous adopted plans that make recommendations for the evolution of this particular area into a transit oriented development concept and context. We see a number of redevelopment projects both within the Denver Design District and to the south, anticipated at the I-25 and Broadway station.'",
        "'speaker_10': 'That's actually signaling the physical evolution in these environs. Of course, for our particular site at a site scale, we've seen a great change condition in that the site has transitioned from formally being a railroad spur now to a potentially developable site, especially with the proposed sale from RTD to a private developer later in 2016.'",
        "'speaker_10': 'That's really going to unlock the potential for the transit oriented development that's contemplated by our adopted plans. So in terms of consistency with neighborhood context, we do find that it is consistent to apply zoning here within the urban center neighborhood context based upon adaptive plan, vision and multimodal context.'",
        "'speaker_10': 'Again, the rezoning is consistent with the zone district purpose statement for the seam zone districts, and specifically with the intent statement that the CMF 16 zone district applies to areas served by arterial streets where a scale of 3 to 16 storeys is desired.'",
        "'speaker_10': 'Of course, South Broadway is a mixed use arterial and numerous plans recommend a maximum building height of 14 storeys. So based upon our analysis of the five criteria, CPD recommends approval and the current property owner and both potential purchaser are both here to answer any questions you have today, and I'd be happy to answer any as well'",
        "'speaker_10': '. Thank you.'",
        "'speaker_1': 'Thank you. Two speakers tonight, Bill Serrano. I'm sure I said that wrong. I apologize. And Dan Cohen. So, Bill, you can begin your remarks.'",
        "'speaker_5': 'Hi. My name is Bill Savoy. I am representative of RTD and here to answer any questions tonight.'",
        "'speaker_1': 'Dan Cohen.'",
        "'speaker_5': 'My name is Dan Cohen with the For Urban. We're the auction holder on the land, and I'm here to answer any questions. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Time for questions and members of council and Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. Bill, could you address the question that immediately popped into my mind, which is, why do you want to retain the adult use overlay? You know, I that's a good question, because I. Maybe I should ask Dan.'",
        "'speaker_5': 'I'm sorry. Yeah, you probably should ask me. I, I wouldn't say that I would want to personally, but. Okay, so why are we, why are you proposing to retain the adult use? We we have no specific intention to integrate adult uses on the site.'",
        "'speaker_5': 'I believe that there's also some legal considerations on the city side for maintaining that aspect of the zoning. Then third, try. Let me ask Ryan why why are we retaining the adult use over shore?'",
        "'speaker_10': 'So when we receive a rezoning request where the you one adult user currently exists, we do examine each request based upon a case by case basis, whether to maintain or to remove the other one. From the city's perspective, to not run afoul of the First Amendment, the city must still maintain adequate opportunities for adult uses throughout the'",
        "'speaker_10': 'city and county of Denver. So when we do receive a request that proposes to remove that, you are one we must analyze to see if that is putting us in any potential risk of First Amendment rights. But again, the applicant did make the request to maintain the overlay.'",
        "'speaker_10': 'So that is how we reviewed the application.'",
        "'speaker_5': 'Okay. I didn't realize that was a First Amendment right. Is that that seems odd. In fact, this is the old railroad. This is the old Colorado in Southern. There's never even been a structure on here, to my knowledge.'",
        "'speaker_5': 'Is that correct?'",
        "'speaker_10': 'I don't believe so. I've looked at aerial imagery as far back as 1933 and I can't find a structure.'",
        "'speaker_5': 'Okay. My only other question is for Bill. Sorry. This is land that RTD acquired as part of the original Mac line, the original light rail line, and I believe that was all locally funded. There's no federal funds that acquired this property.'",
        "'speaker_5': 'So my question is, are there any encumbrances due to any of these federal funding that implies or imputes any restrictions to how this could be used in the future? No, no. And you're correct, this was bought with local funds when it was built up in early nineties.'",
        "'speaker_5': 'That's good enough. Thank you. That's all.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilwoman, I tell you.'",
        "'speaker_7': 'Thank you. I have a few questions as well. The first one is for rain. What is the open space requirement on a parcel of this size? This is 4.52 acres. Right.'",
        "'speaker_10': 'So our particular site is located within the Denver Design District, GDP, a portion of that particular site. So the GDP does have an open space requirement of 10%. So roughly that GDP area is about 80 acres. So 10% of that extrapolate out is about eight acres.'",
        "'speaker_7': 'And are we counting the. Streets as part of the open space.'",
        "'speaker_10': 'So streets are subtracted from the gross area to develop a net area calculation and those are publicly dedicated rights of way to create that the baseline.'",
        "'speaker_7': 'Okay. And then on the detention, is that currently detention that's on the site for RTD or is it part of the detention that was required for court?'",
        "'speaker_10': 'But actually the detention and correct me if I'm wrong, Bill, it currently does serve the RTD Park and right area to the south as well as portions of Interstate 25. So when the property does come forward for redevelopment, that's that's something that'll have to be accounted for and accommodated in other ways.'",
        "'speaker_7': 'Okay. Let's see. My next one is on this one would be for Dan, if you would mind, coming forward. So. I get this is sort of being morphed into the bigger D4 project and can you speak to what the affordable housing commitment is overall for development that's going to be going onto the site?'",
        "'speaker_5': 'There's not a a specific consideration within the GDP for affordable housing, but it's certainly something that we're looking at. Actually, our first phase of development on the site is what I would call a market rate affordable project. I believe that when we first opened for occupancy, probably 40% of our units were at or below 80% AMI.'",
        "'speaker_5': 'So while it's not a tax credit, affordable housing development, it's something that we're definitely committed to. But we don't have a specific doctrine or written commitment of any kind that that we have at this point.'",
        "'speaker_7': 'So thank you for answering that. So for people who currently utilize the park and ride that's there, will there be some other form of parking for folks who will continue to use that site? And if so, how will that be addressed?'",
        "'speaker_5': 'Bill, would you like to? He's probably better placed to answer that question. Thank you. Sure. And I think there's a lot.'",
        "'speaker_9': 'Of things going on at.'",
        "'speaker_5': 'This site in and around, obviously, you know, that there's there's the to the south. We had Broadway station partners. We have the interchange project. So we're currently working with the city on what we're calling a comprehensive parking strategy to look at how we evolve parking.'",
        "'speaker_6': 'Which will look.'",
        "'speaker_5': 'At things like where do we put structures and other things like that. I think there's.'",
        "'speaker_6': 'A the notion that parking is going to.'",
        "'speaker_5': 'Be impacted. There's going to be periods of time where we'll probably have less parking. I think our overall goal is that we retain essentially the parking that we currently control, which is around a thousand spaces.'",
        "'speaker_7': 'So it may not be in that same physical location, but somewhere in the nearby proximity. Sure. Yeah. Okay. And then let me see if I had one more question. Mira talked about the maximum heights being controlled by the new plane.'",
        "'speaker_7': 'And that's 14 stories, right? This is the maximum height.'",
        "'speaker_10': 'Of well, in terms of adaptive plans, we do see recommendations for 14 storeys, but for the view plane, maximum heights will be regulated to about 120 to 246 feet. So they may actually fall below the 14 storeys because that does include permitted height encroachments like elevator shaft, safety equipment, that sort of thing.'",
        "'speaker_10': 'So we may see buildings falling below 14 storeys.'",
        "'speaker_7': 'Thank you. I have no further questions.'",
        "'speaker_1': 'Thank you, counsel. And I'll take Councilman Espinosa.'",
        "'speaker_9': 'Yeah. Did you what was the what was the open space requirement in the GDP?'",
        "'speaker_10': 'I believe it should be 10%.'",
        "'speaker_9': 'And what is it in a cmcs 20 or whatever we've got going on here?'",
        "'speaker_10': 'I see about 16. So the CMC 16 zone district itself does not have a built in open space requirement. But through the general development plan informed by the Alameda stationary plan is how that open space requirement will be implemented.'",
        "'speaker_9': 'Are we going to we had this funky definition come up in District one. Are streets going to be considered open space? Are we actually defining open spaces, being on individual parcels and not in the right of way?'",
        "'speaker_10': 'So the general development plans does set forth different types and kind of characteristic qualities for open spaces. Some are aggregated open spaces that are truly plazas and and larger urban spaces, some with landscaping, some with grass. But then enhanced streetscapes are called out as a type of open space that I believe actually in the Denver Design District'",
        "'speaker_10': '. GDP don't count towards the 10% requirement.'",
        "'speaker_9': 'Awesome. So when future rezonings in this area come up, who's responsible for being mindful that the open space requirement is being met so that we're not rezoning things to to. So that allowed development potentially required development potentially in some cases to to co-opt that open space requirement.'",
        "'speaker_10': 'So the c m x 16 as well as TMX eight and EMS districts that we see applied throughout the design center don't preclude open space as a use within the permitted use list. So it's kind of a layered way of reviewing developments within this area.'",
        "'speaker_10': 'So the zoned district is a framework that would allow for private development, but also for open space. So at the time, a site development plan review, there are certain triggers in the general development plan that trigger our Development Services Department to look for the implementation of those open spaces consistent with the GDP.'",
        "'speaker_10': 'So the rezoning to see 16 or any other urban center zone district doesn't preclude open spaces, since we do have another tool that captures that ultimate implementation.'",
        "'speaker_9': 'So if the open space is the open space defined in such a way in the GDP, that there is a certain characteristic, it sounds like there's different types and there's certain characteristics that actually require more set back that is not consistent with a cmcs zone district or.'",
        "'speaker_10': 'Not anything that I believe would be precluded by a C 16 zone district. These aggregated open spaces are often framed by an intervening street network. So again, the step back really wouldn't be pegged to the open space itself.'",
        "'speaker_10': 'And there are smaller, more kind of intimate spaces that are proposed through the general development plan. And I don't believe that the zoning standards would preclude those or hinder them in any way or the development that orients to them.'",
        "'speaker_10': 'Additionally, we also have urban design standards and guidelines that apply to this particular site that do offer an enhanced level of development, review and quality. So if there was any conflict between, say, a zoning standard and the ultimate intent of those open spaces as captured in the urban design standards and guidelines, that could certainly be something.'",
        "'speaker_9': 'How would we resolve that? Would we resolve that with a relaxation of the zoning requirement and some sort of modified zoning or or what.'",
        "'speaker_10': 'You know, without a specific project or site in mind, it's it's difficult to kind of contemplate.'",
        "'speaker_9': 'Well, the reason why I ask is it's easy to capture open space on a development parcel, but if the intent is to bring it to have a more civic quality, but the zoning sort of mandates that it's more internalized.'",
        "'speaker_9': 'We capture the open space, but we're not actually functionally generating what is desired. And so this is just another chess piece. And and so I'm just sorry. When we talked about that, I didn't when you when you mentioned this open space, it suddenly made me sort of think back to how we've redefined in the St Anthony's development'",
        "'speaker_9': 'open space, being in the street. I'm glad to know that's not the case here. But this is a large there's a ton of potential in this site. And I want to make sure that we're not overlooking something or creating a situation where we have internal, privatized open space when that was not the intent, and that our zoning'",
        "'speaker_9': 'somehow addresses that need comfortably so that we're not actually forcing more interior courtyards. Right. In that. Yeah. To achieve that.'",
        "'speaker_10': 'The aggregated open space recommendations that the GDPR I think do a very good job of capturing that as well as the GDP does contemplate multi-modal street connections that integrate surrounding communities into the site. So the development that occurs in the Denver design district is certainly not inward facing.'",
        "'speaker_10': 'Exactly to that.'",
        "'speaker_9': 'Point. I'm glad I asked all this because now it tells me that I got to go look at this to help us sort of guide other things in our station areas as well. So thank you very much.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Any other questions? 89. A7 skimming seen on public hearing is now a close time for comments on 87.'",
        "'speaker_7': 'Councilwoman Ortega I'd like to make a few comments. When I started to serve on City Council and represented District nine, the Broadway marketplace was actually part of my district, and we worked very closely with the bigger neighborhood in doing and the Denver Urban Renewal Authority in in doing the development on this site.'",
        "'speaker_7': 'I can also remember going over and being on site when the Montgomery Ward building was imploded, left many of us scrambling, trying to get out of the cloud of dust that was blowing our way. But a lot has changed since that time, and I don't think any of us envisioned the kind of density development that we're seeing'",
        "'speaker_7': 'happen in the city that is being encouraged. Obviously, it was long before the vote for RTD and creating the rail stops that are encouraging the TOD development though. The one thing that I did not raise in my questions was proximity to rail because I see on on here that at the southern end of the property, the central'",
        "'speaker_7': 'mainline is further away from the site. So it's got that natural buffering that's already sort of built in into place to ensure that we're not building housing or other high density uses with lots of bodies, lots of people right next to the rail where we see cargo and specifically flammable liquids and hazardous materials that might pose a'",
        "'speaker_7': 'risk to human life. And so, again, as you heard me say earlier, we will have some recommendations in July. Councilman Clarke and I are serving on the committee that Chief Tate is spearheading, looking at all of these issues and development, being part of the conversation and ensuring that we are, in fact addressing public safety, health and and'",
        "'speaker_7': 'welfare of the people that will be essentially encouraging to live or work within a close proximity of these rail corridors. I think. You know, clearly this has been an area of change. It's the the buffer of both the WASP Wash Park and the Baker neighborhood.'",
        "'speaker_7': 'And clearly, we have three. What will be three rail stops by there or is it just to just the two? Okay. That will serve the, you know, the large density that will be both at the Gates site as well as the D4 properties.'",
        "'speaker_7': 'So I think this is quite appropriate. I'm anxious to take a look at your master plan and see what you know that big picture looks like. I know this body looked at some of that when the drainage project was proposed to come through the site.'",
        "'speaker_7': 'I think the zoning had been done prior to this council being seated. But. You know, this is right along the lines of what has been proposed at all of these TOD sites. So I'll be supporting this tonight. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega. Councilman Espinosa.'",
        "'speaker_9': 'My little bit of Kevin Flynn tonight. Uh, my senior prom in 1990 was in the printing building. 1990? Yes. I'm an old man to you, Elvis. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Any other comments? 87. Excuse me. Seen on maps. Secretary Roll Call.'",
        "'speaker_3': 'Ortega Sussman. Black Brooks Espinosa. Don Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_9': 'Every time I.'",
        "'speaker_3': 'Vote or.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Question.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Knew. Mr. President.'",
        "'speaker_1': 'Hi, Madam Secretary. Please, first of all, announce the results tonight. Tonight, the 87 has been placed on final consideration. Does pass one period. German announcement Monday, April 4th. Council will hold a courtesy one one hour courtesy of Public Hearing Council Bill 173 approving the I-25 and Broadway station area plan as part of the city and county of'",
        "'speaker_1': 'Denver's Comprehensive Plan. And on Monday, April 25th, Council will hold a required public hearing on Council Bill 183 relating to the Denver zoning code, amending the provisions of airport influence overlay zone district. No other business before this body.'",
        "'speaker_1': 'This meeting is adjourned.'"
    ]
}