{
    "A resolution approving a proposed Master Purchase Order between the City and County of Denver and AM Signal, Inc. for Hirschmann ethernet switches and accessories used at traffic signals to support the Department of Transportation & Infrastructure. Approves a master purchase order with AM Signal, Inc. for $500,000 and through 12-12-22, with two possible annual renewals, for Hirschmann ethernet switches and accessories used at traffic signals to support Public Works Transportation Operations, citywide (SC-00004507). The last regularly scheduled Council meeting within the 30-day review period is on 3-2-20. The Committee approved filing this item at its meeting on 1-28-20.": [
        "'speaker_1': 'Councilmember Sawyer has called out Bill 62 for a comment and under pending, no items have been called out. Secretary, if you please put the all the items, I guess, that are called out on our screens. And Councilmember Sawyer, if you're going to make your comments on all four items, as my understanding wants to go ahead with your'",
        "'speaker_1': 'comments on items 55, 56, 62 and 63.'",
        "'speaker_2': 'Thank you, Mr. President. I've called out these items tonight because they are the items on tonight's agenda related to the Department of Transportation and Infrastructure.'",
        "'speaker_10': 'I have serious concerns.'",
        "'speaker_2': 'Around the way this agency is interacting in my community. I've voiced these concerns up the chain of command, and frankly, I haven't received the the support that I would like to from our city leadership. This leaves me wondering where is the accountability here to the people of the city and county of Denver?'",
        "'speaker_2': 'It is unacceptable that the department that provides our infrastructure lacks accountability to my community.'",
        "'speaker_4': 'And to the community and.'",
        "'speaker_2': 'To the residents of Denver. The behavior of Dottie has potential consequences to the health, safety.'",
        "'speaker_4': 'And.'",
        "'speaker_2': 'Welfare of our residents. I'm not sure if these glitches are reflective of a failure of leadership or of the structural changes resulting from the transition from Denver Public Works to Dottie. But it doesn't really matter because its consequences to my team and my community are the same.'",
        "'speaker_2': 'In several instances, my office has come up against significant barriers that have prevented us from doing our jobs effectively, and my residents are frustrated.'",
        "'speaker_4': 'And concerned.'",
        "'speaker_2': 'About the safety of their families. This lack of accountability to the people.'",
        "'speaker_4': 'Of the city and county of.'",
        "'speaker_2': 'Denver is exactly why I brought my original charter change proposal, which would require city council approval of mayoral cabinet appointees based on the current experience. I plan to expand the reach of that proposal. My original plan tonight was to call these contracts out for a vote so that I could vote against them as a council member.'",
        "'speaker_2': 'Contract approval is one of the few powers that I have. Unfortunately, in our strong mayor system, the only the mayor can direct actions of city agencies.'",
        "'speaker_4': 'So when an agency makes it.'",
        "'speaker_2': 'Clear that it is unwilling to collaborate with another department, or in my case, city council office, my options are limited and contract approval is one of the only levers I have left. That said, I would like to try and find a more collaborative solution.'",
        "'speaker_2': 'Instead of voting no on these contracts tonight. I would like to ask my fellow council members to join me in writing a letter to Mayor Hancock detailing the issues that any of our council offices are experiencing.'",
        "'speaker_4': 'With the Department of Transportation and Infrastructure.'",
        "'speaker_2': 'I am hopeful that together we can use our collective voice as a council to impress upon the Mayor's office these concerns in a way that inspires action. That my voice alone hasn't been able to achieve. I look forward to discussions with my fellow council members on this issue later this week.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember. All right. That concludes the items to be called out this evening. Councilwoman Black, did you get in on this one? Yeah.'",
        "'speaker_2': 'Go ahead. Just in response to Councilwoman Sawyer's.'",
        "'speaker_10': 'Concerns, I see that we.'",
        "'speaker_2': 'Do have our director of Dotty here in the audience, Euless, Clerk Lee. And I feel like in a matter of fairness, that he should be able to respond to that.'",
        "'speaker_6': 'So. Okay.'",
        "'speaker_11': 'Thank you very much, Councilwoman Black, and I appreciate the opportunity to come and speak to this action. And greetings and good evening to everybody here on council. So I appreciate the detail of why these were called out by Councilwoman Sawyer.'",
        "'speaker_11': 'However, I completely disagree with the characterization that you just uttered. We have 1400 employees here in our department, many of whom actually work in your districts. These folks get up every single day. They actually face harm every single day.'",
        "'speaker_11': 'They are contested on the work that we do. We have folks that are heavy equipment operators that put their lives at risk. We have planners and designers and people that build our city infrastructure and we take our job seriously.'",
        "'speaker_11': 'We not only take our job seriously, but we are always willing to work with every single one of you on council, as well as all of our communities and all of our stakeholders to make sure that we are building the best city in the country.'",
        "'speaker_11': 'We have some of the best people and some of the best professionals that you will be able to find throughout the country. I have worked in 15 different cities, in 15 different states, so I'm kind of disappointed that I had to come up and actually defend our staff that get up every day to make a sacrifice, to'",
        "'speaker_11': 'work on your behalf, to work on your constituency's behalf, to make this city much better. I did have conversations with Councilwoman Sawyer. She brought to me some of the issues. And just keep in mind, this is an issue between Councilwoman Sawyer and one one employee in our department.'",
        "'speaker_11': 'She addressed and came to me with our concerns. I listened to her feedback. The following week I made an action and came up with the solution to address her concerns. And yet I am here today, so I do not agree with this type of tactic.'",
        "'speaker_11': 'I think what it ends up doing is putting us at risk from a department is essentially sabotages our way to deliver projects and services that are and puts the city at risk, the entire city at risk because there's an interpersonal issue with one councilmember and a Department of Transportation and infrastructure employees.'",
        "'speaker_11': 'So I encourage you, the councilwoman, to continue to work with us. We are committed to make sure we work with not only you, but all of the council. We are in this together and we want to do what's best for the city, and we do not agree that this is the right tactic moving forward.'",
        "'speaker_11': 'So I welcome your partnership. Thank you.'",
        "'speaker_1': 'All right. Thank you. Seeing no other speakers. Council member CDEBACA.'",
        "'speaker_2': 'Thank you, Mr. President. Just a real quick question. Would it be possible to postpone this to a date certain so that there could be some collaboration? That that's absolutely fine with me? Like I said in my statement, I actually had originally.'",
        "'speaker_4': 'Planned to vote the contracts down and had changed my mind.'",
        "'speaker_2': 'After discussion.'",
        "'speaker_4': 'And had instead.'",
        "'speaker_2': 'Reached out.'",
        "'speaker_4': 'In my statement to council.'",
        "'speaker_10': 'Members to ask.'",
        "'speaker_4': 'You.'",
        "'speaker_2': 'All to, you know, work with me to write a letter to the.'",
        "'speaker_4': 'Mayor, you know.'",
        "'speaker_2': 'To have this discussion and and to bring any concerns that any council offices are having with this organization and this agency to the mayor's office to really deepen this conversation all the way around. You know, but what I what I was certainly.'",
        "'speaker_4': 'Not expecting in.'",
        "'speaker_2': 'Response to that was a personal attack from the director of the agency on this evening and standing here. Do you have particular issues with this contract? No, I do not with the four contracts that were called out tonight.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_6': 'No, thanks. Thank you.'",
        "'speaker_1': 'Okay. And Councilwoman Sawyer. So there's not a motion to postpone at this point? That's correct. You're not making a motion to postpone? No. Okay. Did you have anything else for you on her.'",
        "'speaker_2': 'Comments so that I could state my concerns with today as an.'",
        "'speaker_4': 'Agency? I think it's pretty obvious, based on the response of the executive director.'",
        "'speaker_2': 'That there is some significant concerns about lack of respect and.'",
        "'speaker_4': 'Congeniality.'",
        "'speaker_2': 'Between the.'",
        "'speaker_4': 'Agency and the.'",
        "'speaker_2': 'District five offices. And like I said, I would like to ask my fellow council members to write a letter with me about any concerns that any of our council officers might be having to further this conversation with the mayor's office.'",
        "'speaker_6': 'Great.'",
        "'speaker_1': 'All right, so you're all done with these for tonight?'",
        "'speaker_6': 'I'm all good.'",
        "'speaker_1': 'Okay. Thank you. All right. That concludes the items we've called out this evening. All bills for introduction are ordered published. Council members remember that this is a consent or block vote, and you will need to vote. Otherwise, this is your last chance to call an item out for a separate vote.'",
        "'speaker_1': 'Councilmember Ortega, will you please for the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_8': 'Be happy to do so. I move that following resolutions and bills on final consideration be moved forward in a block, starting with. Resolution number 54, 55, 73, 56, 63, 74, 75 and 132. Those are our resolutions. And now bills for final consideration are Council Bill 61, 67, 62, and that is it.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Madam Secretary, roll call black.'",
        "'speaker_2': 'I said. Abarca, i.'",
        "'speaker_0': 'Flint, i.'",
        "'speaker_6': 'Herndon, I. Hines.'",
        "'speaker_7': 'Hi.'",
        "'speaker_4': 'Cashman. Hi, Kenny.'",
        "'speaker_8': 'Ortega. Sandoval.'",
        "'speaker_2': 'Hi. Sawyer. Hi.'",
        "'speaker_4': 'Torres. I council. President.'",
        "'speaker_1': 'Hi, I'm. I'm secretary. Please close the voting. Announce the results.'",
        "'speaker_4': '12 US.'",
        "'speaker_1': '12 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 1381, changing the zoning classification for 2060 West Colfax Avenue, and a courtesy public hearing on Council Bill 71 amending Section 867 of the Denver Re my revised municipal code'"
    ],
    "A bill for an ordinance changing the zoning classification for 2060 West Colfax Avenue in Lincoln Park. Approves an official map amendment to rezone property from C-MX-5 to C-MX-8 (urban center, mixed-use from 5 to 8 stories), located at 2060 West Colfax Avenue in Council District 3. The Committee approved filing this item at its meeting on 12-17-19.": [
        "'speaker_1': 'Council is reconvened. We have two public hearings this evening. Speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so, their home addresses. If you're here to answer questions only when your name is called, please come to the podium.'",
        "'speaker_1': 'State your name and note that you are available for questions of council. Speakers will have 3 minutes and there is no yielding up time on the presentation monitor. On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to council members.'",
        "'speaker_1': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks if you're standing up in the back. Our fire code does not allow standing back there of us an exit.'",
        "'speaker_1': 'So we do have overflow next door in 432 or it's on and you'll be able to watch and see what's going on. And if I can ask everybody else to scoot together if there's any room next to you and yeah, there will be a little bit more room after this hearing for the one that I think most'",
        "'speaker_1': 'people are here for. All right, Councilmember Ortega, will you please put Council Bill 1381 on the floor?'",
        "'speaker_8': 'Mr. President, I move that council bill 19 1381 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you very much. It has been moved. Can I get a second? Thank you. It has been moved and seconded. The required public hearing for Council Bill 1381 is now open. May we have the staff report?'",
        "'speaker_6': 'Thank you, Mr. President, and happy birthday. Good evening, counsel. I'm Kyle Dalton with the Department of Community Planning and Development. I'm substituting for Ellis TV tonight. Who prepared the materials in your record? She's out sick this evening. This is a request to rezone 2060 West Colfax Avenue from Cemex 5 to 8.'",
        "'speaker_6': 'It's located in Council District three in the Lincoln Park neighborhood. It is located southwest of the interchange of Interstate 25 and Colfax Avenue, north of 14th Avenue and east of the South Platte River. The request to rezone to CMCs eight is to urban center mixed use district that to allow a buildings up to eight stories and there's'",
        "'speaker_6': 'currently a one story warehouse on the site and the proposal is to rezone in order to facilitate redevelopment surrounding the existing structure. The current zoning ACM x five, which allows buildings up to five stories and it's adjacent to five story zoning and must in most directions except with the open space to the west where the South Platte'",
        "'speaker_6': 'River is located. It's currently used industrially and is in an area surrounded by office and utilities. Industrial and open space uses. Here's a shot of the property looking northeast towards downtown, generally in an industrial and mixed use context in the near near near of the photograph looking to the intensity of downtown to the northeast.'",
        "'speaker_6': 'Here's a taste of the site in the surrounding areas. The photo in the middle is the subject site to the above and below are surrounding buildings, showing a generally 1 to 2 story scale with some taller buildings in the area and a mix of building coverage as.'",
        "'speaker_6': 'The applicant has entered voluntarily into an affordable housing agreement to exceed the minimum city standards. They have committed to a minimum that 10% of all dwelling units will be offered for sale at or below 80% of the area median income, or 60% for rental units for a period of six years.'",
        "'speaker_6': 'And a minimum of 25% of those units will be at least two bedrooms. The process. They follow the process required by code for a rezoning planning board recommended unanimously that you approve this at a public hearing in December.'",
        "'speaker_6': 'There are three letters of support from different registered and neighborhood organizations, including in your packet. There's also a letter of support representing two property owned or two businesses and a property owner in your packet. And we've received no other public comments on the application.'",
        "'speaker_6': 'There are five review criteria.'",
        "'speaker_0': 'And.'",
        "'speaker_6': 'Analyze more detail in your staff report. I'll go quickly through the five criteria. The first is that a rezoning must be consistent with adopted plans. It's consistent with the comprehensive plan strategies, including under the Equity Vision element, where it will enable mixed use development, including an increase in allowed housing density near two stations along the light rail'",
        "'speaker_6': 'line. It's also consistent with the climate recommendations of comprehensive plan 2040. In particular, because it's an infill location where infrastructure is already in place. Again, it's near a couple of light rail stations. It's well connected to the city's Off Street Mobility Network as well, with the proximity to the South Platte River corridor.'",
        "'speaker_6': 'Turning now to the city's land use and transportation plan blueprint, Denver. The future place contemplated here is the district's place. This is a special district which can be mixed use and offer a diverse range of amenities. That's the context excuse me that the blueprint Denver stipulates for the site, the future place type is innovation flex.'",
        "'speaker_6': 'And this is contemplated for a mix of employment and residential with buildings that orient to the streets and are pedestrian friendly. In the proposed TMX eight zone district allows a wide and diverse range of uses consistent with this recommendation, including residential office, retail and some light manufacturing uses commonly associated with craft or makerspace and design.'",
        "'speaker_6': 'It also implements Blueprint Denver's recommendations in terms of the growth strategy in this area of the city, the districts areas we the plan contemplates up to 15% of the city's job growth and 5% of new households. Rezoning would enable growth consistent with that strategy.'",
        "'speaker_6': 'I'll turn now to a couple of small area plans that also apply to the site. The first is the Decatur Federal Plan, which city council adopted in 2013. It contemplates that this area is a transit oriented character area where the highest intensity development and mix of uses is contemplated.'",
        "'speaker_6': 'The mapping corresponds with the urban center neighborhood context. And again, we found that the zone district is consistent with this recommendation of the plan. The plan actually also has a building heights map that recommends up to 12 storeys because this applicant is requesting eight storeys that's under the 12 storeys recommended by the plan.'",
        "'speaker_6': 'And so the zoned district is also consistent with that part of the plan. The last small area plan that applies is the Lama Lincoln Park Neighborhood Plan adopted by council in 2010. It shows this area's mixed use. It's an opportunity for redevelopment to provide jobs, retail and services.'",
        "'speaker_6': 'And again, we found that the proposed district is consistent with that recommendation. Finally, the citywide housing and inclusive Denver plan that City Council adopted includes recommendations around creating and preserving housing options that are accessible, affordable, mixed income and mixed use, although not required for compliance with the other adopted plans.'",
        "'speaker_6': 'The affordable housing agreement that was signed by both the city and the property owner that I mentioned earlier is consistent with that plan direction. It's also consistent with the second and third review criteria that will result in uniform application of zone district standards.'",
        "'speaker_6': 'It will further the public health, safety and welfare there, justifying circumstances due to the adoption of the plans that I mentioned earlier, which identify this as a total area. There have been major planning efforts and redevelopment in the surrounding area as well that justify the change in the zoning.'",
        "'speaker_6': 'And then finally, the request to district is consistent with the neighborhood context, description, zoned district purpose and intent as specified in the code and as further detailed in your staff report. The applicant is here and is signed up to speak and I'll be happy to answer any questions later.'",
        "'speaker_1': 'Thank you very much. All right. We have five individuals signed up to speak on this item tonight. First up is Susan Powers.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_6': 'Council president and members of the city council. My name is Susan Powers, the president of Urban Ventures, which is a development group in Denver. My home address is 1475 Dale Gainey Street. I wanted to provide a couple of pieces of information that might not come through the normal process here to explain why I'm doing this at this'",
        "'speaker_6': 'point. Steam on the plot is about a three acre property that we purchased about four years ago, and within it, we have two renovated buildings, one that houses the fantastic New Rises Brewery here and the steam building, which is completely leased to.'",
        "'speaker_6': 'Has over 400 employees. We have surface parking that meets the code at this point. When we first started the development, it was difficult for us to see this as a place for all for new office development, because it was somewhat pioneering.'",
        "'speaker_6': 'So we have extra parking that we have leased from the Broncos to meet the needs of the employees. We all recognize that in five, ten, 20 years, nobody is going to have a car. But unfortunately, everybody has a car still at this point, most people do.'",
        "'speaker_6': 'So we have, as the Broncos have have announced their plans to move ahead with with their redevelopment of the parking lots that they have. I started getting concerned that we would be losing that extra parking and decided that we need to take the steps to move all of our parking needs onto our site.'",
        "'speaker_6': 'In order to do that, we would be building an eight story structure of which four floors of it would be structured parking, and then four floors will either be office or residential. We haven't made the decision about whether it's residential or office at this point are our lease up is fairly new.'",
        "'speaker_6': 'We're getting a sense of kind of what the what the energy level is and the interest in in coming into it into the Sun Valley area, which is pretty strong. So it might end up being an office building, but the building would be wrapped with either office or residential.'",
        "'speaker_6': 'So you wouldn't see see the parking structure from the lower floors and we'll design the parking so that in the future when none of us do have our cars, we can convert that to other uses as the demand for parking goes down over the five years that we've been involved in Sun Valley neighborhood.'",
        "'speaker_6': 'We've developed deep relationships with members of the community and have brought businesses to stem on the plot that have also become integral partners in the neighborhood. This rezoning will allow us to bring additional jobs or housing to Sun Valley and to address the parking needs at the same time.'",
        "'speaker_6': 'I appreciate your support and any questions here to answer.'",
        "'speaker_1': 'Thank you very much. Next up, Jesse Pearce.'",
        "'speaker_11': 'Good evening. Members of council, those watching at home, those in the audience. My name is Jessica Sharp. Harris and I ran for city council at large last year, almost 15,000 votes with no money. And I'll be running again to be the next mayor of 2023.'",
        "'speaker_11': 'And I represented for Denver Homicide Law, Black Star Examiner for self-defense, positive action, calling for social change as well as the Unity Party of Colorado and Mile High. No. I was originally against this rezoning because like it was already stated.'",
        "'speaker_11': 'Sun Valley is really cultural district for the West Side and the natives have been.'",
        "'speaker_7': 'Displaced in this area. So I was pleased to hear that there was going to be affordable housing potentially at.'",
        "'speaker_11': 'This site at 80%. Amarillo, that that still kind of rolls me the wrong way. But I see that the occupant did their due diligence and went to the Arnolds in the area and asked them if they approved of this.'",
        "'speaker_11': 'And I didn't see any letters of opposition to this. So there's really nothing I'm going to tell you that's going to not make you pass this because it's already been set in stone. And like I said, the Arnolds haven't went against it and there's no letters of opposition.'",
        "'speaker_11': 'So with that being said, I have to approve this. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Jose Tito. Sorry.'",
        "'speaker_7': 'He gets butchered all the time. Happy birthday, by the way. Good evening, council members. My name is Joseph Ed. I recited 769 South Hudson Street. I attended a 2060 was Colfax Avenue. I race brewing company which many of you have been able to visit.'",
        "'speaker_7': 'And I wanted to talk in favor of of of passing this because as I'm here to speak more about the character of the applicant, Susan Powers and her team have been excellent in furthering opportunities for people of color, women and other minorities.'",
        "'speaker_7': 'And we are Latino on Hispanic, on Mexican, on LGBTQ, on veteran owned business that is doing really well thanks to affordable commercial real estate, real estate provided by by Susan. And we welcome this change in density, because that means more business not just for us, but for the businesses within STEM on the planet and within businesses within'",
        "'speaker_7': 'that fine line between Lincoln and Sun Valley. Right now, that's a little bit of a desert, but thanks to the spark that has been happening in that area. We welcome this kind of density done in a proper way, just the way that Susan and her team are doing.'",
        "'speaker_7': 'So thank you for considering my words. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_0': 'Yes. Good afternoon. When I was chairman, Sekou, the founder, organized the Black Star Action Movement for Self-defense. Born and raised. Denver 68 years. And voice for the oppressed, the poor. Vulnerable. This. Is consistent. With the plan. I'm like everyone who comes here to do a zoning change.'",
        "'speaker_0': 'All of them have been cookie cutters into a format that is working to make this have some consistency throughout the city. And I salute the council for working on this, because this is an owner's task to do, especially when you get it at this stage of the city's development.'",
        "'speaker_0': 'And so I support this because to not support this, I would be a hypocrite and supporting other neighborhoods and not supporting this one. And I do have some concerns. The process that we're doing. And the modernization of these neighborhoods.'",
        "'speaker_0': 'A starting to distort the character of the city. We're now we're starting to look like New York. And that's not who we are. This is the wild, wild west. And we have a certain thing that happens out here with everyday folks.'",
        "'speaker_0': 'There's a certain integrity and honesty about the people who just tell you flat out whether we like it or not. And we like to be like, you know, we don't you don't want no games being played with this and now we're losing who we are.'",
        "'speaker_0': 'See, when we do these kind of things and we have buildings that go up that are not consistent to the history of who we are. I don't even know what they look like. Vertical penitentiaries. Everybody's stacked on top of each other and anal space and develops a certain mental sickness like they got in New York where people'",
        "'speaker_0': 'don't even talk to each other. No. And everybody is suspicious of everybody because you're cooked up into some kind of container and you're not free to breathe. See, there's something wrong with that picture. And at this stage in my life.'",
        "'speaker_0': 'I don't even know who we are anymore. So I don't know. So. As I get better at this thing. I am.'",
        "'speaker_1': 'Thank you. Next up, Jeannie Granville.'",
        "'speaker_2': 'Good evening. My name is Jean Granville, 2715 West told in place. I am here tonight as president of the Sun Valley Neighborhood Organization. It's called the Sun Valley Community Coalition. We did send in a neighborhood position.'",
        "'speaker_4': 'Statement which should.'",
        "'speaker_2': 'Have been passed on to you, I think, in your packets. But I would just like to take a moment to point out a few of those things as to why we're supporting this rezoning and really commend the applicant Urban Ventures and Sue Powers and her team as what we consider to be kind of a model for developers'",
        "'speaker_2': ', new developers that we know will be coming into the Sun Valley area. As you're well aware, Sun Valley is embarking upon a huge transformation, and I will just.'",
        "'speaker_4': 'Point out a.'",
        "'speaker_2': 'Few of those things. A couple of which you've heard the steam on the Platte development has environmentally cleaned.'",
        "'speaker_4': 'Up and.'",
        "'speaker_2': 'Restored blighted property with sensitivity to preserve historical structures that characterized the Lower Colfax area has attracted encouraged tenants committed to hiring from the neighborhood whenever possible. Being active in and contributing to the Sun Valley neighborhood has provided affordable business opportunities for people of color.'",
        "'speaker_2': 'And women such as bold beans, coffee through girls, ink and rice brewing has volunteered and contributed. Attend to numerous neighborhood activities and cultural events, and as part of the neighborhood organization and other numerous local planning activities, continues to.'",
        "'speaker_4': 'Demonstrate commitment to providing economic.'",
        "'speaker_2': 'Opportunities that promote Sun Valley's values of diversity, inclusion, and equitable and viable economic opportunity. While we realize that this is primarily a commercial venture, the rezoning to.'",
        "'speaker_4': 'Allow in well, in support.'",
        "'speaker_2': 'Of a commercial venture, we really do commend Urban Ventures for also exploring the very much needed affordable housing that we.'",
        "'speaker_4': 'Know.'",
        "'speaker_2': 'We will be pursuing within the neighborhood. So I urge your support and thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers on this item. Are there any questions from members of council? Councilman Cashman.'",
        "'speaker_0': 'Thank you, Mr. President. Either for my powers or Kyle. I'm just where I am. Not clear on where things are at, on whether there's going to be affordable housing or not.'",
        "'speaker_6': 'Oh, there's there's an affordable housing agreement that we've signed and it's been recorded. Okay. So but if we if we choose to do office, then we would pay the fee instead of building the housing. So but we did sign the agreement.'",
        "'speaker_0': 'But we don't know today.'",
        "'speaker_6': 'We don't know today.'",
        "'speaker_0': 'Thank you. That's all. Mr. Press.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Mr. President, if I may. For my colleagues, some of the materials were not in our granicus and Zack has emailed them. So the affordable housing plan and the updated PowerPoint, which includes some of the affordable housing details, is in our email.'",
        "'speaker_4': 'And I know I don't always see my email in the middle of a hearing, so I wanted folks to know it was in there.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Hines.'",
        "'speaker_7': 'Thank you, Mr. President. I just wanted to say, Miss Powers, thank you for for moving this forward. And I think.'",
        "'speaker_1': 'Councilman, we're still in questions. We're going to get to comments and maybe I had a question come in, but I want to send it.'",
        "'speaker_7': 'All the way with it, too. Okay. Thank you.'",
        "'speaker_1': 'I will get back to you in just a second. Councilmember Ortega.'",
        "'speaker_8': 'If you wouldn't mind coming to the microphone. So if you were just building and you were allowed to continue to do to use the parking at the stadium, you wouldn't need to reason. Correct. You're doing this so that you can accommodate the parking onsite.'",
        "'speaker_6': 'Well, yeah. I mean, because.'",
        "'speaker_8': 'We were you have that long, Tony.'",
        "'speaker_6': 'Built, any building we put in there is going to take the onsite parking off of it anyway. So we would we would still need to replace the parking that we have on site somewhere. And so we would be building structures.'",
        "'speaker_8': 'Okay. So I was just trying to understand the primary reason why you needed to rezone.'",
        "'speaker_6': 'Yeah, well, and that is for the addition, the parking that is on the stadium. You're right. We need to build a structure. This will make it a higher structure. And that's the reason is, is that it's in order to bring back the spaces that are on the stadium site, onto the site.'",
        "'speaker_6': 'Now it has to get above five storeys.'",
        "'speaker_8': 'And we don't really know the timing of when the stadium is going to want to move forward. But this creates that stability. Right.'",
        "'speaker_6': 'That's exactly right.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_6': 'Sure.'",
        "'speaker_1': 'Thank you, Councilmember. All right. Seeing no other questions. The public hearing for Council Bill 1381 is closed, and now it's time for comments from members of council. Councilmember Torres.'",
        "'speaker_4': 'Thank you, Mr. President. I just I really want to thank Susan for the work that you've done thus far in Urban Ventures. Jean Granville is absolutely correct. Sun Valley is undergoing a huge transformation. This is accurate and it puts tremendous responsibility on the city and on this council to make sure that it's not done at the expense'",
        "'speaker_4': 'of families who have sustained that neighborhood for generations with very little attention. From what I've seen in terms of the renovation at Steam on the Platt building and the renovation of the building where race operates, I'm excited to see what comes of this particular vision.'",
        "'speaker_4': 'I've currently been holding my coffee and community at the Bold Beans location, which is on the first floor of Steam on the plot. It is fully occupied and it's a makerspace, which is, I think, the vision moving forward even into the commercial vision of the next building.'",
        "'speaker_4': 'So you have folks who are creating things, which is something that we've lost in Denver, are dedicated spaces to makers. And so I'm excited about that being a part of the Sun Valley future and vision on a continued basis.'",
        "'speaker_4': 'This this space carries forward that in addition to community space, reflection of the Sun Valley community and respect of of the river and, and the land commitment that we have there as well. So I'm I'm really thrilled about this.'",
        "'speaker_4': 'I'll be supporting it. I hope my my colleagues will as well. And just really appreciate all the due diligence that you've done community wide on this project.'",
        "'speaker_1': 'Thank you, Councilmember.'",
        "'speaker_0': 'Councilmember Hines.'",
        "'speaker_7': 'I do have a couple questions. No, I'm just kidding. So I feel like a repeating myself. Myself. But I do want to thank you. I don't have questions, but I want to thank Ms.. Powers for your for your hard work on this.'",
        "'speaker_7': 'I want to thank staff as well for your hard work. I know it's not every day that you get both all the nays turned to. Yes. So, you know, when you get Jessie Paris and chairman say you go from a no to a yes.'",
        "'speaker_7': 'That's pretty awesome. So. And no letters against it. So thank you very much for all your work and making sure that this is a unanimously in favor. So thank you.'",
        "'speaker_1': 'Thank you. Councilmember Councilmember Torres, you back up?'",
        "'speaker_4': 'I did because I wanted to make sure folks knew exactly what rentals at 60% AMI and for sale at 80% am. I means if it's a rental, it's 60%. And you were a single individual, you were earning up to $39,000 a year.'",
        "'speaker_4': 'If you're two people, you're earning together $44,580. If it's for sale at 80%. Ami for one person, that's somebody who's earning less than $52,000 a year and for a couple, jointly, 59,400 a year. So we're still talking about workforce housing, folks who might be teachers, who might be cops, who might be firefighters who still need to find'",
        "'speaker_4': 'places to live in the city. So I just wanted to share those numbers.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Cashman.'",
        "'speaker_0': 'Thank you, Mr. President. You know, normally I would be pretty concerned. Without a definite yes, there's going to be affordable housing. I hear it's in the plan and an option. I have watch list power since her days with the Urban Renewal Authority many, many moons ago.'",
        "'speaker_0': 'And I fully believe that by looking at what's come before that, whatever is built on this piece of ground will be in in line with the values we hold as a community. So I'll be glad to support this this evening.'",
        "'speaker_1': 'Thank you, Councilmember. All right. Seeing no other comments, Madam Secretary, roll call.'",
        "'speaker_2': 'Torres.'",
        "'speaker_4': 'I black. I CdeBaca.'",
        "'speaker_0': 'Flynn I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_6': 'HINES All.'",
        "'speaker_7': 'Right.'",
        "'speaker_6': 'Cashman. All right.'",
        "'speaker_8': 'Kenny Ortega. I seen the ball.'",
        "'speaker_2': 'I. Sawyer. I.'",
        "'speaker_4': 'Council. President.'",
        "'speaker_1': 'Hi, Madam Secretary. Please close the voting, announce the results.'",
        "'speaker_4': 'You have a nice.'"
    ],
    "A bill for an ordinance amending section 8-67 of the Denver Revised Municipal Code requiring a provisional breed-restricted license for owners of pit bulls. A bill for an ordinance amending section 8-67 of the Denver Revised Municipal Code requiring a provisional breed-restricted license for owners of pit bulls. The Committee approved filing this item at its meeting on 1-22-20.": [
        "'speaker_1': '11 eyes comfortable. 1381 has passed. Ah, right. Councilmember Ortega, will you please put Council Bill 71 on the floor?'",
        "'speaker_8': 'Mr. President, I move that council bill 20 0071 be placed on final consideration. Do you pass?'",
        "'speaker_1': 'Thank you. It has been moved. Can I get a second? Thank you. It has been moved and seconded. The courtesy public hearing for Council Bill 71 is open. Before we jump into the overview, I will announce again that unfortunately our fire code does not allow anyone to stand in that back row, so you'll need to either find'",
        "'speaker_1': 'a seat here or right next door. We have this on TV so you can watch and wait for your name to be called if you're here to speak, but you can't stand in that back row. We have to keep that open for people getting in and out of of the room.'",
        "'speaker_1': 'So thank you very much. Councilmember Herndon, are you going to give us a quick overview?'",
        "'speaker_9': 'Yes, Mr. President. And we are going to I want to make sure that we get the presentation up so all of those can see. To it. I see it on that screen, but I do not see on big screen.'",
        "'speaker_9': 'If Stacey could. Come. Thank you for that. Though I am sure most are familiar with what this is.'",
        "'speaker_4': 'Really?'",
        "'speaker_0': 'All right.'",
        "'speaker_9': 'So what I have before us on second reading is a proposal to update our Denver animal ordinance, and that's going to be through creating a proposed breed specific license. So you go to the next slide to own a pit bull.'",
        "'speaker_9': 'And for the remainder of the night, when I say pit bull, I'm actually referring to one of 3b1 of three breeds, the American Pit Bull Terrier, the American Staffordshire Terror and the Staffordshire Bull Terrier. So currently they're not allowed within the city and county of Denver.'",
        "'speaker_9': 'Should this pass, we will create a breed restricted license for those owners who have those dogs within the city and county of Denver. The license application will require name and address where the dog primary resides to emergency contacts, an accurate description of the animal and annual fee, which Denver animal protection will speak to that in a little'",
        "'speaker_9': 'bit. Proof that the animal is microchipped, receive current rabies vaccination and must be spayed or neutered. Next slide. Other conditions of ownership. A maximum of two per household must notify Denver animal protection within 8 hours if their dog escapes or does bite.'",
        "'speaker_9': 'Most notify Denver animal protection within 24 hours of the dog dies. Or if the owner moves. If the dog is on the Denver Animal Protection Registry and there are no violations of Chapter eight for 36 consecutive months, never animal protection may remove the requirement for a breed restricted license, and then the owner would then license their dog'",
        "'speaker_9': 'under the same requirements as in any other dog that's currently allowed within the city and county of Denver. Next slide cover highlights of the proposed changes. Denver Animal Protection is the only agency that can provide the pit bull breed assessment that's valid in Denver.'",
        "'speaker_9': 'Denver Animal Protection may hold transport and adopt any pit pit bulls adopted from Denver. Animal protection will receive the Retrievers restricted breed license upon adoption. Also important to note, any Humane Society license and registered by the city may hold transport in adopt any pit bull.'",
        "'speaker_9': 'One example would be Denver Dumb Friends League. A new owner must obtain the restricted breed license from Denver animal protection after a two year period. And this was a change that we had earlier. Denver Animal Protection will review the current data and report the findings back to City Council and to let us know if there are any'",
        "'speaker_9': 'recommendations to move forward and what has not been said. I want to make sure this is important to note. If approved tonight, this will take effect in 90 days after passage. There needs to be a runway period where Denver animal protection can do a messaging campaign as they get ready for these animals to come forward.'",
        "'speaker_9': 'So should this pass, it does not take effect for 90 days. I believe there's one more slide. The current law, the three breeds, are currently not allowed. What happens if an owner doesn't apply for a breed restricted license?'",
        "'speaker_9': 'Denver Animal Protection is going to speak to that later during a question and answer period, but they will be subject to administrative and or criminal penalties. What happens should these animals bite? We currently have a potentially dangerous dog ordinance that's been on the books for the past two years and they will go underneath that potential ordinance.'",
        "'speaker_9': 'And if there was a violation during the 36 month period, restricted license period, depending on what happens, Denver Animal protection can make a recommendation to either take the dog off or let it move forward, depending on what the violation is.'",
        "'speaker_9': 'Thank you, Mr. President. That concludes the staff report.'",
        "'speaker_1': 'All right. Thank you, Councilmember. We have quite a few people signed up to speak this evening and we have a one hour courtesy public hearing. So I am going to ask a couple of things so that we can get to as many people as possible tonight.'",
        "'speaker_1': 'First of all, again, I'm sorry if you didn't hear when I first announced, but we can't have anybody standing in the back because we have to have fire, ingress and egress. So you either have to grab a seat or there is an overflow or this is being televised next door that you can watch and wait for your'",
        "'speaker_1': 'name to be called. I'm going to call five people up at a time. We have we're going to keep this first bench right here clear for have one speaker. And if the other four can kind of squeeze together on that bench, I'm going to call you up then so that the shuffling of getting out of the seats'",
        "'speaker_1': 'that you're packed in, we can get everybody kind of lined up in time to get it. And I ask that when I call your name, step right up to the microphone. We're going to start your time right away.'",
        "'speaker_1': 'The other thing that I'll ask is if we get near the end of that hour and somebody has already said all of the things that you wanted to say, you can say, I second this thing and I second that thing.'",
        "'speaker_1': 'You don't have to give us the whole thing to make sure that we have room for the next person if they have something new to say. So thank you very much for anything that we can do to make sure that we get to as many people as possible.'",
        "'speaker_1': 'So the first five people, if you could come up, Michelle Larson, you'll be at the microphone. Connor Stephenson, Paul Verandahs, Marta Garbo Ski and Reginald Norman. If you could grab a seat in that front bench and Michelle, you are up.'",
        "'speaker_4': 'Michele Larson is intending to be someone.'",
        "'speaker_2': 'Who will speak.'",
        "'speaker_6': 'In.'",
        "'speaker_4': 'Response to questions from the council. And I'm sorry if that wasn't clear.'",
        "'speaker_1': 'Great. You are. Michele Larson, are you not?'",
        "'speaker_6': 'Okay.'",
        "'speaker_4': 'She's on her way. She's representing the Colorado Veterinary Medical Association.'",
        "'speaker_6': 'Okay. So thank you very much. We could put her in a different pile.'",
        "'speaker_4': 'That would be great.'",
        "'speaker_1': 'Okay. Thank you. Connor Stephenson.'",
        "'speaker_6': 'Okay. Thank you, council members.'",
        "'speaker_7': 'I am a constituent from District seven. I live at 793 South Downing Street and I recently moved from District one. I believe that this bill is the best compromise for improving Denver's public safety and replacing a policy that has euthanized thousands of great dogs since its inception.'",
        "'speaker_7': 'Breed specific legislation is an issue of large national interest and not confined to our community. As such, there's a great deal of information and research surrounding breed bans. While Denver is the city that I am concerned with. I want to use my time tonight to read a few conclusions from reputable national organizations and scientific studies that have'",
        "'speaker_7': 'examined the issue. I also want to and if I have time with a brief anecdote about a pit bull that made a big impact on my life. So an article published by the American Veterinary Medical Association's Task Force on Canine Aggression states that, quote, Singling out one or two breeds for control can result in a false sense'",
        "'speaker_7': 'of accomplishment. Doing so ignores the true scope of the problem and will not result in a responsible approach to protecting a community citizens. Likewise, an article published by the Animal Law Coalition states that, quote.'",
        "'speaker_6': 'The CDC has since.'",
        "'speaker_7': 'Concluded that their single vector epidemiological approach did not identify specific breeds that are most likely to bite or kill, and thus it is not appropriate for policymaking decisions related related to the topic. Finally, the National Canine Research Council states no national no major national organization endorses BSL, including the American Veterinary Medical Association, the Centers for Disease Control'",
        "'speaker_7': ', the Humane Society of the United States, the National Animal Control Organ Association. The American Society for the Prevention of Cruelty to Animals and the Best Friends Animal Society.'",
        "'speaker_6': 'I find the consistency of their agreement.'",
        "'speaker_7': 'To be a very compelling. Finally, I would like to end by talking about my beloved key to bear, an unlicensed pit bull that I lived with when I first moved to Denver. In that house, I experienced a very emotionally challenging domestic situation, but without fail.'",
        "'speaker_7': 'When I was at my lowest points, Quita would be right by my side, pushing her snout into my face in an attempt to deflect some of my pain. Me, Quita and her owners would often spend evenings in the living room dancing to Lou Reed's vicious, lambasting her public reputation and celebrating her.'",
        "'speaker_6': 'Enthusiasm and boundless love.'",
        "'speaker_7': 'Despite the ups and downs in that house. Those nights were among the happiest.'",
        "'speaker_6': 'I've had in Denver.'",
        "'speaker_7': 'I would love other Denver ites and their pets to be able to safely experience that same sort of love and connection. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Paul Prentice. And if we could. Sorry, I'm going to make another request. If we can keep the applause and the cheering, make it a safe place for people on both sides to present. And also it helps us speed and stay on time.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'Thank you. My name is Paul Francis.'",
        "'speaker_6': 'I live in Lowry and District.'",
        "'speaker_7': 'Five and I'm the parent of a two year old and five year old. Thank you for hearing me tonight. I am open to a collaborative approach to reintroducing legislation of pitbulls in Denver. However, I am against this bill and we ask you to.'",
        "'speaker_11': 'Vote no for three main reasons. First, public safety.'",
        "'speaker_7': 'Second, lack of data. Third, the impact on marginalized Denver rights.'",
        "'speaker_0': 'The number one.'",
        "'speaker_7': 'Problem with this bill is its failure to address pitbulls and public safety in a nurturing environment.'",
        "'speaker_0': 'Pit bull behavior may.'",
        "'speaker_7': 'Be no different than any other dog. However, many pit bulls do get cared.'",
        "'speaker_11': 'For differently, which is why reports show that they are involved.'",
        "'speaker_7': 'In a higher level of violent attacks. Reintroducing pit bulls in Denver should address both.'",
        "'speaker_0': 'Nature and nurture. Unfortunately, this current bill would provide all Denver rights the privilege of.'",
        "'speaker_7': 'Owning a pit bull without any consideration as to their ability to do so responsibly. Can we do better? Absolutely.'",
        "'speaker_0': 'For example, we don't provide driver's licenses.'",
        "'speaker_11': 'To all people who want them, but.'",
        "'speaker_0': 'Rather a minimum.'",
        "'speaker_7': 'Level of.'",
        "'speaker_0': 'Competency.'",
        "'speaker_7': 'Needs to be first proven. The privilege of owning a pit bull should be granted only to those people who we think will be responsible owners. The second problem that I have with this bill is lack of data. This bill does not have any data accompanying it for the public to review.'",
        "'speaker_7': 'This leaves me with more questions and answers. Questions like What are the current and projected levels of dog bites? One disturbing data point is the estimated 20% compliance rate on existing pet registration laws. Don't you think the fact that 80% of pet owners are not following current laws indicates that our priority should be to drive compliance to'",
        "'speaker_7': 'existing laws before we extend additional privileges? Finally, the third problem that I have with this bill is its impact on marginalized citizens. I was surprised to hear that a lot of pit bull complaints in Denver have been coming from some of our poorest citizens.'",
        "'speaker_7': 'It made me pause to think, Why are they having so much trouble with dogs? What is going on in these communities to cause this? And most importantly, what impact is this bill going to have on these citizens of ours?'",
        "'speaker_7': 'I don't have the answers to these questions, but I'm very concerned that no one else here tonight does either. When we are crafting a law that disproportionately impacts the marginalized group of people, we should be going into these neighborhoods and having these conversations, especially when it's a matter of public safety.'",
        "'speaker_7': 'Without easy answers, I don't believe we have enough information on this topic to move forward. In closing, the issue of reintroducing pit bulls in Denver is a complex, multi-dimensional, high stakes issue. This bill oversimplifies the process of this reintroduction without addressing public safety.'",
        "'speaker_7': 'Outcomes data to support or engagement with the most marginalized group of Denver writes on a matter of life and death. There is nothing urgent about.'",
        "'speaker_11': 'This topic that requires it to pass tonight.'",
        "'speaker_7': 'I ask you to vote no on this bill tonight and put a plan together that truly hears the voice of the people to come up with a good compromise. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Martin Garbus key.'",
        "'speaker_4': 'Hi. All right. Thank you for allowing us the opportunity to discuss this bill. My name is Martin and live in District four. I'm very glad that he brought up some of these points because I want to talk about them as well.'",
        "'speaker_4': 'I'm actually going to change my speech a little bit because I want to talk about his stuff first. Implementing this amendment will actually give us the data that we need for all of his concerns. We are looking to find out if pit bulls are actually dangerous animals.'",
        "'speaker_4': 'Obviously, I don't think so. But this will give us the data that we need, the data that we have all across the United States right now. Doesn't have good information on this.'",
        "'speaker_6': 'This.'",
        "'speaker_4': 'Denver will be one of the first cities that will actually track and know exactly what is causing dog bites, what's causing violent attacks with animals. Okay. Now back to the other stuff. One of the things that we do have statistics from is dog bites or eggs or Wikipedia.'",
        "'speaker_4': 'People are always citing the statistics and if you actually delve into the information behind them, there isn't enough factual data from them. They're not peer reviewed sites. They're just written by regular people with news articles as their basis.'",
        "'speaker_4': 'We don't know if these dogs that are attacking people are pit bulls or they're a breed that looks like pit bulls or are mixed. Again. Denver will give us the opportunity to learn about these things and make sure that if a pitbulls in an attack is actually a pit bull.'",
        "'speaker_4': 'Um. The other thing I want to bring up is. The leash laws that a lot of people brought up concerns with at the last hearing as a pit bull owner back in 2003. My biggest fear was another dog running up to my pit bull.'",
        "'speaker_4': 'My dog was always on a leash, but if a dog ran up to my dog, I would be the one at fault because I owned a pit bull. Granted, I didn't know pit bulls were illegal in Denver at the time and we moved out two years later.'",
        "'speaker_4': 'But my biggest concern with any dog is that it's off the leash and it's going to run up and it's going to attack or start a fight with my dog. I know that you guys are concerned with pit bulls being off the leash.'",
        "'speaker_4': 'As an owner, I think more pit bull owners are worried that other dogs are going to be running up to their dog off leash and causing a bite. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Reginald Norman. And then I'll ask if you've already spoke. If we can clear that seat for the next five, I'm going to call up Laurie Brown, Larry Murray, Dr. April Steele and Caryn Norman, if you can make your reps bench, go ahead.'",
        "'speaker_11': 'Good evening, members of council. My name is Reginald Norman and I reside in the Montebello neighborhood of Denver. My wife and I walk a seven mile circuit around Montebello in the morning for exercise. Over a ten year period.'",
        "'speaker_11': 'We were attacked three times by stray dogs, and two of those attacks were by two dogs. Two dogs. So I carry a three foot section of shovel handle to protect myself. I don't have a strategy to deal with pit bulls, and I don't have a strategy to certainly deal with two pit bulls at one time.'",
        "'speaker_11': 'This concerns me. Stray dogs are out in these communities, especially my community, and getting attacked is an eye opening experience. I guess I'll have to develop a strategy to deal with pit bulls if this bill passes. So I echo the sentiments of Paul Farinas.'",
        "'speaker_11': 'This doesn't have to pass tonight. There are studies out there that may be anecdotal, but they do point that pit bulls are disproportionately responsible for attacks on individuals deaths as well as serious and which serious techs. So please do not visit this plague upon the citizens of Denver.'",
        "'speaker_11': 'Please allow us to have some sanctity in our communities without having the need to fear for our.'",
        "'speaker_7': 'Lives by being attacked by.'",
        "'speaker_11': 'Pit bulls. Thank you very much.'",
        "'speaker_1': 'Thank you. Next up, Laurie Brown.'",
        "'speaker_2': 'Good evening. My name is Laurie Brown and I live in Denver, District seven in the Baker neighborhood.'",
        "'speaker_10': 'I'm a homeowner of a master's degree in vertebrate paleontology, and I'm a former pit bull owner.'",
        "'speaker_2': 'Here to voice my support for the ordinance.'",
        "'speaker_10': 'Adopted my lab, Sharpay, mixed puppy Milo when she was three months old and immediately started her in obedience classes and structured socialization.'",
        "'speaker_2': 'Of other dogs. I purchased pet.'",
        "'speaker_10': 'Health insurance and I brought her on all my outdoor adventures when she was two. A friend mentioned to me in passing that Miller was a pit bull, and after I took an objective look at her, I realized he was right.'",
        "'speaker_2': 'The inability.'",
        "'speaker_10': 'Of most people to positively identify a dog's.'",
        "'speaker_2': 'Breed.'",
        "'speaker_10': 'Is well documented and has been shown to falsely inflate statistics of pit bull bites. With regard to Milla, though, it wasn't something I at first gave much thought because just as I don't judge people on their skin color and outward appearance, I don't judge dogs on the reader outward appearance either.'",
        "'speaker_10': 'Like people, each dog is an individual and should not be stereotyped based on their appearance, but on their individual personality and demeanor. I quickly learned there are many who don't agree with me, so I arranged my life in such a way as to keep me safe, which meant a long commute to Denver for work.'",
        "'speaker_10': 'Unfortunately for Denver, that meant its businesses and economy were unable to benefit from my contribution to the thriving and lucrative pet care industry. Mill was my best friend, a companion for many years after my father passed away, she not only provided emotional support, but also made sure I got outside every day.'",
        "'speaker_10': 'As Coloradans, we know the significant benefits of the outdoors for both physical and emotional health. Dogs have in fact been proven to reduce both high blood pressure and obesity.'",
        "'speaker_2': 'Neal was, however, a terrible guard.'",
        "'speaker_10': 'Dog and once even welcomed an intruder into my backyard, giving him kisses and happy tail wags as he stole my lawnmower mill ultimately succumbed.'",
        "'speaker_2': 'To a rare autoimmune.'",
        "'speaker_10': 'Neuromuscular disease. And my heart has never been the same since before rescuing first a pit bull and.'",
        "'speaker_2': 'Then a German shepherd. I never thought much about Breed.'",
        "'speaker_10': 'Except for the fact that I was attacked by a.'",
        "'speaker_2': 'Cocker spaniel. As a child.'",
        "'speaker_10': 'Both of my dogs have been drowned in love, had rigorous obedience training, were socialized in Spain as puppies, and have never been exposed to any negativity. I fully attribute their.'",
        "'speaker_2': 'Sweet and loving personalities to.'",
        "'speaker_10': 'These non breed related factors which have been proven key to a dog's behavior and temperament. The American Veterinary Medical Association's Task Force on Canine Aggression and Human Canine Interaction has determined that a dog's tendency to bite depends on heredity, early experience, later socialization and training, medical and behavioral health and victim behavior.'",
        "'speaker_10': 'Time and again, peer reviewed scientific studies have proven that BSL is ineffective and has no scientific basis. They've also proven no differences in temperament between, quote, dangerous band breeds and golden retrievers. And I have a list of peer reviewed articles and in case anyone is interested in therefore I believe the new ordinance is a safe, science based'",
        "'speaker_10': ', cost effective compromise. And as a Denver resident, I would love the opportunity to rescue another pit bull. So together we can be an example to the community. With responsible dog ownership and the elimination of breed discrimination, pit bulls can thrive in our community as members of our families, just as they do in the rest of the state'",
        "'speaker_2': '. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Larry Murray. Good evening, council members.'",
        "'speaker_0': 'This is sort of an emotional plea.'",
        "'speaker_11': 'And thank you for the opportunity.'",
        "'speaker_0': 'Let the people decide. Let the people decide. There are three dogs breeds I would like to highlight to our childhood friends I grew up with.'",
        "'speaker_11': 'You may know them. Rin Tin Tin. U.S. Cavalry mascot. German Shepherd. Lassie. Collie story about a farm dog.'",
        "'speaker_0': 'And a farm boy and his dog howler. Colorado Avalanche mascot.'",
        "'speaker_11': 'Saint Bernard. My point is, people don't seem to fall in the above category for Hollywood and the Pepsi Pepsi Center. What many in the community desire is a sense of security. This may seem senseless to some council members, but the ban on pit bulls provides that sense to many residents in the Denver since 1989.'",
        "'speaker_0': 'Are the reasons for providing rather a councilman.'",
        "'speaker_11': 'Hurt invalid enough to make the sense that sense of security. A way to take it away. To take that sense away.'",
        "'speaker_0': 'I simply say give the people of Denver a direct.'",
        "'speaker_11': 'Voice in the decision to change the status quo.'",
        "'speaker_0': 'With this issue, no amount of statistics.'",
        "'speaker_11': 'Will lie the fears of the citizenry. Citizenry. But I speak for myself here.'",
        "'speaker_0': 'I will abide by the will of.'",
        "'speaker_11': 'The people on this. Not just the council.'",
        "'speaker_0': 'The people. Let them decide. Thank you.'",
        "'speaker_1': 'Could you. Could you state your name for the record?'",
        "'speaker_11': 'Oh, I'm sorry. Lansbury, Montebello resident.'",
        "'speaker_1': 'Thank you very much. Dr. April Steele.'",
        "'speaker_4': 'Good evening, Mr. President and council members. I am Dr. April SEAL. I am a veterinarian and I am the CEO of the Dumb French League located in Councilman Cashman's district. The Dump Brands League is the largest animal welfare organization in Denver.'",
        "'speaker_4': 'We receive over 20,000 animals annually, and it is an.'",
        "'speaker_2': 'Unusual day that.'",
        "'speaker_4': 'We don't receive at least one pit bull. Councilman Herndon's proposal is a reasonable approach to an emotional debate, and the dump frenzy encourages you to support this policy because it's not only humane, but we believe it creates a safer community for our citizens.'",
        "'speaker_4': 'The prohibition on pit bull ownership in Denver was implemented with the goal of keeping people safe from dangerous dogs. For many reasons, we believe that implementing a managed path to ownership of pit bulls will actually create a safer community.'",
        "'speaker_4': 'We know pit bulls are already living in Denver. However, pit bull owners in Denver report they are not seeking out vital behavioral or veterinary services because they are fearful of having their pet confiscated. Looking specifically at behavior, we know that if any dog begins to show fear or aggression.'",
        "'speaker_4': 'There are behavior modification tools that are often successful in resolving that behavior, particularly if implemented early. The period of time that dogs are in socialization ends around 14 weeks of age. Any policy that diminishes the opportunity for these dogs to learn that people, cats, other dogs are normal parts of their world will lead to an adult dog'",
        "'speaker_4': 'with greater behavioral challenges. That certainly isn't what we want for any dogs in our community. However, that is often the unintended result of bans on pit bull ownership at the dump frenzy. We take the safety of our community very seriously.'",
        "'speaker_4': 'We have a team of eight full time behavior specialists, and they ensure that any dog that shows signs of aggression or fear is evaluated, has appropriate behavior modification and is placed up for adoption only if they don't pose a known risk to the safety of our community.'",
        "'speaker_4': 'We have many social and well-behaved pit bulls that fall into this category at our shelter on any given day. We also have many patrons looking for a family dog who would gladly give one of these well-behaved pit bulls a good home.'",
        "'speaker_4': 'But they live in Denver. They can adopt the not adopt this family pet and thus these dog stay kennel in our shelter much longer than other breeds. Our animal welfare community is ready to come together to offer resources for spaying and neutering these dogs, as well as to provide behavior support.'",
        "'speaker_4': 'We believe that our communities must be as safe as possible, and we believe that most pit bulls make wonderful pets. This change allows a legal path for pit bulls that are great dogs to be adopted into families who are committed to the breed, which is much safer than what can happen when people must find other sources to'",
        "'speaker_4': 'obtain these dogs. Sources that rarely have behavior professionals on staff. Sources that do not spay and neuter, and sources that aren't compelled to follow city ordinances. Thank you.'",
        "'speaker_1': 'Thank you. Next at the microphone is Karen Norman. And if shira harold, pam joyner, scott ross and tom moore jr can come to the front bench, please go ahead.'",
        "'speaker_2': 'Good evening, everyone. And city council members. My name is.'",
        "'speaker_6': 'Karen Norman and I live in Denver. I have been power walking for five days per week, year round for over 30 years in Montebello. I represent the people who walk outside for whatever reason and the children who walk to school or play outside.'",
        "'speaker_6': 'I am adamantly against Councilman Chris Herndon's new pit bull law for Denver. The veterinarian behaviorist from universities and pit bull advocates confidently tell us that pit bulls are no more dangerous than any other dogs. They inform us they have.'",
        "'speaker_2': 'Scientific data to back them up. I have read.'",
        "'speaker_6': 'Numerous articles, viewed many horrific graphic videos and.'",
        "'speaker_2': 'Seen TV stories.'",
        "'speaker_6': 'News TV stories from across the country about pit bulls who have viciously attacked and severely disfigured or killed children and adults. Pit bulls will even attack their loving owners. There is scientific evidence to back me up, but I really don't have time to get into that.'",
        "'speaker_6': 'Pit bulls with their microchips will be roaming Denver free to bite and attack adults and children. When I am walking outside, I carry a metal stick and spray for dogs to defend myself. I have used them on several occasions.'",
        "'speaker_6': 'I have been aggressively ground at, barked at and charged my dogs who are not on.'",
        "'speaker_2': 'A leash.'",
        "'speaker_6': 'Being walked by their owners. My husband, Reginald and I were attacked on three separate occasions by two dogs. We had to defend ourselves with sticks and dogs spray. I know these tools will not defend me if I am attacked by one.'",
        "'speaker_2': 'Or two pit bulls.'",
        "'speaker_6': 'I am extremely concerned for my safety and the safety of everyone who walks outside. If Councilman Herndon's new bill is passed. City Council members. I am sincerely asking you to please protect our public health and our public safety.'",
        "'speaker_6': 'And don't pass this new bill. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Sheera Herold.'",
        "'speaker_10': 'Thank you, city council.'",
        "'speaker_2': 'My name is Shira Harold. I reside at 6897 Newcomb Street in Arvada.'",
        "'speaker_4': 'Last year I lived in District ten. I am co-leader.'",
        "'speaker_2': 'And co-founder of the Community Grassroots group Replace Denver BSL.'",
        "'speaker_4': 'My co-leads, Quinn Piggott.'",
        "'speaker_10': 'From District six.'",
        "'speaker_4': 'And Mara de.'",
        "'speaker_2': 'Penna from.'",
        "'speaker_10': 'District eight.'",
        "'speaker_2': 'Are also present along with.'",
        "'speaker_10': 'Many of our community supporters.'",
        "'speaker_4': 'I am not an expert. However, I am an analyst and I know how to distill facts and expert advice, especially in such an emotionally charged issue.'",
        "'speaker_10': 'And the facts.'",
        "'speaker_4': 'And the experts tell us that this proposed.'",
        "'speaker_10': 'Ordinance will make Denver safer.'",
        "'speaker_2': 'Our breed.'",
        "'speaker_4': 'Specific.'",
        "'speaker_2': 'Legislation has not worked.'",
        "'speaker_4': 'It is seen as a preventative measure. Yet Denver still sees a.'",
        "'speaker_2': 'Large population of barely under the radar pitbulls and bites by pit bulls. Worse, the pit bulls currently in Denver are.'",
        "'speaker_4': 'In inherently more.'",
        "'speaker_10': 'Dangerous situations.'",
        "'speaker_4': 'Kept under wraps. They can't receive.'",
        "'speaker_2': 'Proper veterinary care, socialization or training, and owners are hesitant about seeking.'",
        "'speaker_4': 'Their own medical care.'",
        "'speaker_2': 'In the event of a bite.'",
        "'speaker_4': 'More damningly, we see level five ice, the most severe bites by a variety of other breeds of dog, such as Labradors, Australian shepherds and boxers. This is not.'",
        "'speaker_2': 'To condemn any breed, but to highlight that BSL has not removed the potential.'",
        "'speaker_10': 'For severe bites.'",
        "'speaker_4': 'Nor, according to the most recent study by Denver University, even reduced the potential for severe bites. So why will this ordinance.'",
        "'speaker_10': 'Improve public safety?'",
        "'speaker_2': 'First, the new ordinance.'",
        "'speaker_4': 'Will drastically increase licensing rates, at least by pit bull owners. Current owners of pit bulls hiding out.'",
        "'speaker_2': 'In Denver will leap at the opportunity to.'",
        "'speaker_4': 'Legally own their dog. This ordinance.'",
        "'speaker_2': 'Will bring owners out into the open where.'",
        "'speaker_4': 'They can take more responsible.'",
        "'speaker_2': 'Care of their dogs. And Denver animal protection can better track responsible ownership.'",
        "'speaker_4': 'Second, for those who are concerned that license rates under the new ordinance will be similarly low compared to.'",
        "'speaker_10': 'Current licensing.'",
        "'speaker_4': 'Rates, we must bear in mind that this licensing program will be monitored.'",
        "'speaker_2': 'And delivered.'",
        "'speaker_4': 'In a markedly different way than DE Peers standard approach. It will be much more hands on with a strong focus.'",
        "'speaker_10': 'On enforcement and high penalties for unlicensed animals.'",
        "'speaker_2': 'Which will lead to much higher licensing rates.'",
        "'speaker_4': 'This ordinance is a brilliant compromise. Replace Denver BSL initially plan to.'",
        "'speaker_2': 'Push for a full repeal on a ballot vote.'",
        "'speaker_4': 'Which we had and have the community's support for. Instead, we first chose this slower, circumspect route. It will allow Denver.'",
        "'speaker_2': 'Animal protection to.'",
        "'speaker_4': 'Better track data from this ordinance and provide city council with.'",
        "'speaker_2': 'Recommendations down the line that are based on fact and experience.'",
        "'speaker_4': 'Rather than fear, myth and emotion. It's high time that.'",
        "'speaker_2': 'Denver update this outdated law.'",
        "'speaker_4': 'We deserve a more progressive and above all, safer city. That's what this ordinance promises. And that's what your yes vote can deliver us tonight. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Pam Jenner.'",
        "'speaker_6': 'Thank you. Good evening. My name is Pam Joyner. I live at one, two, two, one, one East 52nd place in Montevallo. Tonight I stand here as a co-chair of my brother, 2020. I also coordinate and run a program called Mom.'",
        "'speaker_6': 'Bella walks in, walk in our community, getting our seniors out in our communities, get in our children out in our community for life stake in health reasons. We are faced with a number of animal threats in our community.'",
        "'speaker_6': 'And it's not just, you know, dogs running wild. It is specifically pit bulls. Pit bulls attack fences and they they jump on top of the sheds and stuff and they're really, really threatening. We have owners who walk through the community with their puppy pit bulls, not on leashes, and they just laugh at these dogs as they frighten'",
        "'speaker_6': 'children. Children are running around their parents screaming and grabbing and trying to climb up in particular communities. Pit bulls are trained to be vicious. They are fed hamburger meat with gunpowder in them. They are chained up. They are not treated with love.'",
        "'speaker_6': 'And they are not fed properly. And that's why they are so vicious in particular communities. I am here to say, please do not lift this ban on pit bulls. There are hundreds of pit bulls in my community that are not registered and I don't believe people are going to come out and register their pit bulls because you'",
        "'speaker_6': 'lift the ban. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Scott Ross.'",
        "'speaker_12': 'Good evening, City Council. My name is Scott Ross. I'm a District nine resident at 13, 16, 29th Street. I'm the owner of Chiller Dog Training. I'm a certified trainer through the Certification Council of Professional Dog Trainers. I spoke at the previous hearing and I'm here again because of the proposed breed specific legislation.'",
        "'speaker_12': 'Update is an important step forward for Denver as we are making our city and county a more inclusive and enjoyable place to live. Now, one of the primary pillars of my training and dog behavior modification business is working dogs through serious aggression issues.'",
        "'speaker_12': 'At this point, I've spent hundreds of boots on the ground hours solving aggression cases using incredible, dramatic and life changing results. You can even go check my Google reviews if you don't believe me. I'm not saying this to boast or I'm simply doing my best to convey that I first rate applied knowledge of the causes and remedies'",
        "'speaker_12': 'for aggressive behavior. And as a Denver citizen whose personal safety depends on this far more than most. I fully support the proposed updates to breed specific legislation, and here's why. My profession grants me access to an advantage viewpoint on this matter, as I have the pleasure of working with many dogs and owners from every one of Denver's'",
        "'speaker_12': 'represented districts. Through my work, I've gathered robust sample of breeds and behavior issues throughout the country. What I have not found is that any of the pit bull breeds are characterized by some sort of general hostility. In fact, the vast majority are extroverted and sociable.'",
        "'speaker_12': 'I pity cases tend to be focused on teaching owners how to train a sturdy, enthusiastic and sometimes more assertive dog. I don't find these cases are disproportionately focused on human or dog aggression. In fact, cases involving aggressive tendencies are rare compared to many other breeds, some bigger and stronger that aren't affected by the law.'",
        "'speaker_12': 'Next. Focusing on breed instead of behavior misdirects our resources, which we've talked about, including our attention that otherwise could be identifying and dealing with dogs that are potentially hostile and dangerous. I think that kind of addresses what we've been hearing from the folks here is that there are some dogs that are problematic in particular areas, and by'",
        "'speaker_12': 'implementing this law, we may be able to specifically address those specific dogs that need to be addressed. As owners and pet parents. We should be looking out. We should be on the lookout for progressive behaviors and recognize more management and training are needed.'",
        "'speaker_12': 'Progression is often more subtle than growling and snarling and can manifest as hard stares and prolonged sidelong glances, curled lips raised hackles and so on. Also, dogs of any breed can also escalate to aggression quickly if other dogs, especially less familiar ones, treat them unfairly, although maybe not aggressively.'",
        "'speaker_12': 'And they can escalate over food and toys when they're present. A trainer specializing in aggression and behavior modification can often make a major difference. As a member of the public, we'd be wise to avoid eye contact, close range situations with unruly or intense looking dogs, regardless of breed.'",
        "'speaker_12': 'If you're in that situation, I'd suggest doing what you're already doing. Prepare yourself to walk through a neighborhood that is more challenging. If that's the type of thing that's going on there, I don't think a restriction really adds any additional safety.'",
        "'speaker_1': 'I'm sorry, but your time is up. Okay. Thank you very much. Next up at the microphone is tom moore jr. And if lindsey graham, joni caldwell, caroline smith and vernon york could make your way up to that front bench.'",
        "'speaker_1': 'Go ahead.'",
        "'speaker_7': 'Hi. My name is Tom Moe Junior. I was assistant city attorney in the prosecution and code enforcement section from 1982 to 1993. Good to see a familiar face. And so I was one of the primary writers of the pit bull ordinance in the eighties.'",
        "'speaker_7': 'I know a lot of nice things, but there are a lot of bad things in Denver. Pit bull attacks and puppy mills. There were not just two pit bull attacks. There were 20 in a five year period. Maybe you're familiar with two of them, the Salazar case, just the dog pit bull involved in that case killed a'",
        "'speaker_7': 'three year old boy in his own home because he got too close to a dog dish. And then the Reverend Billingsley case, an older gentleman walking down an alley, had to deal with a pit bull that chewed through a fence, attacked him.'",
        "'speaker_7': 'The attack lasted several minutes. A neighbor came out, beat him with a two by four. It did nothing. So the neighbor had to come out to and use a gun to stop the dog from Billingsley. Besides suffering for a good ten or 15 minutes, had 70 dog bites and a hundred stitches, and both his legs were broken'",
        "'speaker_7': 'by the pit bull. This AVMA review of controlled studies conclusion is not supported by the facts cited or footnotes listed in its own report. Thus, the first of all, the basis for the law change is unfounded. And just to be specific, the relevant study cited its own report document.'",
        "'speaker_7': 'The pit bulls are disproportionately dangerous compared to other dogs and even point to the Denver Pit Bull Ordinance as being successful. As an example, it cites a long list of hospital studies, severe, severe attack studies and fatalities all over the world.'",
        "'speaker_7': 'And eight of the nine that deal with severity list pit bulls. Every appeal of the Denver's pit bull ordinance has been overturned by Denver and Colorado courts. Courts have ruled that pit bulls are different than other breeds. It's law, athletic ability, way of biting, destructiveness, fighting ability, killing instinct, frenzy game this difficulty in managing strength, pain, tolerance'",
        "'speaker_7': ', unpredictability. This combination of characteristics only exists in pit bulls. Therefore, elimination of requirements for adult ownership, liability insurance, spare neuter requirements, secure enclosure requirements, signage and all the things that this bill you talk dealing with tonight eliminate only increased public safety concern for people in Denver and their pets, as well as pit bulls.'",
        "'speaker_7': 'And I wish I could say more.'",
        "'speaker_1': 'I'm sorry, but your time is up. Bill, thank you very much. Next up is Lindsey Graham.'",
        "'speaker_7': 'Not for the people.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_2': 'Hi there. My name is Lindsey Graham and I live in District nine. I've grown up with people as I know them my whole life, and I know them to be a docile, loving and protective breed. On a Tom's point of their strength and their frenzy.'",
        "'speaker_2': 'These dogs don't want to fight. There have been people in the past, especially public figures, that have trained these dogs to fight because they are strong. But that is not what these dogs do. It's not what they want to do.'",
        "'speaker_2': 'They want to love. They want to be a family member. They want to sleep on the couch with you. And that's, you know, the people that I know. So I am a volunteer for two blonds, all breed rescue.'",
        "'speaker_2': 'My primary job within the rescue is to assess incoming dogs to our boarding facility. I tests things such as human interaction, dog interactions, and just like overall demeanor. I have worked with hundreds of dogs and I do not see any difference in pit bulls and other grades, other breeds regarding personality or aggression.'",
        "'speaker_2': 'The severely dated in the city, the severely dated ban in a city that we pride as progressive needs to go in the rescue world. You know, I work with all of these pit bull breeds. But today I want to talk about one in particular.'",
        "'speaker_2': 'This year, the rescue saved this dog, Barney, from a horrific fate that she would have had added to at a Texas kill shelter. Barney is about three years old and has been over bread her whole life. She has signs of carrying multiple litters, signs of being abused and obviously been thrown away when she no longer served a'",
        "'speaker_2': 'purpose. Barney came to Colorado for a chance, but space fully on her looks were able to place her in Denver. This has nothing to do with how common sweet her temperament is, how neutral she is around other dogs, how much she wants to sit in your lap and be loved all day.'",
        "'speaker_2': 'It has nothing to do with how much she deserves a home. It is just based fully on her breed. This ban isn't about a dog's temperament. The ban, or in fact, it has never tested a dog's temperament is never tested within the ban.'",
        "'speaker_2': 'Judging a book by its cover is not keeping the city safe. It's just causing people to hide and fear the fate of their family pet. So please vote yes in this ordinance and let's create a safe environment. Will pitbulls can come out of hiding and be licensed and socialize and receive adequate health care?'",
        "'speaker_1': 'Thank you. Thank you. Next up, Joni Caldwell.'",
        "'speaker_6': 'Good evening. Thank you for having me. I totally agree with Paul Maness as well as Tom Moore. I believe, if our community had more information concerning this. Detrimental. A position that is is placing on our commit on our community.'",
        "'speaker_6': 'Perhaps we might have a better background of knowledge that we could draw from that would allow us to make the decisions or sound decisions that perhaps other people are looking for. Unfortunately. We are not. There was a reason for this ordinance.'",
        "'speaker_6': 'And since there was a reason for the ordinates. Putting on other provisions that you list here. That will be employed to determine whether or not the new process works. Didn't we ever think about this process before? What happened?'",
        "'speaker_6': 'Is it not enough mayhem there have been placed on our citizens without adding more? Have we not learned enough from the past? That we must be destined. To repeat it. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Caroline Smith.'",
        "'speaker_13': 'Hi. My name is Carolyn Smith. I'm ten years old and I live in Denver, District eight. I am speaking in support of Councilman Herndon's bill to allow pit bulls back in Denver. My mom and I volunteer with Hobo Boxer Rescue.'",
        "'speaker_13': 'Some of the dogs with Hobo are boxer pit bull mixes. They can't go to foster homes in Denver and they end up living in the shelter for way too long. They're alone in a kennel and scared. I walk these dogs with my mom and all they want is love and snuggles.'",
        "'speaker_13': 'They're so affectionate and gentle with me. It breaks my heart knowing that they don't have the loving home that they deserve. When the walks are done. They are so sad and scared to be put back in their kennel and some of the dogs cling to me.'",
        "'speaker_13': 'We adopted our dog Canelo three years ago. He's my best friend. He's a boxer, bulldog, pit mix. And he came to live with us. And three old pugs. My mom taught me how to be even more gentle and calm, not because of his breed, but just because he is a bigger dog.'",
        "'speaker_13': 'It's important to teach kids how to act around bigger dogs. I've always felt so safe and loved around Canelo. Our our pug in heaven named Maynor was 15 when Canelo joined the family. He was paralyzed but still happy and Canelo was so gentle with him.'",
        "'speaker_13': 'Sometimes man would get stuck on laying on his side and Canelo would put his big ole head under Maynard and turn him back on to his tummy. They were so sweet together. The ban in Denver doesn't make heads safer.'",
        "'speaker_13': 'It just teaches kids misinformation and makes kids only think one type of dog could bite and doesn't help them learn how to be safe around all breeds of dog. If you care not just about dogs but about kids like me, please consider getting rid of the blan ban.'",
        "'speaker_13': 'Please give these dogs a chance to prove how sweet they really are. Thank you so much for letting me have this opportunity to speak.'",
        "'speaker_1': 'Thank you. Thanks to. Next up, Vernon York and Stephanie Klatt, Sharon Farghalli and Nikki Gwinn and Richard Poole could work their way up to the front bench.'",
        "'speaker_11': 'Go ahead, Councilman. My name is Vernon York. I'm a resident about below. And the reason why I'm going I would like this being not to be passed is because a pit bull bit my daughter. A pit bull came at me when I was trying to check my mailbox.'",
        "'speaker_11': 'So I stand with the Normans and I votes to not pass this ordinance.'",
        "'speaker_1': 'Thank you. Next up, Stephanie Klatt.'",
        "'speaker_4': 'Thank you for allowing me time to speak today. I'm Stephanie Klatt. I am a resident of Frederick, Colorado. I was born in Denver in 1979 and have lived in or around Denver for the past 40 years. I do not currently live in Denver due to the fact mostly that I am a mom to four pit bull type'",
        "'speaker_4': 'dogs that have all come to me through rescue. I am a vice president of my fairy dogma, the rescue, which is a foster based all breed rescue that operates throughout Denver and the metro area. My fairy dog, when the rescue adopts out approximately 50 to 75 dogs to Denver families every year.'",
        "'speaker_4': 'What we have found is that Denver residents want the ability to adopt the type of dog they desire, which most definitely includes dogs that are considered pit bull type dogs. Even though we clearly state on our website that we will not adopt out our pit bull type dogs to areas with breed specific legislation, we consistently receive at'",
        "'speaker_4': 'least one, if not more, applications to adopt one of our pit bull type dogs from Denver residents. When we notify them that they are unable to adopt this dog because of BSL, we find out that they are often people who have moved to Denver within the last ten years and either do not realize there is a breed'",
        "'speaker_4': 'ban or most often they are shocked to find out that Denver still has a breed ban. Denver has grown into a modern, progressive city, and to continue to have such archaic legislation in place in a city like Denver does not align with the open mindedness of its residents.'",
        "'speaker_4': 'Denver residents want these dogs because they are loving and loyal companions with playful and silly personalities. Since I began working in Rescue, I have personally fostered over 30 pit bull type dogs and have been successful in finding them loving homes in Arvada, Centennial, Inglewood, Littleton and other cities that surround Denver.'",
        "'speaker_4': 'Denver residents want the ability to choose their canine companion in the same way that residents of other Colorado cities are able to. Over the past 30 years, the stigma and false narrative about these dogs has been exposed in other cities, some here in Colorado.'",
        "'speaker_4': 'These dogs are therapy dogs.'",
        "'speaker_2': 'Canine police.'",
        "'speaker_4': 'Dogs, and most often couch potatoes that are absolutely loved by their families. We know the breed man has deterred many people from moving, visiting or working in Denver because they love their dogs. I would urge the council to allow its residents the same opportunity as residents of Westminster, Lakewood and now Castlerock and other Colorado cities, and give'",
        "'speaker_4': 'them the opportunity to provide loving, responsible homes for the dogs that are just like any other dog. And I feel like if you want an example of there are thousands of pit bulls living in Colorado, in cities that neighbor Denver.'",
        "'speaker_4': 'And if you want to see what happens, but nothing. They live happy, lives with their families. They're not attacking people. They're not hurting people. Dog bites do happen, but it happens with any breed. And there are lots of pit bulls around the city that don't do anything wrong.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_1': 'Thank you. Next up, Sharon Fire Gala.'",
        "'speaker_14': 'Hello and thank you for having me. My name is Sharon Farr Gala. I live in the city and county of Denver in the Green Valley Ranch area. On a daily basis, I see stray dogs, stray cats. I see people running, looking for their dogs and cats.'",
        "'speaker_14': 'Just because you have a pit bull doesn't necessarily mean that you he won't get away from you. Some people say in other states and other cities that they have pit bulls and there's no problems. A lot of those places don't have the backyards like we have.'",
        "'speaker_14': 'They had their more built up apartment buildings where these animals can't get out of the house and run astray. But I live in a residential area and I go on the Facebook page for my area and they've always got dogs out there, not necessarily pit bulls.'",
        "'speaker_14': 'But the rule was made for a reason. I wanted to say also that children and seniors, which I'm a senior myself, when I see a dog, it bothers me. It brings up an anxiety in me. I should not have to go through that because somebody wants to have a loving animal to pet.'",
        "'speaker_14': 'There are foster children that need somebody to love them. Did you give yourself a challenge to get one of these foster kids to show some love, too? Thank you.'",
        "'speaker_1': 'Thank you. Next up, Nicky Quinn.'",
        "'speaker_2': 'Hello. My name is Nikki Gwynn. I was born in Denver in District one. I'm the director and founder of my three dog Mother Rescue. We adopt out up to 175 dogs per year. At least half of our dogs are placed in the city of Denver.'",
        "'speaker_2': 'As you know, the ban has.'",
        "'speaker_4': 'Been, in fact, in.'",
        "'speaker_2': 'Effect for 30 years. In my opinion, it is archaic and it doesn't.'",
        "'speaker_6': 'Coincide.'",
        "'speaker_2': 'With the changing and progressive nature that is presently happening in Denver. If revisions were made.'",
        "'speaker_4': 'To the current law.'",
        "'speaker_2': 'We would be able to place pit bull type dogs in loving, stable Denver homes. And this would not only help the dogs, but the humans that adopt them as well. Not to mention, by replacing the ban, this would allow the local animal shelters to place their pit bull type dogs rather than having to transfer them to another'",
        "'speaker_2': 'city shelter or to euthanize them. Our city is chock full of animal loving citizens that also want to be law abiding. A repeal would allow them to make a difference in the lives of this great breed. Thank you so much for your consideration today and for giving.'",
        "'speaker_4': 'Us all the opportunity to talk.'",
        "'speaker_2': 'I would also like to second what Shira said, what Stephanie Klatt said, and also my new.'",
        "'speaker_4': 'Personal hero, Carol, I.'",
        "'speaker_1': 'Thank you. Next up is at the microphone is Richard Poole and have Megan Shane Lee, Jessie Pierce, David Smith and chairman CQ could come up to this front bench.'",
        "'speaker_15': 'Thank you very much for this opportunity.'",
        "'speaker_11': 'I am a resident of my village. I have lived there for 49 years and this current controversy reminds me of a history professor I had on 55 years ago. And in his class he.'",
        "'speaker_0': 'Said something that I've seen throughout my life. The one thing that history teaches us is how easily people forget this law.'",
        "'speaker_11': 'This ordinance was enacted because of vicious attacks that have been stated earlier in this hearing in 1988.'",
        "'speaker_0': 'Prior to that enacted in 1989. And now we're coming back trying to.'",
        "'speaker_11': 'You know, to extinguish this ban, which was put in place.'",
        "'speaker_0': 'For a very positive reason to keep pit bulls from killing people.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_1': 'Thank you. Next up, Megan Shane, Lee Shanley.'",
        "'speaker_2': 'Hello. Thank you all for having us here tonight. My name is Megan Shanley.'",
        "'speaker_10': 'I live on 195 South Pennsylvania in District six. I believe the pit bull licensing is a safe, effective compromise.'",
        "'speaker_2': 'To repeal the ban. I've grown up.'",
        "'speaker_10': 'With pit bulls my entire.'",
        "'speaker_2': 'Life in Illinois.'",
        "'speaker_10': 'When I moved to Denver, I was devastated to find out I could not.'",
        "'speaker_2': 'Bring along my beloved dog. There's no scientific basis for breed specific legislation, and I believe that pit bulls should be allowed in our community. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_7': 'Jesse Paris represented for Denver Homicide, Loud Black Star, a.'",
        "'speaker_11': 'Movement for Self-defense, Positive Action Come in for social change.'",
        "'speaker_7': 'As well as the Unity Party of Denver, Colorado.'",
        "'speaker_11': 'And Mile High News. And I'll be running to be your next mayor in 2023. I am against this ordinance, which we seem to care more about animals than human beings. We have a ban currently right now on human beings to reside in the park.'",
        "'speaker_11': 'These U.S. parks that you say that you're scared and afraid to walk in because of pit bull attacks. In my personal experience, pit bulls have not been less any more dangerous than any other dog. I've personally haven't owned a pit bull, but I've known people that have owned pit bulls.'",
        "'speaker_11': 'And as on the owners, I've known bad owners and I'm no good owners. The good owners, I've never had an issue with their dogs. The bad owners. Yes, I've had issues with their dogs, but I've never been personally attacked.'",
        "'speaker_11': 'But I've seen them attack people. I've seen people with, as previously stated, laugh about it. So, yes, all this is true. These dogs get a bad rap. Kind of like my people, black people. We get a bad rap and one one bad apple spoils the whole bunch.'",
        "'speaker_11': 'The pit bulls in general are not bad dogs. I would like to know the data on how many pit bull attacks compare to other dog breed attacks such as German shepherds, rock whalers and Dobermans, other so-called violent and vicious dogs.'",
        "'speaker_11': 'I would like to know what the data is on that, so please vote no on this. This is going to affect black and brown communities in a exponential way. And it seems to me that you care more about dogs than you do people with your urban camping ban.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_1': 'Next up, David Smith.'",
        "'speaker_0': 'Evening. My name is David Smith. I live in Denver, Colorado at City Park. 80205 Denver should update the law and make the thoughtful changes proposed tonight. The current ban is financially irresponsible. Hurts Denver's reputation as a humane community.'",
        "'speaker_0': 'Does nothing to ensure the public safety and marginalizes underserved communities. Someone already mentioned the Denver University study and they talked about that. It found that there was no change in safety in Denver, and that's true. But in addition to that, it identified that Denver spent at least eight $5.8 million enforcing this legislation.'",
        "'speaker_0': 'And additionally, there was an economic impact estimated that by itself resulted in approximately $107 million in lost direct and indirect economic activity related to pet care revenue. The current ban also makes us a bad neighbor because what we do is we put more work on to neighboring rescues and shelters and other communities to support animals that we'",
        "'speaker_0': 'transfer. That is cost our neighbors more than $1,000,000. It's not very nice of us. And those billions in tax revenues and the other costs that we identified from due could be spent building our capacity to support residents and caring for pets, identifying expanded pet support infrastructure such as behavior services, implementing robust non breed specific dangerous dog laws'",
        "'speaker_0': 'as you're doing with the changes here. And working with the underserved communities most affected by this outdated law. BSL has created a brand equity issue for Denver as well. Our national reputation. Reputation is not well received in the pet owning community in the US.'",
        "'speaker_0': 'About 67% of all households have pets. And in Colorado, that number is likely higher. BSL is being overturned in communities across the United States. It was just overturned in next door in Castle Rock a few months ago. I urge you to update this law.'",
        "'speaker_0': 'It's financial. The current law is financially irresponsible, hurts Denver's reputation as a humane community, does nothing to ensure the public safety and marginalizes underserved communities. Thank you.'",
        "'speaker_1': 'Thank you, Chairman. They could exit the microphone. And if I could have David Walsh, Tom Sisk and Jody Villanueva come up to the frontpage.'",
        "'speaker_0': 'My name's Chairman Sekou. Well, and on this issue, I'm not going to speak in relationship to any organizations that I represent and none of that stuff. I'm just coming from here and from experience. My family breeds pit bulls.'",
        "'speaker_0': 'In South Carolina. And they're hunting dogs, boarding dogs, gambling dogs. We have legalized bites. We're pinball pit bulls. And we train. We train like you train a boxer like Muhammad Ali. All right. And contrary to the popular stories that we hear, pit bulls are not Scooby Doo.'",
        "'speaker_0': 'So we can stop all of that. Two. If you notice, white boxes for pit bulls, black folks, they. Two different experiences, and this ordinance doesn't even considered that. And then, last but not least, new breeding dogs. Pit bulls.'",
        "'speaker_0': 'You can have two and you're going to breed. You have to have a male and a female. They are not homosexuals. You need one other. Male. Female. But what happens to the puppies? If you're going to have two dogs, you end up with a litter, a six.'",
        "'speaker_0': 'Does that mean you're in violation of the law and you've got to do something with the six? What does what did puppies go? Say. And now you're talking about economic incentive to breed dogs. Who can be. Killer dogs.'",
        "'speaker_0': 'You have no budget or enforcement for implementing the law and making sure the people abide by it. Because in this room, you got people who live in the city county of Denver. They've got pit bulls. How did that happen?'",
        "'speaker_0': 'Say. And then you want me to cosign on your illegal behavior? That's like me having a gun to some license. And it's okay because I got it in my house, so. But if I get pot caught, I go to jail.'",
        "'speaker_0': 'Jack. Straight up. Ain't no administrative costs on that. And then when we talk about what do you do with this dog that's eaten up your children in your house, which is the reason why our one reason why we do this thing one day as a dog trainer, the dog is go beat the dog.'",
        "'speaker_0': 'Because that is nature and you cannot prevent that. So we have an awesome responsibility here today, and I'm betting on the side of the life of the vulnerable. I'm not mad and no pit bulls, but I would be willing to vote with conscience that I'd rather you not have.'",
        "'speaker_0': 'A dog does go into my body up. And I voted for that so I can sleep at night and say, no.'",
        "'speaker_1': 'I'm sorry, but your time is up. Thank you very much. David Walsh.'",
        "'speaker_7': 'Thank you. Memories of I'm not a resident of the city in coming to Denver. I was born here. Rose. I grew up in Park Hill. Spent time with my uncle. Sorry, my father. On weekends out Montebello. You guys do take out of my check so that I'm up here talking to you today.'",
        "'speaker_7': 'My main focus in all of this is Animal Rescue. I mainly operate as a transporter, and for anybody that doesn't think that pit bulls exist in the city and county of Denver, you know, can come along any of the times that have picked up dogs at the Denver animal shelter and moved them to other locations all the'",
        "'speaker_7': 'way up to Canada. And unfortunately, I'm in a in an odd position.'",
        "'speaker_1': 'Right now because I'm forced to agree with the chairman.'",
        "'speaker_7': 'There is a certain cultural and social economic difference that probably needs to be explored a little bit more. But I do support the repeal. I think licensing and keeping track and creating a statistical database for the rest of the state and surrounding municipalities to focus their future lives on.'",
        "'speaker_7': 'This may not be a bad idea. And again, there are pitbulls in the city and county of Denver, you know, and for the people that are owning them illegally but unknowingly, illegally, this gives them an opportunity to have their animals be registered, licensed, make sure that everything is okay, and also helps provide another source of revenue for'",
        "'speaker_7': 'Denver animal protection, the Denver animal shelter and the city itself. So I'm not going to take up a whole bunch of time like everybody else. But I think that passing this particular. Revision to the municipal code makes sense for the city and county of Denver and for its residents.'",
        "'speaker_1': 'Could you state your name for the record?'",
        "'speaker_7': 'Oh, my apologies. It is David Walsh. Thank you very much. All right. Thank you.'",
        "'speaker_1': 'Tom Sisk.'",
        "'speaker_11': 'Hello. I'm Tom Sisk.'",
        "'speaker_15': 'And thanks for having this hearing tonight. A lot of.'",
        "'speaker_11': 'Emotions on both sides.'",
        "'speaker_15': 'I'll just be short. I've got some of the information that Jesse we're.'",
        "'speaker_0': 'Going go right.'",
        "'speaker_15': 'There are some of the information he asked for. It's kind of interesting. Over a.'",
        "'speaker_11': '13 year period from January 1st, 2005.'",
        "'speaker_15': 'To December, the 31st, 2017.'",
        "'speaker_11': 'Dogs killed 433.'",
        "'speaker_15': 'Americans. During that period, interestingly enough. And it's not looking good for pit bulls. 65% of those deaths were caused by pit bulls. In second place, you 10%, you have Rottweilers. 4.6% of that was German shepherds and so on down.'",
        "'speaker_15': 'I don't know how I really can debate it past that. I mean, there was a reason we did this in 1988. Pit bulls are dangerous.'",
        "'speaker_0': 'These stats bear that.'",
        "'speaker_15': 'I'm sure there's good ones and there's bad ones. And I know a.'",
        "'speaker_11': 'Lot of people.'",
        "'speaker_15': 'Here. They love their pit bull.'",
        "'speaker_11': 'And I get that. I understand that. But that said.'",
        "'speaker_15': 'These are pretty bad statistics and it doesn't look good for the pit bulls. I'll leave it at that.'",
        "'speaker_1': 'Thank you. Next up, Jodi Villanueva.'",
        "'speaker_6': 'A lot of emotion here tonight. Oh, my name is Jodi Villanueva. I am a color native and currently a Lakewood resident. And due to the Denver Pit Bull Ban and I have had family in District one specifically for 75 years.'",
        "'speaker_6': 'First off, I wanted to say thank you to Councilmember Christopher Herndon for leading this charge on this proposal. It means a lot to me and it hits a lot of emotions. I personally.'",
        "'speaker_4': 'Strongly support.'",
        "'speaker_6': 'And believe that this breed specific license program will be beneficial for the city of Denver and all of its residents. This movement will allow us to make data informed decisions, especially after the two year review. And that's very important for all of us to remember right now.'",
        "'speaker_6': 'Breed specific legislation, not only perpetuates perceptions of pitbulls, but it fails in Denver in four primary ways. One, it fails to prove public safety. Two, it wastes your tax dollars. Three, it violates your property rights. And four, it rejects evidence based solutions.'",
        "'speaker_6': 'There are so many statistics about dog attacks that we can continue and continue to talk about tonight. But I want you to share the rest of this time with my personal experience with pit bulls. I first found love with this breed while I was volunteering at a local animal shelter.'",
        "'speaker_6': 'If you've ever been to an animal shelter, you will most likely see more pit bulls than any other breed. So when you volunteer at an animal shelter, you're bound to spend time getting to know this breed. And that's what I did.'",
        "'speaker_6': 'I fell in love with one of the many pit bulls that I worked with whose name at the time was Picasso. Picasso was a ten month old pit bull boxer mix who had come in as a stray and had been at the shelter for six months.'",
        "'speaker_6': 'It's an extremely long time for any dog, especially for a pit bull to be in a shelter. When I found that there was a time and date for Picasso to be euthanized, you better believe that I went home with that dog.'",
        "'speaker_6': 'The first thing I did was change that goofy name of Picasso to Chauncey. Yes. After Mr. Big shot himself, Chauncey Billups. This coming Friday, Valentine's Day will be 44 years since I rescued Chauncey, and this has truly been the best decision I have ever made.'",
        "'speaker_6': 'Chauncey is not only like my best friend, but he's one of the most important parts of my life. You almost likely never have a conversation with me without bringing up Chauncey or showing him pictures of him. At least ten at least.'",
        "'speaker_6': 'Sorry for that. During these four years of having this people, I have come across many obstacles when it comes to having this dog and being able to bring him to many family occasions, being able to bring him over to my sister's house, who lives in District one, who travels for work constantly going over to my 95 year'",
        "'speaker_6': 'old grandmother's house, who also lives in District one for over 75 years and allowing to have my parents dog sit him.'",
        "'speaker_1': 'I'm sorry about your time. Thank you very much. That concludes our one hour courtesy public hearing. I want to say thank you to everyone who came down here. I apologize that we couldn't get to everybody in that hour.'",
        "'speaker_1': 'And I really want to say thank you to all of you. This is obviously something that is very emotional and that people are very personally invested in. And I appreciate all of your work to create a safe place for our democracy to thrive and let everyone have their 3 minutes to tell their truth and their story at'",
        "'speaker_1': 'the microphone in front of us as we deliberate. So thank you all for that. We are going to transition now to questions from members of council. Councilman Herndon, your first.'",
        "'speaker_9': 'Name is president. I got two people that I want to ask to speak. And I'll start with Dr. Ariel Fagan. If you could come up and Alice from Denver, animal protection will be second. And as Dr. Fagan is coming up, I just want to read her bio so you know where she is.'",
        "'speaker_9': 'Her background. She's a veterinarian. A veterinarian behaviorist. She graduated from Tufts University Come in School of Veterinary Medicine 2013. She went on to complete an intensive, one year rotating small animal internship at WI Ridge Animal Hospital in 2017.'",
        "'speaker_9': 'She completed a three year residency in the American College of Veterinary and Behavior at Behavior Vets of Colorado and Florida Veterinary Behavior Science. In 2018, Dr. Fagan became a diplomat of the American College of Veterinarian Behavior, the highest level of veterinary behavior, specialty degree possible.'",
        "'speaker_9': 'This makes her one of 85 people of the most highly trained veterinary behavior specialists on the continent and one of two veterinary behaviorist in the state of Colorado. And so I just want to one just thank you. It's everything I said.'",
        "'speaker_9': 'True. Great. Because my horse was great. 186 Okay. So we, we have thrown out a lot of statistics, but I wanted to have someone who I believe is an expert come and speak. And so a few questions that I have for you, if you could just speak to one, are the three terror breeds more dangerous than any'",
        "'speaker_9': 'other breeds? One you could speak to. Two, I've heard the wasn't specified. There was a comment about the dogs latch on and don't let go, which more commonly referred to as lockjaw. If you could have the ability to speak to those two issues first.'",
        "'speaker_10': 'Yeah, sure. So lockjaw is a myth. There is no such thing as a locked down jaws. Pit bulls have the same construction as the rest of the dog breeds and very similar to us in terms of dangerousness. So I suppose danger could be defined by both severity and frequency.'",
        "'speaker_10': 'So when we look at severity, we the most recent data that I was able to find on all of this and just to make it clear that what I'm trying to do for you guys today is present the data, the information, not try and present my personal opinion on this.'",
        "'speaker_10': 'So what I can tell you is that in 2018 there was a systematic meta analysis done, particularly of facial dog bites published in the journal Pediatric OTU Rhino Wearing Gallagher So this was human doctors, doctors that treat humans.'",
        "'speaker_10': '43 studies were reviewed, accounting for a total of 26,000 dog bites. They did look at frequency of dog bites, but it is noted that there was some bias in the reporting of breeds, which is something else we can talk about if you'd like.'",
        "'speaker_10': 'But when they broke it down, in terms of of the 40% of the bites where some sort of specific in breed indication was given the it broke down to pit bulls at 22. Point 5% mixed breeds at 21.2%, German Shepherd dogs at 17.8% as the top three others below that.'",
        "'speaker_10': 'And then the rest were kind of unknown. Now, what I'll point out is that with those percentages, that includes the bias in reporting on breeds. Then tissue analysis was also performed separately on 240 by injuries to look at kind of the severity of the bite.'",
        "'speaker_10': 'And in order again this is with the bias in the reporting on breed the breed with the highest damage per bite reported was mixed breeds. Then Great Danes, then pit bulls, Labrador Retrievers, St Bernards and Akita is hovering around the same place than Bulldogs, Huskies and Chows.'",
        "'speaker_10': 'So that's the perspective from that particular study. There's when we look at kind of all of the studies together are about the the breeds and the bites. No studies that look at breed propensity have good quality evidence that pit bulls are more likely to bite.'",
        "'speaker_10': 'So that that has not been established in the scientific literature. And then what I can also talk about is kind of jaw strengths and bite severity from more of a physics perspective. So when the skull of a dog is looked at two different times, types of dogs are shown to have are predicted to have the biggest bite'",
        "'speaker_10': 'severity. One would be dogs that way between 66 and 100. And then dogs with a break is the phallic head shape. So that is a shape, the squishy knows shape. So dogs that are breaking so phallic and above 66 would likely have the highest bite severity.'",
        "'speaker_10': 'The factors involved in bite severity include so the dogs size their physical health, their motivation, the learned bite inhibition that they have, the speed the human and the dog are moving. And then how the human is acting as well.'",
        "'speaker_10': 'Additionally, the head shape is important. So they've kind of done some analysis of the skull shape and there's different aspects of bites that can cause a dangerous bias. So we can look at the anterior mechanical advantage versus the posterior mechanical advantage.'",
        "'speaker_10': 'So the anterior mechanical advantage is basically the strength of the bite at the front of the mouth versus the the hind of the mouth. And that strength of the initial bite force is correlated with the anterior mechanical advantage.'",
        "'speaker_10': 'In this study, the skulls that they looked at and I will note that they did not look at pit bulls out of like the 60 plus breeds that they were looking at. Pit bulls were not in that last.'",
        "'speaker_10': 'The strength of the initial bite force was highest in the boxer breed. For the post here mechanical advantage. The Saint Bernard had the highest bite force. The Condit layer offset ratio can be looked at. So that is basically the condyle or process is basically a bony protrusion at the back of the mandible.'",
        "'speaker_10': 'And they're measuring basically how tall it is in comparison to the lowest point of the jaw. The higher that ratio is than the more parallel of a closure the dog's mouth will have. The lower that ratio is, the more scissor like of a closure, the dog's mouth will have that scissor like action.'",
        "'speaker_10': 'What we worry about is a slicing motion. The skull shape that was the most problematic for that was the Chihuahua, the loading capacity. So this is the amount ability of the jaw to withstand pressure once it has bitten.'",
        "'speaker_10': 'So the ability to exert that pressure once it's bitten. And then the dogs that basically had the tallest jaws were the ones that had the strongest loading, loading capacity. So that was the Boston terrier. We can also look at the length of the to throw, and that has to do with the ability of the dog to hold'",
        "'speaker_10': 'its prey, the contact surface, the length of the molars, which obviously can pertain to puncturing damage. And then also we look at the size of the measured, massive Terek fossa, which represents basically how much musculature that the dog has.'",
        "'speaker_10': 'So looking at all of this, I know that there were no pitbulls involved in that. I think that we can conclude that it's complicated.'",
        "'speaker_9': 'Thank you. I appreciate that. And I know, Mr. President, you've got other people in the queue. So I want to ask two more questions for Dr. Fagan and then I will go to Alice. So you mentioned the dog bias, pit bull bias.'",
        "'speaker_9': 'Could you just talk about and tell people bias breed identification because we have heard like 60%. Could you speak to what is the standard or science of breed identification? And then my second question is, I know you're giving facts, but I think most people can hear would agree you're an expert.'",
        "'speaker_9': 'I would like to get your opinion on breed specific legislation.'",
        "'speaker_10': 'Okay. So let's start with visual ID of dogs. So the moral of all of this is that visual identification of dogs is really, really hard. There's a couple of studies that I'll give you some information for. So study number one showed that 87.5% of dogs that were ID by an adoption agency, a specific breeds, did not have'",
        "'speaker_10': 'all of those breeds on DNA analysis dog professionals. So we're talking about veterinarians. Trainers, breeders, animal control officer, shelter workers. When they tried to do a visual ID match for the predominant breed. It was only successful and 25% of the dogs that they looked at.'",
        "'speaker_10': 'Another study looked at 120 dogs. The staff in that study added 52% as pit bull type. When they looked at the DNA, only 21% had pit bull DNA in them. There's another study that was done that looked at a ratio of how much pit bull is in the dog and does that change our ability to identify it'",
        "'speaker_10': '? They did find that if there is more than 50% pit bull in the line, that it is easier to identify a dog as a pit bull. But in this study, they looked at shelters in Kent and in California and Arizona.'",
        "'speaker_10': 'They looked at 919 dogs and only 18.7% of those dogs were there. Only one or two breeds mixed in there. The rest of them were three plus. So all of those dogs would have had a poor ability for breed identification.'",
        "'speaker_10': 'I have more numbers, but do you want more than me?'",
        "'speaker_9': 'And lastly, Dr. Fagan, I would love to get your opinion on just breed specific legislation in general.'",
        "'speaker_10': 'Yeah. I mean, after thoroughly reviewing everything before coming in here today, the I, I believe that legislation should be driven by science. And I don't believe that there is the science to support breed specific legislation. I do believe that there is science to support education, responsible ownership, leash laws, etc..'",
        "'speaker_10': 'And so I think we should follow the science.'",
        "'speaker_9': 'Thank you, Dr. Ragan. Alice Nangle from Denver. Our protection. Thank you. And briefly, I want to I want to applaud them, Ralph, but I can just quickly state their recognition that you all just got from the AP.'",
        "'speaker_2': 'The recognition from the animal, the American Animal Hospital Association. Yes. Yes, we were just our veterinary clinic in our shelter was just accredited by the American Animal Hospital Association. We are one of three shelters and the municipal shelters in the nation who have achieved this accreditation.'",
        "'speaker_9': 'Thank you, Alice. And congratulations to your team. So thank you. Recognizing that this is not past and we still don't know if that's going to. But you are you have started to do some homework on what this would look like should this pass.'",
        "'speaker_9': 'So I am. My question is, has your policy team because one thing that's not in this ordinance deals with the actual cost of the specific license and what would be the process if you come across, Terry, owners who are not in compliance.'",
        "'speaker_9': 'And so I wanted to give you the opportunity just to speak to. Okay. In your initial findings, what do you believe this fee would be moving forward and then coming across and actually how the person would you could walk us through the process if you've gone that far.'",
        "'speaker_9': 'If not, I totally understand. But also more importantly, what would be some of the punitive issues? Because if people are fearful that people aren't going to register their terriers, what is going to be that recourse? Did you come across owners who are choosing not to comply?'",
        "'speaker_2': 'Okay. So we as Chris Herndon has discussed, we are in the process of exploring what our implementation of this program would look like, what our fee structure might look like. I've mentioned before that the Department of Public Health and Environment reports to a board for a fee setting, so we would go to that process to set the'",
        "'speaker_2': 'fees. In the meantime, we look at what is reasonable and what is what fees are available or what fees are already out there. Currently, there are not many programs that have a restricted breed licensing program or permit process that we can find in the nation.'",
        "'speaker_2': 'And so we are looking to our current licensing program. Our license fees for an annual fee is $15 a year. And so we are looking at somewhere between 30 and $50 for a restricted breed license and that is double the cost plus a little, which is where we think is reasonable and more strict.'",
        "'speaker_2': 'Again, we are in the process of evaluating that and bringing the recommendation to our board in terms of how we would implement this program, which I believe is another question you just asked out of many. We currently have a licensing program I think is a I need to make it very clear that we do not intend to'",
        "'speaker_2': 'deliver a restricted breed licensing program in the same manner as our current licensing program for the general dog population. And that is because we are looking at the restricted breed license as more of a permit process than really a license, even though it's called a license.'",
        "'speaker_2': 'So they're really two different programs. Our current licensing program for the general dog population that we have in place is a program where as a citizen or a pet owner, you can go online, you can upload a spay neuter, proof of spay neuter, proof of vaccination, your name and your address, breed and age and the sex of'",
        "'speaker_2': 'your dog. And you will we will deliver a license to you if you are out and about and we find that you don't have a license with a general population dog, let's say a Chihuahua. We will write an administrative citation for your fine that you will be required to pay, and then you will.'",
        "'speaker_2': 'If you don't pay that, you go to collections. We don't do a follow up process that it has any significant follow through for that. So you're going to go to collections in the restricted breed program that we are implementing or would implement should this pass, the requirements for the restricted breed are laid out in the proposal.'",
        "'speaker_2': 'So you must show proof of spay neuter, you must be vaccinated, you must have a microchip and you must have photo evidence of the animal, and you must complete a breed evaluation through Denver animal protection. In addition to those, you must also complete an application.'",
        "'speaker_2': 'And the application requires your name and address and the breed and sex of your animal and the age. But it also requires two alternate contexts for us to be able to reach you should we have your dog and you're not accessible?'",
        "'speaker_2': 'And it also requires your veterinarian's name and contact information. And so it's really more we want to get more information so that we can find you and be sure that we have you. And again, as I stated in the proposed language, the license would be at the higher rate with these requirements for three years.'",
        "'speaker_2': 'Every year would need to be renewed and every year you would need to prove or at any time should your dog be in violation, then your time clock for the three year program resets. So if you're found off leash you would reset to 36 months so that the programs.'",
        "'speaker_2': 'Structure if you are discovered without a license, a restricted breed license, after you have received the license from us, after going through all of that upfront process, if you if we find you and you do not have a restricted breed license and you are in violation of, say, an off leash, off leash violation, then we would likely'",
        "'speaker_2': 'write you a general violation, which is a criminal citation as opposed to administrative citation, which we do in the general population licensing program. And that would require a compliance timeframe and a court date. We would also then follow up with you at your home within ten days, which is generally our compliance timeframe for our general licensing program'",
        "'speaker_2': '. So for the restricted read program differently than the regular license program, we will do an in-person follow up to your home to determine that you are in compliance. If you're not in compliance, you will get a ticket. If we didn't already get you a ticket with a court date and then you would be subject to the court'",
        "'speaker_2': 'determination and fees set at that time.'",
        "'speaker_9': 'That was good. And, Mr. President, I am. I'm wrapping up. I know this is my colleagues. My apologies. I normally am quiet, so I'm talking a whole lot for all the time previously.'",
        "'speaker_1': 'You saved it all for tonight.'",
        "'speaker_9': 'Save it all for today. So it's safe to say that this is a much more stringent follow up when it comes to an administration administrative citation. If it was just your regular labradoodle versus a general violation. From this potential potential perspective.'",
        "'speaker_9': 'Restricted free license, correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_9': 'And the last question now that I have for you, this was stated during committee, but I just want to reiterate it for the general public. The current law, in effect, that we have with our breed ban, you gave a statistic four years worth of data of calls that Denver animal protection has received to pit bulls in neighborhoods'",
        "'speaker_9': '. And so I just wanted you to be able to speak to, again, to those number of calls and then the response rate and the measures of success for that. You are responding to those kinds. I want to give you the opportunity to speak to that again.'",
        "'speaker_2': 'Yeah. In the four year period that councilman heard in his referring to, we respond responded to roughly 2200 calls. That's a little over 500 calls a year for pit bull, only calls in responding to those which includes a visit to the home and a verification of the animal, the dog in front of us.'",
        "'speaker_2': 'Only 5% of those calls resulted in a dog being ordered in to have a formal breed evaluation.'",
        "'speaker_9': 'So 2200 calls, 5% were actually validated?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_9': 'So our Denver animal protection officers, 95% of the time, over four years, they're going out and wasting their time following up on the call that we know that turned out to be incorrect. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Torres.'",
        "'speaker_4': 'Thank you, Mr. President. Councilman Herndon actually led with the question that I was hoping to lead with as well, because that struck me as one of the most shocking, the 5% turnout. Can you remind me where half of those calls came from?'",
        "'speaker_2': 'Yeah. Roughly 50% of those calls were from the 8021980 239. An 80204 zip codes.'",
        "'speaker_4': 'And two of those are my district eight or two or four and eight or 219. I'll comment on that later, but I think that's a pretty striking piece. What's the criteria in testing? Are you testing for full breed?'",
        "'speaker_4': 'Any measure of the three breeds partial. How do you how do you determine what is a pit bull?'",
        "'speaker_2': 'Yeah. I'm going to ask Lieutenant Rolfe to answer that question.'",
        "'speaker_7': 'Hello. My name is Joshua Roth. For those of you who don't know me, but I'm pretty sure all of you do. So how do we determine what a pit bull is in a city? We have three people who are certified to assess an animal's breed.'",
        "'speaker_7': 'Look at the dog independently of one another. They judge about 36 different characteristics on the dog, and they're trying to determine whether the dog has predominantly physical characteristics matching one of the three restricted breeds in the city. In order for the dog to be considered illegal, all three evaluators must unanimously agreed that the dog is one of'",
        "'speaker_7': 'those three breeds.'",
        "'speaker_4': 'Is it becoming harder to determine based on mixed breeds?'",
        "'speaker_7': 'I would say that there's some level of. Ambiguity and in the process where when you have a mixed breed dog as. The experts were showing there's it's harder to tell what you have mixed in there. And certainly there's a lot of dog breeds that have similar physical characteristics to pit bulls.'",
        "'speaker_6': 'Okay.'",
        "'speaker_4': 'So the 2200 calls, these were people who called in having seen a pit and you arrive at an address to investigate. This isn't dogs that were found loose on the street, right?'",
        "'speaker_7': 'That's correct. That's dogs at people's homes.'",
        "'speaker_4': 'Can you or Alice describe for me how the AP would handle a similar call if this proposal goes through? So it's not a loose dog. It's not a dog that has bitten somebody, but it's being called into animal protection.'",
        "'speaker_4': 'Would you conduct the same assessment or would you just be looking for licensure? What would you determine? What would you use to determine which ordinances it fell under?'",
        "'speaker_7': 'I think that's that's something that's still under discussion a little bit, but I don't see the process straying too much from where we're currently at. It's worked for us so far. And and I don't see a compelling reason to to change it.'",
        "'speaker_7': 'There may be opportunity to do assessments at people's homes. We just have to take a look at our staffing and what would happen.'",
        "'speaker_4': 'So you would still go through assessment, even if it is licensed or unlicensed?'",
        "'speaker_7': 'We would have to determine in some way what dogs need to be licensed through this process and what dogs get a regular animal.'",
        "'speaker_4': 'Okay. What steps have you taken to increase licensure in the city and in my district in particular?'",
        "'speaker_2': 'So our licensing program is, as has been mentioned, around 20%, which is the national average for licensing programs. I'm sorry, was your question what how to increase licensing in which to breed?'",
        "'speaker_4': 'What steps you've taken to increase licensure in Denver.'",
        "'speaker_2': 'For the general population currently today? Yes. So we we contracted with a vendor to do or help us with our licensing in 2014. And through having an expert who dedicates their time solely to that, as opposed to our staff who's doing multiple things.'",
        "'speaker_2': 'We expected to see an increase in licensing and we actually have seen an increase of 14% licensing through the time that we've had this vendor from the time we started. So we we are improving through there, through multiple renewal notices that we send out to all of our pet owners that we know of.'",
        "'speaker_2': 'We know we know that we are also reviewing our opportunity to either send more notices, more renewal notices, or whether or not we right now rely a lot on the citation just going to collections as opposed to going to try to find the individual either through the mail because going back in person is resource prohibitive to encourage'",
        "'speaker_2': 'more compliance in that manner?'",
        "'speaker_4': 'Okay. One more question. The inquiry from Councilman Herndon about what kind of citation would be issued for a pit bull under this ordinance? Is there any circumstance under which the the dog would be taken or confiscated?'",
        "'speaker_2': 'Would you like to respond to that?'",
        "'speaker_7': 'Sorry for ping pong him back.'",
        "'speaker_0': 'That's okay.'",
        "'speaker_7': 'So there there could be a situation where the dog could be taken away from the owner. And what comes to mind is if there was a serious attack or bite incident in the community from one of these dogs.'",
        "'speaker_7': 'Certainly the court has that authority to take the dog away or to request that it be surrendered to an animal shelter or euthanized. And that exists currently as well as under the new proposal.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember. Councilmember Sawyer.'",
        "'speaker_2': 'Thank you. Is there anyone here from Parks and Rec?'",
        "'speaker_7': 'There is. Oh.'",
        "'speaker_2': 'Great. So I just have a couple of questions about off leash tickets and sort of.'",
        "'speaker_4': 'The challenges that come with.'",
        "'speaker_2': 'That.'",
        "'speaker_4': 'Thank you. Something. Council members. Mr. President, my name is Lisa Holtz. I am the assistant director for the Park Rangers for Denver Parks Recreation.'",
        "'speaker_2': 'Thanks for coming tonight.'",
        "'speaker_4': 'So the park rangers are the ones who actually give the tickets for off leash dogs in our parks. Right. Yeah. Sometimes the animal protection agents will as well.'",
        "'speaker_6': 'But generally, yes, it's the park rangers.'",
        "'speaker_2': 'Okay. So if like a resident calls 311 and says.'",
        "'speaker_6': 'There's a bunch of athletes.'",
        "'speaker_2': 'Dogs hanging out in the park across from my house, it's.'",
        "'speaker_4': 'Usually.'",
        "'speaker_6': 'It's going to be my team.'",
        "'speaker_4': 'The team and. And our work is very complaint driven. Okay.'",
        "'speaker_2': 'So how many.'",
        "'speaker_4': 'So. So how many.'",
        "'speaker_2': 'On a monthly basis can you just estimate sort of like how.'",
        "'speaker_4': 'Many tickets or how many complaints you receive of off leash dogs in our parks? So I actually don't have that information. I can get that for you. What I can tell you is that we use a progressive.'",
        "'speaker_6': 'Compliance model where we will do education, we do what we call pop ups, where we'll go to a park, talk to people about why it's important. Alisha Dog Then we go to warnings, then we go to tickets. So we try to do progressive compliance.'",
        "'speaker_6': 'We are complaint driven. The other.'",
        "'speaker_4': 'Important part.'",
        "'speaker_6': 'That's the important part of your question is that in.'",
        "'speaker_4': '2019.'",
        "'speaker_6': 'Dog off leash tickets were our highest.'",
        "'speaker_4': 'Ticket for park.'",
        "'speaker_6': 'Rangers. Of all the tickets that we wrote, we wrote more dog off leash tickets than any other ticket. So we take it really seriously. We want dogs and people to be safe in the parks.'",
        "'speaker_4': 'Okay. So do you. And if you can't answer this.'",
        "'speaker_2': 'Not you personally, but Parks and Rec. When I ask this question, so does Parks and Rec have any concerns about potential about the potential for pit bulls and pit.'",
        "'speaker_4': 'Bull breeds coming back into our parks, given.'",
        "'speaker_2': 'The number of off leash dog tickets that were.'",
        "'speaker_4': 'Written in 2019? I don't know that I can answer that specific question, but I will tell you that whatever.'",
        "'speaker_6': 'Council decides, we will work to.'",
        "'speaker_4': 'Enforce the revised municipal code as it's written.'",
        "'speaker_6': 'And our highest priority is the safety of.'",
        "'speaker_4': 'Park patrons and dogs.'",
        "'speaker_6': 'A leash dog is less likely to be injured, to injure wildlife, to injure another dog. And so we take it really seriously. Okay.'",
        "'speaker_2': 'Do you. Enforce or. Or do you give tickets if they're off leash dogs on like sidewalks? Or is that a different agency? Is that you guys? That's you guys. Okay. So maybe my next question is then for you.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_4': 'Thank you for the questions. Thank you all.'",
        "'speaker_2': 'So my question while you're coming up is.'",
        "'speaker_4': 'Just do you often get complaints or reports.'",
        "'speaker_2': 'Or write tickets for off leash dogs on sidewalks? Is that is that a concern in Denver?'",
        "'speaker_7': 'Yeah, we get quite a few calls for loose dogs.'",
        "'speaker_0': 'For loose dogs on sidewalks.'",
        "'speaker_7': 'I'm assuming you're talking about an owner walking down the street.'",
        "'speaker_2': 'Which is.'",
        "'speaker_4': 'Exactly not like a dog that's.'",
        "'speaker_2': 'Escaped, obviously. But, you know, an owner who's walking, who's choosing to walk their dog without a.'",
        "'speaker_4': 'Leash down the street.'",
        "'speaker_7': 'We do get those calls. They're fewer than the calls we get about dogs that are just loose and unattended. But we do get calls for that and we do write tickets for that.'",
        "'speaker_4': 'Okay. And do you know by any chance, off the top of your head how many maybe you wrote in 2018?'",
        "'speaker_7': 'My my response would just be anecdotal. I don't have that specific number.'",
        "'speaker_2': 'That's okay. Thank you. Do you think that.'",
        "'speaker_4': 'There will be any.'",
        "'speaker_2': 'Challenges that arise from the if we were to choose to overturn this ban tonight.'",
        "'speaker_4': 'Do you think that there would be any challenges or differing.'",
        "'speaker_2': 'Challenges that would arise from having pit bulls and pit bull breeds back on the streets? Given the number of people who choose not to leash their dogs, even though we have leash laws in the city of Denver.'",
        "'speaker_7': 'I think that's a difficult question to answer, I would say. You've heard from a lot of people, owners in our community tonight. And I heard from one person who said that they think that pit bull owners would be more likely to keep their pets on a leash and they're afraid of other dogs coming up to their pets'",
        "'speaker_7': '. I, I don't know that I can answer it better than what the community members are saying.'",
        "'speaker_2': 'Okay. Thank you. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember. Councilmember Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I have a few questions for different people. So let me first start with Dr. Steele with the Denver dam princely. You know, I'll just start asking my question as you come up. How often does the Denver Temperance League adopt out, adopt specifically this breed outside of Denver or even any of the other breeds'",
        "'speaker_8': '? So they're not just Denver residents coming in and and adopting the animals. They are adopted out to anywhere. Correct.'",
        "'speaker_4': 'Correct. So we only adopt out breed restricted breeds to people who do not live in areas that have restrictions. So we would not adopt a pit bull to someone who lives in Denver with the current ordinance in place.'",
        "'speaker_4': 'Okay. We do adopt out to all the surrounding areas almost on a daily basis a pit bull to any area that does not have legislation.'",
        "'speaker_8': 'Okay, thank you. And then let me ask Alice from our animal shelter, what do we do with the pit breeds that are brought in? What happens to them?'",
        "'speaker_2': 'In Denver, animal protection. We have a philosophy. We do not. We do not euthanize for time or space or breed. When we get pit bulls into our facility or a restricted breeds, we treat them as any other breed.'",
        "'speaker_2': 'If they are a stray and do not have an owner. We will put them once we own them. When there is a law that says after five days they become our property. Any stray animal that does not have an owner becomes our property after five days.'",
        "'speaker_2': 'And so we treat a restricted breed the same way we treat a cat or another breed of dog, or any further pig or goat, which we get as well. So we have medical evaluations. We, of course, look for owners and we have a breed sorry breed evaluation.'",
        "'speaker_2': 'A behavior evaluation. The behavior evaluation consists of multiple observations, both in the field. Should the animal have been brought in through our field officers or over the counter, or if at home history and observations from the shelter. If we determine that that dog, the restricted breed, is adoptable from our perspective, but we can't adopt those dogs in'",
        "'speaker_2': 'Denver and or transferable, which is a different criteria we have. We will look to our partners like Dumb Friends League and many other partners that we have in the front range and other communities in Denver, in Colorado to transfer that dog to another jurisdiction.'",
        "'speaker_8': 'If somebody is coming in wanting to adopt, then you verify. That person is from outside of Denver if it's one of these breed specific animals.'",
        "'speaker_2': 'We do not currently adopt out restricted breeds from our Denver animal shelter.'",
        "'speaker_8': 'So you partner with the other?'",
        "'speaker_2': 'Yeah. We will transfer them to other facilities. Got it.'",
        "'speaker_8': 'So let me ask you a question about staffing. If this were to pass tonight, what additional staff would be needed? I heard that you have three individuals that can look at an animal and determine, you know, whether it meets this criteria and all three have to agree.'",
        "'speaker_8': 'But if we significantly increase the population of these animals in the city of Denver, then what kind of staffing is going to be needed to do the overall enforcement?'",
        "'speaker_2': 'We have we believe that we will need one more animal protection officer and one administrative staff member. And we believe that that's what we'll need, even though we think that our call volume will shift. We do expect that we will still be potentially even delivering evaluations at homes.'",
        "'speaker_2': 'Now, should we be able to? Should this pass? And our legal team acknowledges that we can change our model from three evaluators to perhaps two or one, depending upon the legal determination of that. Regardless, we think that there will be an influx of, you know, a certain percentage more evaluations that we will need to do from the'",
        "'speaker_2': 'ones that we're currently doing. And so that's why we think we'll need that staff. The administrative person would be in the lobby to handle the scheduling and the volume in the back of the House transaction. We would need that individual also to help monitor the violation and the follow through that we're talking about in the implementation of'",
        "'speaker_2': 'the program as well as the officer to deliver that out in the field.'",
        "'speaker_8': 'So if someone wants to have two animals, are you going to be looking at whether there's a same sex, different sex? And where I'm going with this is how will you all be? How will you deal with litters?'",
        "'speaker_8': 'Because people cannot have more than two of these breed specific in their homes. So help me understand sort of how you would look at that.'",
        "'speaker_2': 'Under the current proposed language. The before you can get a restricted breed license, you must be spayed or neutered. And so there will not be an opportunity for this. Anybody with a restricted breed to get an intact permit, which you can do for the general population breed so male or female would not matter because they will be'",
        "'speaker_2': 'spayed or neutered before they can acquire the license.'",
        "'speaker_8': 'Have you all come upon any letters of these breed specific in Denver during this timeframe that they've been outlawed from Denver?'",
        "'speaker_2': 'We have encountered litters, yes.'",
        "'speaker_8': 'And when that happens, you just take them and then try to work with other organizations throughout the Denver metro area. Is that correct.'",
        "'speaker_2': 'Now? Correct. And I can let Lieutenant Ralph speak to the specifics of how we enforce that. But if you have, you would still be subject to the current pit bull rules as an owner and would be. Required to have your pitbulls removed from Denver.'",
        "'speaker_8': 'Okay. Um, I think I have maybe just a couple more questions. I don't know. You've got other people in the queue. Do you want me to just give you a quick couple?'",
        "'speaker_1': 'Yeah. You just want to wrap up.'",
        "'speaker_8': 'David Smith, are you still here? You had talked about a cost of enforcement of the legislation. Where did you get that figure from? You were talking about $5.8 million in enforcement of today's legislation. And I'm not sure if you're talking about our vicious dog ordinance.'",
        "'speaker_0': 'It was actually Denver University did this study last year.'",
        "'speaker_8': 'So it was that study you referred to.'",
        "'speaker_0': 'And it was $5.8 million and total cost to be of enforcing BSL. Since you've been there, it was over 100 million and direct and indirect loss of revenue for pet care.'",
        "'speaker_8': 'Okay. And I was just trying to understand the source of that. And let me see if I can have one last one. Um, I think that's it for now, Mr. President.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember Councilmember Flynn.'",
        "'speaker_15': 'Thank you, Mr. President. David, you can stay at your seat, but just not. That was the due study that costs. That was a cumulative total over the life of the ordinance that was on an annual figure or anything like that.'",
        "'speaker_15': 'Okay. Thank you. That that's what I thought the.'",
        "'speaker_11': 'Dr. Fagan was it?'",
        "'speaker_15': 'I'm sorry, I didn't I didn't actually catch your name, but I heard you say that.'",
        "'speaker_10': 'All right.'",
        "'speaker_15': 'Great. Thank you. I want to make sure I heard correctly the first set of statistics or study that you read was human doctors.'",
        "'speaker_4': 'Mm hmm.'",
        "'speaker_15': 'Who were treating severe bites or a level five, was it? And you gave a total percentage of the the breeds that were able to be identified. And I understand in a lot of attacks or in a lot of cases, breeds aren't readily identifiable.'",
        "'speaker_15': 'So we don't always have consistent data. But where we have identified them, what the pit bull breeds were like 20 something. Could you read that again?'",
        "'speaker_10': 'Yeah. So this was it was a meta analysis of facial dog bites. So this doesn't include any bites that occurred to other parts of the body.'",
        "'speaker_15': 'Okay. Let me interrupt you said you so you said it was a meta analysis. So it took a number of other studies and combined them.'",
        "'speaker_10': 'For three studies, accounting for 26,000 dog bites.'",
        "'speaker_15': 'Okay.'",
        "'speaker_10': 'Thank you. And so of those, only 40% of the bites, there was any breed indication given at all. And then of the 40%, the top three from a breakdown perspective was pit bulls at 22.5%. Mixed breeds at 21 and 22.5.'",
        "'speaker_15': 'Yep.'",
        "'speaker_10': 'Okay. Mixed breeds at 21.2%. And then German Shepherd dogs at 17.8%. What the numbers specifically don't reflect on, though, is that there's a lot of bias in reporting as to what breeds are are responsible for these. So reports are coming from people that are getting bad or neighbors that died or or animal control officers that just like'",
        "'speaker_10': 'with the visual identification problems that we saw with all those studies, we have laypeople kind of saying it was a pit bull and then that's reported. They're also taken taking some of those breed identifications for media reports as well, which has been established in the science to be biased as well.'",
        "'speaker_15': 'Okay. And do you have any or I don't know if if you have this, but just for Denver. But nationally, Dr. Fagan, do you have any is there a reliable estimate of what percentage of the population is represented by the pit bull breeds?'",
        "'speaker_15': 'The I guess the three most often, no.'",
        "'speaker_10': 'And this is part of a really, really big problem is that when we're looking at all of our numbers is that we don't know out of what the population is. So if, you know, 200 dog pit bulls are biting and there's only 250 dogs in the state, then that is obviously a huge percentage.'",
        "'speaker_10': 'But if there's, you know, 5 billion pit bulls in the state, then that's a really low percentage. And we don't have any great way of getting those actual numbers because not every dog is registered and even if they are registered, they might be registered as a reported breed and the owner may not actually know what the breed'",
        "'speaker_10': 'is because most owners are not going to get that name.'",
        "'speaker_0': 'Alice, do.'",
        "'speaker_15': 'You have any idea in Denver? Because I've seen a figure of around 6 to 10% in Denver. I don't that wouldn't necessarily translate to what you call true. Excuse me. What's true?'",
        "'speaker_2': 'Nationally, we do not have a figure of what what our pit bull population might is. Currently, we have played around with a number of what it could be based on national percentages, but they would be truly based on national percentages.'",
        "'speaker_15': 'Okay. Do you have a range for that?'",
        "'speaker_2': 'For national percentages, we expect. Well, we see nationally 3 to 6% of dog population tends to be a pit bull.'",
        "'speaker_15': 'Okay. Does this correlate? Who? Your answer to Councilwoman Torres. And by the way. 80219 is in my district as well, too. When you go out and do investigations, only about 5% of. So that would indicate that it's a pretty small part of the population.'",
        "'speaker_2': 'Yes, correct. And I have another statistic, if I can find it here that we since 2015 overall, we've done 4700 plus breed evaluations, and those are the formal rate evaluations with the three evaluators. And 17% of the dogs that were evaluated were evaluated as pit bulls.'",
        "'speaker_1': 'Out of how many?'",
        "'speaker_2': '4700 over four years.'",
        "'speaker_15': 'Okay. And how much? What? A percent?'",
        "'speaker_2': '17%.'",
        "'speaker_15': 'Okay. Thank you. Dr. Fagan, one more question. You indicated on the phone a kind of interesting about the parallel on the scissor bite. And you said the Chihuahua is.'",
        "'speaker_10': 'Yeah. So they in that study, they controlled for the size of the skull. And they were just looking at the different mechanics based on how short, how squat, how tall the controller process and all of that. And of all the breeds that they looked at, the the Chihuahua happened to have the most scissor like of a.'",
        "'speaker_15': 'Okay. Is that the most dangerous type of bite as opposed to a parallel bite?'",
        "'speaker_10': 'They didn't comment on that. Just the the only thing that that was a separate study than the facial trauma study. So the information from the facial.'",
        "'speaker_15': 'Okay. And I guess this falls into the category of when you're sick, when you don't feel well, don't ever go online and Google your symptoms. So and I think a lot of us up here probably have done a lot of Googling for, you know, preparing for tonight.'",
        "'speaker_15': 'And I just I've looked at dog attack fatalities and I've heard both advocates and opponents say that the other side's data is unreliable. But given the scissor bite and that a Chihuahua is more likely to bite. Have you ever come across a human fatality caused by a Chihuahua?'",
        "'speaker_10': 'So I don't have any statistics that say that Chihuahua is more likely to bite. I don't have that written down in any way. That is like in a good quality report. Okay. I don't of of everything that I read, I never saw evidence of a Chihuahua causing death.'",
        "'speaker_10': 'There was a report of a dachshund causing death. Mm hmm.'",
        "'speaker_15': 'Okay. Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Thank you, Councilmember. Councilmember Cohen. Each.'",
        "'speaker_4': 'Thanks very much. I think most of my questions are probably for Alice or your team. Lieutenant Roth. So I want to just review the question that was raised about what what is our sense of security and what what what are we providing as a sense of security here?'",
        "'speaker_4': 'So I just did the math on the 4700 at 17%. At least 800 pitbulls since 2016 have been found in the city and county of Denver. So the ban is not kept them out. So the sense of security might be false if the assumption is that the security is.'",
        "'speaker_2': 'By keeping the dog.'",
        "'speaker_6': 'Out.'",
        "'speaker_4': 'The second question then becomes what about danger? So I want to just go through what I heard before was that safety mechanism. Number one, is that this is a proactive pursuit of individuals to drive enforcement. Did I understand that correctly, that this is not passive licensure?'",
        "'speaker_4': 'This is not we hope you go online and license.'",
        "'speaker_2': 'This is any indication you get.'",
        "'speaker_4': 'From any contact you are proactively pursuing, including potential criminal ticket, court date, home visit.'",
        "'speaker_2': 'Correct.'",
        "'speaker_4': 'So there's three particular steps there. And to Mr. Vernice, we've had a good dialog, this word about driving compliance. We've got three mechanisms drive compliance. The second thing that we haven't talked about in this public hearing much, so I want to get you to talk about.'",
        "'speaker_6': 'It is.'",
        "'speaker_4': 'The dangerous dog ordinance so an indication of aggression? I'd like to know how the ordinance is working since it's been adopted. Do we have dogs in the program? And if you can review what that sense of security looks.'",
        "'speaker_6': 'Like in terms.'",
        "'speaker_4': 'Of what its what how many dogs are participating, what its success rate is.'",
        "'speaker_2': 'I'll hand that to the general. Thank you.'",
        "'speaker_7': 'Thank you. To to recap your question, you're asking about the potentially dangerous ordinance and how many animals are in that program and what the success of the program is.'",
        "'speaker_2': 'Right.'",
        "'speaker_4': 'Just how it works and how it might be. One of the things our community tonight, some folks are asking us, what will we do to ensure safety in this new regime? And so I think I want to talk about how this ordinance might fit.'",
        "'speaker_2': 'In the other things. You've had to theorize.'",
        "'speaker_4': 'How they're going to work in this case. You've got something that's already working. So I just want to hear about that. Sure.'",
        "'speaker_7': 'For the ordinance, just so everybody is aware, that ordinance was revised in July of 2018. And since then, we've had 23 dogs that have been classified as potentially dangerous animals. The recidivism rate or the the amount of those animals that are causing problems since they've come under the potentially dangerous animal permit is zero.'",
        "'speaker_4': 'Okay. And just can you give us a few just a snippet of what an owner, a dog or an owner family might go through if they're participating in that? What what's driving those outcomes?'",
        "'speaker_7': 'Sure. They're required to apply for a permit with us with very similar. Characteristic, says the proposed ordinance here today, where they have alternate contacts, they have a notification requirement if the dog gets loose from their care or if it bites or attacks somebody, they have to call us immediately.'",
        "'speaker_7': 'And they also are required in many circumstances to build enclosures to keep the animal contained on the owner's property, or if the dog's being walked in public to have it walked on a leash or muzzle. So the opportunity for the dog to cause issues is drastically decrease if the owner's complying with those provisions.'",
        "'speaker_4': 'And do you have to wait until the dog bites to get owners into a higher level of compliance or proactive steps with their pet or a dog that's busted through, threatened, you know, torn through a fence and, you know, cornered someone?'",
        "'speaker_4': 'Are there do you have to wait for a bite to engage in these types of or other mechanisms you might have that aren't under this ordinance?'",
        "'speaker_7': 'Sure. The short answer is no. The bite ordinance that the city has doesn't really differentiate between an attack or a bite. It includes both with the same level of penalty. To a dog owner, should that happen from that animal.'",
        "'speaker_7': 'And so cornering a person or jumping the fence and chasing somebody is given the same weight under the law as a bite is. There's differences in that, additional penalties that can come from that. When you're talking about a potentially dangerous animal violation or a dangerous animal violation, that does take into account the severity of the incident.'",
        "'speaker_4': 'Great. So so just to summarize then.'",
        "'speaker_2': 'This idea that we have to wait.'",
        "'speaker_4': 'Til a dog hurt someone is is a false assumption. The law allows us to take action when there's warning signs that.'",
        "'speaker_6': 'That's right.'",
        "'speaker_4': 'And then another topic that came up is this question about dog fighting and the reality that we have. We have folks who've described two situations, which is home owned pets that are getting the appropriate care and treatment and the fear and the concern that some dogs are not in that experience.'",
        "'speaker_4': 'And so can you talk with me about what our enforcement looks like for dog fighting?'",
        "'speaker_7': 'Sure. The state of Colorado makes dogfighting a felony. And so we and Denver police take that very seriously. We have responded to fighting incidents in the city mostly or exclusively in the past several years. It relates to cockfighting with chickens and not dogfighting.'",
        "'speaker_4': 'So have we had incidents that you have been investigating of dogfighting in the recent history?'",
        "'speaker_7': 'Not to my knowledge, no.'",
        "'speaker_4': 'May I ask just how long you've been in the job, and is that a decline from the era, perhaps when this ordinance was first adopted, was it a more prominent issue in the past?'",
        "'speaker_7': 'I've been with Denver animal protection since 2010, and I don't know that I'm qualified to comment on whether it's in decline in our community or in the country. But I, I do know that the data supports that dogfighting is mostly in rural areas, especially professional dogfighting.'",
        "'speaker_4': 'Thank you. A little easier to hide, perhaps. May I ask one more question, Mr. President? So the question about what type? You know, again, from my great dialog with Mr. Ryan is this question about what type of socialization or lack of might make a dog more at risk.'",
        "'speaker_4': 'So again, to this question of what are the systems, we have to minimize the risk of socialized dogs coming into the light, but they're still in socialized. So things like a dog that's chained and left outside all the time might be more at risk if and when they.'",
        "'speaker_2': 'Escape.'",
        "'speaker_4': 'Because they haven't been properly socialized. So tell me about the tools we have for that circumstance.'",
        "'speaker_6': 'If you would.'",
        "'speaker_7': 'Sure. A large number of our calls result from welfare investigations, which is what you're pointing to when you talk about a dog being tethered out. And our approaches is often education in those circumstances. We are an agency that promotes pet responsibility.'",
        "'speaker_7': 'And to the extent that we can, we we like to lead with education, conversation and a ticket will get you sent to court. And you may have fines and penalties associated with that, but it doesn't necessarily teach you to be a good dog owner.'",
        "'speaker_4': 'And can I. Can I sneak in one more? Sorry. You can put me at the back of the queue.'",
        "'speaker_1': 'No, go ahead.'",
        "'speaker_4': 'So I just. Every dog that is licensed under this program will be seen by a human being who works for our program. Is that accurate? Under this proposal?'",
        "'speaker_7': 'By multiple individuals.'",
        "'speaker_6': 'Rights?'",
        "'speaker_4': 'By multiple individuals. So which is something no other dog licensed in the city will have? If you experience a dog that exhibits aggression during that process, it's not an it's not a behavior evaluation. It's a breed evaluation. But if he bites the evaluator, if there is some warning sign, do you have the power you need in this'",
        "'speaker_4': 'ordinance to take action or address that?'",
        "'speaker_7': 'Not specifically with this ordinance, but we do have programs in place to proactively try and curb an animal's behavior. So we might put that dog on what's what we call an animal of concern agreement with the owner and and tell them, we would like you to take X, Y and Z steps in order to.'",
        "'speaker_7': 'Help mitigate whatever behavior we might be seeing in the dog.'",
        "'speaker_4': 'So can I just clarify? Nothing in this law prevents you from seeing what you see and taking proactive action. If there is some warning sign when you see this dog. Correct. You don't you're not barred from doing that by this ordinance and other other ordinances are what you're following, but.'",
        "'speaker_4': 'Okay. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Cashman.'",
        "'speaker_0': 'Thank you, Mr. President. Alice, please, you you said that since we got our contracted with a specialist to boost our licensing, it went up by 14%. We're now at about 18%. Is that correct?'",
        "'speaker_2': 'Correct. Okay. Yeah, I should be specific. It increased 14% from where it was to where it is today. Yes.'",
        "'speaker_0': 'Right. Okay. So just trying to be sure I was adding. Right. And the other thing I just wanted to ask, Mr. Moore gave us a statistic of 20 serious pit bull attacks over five years preceding the implementation of the ban.'",
        "'speaker_0': 'Do you argue with that number? Is that.'",
        "'speaker_2': 'I'm afraid I don't have any data preceding the ban, so I can't argue or support.'",
        "'speaker_0': 'Thank you. That's all I have, Mr. President. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Councilmember Hines.'",
        "'speaker_7': 'Thank you, Mr. President. I have some questions about service dogs. Um, is there anyone here who could speak to service dogs? So. Thank you. The first question is, does Denver allow service dogs? Absolutely. Do you track service dogs in Denver?'",
        "'speaker_7': 'No. Well. Not explicitly, no, but they still fall under the same rules that any other dog has. So they are required to be licensed like other pets and we offer free licenses to service animals. Okay, service dog are legislation the legislation that creates a service dog that's a federal law, is that correct?'",
        "'speaker_7': 'Yes, sir. ADA and BSL is a Denver law. Is that correct? That's correct. How does how did how did the two intersect? What about service dogs and and pit bulls? How does that work in Denver? Sure. Federal law supersedes state or city law.'",
        "'speaker_7': 'And so if somebody has a pit bull that is a service animal, they're allowed to be in the city. Are there any pit bulls in Denver that are service animals? Yes, sir. We have a gentleman in the back who is saying, I guess, that he has a service dog that is a pit bull, so.'",
        "'speaker_7': 'Okay. Is it possible? Given our current law, is it possible for someone to claim that their dog is a service dog, a pit bull, and or let's just say, in general, is it possible for someone to claim that their dog is a service dog and not actually be a service dog?'",
        "'speaker_7': 'I think the potential for that is fairly high. I think it's very kind of you, sir. So how can we. Ensure that a pit bull that an owner claims is a service dog is actually a service dog and not just someone trying to circumvent the law.'",
        "'speaker_7': 'As you know, there's a loophole. Yeah. The ADA limits pretty much everyone's ability to impact that in a meaningful way. And most people are only allowed to ask two questions Is the animal a service animal and what task is it trained to perform?'",
        "'speaker_7': 'And just by the nature of the questions, you can't really get to the heart of of that issue. Is it state law, Colorado state law that makes it illegal to have your dog masquerade as a service dog? Yes.'",
        "'speaker_7': 'Yet. It still happens. Yes. In your professional opinion, of course. So is it possible that there is there are people who have legitimate needs for service dogs, and yet there are also people who have a are using service dogs as a loophole.'",
        "'speaker_7': 'So that they can have their pet is that that both of those can possibly be true in the city of Denver, right? Yes. And so I guess the last question that I have just to drive the point home is, doesn't that hurt people who have legitimate service dogs that we have pets masquerading as service dogs in the'",
        "'speaker_7': 'city? Probably, yes. Okay. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember. All right, go. Going back around, Councilman Herndon.'",
        "'speaker_9': 'Thank you. I have two questions. One for Alice or one for Dr. Fagan. So whoever wants to step up first. Alice, there was a do you have the data? Because as one Councilman Sawyer was talking about parks you are dealing with aggressive animals in parks.'",
        "'speaker_9': 'Do you have a data for what percentage of calls do you have to deal with or a number of aggressive animals in parks?'",
        "'speaker_2': 'I think our statistic is less than 1% of the calls that we respond to in parks are aggressive animals.'",
        "'speaker_9': 'Okay, great. Thank you. And Dr. Fagan, for you. When you were at Councilman Flynn made me think about this. When you were giving the statistics about the first day, 22.5% are bites from pit bulls, reminding people that these are three breeds.'",
        "'speaker_9': 'And so is that broken down by American pit bull terrier staffers or terrier or Staffordshire bull?'",
        "'speaker_10': 'No, it was not broken down. And I'll just say that that was just one study that I mean, it was a big study, but it was just one study.'",
        "'speaker_7': 'Okay.'",
        "'speaker_9': 'Thank you for that. And actually, if I could if that goes to the comment, I'll stop. Mr. President, I have one more question. We had 16 people, I believe, did not have the chance to speak. So I'm just curious if just by a show of hands of the people who signed up to speak and who did not'",
        "'speaker_9': 'have the chance. Raise your hand if you're in support of the bill. And you did not have the chance to speak. Don't cheat. I'm not counting. But I trust anyone who did not have the chance to speak. That was in opposition.'",
        "'speaker_9': 'Please raise your hand. Okay. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Ortega.'",
        "'speaker_8': 'I just have to ask questions. The first one, we had a number of people from the Montebello community who have had a very organized walking effort. And I know there are a number of trails in the community. So I appreciate you coming out and in sharing those concerns about.'",
        "'speaker_8': 'Experiences that you've had. And so just by a lot of heads of those of you who spoke from the below area. Have you seen numerous times where just kids who may not have had a stick or something to fend off a vicious animal regardless of the breed where they were by themselves and could be at greater risk'",
        "'speaker_8': '. Can can you just nod your head? Or is it typically adults walking and walking with kids? Yes. Okay. Thank you. Thank you for that. And then I wanted to ask Tom Moe, if you wouldn't mind coming up to the microphone.'",
        "'speaker_8': 'You were the primary crafter of the original ordinance. Yes. And I can remember the room being equally as full back then as it is tonight. And so couple of questions for you. Have have you heard anything different tonight that did not come up 30 years ago when city council adopted the ordinance?'",
        "'speaker_7': 'Well, not really. There are some studies, of course, that have come up since then that we didn't have access to then. Especially the ones the veteran veterinarian was talking about, but pretty much the same arguments tonight as there have been, you know, a lot of people, you know, saying they've have nice pit bulls and, you know, a'",
        "'speaker_7': 'lot of people feeling like there shouldn't be discrimination against breeds. Sort of an equal protection argument that's not really recognized.'",
        "'speaker_8': 'So do you remember a question about violating property rights coming up as part of that conversation?'",
        "'speaker_7': 'Violating property.'",
        "'speaker_8': 'Rights. That was mentioned by somebody.'",
        "'speaker_7': 'I think so because dogs are property under the law. And so there were arguments about, you know, can can you do this to my dog? Of course, there are regulations for dogs of all breeds, for all kinds of things.'",
        "'speaker_8': 'And then what about if. Do you recall when this was adopted, the issue of dog fights that was talked about earlier, if we saw sort of a prevalence of dog fights that were going on around the city.'",
        "'speaker_7': 'Um, yeah, there were, there were problems with it, although in my experience, both as a prosecutor and dealing with dogs since I was, I worked in environmental court for a long time. And during the time of discussing the original ordinance, frankly, most of it was apocryphal.'",
        "'speaker_7': 'We did get some information from the Denver animal shelter, but there was a lot more investigation then for that kind of thing than there is now. So I don't know. I just don't. I know it still exists. I can't I can't speak to whether it exists more or less now in Denver or even the metro area.'",
        "'speaker_7': 'That it does, but it still exists in this country.'",
        "'speaker_8': 'And then I just wanted to ask if you recall any other compelling issues that were not mentioned here tonight that justify counsel moving forward, you know, based on on public testimony. 30 years ago when it was adopted.'",
        "'speaker_7': 'Well. I brought up that in the eighties we not only were dealing with pit bull problems and pit bull attacks. But also puppy mills. And some of it had to do with the puppy mill problems. Some of it was crossing.'",
        "'speaker_7': 'And I, I fear one of the things I did not get to bring up is in going through I spent a couple of nights once I heard about this about a week ago, just sort of going through all the information out there.'",
        "'speaker_7': 'And I ran across an article that based on a TV investigation in Las Vegas, a breeding of pit bulls. And what was going on is. Breeding had reached a point where it seems fitting for the 24, 20, 20 and even the 20 tens.'",
        "'speaker_7': 'It's reached a point where there are now designer dog breeders. And these are breeders that are trying to take a breed and. Make sure that it fits a classic profile for that breed. So in the case of of pit bull breeders, they're trying to create classic pit bulls.'",
        "'speaker_7': 'And there's a line in the article about well, let me just grab it real quick if you have.'",
        "'speaker_0': 'Dogs are just dogs. So we put them into breed. Here.'",
        "'speaker_7': 'So it says dog breeders are playing God when it comes to designer dogs. No expense is spared from choosing and shipping dog semen to artificial insemination and even C-sections. They're investigating. They're investing thousands of dollars to create unique breeds.'",
        "'speaker_7': 'And one of these breeders says they do look like a pit bull on steroids. Says Brown. His business partner started Fort Bully Kennels in Las Vegas several years ago. And they breed the American bully. This is a dog breed that the UK see kind of invented some suspect to hide.'",
        "'speaker_7': 'The fact that it was a pit bull and it's developed as a according to this article is a natural extension of the American Pit Bull Terrier and was subtly influenced by the infusion of several other bleeds breeds, including the American Bulldog.'",
        "'speaker_7': 'It's a fairly new breed that started in 1990s, and now of course, everybody wants the new thing and a lot of them can't do natural breeding. They've spent up to $15,000 on a pregnancy. One of the things that happens is they're breeding a dog because there's a larger head than usual that a female dog can't normally deliver'",
        "'speaker_7': '. So they're starting to do basically C-sections on pit bull mothers to develop these dogs because their heads are too large. So and when all these costs add up, they're starting to sell these dogs. They can go anywhere from 2000 to $5000 in in the range, and people are willing to pay for a breed.'",
        "'speaker_7': 'It says in the article with pit bull blood specifically I thought was so one of the things I fear is, you know, considering the growing population in Denver, the density, the fact that there's a pretty high median income here.'",
        "'speaker_7': 'Designer dogs may be a trend here as well. If we open it up to pit bull breeding.'",
        "'speaker_8': 'So let me let me just ask you one last question, and I'm done, Mr. President. There were some money raised. The question about whether or not we might see a court challenge if we were to reverse the position of the city on this dog specific breed.'",
        "'speaker_7': 'Yeah, that's a strong possibility because as I've said, so the first the first time it got tested, there were a bunch of organizations, including the American Pit Bull Breeders, but also the Uki and AKC. I think at least one of them was involved.'",
        "'speaker_7': 'There are about four different organizations, so a lot of evidence is presented on both sides. Hours and hours. The judge decided with some modifications to the ordinance that it was constitutional. It went it was appealed again all the way up to the state Supreme Court.'",
        "'speaker_7': 'State Supreme Court found it constitutional. A lot of the others in my testimony, I mentioned all the characteristics of pit bulls. Supreme Court agreed that that made them more dangerous and sort of ordinance was constitutional. Then it got challenged again when Colorado, the state of Colorado, said that it was their purview, not the localities, to decide whether'",
        "'speaker_7': 'there could be breed specific legislation. And so, once again, Corey Nelson, who saw the city attorney's office handled that. And once again, the district court, I think, came out of district or Supreme Court, but again, they upheld the ordinance.'",
        "'speaker_7': 'One of the dangers that I see here is that all this law indicates that pit bulls are a dangerous dog, that they have the higher, higher propensity to inflict severe bites, not not number of bites, the severity of bites.'",
        "'speaker_7': 'It's been supported in a lot of other places. So given that if we pass this ordinance and somebody gets attacked. They could sue the city and based on the law, if the city is viewed as reckless. Then the recklessness pierces.'",
        "'speaker_1': 'Hold on just a minute, Councilwoman Ortega, if we could kind of wrap this up. If you're if you're watching, if you could please not comment on someone else's. That's my phone. Thank you.'",
        "'speaker_7': 'That the recklessness pierces the governmental immunity that protects the city from being sued and allows somebody who is a victim of that to sue the city and get taxpayer dollars as a result of that suit.'",
        "'speaker_1': 'All right, gentlemen, thank.'",
        "'speaker_8': 'You so much. I'm done.'",
        "'speaker_1': 'Thank you very much. All right, Councilmember Flint.'",
        "'speaker_15': 'Thank you. Tom, could you go back to the microphone? Tom Foreman, thank you. 30 years ago, Councilwoman Ortega was sitting there and I was sitting over where a station is sitting there covering it for the newspaper. That's why I have a I have a very vague memory of it lost in the ether.'",
        "'speaker_15': 'To a great extent. But I do recall that the the ordinance allowed for grandfathering of anybody who owned a pit bull at the time it was passed.'",
        "'speaker_7': 'It did.'",
        "'speaker_15': 'And I don't know if you could you recount what that entailed. There had to be a special license then also, correct?'",
        "'speaker_7': 'Well, it was it was not.'",
        "'speaker_15': 'And quickly.'",
        "'speaker_7': 'Chris and I'll do this quickly. But it required insurance that required a specific enclosure. It had required that what the fence should be like, it required muzzling when in public. It required that the tags had to be on the dog, not just when it's out like this proposed ordinance is, but also, well, it's in to make sure'",
        "'speaker_7': 'that it's always on there. So there were a lot of requirements. It also said that they had to be spayed or neutered, so they weren't producing any puppies. If they did, they had to be okay.'",
        "'speaker_15': 'Okay. So that was 30 years ago, so. Right. Alice. Thank you, Tom. Alice or Josh, do you have any data from back then as to how that performed? All those dogs would not. None of them would be around anymore.'",
        "'speaker_15': 'But for how long? We had those grandfathered dogs. And do you have any data that shows. What happened?'",
        "'speaker_2': 'Yeah, no, we we have very little data about this regulation until about the mid 2000s.'",
        "'speaker_15': 'Okay. Thank you. Councilman Herndon, can I ask you a question?'",
        "'speaker_9': 'Sure.'",
        "'speaker_15': 'The reason I asked those questions about the current ordinance and the grandfathering is we amended this last week to have a report in two years rather than five on how it's going. And just supposing, for example, that in two years or five years, it shows data that has a future council sitting here saying, we made a mistake'",
        "'speaker_15': 'tonight in adopting this and we should reimpose it. Your bill doesn't have any provision as to how we should treat that. Have you given that any consideration?'",
        "'speaker_9': 'No. And it's intentionally ambiguous because I want the data to drive that conversation and let well, in two years this council will still be in effect. But five years, for example, from the original. I want that. I want that council to base that decision based off of the data that's presented to them.'",
        "'speaker_15': 'Okay. Thank you, Mr. President.'",
        "'speaker_1': 'ALL Thank you, Councilmember Hines.'",
        "'speaker_7': 'Thank you, Mr. President. Director Nangle. I don't. Do you. Are you familiar with the. The history behind dog breeds? I know there's a little bit outside of animal control or excuse me, animal services.'",
        "'speaker_2': 'Animal protection.'",
        "'speaker_7': 'I think you something with the animals. I almost got it right. So that there was a comment, Amerigo, about designer dogs and and breeding a new super pit bull. And I wanted to. I guess the the question that I have for the concern or the I guess the line of questioning that I have is are all breeds'",
        "'speaker_7': 'designer dogs weren't dogs originally just dogs. And we now hang on.'",
        "'speaker_1': 'I again ask the audience, please, I know it's been a long night and everyone's very emotional. Please keep the comments and the applause down.'",
        "'speaker_7': 'So the I guess where I'm trying to go with this is that we as humans created breeds like my service dog here is a lab because we called him a lab and then we bred him to be a lab.'",
        "'speaker_7': 'And and we have detailed records on his lineage five generations back. So I know he's a lab, but I don't have to do a DNA test. But I the the nature, the, the what I'm trying to get at is we created dogs.'",
        "'speaker_7': 'All breeds are designer dogs. Is that right? Do I have the thought process correct?'",
        "'speaker_2': 'I am not qualified to answer that question, but I bet that there is a veterinarian or someone else and he.'",
        "'speaker_7': 'She just had to leave, I think it was pastor. Oh. Ooh. Okay. That's right.'",
        "'speaker_2': 'I'll throw that question to Dr. April Steele.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_4': 'I think it's obvious. Yes, that is true. And we breed for specific traits and we're creating new breeds all the time. And what we used to call as a mutt is now a labradoodle. So.'",
        "'speaker_7': 'So you actually, you said breed for specific traits. Was a pit bull bred to bite or have a lockjaw or have pound for high pound force of biting?'",
        "'speaker_4': 'You know, it's really interesting. There's no such thing as lockjaw, so. No.'",
        "'speaker_2': 'And there are different antidotes about what.'",
        "'speaker_4': 'Pit bulls were bred for and one of them has to be nanny. So it depends. You know, pit bull is not a pit bull is not a pit bull. And some pit bulls are these little 30 things and thumb or some are these 60 things.'",
        "'speaker_4': 'It's really hard to say what they came from in the first place anymore. They're very different than the what the animal was 30 years ago.'",
        "'speaker_7': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank council member. Council member. Herndon, you back?'",
        "'speaker_9': 'Yes, Mr. President, one question. These are for the lawyers because they've been very quiet this entire time. So is there any do you have any concerns with this bill passing then the city and county of Denver being sued because of it?'",
        "'speaker_9': 'No, no, no. That's for the attorneys over there.'",
        "'speaker_2': 'All right.'",
        "'speaker_8': 'Those are.'",
        "'speaker_6': 'Citizens. Yeah.'",
        "'speaker_2': 'Kirsten Crawford, legislative counsel. We we see a lot of lawsuits all the time, so it's quite possible we could see a lawsuit. Do I think that our code provision is defensible? Yes. You know, some of the comments we made that I think I.'",
        "'speaker_4': 'Could maybe clarify. There's no obligation for.'",
        "'speaker_2': 'A city to to ban.'",
        "'speaker_4': 'A breed specific.'",
        "'speaker_2': 'Animal. Some cities have done.'",
        "'speaker_4': 'That and some have repealed their bans. Certainly your determination.'",
        "'speaker_2': 'As to whether there is a safety reason to do so. The other thing I would just say is that when it comes.'",
        "'speaker_4': 'To the issue of immunity, the Colorado Governmental Immunity Act only waives certain enumerated things.'",
        "'speaker_2': 'And in this particular situation, to the extent.'",
        "'speaker_4': 'You know, in the very unfortunate situation.'",
        "'speaker_6': 'That someone would be injured.'",
        "'speaker_2': 'You know, this is not a waived area. So the city is.'",
        "'speaker_6': 'Still immune from liability.'",
        "'speaker_9': 'Thank you. Thank you, Ms.. President.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Flynn.'",
        "'speaker_15': 'Thank you, Mr. President. As soon as I said I have no more questions, I realize I forgot to ask one councilman Herndon had asked the folks who didn't get to speak. There were 16. Are they still here? And they raised their hands.'",
        "'speaker_15': 'Okay. Because I was keeping track of the folks who did get to speak. And so keep your hands up. And if you currently live in Denver, keep your hand up. If you don't live in Denver, Denver, put your hand down.'",
        "'speaker_15': 'How many of those? Know if you don't live in Denver and maybe the maybe the Fifth Amendment will apply here, but of those whose hands are still up, you currently have a pitbull in Denver. Okay. Alice? Alice. Josh, don't look.'",
        "'speaker_15': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember. Quickly, Alice or Josh to Dr. Fagan's. Some of those studies that show that visual inspection of animals can be extremely unreliable and actually determining or discovering breed. Have we ever done any sampling of what are three people who are testing what their determination is on breed versus DNA testing to see how accurate our testing'",
        "'speaker_1': 'is?'",
        "'speaker_7': 'No, we haven't. Not compared to date.'",
        "'speaker_1': 'I'd be very interested to see at a future thing what the cost involved with something like that would be to see where we're at, because it is then feasible or within the realm of possibility that we have told people they can't have a dog in Denver that was not actually a pit bull based on our our visual'",
        "'speaker_1': 'inspection.'",
        "'speaker_7': 'It's possible.'",
        "'speaker_1': 'Yeah. And if someone were to call me, they're having been told they couldn't have that animal in Denver now or under this new saying you need a special license. If they were able to produce DNA evidence, do we then change our decision?'",
        "'speaker_7': 'I think that if the law changes, people's right to own their dog in the city changes.'",
        "'speaker_1': 'What what would we do today if we had told someone, you can't have that dog because it was pit bull and they did DNA testing and showed that our determination was incorrect?'",
        "'speaker_7': 'Oh, they have the right to challenge that in court.'",
        "'speaker_1': 'Okay. Okay. Thank you. All right. That concludes the question portion of our meeting today. So I'm going to. And the public hearing for counsel, 71 is now closed. And we are going to move on to comments. Thank you all for staying.'",
        "'speaker_1': 'I know those chairs are super comfortable out there and I'm guessing you're going to be here for a little while longer with lots of people who want to jump in and comment. Councilman Herndon, this is your bill. Would you like to kick us off?'",
        "'speaker_9': 'Yes, thank you, Mr. President. And I appreciate my colleagues here as we sit there and go back and forth all this. Thank you all so much for all your comments and passions. And I wanted to first say, Carolina, you here you are.'",
        "'speaker_9': 'You are my hero. You're a rock star. She's playing now. Okay. I was looking for you, Caroline. You were? I don't I try not to pick favorite speakers, but you by far are the best. So I just want to commend you on that.'",
        "'speaker_9': 'He did a great job. So thank you for coming tonight. So let me first answer this question, because I find it I find the conversations that I have had about this, this is one of my funniest conversations. People say, well, how many pit bulls are you on?'",
        "'speaker_9': 'None. Never on the pit bull. But I believe that our bills should make sense. Our laws should make sense. And when I was trying to have this conversation, I knew that the emotions would ring, go really high. So over the course of this time, what I try to do is prevent present as much data as possible.'",
        "'speaker_9': 'And so when we came to committee, I had the Colorado Veterinarian Association. You had you had the Denver Down Friends League. We had a Northfield veterinary business owner. I mean, we put statistic after statistic after statistic. I brought you here today, a veterinary behaviorist.'",
        "'speaker_9': 'She's one of 86 people certified in North America. One of two in Colorado. And they're all standing in front of you saying these dogs are not more dangerous than any other breed. What you've never heard me say is a pit bull is not going to bite.'",
        "'speaker_9': 'And I've never said that all dogs bite. And my heart goes out to any family member who has had an incident with a dog. I'm a father. I have a five year old. And I heard people about young children.'",
        "'speaker_9': 'It it rips at my heart. And to think that I would bring something forward that would make our communities left say less safe is absolutely not true. I would never do that. Our communities are not safe with this very specific legislation, organization after organization, study after study.'",
        "'speaker_9': 'The Obama administration came out and said very specific legislation is ineffective. So let's take the opportunity to look at the actual data. Dr. Fagan here even gave when she talked about just the 43% that's identified. Yes. You say 22.5% are pit bulls, but guess what?'",
        "'speaker_9': 'That's three breeds. Break that down. Is it the Staffordshire bull terrier at 10% and the other two breeds at 6% that get you to 22? Well, that's actually lowest lower German shepherds 21.5. Raise your hand if we should ban German shepherds.'",
        "'speaker_9': 'You've heard about St Bernards boxers. But what we do have on the books is a potentially dangerous dog ordinance. And as they talked about, 22 dogs since 2018, 0% recidivism. We have measures in place to protect our communities, to make sure that they are safer.'",
        "'speaker_9': 'So when the question came about safety, we have the measures in place right now. But I can tell you right now, we know these dogs are in our community. I want to thank my colleagues for bringing them up.'",
        "'speaker_9': 'Where are they? We don't know. Are they getting the pet care? We don't know. This measure passes. We know where they are. We know they're vaccinated. We know they're spay and neutered. And studies will tell you spay and neuter lowers the probability of something that can happen, something that can, something that can occur.'",
        "'speaker_9': 'And I am not faulting the reasons that the decision was made in 1989, but I do find it interesting. In 1989, we still grandfathered pets. Still saying they were dangerous, but yet we could still have pets in the city and county of Denver.'",
        "'speaker_9': 'Let's do the reasonable, responsible thing. But you know what, I. I firmly could stand before you. Anything I believe and outright repeal would be acceptable. But for the people who have the concerns. I hear you. Which is why I came for what I believe is a middle ground.'",
        "'speaker_9': 'Let's create a compromise that let these animals come out of the shadows that we know are here. And let them demonstrate actual data. So if you don't believe any study, you don't believe any experts, look at the data that's going to happen over the next two years.'",
        "'speaker_9': 'So there's no reason we should question that data. But even if you have an issue with all of those things, the current law right now has a 5% success rate. When our animal protection officers are doing wild goose chases or wild pit bull chases.'",
        "'speaker_9': 'Imagine that any other department, if Denver firefighters, 95% of the calls they respond to aren't fires. Think of the resources we are wasting right now. That's not making our neighborhoods more safe. It's not. Let's give this bill a chance.'",
        "'speaker_9': 'Because even if we don't pass this tonight, we need to change something. And I'd be welcome to help have a conversation with any council person. But I believe looking at the actual data. During the 90 days. So we could do a aggressive marketing campaign because there's this fear that no one's going to license their dogs.'",
        "'speaker_9': 'As a pet owner, I have a I have a Bernese Mountain Dog mix. He's licensed, by the way. But if I if he was not. And I couldn't take him to the dog park. I couldn't take him to doggie daycare.'",
        "'speaker_9': 'And all I had to do was bring him in to get a pay $40.'",
        "'speaker_0': 'I would absolutely do it.'",
        "'speaker_9': 'So this belief that is not going to happen. I don't agree with that. But we've got an aggressive campaign in place that will encourage people to do so. And I want to thank them for animal protection for doing that at a greater level so that we can ensure we have compliance.'",
        "'speaker_9': 'Because right now, the compliance for these terror breeds is zero. So these will definitely up our numbers. So I appreciate the time that we took to have this conversation. I hope that my colleagues give this a chance. I think the studies have demonstrated that vessels broken and we can find a compromise to move forward, to take these'",
        "'speaker_9': 'dogs out of the shadows and create neighborhoods that are more safer. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. So I'm the only one here that was around when this was adopted from this body. And back then, we heard a lot of the same input. We actually had people here testifying who had their children killed by other individuals who had been attacked and seriously injured by this breed, which is part of why'",
        "'speaker_8': 'city council moved to adopt this legislation. There are more than 937 cities across the U.S. that have breed specific legislation, and there are a number of countries that have breached specific legislation. So we are not unique in this.'",
        "'speaker_8': 'We're not the only city who has acknowledged that this breed specific legislation is important to protect human life. When I see efforts across our city around trying to make people in our communities healthy and having walk groups like what Montebello has in various neighborhoods across our city, oftentimes people are walking their dogs off leash, and that's that's'",
        "'speaker_8': 'concerning, especially when you have small children just out playing and dogs are off leash. The concern about the propensity for an attack to happen, I think is is real and and very concerning. I think the most compelling argument about why I voted for this back then and will vote to keep this in place today is.'",
        "'speaker_8': 'The severity of the injuries that are caused to people that are attacked by a pitbull animal. And. I believe that the majority of the people in this room tonight are responsible animal owners who take very good care of their animals.'",
        "'speaker_8': 'And the speaker who talked about ensuring that you've got the right environment for the animal is is what is is really important and not addressed as part of this conversation here tonight. Because that that makes a huge difference.'",
        "'speaker_8': 'And I just think that. It's. It's not broke, so why fix it? I mean, I understand that some of you that don't live in Denver would want to live in Denver. Some of you live here and have your animals here.'",
        "'speaker_8': 'But I believe that this has been something that has worked. We have not seen the kind of data around attacks and concerns with this breed specific animal. Yeah, it has happened with other animals. I agree with that. And we heard the testimony from our our animal control folks.'",
        "'speaker_8': 'But I just believe that this is a piece of legislation that has worked. It's withstood all of the court challenges. And I believe it's something that we should keep in place. So I am going to be voting against Councilman Herndon's proposal.'",
        "'speaker_8': 'I appreciate his efforts that he's put into this, but I just don't think this really addresses the heart of some of these issues that are critical to justifying making this change. So thank you, Mr. President.'",
        "'speaker_1': 'Council member or council member Sawyer.'",
        "'speaker_2': 'Thank you, Mr. President. I also am torn on what to do tonight. I think that, you know, it's pretty clear, based on all the testimony and all of the information we've been given tonight that breeds suspicions, breed, breed, specific legislation doesn't work.'",
        "'speaker_2': 'I don't think that that's.'",
        "'speaker_4': 'Really and truly the issue that is.'",
        "'speaker_2': 'Up for debate here this evening, because it's clear that it doesn't work. It's clear that there are pitbulls in the city of Denver. It's clear that they are in the shadows.'",
        "'speaker_4': 'It's clear that we don't have.'",
        "'speaker_10': 'The data that we need.'",
        "'speaker_2': 'To talk about that because they are hidden right.'",
        "'speaker_4': 'Now.'",
        "'speaker_2': 'So breed specific legislation is not the answer, and that is absolutely 100% true.'",
        "'speaker_4': 'The question.'",
        "'speaker_2': 'Is whether we have been providing and will continue to provide the right kinds of resources to.'",
        "'speaker_4': 'The community and to our Parks and rec.'",
        "'speaker_2': 'Department and to our animal control departments so that they can enforce whatever laws they need to enforce in order to keep our community safe. Because at the end of the day, our job as city council people is to care for the health and safety and welfare of our communities.'",
        "'speaker_2': 'And that I don't think we're doing that. I don't see as the second piece of this law. I don't see where we are providing additional resources, additional people.'",
        "'speaker_4': 'Additional funding.'",
        "'speaker_2': 'To help support our law enforcement.'",
        "'speaker_4': 'And.'",
        "'speaker_2': 'Whatever that looks like in Parks and Rec and in animal control enforcement officers so that we can.'",
        "'speaker_4': 'Manage.'",
        "'speaker_2': 'The situation when pit bulls come out of the shadows and back into our parks and back onto our streets in a different way. And so that's where my concern lies. And so I'm really torn on what to do here.'",
        "'speaker_2': 'But I think that I am going to have to vote no on this tonight. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Catherine.'",
        "'speaker_0': 'Thank you, Mr. President. I have concerns as well. I haven't read as much literature, pro or con. I've gotten a million emails, phone calls. The people are divided. I totally get where the position that those who love and own pit bulls are in.'",
        "'speaker_0': 'But I'm looking at some of the things. We're 18% licensed. I don't believe we're 720,000 people right now. There are cities all over Colorado that have gotten rid of breed specific legislation. There are two cities in Colorado with more than 200,000 people.'",
        "'speaker_0': 'One is Aurora. The other is Colorado Springs. And they're not really close to the size we are. As has been said, there is not just in this room. There's hundreds of thousands of pet owners responsible. Probably 100,000 little more responsible pet owners in the city.'",
        "'speaker_0': 'In a city this large. There's many, many irresponsible pet owners. Concerns about this bill is there is no requirements for training. There's no requirements for behavioral evaluation. And I agree, I had had the same thoughts as Mr. Venice that it to me, it is like if you want a driver's license, you go to the Department of Motor'",
        "'speaker_0': 'Vehicles, you show them your birth certificate, and they give you a driver's license. There's no requirement that you can prove you learned how to drive a car or display that. I know this is not a game for either side.'",
        "'speaker_0': 'I'm well aware of that. I, I very much appreciate Councilman Herndon trying to come to a middle ground. But with all due respect, I'm not convinced of the ability of Denver animal protection to do what this bill would would require to bring our community the comfort level that it deserves.'",
        "'speaker_0': 'We our office gets constant calls on on off leash dogs. We, as has been stated, we are a complaint driven city. It doesn't matter whether it's dogs, broken sidewalks, weeds too high in your lawn. You know, we don't have inspectors going out roaming our streets to see if if our city is in order.'",
        "'speaker_0': 'We wait until something wrong happens and then we address that. So. I don't see anything in the bill or our ability to control it, to manage this bill and protection of public health that would justify adding additional complication to pet management in Denver.'",
        "'speaker_0': 'So unfortunately, I'll be voting no on this tonight.'",
        "'speaker_1': 'I think. Councilmember Cashman, Council Member Sandoval.'",
        "'speaker_2': 'Thank you, Mr. President. Thank you all for sitting in those pews on a cold Monday night and sharing your views with us. That's representative democracy, right? You all voted 13 of us to make this decision. So with that, I just want to say thank you.'",
        "'speaker_2': 'I really appreciate it. And thank you for all of the people who called out my office. I got. And like. Between January 11th and February 10th, I received 42 phone calls about the pit bull ban between the same amount of time.'",
        "'speaker_2': 'I received 102 emails. So that's almost 150 odd. Some of you who called my office. So I also sent out a survey because I did not know what to do. 114 people in Council District one took it and support the repeal of the ban or changing the ban.'",
        "'speaker_2': '92 Don't live in Council District one but still support it. 28 Didn't really know. So as I sat here, I had to vacillate. I'm just going to be honest. I had to really vacillate. I had not really given breed specific legislation, very much thought.'",
        "'speaker_2': 'I've given zoning a lot of thought. I've given homelessness a lot of thought. I've given education a lot of thought. I've given transportation a lot of thought. And so what I ask all of you is give those things as much attention as you have given this honestly.'",
        "'speaker_2': 'Because if I come up here and I sit up here and we're talking about repealing the camping ban and all of you are not in those seats, I'm going to get really frustrated because I believe that those issues are just as important as our dogs.'",
        "'speaker_2': 'And trust me, I have had had dogs my entire life. My entire life. My kids are at home, sitting at home right now watching this. Sending me pictures of our dogs waiting for me to come home. So I do not take this lightly, but I just want you all to understand that I have been in a council'",
        "'speaker_2': 'office since 2012, and I've hardly seen these type of numbers on the issues that we're running up here. So I really need everyone to start paying attention on some of the other issues that we're running up here. So that that's me on my soapbox.'",
        "'speaker_2': 'So second of all, I do understand what it feels like to be bitten by a dog. I have been bitten by a dog. My son was viciously attacked at my brother in law's house and he ended up in the hospital with major stitches.'",
        "'speaker_2': 'My nieces have been bitten dog by a dogs and it is scary. It really is scary. Now, do I believe that pit bulls are more dangerous than any other dog? No. I have a I had a Labrador who is the most.'",
        "'speaker_2': 'He would have loved my kids. I mean, my kids could stick pinto beans up his nose and he wouldn't do anything. We take him skiing and he goes after another man who was coming close to my daughter. It's true.'",
        "'speaker_2': 'And he was in a loving environment. He had never been hurt. He had been a great dog. So do I think that breed specific legislation is making Denver safe? I don't. What I do think is making Denver safe is making sure all of you walk your dogs unleashes.'",
        "'speaker_2': 'That's what's making Denver safe. So I would just ask all of you who are here tonight, I really believe in the power five. Every time I was on the campaign trail, I asked one person to tell five people if they could do something, if they could show up at an event, or if they could pass news.'",
        "'speaker_2': 'So I need all of you here to tell five people to start walking their dogs unleashes and not letting their dogs off leashes in the park. I need all of you to start doing another type of robust outreach, because if you all are here tonight talking about this on a cold night and it's 934, obviously you have'",
        "'speaker_2': 'a lot of passion. So use that passion in helping get compliance because as my colleagues have talked about up here, 18% of us are in compliance and have licenses for our dogs. So I don't think that licensing is working.'",
        "'speaker_2': 'It doesn't work. People are not going out and showing up to the the animal control and saying, here, give me my dog license. They think they have to get spayed or neutered and then walk them on a leash.'",
        "'speaker_2': 'So let's use all of this energy that we have tonight to talk about other.'",
        "'speaker_13': 'Issues that.'",
        "'speaker_2': 'Denver's facing. And let's talk about actually making sure that we're in compliance with the books and the ordinances that we have. Because I will tell you one thing. Before I started at the fight, before I started a council, I worked for the fire department and Councilman Herndon made a comment about what if firefighters don't go put out'",
        "'speaker_2': 'fires? Guess what? 85% of the calls that Denver fire does deals with aren't fires. They really aren't. They're homelessness people. They're homeless. They're drug overdoses. They're people who are stuck in their wheelchairs. So that already happens. So we're already paying for services that aren't in compliance.'",
        "'speaker_2': 'So I'm not interested in hearing about that tonight. I'm interested about using this energy that you all have in here, sitting here to advance other things and make sure that we're all talking about the ordinances and the dog compliances.'",
        "'speaker_13': 'And in two.'",
        "'speaker_2': 'Years, when this comes back.'",
        "'speaker_13': 'You all better be here with me sitting here.'",
        "'speaker_2': 'Talking about this. And if the data shows something different, then you all will have to. That's what democracy is. So thank you. Thank you.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Hines.'",
        "'speaker_7': 'Thank you, Mr. President. Councilman Ortega. It is broke. So for many reasons, I'll be voting in favor of this ordinance. And I want to make sure that my constituents realize that this is a thoughtful decision, not just something that's flippant.'",
        "'speaker_7': 'This is a conversation much like religion. People have strong feelings on each side of the argument, just like people feel strongly about, you know, about religion. It finally clicked in my head because one of my constituents shared that, quote, Justified or not, people fear pit bulls.'",
        "'speaker_7': 'I get that. I mean, literally, I get that because people who come into my office are afraid of my dog. This guy who's, you know, hiding behind a desk, asleep, but. It's about the owner. It's not about the dog.'",
        "'speaker_7': 'We want to legislate on making people actually safe, not just making people feel safe. Yes, it's also important to make people feel safe. But we but one, we already have pitbulls in the city. I went by two on my blog in the last week and I asked them both, Well, what are your thoughts about BSL?'",
        "'speaker_7': 'And they said, Well, I'm sure hope we could have our dogs in out in the open. It's right there. He's right. No, but anyway. And to banning certain breeds because they are unsafe actually makes us less safe because then it promotes the unsound assumption that we've gotten rid of all the unsafe dogs.'",
        "'speaker_7': 'And and we've seen we've heard a lot of statistics, you know, people, dogs, untrained dogs, humans make mistakes. All living beings make mistakes. Dogs make mistakes. And even labs bite. People are Chihuahuas are dashboards. Here's just one example.'",
        "'speaker_7': 'Some people have said that the pit bulls jaws are better designed to bite than other dogs, but measured in pounds per square inch, none of the breeds commonly referred to as pit bulls are in the top 12. While science refutes that fear, people have the fear nonetheless.'",
        "'speaker_7': 'Pitbulls are not an actual breed. And people have called that animal, you know, whichever animal is feared at the moment, a pit bull because it's convenient for the story. We've talked about that, too, and received we received one email from a District ten constituent with multiple photos of a dog that it's clearly not a pit bull.'",
        "'speaker_7': 'Yet the fear this constituent described is real. So one other thing. Every animal rights organization, every not every but most major animal rights organizations support an end to BSL nationwide American Veterinary Veterinary Medical Association, the Association of Professional Dog Trainers, ASPCA, the American Society for Protection of Cruelty to Animals, the Humane Society of the United States.'",
        "'speaker_7': 'The American Kennel Club. The National Canine Research Council. The American Bar Association supports the repeal of BSL. The only notable exception I found is PETA Cats. Well, that's interesting, but I went I want to read in for the record.'",
        "'speaker_7': 'This is from the PETA website. So if you go to Peter dot org. PETA advocates for a ban on breeding all dogs, including pit bulls, as breeding any dog should be illegal as long as millions must be euthanized in animal shelters every year.'",
        "'speaker_7': 'Well, that makes it all right. Hang on. That makes sense. I mean, at first I was like, ahead. That doesn't make a whole lot of sense. But yes, while any dog is getting put down and no dog should be bred, I think that is in in in line with PETA's values and maybe in line with my values'",
        "'speaker_7': ', too. But let's we've also talked about the financial implication of BSL, according to a 2019 study led by the University of Denver. And these statistics were cited as well, an economic assessment of BSL. It identified that the city and county of Denver have spent at least $5.8 million on enforcing the legislation.'",
        "'speaker_7': 'Additional economic analysis and estimating that BSL resulted in approximately a $107 million in lost direct and indirect economic activity related to lost pet care revenue. An estimated $1 million has been spent by shelters and surrounding communities to care for the pit bulls that were transferred as a result of BSL.'",
        "'speaker_7': 'And then the same study did a survey. And so the public perception on pit bulls that again this is a do you study that is so fresh that it hasn't even been officially released yet. But we got an advance copy apparently, but 19.4% of people responded and they're just certified Denver residents or excuse me, surveyed Denver residents'",
        "'speaker_7': '. 19.4% of people responded that Denver's breed ban positively impacted their perception of Denver. 80%. It's that's not the case. 24.6% said. Denver residents said that the breed ban makes them feel safer. So 75% of residents, the breed ban does not necessarily make them feel safer.'",
        "'speaker_7': 'It's not that the converse is necessarily true, but I think that's important, important information because it's fresh. A fresh survey from the city of Denver by the University of Denver. Also BSL impacts the credibility of legitimate service dogs, which is something that no one, no one mentioned tonight but is particularly important to me because we have all'",
        "'speaker_7': 'the pit bulls that I found that are service dogs. And there's one gentleman in the back who apparently up to okay, we were up to two of the pit bulls that I found in my neighborhood that people have claimed have service dogs.'",
        "'speaker_7': 'They don't exhibit the same characteristics as my dog. And it's true, Ada is it's very difficult for 88 for someone to to discern a legitimate service dog from a pet because of the way ADA legislation works. And we tried to fix that a little bit at the state level, but it's very difficult because as was stated, federal'",
        "'speaker_7': 'law trumps state law, state law trumps local law. So we're kind of in a conundrum. But while we're in this conundrum, people are using the loophole of my pet is owner or actually he's not a I know he's a pit bull, but he's not a pet.'",
        "'speaker_7': 'He's a service dog. So I would say two other things now. I'm most. My mom was hit by a pit bull once. She almost lost her eye and had to get stitches around her eye socket, except that it wasn't a pit bull at all.'",
        "'speaker_7': 'It was a Chihuahua. Every pit bull in my life has been sweet and kind, and the last thing I'd say, I'm almost done. Let's spring all dogs in Denver, including pit bulls, out of the shadows and into our registry.'",
        "'speaker_7': 'Let's ensure that we know where they are and track down can track them. Let's hold all dog owners accountable, regardless of breed, when they don't see the signs and aren't keeping their pets in a responsible way. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilmember Councilmember Taurus.'",
        "'speaker_4': 'Thank you, Mr. President. I first want to thank the 28 speakers that signed up, and we had time to hear from the additional 16 folks who are still in the room waiting to hear this decision. It takes a lot to come out.'",
        "'speaker_4': 'And to that point, I also echo my fellow Councilwoman Sandoval's sentiments that there are a lot of issues that are really important in this city, and we need all of you to come out and talk about your opinions about them and where you sit.'",
        "'speaker_4': 'It is not just how does this affect me scenario. This has to do with all of our neighborhoods. I want to thank Denver animal protection, Alice and Josh in particular. The work that you do and that your teams do.'",
        "'speaker_4': 'You've shared with me that District three has the most animal protection calls in the city, and this is for everything, not just dangerous animal calls or pit bull calls. But that statistic was stunning to me when we heard it in committee, that of the 2200 calls that you've gotten over the last four years.'",
        "'speaker_4': 'Half of them have come from my zip codes and District three and Bella's zip code. This is where half of the calls are coming from. These are not were half of the pit bulls are. This is where half of the calls reporting suspected dogs are.'",
        "'speaker_4': 'I have a friend who has a sharp mix that is constantly confused for a pit bull. What this tells me is not just that our legislation or what we're trying to do here affects poor communities. What this tells me is that we are also overregulated and overpoliced in many cases, so that you're spending 95% of your time'",
        "'speaker_4': 'out chasing leads that do not result. Vast majority of that time in an actual pit bull means we have more fear of just large dogs that look scary than actual scary. Dogs are my neighborhood. Anecdotally, I see more chihuahuas on the loose than I do large animals.'",
        "'speaker_4': 'And now that I know that they have scissor biting capability, I'm a little worried. But I do worry about the animals that are under the radar that where owners don't feel like they have any option but to keep them there.'",
        "'speaker_4': 'And I want to remove that. But I think we're also carrying forward perceptions and fears that I hope some of the animal professionals have busted tonight. But I know that. We care deeply about our fur babies in our homes and in our neighborhoods.'",
        "'speaker_4': 'Please, please keep them on leashes. Please obey the rules. I have seen more small dogs attack big dogs that have been leashed because the small dogs were off leash in our in Barnum Park in Lincoln Park. These are things that we have to be very vigilant about because larger security issues are at stake.'",
        "'speaker_4': 'So I will be voting in favor of this and really hoping to see in two years a marked difference. If we can see over a period of time, 14% increase, increase in license. Sure. Because of the hard work that general animal protection is doing.'",
        "'speaker_4': 'I want to see that number much bigger if it is anywhere near a decrease. We're going in the wrong direction.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember. Councilmember Flint.'",
        "'speaker_15': 'Thank you, Mr. President. I am really glad that I asked for this hearing, and maybe those who are sitting on those hard seats aren't so happy about it. But this has been very, very helpful for me because this is one of the most difficult votes that I've been asked to make.'",
        "'speaker_15': 'And I had lunch today with Estaban over there at the press table, and we were talking about this and said, I have no idea how I'm going to vote tonight. Over the last couple of weeks. Thank you, Councilman Herndon, for for presenting a regimen that or a compromise or a middle ground that is that is reasonable and'",
        "'speaker_15': 'is very worth looking at. And I went back and forth over the last couple of weeks. One day I would wake up and say, I'm going to vote now, and the next day I would say, I think I could vote yes.'",
        "'speaker_15': 'Then I'm back to no and yes. I had a lot of input in at the last minute today from some constituents that I have worked with over the years. And and I'm grateful to them for that as well.'",
        "'speaker_15': 'And thank you again as Council Councilwoman Sandoval and mentors and others have said, for all those who came from outside of Denver, but also from Green Valley Ranch and Montello, which is probably farther away from where we're sitting right now.'",
        "'speaker_15': 'And, you know, it's snowing out and it's going to be a difficult drive. So stay safe. And thank you for sitting here and coming out and being so passionate as I told to stay on during lunch. A lot of our votes are they're binary.'",
        "'speaker_15': 'We have to vote I or nay. You don't get to vote maybe. Or you don't get to vote. You know, 52%. Yes and 48% no. It has to be a yes or no and. There have been votes where I didn't know until the roll call what I was actually going to say on some really controversial things, because'",
        "'speaker_15': 'there is merit on both sides of this argument. There really is. The data may be unclear and it may be in dispute. But one thing that is clear to me is that the damage caused by pit bulls as opposed to a Chihuahua biting the eye socket is disproportionate to their numbers in the population.'",
        "'speaker_15': 'And. And even though the data may be in dispute or cloudy, that gives me pause and and has me leaning toward voting no on this. But I do think, Councilman Herndon, for bringing it forward and putting us through this debate, it was worth having.'",
        "'speaker_15': 'And it was very helpful to have all of you come down here and speak to this on both sides. So I appreciate that. So with that, Mr. President, I will be joining those who are voting no.'",
        "'speaker_1': 'Thank you, Councilmember. All right. I, I don't see anybody else. So that leaves you with me. And then we are going to vote. I want to say thank you to Councilman Herndon for all of your work on this and for, you know, being willing to work and come forward with something that wasn't what you had initially wanted'",
        "'speaker_1': '. I think to come forward with I just want to say thank you, thank you. Thank you to all of you for everything that you did tonight to make me so proud of our democracy. I grew up in Denver, born and raised here, and I grew up afraid of pit bulls in the city.'",
        "'speaker_1': 'And when Councilman Herndon and a group of my constituents on different occasions first came to me with this, my knee jerk reaction was, No way. But I committed when I ran for this job that I would listen to everyone, especially those who disagree with me.'",
        "'speaker_1': 'And above all, I'm committed to facts and to science and to making sure that I lead from those facts and from that science, even when and maybe most importantly, when it's the hard thing to do and. It took me a long time to change the emotional response that I had and to look at the data that was'",
        "'speaker_1': 'there and look at the science that was there to get me to where I am tonight. But I do believe that the science is clear that breed specific legislation is not effective and it is not best practice. We've already enacted our dangerous dog ordinance prior to this to make sure that we do have dog laws that are'",
        "'speaker_1': 'based on best practice and are based on science to enable something like this to some of my colleagues who have said, hey, you know, maybe, but we need more resources for this. And to that, I agree. We need more resources for our dogs and our humans who take care of those dogs.'",
        "'speaker_1': 'We need more resources for enforcement. We need more resources for licensing. We need more dog parks. We need legal places where people can let their dogs off leash for a city that now has more dogs. I've been told by an article in one of the media outlets more dogs than children in our city.'",
        "'speaker_1': 'We desperately need more dog parks. Dog parks in every community. But none of that changes the fact that that if we need more of these resources, we need them for all dogs, and that there is a difference based on breed.'",
        "'speaker_1': 'And for me, none of that changes facts. None of that changes the science. And for that reason, at a time where I think that has never been more important for us as a city, for us as a state, for us as a country to lead and to legislate based on facts and based on science.'",
        "'speaker_1': 'I will be voting in support of this bill tonight. Madam Secretary, roll call.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_7': 'I.'",
        "'speaker_4': 'Black. I.'",
        "'speaker_15': 'Flynn No.'",
        "'speaker_2': 'Hines.'",
        "'speaker_7': 'High.'",
        "'speaker_6': 'Cashman.'",
        "'speaker_0': 'No.'",
        "'speaker_4': 'Kenny.'",
        "'speaker_2': 'I. Ortega No. Sandoval. Sawyer. No. Torres.'",
        "'speaker_6': 'I. Council. President.'",
        "'speaker_1': 'I. I'm. Secretary. Please close the voting. Announce the results. Seven. Seven. I heard seven eyes and four days. Council Bill 71 has passed, having no further business before this body. This meeting is adjourned.'"
    ]
}