{
    "A bill for an ordinance amending Articles III, V and VII of Chapter 28 of the Denver Revised Municipal Code by repealing and reenacting a new Division 3 of Article III establishing a Minority and Women Business Enterprise contracting ordinance in furtherance of nondiscrimination in City Contracts for Construction, Reconstruction, and Remodeling, and Professional Design and Construction Services; repealing and reenacting  a new Article V establishing a Minority and Women Business Enterprise contracting ordinance in furtherance of nondiscrimination in City Contracts and Purchase Orders for Goods and Services and Opportunities for Minority and Woman-Owned Businesses and Small Business Enterprises in Procurements for Goods and Services; and repealing and reenacting  a new Article VII pertaining to the development and utilization of Small Business Enterprises in City contracting and concessions. Amends Articles III, V and VII of Chapter 28 of the Denver Revised Municipal Code by repealing and reenacting a new Division 3 of Article III establishing a Minority and Women Business Enterprise": [
        "'speaker_1': 'I'm very excited that the government is embracing more technology. I'm so sorry for the circumstances, but I'm glad that we're having so many positive results. Thank you, Mr. President. The. What's.'",
        "'speaker_4': 'Test. Test? Yes. Oh, it looks like it's coming through, right? I think we're getting close.'",
        "'speaker_5': 'Did you ask.'",
        "'speaker_4': 'Me to ask no one again? No. So we bought a tenable. Okay. So what I'm being told right now is that we are live in the room and we do have a quorum, but that we have lost the zoom feed for now.'",
        "'speaker_4': 'So we're going to proceed with our meeting since we do have a quorum. So our meeting is back and um, what we have right now for those of you who couldn't hear us before, is we are in the call out sections.'",
        "'speaker_4': 'Do we need to, Madam Secretary, do we need to reread the bills for introduction or redo anything that we that might not have been on audio? Or are we picking up where we were?'",
        "'speaker_5': 'I can start again with the bills for introduction from business arts workforce in aviation 2286 A bill for an ordinance amending Articles three, five and seven of Chapter 28 of the Denver Revised Municipal Code by repealing and reenacting a new Division three of Article three, establishing in minority and women business enterprise contracting ordinance in furtherance of nondiscrimination'",
        "'speaker_5': 'in city contracts for construction, reconstruction and remodeling and professional design and construction services. Repealing and React Reenacting a new Article five. Establishing a minority and Women Business Enterprise. Contracting ordinance in furtherance of nondiscrimination in city contracts and purchase orders for goods and services and opportunities for minority and woman owned businesses and small business enterprises in procurements for'",
        "'speaker_5': 'goods and services. And repealing and reenacting a new Article seven pertaining to development and utilization of small business enterprises in city contracting and concessions. And from finance and governance 20 to 90, a bill for an ordinance authorizing expenditures in the General Government Special Revenue Fund based on a letter of intent from the United States of America to'",
        "'speaker_5': 'award funding to the city and county of Denver for the Denver Kids Headstart Fiscal Year 2023 2021 program.'",
        "'speaker_4': 'Thank you, Madam Secretary. All right. So called out was under bills for introduction on a resolution something called and bills for introduction. Council member Flynn has called out council bill to 86 for questions and a comment. Sir, Madam Secretary, if you put that back up on our screens and Councilmember Flynn, why don't you go ahead with your'",
        "'speaker_4': 'questions and comment?'",
        "'speaker_2': 'Yes. Thank you, Mr. President. Apologies for the backtracking. I called this out with some questions that I had. And in light of the need to have people not come down here unnecessarily and the fact that we're going to have another opportunity next week.'",
        "'speaker_2': 'Email with Adrina and some others, or next week here on the floor, either by virtual presence from the agency or in person, as whatever may be the more convenient or advisory. We are going to require prime contractors to pay subcontractors, minority and women subcontractors within 35 days of those subcontractors giving an invoice to the prime.'",
        "'speaker_2': 'Whereas the the bill says that they shall be paid within 35 days, quote, regardless of whether the contractor has been paid for the same work or payment period, unquote, by us. We have heard for many years that Denver's processes leave something to be desired in terms of prompt payment ourselves.'",
        "'speaker_2': 'So this looks like it's a case of do as we say and not as we actually do ourselves. I know that from talking with Adrina and and Jason and others that are working on this, that we have the Peak Academy working on processes and streamlining and trying to get prompt payment ourselves.'",
        "'speaker_2': 'But there still are underlying issues. If the prime contractor is itself a minority owned or women owned certified business acting as a prime, they will be subject to the same 35 day requirement, yet may not be paid by us for up to six months for the same work.'",
        "'speaker_2': 'So I'd like to find out what are our processes or what's our intention for handling those? And the other new issue that has come up, Adrina, and I hope that she's still able to watch. If not, I will email her after she is watching.'",
        "'speaker_2': 'Okay. Email after the meeting frequently. And from my experience covering construction projects as a journalist and working at RTD on the airport train project in the field, there frequently are change directives that occur that are carried out by subcontractors.'",
        "'speaker_2': 'This entails a lot more lead time for the city to pay the prime. Yet we're requiring the prime to pay the sub within 35 days. In essence, we're asking our prime contractors to finance in part finance our projects.'",
        "'speaker_2': 'So it's very important that the efforts that Adriene is office and the rest of the that public works and the airport are working on to streamline our processes, come up to speed and that we have confidence in them.'",
        "'speaker_2': 'So I want to hear more by next week about how we're going to implement some of these ten. I think there were ten process improvements that we were looking at doing. And otherwise, this is like a case where we're taking care of our of our MBA subs and getting them paid on time.'",
        "'speaker_2': 'So we're filling the air and one of the tires, but the other three tires are still flat. So we need to get we need to inflate the rest of the system and get it working clearly. So those are the those are the concerns that I want to see addressed.'",
        "'speaker_2': 'We have all up on this dais and the other members have been receiving email from some prime contractors. Not all of them are big multinational corporations. Some of them are pretty small outfits, and some of them are graduates of our MBA program.'",
        "'speaker_2': 'And they have concerns about their ability to meet this 35 day requirement when we can string them out for up to six months. So I'm hoping to have answers by that next week. I did not call this out for a vote because I believe it does need to move forward.'",
        "'speaker_2': 'Every other aspect of the ordinance is something I wholeheartedly support. Thank you, Mr. President.'",
        "'speaker_4': 'Thank you, Councilmember. All that conclude I don't see anybody else on that item. So that concludes the comments on that item. And now we are. Carrying into uncharted territory here. So we had an item called out by one of our members who's on Zoom.'"
    ],
    "A bill for an ordinance amending the Denver medical marijuana code of the Denver Revised Municipal Code to regulate and implement medical marijuana research and development facilities and to modify provisions to conform with state statute. Amends the Denver Medical Marijuana Code of the Denver Revised Municipal Code to authorize a new local medical marijuana license to regulate and implement medical marijuana research and development facilities and to modify provisions to conform with state statute. The Committee approved filing this item at its meeting on 3-17-20.": [
        "'speaker_4': 'Well, I have confirmation that Janet can see all of us. I'm not sure that they can see the Zoom people. So I'm going to go ahead and call it out and we'll see what happens. So I'm secretary. Please put the next item on our screens.'",
        "'speaker_4': 'Councilmember Black, will you please vote? Council Bill 262 on the floor.'",
        "'speaker_0': 'Yes, I move that council bill 20 dash 0 to 60 to be placed upon final consideration and do pass.'",
        "'speaker_4': 'Thank you. It has been moved and seconded, so this was called out by Council Member C to walk into my understanding that they are not going to be able to be seen by generally and so are not going to be up.'",
        "'speaker_4': 'So unless there are other comments on this item tonight, then we are going to. Vote. I can hear people. We can hear them a little bit there, but they're not they're not going be able to be heard by the public, is my understanding.'",
        "'speaker_4': 'So just to get clarification from our secretary and legal. So we are just voting on this item now probably.'",
        "'speaker_6': 'May I ask a point of order? This is a council bill and it is on final consideration and do pass. Can you talk about the time sensitivity of this and whether we should delay it for the council member who chose to vote on it and hope that our technology works next time?'",
        "'speaker_6': 'DeLay it to a date certain of next week as a courtesy to ensure that she has the chance to make the case about the concerns she had. So I will make a motion to delay. Council vote 20 dash 262 for one week.'",
        "'speaker_4': 'Is that you seconding or Councilmember Flint or did you want to make a comment on that? Okay. All right. So we have a motion on the floor to delay for one week. A second for that. Skye, do you want to come up from and just answer?'",
        "'speaker_4': 'Is there any time sensitivity on this that would that we should consider before a postponement?'",
        "'speaker_7': 'Sure. Sky Stuart Mayor's office. There is not a huge time sensitivity, but we do have an applicant that is waiting. I will remind people that this is a license that the state passed in 2017. So it's been a couple of years.'",
        "'speaker_7': 'And there is an applicant out there who I believe has spoken with many of you about their work to get prepared for this license to move forward. I know they've put a significant amount of capital into being able to move forward.'",
        "'speaker_7': 'So while one week is not a delay that will, you know, kill the license from being available to people, it will cause an additional week before we can get this up and running for the applicant that has been anxiously awaiting us moving forward.'",
        "'speaker_4': 'Okay. Thank you. All right, Councilman, are you still in the queue for making the motion or did you have something else you want to do? I want to.'",
        "'speaker_6': 'Comment.'",
        "'speaker_4': 'Okay. Go ahead.'",
        "'speaker_6': 'So I am fully in support of this bill. I believe that the concerns expressed last week were about the equity program not being in place, but the fact that we have one equity applicant, this is very difficult. And so but I believe that because this is the first time we are trying this form of democracy, it is'",
        "'speaker_6': 'critical for us, even if we can anticipate that the votes will be here to pass it this week, as they were last week, that we cannot have technology be the barrier in a situation like that, because I think it's so important that the trust be in this form of democracy that we are evolving.'",
        "'speaker_6': 'So for that reason, even though I'm fully in support, I don't want that applicant to wait a week. Our democracy needs to be as robust as we have promised the community it will be. And so hopefully a week we'll solve the technology issue or we can get council members back in the chamber.'",
        "'speaker_6': 'So I'm sorry for that applicant, but I do, you know, and obviously if the motion fails, it fails. But that is why I'm going to I'm going to keep the motion in, even though it potentially impacts an applicant.'",
        "'speaker_6': 'And I regret that.'",
        "'speaker_4': 'Thank you, Councilmember. And I'll just add that I agree with you. I am in support of this. It would be a yes vote and will be a yes vote next week. But I agree with everything that you said and I think we should postpone for one week.'",
        "'speaker_4': 'So with that, Madam Secretary, roll call.'",
        "'speaker_5': 'Okay. So the motion would be for Council Bill 22, 62 to be postponed until Monday, April 13th?'",
        "'speaker_4': 'That's correct.'",
        "'speaker_0': 'Black I.'",
        "'speaker_5': 'Flynn.'",
        "'speaker_2': 'I but my system is not. I wasn't able to log in.'",
        "'speaker_5': 'Gilmore, I. Herndon. I can each. Torres, I Council President.'",
        "'speaker_4': 'Hi, Madam Secretary. Please close the voting in both the results.'",
        "'speaker_5': 'Seven days.'",
        "'speaker_4': 'Seven eyes council bill 262 has been postponed to April 13th. That concludes the items to be called out this evening. All bills for introduction are ordered published. Council members remember that this is a consent or block vote and you will need to vote.'",
        "'speaker_4': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Black, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_0': 'Yes, I move that resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in a block for the following items. 20 Dash zero 290 1027602890065019702050256027702260283028402870294029503130261025102530267. Back I.'",
        "'speaker_5': 'When.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Gillmor.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Can each Torres.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Council President.'",
        "'speaker_4': 'Hi, Madam Secretary. Please cause voting and notes results.'",
        "'speaker_5': 'Seven eyes.'",
        "'speaker_4': 'Seven eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. We will not take a recess this evening and see no other business before this body. This meeting is adjourned.'"
    ]
}