{
    "A resolution approving a proposed Purchase and Sale Agreement between the City and County of Denver and Morrison Center LLC for the purchase of real property located at 4320 Morrison Road. Approves a purchase and sale agreement with Morrison Center, LLC for $4,080,000 to acquire property located at 4320 Morrison Road for the buildout of the Westwood Recreation Center as part of the Elevate Denver Bond Program, in Council District 3 (201948958-00). The last regularly scheduled Council meeting within the 30-day review period is on 7-22-19. The Committee approved filing this item at its meeting on 6-18-19.": [
        "'speaker_1': 'Comments? All right. Madam Secretary, would you please put the first item up on our screens? And this is 540. Councilman Lopez, what would you like us to do with this one?'",
        "'speaker_0': 'I wanted to put it on the floor for a vote. All right.'",
        "'speaker_1': 'All right. Councilman Gilmore, you please put Resolution 540 on the floor for adoption.'",
        "'speaker_5': 'I move the resolution 540 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments by members of council. Councilman Lopez.'",
        "'speaker_0': 'Thank you, Mr. President. I brought this out not because.'",
        "'speaker_1': 'I'm going to vote against it, but I wanted to vote for it and I wanted to actually bring this out so it stands on its own. So this council resolution.'",
        "'speaker_0': '540 is the sale agreement between the city and county of Denver and the purchaser for the and Marston Road Center, LLC, for the purchase of property located at 4320.'",
        "'speaker_1': 'Morrison Road.'",
        "'speaker_0': 'Now, why would this be anything special? Because. On Wednesday, July 18, 2007, 12 years ago. Have the minutes and hours to turn this into the library sometime soon. But this was our Infrastructure Attack Priorities Task Force. This was the 2008 bond.'",
        "'speaker_0': 'And those of you who are in this room 12 years ago know that I put up quite a fight. This is my second day in office, and I put up a fight for one reason, because that bond that we were all footing the bill for.'",
        "'speaker_0': 'Right. Right before the the recession hit was missing something, and it was missing almost an entire council district. And it missed, especially the need for our rec center and Westwood High cardiovascular disease rates with high diabetes rates with no access to rec center facilities.'",
        "'speaker_0': 'This was our top priority. And we fought for it. I got out, did my plea to try to amend the 28 bond and didn't move forward. Didn't catch the vote at this Finance Committee meeting to move forward on the council and didn't go to the ballot for voters to vote on.'",
        "'speaker_0': 'So that put us 12 years, 12 years with community working and working every single one of those years to make sure that this happens. Now, I was ready in the last I think it was at the last go round in the bond.'",
        "'speaker_0': 'We put it in there and it was accepted. It was approved. I knew, however, there was a good chance that because it was in this bond, I wouldn't I wouldn't be the person to see it through. However. What we have in front of us on my last day in office is the first thing I ever fought for'",
        "'speaker_0': '. And this is our rec center. And that's $4,080,000.'",
        "'speaker_1': 'To acquire a property.'",
        "'speaker_0': 'On the corner of Raleigh and Morrison Road to build our rec center. And I. I know Adriana had.'",
        "'speaker_1': 'To go because her mother was in town from.'",
        "'speaker_0': 'Green River. But they worked so hard. We work so hard to get this rec center done. And I'm very glad that at the last day on this dais, I'm going to be able to vote. A Yes on five for you of 2017 and finally put these notes into archives where they belong.'",
        "'speaker_1': 'So for those of you didn't see.'",
        "'speaker_0': 'I got the exact same picture of this for my aide, and I just gave it to her in the hallway.'",
        "'speaker_1': 'Because on the back of this little girl's shirt.'",
        "'speaker_0': 'Says Love. And that's the one thing that's guided all of us in this office and this neighborhood. And I think on this council, that's our first park with the promise that one day.'",
        "'speaker_1': 'We'll have a rec center. So, Mr. President.'",
        "'speaker_0': 'I am more than happy to ask my colleagues for one more time as a city councilman to vote yes on Resolution 540 of 2019.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Let's vote. Madam Secretary. Raquel.'",
        "'speaker_0': 'Lopez I.'",
        "'speaker_5': 'Black. Brooks.'",
        "'speaker_8': 'I.'",
        "'speaker_7': 'Espinosa, i. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Gilmore, I.'",
        "'speaker_0': 'Herndon, I. Cashman I.'",
        "'speaker_5': 'Commit I.'",
        "'speaker_0': 'Knew I.'",
        "'speaker_10': 'Ortega I.'",
        "'speaker_7': 'Susman I. Mr. President.'"
    ],
    "A resolution approving a proposed contract between the City and County of Denver and Interstate Highway Construction, Inc. concerning design and construction services for Pea Boulevard at Denver International Airport. Approves a contract with Interstate Highway Construction, Inc. for $93,479,841.20 and through 05-30-22 to perform design and construction services for Pea Boulevard Phase 1 including widening and reconstructing both inbound and outbound Pea Boulevard, and reconstructing portions of Jackson Gap Road and the Jackson Gap interchange at Denver International Airport (201628522). The last regularly scheduled Council meeting within the 30-day review period is on 7-22-19. The Committee approved filing this item at its meeting on 6-19-19. Pursuant to Council Rule 3.7, Councilman Espinoza postponed this item at the 7-8-19 Council meeting for a one-week postponement to 7-15-19.": [
        "'speaker_1': 'I. Madam Secretary, please close voting. Announce the results. 1313 ays Resolution 540 has been adopted. Congratulations, Councilman. Councilman Cashman. Under resolutions, you called out 586. Madam Secretary, if you can put that on our screens, and what would you like to do with this one?'",
        "'speaker_2': 'I just have some questions, Mr. President.'",
        "'speaker_1': 'Go ahead.'",
        "'speaker_2': 'Well, first, I want to thank people and even in the team at the The Denver Streets Partnership for reminding us in view of the passage of a blueprint, Denver in the comprehensive plan recently the importance that as we're considering any substantial road widening projects, that we be sure to ask the questions that as this was being designed'",
        "'speaker_2': 'or conceived, that alternative forms of mobility were considered and included to the greatest extent possible. As this airport Pioneer Boulevard widening project is the first major road widening to come up since that passage. We thought it was more than appropriate to to ask some questions.'",
        "'speaker_2': 'I appreciate both the Street's partnership bringing it up, the airport's willingness to engage not just tonight in questions, but in an ongoing basis and answering these. So I guess. Thank you, Rachel. Stepping up. The first thing I would ask is how can you say that this project does support the goals in the new Blueprint Denver plan, as'",
        "'speaker_2': 'well as Denver's Vision Zero Action Plan to eliminate fatal and traffic fatalities and injuries.'",
        "'speaker_11': 'Sure. So thank you, Councilman Cashman. And thank you also to Denver Streets Partnership and all of the advocacy organizations that are out there elevating this conversation. I think it's an important one and it's one that the airport is very committed to.'",
        "'speaker_11': 'So we look forward to engaging in the conversation in terms of blueprint. Denver We've encouraged mode shift at the airport for a long time. We invested $350 million into the transit center for the A-line. We built out, gave $30 million to build out 61st and pioneer.'",
        "'speaker_11': 'That being said, we can always do better. We have plans to build out a bike network, and that's part of Suzuki's work on a done real estate strategic development plan. We also are promoting a walkable, transit oriented development at 61st and pinion as recently as a few weeks ago, are pushing the developers there to truly make it'",
        "'speaker_11': 'a dense, walkable, bikeable transit hub at that station and were among the major partners, along with Sierra and RTD, to create mobility next partnership and collaborate around connectivity and embracing the advancement of the next generation of mobility. So in everything we do, including this project, we're looking with an eye towards mobility and transit development and connectivity at'",
        "'speaker_11': 'the airport.'",
        "'speaker_2': 'Great. Thank you. So we discussed earlier that at this point in time, it doesn't sound like, again, has a specific goals for ride share, shift and reduction of trips and single occupancy vehicle is then willing to commit to working towards establishing such a goal for reducing SUV mode share in line with Blueprint.'",
        "'speaker_11': 'Absolutely. I think we're we're always committed to engaging that conversation. Quite frankly, the more people that choose alternative modes of travel out to the airport benefits not just the city, but the airport as well. As part of this project we have we are building out the ride share lot, so creating a designated lot for Taxi Uber, Lyft'",
        "'speaker_11': ', and that will include electrification of that lot so that folks that have electric vehicles and are doing Uber and Lyft have the ability to charge out there. That being said, we we recognize we can do better and in the ways in which that we can engage these advocacy groups.'",
        "'speaker_11': 'RTC Dot. Dr. COG in evaluating new and creative solutions around getting people out of single occupancy vehicles. We are committed to that partnership and committed to meeting with those organizations.'",
        "'speaker_2': 'Okay, Mr. President, I have some additional questions, but I believe some of my colleagues do as well, so I'll defer.'",
        "'speaker_1': 'Okay. Thank you. Councilman Cashman, Councilman Espinosa.'",
        "'speaker_8': 'Hi, Rachel. For the public, can you explain where phase one, where phase one, this phase one project of Pena Boulevard is?'",
        "'speaker_11': 'Sure. So phase one of this Pioneer Boulevard design build project runs from Jackson Gap to the terminal.'",
        "'speaker_8': 'And Jackson Gap is essentially the last overpass or approximately. Yes, that crosses Pena Boulevard to the western, you know, the proper terminal. You know, we have a congestion problem in lots of parts of the city. When does it get bumper to bumper in that section of the highway?'",
        "'speaker_11': 'So what time of day or.'",
        "'speaker_8': 'What sort of congestion problem do we have there?'",
        "'speaker_11': 'So we I don't know if this helps answer your question. In 2017, we had a traffic study that was done that takes into account ridership at the line bus travel and evaluates past traffic on Pioneer Boulevard and then evaluates Dr. Cods, Dr. Cox Transit Use Study and then projects out to future traffic and existing traffic on Pioneer'",
        "'speaker_11': '. We've also done our own internal studies on traffic apnea. We're about to hit around 70 million passengers flying out of the airport every year, and that's definitely putting some pressure on the infrastructure on Pioneer.'",
        "'speaker_8': 'So when we had our briefing, I'd ask the question, how much of that traffic, that 70 million passenger load originates in Denver?'",
        "'speaker_11': 'I don't know that there's a way for us. Do you mean Denver as opposed to Aurora or Commerce City or Brighton? I don't know if there's a way for us to track that.'",
        "'speaker_8': 'How about that goes that traverses phase one of Penn Yan Boulevard.'",
        "'speaker_11': 'That. I'm not sure I understand your question. If you're traveling out of Denver, you're either taking the airline or you're traversing that section of Montana.'",
        "'speaker_8': '70 million people, there are some that are coming into the airport via airplane and then leaving our airport by airplane.'",
        "'speaker_11': 'Okay. Original trips.'",
        "'speaker_8': 'Yeah. So is your question tonight from here.'",
        "'speaker_5': 'I'm going to.'",
        "'speaker_11': 'Look back to my team to see if. My understanding is 60% of 70 million. So it was originally projected that 40% would be originating in Denver. 65%, about 65% or 70 million. And my math is not great on the spot.'",
        "'speaker_11': 'So whatever number that.'",
        "'speaker_5': 'Is.'",
        "'speaker_8': 'And the other question I had that didn't have an answer was what is the design load for the commuter rail for the airline to how many what what number of passengers originating passengers could and workers could do the rail?'",
        "'speaker_8': 'What's the capacity of that rail?'",
        "'speaker_11': 'That's a great question. I do know that RTD has planned for future expansion of the number of cars that are on each truck. I don't know off the top of my head what our TDS projected a full maxed out capacity of the airline once they add in all the cars is.'",
        "'speaker_8': 'So I actually have the old vision zero letter and it was funny that I came across it as I'm cleaning out my desk, which talks about hires. I mean, very clearly states high speed skill. Obviously we don't have a lot of pedestrian traffic traversing the road out there, but we do we don't have a lot of congestion'",
        "'speaker_8': 'like we do at other airports where you're just you're in a in a crawl as you approach. So what I've been struggling with this entire time is you recall in our briefing is what is the problem that $93 million worth of money needs to be?'",
        "'speaker_8': 'Because if the city is using the congestion argument as a mode shift, you know, argument in the city, why would widening the road, expediting the ease of travel via vehicle encourage greater use of the A-line? If you go on the line right now, there's not one, but there's one trough where the train runs and there's a whole'",
        "'speaker_8': 'nother trough there to essentially expand the capacity. Why aren't we using why? Why couldn't you? Is there some federal prohibition that prevents you from partnering with RTD to either reduce the cost of those trips, to encourage more people and more families to get out of their car and not pay for overnight parking, but to take the train'",
        "'speaker_8': '? Was that part of your analysis and why did that fail?'",
        "'speaker_11': 'So I think there are a couple questions for me to respond to. Their first, a big part there is congestion. So just because somebody hasn't anecdotally experienced it on their trip out to the airport, there are certainly times when Panya is backed up and is very heavy from a congestion standpoint.'",
        "'speaker_11': 'That being said, a large part of this project has to do with operational safety and traffic flow that involves the turnaround. Right now, if you've ever done, you know, the loop to come pick somebody up, there's a situation where you're having to cross multiple lanes of traffic and it's from a vehicle safety standpoint, it's not great.'",
        "'speaker_11': 'And a large part of this project addresses that issue in terms of partnering with our TD to increase capacity of the line. You talked about a little bit about dollars. And so I want to take this moment to say the FAA won't allow us to they allowed us to build the transit center.'",
        "'speaker_11': 'They allowed us to invest in 61st, and now we can't put further dollars into build out of the airline. So that's something that we the airports federally prohibited from doing at this point in terms of encouraging ridership. We are advocating every single day.'",
        "'speaker_11': 'We're working closely with Councilwoman Gilmer mayor's office, with RTD, with Dr. COG in figuring out ways to reduce, especially employees. We have 35,000 people working out at the airport, especially in encouraging them to use our TD and figuring out what those barriers are to ridership and how we might be able to act as an advocate and a'",
        "'speaker_11': 'partner in reducing those barriers.'",
        "'speaker_8': 'Thank you. I am deeply concerned that the airport is once again maybe missing the big picture here, which is that you're expanding and widening and fixing the area closest to the airport, which would somehow encourage more traffic, but that the bulk of our congestion problems on PIA are actually from I-70 to Jackson Gap.'",
        "'speaker_8': 'But you're doing you're spending $93 million on the on the part. That's not that.'",
        "'speaker_11': 'So and the $93 million, as I said, it includes an Uber and Lyft and Taxi lot with an associated building. It includes changing the interchange at Jackson Gap and includes rerouting traffic to and from the airport, including one lane that's dedicated for bus travel into the airport.'",
        "'speaker_11': 'And so it's not I think calling it simply a widening project is just.'",
        "'speaker_8': 'Join us. You understand encouraging Uber and Lyft and simplifying that again is counterproductive to the investment that you have already made at Penn Station and at the transit center.'",
        "'speaker_11': 'I think our goal is to encourage multiple different forms of transportation. I think Uber and Lyft offer a great opportunity, especially if you're using a carpool option within Uber and Lyft to reduce traffic counts and to encourage multiple forms of transportation access to the airport.'",
        "'speaker_8': 'But neither one of those companies provide the same level of worker protection as are organized labor in the taxi companies.'",
        "'speaker_1': 'Thank you. Thank you. Councilman Espinosa, Councilwoman Gilmore.'",
        "'speaker_5': 'Thank you, President Clark. Rachel, could you talk a little bit more about the I guess, the research or when, you know, there's a phase two that's associated, assuming that this gets through, but that split between tourism or, you know, folks that are actually Denver residents or Colorado residents, that transit might work for them.'",
        "'speaker_5': 'Could you talk a little bit about did you have those those splits so that we could get a better idea of what the congestion might be looking forward? Because we know that it's congested at certain times of the day.'",
        "'speaker_5': 'But as you continue to uptick on your passenger counts, we might very well get to a place where it's bumper to bumper congestion.'",
        "'speaker_11': 'No, I think that's a great point. And it's really important when we're making any sort of decision at the airport, especially one of this magnitude or future decisions, long pina that we're equipped with as much information and data as possible.'",
        "'speaker_11': 'So I think leading up to this, we have done a number of studies in terms of traffic on PDA, including studies with surrounding jurisdictions to look at which traffic counts are originating at the airport or traveling to the airport and which are merely passing through, which I think will only increase as neighborhoods around the airport build out'",
        "'speaker_11': '. That's something we're we're constantly studying. We're also studying, like I said, how our employees are getting to work and what works best for them. And I think that'll be a really big component as the airport grows and our employee base grows is really encouraging.'",
        "'speaker_11': 'Figuring out, like I said, what the barrier to transit or car sharing or Vanderpool may be for our employees and what the airport can leverage to remove those barriers.'",
        "'speaker_5': 'And then my last question regarding this phase one, I you know, Councilman Espinosa touched on it a little bit, but I want you to be very clear so that there is no mistake. You know, talk a little bit about the FAA and the restrictions around a diversion of revenue.'",
        "'speaker_11': 'Sure. So all the commercial airports in the United States are built with federal dollars. And so the FAA has strict requirements on what we can and cannot use airport dollars for. As those of you on council are very familiar with, but I know this is new to a lot of members of the public.'",
        "'speaker_11': 'The airport is an enterprise fund within the city and county of Denver and airport dollars have to go to airport uses. Any use outside of airport use is barred by the FAA. So those include community benefits. Those include any other type of investment within the city.'",
        "'speaker_11': 'I think sometimes folks look at investment at the airport and wonder, why can't that money go downtown or go to different communities? And it's because the federal government, through the FAA, prohibits use of any revenue for airport revenue being diverted to other uses.'",
        "'speaker_5': 'Great. Thank you. Thank you, President Clark.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Cashman, if you're okay, I'd like to ask a few before I get back to. Okay. I want to first thank Denver Street's partnership for for pushing this issue and shining a light on this.'",
        "'speaker_1': 'I think we're all adjusting to having new plan and new blueprint. And what does that mean and how do we look and having a new way of talking about growth and talking about our roads in particular. And so I also want to thank you guys for being willing to engage in this conversation, especially because Panya is a'",
        "'speaker_1': 'street like no other in the city and county of Denver that it falls under. It really is seen by the federal government as your driveway, not as a city street in the way that many of us think about it.'",
        "'speaker_1': 'But at the same time, every, you know, car trip that uses pioneer originates or ends somewhere in our street network. And as we are trying to provide real alternatives and options for people to choose, it's a key component for that.'",
        "'speaker_1': 'So it's an interesting balancing act that we're doing here. But in my conversations with the partnership and with the community, there are some things that I think are important to get on the record that hopefully are easy things to commit to, or maybe not, but like to ask them and see if, you know, don't need to get'",
        "'speaker_1': 'in deep. But just some things that maybe you can commit to that I think will help them representing the mobility community feel better about projects moving forward beyond this one. So can you guys commit to studying how to accommodate future travel demand through non-core modes and doing some real deep dove studying into how to do that?'",
        "'speaker_11': 'Absolutely. And then real estate, which is a division of the airport, is actually in the process of undergoing a transportation study starting now that will evaluate. They are very committed to modern multimodal transportation as we look at building out more parts of the airport land.'",
        "'speaker_11': 'And so I think we can absolutely commit to to studying those options.'",
        "'speaker_1': 'And how about committing to I think part of the frustration was a feeling that there wasn't a lot of engagement and transparency within, again, this world of all the different worlds that you guys operate in. And so can you make a commitment to greater transparency, engagement of the community in developing the plans, especially these plans when it'",
        "'speaker_1': 'comes to mobility that do impact the.'",
        "'speaker_0': 'Rest of our street.'",
        "'speaker_1': 'Grid and the broader community?'",
        "'speaker_11': 'Absolutely. I said to Councilman Cashman earlier today, I think a commitment to further public engagement is always a great thing. You know, we sort of had our heads on this project deep into the workforce component and thought through the mobility and transit conversation, but didn't engage that conversation early on.'",
        "'speaker_11': 'And this was a great reminder, to be sure to loop in all stakeholders early in the process.'",
        "'speaker_1': 'And the Denver Streets Partnership, who represent a broad slice of our community. Can you commit specifically to working to with them to ensure that multimodal transportation is adequately incorporated into future plans for transportation infrastructure.'",
        "'speaker_8': 'At the airport?'",
        "'speaker_11': 'Yes. So we we have been and will continue to be committed to forward thinking when it comes to transportation and mobility options. We're working on a number of initiatives right now, and I always love smart people in the room as we try to tackle tackle those issues at the airport and as a city, we encourage, you know'",
        "'speaker_11': ', Dan is very committed to these issues. It's a it's a priority of ours to be advancing transit and multimodal options at the airport. And, you know, we encourage, you know, other agencies, other projects to be pushing this issue as well, to be, like you said, in line with Blueprint Denver and what it calls for.'",
        "'speaker_1': 'Great and change. Back to something that you talked about a couple of times, this Uber Lyft taxi kind of infrastructure. But as I think has been pointed out, not every ride in a car share is the same. I can call a car share and I can write all by myself.'",
        "'speaker_1': 'That's the same as a single occupancy vehicle, even though there's two of us in there. But a lot of the technology is moving towards a pooling where you ride with multiple people, which is a carpool of sorts, and does require fewer cars to move more people.'",
        "'speaker_1': 'Do you currently collect data from those companies on what percent of rides to the airport are pooled rides and carpool versus essentially an SUV ride share? And if you don't, can you commit to attempting to work with the companies to get some data on that, to really understand if we're building out infrastructure that further encourages that mode'",
        "'speaker_1': '? Should that mode be really classified as savvy travel or as pool travel?'",
        "'speaker_11': 'Sure. So we do collect data today from the ride share companies. I will say that I do think as somebody who was car less for six or seven years of the past decade, that while I may have taken an Uber out to the airport prior to the airline being built, that option, while it was a single occupancy'",
        "'speaker_11': 'vehicle ride for me out there, allowed me in every other commute in the city to not be in a car. So I think we can collect that data. It doesn't tell the full, full picture. And like I said earlier, I think having a wide menu of options for how you can get to and from the airport really'",
        "'speaker_11': 'encourages, you know, all these goals that we're talking about.'",
        "'speaker_1': 'Great. And I apologize. A bunch of people have gotten in line. I thought it was just Councilman Cashman I was going to when I got done. So I'm going to get to a few other people. But I will also say that as someone who has converted and exclusively uses the train to get to the airport, which is'",
        "'speaker_1': 'a phenomenal asset that we have, that I thank you for your investment in that infrastructure and share a little bit of the fear that as we look at other investments, that we don't do something that leads to a reduction of service, that we're doing things that lead to better service in that line, because I think it's an'",
        "'speaker_1': 'amazing way to get people to and from the airport. Councilman Flynn.'",
        "'speaker_6': 'Thank you. Mr. President, I wanted to bring a few things out to light. Just briefly, Rachel. It's true, isn't it, that the airport, when it built a transit station for the airline, built the platform for the ultimate build out of eight cars?'",
        "'speaker_11': 'That's correct.'",
        "'speaker_6': 'So the airport did prepare for the ultimate build out already?'",
        "'speaker_11': 'We did. And we also built future proofed that stop so that there could be a people mover attached to their on the east entry on the east side as well.'",
        "'speaker_6': 'I don't know how you're going to get through the that the Xbox there but that's that's a whole other story. But the fact is that RTD is already running its MAX service to the airport. Is that not true?'",
        "'speaker_6': 'Because they are. They have started four car trains in within the past six months. The trains that run throughout the day are four car trains, not the two car trains that they open with. That is true.'",
        "'speaker_11': 'Correct.'",
        "'speaker_6': 'Okay. And the fact is that RTD built all the other station platforms along the line only to accommodate for cars. They did not build to eight car platforms.'",
        "'speaker_11': 'That's a great question for our team. And I know you're the resident outdoor expert. So I.'",
        "'speaker_6': 'I worked on the I worked on the project and yes, we built only four, four car platforms. It will take years before the airline is ready to handle eight car trains, but the airport already is preparing for that.'",
        "'speaker_6': 'The only other thing I wanted to bring out is that you mention a dedicated bus lane as part of this expansion. And I want to remind folks that expanding the highway is not just for single occupant vehicles. Busses use that.'",
        "'speaker_6': 'Not everybody that rides RTD rides the train. The the train, as I mentioned in our hour memorial. I'm sorry, in our testimonial. Councilman Lopez.'",
        "'speaker_0': 'Pardon me.'",
        "'speaker_6': 'Is the east is the east corridor and it serves from Union Station to the airport. But for folks going to from Boulder or from Commerce City, the A-line is probably not their transit of choice if they were to take transit.'",
        "'speaker_6': 'So we need to have that roadway prepared to accommodate multiple, multiple modes. And I would dare guess I don't have the figures, but I would dare to assert with the privilege of taking it back if somebody proved me wrong that Panya Boulevard is probably one of the most heavily mowed, split or mode shared streets in the metropolitan'",
        "'speaker_6': 'area. When you talk about the mountain shuttles, you have a ski area shuttles, the hotel shuttles, even the rental bus shuttles that only go to Jackson Gap. So expanding that roadway does help preserve the efficiency of our of our other modes other than single occupant vehicles.'",
        "'speaker_6': 'All that is true, correct?'",
        "'speaker_11': 'All of that is true.'",
        "'speaker_6': 'Okay. That's why. Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilman Brooks.'",
        "'speaker_8': 'You know what? I had a whole diatribe that I was going to try and get to. Council President, you got into most of the details that I want to do. And Rachel and I got a chance to talk earlier today.'",
        "'speaker_8': 'And and I would just say it was just an opportunity missed in committee when we were discussing this about outreach, about an analysis when we're talking about these type of things. And that's why we're here today. And I think if we can get to some of those commitments in the future, I think we're going to have a'",
        "'speaker_8': 'total different, you know, outcome, especially when it comes here to the floor. I think for for anyone in Denver who is just thinking that we're going to widen roads without an analysis of a multi-modal approach. Those days are gone.'",
        "'speaker_8': 'And so that's what we're we're doing and that's what you're hearing from the community. And I'm glad that where we are changing kind of the way we do business in the city.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. Rachel, I just wanted to ask a question about the area from Jackson Gap to I-70. That's a whole separate project that she has partnered with Dan on looking at how to address non airport traffic.'",
        "'speaker_10': 'Can you just sort of give us an update of number one where that's at in the process? And number two, that that will include an environmental impact statement, which is a whole community input process. That's part of that.'",
        "'speaker_10': 'Church.'",
        "'speaker_2': 'Hey, Councilman George Merritt with the airport. Thanks a lot. It's a great question. And your you're about on it. So now it's going back to Councilman Espinoza's question about why we're doing this part now versus the other part and to diversion of revenue in 2010, during a letter exchange that had to do with Tower Road on ramp'",
        "'speaker_2': 'going towards I-70. The FAA wrote us a letter and said a couple of things. One, you need to expand Panya Boulevard. Two, because now so much local traffic uses that you're no longer allowed to pay for it because it's a division of revenue.'",
        "'speaker_2': 'So we spent several years doing this analysis, and in 2016 we did a big lobbying effort. And what we worked out with the FAA was that from we basically.'",
        "'speaker_8': 'Bifurcated Penn Boulevard and from 472 I-70.'",
        "'speaker_2': 'We are now they have allowed us to pay for about 75% of the expansion and maintenance on that section of the highway. Pro-rated to our traffic on the road. So about 25% roughly. If you spread it out from 470 down, the.'",
        "'speaker_8': 'I-70.'",
        "'speaker_2': 'Is commuter traffic. This goes back to Penn Boulevard being, frankly, a unique roadway across the country.'",
        "'speaker_8': 'So we will at some point.'",
        "'speaker_0': 'Need some.'",
        "'speaker_2': 'Other funding to fill that 25% gap, be that highway grant, be that, you know, some other form of revenue. The FAA has said you can't pay for 100% of that. So that's where our partnership with Sit were with sit on.'",
        "'speaker_2': 'And Dr. Carr will come in when it comes time to do that. We first have to fill in that 25% gap for us to do that funding. We can pay for 100% of the work from 470 into the terminal because if you're that far down Penn Boulevard, you're coming to the airport and we can.'",
        "'speaker_0': 'Pay for 100% of that.'",
        "'speaker_10': 'Do we have Adams County committing to participate in that cost sharing with.'",
        "'speaker_8': 'You know, we passed.'",
        "'speaker_2': 'The hat and we you're not going to believe it. But it was a little a little reluctant to come forward with some with which.'",
        "'speaker_10': 'We know what percentage of that traffic comes back and forth from.'",
        "'speaker_2': 'ADAMS Our partners, you know, we serve the state of Colorado in the metro area, and that's that's part of the region. You know, we want to be driving this conversation not only in Denver. Right. But we are let's I mean, recognize where we are.'",
        "'speaker_2': 'We want to be able to to to help facilitate a conversation about mobility across the region. We are, you know, on the other side of a 25 square mile.'",
        "'speaker_8': 'Wildlife refuge from.'",
        "'speaker_2': 'Denver. And, you know, we are in a neighborhood with surrounded by Aurora and Commerce City and Brighton and Adams County. So, you know something.'",
        "'speaker_10': 'There. So the bottom line is we're not there yet in terms of having funding, being ready with any kind of project that is anywhere near an environmental impact statement for any potential expansion of Penn Boulevard from 472 I-70.'",
        "'speaker_11': 'We're not there.'",
        "'speaker_5': 'Okay. All right.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Ortega, Councilman Cashman, thank you for your patience. Do you have anything you'd like to propose?'",
        "'speaker_2': 'Yeah, just one last question. And if the people coming to and from the airport don't just come from the metro area, but all over the region, are you working with the mountain towns, I mean, other communities this spring shy and on how we might better utilize mass transit to to to and from those destinations.'",
        "'speaker_11': 'That's a great question. I don't know historically what the airport has done. I can say that is part of our conversation with RTD and Dr. COG in terms of how we're moving employees. We ran the zip codes for everybody that works at the airport to try and figure out where folks are coming from and what might be'",
        "'speaker_11': 'the best tool for them to get to and from the airport. And there are actually a lot of people that work at the airport that live up in the mountains, that live in Wyoming. And that opened the door to, you know, not only are there employees, but there are travelers, to your point, that may need different options'",
        "'speaker_11': '. And we've been having that conversation with Dr. COG, who actually has a lot of programs for getting folks from those areas to the airport. And so we're in ongoing conversations with Dr. COG about what the right fit for each community might be.'",
        "'speaker_2': 'Okay. And in full disclosure, you have agreed Dan has agreed to an ongoing substantive dialog with with the Street's partnership to continue digging into these critical issues of mobility.'",
        "'speaker_11': 'Absolutely. You know, Denver. Values our Denver Street Partnership's values. We think we're very much aligned. And and as I said, we welcome the opportunity to have more creative, smart people in the room as we try to tackle what are sometimes difficult and complex issues around mobility.'",
        "'speaker_2': 'All right. Thank you. Thank you, Mr. President.'"
    ],
    "A resolution approving a proposed Design Services Agreement between the City and County of Denver and RS&H, Inc. for professional design and engineering services. Approves a contract with RS&H, Inc. for $2,637,093.94 and for one year for professional design and engineering services including the redesign of Washington Street from East 47th Avenue to East 52nd Avenue, improvements along Washington Street from the South Platte River to East 47th Avenue and the Globeville Landing Pedestrian Bridge over the South Platte River as part of the Elevate Denver Bond Program in Council District 9 (201948451). The last regularly scheduled Council meeting within the 30-day review period is on 7-15-19. The Committee approved filing this item at its meeting on 4-2-19.": [
        "'speaker_1': 'All right. Thank you, Councilman Flynn. So that leaves to 96, if you can put that one up on our screens. Madam Secretary and Councilwoman Ortega, you had a comment or question on this comment.'",
        "'speaker_10': 'Go ahead. First of all, I want to thank Chris Pacheco and Tim Sanders for providing additional information on the cost sharing that actually is split among four different city entities, one of which is National Western that makes up this contract.'",
        "'speaker_10': 'And that's the piece that was not clear when this bill came forward that we've got Elevate Denver bond money, see IP dollars, National Western and wastewater funding that all makes up that one contract. And so I just want to thank Chris.'",
        "'speaker_10': 'I think you're still here in the audience for for sitting down and walking me through the map and the cost sharing. And I have no further questions on this. There is just one related to at some point asking council to have project updates on where we're at in the scope of the project.'",
        "'speaker_10': 'How far along are they and where are we with funding? Have we added new dollars? Have we used only the dollars that were built within those projects on plot to Park Hill and on the National Western Center? I think having those periodic updates to council is going to be important to just track how we're doing with them'",
        "'speaker_1': '. All right. Thank you, Councilman Ortega. That concludes the items we called out this evening. All bills are for introduction, are ordered published. We're now ready for the block vote on resolutions and bills on final consideration. Council members remember that this is a consent or block vote and you will need to vote.'"
    ],
    "A bill for an ordinance changing the zoning classification for 5231, 5301-5307, 5335 Leetsdale Drive, and 420 and 450 South Grape Street in Washington Virginia Vale. Approves an official map amendment to rezone properties from PUD 627 and B-3 Waivers and Conditions to E-CC-3 (planned development to urban edge, commercial corridor), located at 5231, 5301-5307, 5335 Leetsdale Drive and 420, 450 South Grape Street in Council District 5. The Committee approved filing this item at its meeting on 5-21-19.": [
        "'speaker_1': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilwoman Gilmore, will you please put Council Bill four for six on the floor?'",
        "'speaker_5': 'Yes, President Clark, I move that council bill 19 dash 0446 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved. Can I get a second? It has been moved and seconded. The required public hearing for Council Bill 446 is open. May we have the staff report?'",
        "'speaker_5': 'Good evening. Council President and council members. My name is Liz Waghorn with Community Planning and Development and this is an official map amendment application. Four 5231 5301 through 5307 5335 leads, dale drive and 420 and 450 South Grape Street from planned unit development 6 to 27 and B three with waivers and conditions to SCC three.'",
        "'speaker_5': 'The MAP Amendment is located in Council District five in the Washington, Virginia Vail neighborhood. It is located on along Lee's Dale Drive between Forest Street and Hudson Street on the North Side. It's approximately five acres and it's currently developed with two retail buildings and undeveloped land.'",
        "'speaker_5': 'As I mentioned, this is a rezoning from former Chapter 59 custom zoned districts to the SCC three district, and this is requested to facilitate redevelopment of the site with mixed uses. The requested zone district is in the urban edged neighborhood context.'",
        "'speaker_5': 'It is a commercial corridor that would allow up to three stories or 45 feet. This district allows for a mix of uses that's intended to balance the need for pedestrian, skilled, diverse areas with need needs for a convenient automobile access.'",
        "'speaker_5': 'It allows the general drive thru services and drive thru restaurant forms. The subject site shown here is currently zoned within former Chapter 59 and I'll go through the details of those. The surrounding properties are generally single unit to the north and then a mix of districts, commercial districts, residential districts and other custom districts along Leeds.'",
        "'speaker_5': 'Dell Drive the Putty, which is a large portion of the proposed parcel, was established in 2009. This was an update from a previous PD and a portion of the site is also zoned as B3, which is a commercial district in former Chapter 59 with waivers and conditions, and that dates back to 1998.'",
        "'speaker_5': 'Both districts generally allow commercial uses, but they specifically prohibit residential. They include setback requirements, use limitations, requirements for buffering and screening, and also a maximum heights in elevation. There is a large grade change that happens on the site from leads due to the north.'",
        "'speaker_5': 'There are portions of the PD that are not included in this application and they would remain empty. 627 Going forward. As I mentioned, the subject property is currently developed with retail and there is some undeveloped land there, single unit residential generally to the north and then a mix of retail office and residential along Leeds Dell Drive.'",
        "'speaker_5': 'This is an image of the site looking north where you can see the existing buildings on the site and these are images of those buildings. Here are some retail commercial and office uses to the east. Here you can see additional retail office uses along sorry to the west and then some of the residential use that are to'",
        "'speaker_5': 'the north along Dakota Avenue that the MAP Amendment went to the planning board on May 1st, where the planning board voted unanimously to recommend approval. Three members of the public spoke at that hearing, related very much to the public comments that I have listed on this slide.'",
        "'speaker_5': 'We had comments from to our nose in the area, the preservation of Residential South Hilltop Neighborhood Association and the Dakota Hills Homeowner's Association. Also, the Dakota Hills are now they have been working with the applicant over a couple of years now to establish a covenant agreement that would go along with this rezoning between the applicant and the'",
        "'speaker_5': 'neighborhood they were. That was still in process. Also when we brought this to the Land Use Transportation Infrastructure Committee, they have since come to an agreement that includes additional use limitations, a height in elevation for the site and set back requirements.'",
        "'speaker_5': 'And that agreement has been signed and we now have a letter of support from the Prishtina Neighborhood Association. In addition to that, we did receive two emails also in support of the application. I will go through the five review criteria that is set forth in the Denver zoning code for maximum applications, the first being consistency with adopted'",
        "'speaker_5': 'plans of which we have a comprehensive plan. 20:40 a.m..'",
        "'speaker_8': 'Blueprint.'",
        "'speaker_5': 'Denver We do find that the MAP amendment is consistent with our comprehensive 2040, a number of plan, guidance and strategies that we have around infill development, encouraging mixed use community communities, and putting infill development in places that have amenities and access to transit, which you do have long leads.'",
        "'speaker_5': 'Dale Drive Blueprint Denver calls out this area as the urban edge neighborhood context, which is predominantly residential and tends to act as a transition between urban and suburban areas. A commercial and mixed use development tends to be found along corridors, which is very consistent with what you see in this neighborhood.'",
        "'speaker_5': 'This area is called out as a community corridor and blueprint, which provides that mix of uses and a mix of larger and small scale buildings. In the urban edge context, particularly, some of them can be set back from the street to accommodate parking and it says its heights can be generally up to five stories that just to'",
        "'speaker_5': 'the proposed SCC three district is consistent with this. This is a commercial corridor district that would allow that mix of uses and particularly is called out in the intent as being appropriate along arterials such as leads to so leased out in Blueprint.'",
        "'speaker_5': 'Denver is also called out as the commercial arterial street. These are designed for a high amount of through movement and they typically contain commercial uses such as shopping centers along them. The blueprint over growth strategy says that generally in the city we should be directing our growth to community corridors with with them being anticipated to see 25%'",
        "'speaker_5': 'of new housing growth and 20% of new employment growth by 2040. And providing this growth in these centers and corridors increases access to amenities for alternative Denver rates. And this gives us makes us move closer to our goals for complete neighborhoods.'",
        "'speaker_5': 'The proposal rezoning that would allow for residential uses along with site is consistent with our growth strategy. CPD staff does also find that the proposed MAP amendment is consistent with the uniformity of district regulations or results, in that it would further our public health, safety and welfare by being consistent with our adopted plans and also bringing this'",
        "'speaker_5': 'site into use by the modern zoning code regulations that are in the Denver zoning code. The application calls out changed and changing conditions for justifying circumstance, specifically that this site remains in former Chapter 59 zoning and this rezoning would bring it into the Denver zoning code.'",
        "'speaker_5': 'So we do find that to be an appropriate justifying circumstance. Lastly, we find that the proposed amendment is consistent with the neighborhood context zone, district purpose and intent. As I describe the urban neighborhood, urban edge neighborhood context primarily has single and two unit residential uses and that commercial uses a mixed use are generally around local arterial and'",
        "'speaker_5': 'main streets of the commercial corridor district specifically are intended to ensure that new development contributes positively to neighborhood character and improves that transition between commercial development in adjacent residential areas. And specifically the SCC three district is intended for arterial street corridors and again that is what we have a long leads do.'",
        "'speaker_5': 'So with that, CPD recommends approval based on finding that all review criteria have been met.'",
        "'speaker_1': 'Thank you very much. We do have four individuals signed up to speak this evening, so if you signed up to speak on this item, I'll ask if you can come up to the front bench here and if you make some room for them to come up here so that we can get through everybody.'",
        "'speaker_1': 'So when your name is called, step right up and your time will start. First up is Grant Nelson.'",
        "'speaker_0': 'Good evening, members of Council. My name is Grant Nelson and with Republic Investment Group here. On behalf of the applicants, the applicant in this property is 226 Monroe. It is local family. Paula Arnold and her son Ken Arnold are the owners of this property.'",
        "'speaker_0': 'They originally purchased the property to move their businesses to the property, and she currently operates a business that her and her family have operated in Denver since 1947 on the property. So they did not start out to be real estate developers or owners.'",
        "'speaker_0': 'In this case, they bought one property to build a building on. Determined it wasn't a great property to build a building on. The natural grocery building came for sale so they bought that to move her business into and it's always a good idea if you owned properties on either side to the one in the middle as well'",
        "'speaker_0': '. So they ended up buying the one in the middle to make sure that they can control their own destiny. They have been working for the last couple of years on this rezoning, and we've been working hard with the neighbors, Brad and the the parishioner we've met with for the last couple of years.'",
        "'speaker_0': 'We have a signed neighborhood agreement here on behalf of the Arnolds. And if you have any questions, I'd be happy to answer them. Thank you.'",
        "'speaker_1': 'Thank you very much. Next up, Jesse Pearce.'",
        "'speaker_13': 'Jesse Pierce represented for Denver Homicide, Low Black Star Action Moment for self defense and positive commitment for social change. And I was on top of the ballot for City Council. While large this past May 2019 election, I got almost 15,000 votes with no money.'",
        "'speaker_13': 'I'm neither for or against this. I thought this was going to be another rezoning for a more gentrification that's rapidly happening throughout this city. This previous speaker just confirmed that that is not the case and that these people are just looking to relocate their business.'",
        "'speaker_13': 'So I made a four against it. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Brad Yoshimoto who?'",
        "'speaker_0': 'Thank you. Good evening, City Council. My name is Brad Yoshimi two 5300 East Dakota Avenue. And I am the president of Krishna, the R.A., which was formed in 1996. Our boundaries are. Alameda to the north. Lee still to the south.'",
        "'speaker_0': 'Holly to the east and Delta to the west. My speech will be brief this evening in the. Because of the time limit and because I know you guys are busy this evening, but person has been negotiating, like Grant said, for about a year and a half now.'",
        "'speaker_0': 'And we recently came to an agreement. We've signed a restrictive covenant agreement with the applicant a couple of weeks ago, and I'm here today on behalf of personnel to officially support the rezoning. We want to thank the applicant for their willingness to work with us throughout the process and address some of our major concerns.'",
        "'speaker_0': 'We believe that this restrictive covenant agreement gives us some of the protections we had under the current zoning, including height, restrictions, setbacks and uses. In the interest of time. There are other board members here, but I will be the only one speaking tonight.'",
        "'speaker_0': 'I have Monica Hess, who was also part of the negotiations, as well as Jane Broda. They are both on the board as well. I'd also like to thank Mary Beth Susman for her direction and communication throughout the process and application and want to thank her for her years of service.'",
        "'speaker_0': 'We are hopeful that this rezoning will bring good, thorough and productive development that we can. Welcome to our neighborhood. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_3': 'The German so-called black star movement. Self-defense. We support this zoning change and we want to salute Councilwoman Sussman for her outstanding leadership and getting this thing done over a two year period. Now, that requires perseverance and commitment to getting this thing done.'",
        "'speaker_3': 'And with the approval of the neighborhood organizations, we feel confident that there will be a what's. Organization that would monitor this so that as things happen and things changes over the course of projects such as this, the intent and essence of the project that this council will approve tonight will not be altered anyway.'",
        "'speaker_3': 'Significantly, that will put the neighborhood in a jeopardizing position of principal. So congratulations for the hard work. And this is how the partnership between community organizations and developers work, where we create a win win situation and the possibilities where you have adversarial relationship between developers and neighborhood are minimized and that we can move forward because there is'",
        "'speaker_3': 'life after development. Thank you very much.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Are there any questions from members of Council on this item? Councilman Espinosa.'",
        "'speaker_8': 'One question for the prisoner representative and one question for CPD for staff. Let's do the shift to the staff. Can you explain the Graves Street address?'",
        "'speaker_5': 'There was a formerly a street there sometime ago that was vacated at some point that the addresses still remain along, that.'",
        "'speaker_8': 'You didn't actually connect north?'",
        "'speaker_5': 'It does not connect currently.'",
        "'speaker_8': 'Yeah, I didn't see that. All right. Thanks. On the so to the representative for the association. Do you know if your restrictive covenant has two signatories? Is it just the owner or is the owner and your your organization?'",
        "'speaker_0': 'It's the owner and the organization both. Yes.'",
        "'speaker_8': 'Terrific. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Councilman Ortega.'",
        "'speaker_10': 'Thank you. Mr. President, I am not sure. Probably someone from staff, if you can answer. So under the previous zoning, the limit was five storeys. So we now have a covenant on the property. What is that? Restrict it to.'",
        "'speaker_5': 'The. So the previous zoning. Actually, there were two height limits. One with the PD 627 was an elevation in height. So it wasn't a storeys piece but a specific elevation. And then the B3 with waivers and conditions had a maximum of two stories, 39 feet, and also an elevation with that piece.'",
        "'speaker_5': 'So the the new zone district would allow 45 feet and three stories. And I believe that the the covenant that the applicant and the neighborhood has agreed to is 5410. Correct. That's the elevation height, which is approximately equal to about the the fence line of the houses at the top of the hill.'",
        "'speaker_10': 'And does that height include the all the mechanical on on top of the structure as well?'",
        "'speaker_5': 'So the agreement limits those to nine feet. Okay. Generally, by zoning, they could get up to 12 feet for certain types of like the elevator overrun in those types of mechanical pieces. Great.'",
        "'speaker_10': 'I have no further questions. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. All right, see no other questions. The public hearing for comfortable four, four, six is closed. Comments by members of Council Councilwoman Sussman.'",
        "'speaker_12': 'Thank you, Mr. President. This was a rather complicated piece of property because of the unusual topography that it had, the the extreme elevation from street level to the neighborhood just above it. And I just want to congratulate first the neighborhoods who worked so hard with the with the project, who who had to, along with me, understand that'",
        "'speaker_12': 'the previous zoning was about elevation and not storeys. And if the elevation changed, how did the stories change? It wasn't an easy sort of project to understand. But I also want to thank the family that wants to do something with this property and do something that I think is very valuable to the city and to the neighborhood'",
        "'speaker_12': 'and still maintains the beauty of the person and neighborhood. Well, I won't recommend that everybody go there because then you'd have a whole bunch of traffic. But it's a it's a beautiful, beautiful neighborhood. And thank you. Thank you so much for all the work you did.'",
        "'speaker_12': 'I'm almost two years of back and forth ing between all of the neighborhoods, and I'm pleased that we could reach that, that you all could reach an agreement about, well, what will work there. And I urge my fellow council members to vote yes for this.'",
        "'speaker_1': 'Thank you, Councilwoman Sussman. Seeing no other comments. Madam Secretary.'",
        "'speaker_5': 'Raquel Sussman. Hi. Black. Hi.'",
        "'speaker_8': 'Brooks Hi.'",
        "'speaker_5': 'Espinosa, I.'",
        "'speaker_0': 'Flynt II.'",
        "'speaker_7': 'The Fillmore Herndon Cashier.'",
        "'speaker_5': 'I can teach Lopez.'",
        "'speaker_7': 'I knew Ortega, I. Mr. President.'",
        "'speaker_1': 'I am secretary. Please, cause the voting in those results.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4230 Elati Street in Globeville. Approves an official map amendment to rezone property from I-A UO-2 and I-A to C-RX-8 (industrial to urban center, residential mixed-use), located at 4230 Elati Street in Council District 9. The Committee approved filing this item at its meeting on 5-14-19.": [
        "'speaker_7': '11.'",
        "'speaker_1': '811 are as comfortable. Four, four, six has passed. Councilman Gilmore, will you please put Council Bill 448 on the floor?'",
        "'speaker_5': 'Yes, President. Clerk, I move that council bill 0448 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. The required public hearing for Constable four for eight is open. May we have the staff report?'",
        "'speaker_5': 'Good evening. I'm Courtney Livingston with Community Planning and Development. This is the rezoning 442303 excuse me, L.A. Street. It's rezoning from IAU to district to CRC district. It is in Council District nine in the Globeville neighborhood, and it's located at the in the 41st and Fox station area at the corner of 42nd and LRT Street.'",
        "'speaker_5': 'The site is about 36, a little under three, 36,000 square feet in size. It's currently used as a storage area. The requesting Teresa on the property to facilitate redevelopment. The current zoning, as I said, is IAU two, i.e. is a light industrial district.'",
        "'speaker_5': 'The use of two is a billboard use overlay. With this application, they are proposing to remove the billboard use overlay and the surrounding properties in the area generally are the light industrial with the billboard use overlay Xerox eight and C-Max 20.'",
        "'speaker_5': 'So it's used as industrial. Right now you have industrial uses to the north east, you have some residential and industrial uses also to the south and west. The building forming scale. Here's some photos of the existing site. You'll see that on the left here.'",
        "'speaker_5': 'And then the photos to the east or this or the right to that are the surrounding properties. In terms of process, the this went to planning board on May 1st and it was unanimously approved public comment. We received three letters of support.'",
        "'speaker_5': 'Those are in your packets to from nearby property owners. The applicant did reach out and met with Globeville Cares and Fox Street Business Association and received verbal support from those Arnaud's. So review criteria, as you know, the Denver zoning code requires and for a council to approve the rezoning that the five zoning code review criteria are met'",
        "'speaker_5': 'first with the consistency with adopted plans, there are four adopted plans that apply to this rezoning the Comprehensive Plan 2040 Blueprint, Denver, the 41st and Fox Station Area Plan, and the Globeville Neighborhood Plan Comprehensive Plan 2040. There are multiple goals that all support this rezoning very mentally resilient, strong, authentic neighborhoods, all encouraging quality infill development that is'",
        "'speaker_5': 'consistent with the surrounding neighborhood offers where services are already in place. Next will move to Blueprint Denver the recently adopted there four different things in blueprint Denver that we take a look at the context, the place, street types and the growth strategy.'",
        "'speaker_5': 'First, with the neighborhood context, it's currently mapped as the urban center neighborhood context. The requested zone district is consistent with Blueprint Denver as it is within the urban center context. Next Blueprint Denver Future Places. This is shown as high, medium residential mixed uses, including multi-unit.'",
        "'speaker_5': 'Residential heights are generally up to eight storeys. There's a high lot coverage and shallow setbacks in the Blueprint. Denver Future Street Types. We have 44th Avenue to the north as a mixed use cluster and then Fox Avenue, Fox Street to the west as also serving the site.'",
        "'speaker_5': 'In terms of the growth strategy blueprint, Denver shows this as a high and medium high residential area and the downtown and urban center context. That means citywide we can anticipate to see about 30% of new housing growth and 5% of new employment growth.'",
        "'speaker_5': 'Next, we move on to the 41st and Fox station area plan that was adopted by council in 2009. It's shown in this plan as proposed open space. However, there is a note saying that parks are conceptually shown on the land use plan and the actual locations are not determined.'",
        "'speaker_5': 'Future park space in the station area require working with private property owners, parks and recreation and developing funding partnerships. That said, we took guidance from the more recently adopted Globeville plan showing a urban residential. That definition is also in the 41st and Fox stationary plan.'",
        "'speaker_5': 'Those are aligned and it's intended for those two plans to be aligned. The urban residential is intended for to date stories, new moderate density neighborhoods, providing a range of housing, types of about support, pedestrian shopping and employment base.'",
        "'speaker_5': 'Next, moving on to the Globeville neighborhood plan. Like I said, that was adopted in 2014. The kinds of land use for this parcel is shown as the urban residential. That's the 2 to 8 storeys in height. And it's intended to be consistent with the 41st and Fox station area plan.'",
        "'speaker_5': 'It talks about being a diverse, transit supportive, environmentally sustainable urban center in this area. It also talks about creating a broad base of new jobs in diverse economic centers sectors by redevelopment opportunities throughout the neighborhood. The zero eight would all help support these goals.'",
        "'speaker_5': 'Next, we'll move on to the second through five review criteria uniformity of district regulations. The request is consistent that in terms of furthering public health, safety and welfare, it implements adaptive plans. It helps re facilitate redevelopment in a station area.'",
        "'speaker_5': 'The justifying circumstances the application. The application notes for change or changing conditions? Well, we see the recently adopted plans investment in the area. Also the G line that came in just recently came on board. Those are all appropriate justifying circumstances for this rezoning.'",
        "'speaker_5': 'Consistency with neighborhood context, zone, district purpose and intent. The zero eight zone district applies to residentially dominated areas served primarily by arterial streets where building scale of tree stories is desired. This site is, like we said before, being served by those two collective streets and it is within the 2 to 8 story range.'",
        "'speaker_5': 'So we feel that that is consistent with the neighborhood context zone, district purposes intent. That said, CPD recommends approval based on finding all review criteria have been met. Thank you.'",
        "'speaker_1': 'Thank you very much. We have three individuals signed up to speak this evening on this item. First up is Megan Jones.'",
        "'speaker_11': 'Good evening. I'm Megan Jones. I'm an unincorporated Adams County resident. And thank you very much for the presentation and I'm available for questions.'",
        "'speaker_1': 'Thank you. And next up, Chairman Sekou.'",
        "'speaker_0': 'Do. Excuse.'",
        "'speaker_3': 'Chairman Sekou Black saw some movement for self-defense. Upon hearing and looking at the. Thirdly, you know, I got some questions about this thing. Now looking at the area, it could use some residential development. No question about it. And if we're going to obey stories, this becomes housing for who and who can afford it.'",
        "'speaker_3': 'Not affordable housing, because in this area is also underdeveloped. And you have a large pocket of poor people there who need housing. And are they going to be able to afford to be able to live in their neighborhood?'",
        "'speaker_3': 'And with the look in terms of actual economic viability, we're looking at a place that had a lot of industrial use in it. And I ain't heard nothing about the cleanup that's been done up there in terms of the soil to invite families to live up in that.'",
        "'speaker_3': 'And so I need some clarification about those tests and what is actually happening. And if that's a requirement of the pre-development and the plan, then we need to look at some stuff here. Because once you approve this, then it's own.'",
        "'speaker_3': 'And from looking at the public comment that was involved in this thing, this has been an ongoing kind of issue for that area. And so not to cast aspersions on the intent or what people are working toward to make this happen.'",
        "'speaker_3': 'I would suggest that we postpone this and put this back in the committee to take another look at this thing, because there's some gaps in this, some serious gaps in this, and there are some serious questions on those questions leads to other questions and other questions.'",
        "'speaker_3': 'And now we're road ball in this thing. And so I'm neither opposed to it nor am I for it. I just need some further qualifications. If we can get that from you guys, then I'd appreciate some help. You'd like to come up here?'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'That's it. Thank you. Next up, Jesse Pierce.'",
        "'speaker_13': 'Just the pairs represented for Denver Homicide allow black socks movement for self defense and positive action committed for social change. And I was on top of the ballot this past May 2019 election for city council, where a large, almost 50,000 votes with no money.'",
        "'speaker_13': 'We are in favor of this rezoning for the exact reason that was stated previously. We have a housing crisis in the city. We need at least 26,000 homes built to even attempt to address this housing need. In this whole election campaign, we were told we can do better.'",
        "'speaker_13': 'So if we can do better, I would like to see the council do better and actually create attainable housing that people can actually afford in the city and county of Denver. Not affordable, but attainable. That means RMR levels between zero and 30%.'",
        "'speaker_13': 'So my question was, what is the RMR level for this rezoning? Do you even know? And who is going to occupy this space? Because this neighborhood has been neglected. Globeville, along with the area, and Swansea has been neglected for years by this city.'",
        "'speaker_13': 'Now all of a sudden it's become an opportunity zone and there's all this development coming to an area that is not even built infrastructure wise for it. So I want to know what is the RMR level for this and who is going to reside at this?'",
        "'speaker_13': 'Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Are there any questions from members of council tells me just another.'",
        "'speaker_8': 'Question for staff. What are the two local and I mean the two collectors and all articles that serve this?'",
        "'speaker_5': 'That would be Fox Street to the West and then 44th to the north. That's about a block and a half to the north of the fourth, and that's a block west would be Fox Street. And I apologize. My recovering from an illness and laryngitis over the weekend.'",
        "'speaker_8': 'So where is CPD or public works with the team. Yeah ideas the parking maximums or the limits that they're talking about on on on this section and it's.'",
        "'speaker_10': 'Called the next step.'",
        "'speaker_5': 'Study.'",
        "'speaker_8': 'Is that. Yes. Part of.'",
        "'speaker_5': 'The yes. So then the 41st and Fox area next step study is fully underway right now and it's anticipated to be completed by 2020. And with the parking overlay that was determined to be either, you know, started to take a look at at during the 41st and Fox next step study but really to let that process go'",
        "'speaker_5': 'through and then after that process dove back into the parking overlay potential. But we need to see what comes out of that next step. Next step study from the 41st and Fox area plan in that they're looking at the infrastructure there.'",
        "'speaker_8': 'How was the the how was this reconciled in the in the Globeville neighborhood plan, the fact that there was, you know, considerable promotion of toward a more dense urban redevelopment of this area. But the limitations that are with those two collectors that you've identified as being those streets that would carry all the vehicular traffic that would do'",
        "'speaker_8': 'it this this new density would would support what are there? Did there were there other solutions that were contemplated.'",
        "'speaker_5': 'For the Globeville? CLINTON Well, we do have the the transit stop, which is like 1000 feet away. So there's we have right now to with the the public works rules and regulations that are in place with the traffic study requirements for the site development plan process that in tandem with transportation demand management strategies help with the congestion'",
        "'speaker_5': 'in the area, but also the proximity to 41st and Fox station area was heavily leaned upon within the Globeville area plan.'",
        "'speaker_8': 'See, that's what's sort of tough here, right, is the criteria requires us to contemplate its proximity to these arterials and and collectors, not to commuter rail. So to talk about commuter rail and is not part of the criteria, is it?'",
        "'speaker_8': 'Is it.'",
        "'speaker_5': 'The criteria? No, but it is served by those essentially because the close proximity, they can essentially, you know, be considered to be served by.'",
        "'speaker_8': 'Okay, I'm worried because it's a bit of a slippery slope to justify rezonings and we've done it already previously, as you can look at the map and see that justify this level of intensity, intense re mean entitlement when it isn't directly served by local mean by a collectors or arterials and but then we already know that those'",
        "'speaker_8': 'collectors and arterials are potentially going to be overburdened to the point where we would actually cap the ability to to bring cars into this area. And so it seems odd to me that we would sort of put our head in the sand about those realities of infrastructure.'",
        "'speaker_8': 'And and and they make that leap continue to make that leap and say, well, this meets the criteria when we have these deficiencies. And and I'm I'm somewhat perplexed that your answer to the parking overlay is that it will now be kicked down the road for the next step study because, you know, at some point I need'",
        "'speaker_8': 'the confidence that we have. We're considering how the infrastructure marries itself with the land use, because what we're not doing right now is is developing anything out there according to plan. In four years of major rezonings in this area, we have yet to see any outcomes that are consistent with these adopted plans.'",
        "'speaker_8': 'So should we be continuing rezoning to the to this degree and adding entitlement when when we might need to to pull back some other infrastructure? I mean, other other aspects of the regulations that are currently allowed. I mean, you are contemplating right now reductions in an entitlement with regard to parking or or changes in entitlement.'",
        "'speaker_8': 'As part of the next subsidies. Are you.'",
        "'speaker_0': 'Or are you.'",
        "'speaker_5': 'The scope of the next steps? Are you? Yeah. Yes, I'm I'm not 100% sure, but I do believe that it looks at the infrastructure at a high level. I'm not sure to what extent it really will be covering parking in depth like.'",
        "'speaker_5': 'So we.'",
        "'speaker_8': 'Postponed a parking overlay, Mr..'",
        "'speaker_0': 'President.'",
        "'speaker_8': 'Yeah. So we postpone, you know, can answers real quick. They are looking at parking demand management and this will be completed at the end of 2020, much further ahead than anyone could get entitlements to build anything at this site here.'",
        "'speaker_8': 'Much further. So parking demands, the infrastructure investment that we're talking about will all be in place prior to any development that this could that could happen at this site that we are proving right now to like. So within the next eight months.'",
        "'speaker_8': 'Yes. She said it will be completed in 2020. Okay. I'm sort of, again, having to put a lot of faith that somehow we're going to be addressing the infrastructure problems. If we if I'm going to overlook the fact that the arterials and collectors that service this area are, in fact already overburdened and couldn't withstand the maximum level'",
        "'speaker_8': 'of development of the existing entitlement, let alone the planned entitlement of this area. All right. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa, Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. So my question first is, do you have a number of how many zoning we've done in this area to date?'",
        "'speaker_5': 'Um. I don't. I'm not off the top of my head. No. Okay.'",
        "'speaker_10': 'I, I mean, I can count at least 8 to 10 that have come before this body, which have all been asking for significant density increases. And that includes the 43 acres over at the Denver Post site. Can you tell me if every developer coming in asking for density increases are being asked to financially participate in the next'",
        "'speaker_10': 'step study and to be part of the solutions that will come out of that.'",
        "'speaker_5': 'What I do have to say is that with the public works, the rules and regulations that they have to do a not only a traffic impact study for before they get out of concept for their site development plan, but also a transportation demand management plan in order to contribute to that.'",
        "'speaker_5': 'The next step study is fully funded and underway. Here's here's the.'",
        "'speaker_8': 'Problem, Mr. President.'",
        "'speaker_0': 'Can I just add.'",
        "'speaker_10': 'I cannot finish.'",
        "'speaker_8': 'I've answered a question for you real quick. So there have we we did ask the developer to pay into the next step study. And so there are folks who are paying into that. And we'd be happy to give you a breakdown of this study as well, because we wanted to make sure, like you said, Councilman, that we'",
        "'speaker_8': 'have developers making sure that they're invested into this project.'",
        "'speaker_10': 'So so part of the issue with this area of town is. We should not be looking at 44th Avenue as a collector road into this site, because what you're going to do is exacerbate all of the traffic problems for the Globeville neighborhood, because that's exactly where it's going to put them, is right in front of Garden Place'",
        "'speaker_10': 'elementary school to get, you know, on and off at Washington Street or to use Lincoln Street. And my concern is that we're we're looking at this where we're continuing to change the zoning and increase the density or, as Councilman Espinosa said, the entitlements.'",
        "'speaker_10': 'But we haven't addressed any of the infrastructures on the front end. We're waiting till the back end after we do all these rezonings. And the expectation is we, the taxpayers, will be looking at how to solve the problem.'",
        "'speaker_10': 'So, for example, we've got CDOT doing the next step study. I mean, I'm sorry, the health study on 25, but it does not include this particular interchange at 38, Fox, I-25 and Park Avenue. And that interchange is what traffic coming out of downtown is going to have to go through to get into this site.'",
        "'speaker_10': 'So there's just that one road and I guess. For us to be asked to continue to change the zoning without addressing any of the infrastructure issues. And this is part of the problem with the changes that happened with zoning.'",
        "'speaker_1': 'Gentlemen, I just want to check, make sure your saw in questions and you can you can more than we're going to do this in comments or we're taking questions now. Okay. Get you back in the queue for comment.'",
        "'speaker_10': 'Yeah, I asked my two questions. Okay.'",
        "'speaker_1': 'Thank you. All right. Seeing no other questions. The public hearing for counsel, four for eight is closed. Comments by members of Council Countryman Brooks.'",
        "'speaker_8': 'Hey, thank you, Mr. President. Appreciate it. This rezoning is in my district. And I just want to say a couple of things. This is at 41st and Fox. Many people call this Fox Island. If you've not been there, I would encourage you to go into this neighborhood is very interesting.'",
        "'speaker_8': 'There is only one way in, one way out of a road. And it's it's problematic. There are some issues. We have never put the kind of mobility focused investment in that we're putting in right now. Now, there's no dollars committed at the city, and I think there should be some concerned over that.'",
        "'speaker_8': 'But there is a lot of effort from CBD and public works to actually put the vision together. I've been a part of that. I really encourage council people who are, you know, worried about this area to be a part of the conversations.'",
        "'speaker_8': 'Because right now the regulations and the ask of what we're asking from developers to put into this place is being formed and put together. The other thing that we're looking at here is a transportation demand management system, which I think is really important.'",
        "'speaker_8': 'And we have a lot of developers pushing back and we need community folks. We need council folks at the table saying this We can no longer over park these developments. We've got to make sure we got a multi billion dollar rail system that's right across the street that we're not even using.'",
        "'speaker_8': 'And so demand management means and parking demands means you can only park your building to a certain ratio. And so that's what we're looking at. We hope to have that that all done. Well, I won't be doing it, but the city hopes to have it all done by 2020.'",
        "'speaker_8': 'That kind of like going to January 2020. And I think that's going to be a very important process for everyone to be a part of saying that understanding that this rezoning is in this area. I will also say this.'",
        "'speaker_8': 'We have resolved a lot. I was just in this area a week ago and it's really interesting. I've never seen so many rezonings and no cranes and no construction. For whatever reason, the market has not come to this location yet.'",
        "'speaker_8': 'The only construction is the RTD construction that was built and now the train is work is running, which is great, but there has not been some construction. So all of the fear that we're going to overbuilt, I think you don't have a market to build it just yet.'",
        "'speaker_8': 'So what we need to do is make sure that we have a robust demand management system that the private sector pays for, that the public sector invest in, so we can move forward. Mr. President, because this rezoning particular rezoning meets the criteria, I will be supportive.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_10': 'Thank you, Mr. President. So as I was saying earlier, you know, this particular area is problematic because of the fact that there is one access into the site that's off of Fox Avenue. You then have 44th Avenue that goes to the Globeville neighborhood, which is a two lane road with no pedestrian walkway.'",
        "'speaker_10': 'Although we do have kids who live on this side of I-25 that that walk along 44th Avenue to Garden Place Elementary School. There is a project to put sidewalks along this bridge, but right now they're not there. The I-25 Pal study is really critical to this area, and it doesn't go this far because major changes to that'",
        "'speaker_10': 'interchange need to happen to be able to figure out how we move traffic through this particular area. You have a baseball game letting out and if it rains, traffic is going to back up into downtown because anybody trying to go into north Denver can't go through because that underpass floods.'",
        "'speaker_10': 'We have a serious flooding problem in this area. It's the Utah Junction outfall. And Councilman Brooks, we've been engaged in ongoing conversations with the North Denver Cornerstone Collaborative with. Chris, who's our team person. My concern when we talk about parking maximums, which is what the overlay is, is discussing.'",
        "'speaker_10': 'My concern for anybody rezoning in this area is, you know, if it's if it's first in all, those folks are going to want their parking and whoever wants that cap happens. Anybody else wanting to do their development, if it's already been capped, a bank isn't going to finance a project without any parking.'",
        "'speaker_10': 'And and so these are some realities that we deal with in in the development world. And so I don't know that we're creating unrealistic entitlements or expectations by continuing to put the highest concentration of high density development in this small geographical area that only has this one road in and out.'",
        "'speaker_10': 'And so I don't think that we're adequately addressing.'",
        "'speaker_5': 'The the.'",
        "'speaker_10': 'Health, safety, welfare of the community that we're encouraging by, you know, by by rezoning all of these properties to be in this area, by not addressing all of the infrastructure as part of the big picture. I know early on there were discussions about a road that would connect over to the Sunnyside neighborhood.'",
        "'speaker_10': 'I've heard as as early as today that that may not happen. Now, that was going to provide a different access point for people trying to get in and out of this area. And we don't know what the next step study is going to recommend at this point in time.'",
        "'speaker_10': 'So we're continuing to add to the volume of density that's going to be in this area without knowing how the infrastructure issues are going to be addressed. And that's that's a fatal flaw in how we're doing zoning these days because.'",
        "'speaker_10': 'We don't we don't know how that stuff is going to be worked out. And I mean, I think we need to go back and look at making some changes to our zoning code that allow city council to see the level of detail that helps us to fully understand what we are proving, that ensures that we're addressing the'",
        "'speaker_10': 'health, safety and welfare of of a community. So, you know, I know we've done a number of zoning in this area, but I'm not comfortable continuing to increase the densities and the zoning where we. We just don't have the pieces to the puzzle all figured out.'",
        "'speaker_10': 'So I'm not going to be supporting this one tonight, and I will continue to be involved with the folks working on the next step study and insert our input. We have been involved in those meetings through through my office and hopefully we'll find some some of the right solutions that can ensure that the people who will be'",
        "'speaker_10': 'living in this area once all this development happens, can move in and out without putting their lives at risk, because we're going to have, you know, more cars in this area. So thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Espinosa.'",
        "'speaker_8': 'It won't be the first time I will have opposed an hour x eight in this general vicinity. I had one on Jason Street, so it's two blocks on my side of the railroad tracks and it's served by the same arterial and in fact, it's you could argue it served.'",
        "'speaker_8': 'It's better serve because it's somewhat proximate to pacos. But the criteria is is is pretty clear that it has to, you know, ideally, I mean, these things need to be served by arterials and collectors. And what we know about Fox Island is that the roads that do serve it are taxed, which is why there's these other conversations'",
        "'speaker_8': '. So it's I, I for 1 a.m. not at all surprised by the complete lack of redevelopment on Fox Island. I have said it at least three times and I'm going to say it a fourth time. At least now that this is a mexican standoff.'",
        "'speaker_8': 'What is happening over there is people are gaming, are plans to cash in, and when they cash in, they suck dollars out of Denver and community. What they have right now is a industrial zoning which doesn't allow them to build one single residential unit on that property.'",
        "'speaker_8': 'But now they would get eight stories of redevelopment for potential going, zero setback on all four sides of their property. And for that, it's a $1,000 fee for one acre of property. And so what do you do when you grant that much entitlement for $1,000 plus the time that you've taken as you've created an opportunity for that'",
        "'speaker_8': 'person to sell that land, to flip that land for way more money than they bought it for. And when they take those rights and sell those rights, they siphon money out of the project. That could go into better design, into affordability, into the infrastructure needs of this community.'",
        "'speaker_8': 'And we don't have a process right now, but it clearly we're having a conversation about how to do that in the future when we should have done it a long time ago. We've been we spent millions of dollars on that rail.'",
        "'speaker_8': 'But guess what? The rail is not part of our criteria when considering rezonings, and that is stupid. There should be zone districts specifically for Tio D's that do three things. They have minimum development requirements. You have to go up over a certain height.'",
        "'speaker_8': 'You have to have ground floor activation where appropriate. You have to have better street standards. Streetscape standards. Actually, there's a fourth. And you have to encourage mode shift. You you you put those parking maximums on there or you make no parking.'",
        "'speaker_8': 'You you tell them that there is no possibility that you can put parking in your project. But the emphasis has to be. Use that rail. We spent millions already of your taxpayer dollars. We don't have that. So we are not on a collector.'",
        "'speaker_8': 'We're not on an arterial. We are against three local streets, LRT. Fourth and third. We are on an island that is poorly served by existing roads that do collect those locals. And so until the city. Well, for as long as I'm on council I will be voting no on further rezonings.'",
        "'speaker_8': 'That and this is you know you can say I'm pre-meditated or presume whatever this stupid word is that the lawyers don't like that, but I'm not worried about it for obvious reasons there. This is a call to the city that we need to get out of the business of granting entitlement when we have too much development entitlement'",
        "'speaker_8': 'right now in this city that we could capture all the growth that we need in the available square footage that we could develop. And that if we're going to emphasize re you know, if we want to see the outcomes in our plans, we have to codify those outcomes in our regulations so those don't exist here.'",
        "'speaker_8': 'I have been a mixed bag on prior rezonings on Fox Island. I have voted both for and against for a whole host of reasons. But this one this far away from the rail station, this far away from local.'",
        "'speaker_8': 'I mean, for collectors and arterials that are taxed to the point where we don't know how we're going to ever capture the growth that we're that we that we've planned for. This area tells me that we need a solution to our transit infrastructure before we go further with any intensified entitlement.'",
        "'speaker_8': 'So with that, I'll be voting no.'",
        "'speaker_1': 'Thank you, Councilman Espinosa, seeing no other comments on this item, Madam Secretary, recall.'",
        "'speaker_5': 'Black eye.'",
        "'speaker_7': 'Brooks Espinosa.'",
        "'speaker_5': 'No. Flynn I. Gilmore, i.'",
        "'speaker_0': 'Herndon, I.'",
        "'speaker_7': 'Cashman. PANITCH.'",
        "'speaker_0': 'Lopez All right.'",
        "'speaker_5': 'Ortega No. Assessment. I.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_1': 'All right. I'm secretary. Please close the voting. Announce the results.'",
        "'speaker_7': '9 hours, three days.'"
    ],
    "A bill for an ordinance relating to the Denver Zoning Code and Denver Revised Municipal Code, replacing the current GDP process with a suite of plan implementation tools.  Approves text amendment #4 to the Denver Zoning Code and the Denver Revised Municipal Code (DRMC) to revise the General Development Plan process and standards. The Committee approved filing this item at its meeting on 5-21-19.": [
        "'speaker_1': 'Nine days. Three Neighbors Council bill four for eight has passed. Councilman Lopez, before we jump into the next hearing, I understand that we have a special guest in the chambers. Would you like to recognize our guest?'",
        "'speaker_0': 'Yeah, we do. Congressman, if you want to stand, I wanted to recognize Congressman Tony Cardenas from California here to visit and was.'",
        "'speaker_1': 'Stopped by the.'",
        "'speaker_0': 'Council chambers. You never know when you have a member of Congress. And so he might have a list to hand to you to help our delegation. Well, welcome. Welcome, Congressman. He's also a former L.A. City councilman.'",
        "'speaker_1': 'And I think one of the is a juvenile justice and crime prevention.'",
        "'speaker_0': 'You know, community based gang intervention model, nationally renowned, comes from Mr. Cardenas, who implemented it in California. So thank you. Welcome to the Denver City Council.'",
        "'speaker_1': 'CHAMBERS That's welcome. All right, Councilwoman Gilmore, will you please be accountable for nine four on the floor?'",
        "'speaker_5': 'Yes, President Clark, I move that council bill 0494 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Public hearing for council bill 494 is open. May we have the staff report?'",
        "'speaker_14': 'Thank you. So Jeff Hurt with training, planning and development. So I'm here to present on a council action item to for Tex Amendment number four to revise the general development plan processes and standards. So I'm going to walk through what a general development plan is briefly and then get into sort of the current practice within the city'",
        "'speaker_14': 'agencies to kind of address some of the deficiencies actually we've had with GDPs. And we're looking to fix as part of this process and then get into a summary of the proposed changes and then the analysis of the TEX Amendment decision making criteria.'",
        "'speaker_14': 'Okay. So what is a GDP? So a GDP is a coordinating multi departmental process that's been in place since the 1990s to address large development sites. These are typically applicant driven projects with a final deliverable of a high level conceptual site plan that addresses oftentimes infrastructure open space, sometimes land use issues, design issues, things like that.'",
        "'speaker_14': 'But it is a high level conceptual site plan. The process does require one public meeting that's an applicant led public meeting and a planning board public hearing. And the planning board actually recommends to the Development Review Committee, which is an administrative body of the Executive Directors of planning, public works and parks.'",
        "'speaker_14': 'Um, no, city council does not see these. So there's no City Council approval required for GDP. And that's important for a number of reasons here. And so the typical process is well over a year for getting the GDP approved.'",
        "'speaker_14': 'So the current zoning code process and flowchart format and a very high level is that essentially as we get these development proposals that come to the city, there's an evaluation against a number of factors as to whether or not the GDP would be the appropriate tool to use.'",
        "'speaker_14': 'One factor is whether or not it's over ten acres, but we do have GDP's under ten acres. So there's actually a whole host of factors looking at whether or not we need sort of this enhanced coordinated infrastructure for this these large redevelopment sites.'",
        "'speaker_14': 'But if the answer is no to that question of whether or not it needs a GDP, then there's certainly the option to go into other regulatory processes site plan, subdivision, for example. But if the answer is yes, then you get into the GDP process where you're preparing that high level conceptual site plan, and then we're looking to'",
        "'speaker_14': 'sequence in and build in the rezoning and other entitlements with the GDP. I mean, each one is really different. So some of the good outcomes from these again, these have been in place for for several years now since the 1990s.'",
        "'speaker_14': 'The process does foster looking at shared solutions across different city agencies. For these large projects, you often have competing objectives, so fosters kind of that dialog across those objectives. It is through the GDP process, one of the few places in our zoning code where we get open space.'",
        "'speaker_14': 'So there is a minimum 10% set aside for open space. Talk about that and looking to carry that forward. And there also is at least an opportunity for community input on the project and awareness that development is happening in the neighborhood through this GDP process.'",
        "'speaker_14': 'So some of the problems with the GDP process at a high level are one. And I think the biggest issue we've identified through our assessment over the last couple of years, even further back, is that we've used the GDP tool both for planning and plan implementation, which has been problematic for a number of reasons.'",
        "'speaker_14': 'The GDP tool isn't really built to have a robust community dialog and engagement when you're talking about community visioning and establishing land use policy for a neighborhood with a one sort of check, the box applicant led public meeting and city council not seeing these.'",
        "'speaker_14': 'So the system isn't really set up well for planning, but we have used it for planning where there's been absence of a plan, but simultaneously we've used it as a plan implementation tool, which is more getting into the technical site planning exercise.'",
        "'speaker_14': 'So trying to do both of those things simultaneously, not particularly effective that either. And then I'll highlight some of the other issues with GDP's, which is that they either go too far or not far enough. And what I mean by that is in terms of not far enough, like I said, it doesn't have city council approval.'",
        "'speaker_14': 'It's very conceptual and high level. So it doesn't it doesn't actually have a lot of regulatory weight or teeth to it in its approval. Yet there's kind of an expectation or a perception from community members and others that it does.'",
        "'speaker_14': 'So it doesn't go far enough in the sense of giving it actual teeth to implement through subsequent development entitlements. But then it also goes too far because we're asking of the community and of the customer and of the city a lot of time and money and resources going into preparing a bunch of detailed technical studies and site'",
        "'speaker_14': 'plans with really limited assurances at the end of the day in terms of like a zoning entitlement or something like that. Again, the GDP itself doesn't have a lot of weight yet. We're. Having folks do this before they're getting those entitlements in a lot of cases.'",
        "'speaker_14': 'And then also to highlight, we are getting mixed open space outcomes from that 10%. And that's one thing we're looking to address with this tax amendment. Okay. So the current practice to address some of these issues, so this is a lot of this is processes that the city has put into place over the last several years to'",
        "'speaker_14': 'address some of these issues while we do more a holistic fix to this GDP process. One I'll highlight when we need to gain consensus on a community planning visioning process. We're not using the GDP tool anymore. We're initiating a city led process that leads to a city council adopted plan.'",
        "'speaker_14': 'So no more GDPs for planning, at least in terms of current practice. And then bullet point to when we need that technical site planning exercise for coordinated infrastructure analysis. We're not using the GDP tool for that either. We're using the infrastructure master plan tool.'",
        "'speaker_14': 'So so part of this text amendment to codify that tool. And then third, we need assurances. So that means development agreements, other tools to achieve community benefits. We're not using the GDP tool. We're using the rezoning or the subdivision tool.'",
        "'speaker_14': 'Those have more regulatory weight than the GDP does. Okay. So second of three flowcharts to warn you. So the current practice that I kind of explain there in flowchart format and a lot of this is we're looking to codify with this text amendment in terms of a best practices as these developments come in the door today, we're'",
        "'speaker_14': 'asking the one of the first questions is, does it need a rezoning? If the answer is no, we have pretty limited ability to require a process more kind of a robust process that looks at the project. So the answer is typically, if the rezoning, if there is not a rezoning needed, there's the option for an applicant to'",
        "'speaker_14': 'move into another process like a site planning process under their current zoning. And that's one of the issues we're looking to address here. But if the answer is yes that the project needs a rezoning, then there is the evaluation that's being done.'",
        "'speaker_14': 'You know, in terms of what the City Council adopted plan guidance is for the site and whether or not we need that coordinated infrastructure. And I'll highlight a couple of scenarios here. Just highlighting kind of the current best practice we're looking to codify here in cases where there is a rezoning needed and we don't have that planning'",
        "'speaker_14': 'guidance, which is a good chunk of the city, we are working with developers to see the value in doing a planning process first before we're getting into the rezoning of the site planning. So that's Loreto Heights, for example, Stadium District.'",
        "'speaker_14': 'And then in cases where they do need a rezoning, but there is a plan in place, we're already doing a lot of this in terms of our current practice of trying to sequence these things. And so this LDA tool codifies our ability to do this.'",
        "'speaker_14': 'And so the summary of the changes to the zoning code, and this is at a high level and happy to drill down on any of these topics, of course change. One is that we're replacing general development plans going forward with the large development review tool.'",
        "'speaker_14': 'So what that means is that the current GDP's on the books today so these there's 28 of them stay intact as is and can have minor deviations and amendments done to them. But for new projects going forward, they're more of a clean slate.'",
        "'speaker_14': 'We would not use the GDP tool for those. We would use the LDR tool or the infrastructure master plan tool depending on the scenario. But so topic two or change two, and this is really the big difference between the LDR and the GDP, that the LDR process is more a it is a process framework as opposed to'",
        "'speaker_14': 'the GDP, which is a process and a set of plans. So the elders, a process framework that includes a menu of tools that right sizes the project to get to site development. And I'll talk in the next sort of flowchart how that would work in process.'",
        "'speaker_14': 'But essentially it's a documentation of the process going forward to tee up some of these conversations in this dialog and this coordination earlier in the process before plans are drawn up, before rezonings happen. So we have the opportunity to have these more robust conversations earlier in the process, a third to carry forward the community meeting that was'",
        "'speaker_14': 'a part of the GDP. But clarify a few things on that front. One, that it happens earlier in the process and then also to clarify the conduct of that meeting city staff and applicant roles and to have that happen actually before an application is even submitted for an LDR and then forth to better calibrate the thresholds for'",
        "'speaker_14': 'when this process was required. So lowering the threshold from ten acres under the current GDP world to five acres. But important to note, there are a whole host of other factors that are built into this bill that make it a little tighter in terms of what is when an LDR would be required.'",
        "'speaker_14': 'And we could talk a little bit about that decision making process as well. We can drill down on that and then last to codify the infrastructure master plan tool, which is a tool recurrent. Using with a number of different sites.'",
        "'speaker_14': 'But this tech summit would codify that as sort of an enhanced site planning tool. Okay. So here's the sort of flowchart. And I think it's easier to understand the the text, the movement through this lens. But essentially how this new tool would work is that once we get a large development proposal submitted, there would be an evaluation'",
        "'speaker_14': 'done between city agencies. So this is a big change from the current state, whereas under the GDPR world, the CPD manager has the sole authority to decide if the GDPR is required or not. Under this new world, it would be a joint decision across parks, planning and public works.'",
        "'speaker_14': 'Looking at all those factors the size, the need for coordinated infrastructure, again, we can drill down under those factors. And so all this happens at the pre-application phase of these developments. And essentially what happens is within 30 days and this is codified within 30 days of the PRE-APPLICATION meeting, the applicant, the city informs the applicant in writing'",
        "'speaker_14': 'if LDR is required based on those factors. If the answer is no, there's the option for the applicant to move into other regulatory processes, like a site plan, for example. If the answer is yes, a lot happens in this step right here.'",
        "'speaker_14': 'But if the answer is yes, there's an interagency convening that happens built into this bill where we look at infrastructure, open space, affordable housing design, stormwater, all these things that we want to get a more sort of coordinated, holistic look and look at specific, more specific projects earlier in their development process.'",
        "'speaker_14': 'And so part of that dialog is a preliminary determination of what the scope of the large development review is going to be. So what types of infrastructure, coordination and study do we need? And the big question that's asked at this phase is whether or not there is a city council adopted plan that addresses the site.'",
        "'speaker_14': 'And there's language built in to address that. I'm happy to talk about looking at as part of this preliminary stage, again, looking at, you know, what sort of community benefits are articulated in an adopted plan that we would look to address with the site.'",
        "'speaker_14': 'What are the tools that get us there? How do we sequence these tools? So a lot that happens in here in terms of figuring out what the process is going forward. And then sort of the next step after that is having the community information meeting and then and then the application actually can't be submitted until after the'",
        "'speaker_14': 'community information meeting. And then looking at the bottom of this flowchart here, just highlighting a couple scenarios of what the outcome of this process would be. It's essentially a documentation of the process going forward and the major asks from the city and the sequencing of entitlements.'",
        "'speaker_14': 'So it's not a tool we currently have today to kind of frontload the coordination. But the idea is, you know, some looking at, for example, one of the one of the most challenging scenarios would be when we have laser pointer here, when we have a situation where there's no adopted plan guidance addressing the site, a rezoning is'",
        "'speaker_14': 'needed. A scenario could be that the outcome of this LDR process is a documentation of what that planning process needs to be first before going into rezoning and site planning. This is what's happening again with Loretto Heights and Stadium District.'",
        "'speaker_14': 'And so this would codify the ability to have that structure. And we'll go to the other scenarios. But it's really about the sequencing and the process going forward, not about what the zoning should be or what the standards are, but just figuring out what the process is going forward.'",
        "'speaker_14': 'So getting into the open space changes. So like I said, we are carrying forward the current 10% minimum open space requirements from the GDP, but we are enhancing what qualifies to better address what's publicly accessible, usable and providing a community benefit.'",
        "'speaker_14': 'So I'm happy to talk about what those design standards look like and the specifics behind that. And this is the visual to scale of of what the new requirements look like. So importantly, in a field I mentioned in the last slide, we are lowering the threshold from ten acres to meet that 10% to five acres.'",
        "'speaker_14': 'And that's what this looks like to scale in a couple of typical Denver blocks. And so I won't go through the examples scenarios in detail, but it is helpful to look at real projects and how this would have played out.'",
        "'speaker_14': 'So Loreto Heights, for example, would have been subject to this LDR process if it would have came in after this bill. And I think the outcomes would have been really similar in terms of requiring a planning process. First is City Council adopted planning process before getting into the other entitlements.'",
        "'speaker_14': 'And there was South Sloan's Lake. That's an interesting example where the outcomes may have been different. If they were to come in under this new bill. And we would have asked that question of whether or not there is clear and sufficient adopted planning guidance that addresses the site and addresses what they want to do.'",
        "'speaker_14': 'The answer probably would have been no, and that looking at the West Colfax plan, potentially needing to amend that plan before getting to site development. So the outcome would have been probably a little different with South Sloan's Lake and would have fostered that planning process a little better.'",
        "'speaker_14': 'So the process for this text amendment and we did have a GP working group that was a pretty diverse group of community members, designers, developers. We did go to ANC Zoning and planning committee twice with the proposal that's before you today.'",
        "'speaker_14': 'And we did initiate communications to affected projects starting back in March. So many, many projects were notified of this that were in the pipeline in terms of active site plans, active rezonings. We did receive three public comments on the bill.'",
        "'speaker_14': 'One, supporting this is at a high level, paraphrasing them, but support for the community information meeting and the notification behind that. And then second to support that this process has for a general deference to the city council adopted planning process as the best planning process as opposed to the GDP.'",
        "'speaker_14': 'And then lastly, concerns about using citywide policies. So Blueprint Denver specifically in lieu of small area plan policies as part of this tool and happy to talk about those comments. And so the the actual hearing process has led us to the public hearing tonight planning order to recommend approval unanimously of the bill on May 1st.'",
        "'speaker_14': 'And I will note that we have supplemental rules and regulations that accompany this bill to clarify certain things. We are working with a handful of stakeholders over the next couple of weeks and in in advance actually of planning, board, public hearing on the rules and regulations next week to clarify some some decision points within the LDR process'",
        "'speaker_14': 'to provide a little more predictability. So we are working with a handful of property owners to provide that a little more clarity through the rules and regulations of what's already in the bill. So I'll go through the criteria for text amendments.'",
        "'speaker_14': 'And this is a citywide text amendment, so only citywide policies apply in the analysis. So in terms of campaign 2040, certainly more details cited in the staff report. But there is a number of policies in the comp plan related to coordination and collaboration across city agencies to achieve greater impact or collective impact that this bill certainly supports'",
        "'speaker_14': '. And then some policies related to enhanced public spaces that this bill also does. And so related to Blueprint Denver policies, there's actually a policy in there in support explicitly of doing this very project. So it is in support of that.'",
        "'speaker_14': 'And then also some policies related to outdoor public spaces, which this bill again fosters. Criteria to further public health, safety and welfare of staff to find the tax amendment consistent with that criteria because it will implement adopted plan policies also will improve predictability by having this more front ended coordination and communication both for the community and the'",
        "'speaker_14': 'applicant and and and for the city as well. And then lastly, improve public welfare by promoting more public open spaces. And then last, regarding a uniformity of district regulation, staff does find the TEX amendment consistent with that criteria because it would treat projects equally across the board in terms of these procedures and standards.'",
        "'speaker_14': 'So staff does recommend approval of the Tex amendment and I'm happy to answer any questions.'",
        "'speaker_1': 'Thank you very much. We have five individuals signed up to speak on this item this evening. So if you can make your way up to this frontbench, I'll call you up when I say your name. Go ahead and step up to the microphone and your time will start.'",
        "'speaker_1': 'First up, Chernobyl.'",
        "'speaker_14': 'Good evening, counsel.'",
        "'speaker_8': 'My name is Joel Noble.'",
        "'speaker_14': 'I live at 2705 Stout Street.'",
        "'speaker_8': 'I'm here speaking in my individual capacity alone. I served on the GDP Working Group from 2014 on. It's taken quite a while to get to this point, but that GDP working group came about because of a lot of concern about how some GDPs were working out.'",
        "'speaker_8': 'GDP as a tool over time.'",
        "'speaker_14': 'Became kind of schizophrenic.'",
        "'speaker_0': 'Sometimes it was used as intended.'",
        "'speaker_1': 'As a infrastructure.'",
        "'speaker_8': 'Development tool. Where are the pipes going to go? Where the building is going to go, where the roads is going to go? And it was reasonable for that to be applicant led to be very technical. It was reasonable.'",
        "'speaker_8': 'But in areas where we had a large redevelopment opportunity in the city and not enough plan guidance, too often the tool was used to substitute for plan guidance where there was no blueprint. Denver of course, everywhere, but maybe nothing else.'",
        "'speaker_8': 'Or maybe the neighborhood plan wasn't terribly clear. It set up neighbors in opposition to the property owners in competing for what the vision would be rather than how we know our process is supposed to work.'",
        "'speaker_0': 'Have a city led neighborhood plan process.'",
        "'speaker_8': 'Or master plan process is happening at Loreto Heights, some adopted plan. So the large development review process fixes that. CPD did the first part of the fix some time ago by directing infrastructure work to use an infrastructure master plan, an infrastructure master plan tool that can not be confused for trying to set vision.'",
        "'speaker_8': 'And they've been doing that a lot, but it took a long time to really understand how extensive of a fix was it going to take to make what had been.'",
        "'speaker_0': 'GDP a very important idea. When we have big redevelopment spaces.'",
        "'speaker_8': 'We have to treat them with more care.'",
        "'speaker_14': 'We have to treat them with more.'",
        "'speaker_8': 'Involvement in planning.'",
        "'speaker_0': 'And we have to ask for.'",
        "'speaker_8': 'What we want, like open space, how to preserve those things. And I think they've landed in a really good place with large development review. Essentially, this is a framework, is not a new planning document, but it's a framework to stop at the beginning and say.'",
        "'speaker_0': 'Where are we?'",
        "'speaker_8': 'Where do we need to go? And what of our existing tools are going to take us there? Do you need to amend that existing plan? Do you need a new plan like Loreto Heights? Do you have all the planning guidance you need?'",
        "'speaker_8': 'You can go right to infrastructure planning, but that level setting of given where we are, what are the steps that are needed is the output of this large development review document. It's a minimal, sane, inclusive approach and I encourage your support.'",
        "'speaker_1': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_13': 'Jesse Paris represented for Denver Home a sellout black star. So moving for self defense and positive commitment for social change. And I was on top of the ballot for our lodge this past May 2019 election. Almost 15,000 votes with no money.'",
        "'speaker_13': 'We are neither for or against this. We just wanted to know exactly what this all entailed, this general development plan, because there's been multiple projects with these developments that we, the public, has not been notified all the details of these development plans.'",
        "'speaker_13': 'So I'm glad that we're getting to some kind of clarification in regards to this. I just wanted to know if this general development plan also included opportunity zones and exclusionary zones for housing. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Jessica Liza de.'",
        "'speaker_5': 'Good evening, members of Council. I'm Jessica Leeds today with Fairfield and Woods on behalf of Bbf Gateway, its principals John Fair, Brew Berkeley and 64th and Tower Partners LLC. My clients have been part of discussions with landowners of a large portion of the far northeast area and stand to be significantly impacted by the potential text amendments.'",
        "'speaker_5': 'I will point out that they were not specifically included in the outreach process, but I will say that we're supportive generally of the replacement of the confusing and confounding GDP process. So thank goodness for clarity. However, we are not entirely comfortable because we have not been involved with the broad nature of the language.'",
        "'speaker_5': 'We have been working over the last few days closely with staff and with legal to try and work through those concerns. And generally, I think we have gotten to a place where there's a comfort level. So but for the record, I do staff has made it clear that they as you heard from them, then they're going to'",
        "'speaker_5': 'work with some stakeholders. We would be some of those stakeholders to continue in that out the process and to provide more clarity, more definition in the areas that we're where we believe the language is broader, where it's open to too broad of an interpretation.'",
        "'speaker_5': 'However, I do want to commit those three areas to the record. The first is the broad scope of staff discretion in determining how and when the LDR process applies, and more objective criteria in the reconciliation of the proposed text and then the gateway rules.'",
        "'speaker_5': 'How does all of that work together? And the last is open space and the requirements for open space. And then how does all that work together? So lots to work out. But there is one area I would implore you that cannot be reconciled with the text as you have it in front of you, just one.'",
        "'speaker_5': 'And that is the requirement for a public easement over private open space, and that is a public easement over private land. And that works in many cases, but it does not work in one exception, and that is multi-family housing.'",
        "'speaker_5': 'And the reason for that, there are two. So there are concerns that if you have an interior courtyard or there are areas that are be counting towards open space, it does not work for affordable housing purposes. So the land use restriction agreements don't allow that.'",
        "'speaker_5': 'We also believe that there are so it would impede affordable housing and it also has Kiawah Common Interest Ownership Act implications. We ask for a simple text amendment easy fix. All you have to change is the word from ciao to May, and it would then allow us to work with staff to refine that.'",
        "'speaker_5': 'It only applies through the same rules and regulations you're asking us to follow. In the case of multi-family housing. I thank you.'",
        "'speaker_1': 'Thank you. Next up, David Smith.'",
        "'speaker_8': 'Hi. My name is David Smith. I live at 1770 Chestnut.'",
        "'speaker_0': 'I have worked in the real estate development community for a couple of different.'",
        "'speaker_8': 'Firms here in Denver. But I'm speaking in capacity as a private citizen. I'm in support of replacing the.'",
        "'speaker_14': 'GDP ban in a number of.'",
        "'speaker_8': 'Meetings with stakeholders, both in the business sector.'",
        "'speaker_14': 'And industry groups.'",
        "'speaker_0': 'We have the current from them.'",
        "'speaker_8': 'As a project under way. We've embraced the LDP process, we've submitted required documents.'",
        "'speaker_0': 'We're working through staff through the process. I think it's well thought out.'",
        "'speaker_14': 'It's more defined.'",
        "'speaker_8': 'It reduces uncertainty if you're on a developer in the development sector and it streamlines.'",
        "'speaker_14': 'Communication between departments.'",
        "'speaker_0': 'Stephanie An improvement over the GDP.'",
        "'speaker_8': 'We are optimistic about the process and I would encourage staff to support it.'",
        "'speaker_1': 'Thank you very much. Next up, Chairman Scoop.'",
        "'speaker_3': 'Yes. Chairman Sekou likes to ask movement of self-defense. You know, I'm sitting here and I'm looking at this. And first thing popped in my mind is, what does this got to do with poor people? What's got to do with us.'",
        "'speaker_3': 'If you have these issues about open space and you've got an existing camping ban that doesn't allow poor people to occupy open space without being harassed by the residents. Was this. Meet us. And as taxpayers who spent our last dime the city sales taxes, we get none of this.'",
        "'speaker_3': 'Where's our protection in all this? That we can occupy open space without being harassed by neighbors who don't want to see poor people in that neighborhood? Who adversely call because poor people are present and then accuse them of doing dope deals or whatever.'",
        "'speaker_3': 'And then we get aroused by the police just sitting in the park. It was like, What is this? Where's our protection? That and all of this? And then you got a loophole in there. If all of this don't work, then, well, we've got other ways of going about getting this thing done through other legislative processes.'",
        "'speaker_3': 'What is that process that would allow you to get away with all of this and go outside of this? Well, you got to know the process that was on your first grade. What is that all about? How can you get out of this once you approve it?'",
        "'speaker_3': 'There's a loophole in the game. What is it? It was not explained in the process of looking at this mess. So somebody explain to me, how do you get around this in other judicial processes? And who is that to appease?'",
        "'speaker_3': 'So we could stop the charade. For real. Cause all you've got is another layer on top of another layer on top of another layer on top of another layer. That gives poor people no say so. No power whatsoever.'",
        "'speaker_3': 'To determine the outcome, because when we come to the meetings, we're outnumbered is a democratic process. And most of the notifications that you give to people coming to these meetings are never given to the service providers of the port to inform us about the meeting.'",
        "'speaker_3': 'So we looked at the look. Now tell me I'm not.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Are there any questions for members of Council on this item? Council meeting each.'",
        "'speaker_9': 'Thank you, Mr. President. Jeff, can I ask a question? So the comprehensive plan and blueprint were being discussed throughout the same time that this process was happening and have now been adopted. And so your slides talk a little bit about conformance, but the plans make many, many references to the importance of examining the equity aspects of large'",
        "'speaker_9': 'potential rezonings or upswings and thinking about displacement risks. There's a whole bunch of planned support around that and I was disappointed to see the slides really didn't make any mention of how this process thought about the equity issues and how this process might be connected to them.'",
        "'speaker_9': 'You and I have spent many meetings talking about the topic, but the slides really didn't talk about it. So I'm going to give you the opportunity to fill in the blanks a little bit about other than open space, how does this process improve our ability to look at those topics?'",
        "'speaker_14': 'Yeah, that's fair and that's an oversight. So so the process improvement addresses a number of equity policies from the current planning blueprint, mostly with regards to so you have the citywide equity policies and the neighborhood specific equity policies.'",
        "'speaker_14': 'But in terms of citywide equity policies, this process enhances our ability to tee up those conversations at the front end of the development process, more so than what we have today. So the idea behind this process is to convene all of these groups at the front end, one of which would be economic development and affordable housing folks'",
        "'speaker_14': ', to bring them at the table, to have discussions about what sort of policies they want to look to implement, and looking at it in comparison to open space and infrastructure and balancing all those needs. So at a high level, this process was a much better job of teeing up those issues so that we can have that infused'",
        "'speaker_14': 'at the front end of the process as opposed to when it's too late in the game, you know, at a rezoning or a site planning stage. So at a high level, at the citywide level, it does that. And then the process is also designed to look at specific neighborhood planning guidance where you would hope you would have'",
        "'speaker_14': 'that more granular addressing of the equity policies on a neighborhood level. So that's related to affordable housing, but also related to local business, you know, local business issues, fostering local businesses, things like that. This process, again, tees up the ability to have those discussions earlier in the process in terms of the overall text amendment.'",
        "'speaker_14': 'And it's sort of how it lined up with blueprint and comp plan. This was well underway while that was well underway. So the expectation going forward certainly is that what we're putting in place now a more sort of robust template for analyzing each text amendment against all equity policies.'",
        "'speaker_14': 'This didn't get that level of analysis because of the timing, but you're absolutely correct that it was an oversight to not highlight that in the slides, but that at a high level is how we see this implementing equity policies by teeing up the conversation earlier, recognizing that it's going to be neighborhood specific, but at least enabling that'",
        "'speaker_14': 'conversation much better across these agencies, which doesn't really happen today necessarily.'",
        "'speaker_9': 'Yeah. I want to ask if you can follow up with a little more detail on that. So there's like what the policy sets as a framework, but a lot of this depends on how things operate within the city.'",
        "'speaker_9': 'So can you talk more about the different approach that the departments are taking with regard to making sure that housing is at the table at the same time that these other departments that historically have always been at the table.'",
        "'speaker_9': 'So Parks has always been at the table, CPD has always been at the table. But can you talk specifically about how that's happening differently?'",
        "'speaker_14': 'Yeah, I mean, in some of it is is in the text, the memo, in the rules and regs in terms of who we do referrals to and all that stuff. But a lot of it is sort of institutionalizing interagency processes.'",
        "'speaker_14': 'So for example, right now we are setting up a working group of people that would meet on a recurring basis to evaluate these projects as they come in. And that group is not just Parks, Public Works and planning.'",
        "'speaker_14': 'It includes representatives from Dito on the affordable housing front and also the equity front. In terms of the NEST group, they're embedded in this as well as you just had a meeting this morning with them about community benefits agreements and so things like that, teeing up those conversations.'",
        "'speaker_14': 'So we're putting in place the staff interagency structure so that those folks are at the table on a recurring basis. And it's a regular thing where they're always at the table as opposed to just sort of leaving it to chance.'",
        "'speaker_14': 'If wherever you're sort of project case manager is to be proactive and do that kind of outreach.'",
        "'speaker_0': 'So we're.'",
        "'speaker_14': 'You know, some of us in, in the text amendment bill, a lot of it is in institutionalizing city practices that we're going to certainly share.'",
        "'speaker_9': 'Great. Can you just clarify for me made passing reference? There are some references in the text amendment and some in. The rules and regs. I read the whole text amendment. I did not read the rules and regs. So is Dito as a department.'",
        "'speaker_9': 'Obviously the name will change, so we'll have to go back and fix it. But is the Housing Department or whatever it will eventually be called, called out by name in one of the policy documents?'",
        "'speaker_14': 'Yes. Yes, it is. And the rules and regs as its current name or it's it says in parentheses or as future TV names or, you know, sort of the name can change. And so in the rules and regs, they're they're called out as a referral agency specifically.'",
        "'speaker_14': 'But in the text amendment itself, I mean, there's some language we did our best to put language in there related to our evaluation of community benefits that are achievable. So we did add that in in the last iteration of the bill.'",
        "'speaker_9': 'Thank you for being responsive to that feedback along the way.'",
        "'speaker_1': 'Thank you, Councilwoman Kennedy. Councilman Black.'",
        "'speaker_11': 'Thank you, Mr. President.'",
        "'speaker_5': 'I have two questions. So one that Jessica brought up about.'",
        "'speaker_12': 'Open space.'",
        "'speaker_5': 'That would be a courtyard within a development.'",
        "'speaker_11': 'Will that count as open space?'",
        "'speaker_14': 'So it depends. It could. It has to be. There's a lot of language that goes with it. But if it's contiguous and accessible to a public street via a public access easement or similar mechanism, and it's fully visible from the street and there's some graphics to support that.'",
        "'speaker_14': 'So it would count if it qualifies. So so the idea of a courtyard being tucked behind, you know, an L-shaped building that you would never know exists as you're walking down the street that would not qualify or is not supposed to qualify under this bill, but something that, you know, maybe as a passageway from the street that's'",
        "'speaker_14': 'publicly accessible and has no permanent barriers, that leads to a courtyard that you could see and know that it's there. If you're a member of the public, that would count. That's the intent. And we did our best to put specific language to require that in the bill.'",
        "'speaker_5': 'And so the intent is for the public to see it and to be able to use it.'",
        "'speaker_14': 'Correct.'",
        "'speaker_5': 'Okay. And then I had a question about and specifically to all GDP's.'",
        "'speaker_11': 'In my district, for example, they're both the light rail.'",
        "'speaker_5': 'Stations, and so they're in the old code. And so is there anything that would happen to trigger repealing those.'",
        "'speaker_11': 'And then.'",
        "'speaker_5': 'Creating in.'",
        "'speaker_11': 'The. Ah. So if someone wanted to rezone.'",
        "'speaker_5': 'Part of the land or all of the property.'",
        "'speaker_11': 'In the GDP. Would that trigger the.'",
        "'speaker_5': 'LDR and move us into the new code?'",
        "'speaker_14': 'So if if so, if these are old code GDPs, they can stay in the old code world in terms of the GDP. So the GDP amendment process and all the standards of the old code stay intact and stay locked in.'",
        "'speaker_14': 'It's only if they wanted to reason into the new code and it meets all the factors in terms of the size and the need for coordination and all that. Would we even flag it for whether or not an LDR would be required?'",
        "'speaker_14': 'So I mean, all I can say is that each case will be different, but we'll have systems in place where we'll flag these developments to ask the question of whether or not an LDR would benefit, you know, the customer, the city and the community.'",
        "'speaker_14': 'And so and then we look closely at those factors to see. But one trigger, though, is if they are in the new code. So if they re zone to the new code and needed to do a major amendment to the GP, that's a potential trigger to come into the LDR process as a factor.'",
        "'speaker_14': 'But nothing is really a given. There's just a whole suite of factors we would look at.'",
        "'speaker_5': 'Yeah. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman by Councilman Ortega.'",
        "'speaker_10': 'Hi. I have a few questions as well. Can you highlight the criteria of what would throw somebody into a large development review? I know you talked about the ten acres going to five acres, but, you know, one of the speakers talked about concern for staff discretion.'",
        "'speaker_10': 'So what is the very clear cut criteria that that defines what would throw somebody into this process?'",
        "'speaker_14': 'Yes, it's a good question. So so at a high level, we we generally I know this is an answering question yet, but we carried for the GDP applicability language. So we we mirrored in a lot of ways in terms of the host of factors.'",
        "'speaker_14': 'And so those include but are not limited to changes to the arterial or collector street grid and changes to regional stormwater systems. And then some more blanket statements that the issues with the development can't be resolved through other regulatory processes.'",
        "'speaker_14': 'So there's a whole host of factors in addition to that acreage metric. What we what we did to improve on that decision making process and tightening it up from GDPs is we said instead of the CPD manager having the sole authority to make that determination, it's a joint decision of the DRC.'",
        "'speaker_14': 'That's one thing. Another thing we did to kind of tighten up that piece of it was to eliminate language where in the current GDP world that the project is phased or has multiple owners. It could be subject to a GDP, which is a really massive universe of projects, and you consider that most of them really have that'",
        "'speaker_14': 'of any scale. So those are a few examples of how we carried forward the GDP applicability language and tighten it up a bit. And there's certainly other factors in there. Like, for example, if an adopted plan calls for an LDR GDP.'",
        "'speaker_14': 'So if you have a neighborhood plan that says for this site or for this area, consider using this tool to better coordinate development and infrastructure. That could be another factor or another trigger. So I'm not setting all of them, but I think that's a good chunk of them.'",
        "'speaker_10': 'That's helpful. Can you speak to how issues like development that will be within a close proximity to railroad will be addressed as part of this new process? Looking at offsite infrastructure issues, I'm thinking about, you know, the development where we're going to have the football stadium parking lot, the Sun Valley neighborhood, 13th Avenue is a major, you'",
        "'speaker_10': 'know, arterial connector that will bring people from downtown over to that area. And I could see this one being where there's some cost sharing on improvements so that the expectation is that it's not just all, you know, general fund, public works dollars, taking care of the improvements needed.'",
        "'speaker_10': 'How would something like that fit in to the general development review process?'",
        "'speaker_14': 'So to your first question about the freight, so this process would certainly improve from the current state in terms of fostering that dialog with those stakeholders early on. So so the benefit of this process through that lens is that as opposed to the rezoning process, for example, as we are looking at a general development concept as part'",
        "'speaker_14': 'of this ADR process. So we have a sense of what's being proposed there and so that we can start to coordinate as needed if there is freight rail implications, for example, with the right stakeholders on that front to kind of get ahead of that as opposed to waiting maybe too late in the game.'",
        "'speaker_14': 'So I guess that's the quick answer to the first question. The second question is, I think also to emphasize that we're we're making an improvement over the current process in terms of our ability to coordinate across large sites for infrastructure analysis.'",
        "'speaker_14': 'And so you're referring to the Stadium District area. We're actually starting the LDR process or some version of it depending on, you know, obviously the bill tonight to address that site for those very reasons, which is the need to to look at infrastructure on a bigger scale, you know, and to get a sense of what the overall'",
        "'speaker_14': 'development concept will be in the overall development program so that we can calibrate the infrastructure better within that development area and including potentially adjacent areas and integrating with those like river miles and things like that. So I guess at a high level for for for kind of both questions, it's an improvement over our current process in terms'",
        "'speaker_14': 'of our ability to not in every case. I mean, it certainly has to meet all the criteria and the factors for a large development review, but all give us much more strength to be able to coordinate all of that across larger sites.'",
        "'speaker_10': 'So just to take it a step further, just looking at that area of the city that is proposed to have some pretty large scale development, we know Federal Boulevard is one of the adjacent corridors that is being proposed to have some improvements to address pedestrian safety issues.'",
        "'speaker_10': 'Potentially a whole rerouting of, you know, or upgrades at the Cloverleaf. Could this be an example of where there's some, I don't know, overlap in in as part of the large development review sort of urging partnering with CDOT, for example, or the city of Denver, who's also involved in work like that along the Federal Boulevard corridor.'",
        "'speaker_14': 'Yeah, I, I don't know specifically how that's going to play out, but I know like in that case of Stadium District that we're using this ADR process to ask that very question, which is not something we currently have today, the ability to kind of probe on that.'",
        "'speaker_14': 'So all I can say is that those discussions are actually happening on that site through the LCR process. So we've kind of already been using it to to get out some of those issues, recognizing there's parallel infrastructure issues going on through the Cloverleaf on Federal Boulevard and then also jumping across the river.'",
        "'speaker_14': 'I mean, you're looking at a site here. We're driving across the river at the stadium or at the River Mile Development. I think that this process has enabled us to look at the broader infrastructure impacts, and that includes an adjacent areas.'",
        "'speaker_14': 'I mean, it's a it's a a discussion that's going to happen with each project in terms of the level of coordination with external partners outside of, you know, the the applicant, basically. But we are having those discussions right now and that specific project.'",
        "'speaker_10': 'So with so much proposed activity that will be going on, you know, I've asked the people from CDOT what what they're doing to look at all of the development that is being proposed and how that is guiding some of the recommendations coming out of the Powell study, which I think you're familiar with.'",
        "'speaker_10': 'How how are we looking at development from our side trying to influence the PEL study, for example, with development from, you know, Alameda all the way to 20th Street with huge projects along various stops along the that corridor.'",
        "'speaker_14': 'I'm not sure I'm familiar with that study.'",
        "'speaker_10': 'This is where CEDA is looking at how they're going to address future upgrades to I-25 from Alameda to 20th Street and. You know, I've encouraged that they are talking to the CPD about all the development that is being planned, which is why I keep raising the issue about 38th and Fox, because it doesn't go far enough to'",
        "'speaker_10': 'address all that development at the far north end of the city. And so looking at that corridor as a whole, I think is really important to ensuring that we're not just creating more and more traffic congestion, which already exists pretty much, you know, sun, sunrise, sunset on that corridor.'",
        "'speaker_10': 'So how do we see us having greater input to see that to influence, you know, maybe how they might address some of those upgrades or improvements as as we're looking at these projects so that it's not all expected to just be on the city streets.'",
        "'speaker_10': 'And again, you know, I think we all want to see development that looks at how we reduce traffic demand and look at alternative modes of transportation. But we know that all this new development isn't going to happen without cars.'",
        "'speaker_5': 'Right.'",
        "'speaker_10': 'And so how we manage all of that becomes really critical to. It's just how what happens in our city and how we're trying to not overburden this particular end of town, for example, that's going to be having a huge amount of development along that I-25 corridor.'",
        "'speaker_14': 'Yeah. My, my my quick response is, again, this would better enable the dialog and that coordination with those parallel efforts. So if there's as compared to the current state, you know, through the rezoning and state planning process, for example, those two tools aren't particularly well equipped to tee up those conversations in terms of looking at, Oh, there's'",
        "'speaker_14': 'an instructor study going on here, how are we going to integrate with that? Is there an opportunity here? I think the quick answer is a much better tease up that communication and that collaboration with those efforts. Okay.'",
        "'speaker_10': 'Thank you. I have no further questions.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega Guzman Espinosa.'",
        "'speaker_8': 'So I want to say I'm encouraged actually to hear that the LDR process is being used as you're looking at the stadium district because it affords the city the opportunity to sort of get some of those other concerns addressed that we were talking about in prior rezoning and get them mean in agreements with the city prior to'",
        "'speaker_8': 'any rezoning that was necessary, probably necessary. Likewise, my question is, I don't know if the text amendment that I have on my computer is the most recent, but if it is, I want to sort of clarify something that I'm reading here in section ten .8.1.3, the minimum amount required.'",
        "'speaker_8': 'This is a minimum of 10% of the net development area as defined by section 13.1 .6.4, a open space in large development rules of measurement. If I go to that. It says open space, you know, 13 164 open space in large development areas, a net development area.'",
        "'speaker_8': 'The required amount of open space in large developments shall be calculated as a percentage of the gross development area. It's the only place where we say that everything else seems to point towards the net development area. Is that a typo?'",
        "'speaker_14': 'So I don't have to put up the language here, but but the the regulation is for.'",
        "'speaker_8': 'Is that it says the net development area shall be the gross land area within the boundaries and then tells you how to get to the net development area. So that first statement says shall be a percentage of the gross development area.'",
        "'speaker_14': 'Yeah. The in fumbling through the language here. But it should say that it's a definition of what the what the net development area is, which is basically the gross development area minus areas for roads, other infrastructure parks. So that tells you how to calculate what the net development area is that your open space is based on.'",
        "'speaker_14': 'There may be clunky wording there, but it should read.'",
        "'speaker_8': 'Yeah, because to me it would be more accurate to go ahead and say the requirement required amount of open space in large amounts shall be calculated as a percentage of the net development area. The net volume and area shall be this, you know, because the gross development area has a specific definition.'",
        "'speaker_8': 'I would love it if it were to mean a percentage of the gross development area, which would be far more substantial in some cases than the net.'",
        "'speaker_14': 'But yeah, it's well, it is the I mean, it is the net area. So and I think that's a that's how we do it with the GDPs currently. So the language could always be improved, but that's the idea is for it to be the gross area, the total area minus other areas that are required to be dedicated'",
        "'speaker_8': '. Okay. So then for the purposes of GDP, the what is the definition of open space?'",
        "'speaker_14': 'So the definite well, the the definition of open space, I guess it's not a defined term in terms of it being in Article 13. I would say the best definition, if you want to call it that, is through the design standards that are in Article ten in terms of what qualifies.'",
        "'speaker_14': 'So in order for it to meet the requirement for large development, open space, it has to meet a number of design standards related to its public accessibility, its usability and its and you know, it has to be I think it lists some examples of what can qualify as sort a courtyard or plaza natural impervious area, things like'",
        "'speaker_14': 'that. So that's probably the closest thing to a definition which is basically setting forth what qualifies.'",
        "'speaker_8': 'Okay. The reason why I ask is it's very clear on, you know, you know, frontage towards, you know, you know, access from streets, name streets and stuff like that. But seems pretty vague to me still on the material, you know.'",
        "'speaker_8': 'And so hopefully we'll we'll watch this and see how it how it gets utilized. But please, I mean, I know the intent is that this does not become streets and this does you know, we specifically prohibited that. But developers I still think there's latitude here for developers to sort of take advantage of what we're calling open space'",
        "'speaker_14': '. Yeah, I mean, we definitely made improvements. This project was about addressing a process, I will say, and the idea of open space is certainly a hot button issue. And we made improvements, recognizing that there's also a city wide conversation that could happen for smaller developments.'",
        "'speaker_14': 'To that, we would get more into design and functionality and things like that. This these changes were intended to make improvements on precluding trying to preclude some of those bad outcomes. So like specifically saying an off street parking area doesn't count was not something in the GDPs and people were finding that loophole and doing like pavers on'",
        "'speaker_14': 'a parking lot and coming in as open space, not being able to count like a three foot long linear strip of, you know, you know, of a little bit of landscaping where we we are precluding that with this bill.'",
        "'speaker_14': 'So we're taking steps in the right direction, I think. But there's definitely a recognition that there could be definitely another turn at this and multiple turns to get at design and all of that stuff. But the hope is also that one of the things that this ADR process, you know, sort of could foster is looking at design'",
        "'speaker_14': 'standards, and design standards can address open space. So there could be an opportunity there through site specific areas, specific design standards, if that's a priority to address some of these issues about materials and things like that.'",
        "'speaker_8': 'Great. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilwoman Sussman.'",
        "'speaker_12': 'Thank you for answering all these questions. A lot of this is there's so much planning ease in the in the ordinance and in the language. See if I can simplify things. If it is decided that, then LDR is needed, will an LDR always occur before a rezoning?'",
        "'speaker_14': 'Yes.'",
        "'speaker_12': 'I think that's very important to say because GDPs didn't always happen before zoning. Right. It's correct. Right. So this is a this is a major change because people would very often the public would say, well, we don't know exactly what you're going to do when you're asking us to rezone.'",
        "'speaker_12': 'So the biggest difference is that if it's decided an elder is needed, it happens before a reason. Right.'",
        "'speaker_14': 'Yeah. It's I mean, there could be in some cases where it's staggered a bit or concurrent. But but the LDR is designed to say is designed to do just that to to mandate a sequence of entitlements and rezoning could be would typically follow the ALR if a rezoning is needed.'",
        "'speaker_12': 'I think that's probably one of the most important points about creating this LDR In terms of getting neighborhood input and ability to give their views. The other one is if you have a an owner of a property who's wondering if he's going to need to do an LDR and the and the decision is going to go to'",
        "'speaker_12': 'the Development Review Committee. Is do we have anywhere stated that it's in the is it a consensus of the committee? Is it a majority vote of the committee? Do we know who the voters are? That still is not as predictive as it could be.'",
        "'speaker_12': 'Do. Is there any feeling about how that process works?'",
        "'speaker_14': 'Yeah. I mean, that's probably an area that's probably one example like tha you know, that we could provide a little more clarity through like rules and regs or supplemental guidelines or something as an example. But I will say to that point, the, the LDR, the outcome of the order of the all the F does require joint signatures'",
        "'speaker_14': 'of those agencies. So presumably, you know, in order for them to sign it, they will have had to be brought along through the whole process in terms of saying yes, it was applicable and have had this interagency dialog leading to that outcome.'",
        "'speaker_14': 'But the specific decision point in the language is DRC. It does not say majority or any voting system, but that's something that we could look to, to to clarify that a little more predictability for folks.'",
        "'speaker_12': 'You need every signature, so it has to be unanimous to it. Did I understand that.'",
        "'speaker_14': 'For the final.'",
        "'speaker_12': 'For the final yea. For the final LDR. That's correct. Okay. Okay. But not necessarily for deciding that it needs to now be are crimes.'",
        "'speaker_14': 'Yeah. That's the way the.'",
        "'speaker_12': 'Is there a universe of criteria that could be listed? Probably not, because it's always hard to list what you can do. Or perhaps is there a universe of criteria of when it wouldn't happen? Okay. This do we have a universe in either of those instances to give a little bit more predictive this to.'",
        "'speaker_14': 'Yeah. We have a pretty long universe of when it is required or we don't have the universe when it's not required. I mean, this is good. This is good food for thought for us to provide that clarity because I mean, this is you know, those are impacts on projects.'",
        "'speaker_14': 'So we want to make sure we have as much predictability as possible. So that's something we could consider.'",
        "'speaker_12': 'Okay. Sure. Thanks for that. Appreciate it.'",
        "'speaker_1': 'Thank you, Councilwoman Sussman, Councilman Cashman.'",
        "'speaker_2': 'Thank you, Mr. President. Jeff, so to understand, the LDR process requires a single public meeting, and then obviously if it goes into a rezoning, there would be more involvement in that process itself.'",
        "'speaker_14': 'Correct.'",
        "'speaker_2': 'Okay. So one thing I'm kind of disappointed in my memory is that when I was first briefed that this LDA process was coming to replace the GDP, the two important points for me were that the 10% requirement for open space dropped from ten acres to five.'",
        "'speaker_2': 'But then there was going to be another 10% of green space. What happened to that?'",
        "'speaker_14': 'Yes. So I believe you're referring to the idea of Parkland City, Parkland dedication, which is what we shared with you, I believe, at the briefing. So, um, and correct me if I'm wrong as they go on this path here, but there's sort of two types of open space in this project or through this lens.'",
        "'speaker_14': 'There's the open space as set forth in. This bill, which is typically going to be privately owned, publicly accessible, so not a dedicated city park. What you, I think are referring to is a discussion that is still ongoing with the Parks Department and others to look at a citywide Parkland dedication requirement.'",
        "'speaker_14': 'And so the percentages and all of that haven't been fully calibrated yet. But that is still that is still in play now. And we're working through that. And there's actually an individual here from the Parks Department, if you wanted to kind of drill down on what that project looks like currently.'",
        "'speaker_14': 'But basically, this bill allows that to happen. So what I mean by that is the 10% minimum open space is a given as part of this bill for all site development over five acres. But there's built in flexibility so that if the Parks Department proposal, through their own adopted rules and regulations or any code changes, wanted to'",
        "'speaker_14': 'propose and look at additional Parkland requirements. There's the ability to do that within this bill and have them sync up with each other. So essentially this LDR process, for example, tees up that question of whether or not Parkland dedication will be required for the project per the Parks and Recreation Rules and Regulations as adopted.'",
        "'speaker_2': 'But right now, that greenspace requirement is still in discussion. Could happen, might not happen.'",
        "'speaker_14': 'It's pretty far along and I think there's a lot of momentum to it. But it's not it's not final yet.'",
        "'speaker_2': 'So we're not voting on that tonight.'",
        "'speaker_14': 'Correct? Yeah. Yeah, that's correct.'",
        "'speaker_2': 'The other thing about open space that I found interesting in her neighborhood cooperation was proposing a more complex way to assess open space. Right now, we assess it two dimensionally based on the square footage of the property, correct?'",
        "'speaker_2': 'The 10% number?'",
        "'speaker_14': 'Yeah. It's a land area of the land.'",
        "'speaker_2': 'The land area. But there their point being that we're building so robustly now that there's probably a difference in what we need as far as open space. If we're talking a few 20 story buildings, then if we're talking a few five story buildings.'",
        "'speaker_2': 'And what was the thought in CPD about that?'",
        "'speaker_14': 'Yeah. So that's there's a recognition that there's a deficiency there and an issue in terms of looking more holistically at open space for all projects. So all I can say is that this bill was about again about fixing a process, but we did improve the open space requirements by lowering the threshold and making it more applicable and'",
        "'speaker_14': 'making the design foster a publicly accessible, usable community benefit. But in order to look at all sites so not, you know, the ones that are smaller but maybe have more density, for example, I mean, that's something that while we would have liked to address with this bill, was a bit out of the scope in terms of looking'",
        "'speaker_14': 'at all projects, which I think is what the ideal state would be. They're looking at, for example, sites smaller than five acres, but also sites open space calibrated to intensities and densities and land uses and things like that.'",
        "'speaker_14': 'There's a whole big picture conversation, I think, that we want to have and probably will have to to address these sites more holistically.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'And then last question, Mr. President. Jeff. So as you know, when we passed Blueprint and we passed the comp plan, there was a statement added that in as we plan our city, addressing the need to mitigate our impact on climate change is our overarching guide.'",
        "'speaker_2': 'So I'm wondering what are the discussions in CPD at this point about what that means and how you might assess developments with that in mind?'",
        "'speaker_14': 'Oh, I know. Yeah, that's a big one. I mean, that's a that's a huge issue for sure. And I guess my only response to that would be this process improvement will again tee up those conversations better to where it's designed to look at all of those policies holistically, that being one of them, to figure out and to'",
        "'speaker_14': 'kind of put our heads together across all the city agencies to figure out if there are strategies that we could implement through the LDR process related to whatever it is, green infrastructure, things like that. There's so many strategies I think, that could get at that issue, but that's sort of a core it's definitely a core policy that'",
        "'speaker_14': 'would be better teed up through this process, I think.'",
        "'speaker_2': 'And I think you're probably. Be right. But I just wanted to point out that the wording is it doesn't say that we should also look at climate change. It says it's our overarching guide. It's our number one thing to be committed or to be considered.'",
        "'speaker_2': 'And so I know we're starting some discussions among members as to exactly how to approach that. And I'm hoping your department is as well. Awesome. Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Mr. President. Jeff, I want to clarify, did you say that the Development Review Committee would include people from representation from the Housing Division of Economic Development and from MAST? Because what I read in the ordinance was that it consists of the managers, CPD manager of Public Works, the zoning administrator, the fire chief and the manager'",
        "'speaker_6': 'of Parks and Recreation. Are we changing that in this text amendment or is that are they ad hoc members?'",
        "'speaker_14': 'Yeah. So those they would not as part of this Texoma would be a part of the DRC and the DRC is already a set group. Right. And that's been codified. But what we did do is explicitly add those other agencies as referral partners as part of the frontloading of the evaluation.'",
        "'speaker_14': 'Okay.'",
        "'speaker_6': 'So they're not part of the initial decision making.'",
        "'speaker_14': 'Well, they will be at the table. Yeah, I guess in terms of what the code says but as one thing. But, but you know that that's the practice that we talked about how we're institutionalizing that they are part of that group that is deciding on these but the code is for the DRC is is kind of locked'",
        "'speaker_14': 'in.'",
        "'speaker_0': 'Okay. What is what.'",
        "'speaker_6': 'Is the public engagement process that the department is is looking at for? When you draw up the rules and regulations.'",
        "'speaker_14': 'For the for the community information meeting that's required.'",
        "'speaker_6': 'When you draw up rules and regulations for implementing the LDR. Process. And you're going to draw rules and regulations. How are you going to roll that out? How are you going to gather input from the public, from the community in general, from the landowners, from from the investors, from from everybody.'",
        "'speaker_14': 'Yeah. So important to clarify. So the rules and regulations are supplemental to the code. So it's really only supposed to be about clarifications and like.'",
        "'speaker_6': 'I see the draft as.'",
        "'speaker_14': 'In here. Yeah, yeah. Okay. Yeah, there's a detachment to the staff report. So we in terms of vetting that, we've taken that to a planning board twice now and there'll be the third time next week. And we've certainly shared the public review drafts, but most of what is in there is clarification of what's in the text amendment'",
        "'speaker_14': '. So there hasn't been. Yeah.'",
        "'speaker_6': 'Okay. Should there be should more outreach or is are you figuring that going to the planning board is sufficient?'",
        "'speaker_14': 'Well, yeah. I mean, there's there's and like I said early in the presentation, we are actually working with some stakeholders who through this process have identified some issues with the rules and regs. So we're having some individual engagement on refinements to the rules and regs.'",
        "'speaker_14': 'But, um, but ultimately, you know, what is in the rules and regs is supplemental to the, to the bill, right? And being carried forward from, from what's already on the books with the GDP rules and regulations actually. So there's not a okay.'",
        "'speaker_6': 'But you know, where the ordinance, where the code that we're adopting tonight sets up the framework, it's sometimes the devil's in the details of the rules and regs. That's that's why. That's why I'm asking.'",
        "'speaker_14': 'Yeah, that's.'",
        "'speaker_6': 'Okay. All right. Well, I'll. I'll follow that. Let me give you a feed arrest and ask Jennifer a question. So. Halftime. Could you expand a little bit and explain the issue that you saw with the requirement for a public access easement on private open space?'",
        "'speaker_5': 'I can. The requirement for public access or a public easement over private property in the case of multi-family housing, which is a very narrow section and that would include for rent and for sale in the case of a for sale product.'",
        "'speaker_5': 'So condominiums or townhomes, for example, provided that that space meets the contiguity and width and all of those requirements under Kiawah or the Colorado Common Interest Ownership Act. There are some requirements that you cannot burden private homeowners with public requirements.'",
        "'speaker_6': 'And so this would apply to a for sale.'",
        "'speaker_5': 'Correct. It would absolutely apply to for sale. It would apply to any for sale that met that requirement. That met that requirement. It would also.'",
        "'speaker_6': 'Not to a rental.'",
        "'speaker_5': 'It would also apply to rental. So in the case of rental or affordable housing, the concern or the primary concern there is that affordable housing, as you all know, is a very complicated issue that uses a very complicated set of financial mechanisms in order to create the framework so that it can happen in a public private partnership'",
        "'speaker_5': '. Two of those more commonly known frameworks, one is Ly Tak, which is a low income housing tax credit product, and the other are some HUD loans that are subsidized with private financing or some soft financing, if you will.'",
        "'speaker_5': 'Both of those, it creates an issue of liability to have a public access and over private property, a required public access over the private property. And it also creates some real potential issues with the LURA or the land use restriction agreement that you have to make in order for the project to to continue to be low income'",
        "'speaker_5': 'over the 30 years of the property. So they're to put it to potential seriously legal issues in the limited case of multifamily.'",
        "'speaker_6': 'All right. Thank you, Jeff. Good. Let me follow up on that. That is there a is there any other mechanism that the city has at its disposal that would ensure that the private open space remains open space in perpetuity other than a public access easement?'",
        "'speaker_14': 'Yeah. I'm not too knowledgeable, but there are. Yeah. I mean, you look at, for example, I believe through a subdivision plan with the, you know, with notations on it. And I'm not sure if through a development agreements, I'm kind of out of my league on that if that one would be possible.'",
        "'speaker_14': 'But there are and this in this language was drafted with the assumption that there could potentially be other tools. But we wanted to make sure that we had the ability.'",
        "'speaker_6': 'The intent with our is that this open space would remain public, open space as though it were a city park, even if it is publicly owned. Is that.'",
        "'speaker_14': 'Yeah. I mean, I know. I don't know if I'd say as if it were a city park, but because that's a different sort of definition of the space. But that is the intent is to have a mechanism in place to remains publicly accessible in perpetuity.'",
        "'speaker_6': 'And one last thing, just generally. Are there circumstances where an area less than five acres could nevertheless also be subject to this process.'",
        "'speaker_14': 'To the for the open space or.'",
        "'speaker_6': 'To to LDR to the.'",
        "'speaker_14': 'Other process? Yeah. So yeah. So just as is in the current GDP world, something less than ten acres could be subject to it. Same thing with the five acre.'",
        "'speaker_8': 'Threshold.'",
        "'speaker_6': 'And then other circumstances that you could envision where an area greater than ten acres would not be subject to LDR.'",
        "'speaker_14': 'It's possible. Yep. Mm hmm.'",
        "'speaker_0': 'Okay.'",
        "'speaker_6': 'Thank you for that.'",
        "'speaker_1': 'Thank you. Councilman Flynn, Councilman Gilmore.'",
        "'speaker_5': 'Thank you, President Clark. Jeff, could you talk a little bit more about the the DRC and I guess what the transparency is going to look like around how they're making decisions? Are we going to see kind of what their, you know, decision making metrics is or how are we going to have transparency around that so that if'",
        "'speaker_5': 'something does trigger the LDR, we understand how those decisions were made, but then as it goes through the process, my second question is how is the equity lens going to be overlaid on that process as well? Looking at different parts of the city, we sometimes get different development outcomes for a.'",
        "'speaker_5': 'Variety of reasons. And with CPD and Public Works and Parks and Rec and ultimately City Council going through equity training, how how is that going to, I guess, be woven into this process?'",
        "'speaker_14': 'Yes, that's a good question. So in terms of how to use the equity lens through the LDR process, again, so the process is designed to to bring those partners around the table and have the discussion about which equity policies could be applicable to the site at a citywide or neighborhood level.'",
        "'speaker_14': 'And so and then the idea is, you know, once those have been identified and this is a hypothetical, of course, but once those once those have been identified, figure out what the right tool is to achieve said community benefits related equity, for example.'",
        "'speaker_14': 'And so there may be in an LDR an articulation of what those benefits are at a higher level. And, you know, so and then it will and then the LDR might say through a development agreements address X, Y, Z, equity policies.'",
        "'speaker_14': 'And so that becomes a are an improved record, a document, the LDF that sets forth those parameters so that as development proceeds within the LDR area, there's that core, you know, that tie back that says, you know, whatever it says in the LDR, rezoning happens first in the infrastructure master plan.'",
        "'speaker_14': 'Concurrently with that, a development agreement to address said community benefits as part of that. So it's memorialized at that level, at least conceptually in terms of the equity lens. So yeah, I guess that's the answer.'",
        "'speaker_5': 'And then from memorializing it, I guess, how does the community have the assurance that it's actually implemented in that way?'",
        "'speaker_14': 'Yeah, so I mean, it's, it's a binding document that is recorded and publicly available. And so, um, so it's something that everyone would be held accountable to.'",
        "'speaker_5': 'Okay. And so I just again, you know, to my earlier question, just transparency around how those decisions are made so that when we're going out to a community meeting, folks can understand how we got to that place. Yeah.'",
        "'speaker_5': 'Yeah. Yeah.'",
        "'speaker_14': 'Yeah, that's fair. So so that's one of the I think one of the reasons why we we built in the community information meeting where we did in the overall kind of process. So going back to that flow chart, but essentially the community information meeting is repurposed from what it is in the GDP world today, which is basically'",
        "'speaker_14': 'a developer presenting and development concept in a in a plan. In a lot of ways, it's been repurposed more toward sharing the city's findings, for one, that the LDR was applicable. And why then also the preliminary scope to address key questions like is there an adopted plan?'",
        "'speaker_14': 'Are preliminary assessment that we will be sharing with the community at that meeting would be, you know, yes or no. There's an adopted plan that addresses this site. Here's the preliminary scope that we you know, we've started to develop with the applicant going forward.'",
        "'speaker_14': 'So that could address equity, the equity lens, for example. So the idea is to be able to share the information with the community as to how we got to where we are before anything gets finalized with, with the large development framework basically at the end.'",
        "'speaker_14': 'Um, so, yeah, so that's great.'",
        "'speaker_5': 'Thank you. Thank you, President Clark.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilwoman Cannick.'",
        "'speaker_9': 'Thanks, Mr. President. I just wanted to briefly follow up with is it Jennifer, the attorney? Thanks so much. So I really appreciate, you know, wanting to look out for eventualities that could interfere with housing. But I guess I just wanted to ask, you know, having seen a lot of five and ten acre developments, I've never seen any'",
        "'speaker_9': 'at that scale that have put the open space in the private responsibility of an owner of a multifamily building versus under the ownership of the MAT district or the large. This is not a standalone this wouldn't you know, to Councilman Flynn's point, this wouldn't apply to the typical one parcel development.'",
        "'speaker_9': 'And so can you just answer, do you have a specific project in mind that's causing this concern or is this more of a just in case? Because I just don't in my, you know, 15 years of doing affordable housing, I've not seen the scenario that you're describing because typically they can't afford to use a portion of land'",
        "'speaker_9': 'in that way that's publicly accessible. That's just not a realistic thing that someone can finance in a typical project. I can't speak to the condo side, but again, just is this a specific project?'",
        "'speaker_5': 'You have great points, great questions. The answer is more from a large scale development process. So what I think is missing here is that the LDR process, as you heard, starts first and then subdivision happens and we're talking about large parcels.'",
        "'speaker_5': 'So you're talking about really master development in a lot of ways or development of large parcels, large areas. And then once so you're deciding at that point open space, you're deciding park land. You're making decisions that, as you're pointing out, really should be more on a site level or down on a local level as these master developers'",
        "'speaker_5': 'are talking currently with developers. Right. The land's not all just sitting fallow and no one's doing anything with it. They're master planning communities, of which that includes affordable housing. But what happens is those open space requirements, which are changed now and it changes the the entire landscape of what and when it's required happen, that happens on an'",
        "'speaker_5': 'upfront decision. It gets shared over the parcels on all of the property. So at that point, it does make it very difficult. It also means that local, the singular or parts of that development would be applied. You would have you could feasibly.'",
        "'speaker_5': 'And there are actually some. I have to be very careful with the attorney client privilege. I don't have the I'm sorry. I'm not being cagey. I just don't have the authority to disclose those projects. But yes, it does have the potential to have to affect potential projects.'",
        "'speaker_9': 'Okay. I'm just going to move to Jeff real quickly. Thank you very much. I appreciate that, Jeff. The previous speaker just made a reference to the idea that you would, you know, distribute an affordable housing requirement across all the parcels.'",
        "'speaker_9': 'That is only one option available. Nothing in this ordinance would require each individual portion of a large development to meet a percentage goal. In theory and in fact, most large development areas designate a portion of their site and dedicate a larger tract of, you know, open space for efficiency or whatever.'",
        "'speaker_9': 'They don't necessarily need under this policy to assure that each and every piece of vertical development within the project fulfills a percentage open spaces that I just want to clarify.'",
        "'speaker_14': 'Yeah, I think you're right. I mean, there's nothing in this bill that changes the allocation and distribution of affordable housing. I mean, the open space requirements are what they are. You can you can you can.'",
        "'speaker_9': 'You can fulfill them in one portion of the site and require none of your vertical developers to do any of it. In theory.'",
        "'speaker_14': 'That's correct. As long as you meet the 10%, you can allocated whoever you want. Okay.'",
        "'speaker_9': 'Thank you very much. No further questions.'",
        "'speaker_1': 'Thank you, Councilwoman. Each. All right. Seeing no other questions. The public hearing for Council Bill 19 0494 is closed. We're going to move into the comment section. Are there comments by members of Council on this item? Councilman Espinosa.'",
        "'speaker_8': 'Yeah. You know, I also wanted to say as a I don't I don't I don't share the real concern about the potential that you're talking about simply because the master developer will apportion the open space in as appropriate, given the new process and those those parcels that will be dedicated or, you know, earmarked essentially for, you know'",
        "'speaker_8': ', low income projects or housing, you know, housing developments will be we'll have to factor that in. You know, when you're when you're when you're when you when you sell that because it won't be on a parcel by parcel basis, it will be on the development scale.'",
        "'speaker_8': 'So unless you were doing some massive project, but again, it would still be there are so many ways to skin this cat. And that's what the beauty of this whole LDR process is, is it just allows it starts to close a lot of I mean, it starts to compel us to have a lot of conversations to finally'",
        "'speaker_8': 'get outcomes that we've been trying to get through a whole haphazard scheme of, of things. And so and it and it has some vagueness that I wish were tighter. But I think over time we'll find out whether we do need more regulatory constraints to handle those things as they come up.'",
        "'speaker_8': 'But it also then affords itself to be adaptable to those things as they as they come up. So just thank you all the volunteers, the staff that have been working on this for some time because it's one that's been desperately needed to be addressed and it will be, you know, future councils can look forward to seeing the'",
        "'speaker_8': 'results of the public process and potential rezonings that actually start to factor in some of the concerns that we've been articulating for the last four years that I've been here. Things.'",
        "'speaker_1': 'Thank you, Councilman Espinosa, Councilwoman Cannick.'",
        "'speaker_9': 'Thank you, Mr. President. I really appreciated the comment from my colleague, Councilwoman Sussman. I'm going to miss you of saying how much planner speak is in all this and how to really boil down why this matters to people.'",
        "'speaker_9': 'And so I just want to say that I believe that this is an important step forward in creating a more rational, clear system for proceeding with large redevelopment. And my simple way of talking about it is, is there is a good plan and good guidance.'",
        "'speaker_9': 'Then this lays out the next steps. If there isn't a good plan and good guidance, then it says you have to have that first. And and I think that that's really important. And and it means the city leads it.'",
        "'speaker_9': 'We've had confusion, I think, in some large developments in the past where you have developer led processes sometimes creating a feeling that it's not an equitable process for the whole community. And so the number one change I expect to see come from this is where there's not plan guidance.'",
        "'speaker_9': 'We don't have to do what we did, you know, and thankfully the staff was amenable. But when, you know, Councilman Flynn and I talked about the Loreto Heights thing, it was we have to ask. For a process, you know, or when we talked about, you know, some of the sites, you know, they did not get a process'",
        "'speaker_9': 'that was city led. They had a developer led process. And so it was a situation of whether you were successful in advocating for that or you weren't. Now it's clear if it's a city led process, if there's not plan guidance or you better have a darn good excuse.'",
        "'speaker_9': 'And I appreciate a Councilwoman Gilmore's questions, I think this puts a lot of accountability on the administration and on the large.'",
        "'speaker_5': 'I'm sorry.'",
        "'speaker_9': 'Lldr0 lrc lrc. It puts a lot of onus on the administration to be very consistent in your decision making and very transparent in your rationales and to, wherever possible, include the council in that process. I think that where you do so, you end up with more consensus and more understanding of what the community needs are and more'",
        "'speaker_9': 'insight. So even though this is not our function under the charter, there is no reason we cannot be collaborative. And on projects like River Mile, where you worked closely with Councilman Brooks and Councilman Espinosa to think about those types of aspects of it.'",
        "'speaker_9': 'I think you had more success and we had more success as a city, so I wanted this to solve every problem we have with disconnects between affordable housing and planning. And it's probably not going to solve every problem that we have with those disconnects.'",
        "'speaker_9': 'But I did feel through three or four meetings that I had, both with the planning staff, the housing staff, including some of your high up directors, that that things are moving in a good direction and that the the the areas where improvement are needed are identified and new staffing is coming with new expertize.'",
        "'speaker_9': 'And so I do feel like this is going to put us in a better position to be more coordinated about equity and about preventing displacement before it happens. So for us to do all that will require a lot of vigilance.'",
        "'speaker_9': 'And so I hope that we check in on this, and I hope you keep really good data on each and every project that does or doesn't get selected and why and the size of those projects and the outcomes that open space.'",
        "'speaker_9': 'I think data is going to be really important for us, so I hope that's part of the work plan going forward. And then lastly, I will just say there was a lot of conversation about this other piece about, you know, community benefits as a way to doing equity.'",
        "'speaker_9': 'And we've just we're all using pretty different terminology. And, you know, there is some standardization out there in the rest of the country. And I know I've already started talking to some of the folks on the team, but there's a difference between when we put things that are good for the community in our agreements versus when the'",
        "'speaker_9': 'community gets its own agreement where they're the signatories and they're the enforcers and then how we support the community or whether we're at the table with them. And so I just hope that we all will sit at the table more and clarify what we're all talking about so that when the council members, both those here tonight and'",
        "'speaker_9': 'those that are new, are using the terminology and you are in the community as we all are using the same language. Because I do think that this for me, large development matters because of the impacts on a community and the change that it creates.'",
        "'speaker_9': 'Right. But it also especially matters because it is the biggest potential negative impact in terms of displacement or ripple effects, and it's also the potential to mitigate those effects. And so for me, that's what makes it so important.'",
        "'speaker_9': 'And I just want to thank you. I gave a lot of feedback, even though I don't sit in over four or five meetings. And you were really thoughtful and included a lot of that feedback and a lot of the changes.'",
        "'speaker_9': 'So I found it to be a really collaborative process and I want to thank the staff for all of the hard work and all the community members who served on it. Thank you. I'll be really excited to take this big step forward tonight.'",
        "'speaker_1': 'Thank you, Councilman Canete. Seeing no other comments, I will just add and forgive me for being brief, but the hours late and we have more to do after this. Just thank you. I think this is a huge step forward in a lot of ways.'",
        "'speaker_1': 'Thank you for all the work that went into this and and for bringing it forward. I will be happy to support it. And I don't think I've ever seen in four years that many people, almost everybody up here grilled with questions and then nobody else commented.'",
        "'speaker_1': 'So you guys did a great job answering everyone's questions during the question phase. So thank you, Madam Secretary. Roll call on Council Bill 494.'",
        "'speaker_5': 'Black Eye.'",
        "'speaker_8': 'Brooks I.'",
        "'speaker_7': 'Espinosa Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_7': 'Gilmore.'",
        "'speaker_8': 'I.'",
        "'speaker_7': 'Herndon. I Cashman. Clinic Lopez.'",
        "'speaker_10': 'Sorry. That was my microphone.'",
        "'speaker_5': 'Ortega assessment.'",
        "'speaker_12': 'All right. We don't have we don't have a place to. Oh, there it is.'",
        "'speaker_5': 'It's just. Thank you, Mr. President.'",
        "'speaker_1': 'Madam Secretary, please. Because the voting announced results.'",
        "'speaker_7': '11.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1245 Quince Street in East Colfax. Approves an official map amendment to rezone property from E-SU-Dx to E-SU-D1x (allows an accessory dwelling unit), located at 1245 Quince Street in Council District 5. The Committee approved filing this item at its meeting on 5-14-19. Community Planning and Development has determined that the requirement for a legal protest (signatures by the owners of 20 percent or more either of the area of the lots included in the proposed change or of the total land area within 200 feet from the perimeter of the area proposed for change) has been met (petition signatures represent 0% and 21.6%, respectively).": [
        "'speaker_1': 'Nice 11 nice. Comfortable 494 has passed. Councilwoman Gilmore, would you please for accountable 447 on the floor?'",
        "'speaker_5': 'Yes, President Clarke, I move the council bill 447 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded and the public hearing for Constable four, four, seven is open. May we have the staff report?'",
        "'speaker_5': 'Just cleaning it up. All right.'",
        "'speaker_11': 'I'm Alice, Stevie. And this is a proposed rezoning for 1245 Queen Street. We are in Council District five in the East Colfax neighborhood. The subject property is a little over 7000 square feet, and the proposed rezoning is from the current Eastside X to Eastside one x.'",
        "'speaker_11': 'So the difference being that the proposed district allows an accessory dwelling unit, including the detached accessory dwelling unit building form, the subject property and surrounding properties in all directions are Eastside X transitioning to Main Street zoning along Colfax to the north, and similarly the site and surrounding properties are single unit residential land use with a few public'",
        "'speaker_11': ', quasi public and higher intensity residential uses in the area. So the subject properties on the bottom left and some surrounding residential buildings are shown on the right. So Planning Board recommended approval of this rezoning. On May 1st, KPD received a statement of support from the East Colfax Neighborhood Association.'",
        "'speaker_11': 'As of the time of the staff report, we also received 18 letters or emails and support two in our position and one comment that was neither in support or opposition. The support letters included 14 forms circulated by the applicant, returned by neighbors to indicate their support.'",
        "'speaker_11': 'And then we. A protest petition was submitted for this case with valid signatures of the owners of just over 20% of the area within 200 feet of the subject property. So for the rezoning criteria, we have four plans to consider in this area.'",
        "'speaker_11': 'The proposed rezoning is consistent with comprehensive plan 2040 and that it will enable increased development at a location where infrastructure, where infrastructure, including transit service, is already in place. Blueprint Denver mapped this area as the urban edge context.'",
        "'speaker_11': 'The requested ESU D1 X is consistent with the planned direction of predominantly residential areas that are generally single unit and two unit uses. The requested ESU D1 X is consistent with the future places mapping of this area of low residential, which is single into unit and accessory dwelling dwelling units are appropriate.'",
        "'speaker_11': 'So under the blueprint growth strategy areas including the subject property are expected to see 10% of job growth and 20% of housing growth by 2040. The additional accessory dwelling unit permitted by the proposed rezoning is consistent with that and additionally, blueprint includes a policy to diversify housing choice with the expansion of accessory dwelling units throughout all residential'",
        "'speaker_11': 'areas. One strategy that specifically references how this policy applies to rezoning is, quote, a citywide approach to enable it to use as preferred until a holistic approach is in place. Individual rezonings to enable adus in all residential areas, especially where proximate to transit are appropriate.'",
        "'speaker_11': 'Unless there is a neighborhood plan supporting a to use rezoning should be small an area in order to minimize impacts to the surrounding residential area. Housing and inclusive. Denver was adopted in 2018 and contains recommendations that are directly relevant to this rezoning.'",
        "'speaker_11': 'The plan recommends expanding the development of accessory dwelling units as they are as they incentivize affordable and mixed use housing. It also promotes development as a of aid to as a wealth building tool for low and moderate income homeowners.'",
        "'speaker_11': 'So the proposed MAP amendment to ESG one X is consistent with these recommendations. Finally, the East Montclair East Colfax Neighborhood Plan was adopted in 1994. This plan proposed rezoning. I'm sorry, this proposed rezoning is consistent with that plan, including vision statements around protecting residential character and promoting a mix of income levels in rental single family homes, and'",
        "'speaker_11': 'in policies like encouraging homeowners to add on additions and modernize single family homes. So staff found this rezoning is consistent with adopted plans. The proposed rezoning will result in uniform application of zoned district building form, use and design regulations, and it will further public health, safety and welfare through implementing adopted plans and facilitating increased housing density near'",
        "'speaker_11': 'a mix of uses and transit. Staff found that the proposed rezoning is justified through changed and changing conditions. The staff report details development and redevelopment to provide services and retail near the subject property and would be accessible from the additional residential unit that would be allowed by this rezoning.'",
        "'speaker_11': 'And additionally, the adoption of the blueprint update and housing an inclusive Denver include policies that specifically support this rezoning request. And finally, the context zoned district purpose and intent of Eastside one X are all appropriate for this particular location given the surrounding area and adopted plan guidance.'",
        "'speaker_11': 'So given the defining that all review criteria have been met, staff recommends approval of the proposed rezoning.'",
        "'speaker_5': 'Thank you. All right. Thank you. We have 16 individuals signed up to speak this evening. So I'm going to call the first five speakers if you could make your way to the front bench. And please remember to state your name for the record, your city of residence.'",
        "'speaker_5': 'And if you're comfortable, your address. And so first up, the first five, we have Steve Elkins, Allison Tawfik, Alan West, Dimitri Cervantes Ski and Amy Mattern. So Steve Elkins.'",
        "'speaker_0': 'Good evening, members of the Denver City Council. My name is Steve Elkins and I live at 1245 Quinn Street. I want to start by thanking my neighbors and neighboring property owners who have been on this journey with me.'",
        "'speaker_0': 'You didn't ask to come on this journey, but I appreciate you coming along anyway. I want to thank the East Colfax R.A., where we have strong leaders like Tim Roberts and Tom Fishing. I'm here tonight to celebrate that I'm a yimby and I mean that quite literally.'",
        "'speaker_0': 'I want to build an accessory dwelling unit to you in my backyard. When I saw our new citywide plans in draft form, I was excited about Denver taking the next steps to implement it to use as recommended by housing and inclusive Denver.'",
        "'speaker_0': 'I love my neighborhood and I'm excited about the opportunity to share it with other people who love it too. This idea for me started with a neighbor who was concerned I was going to tear my home down. I kept thinking, How do we save these great small homes on large lots?'",
        "'speaker_0': 'I had walked by 1188 Quint Street many times, which has had two small homes on one property since 1912. The property shows the concept of two small homes on one property has been in my neighborhood for over 100 years.'",
        "'speaker_0': 'Gentle density isn't new to Denver, except now for the first time, we have plans that have explicitly caught up with our desire for general density. I remember speaking to an overflow crowd at the January Jan R.A. meeting. I found neighbors who are hungry for a solution to combat a growing trend new, large, expensive homes in place, the'",
        "'speaker_0': 'small homes that are more affordable and in keeping with the character of our neighborhood. At the meeting, one neighbor was concerned about my outreach efforts. Her concern led me to send 40 letters to neighbors, property owners and tenants where I describe my project.'",
        "'speaker_0': 'How to contact me, how to contact staff. And if they chose to submit a support form in favor of my rezoning. Between my letters and staff book staff's inbox, my application received 18 statements of support. I learned of the owner of 1255 Quinn Streets opposition from Ms..'",
        "'speaker_0': 'Stevie, who recommended mediation and not from the owner herself. I then reached out to a mediator who told me the owner declined mediation. This petition, the protest petition before you tonight was signed by a total of eight property owners.'",
        "'speaker_0': 'The petition got me thinking. After all my outreach efforts, no one in opposition has reached back out to discuss his or her opposition with me. A bedrock of Denver's rezoning process is outreach. However, for outreach to work, it requires people with questions or concerns to reach back.'",
        "'speaker_0': 'I have made myself as available as I can, but I don't really know how to move forward with opponents who can't communicate their opposition to me directly. I stand here tonight to request that you empower my neighborhood to take an active part in directing how growth will shape our lives.'",
        "'speaker_0': 'We need gentle density of our small homes to survive as we face increasing pressure for our homes to be replaced. I want to be able to say to that neighbor who is concerned that I would scrape my home, that we have solutions now to shape our neighborhoods growth instead of that growth shaping us.'",
        "'speaker_5': 'Thank you. Next up, Alison Tawfik. I'm Alison Tawfik. I live near East High School in Denver. I'm a proponent of increasing density. I think this is a great one of these great, huge lots. My next door neighbors had one of these great huge lots that was filled with alley cats and things like that.'",
        "'speaker_5': 'And now there are two little houses on it, too. Little duplex side by side because he owned the whole thing. What him what he could have done was scrape the whole thing off pit for a big fugly mansion on it with a pop up and go corner to corner.'",
        "'speaker_5': 'But this neighbor wants to just put in two little houses to match the little neighborhood that was there in 1912. I think it's a fantastic way to increase a little density, find a little add a little place for someone to one or two people to live, to add some housing to the area that will have it's right'",
        "'speaker_5': 'by transit. It's right by it's walkable, it's bikeable. All of the cars would be a moot issue because there's already plenty of cars. If you look on Google Street maps, you'll see plenty of room for car parking if that's ever an issue.'",
        "'speaker_5': 'But I think if you ended up scraping it and putting in a big McMansion with a five car garage, you'd have a much worse issue than if we have these two cute little houses. Thank you. Thank you. Ellen West.'",
        "'speaker_15': 'My name is Eleanor West and I live in Denver and I own 1255 Squint Street, which is immediately north of the property seeking to change. There are many reasons why I oppose the zoning change, but my focus on only two issues one the need to preserve the meaning of zoning codes.'",
        "'speaker_15': 'And two, the need to preserve affordable housing first, relating to the meaning of zoning codes. I purchased 1255 six years ago as a backup plan for old age should I become unable to maintain my current three storey townhome.'",
        "'speaker_15': 'I was drawn to the property because of the quiet nature of the street. Sturdy construction of the home, proximity to family members and the tree shaded backyard. The block and much of the surrounding area is zoned single family.'",
        "'speaker_15': 'It never entered my mind that someone could buy the home next door and get a zoning change to be able to build a second home, possibly larger than the original in the backyard next to mine. That's what could happen.'",
        "'speaker_15': 'It would permit another home that could be as large as a thousand square feet to be built on the property. I printed an aerial view to help you visualize the space. 1245 is the one with the red marker.'",
        "'speaker_15': 'The existing home and attached garage together are about 1000 square feet. Keep in mind that when building another dwelling, you need to keep five foot setbacks and maintain the driveway area to access the garage. Because of these current constraints, there would not be much rent yard remaining for two homes to share.'",
        "'speaker_15': 'Most likely, a peaceful enjoyment of my backyard and nearby homes would be compromised. Question Should one owner be able to obtain a change in zoning that will negatively impact surrounding neighbors and remain with the property forever? Second, preserving affordable, affordable housing, which is critical in Denver.'",
        "'speaker_15': 'If approved, the change would have a negative impact on affordable housing, albeit just one property. Homes on Queen Street, similar to 1245, have been selling for about 325,000, which is affordable and attractive to young families. If you add the cost of an accessory dwelling unit, which could easily be 150,000, it would remove the property from the affordable'",
        "'speaker_15': 'category and there's no insurance that the unit would be offered at a rental rate considered affordable because most likely there would be a construction loan to pay off. And most importantly, once zoning changes have been made, it sets a precedent, making it easier for others to follow suit and more homes could become unaffordable.'",
        "'speaker_15': 'Finally, the staff report recommending approval of a zoning recommendation raises much of the argument on consistent with consistency with adopted plans for the future development of Denver. To proceed with the future vision zoning code should be systematically changed.'",
        "'speaker_15': 'I doubt that the intent of the documents was to give license to individual property owners to obtain zoning changes one property at a time. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Dimitri Zorrilla.'",
        "'speaker_0': 'Fortney. Hi, City Council. My name is Dimitri Xavier. Right now I live at 1950 North Logan Street in Denver, and I just come here to say that I love to use and I'm pretty sure Denver loves to use as well.'",
        "'speaker_0': 'In fact, in Blueprint Denver.'",
        "'speaker_14': 'You know, that whole.'",
        "'speaker_0': 'Process was very much in favor and allowing a to use to be implemented across the city that's including attached and detached to use and across all neighborhoods in all residential zoned districts. Additionally, until neighborhood plans can be put in place, I believe the East Area plan is still in process.'",
        "'speaker_0': 'Blueprint called for individual rezonings to be allowed in all residential areas, especially where they're close to transit. Aside from that housing and inclusive Denver, which is Denver Council's adopted housing plan, it specifically recommends it to use to combat gentrification and displacement in neighborhoods such as East Colfax, which is a neighborhood that is pretty vulnerable to displacement.'",
        "'speaker_0': 'City Council has also approved these these rezonings in the past as well. I think additionally, the East Colfax Ana's is in favor. Finally, Denver has a history of allowing it to use, especially after World War Two. You know, we have a tradition of this and we have many neighborhoods in the past that have allowed this.'",
        "'speaker_0': 'But, you know, I do want to applaud the neighbors for coming out and engaging, you know, their civil duty. It's it's a wonderful thing. But I think their their fears are misplaced. I think, you know, if they say that they're going to ruin single.'",
        "'speaker_0': 'Family home neighborhoods. I think they're actually going to use they're going to save them. I think, you know, when Blueprint Denver calls for a single family member, it's absorbed 20% of Denver's population growth by 2040.'",
        "'speaker_14': 'This is one of the.'",
        "'speaker_0': 'Tools and this is one of the ways we can do it. You know, one of the great things about it to use is they put eyes on the alley. They they activate the alley in a way the garages just can't, you know, and lots like these, you know, we've seen lots of these be scraped all across the'",
        "'speaker_0': 'city and replaced with McMansions. I think this is an opportunity to save this property, to save this house, allow for more density, allow for more opportunity for people to live next to transit along corridors such as this. Thank you very much.'",
        "'speaker_1': 'Thank you. Next up, Amy Mattern.'",
        "'speaker_5': 'Hello.'",
        "'speaker_12': 'My name is Amy Matter and I.'",
        "'speaker_5': 'Own a property.'",
        "'speaker_9': 'Directly.'",
        "'speaker_5': 'South of the property or the applicant here, and I can appreciate his efforts to add additional affordable housing to Denver, but I stand in opposition to the application. I don't think it'll add affordable housing and I'm a first time homeowner.'",
        "'speaker_5': 'I'm really, really grateful for this wonderful neighborhood allowed me to get on the property ladder. I am really fearful.'",
        "'speaker_12': 'That if they add an accessory dwelling.'",
        "'speaker_5': 'Unit, it'll make the property unaffordable for other first time homeowners that come behind me, because they'll be two units on or two dwellings on one property, therefore affecting the values of the property. I think it's important to make opportunities in the city for people to become first owners like myself.'",
        "'speaker_5': 'Also for Miss West, who is having a backup retirement plan, it offers wealth building for people. I think homeownership has also got to be a consideration in this neighborhood or my house was built over 70 years ago. It was built in my neighborhood for GIs coming back from World War Two.'",
        "'speaker_5': 'They had cute little houses with tons and tons of character. I do agree that scraping these houses would be a tragedy because they're such great little houses. They have great green spaces that add to our quality of life that we will not have if there's accessory dwelling units on there.'",
        "'speaker_5': 'I don't think it meets the criteria for public health, safety and general welfare of our neighborhood. It is right between two major arteries of traffic Colfax and Quebec. These arteries are running at or above capacity all the time.'",
        "'speaker_5': 'And although it's nice there's public transportation, it's likely that people are going to need a car to access the grocery store or retail as things stand right now. So you think the traffic will increase a lot, which is not good for the neighborhood or its welfare.'",
        "'speaker_5': 'Also, a lot of us use the alley to access our garages and having additional units on the alley is a potential safety hazard. I don't know because they're going to be reduced. Greenspace, perhaps small children living in those dwelling units are going to use the alley to play in and that kind of thing.'",
        "'speaker_5': 'So I think that is a concern as well. I'm a little concerned about the comparables that were used in this application. First of all, 1188 Queen Street was built over 100 years ago. There's two units and they're on a double lot.'",
        "'speaker_5': 'They're you know, they could probably be legally severed and have ample separate lot. So I don't think that's very comparable. The other comparables were also built prior to the zoning laws. And so I'm.'",
        "'speaker_1': 'Sorry, but your time is up.'",
        "'speaker_5': 'Okay. I appreciate it.'",
        "'speaker_1': 'Thank you. All right. I'm going to call the next five up to the front bench. Adam Astrof, Chairman Sekou, Kevin MATTHEWS, Jerry Saltzman and Jeffrey Baker and Adam Astrof, you are up.'",
        "'speaker_8': 'Hi. My name's Adam Astrof. I live in the Baker neighborhood in Denver, and I actually. I'm here to speak in favor of this project. I think that ADAS are probably the most important tool we have in our toolkit to provide the needed housing for the various populations that are moving to our city.'",
        "'speaker_8': 'And I wanted to talk about why I support this project based on the block I live on. We're also first time homeowners and we were only able to afford our property because it's a smaller lot. It's 2000 square feet next to us.'",
        "'speaker_8': 'There's an apartment building, two units down, there's an EDU, there is rental units, there are affordable rental units, there are expensive rental units. There is housing stock from $300000 to $1000000 all on my block. And I think that's the kind of flexibility that we really need to be looking for.'",
        "'speaker_8': 'And this is why, you know, you guys all approved it. You citywide with the Blueprint Denver plan. I think that these are very important because they allow us to preserve these existing small homes, you know, that have been built over the last hundred years in our city.'",
        "'speaker_8': 'They those allow us to maintain, you know, a unique neighborhood character. And there are so many ways you can use an Adu to make a home affordable. If you're a senior.'",
        "'speaker_5': 'And you're.'",
        "'speaker_8': 'Aging, you can move into the edu, you know, rent out your main house to cover your expenses, or you can have an in-home caregiver live there. If you're a young family starting out, you could use the rent payment that somebody would give you for the ADU to subsidize the cost of your child care with a live in'",
        "'speaker_8': 'nanny or just, you know, to subsidize the cost of your mortgage. You know, I. I wish we weren't here. Frankly, I don't think that a single project like this should come before our city council, let alone require the same vote as impeaching the mayor.'",
        "'speaker_8': 'But I hope that you all all choose to support this, ADU, so that we can make sure that Denver remains an accessible place for everyone. And I'll just add, as far as the alley concerns, you know, again, we have a lot more density in Baker and there's there's no issues with parking in the alley.'",
        "'speaker_8': 'And I don't believe there would be some from this project either. Thank you so much for your time.'",
        "'speaker_1': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_3': 'Yes. My name is Chen Masuku. Martial Arts and self-defense. Man, I don't know how you do this. Okay. The idea what is a use? We're a couple of things. One to. Help the housing stock. For folks who had jobs and had no house.'",
        "'speaker_3': 'And this land that was on these lots could be used to help build housing for folks who could afford it. The other idea was God came in from the church yesterday. Part of our mission is that we want to give poor people shelter.'",
        "'speaker_3': 'So we want to build one of these aid you so that we can take poor people off the street and put them in a unit so that they can get housing. And that was for the homeless. This is not a homeless activity here.'",
        "'speaker_3': 'It is going down. What are we talking about here? This is for folks who want to create wealth. Period. And I ain't got no problem that. As America does it. It's a matter. So folks who want to take what they got and make some money on that and do whatever they need to do, that would.'",
        "'speaker_3': 'That ain't none of my business. You do what you do. For folks who want to come and take poor people off the street and give them shelter in a blizzard so they don't lose their lives.'",
        "'speaker_1': 'Chairman, could you please. Speaking of my phone.'",
        "'speaker_3': 'You do that. That ain't none of my business. You got a choice to make, and you're going to have to live with decisions you make. I know ideas are not going to solve the problems of homeless people, period.'",
        "'speaker_3': 'It's not going to happen because you don't have those kind of folks in a large majority that have that kind of goodwill. This is America and it's all about money first so we can stop bullshitting up in here.'",
        "'speaker_1': 'Please watch your.'",
        "'speaker_0': 'Language.'",
        "'speaker_3': 'Let them do what you let other folks do and do this thing and our position on it. If you don't like this happening in your neighborhood, you have a choice. Move. You got the money. Move. And let these folks do what they do.'",
        "'speaker_1': 'Thank you. Next up, Kevin Mathews.'",
        "'speaker_8': 'I am Kevin MATTHEWS. I live at 1020 Madison Street in Congress Park. I want to share a quick personal story about ideas and the positive impact they can have. My father and stepmother live in Andover, Massachusetts, a suburb about 25 miles north of Boston.'",
        "'speaker_8': 'They have a Aidoo or a mother in law unit that they built in their early nineties. It's a one bedroom, one bath over their garage with a small living room and a full kitchen. Now, technically, these units are illegal, but at the time, they received a medical exemption from my grandmother, who had health issues.'",
        "'speaker_8': 'She lived there for about.'",
        "'speaker_5': 'Ten years.'",
        "'speaker_8': 'And died in early 2000. And since then, it's said vacant for about a decade, which leads to my stepbrother Mark and his wife, Pam. These are two of the millennials that you keep hearing about in the news who are $100,000 in debt each for advanced degrees and can't afford the expensive metro Boston housing market, which is even'",
        "'speaker_8': 'more expensive than the Denver market. So they pay now. They live they live there. It's not an ideal situation. My brother did not want to move back in with the parents, but it is a private unit. They pay a nominal rent and they live in a town that they could otherwise not afford and take advantage of the'",
        "'speaker_8': 'local communal line into Boston where they both work. My father told me that over the last few years they occasionally shared meals together when they need their privacy. They might not see Mark or Pam for a week or two.'",
        "'speaker_8': 'That is until about two years ago when they had their first.'",
        "'speaker_5': 'Daughter.'",
        "'speaker_8': 'And having doting grandparents nearby can act as childcare when needed. You can imagine how beneficial that is considering the cost of child care for my father and stepmother.'",
        "'speaker_5': 'On the one hand, this.'",
        "'speaker_8': 'Is also provided to be very beneficial. The house is very large and they my dad has just had his 82nd birthday. He's had heart issues for about.'",
        "'speaker_5': '15 years and.'",
        "'speaker_8': 'Has had a couple of surgeries. He can no longer take care of the home, and having that additional help has been an incredible benefit. What I want to point out is this arrangement has allowed my parents to age in place in their own home and without having to leave the community to which they have deep ties and'",
        "'speaker_8': 'friendships. Now, considering the benefits for both of these parties, I can't imagine why anybody would say that this arrangement should be illegal, but it apparently is. I talked to my dad this past weekend and he affectionately refers to this as snob zoning, especially for a town like Andover.'",
        "'speaker_8': 'There are also a couple of towns nearby. I just want to point out the town of Lawrence, Massachusetts, Lowell, Massachusetts, that have undergone a lot of development and a lot of gentrification over the past several years. And it's because of people who would like to live in towns like Andover.'",
        "'speaker_5': 'Who can no longer afford it.'",
        "'speaker_8': 'So it's not the development that's causing those towns to be developed. It's the lack of development in towns like Andover that is causing that gentrification. Help me support this project and so much.'",
        "'speaker_1': 'Thank you. Next up, Gerry Saltzman.'",
        "'speaker_0': 'My name is Jerry Saltzman. I live one block north of Steve Elkins at 1369 Quint Street. I have lived in the neighborhood for 21 years and I fully support Steve's proposal to build an 80 U. I don't think that people realize that our neighborhood already has several 80 youths in it.'",
        "'speaker_0': 'The carriage house and duplex across the street from my house has been there for over 100 years without any negative effects. 80 views are great for our neighborhood because they allow neighbor homeowners to care for elder family members while creating independent housing, provide affordable housing, improve neighborhood security by having more eyes on the street, and may also'",
        "'speaker_0': 'help keep the homeowner within their home by supplementing their income. When I attended the January East Colfax R.A. meeting, there was standing room only a near unanimous support for Steve's application because everyone was so excited about doing the same thing with their properties.'",
        "'speaker_0': 'Since City Council has already passed several policies that encourage affordable housing, let's move forward and enact those policies. Our neighborhood, as well as our city, is struggling to provide affordable housing. What more can Steve do to help solve the affordable housing crisis in our community?'",
        "'speaker_0': 'Then build an ADU. Even though it's very easy to let fear of the unknown or what if's prevent us from doing the right thing. I'm proud to support Steve's effort to help solve the affordable housing crisis because he's going to be adding one housing unit to Denver's rapidly declining housing stock.'",
        "'speaker_0': 'Since Steve's application devotes over 24 pages to detailing exactly how his 80, you will comply with every single term and condition of every single piece of legislation that affects the growth of our neighborhood. I don't see any reason to not support his proposal.'",
        "'speaker_0': 'Doesn't everyone here tonight prefer to see an edu in Steve's backyard as opposed to a gigantic two and a half storey home? Isn't an Adu much more in line with maintaining the character of our neighborhood? Thank you for letting me speak here tonight.'",
        "'speaker_1': 'Thank you. Next up is Jeffrey Baker and I invite Sarah Sander, half Tina Winston, Logan Meier, Tim Roberts and Leslie Talkhouse Gorski to the front row.'",
        "'speaker_0': 'Go ahead. Good evening, counsel Jeff Baker.'",
        "'speaker_8': '2422 Tampa Street. I'm not going to go long. I'm going to go real quick on this. A lot of people already mentioned this has been in Blueprint Denver. You guys know the benefits of this. So I'll just restated again.'",
        "'speaker_8': 'Multi-generational families, rental income, housing security, aging in place, nanny quarters keeps McMansions out. Denver needs us. Let's do the first rezoning with new blueprint. Denver tonight. Thanks.'",
        "'speaker_1': 'Thank you. Next up, Sarah Sanders.'",
        "'speaker_5': 'Hi, I'm Sarah Sanders. I live at.'",
        "'speaker_12': '1378 Raleigh Street. I live in an Adu and an affordable adu. It's a rental unit.'",
        "'speaker_5': 'That I rent from the owner and I'm here in support.'",
        "'speaker_12': 'Of Steve with his a this rezoning proposal. We have a huge affordability issue right now in Denver and we need to do everything we can to get more people into affordable housing. 80 uses one solution to this with the comprehensive plan and blueprint Denver being adopted.'",
        "'speaker_12': 'I encourage all of you to move forward with this rezoning. I think that there is some fear out there with some.'",
        "'speaker_5': 'Homeowners in the neighborhood.'",
        "'speaker_12': 'And the one thing that I can say living in an EDU is it does help to activate the alleys. There's I have a parking spot dedicated to me. And so there isn't any parking issues that we have to deal with.'",
        "'speaker_12': 'The idea that I'm living in so I think that there is some fear out there around. I encourage everybody who does have that fear to get out there and take a look at these ideas and really see that this is gentle density that our city needs to be moving forward.'",
        "'speaker_12': 'Thank you very much.'",
        "'speaker_1': 'Thank you. Next up, Tina Winston.'",
        "'speaker_5': 'Good evening, council members. My name is Chris and I own a home in the Val Verde neighborhood. I'm currently thinking about adding an avenue to my property because my mom is aging in Philadelphia and I would like to move her out here with me.'",
        "'speaker_5': 'She's currently on a fixed income. She's unable to afford to continue to live in Philadelphia. And so as a family, we're trying to figure out what's the best thing to do for her currently. As we looked at pricing for assisted living or temporary kind of living arrangements for her, we realize that a nursing home with semi-private would'",
        "'speaker_5': 'be like 70 $400 a month and a private nursing home room would be like 80 $500 a month, which we cannot afford.'",
        "'speaker_9': 'So we're thinking about, hey, maybe we'll like put her out in the back of his.'",
        "'speaker_5': 'House kind of thing. So I met Steve Elkins when in Utah a couple weeks ago, was the first time I ventured out into this avenue of interest.'",
        "'speaker_9': 'And I support his idea.'",
        "'speaker_5': 'Basically, I support it because it would actually benefit me and my family as we move further down the road in this process as my mom ages. Thank you.'",
        "'speaker_1': 'Thank you. Next up, Logan Meyer.'",
        "'speaker_16': 'Exactly today. To answer that one, I was curious how economically productive it is. Turns out East Colfax of 116 neighborhoods is 23rd from the bottom or 93rd overall. Where a neighborhood needs to produce a dollar six per square foot of residential land to pay for its own infrastructure.'",
        "'speaker_16': 'East Colfax only produces $0.23 per square foot of residential land in property tax. Lastly, maybe Colfax is just meant to be single family. But then I checked and only 56% of housing units are single family in the East Colfax neighborhood.'",
        "'speaker_16': 'So a neighborhood that can't pay for its own infrastructure in a city with an affordable housing crisis, in an area that has lots of multi-unit development. We are requiring city council approval to build one housing unit in the backyard of a local owner.'",
        "'speaker_16': 'No wonder young people and old people alike are struggling to find affordable housing in the city.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_1': 'Thank you. Next up, Tim Roberts.'",
        "'speaker_8': 'Thank you. My name's Tim Roberts. I live in Denver and own a business at 7935 East 14th Avenue in the East Colfax neighborhood, where I'm the president of the Registered Neighborhood Association. We had a widely publicized well attended by some 50 people, a diverse neighborhood meeting on this rezoning on January 15th, 2019.'",
        "'speaker_8': 'The issue was in many ways really fully aired. And we then had a vote that unanimous that was unanimously in favor of the rezoning. We continue as a neighborhood to support Mr. Elkins and the engaged, thorough and considerate way he's brought this project forward in too many ways to cover here.'",
        "'speaker_8': 'He seems to have provided us with an on the ground model for how to use can work, and I think many people are grateful. One thing I want to say about the East Colfax neighborhood is that we are fighting to maintain as much affordability as we can.'",
        "'speaker_8': 'We were heartened by the recent announcement of two new affordable housing developments along East Colfax Avenue, but we know we still have far to go. It's been stated that we have as much as 70%, a clear majority of our population of about 12,000 people who fall into the category of vulnerable to displacement, with well over 30% of'",
        "'speaker_8': 'people listed in the category of in poverty in our neighborhood. Property valuations recently bounced up in our area by over 30%. This on top of a very similar severe increase in the last evaluation cycle. The resulting property tax increases are expected to potentially be the last straw for many of our residents.'",
        "'speaker_0': 'Either through direct tax or increased rents. We are.'",
        "'speaker_8': 'Losing people. We also recognize that addus and the considerable resources that they take to build are not a fix for what can probably be called an affordability crisis in East Colfax. We need as many as 1400 0 to 30% MRI units to, in fact, not just mitigate, but to prevent displacement.'",
        "'speaker_8': 'I feel like many realize that while the neighborhood was constructed primarily as single family homes, the growing density of Denver has simply overtaken it. So that to fight for the completely intact preservation of this particular built environment becomes increasingly untenable for a whole range of reasons.'",
        "'speaker_8': 'That said, on a daily basis, you can see people of East Colfax embracing the kind of openness and diversity I'm talking about. We're excited.'",
        "'speaker_0': 'To see equity taking root.'",
        "'speaker_8': 'Around us, and we'll continue to applaud Mr. Elkins and others like him for their work and willingness to invest some.'",
        "'speaker_1': 'Certainty in the future. Thank you. Thank you. Next up, Leslie Torrijos key.'",
        "'speaker_5': 'Thank you. I'll be brief because it's late. My name is.'",
        "'speaker_7': 'Leslie Terry Gaskin. I live at 1754 Olive Street.'",
        "'speaker_5': 'It's within a mile of of the adu that has been applied for. I'm here to speak in strong support of Mr. Elkins application. As Jerry noted, there's many adus already existing in our neighborhood. I think this would fit very well, and I hope to have one as well in the future.'",
        "'speaker_5': 'So thank you. And before I go, I want to say thank you, Councilwoman Sussman. Councilman Espinosa and Councilman Brooks, for all you've done over the last 4 to 8 years. And I look forward to working with you all in the future.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_1': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_13': 'They're certainly not loose. Jesse Pierce representing for Denver Homicide. Low Black Star. It's a moment for self defense and positive for social change. And I was on top of the ballot for our lives this past May 2019 election.'",
        "'speaker_13': 'Almost got 15,000 votes with no money. We are in favor of this. As I stated previously, I support attainable means of housing in the city while we're dealing with a housing crisis. So that includes 80 youth along with tiny home villages, encampments and etc..'",
        "'speaker_13': 'So yeah, I approve this. I'm in favor of this. So yeah, I already know you're going to approve this. And we saw the criteria and it's a step in the right direction. We can do much better, though. So since we can do better, let's do better.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Are there any questions from members of Council on this item? Councilman Espinosa.'",
        "'speaker_8': 'A question for the applicant or maybe actually staff, actually. Now either one. What is the size of the zone lot? And then given it was mentioned that the existing structure is a thousand square foot footprint. Given that size relative to the lot, how big of a of a footprint would be the maximum for an ADU on that'",
        "'speaker_8': 'parcel?'",
        "'speaker_11': 'All right, the.'",
        "'speaker_5': 'Thing.'",
        "'speaker_7': 'About this.'",
        "'speaker_11': 'Uh, the zone lot is it's about 7320 square feet for a lot of that size, the maximum to use detached to you building form would be up to 1000 feet. And I am not sure myself about the existing foot footprint.'",
        "'speaker_11': 'And so what would if that 4000 would be allowed with the maximum lot coverage? But I believe that it would. I don't know if the applicant.'",
        "'speaker_8': 'Not so, Councilman Espinosa.'",
        "'speaker_0': 'My current house is 719 square feet. There is approximately a 300 square foot attached garage. By the code, a thousand square feet is allowed. However, then we get into setbacks. Then we get into the fact that I still would like to have a yard.'",
        "'speaker_0': 'Then we get into the fact of I have a driveway at the south of my property, which I'm not interested in getting rid of. So all of these factors start whittling down that 1000 square foot footprint pretty quickly.'",
        "'speaker_8': 'And then what is. Is this. Sorry, I could have looked it up, but I didn't. Is this one of those? Is the decks one. One of those in districts where the bulk gets relaxed on the edu. When you have an attached, I mean, a detached accessory structure.'",
        "'speaker_8': 'The rear and the rear 35%.'",
        "'speaker_11': 'I'm not sure what you mean exactly by the book. Relax, but I do have the book plane. Okay, I'm here. So for the SD one X, the bulk plane vertical height is ten feet and the slope is 45 degrees.'",
        "'speaker_8': 'Even for an accessory structure, yes.'",
        "'speaker_11': 'That is for the detached accessory dwelling unit building form.'",
        "'speaker_8': 'Great. Thank you.'",
        "'speaker_1': 'No further. Thank you. Councilman Espinosa. Councilman Flynn.'",
        "'speaker_6': 'Thanks, Mr. President. Hello. Could you clarify for me the issue of the legal protest? The staff report attachments say that there was it has a map and it has 46,000 square feet out of whatever it is. It's about 21% just over the threshold yet in your report.'",
        "'speaker_6': 'There's also an email to I believe it's to you. And there is a an email earlier from the person who lives at one of those properties that is listed as contributing to the 20% stating that she is not in opposition.'",
        "'speaker_6': 'What is so is this a legal protest or not.'",
        "'speaker_11': 'So that the the the properties are showing up in green did have valid signatures for those properties. I was not involved in the signature gathering that is purely done by a member of the public. We just provide the information for it.'",
        "'speaker_11': 'So I'm not sure what conversations went on. What if there is a change of opinion? We do sometimes get people who have sent the case manager a letter in support and then they later reply and say, Actually, I'm in opposition or the other way.'",
        "'speaker_11': 'I didn't hear back from anybody. So I didn't like change the tallies because no one reached out to me. So I'm not really sure what that discrepancy was around.'",
        "'speaker_6': 'Okay, Mr. Brown, I just wanted the record to note that one of the properties listed as contributing to the 20%. There are two pieces of correspondence in the record that state they are not opposed. So I'm a little bit confused about that.'",
        "'speaker_6': 'I'm sorry. The owner, Mr. Elkins.'",
        "'speaker_0': 'Okay? Yes, Councilman.'",
        "'speaker_6': 'Thank you. You have a an attached garage and you access it from the alley. Correct. You have a long driveway off the alley.'",
        "'speaker_0': 'A very long driveway.'",
        "'speaker_6': 'Okay. So your garage doors in the back of the house.'",
        "'speaker_0': 'It is. It's interesting because I've seen this pattern.'",
        "'speaker_6': 'I'm looking at on the map here as.'",
        "'speaker_0': 'I've seen other houses. There's a Tudor house on the north side of Colfax where it's the same. So if you look at my house from Quint Street, it appears to be a white ranch home.'",
        "'speaker_6': 'And the one across the alley from you as well.'",
        "'speaker_0': 'When and actually I know how long that driveway is because I've shoveled it out a few times this past winter.'",
        "'speaker_6': 'Okay. So what you're saying is that with it, with the setbacks and with your desire to maintain that driveway, to access your garage, have you looked into what what the footprint of your ADU would be?'",
        "'speaker_0': 'I have it. You know, there's also been a conversation with the neighbor whom, as Steve said, neither was opposed or supported, where she and I engaged over a few emails where she considered asking me to consider and attached to you.'",
        "'speaker_0': 'So I have considered converting the attached garage into an idea which would further limits its impacts.'",
        "'speaker_6': 'Okay. And then maybe put a garage back toward the alley for yourself?'",
        "'speaker_0': 'Maybe. But I'm much more about housing people than cars. Mm hmm. Okay.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Flynn and Councilwoman Sussman.'",
        "'speaker_12': 'Thank you very much. Mr. President, I wanted to follow up on, though, on Councilman Flynn's questions about the legal protest. And this is directly related perhaps to this particular issue. But it is something that, as I leave the council, is something that I wish that we would maybe look into it more carefully.'",
        "'speaker_12': 'So we take this particular situation. The legal protests requires not 20% of the landowners around a property, but. Owners of 20% of the land. That's correct. And that's a very, very important distinction. It's the owners of 20% of the land, so that the more land you own, the more your vote means.'",
        "'speaker_12': 'In this particular situation, how many votes, how many signatures would have been needed to get a legal protest.'",
        "'speaker_11': 'Given this normal lot? So, so so this legal protest, just it needed every property that was included, but it included three that were only partially within the zone law. So I apologize. I cannot do math in my head after 10 p.m., but I believe it would probably be more like six if they were all within.'",
        "'speaker_11': 'That would be kind of the minimum number of people. Yes. That that might have gotten you over that threshold.'",
        "'speaker_5': 'That's exactly right.'",
        "'speaker_12': 'As I was calculating that to get a legal protest in this case would only require six votes. How many votes did they get?'",
        "'speaker_11': 'There were the property, the owners of eight properties, and two of them had two owners listed. So it was a total of ten people who signed the petition, including.'",
        "'speaker_12': 'Who were it was sort of a nebulous about what their vote was. Right.'",
        "'speaker_11': 'I won't weigh in on their final opinion, but there there was some there was there were some people who had voiced opinions seemingly in both directions.'",
        "'speaker_12': 'That's right. Okay. So it's not directly related to some, you know, something that you know about ADOS, but it is something that I would exhort my fellow council people to take a look at in the future about what illegal protest means and what it means to one person, one vote.'",
        "'speaker_12': 'Think, Oh, wait, I had another question. The Ms.. West, can I ask can I ask you a question.'",
        "'speaker_0': 'Is last one.'",
        "'speaker_12': 'You said that you had bought your home in anticipation of retirement. Do you live there? Is this directly north of hit this home? Right.'",
        "'speaker_15': 'It's directly north. I do not live there now, actually. My granddaughter lives there now. She's custodian of it as she's taken good care.'",
        "'speaker_12': 'Okay. So she rents rented from you? Yes, she does. Okay. Thank you very much.'",
        "'speaker_15': 'You're welcome.'",
        "'speaker_1': 'Thank you. Councilwoman Sussman, Councilman Espinosa.'",
        "'speaker_8': 'Sort of a question for Councilman Flynn. I didn't go through those attachments enough to see. Do you know if the letters that are from the person that lives there is from the property owner?'",
        "'speaker_6': 'Yeah.'",
        "'speaker_8': 'Okay, that's that was it. Because if we're clarifying for the record, I want to make that distinction because it's the property owner that has the say in the legal protest, not necessarily the person that lives there. So thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. All right. Seeing no other questions. The public hearing for Council Bill 19 20447 is closed. Comments by members of Council. Councilwoman Sussman.'",
        "'speaker_12': 'Thank you, Mr. President. I want to thank everybody for staying so long before this, for this particular item and to what I what I thought was a very interesting council meeting. But I don't know if you all felt the same way.'",
        "'speaker_12': 'I particularly want to thank the neighbors that live in East Colfax, and particularly Tim Roberts, the R.A. president, and how much he has done for the neighborhood as as previous presidents have, too. I was at that meeting that he spoke about when there were about 50 people.'",
        "'speaker_12': 'The East Colfax Neighborhood Association has a meeting every month. So unlike most of our neighborhoods every month, and they get 30, 40 and 50 people every time. So it's a very engaged neighborhood. And they thanks to Steve, they were all, you know, very familiar with your project.'",
        "'speaker_12': 'You did a great deal of outreach to the neighbors and it was an overwhelming support for the you. And I think it just meets a lot of the criteria that are found in the new blueprint, Denver and the comprehensive plan and the neighborhood area.'",
        "'speaker_12': 'So I'm going to be in support of this and urge my fellow council people to do so as well.'",
        "'speaker_1': 'Thank you, Councilwoman Sussman. Councilman Brooks.'",
        "'speaker_8': 'Thank you, Mr. President. And Dr. Sussman, it's lovely to follow you one last time on this rezoning. And I just Mr. Elkins, I just want to apologize to you on the city's behalf. The fact that we spent three years to talk about the importance of aid use, the fact that I just worked on 80 or 80, used'",
        "'speaker_8': 'for an affordable housing component for folks displaced for I-70. We do this in all of our neighborhoods. And that's you spent 4 to 6 months to go through a rezoning process. Did you get to do them at the same time to put your permits in, or do you still have to go through permitting?'",
        "'speaker_0': 'Okay.'",
        "'speaker_8': 'So he's going to have another probably 3 to 4 months before one person can live in that space. And, you know, we talk a lot about affordable housing. We talk a lot about the importance of making sure people can afford to live in the city of Denver.'",
        "'speaker_8': 'But we have archaic permitting processes to get us there. And so, you know, I'm sorry, I apologize for that because we're not really serious as a city. We're serious when we start expediting processes for affordable housing. We're serious as a city.'",
        "'speaker_8': 'When we start saying, hey, we've implemented this plan and now we're going to give incentives to build a use. We're going to waive tap fees, we're going to do these things. And you have to now make sure that you have these 80 issues at 80%, 60%, 40% am I to live there?'",
        "'speaker_8': 'Their deed restricted because that's what we did in Swansea. And so that's where I'm at. I'll be supporting this because it meets the criteria because we spent three years talking about this. I know that everybody doesn't love it, but I got a chance to move into the whole neighborhood in 2012.'",
        "'speaker_8': 'Actually, I moved there in 2008, but in 2012 about another house there and I bought it for $290,000. That's amazing.'",
        "'speaker_0': 'Now.'",
        "'speaker_8': 'If I moved into that house, you can't buy a house there for $200,000 now. If I said to everyone, I hope everyone gets to move into this house, this neighborhood, because it's quaint. It's amazing. My kids are growing up there for $280,000, but I say no one can reason, no one can.'",
        "'speaker_8': 'All these infill projects, no one can have in any of those. There are affordable housing folks, projects that are 0% AMI and they're going to be homeless folks living there. They can't live next to me. No, you can have the tiny home village over here next to me.'",
        "'speaker_8': 'I have created a wall. I have created a gated community. That's not who we are, y'all. That's why I'm supporting this project. And that's why, even after eight years, I'm more emboldened to create this city that we all dream of.'",
        "'speaker_8': 'So I'll be supporting this. I'm sorry, Mr. Elkins. We're going well. They're going to get better at improving processes. And I'm sorry. City of Denver. We're going to get better at telling people what we really believe. That we really do want to create an inclusive Denver.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Espinosa.'",
        "'speaker_8': 'I'm sorry and I'm not sorry. A little over three years ago, I sat down with our legal counsel and asked him to draft a an ordinance that would allow would legalize Adu citywide the way people had been asking.'",
        "'speaker_8': 'So that, in theory, would help you. But the the way I was justifying that was I was actually asking that the property owners within 20 feet essentially had veto. Right. Meaning that you would go in, you would you would have legal right to do to you.'",
        "'speaker_8': 'You would bring your permit drawings in and you would have to post. Sort of like we do with a zipline or something like that. And that's when your neighbors could opine and you would lose. If they vetoed you, then you'd lose the right for three years to sort of come back.'",
        "'speaker_8': 'But the idea being that then you could actually know that and have that conversation with those property owners that are most directly impacted about siting. And if you're going to be a humble developer and we're conscious of that, you could probably be through that process or not, depending on how amicable your neighbors are.'",
        "'speaker_8': 'So hopefully it would have worked out for you and this would have never have happened and we could move on. And I am articulating that now. So maybe the city can still consider that. I do have the language that I gave the city attorney back then.'",
        "'speaker_8': 'If anyone wants to see it that said, the I do want to give a little bit of an admonition to the yimby folks. The Blueprint Denver process did not legalize this or say this happens everywhere, period. It says that it should be considered as part of a citywide process.'",
        "'speaker_8': 'These one office buildings are here for a reason because we have not gone and embarked on that citywide process. And so this is not carte blanche or legal license to do this everywhere, even though I have yet to see us deny an ADU, you know, a zoning request, that is essentially for the specific purpose of of to'",
        "'speaker_8': 'use. It does bother me that we're using that language in the new adopted plans that is intended to support that citywide process to then support these these one off rezonings. That's because it does create this air of. Is there any what are the conditions where it's inappropriate.'",
        "'speaker_8': 'And until we hear from those communities that truly have a need or desire to not have to use for whatever reason, it makes all communities vulnerable. That said, I prior to my tenure on council, I was a member of the Board of Adjustment and I was probably consistently the one member of the board that always allowed illegal'",
        "'speaker_8': 'adus. I mean, I supported them to exist and I said it before and I won't go into my family history, but that the stories that were articulated here were very much part of my community when I grew up.'",
        "'speaker_8': 'Having these units is is important to a healthy city. That said, it's not I'm not going to use my personal bias to make the render the opinion, but it is because I'm going to say also there was a lot of talk about Ali Al activation as a member of council.'",
        "'speaker_8': 'I can tell you that an ADU has been a big problem in one of my neighborhoods. Why? Because there's a lot of ali activation, but it's from the drug dealing that goes on out of that. ADU And so it happens to be the son of the mother who lives in the primary structure, who then has a criminal'",
        "'speaker_8': 'record, lives in the back and and does his dealings. And he's been twice busted, but he's released and he goes back to his old ways. The property is poorly maintained and it is a criminal. It attracts other criminal elements.'",
        "'speaker_8': 'So while we have all these nice anecdotal stories of how wonderful all these things are, they can be nodes for a different kind of attention because there aren't a lot of eyes on that, Ali. So. I just. I just want to know that, you know, when when that isn't always hunky dory, we aren't always going to get'",
        "'speaker_8': 'the outcomes. But this is an area east Colfax is an area that has struggled to activate and we are investing in major redevelopment and efforts along East Colfax. And the key, just like it's been key in northwest Denver, is having density of population in order to support a more robust urban fabric.'",
        "'speaker_8': 'If we want to see reactivation of East Colfax and you're in your commercial corridors, you have to have more people with more disposable income. And there are two ways to doing that, you know, granularly like this or with massive redevelopment like you've seen in other places.'",
        "'speaker_8': 'And so we have to pick our poison and you could say, no, we don't. But this, you know, our plans do call for this area to capture up to 10% of new growth. And this is one way, but I hope that as part of a citywide process, we don't create carte blanche.'",
        "'speaker_8': 'The conditions where once again, areas like this remain depressed because we create we create these redevelopment opportunities in areas where people want to spend their money, because that's what happens. You see investment in hot areas and reinvestment in hot areas and Cherry Creek doubling and tripling itself in northwest Denver, eating itself alive because they're desirable.'",
        "'speaker_8': 'And if we grant this same development entitlement across the board, city wide, that same things will happen in those same areas and these areas will then stay stagnant again. So we have to be strategic going forward. This rezoning process for the time being is the appropriate process until we've had that citywide discussion that starts to consider these'",
        "'speaker_8': 'bigger issues. With that, I'll be supporting this research.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Saying no one else in the queue for comments councilmembers. This a reminder that since community planning and development has determined that the requirement for a legal protest has been met and ten affirmative votes instead of the standard seven affirmative votes of counsel are required tonight to pass this bill.'",
        "'speaker_1': 'Madam Secretary, roll call on Council Bill 447.'",
        "'speaker_7': 'Susman.'",
        "'speaker_5': 'I black eye.'",
        "'speaker_8': 'Brooks Hi.'",
        "'speaker_7': 'Espinosa.'",
        "'speaker_0': 'Hi Flynn.'",
        "'speaker_7': 'Hi Gilmore.'",
        "'speaker_5': 'Hi, Herndon.'",
        "'speaker_7': 'Hi Cashman, EJ Lopez.'",
        "'speaker_10': 'Hi, Ortega. Hi.'",
        "'speaker_7': 'Mr. President. All right.'",
        "'speaker_1': 'Madam Secretary, please close voting and announce results.'",
        "'speaker_7': '12 hours.'",
        "'speaker_1': '12 hours, CONSTABLE four for six has passed. On Monday, August 5th, Council will hold. On Monday, August 5th, Council will hold a required public hearing on Council Bill 584, amending Chapter 59 of the Denver Revised Municipal Code to revise the amendment procedure for land retaining planned unit development zoning under former Chapter 59, saying no other business before'"
    ]
}