{
    "A resolution amending the Denver City Council Rules of Procedure concerning the time and order of regular council meetings.  Amends the Denver City Council Rules of Procedure. The Committee approved filing this item at its meeting on 6-21-22.": [
        "'speaker_0': 'Councilmember Black has called out Bill 791 for an amendment under bills for final consideration. No items have been called out and pending. No items have been called out. Madam Secretary, please put the first item on our screens. And Councilmember Flynn, go ahead with your comments on resolution 741.'",
        "'speaker_3': 'Thank you, Madam President. First of all, I want to recognize and thank Councilman Herndon for the long and tedious work he's been doing on modernizing our meetings. This meeting will look a lot different next week, and I don't know if Councilman Herndon might want to talk after me about how it will look different.'",
        "'speaker_3': 'But I wanted to. I will support the resolution and the changes. But I do have some concerns about moving public hearings to begin as early as 530 rather than the 6:00 time that we have now to start any public hearings.'",
        "'speaker_3': 'It used to be Councilman Ortega will remember it used to be that this meeting would start at 630 in the evening and it would give working families and folks coming through rush hour, maybe a grab a little bite to eat and come down here and attend a public hearing at 630.'",
        "'speaker_3': 'When these meetings were moved to 530. It was with the understanding that no public hearing would begin until 6:00. And so if this preliminary part of the meeting had wrapped up at 545, we would which we would recess until 6:00 to give people a chance to come down here or now with the hybrid model to get online'",
        "'speaker_3': 'after they've come home, maybe changed out of their work clothes, maybe fed the kids or or did some other business. And I would rather that this resolution had set the Times for the afternoon session of council to begin at 3:00 rather than 330, and for the evening session to start at 530 with the general public comment session'",
        "'speaker_3': 'and then the public hearings starting at 6:00. I think that would have been much friendlier, much more friendly to our public who comment whether they're online or whether they come down here in person. But nevertheless, I will support the changes because I think they're much needed.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Madam Secretary, please put the next item on our screens. Councilmember Flynn, would you please put Resolution 842 on the floor for adoption?'"
    ],
    "A resolution authorizing and approving the expenditure and payment from the appropriation account designated liability claims, the sum of Forty Thousand Dollars ($40,000.00) made payable to Condit Csajaghy LLC COLTAF Account, in full payment and satisfaction of any and all claims related to the civil action captioned Edward Lee Hicks v. City and County of Denver, Denver Health And Hospital Authority, Jerome Gonzales, Gabriel Griego, and Frank Rolando which was filed in the United States District Court for the District of Colorado, Case No. 1:17-cv-03001-DDD-KLM. Settles a claim involving the Denver Sheriff Department. This item was approved for filing at the Mayor-Council meeting on 7-12-22.": [
        "'speaker_3': 'Thank you, Madam President. I move that council resolution 22, dash 084 to be adopted.'",
        "'speaker_0': 'Has been moved and seconded. Comments by members of Council. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Madam President. I just call this out so that I can vote no. Thank you.'",
        "'speaker_0': 'Thank you, Madam Secretary. Roll call on Council Resolution 22, dash 0842.'",
        "'speaker_3': 'Flynn may.'",
        "'speaker_2': 'Gilmore.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Herndon. I. Hindsight. Cashman. Kenny Ortega no. Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Sawyer I.'",
        "'speaker_2': 'Black I. See tobacco.'",
        "'speaker_3': 'Clark, I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': 'Tunisia.'"
    ],
    "A bill for an ordinance designating certain properties as being required for public use and authorizing use and acquisition thereof by negotiation or through condemnation proceedings of fee simple, easement and other interests, including any rights and interests related or appurtenant to properties designated as needed for the Federal Boulevard Pedestrian Safety Improvements. Grants the authority to acquire through negotiated purchase or condemnation of all or any portion of any property interest as needed in support of the Federal Boulevard Pedestrian Right-of-Way Safety Improvement Project in Council District 1, including easement interests, access rights, improvements, buildings, fixtures, licenses, permits and other appurtenances. The last regularly scheduled Council meeting within the 30-day review period is on 8-8-22. The Committee approved filing this item at its meeting on 7-5-22.": [
        "'speaker_0': 'Lebanese Lebanese Council Resolution 22 zero 42 has been adopted. Madam Secretary, please put the next item on our screens. Councilmember Flynn, will you please put Bill 791 on the floor for publication?'",
        "'speaker_3': 'Thank you, Madam President. I move the council bill 20 2-0791 be ordered published.'",
        "'speaker_0': 'It has been moved and seconded. Councilmember Black, your motion to amend.'",
        "'speaker_4': 'Thank you, Madam President. I move that council bill 20 2-0791 be amended for the.'",
        "'speaker_0': 'Following particulars page one.'",
        "'speaker_4': 'Strike lines six through ten and replace with four an ordinance designating certain properties as being required for public use and authorizing use and acquisition.'",
        "'speaker_0': 'There.'",
        "'speaker_4': 'Of by negotiation or through condemnation proceedings of B simple.'",
        "'speaker_0': 'Easement and other.'",
        "'speaker_4': 'Interests, including any rights and interests related to a pertinent to properties designated as needed for the Federal Boulevard. Pedestrian Safety Improvements.'",
        "'speaker_0': 'Thank you. It has been. Has it been moved and seconded? Yes. Comments by members of Council Councilmember Black.'",
        "'speaker_4': 'Thank you. Council President. This amendment replaces an incorrect title to match the bill description used as it passed through committee.'",
        "'speaker_0': 'Madam Secretary, roll call on the amendment to the 791.'",
        "'speaker_2': 'Black. I see. Tobacco. Clark.'",
        "'speaker_3': 'I. When I.'",
        "'speaker_2': 'Gillmor i Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Hines.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Cashman can each i. Ortega, Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Sawyer.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_2': '3939.'",
        "'speaker_0': 'The Council bill 20 20791 has been amended. Council member for immediate a new motion to publish as amended.'",
        "'speaker_3': 'Yes. Thank you, Madam President. I move the council bill 20 20791 be ordered published as amended.'",
        "'speaker_0': 'It has been moved and seconded comments by members of Council and Council Bill 20 20791 as amended. Seeing no comments. Madam Secretary, roll call on Council Bill 20 20791 as amended.'",
        "'speaker_4': 'Black Sky.'",
        "'speaker_2': 'CdeBaca.'",
        "'speaker_0': 'Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Flynn II.'",
        "'speaker_0': 'Gilmore I.'",
        "'speaker_2': 'Herndon Hines. High Cashman. Kenny Ortega. Sandoval.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Sawyer Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 Eyes counts at a 22 dash, 0791 has been ordered published as amended. That concludes the items to be called out. All other bills for introduction are ordered published. Council members remember that this is a consent or block vote and you'll need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Flynn, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_3': 'Yes. Thank you. I move that resolutions be adopted and bills on final consideration be placed upon final consideration and do pass in a blog for the following items. All series of 22 771 773 741 752 772 776 777 778 779 781 782 786 795 796 797 774 843 732 737 738 746 646, seven, 30 and 695.'",
        "'speaker_0': 'It has been moved and seconded. Madam Secretary, roll call. Black eye. CdeBaca I.'",
        "'speaker_2': 'Clark. All right. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Gillmor, I. Herndon, I. Hines All right. Cashman. Kenny Ortega. Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Sawyer.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results. 3939 As the resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 20 20477 changing the zoning classification for multiple properties in the Regis neighborhood.'"
    ],
    "A bill for an ordinance changing the zoning classification for multiple properties in the Regis Neighborhood. Approves a legislative map amendment to rezone multiple properties from U-SU-C to U-SU-C1 (allows for accessory dwelling units), located in the Regis Neighborhood in Council District 1. The Committee approved filing this item at its meeting on 5-3-22.": [
        "'speaker_0': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Council Member Flynn Will you please put Council Bill 20 2-4, seven, seven on the floor for final passage?'",
        "'speaker_3': 'Yes, Madam President, I move the council bill 20 2-0477 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded the required public hearing for Council Bill 20 2-477 is open. May we have the staff report?'",
        "'speaker_5': 'Yes, ma'am. Good evening, Madam. Council and Council. Good evening. Value from community planning and development filling in for my colleague Andrew Webb to present this proposed rezoning in the Regis neighborhood. The proposed Legislative Map Amendment is sponsored by City Council member Amanda Sandoval and would be rezoning properties with single unit zoning in the Regis neighborhood to allow'",
        "'speaker_5': 'accessory dwelling units for short adus. The proposed rezoning is in Council District one and is in the Regis neighborhood at the far northwest corner of the city. If adopted, it would rezone approximately 1025 parcels or approximately 145 acres to U.S., U.S. one or urban neighborhood context single unit residential with accessory dwelling units allowed.'",
        "'speaker_5': 'The next few slides will summarize existing context of the area, including current zoning, land uses and building firm and scale lithium. Existing zoning of the subject area is you as you see currently a single unit zone district in the urban neighborhood.'",
        "'speaker_5': 'Context surrounding zoning includes you as you see to the south of I-70, open space to the west in commercial corridor along federal to the east properties in the commercial area to the south of the Regis University campus are zoned for mixed use.'",
        "'speaker_5': 'The neighborhood to the north has city of Wheat Ridge ar dash to zoning a district that allows single unit and duplex uses. Existing line users in the subject area are primarily single unit residential users with a handful of duplex and multi-unit uses distributed throughout the neighborhood.'",
        "'speaker_5': 'Adjacent land uses include the university campus to the northeast, commercial and higher density residential along low levels south of the universe of university auto oriented commercial uses along federal to the east. A golf course to the West and I-70 to the north.'",
        "'speaker_5': 'This slide shows examples of the existing built form and scale in the Regis neighborhood. The image at the top right shows typical one and two storey residential development on the west side of the neighborhood. The image in the center shows a typical streetscape in the area south of university, and the bottom photo shows development along Lowell South'",
        "'speaker_5': 'at the university. In terms of public outreach, the applicant sent mailers and distributed fliers about the proposed rezoning in November of 2021 and held two virtual town halls in December. The District one office hosted an online survey from November 2021 to February of 2022, and of the 292 responses received, 89% of the responses said they supported this'",
        "'speaker_5': 'proposed rezoning. To speak to the process. This item went to planning board on April 20th, followed by Land Use Transportation and Infrastructure Committee on May 3rd, and is being heard today by City Council. With regard to public comment, staff has not received formal input from any Arnaud's in the area as of the date of the staff report'",
        "'speaker_5': '. CPD has received more than 35 letters and written comments from residents indicating support for the proposed amendments as a way to add lower cost housing options and opportunities for the neighborhood. Staff also received two written comments in opposition to the proposal, citing concerns about additional on street parking demand.'",
        "'speaker_5': 'In order to adopt a legislative rezoning, the Council must find the proposal is consistent with these three criteria from the Denver zoning code. With regard to the first criterion, there are three adopted plans that impact the Regis neighborhood the Comprehensive Plan 2040 Blueprint.'",
        "'speaker_5': 'Denver and the Denver Office of Housing Stability. Five Year Plan. This proposed rezoning is consistent with Blueprint Denver's. Recommended. Sorry. This proposed rezoning is consistent with Blueprint Denver's recommended future neighborhood context of urban as the proposed US. You see, one zone district is within the urban context.'",
        "'speaker_5': 'Blueprint. Denver designates the subject area with a future place type of low residential, which is characterized primarily by single and two unit residential uses, and where Blueprint states that accessory dwelling units should be encouraged. The Regis neighborhood is served by a variety of street types, including residential collectors, commercial arterials and local streets.'",
        "'speaker_5': 'Rezoning to allow adus is appropriate for this grid of street types. Blueprint. Denver's growth strategy identifies the subject area as being within all other areas of the city where most lower scale residential growth is expected. The proposed rezoning is also consistent with several Blueprint Denver strategies, including recommendations to expand allowance for accessory dwelling units in residential areas'",
        "'speaker_5': 'and to prioritize larger scale legislative rezonings to implement plan recommendations. As you are aware, Blueprint also recommends analysis of rezonings with an equity lens by considering access to jobs and services, vulnerability to inventory displacement and impacts to housing diversity with regard to access to opportunity.'",
        "'speaker_5': 'The Regis Neighborhood House has averaged scores for access to health.'",
        "'speaker_4': 'Care.'",
        "'speaker_5': 'And lower than average child obesity. This rezoning will provide new housing in an area where daily needs can be met. With regard to volcanic vulnerability to displacement, the region's neighborhood is generally less vulnerable due to a higher than average household income and higher than average percent of home ownership.'",
        "'speaker_5': 'This proposed rezoning will allow more property owners to establish an accessory dwelling unit on their property, which can be an opportunity to build wealth and help keep current residents in place and provide more housing options for households who are vulnerable to displacement.'",
        "'speaker_5': 'Finally, with regard to housing diversity, this area has a lower than average number of lower cost missing middle housing and rental housing. This proposed rezoning will help increase the availability of both. The proposed rezoning furthers the furthers several recommendations of the host's five year strategic plan, including recommendations to encourage smaller scale development and affordable housing and expansion'",
        "'speaker_5': 'of accessory dwelling units. Regarding the other two criteria, this rezoning to you, as you see, one will resort real will result in the uniform application of zoned district building, form, use and height regulations. The proposed rezoning will also improve public health, safety and welfare by introducing a new type of housing in the area that allows people with'",
        "'speaker_5': 'a range of income levels to continue to live in the neighborhood. And by allowing limited infill development with a modest increase in housing units that provide opportunities for existing and new residents while maintaining the character of the neighborhood.'",
        "'speaker_5': 'With that Stanford recommends approval of this proposed rezoning case number 2020 1i00202 based on the finding that all review criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you. We have five individuals signed up to speak this evening. We will start with Tyler Somers. Tyler.'",
        "'speaker_2': 'Mother.'",
        "'speaker_0': 'Nope, nope, nope, nope, nope, nope. Next speaker is Ana de Monaco joining us online. Can you hear me? And I. Go ahead.'",
        "'speaker_5': 'Hi. I just wanted to speak quickly in.'",
        "'speaker_0': 'Support of this. I saw this happening in other neighborhoods and. As a resident who also had grandparents who grew up in the same area. I hear these competing.'",
        "'speaker_5': 'Competing concerns about lack of.'",
        "'speaker_0': 'Affordable.'",
        "'speaker_5': 'Housing, as well as the neighborhoods changing too much and too quickly. And I feel like this is.'",
        "'speaker_0': 'A great way.'",
        "'speaker_5': 'To address.'",
        "'speaker_0': 'And both where you can add additional housing. But you don't have to change the neighborhood much at all. And I also had.'",
        "'speaker_5': 'Some neighbors who indicated.'",
        "'speaker_0': 'They wished they had a way to and.'",
        "'speaker_5': 'To have an ADU for aging.'",
        "'speaker_0': 'Parents. And so would be wonderful to be able to have grandparents move in the neighborhood. A lot of families struggle with this.'",
        "'speaker_5': 'And I would love for my neighbors to have that as an option.'",
        "'speaker_0': 'So just wanted to come and voice my support. There is also online, Jenna Farley. Hi, everybody.'",
        "'speaker_5': 'Just want to make sure you can hear me.'",
        "'speaker_0': 'Okay. Great. I've been having trouble with my microphone. Hi. My name is Jenna Farley.'",
        "'speaker_5': 'I also live in the neighborhood here at Regis in Regis University at 50th and UCLA. I have lived here for ten years, but I have been in the North Denver neighborhood for.'",
        "'speaker_0': 'I'm a sixth generation.'",
        "'speaker_5': 'Homeowner in North Denver. And so there's a lot of pride here.'",
        "'speaker_0': 'So I have been in this area for a long time. I also am.'",
        "'speaker_5': 'Here to speak on my support for adults in our neighborhood.'",
        "'speaker_0': 'I have spent the last year really working very closely.'",
        "'speaker_5': 'With an organization.'",
        "'speaker_0': 'To move people from the streets into stable housing. And I can tell you that there is not enough housing in Denver for anyone.'",
        "'speaker_5': 'And so I know that abuse in our neighborhood.'",
        "'speaker_0': 'Are likely not the answer to homelessness. I also don't.'",
        "'speaker_5': 'Think that there is any one single answer to our housing crisis.'",
        "'speaker_0': 'But I do believe that Adus are one. And so I am supportive of us building higher density housing.'",
        "'speaker_5': 'Housing opportunities in our own neighborhoods.'",
        "'speaker_0': 'And I think that the rezoning.'",
        "'speaker_5': 'For a to use in the Regis neighborhood is a good idea.'",
        "'speaker_0': 'Thank you. GIR is online. Candice Clark. I also do a audio check. So I come across clearly. Okay. Great. Thank you very much. Well, thank you for District one and all the work they've done and for the council for bringing this up.'",
        "'speaker_0': 'I, too, am in support. I'm a homeowner in the Berkeley Regis neighborhood and now a little bit of a late bloomer as a homeowner. So as a single person household, I do look at how do I sustain living in this.'",
        "'speaker_5': 'House as I, you know.'",
        "'speaker_0': 'Age, age, out in in in the area. I'm five generations from North Denver. I'm proud of our area. And just all look, you know, just in support and looking for ways to support my community and make it affordable to continue to live there.'",
        "'speaker_0': 'Thank you. Thank you. And our final speaker is online, Jesse Paris.'",
        "'speaker_1': 'Members of council acting at home. So in Paris and I represent for Blackstar at the moment for self defense, positive action camera, for social change as well as the party of Colorado, the East Denver Residents Council, Frontline Black knows and I will be the next mayor of Denver in 2023.'",
        "'speaker_1': 'I'm in favor of this rezoning tonight as the previous speakers have already spoken. So affordability is much needed in this city and in this town. And this neighborhood has been rapidly gentrified. So. To see that the city is going to be putting affordable housing in an area that is underground.'",
        "'speaker_1': 'Gentrification is a good idea. So I'm there for support. I supported 80 use when I ran for City Council. At-Large, a large 29.'",
        "'speaker_0': 'Audio. Your connection froze if you want to turn off your video.'",
        "'speaker_1': 'I'm done.'",
        "'speaker_0': 'That connection that connects many, many questions from members of Council and Council. Bill 20 20477. Okay. Seeing that public hearing is closed. Comments by members of Council on Council Bill 20 2477. Councilmember Sandoval.'",
        "'speaker_4': 'Thank you, President. First and foremost, I'd like to thank Naomi Grendon for my office for taking on such important land use roles in northwest Denver. I remember sitting down with her in 2019 and charting a path, and I don't think that neither one of us had charting the path of rezoning all of northwest Denver to allow accessory'",
        "'speaker_4': 'dwelling units within our game plan. And we quickly pivoted when the community came to us. So thank you so much, Naomi, for your steadfast leadership and work getting us here to this tonight with Regis. As we all know up here in Blueprint Denver, when it was adopted in 2019, it called out the need to rezone neighborhoods by'",
        "'speaker_4': 'neighborhoods, not one off rezoning. So I took that seriously. And this will be the third rezoning of a neighborhood that I brought forward. I understand that there are some concerns about the how accessory dwelling units are added to neighborhoods.'",
        "'speaker_4': 'And as I was working on rezoning neighborhood by neighborhood, I went to the executive director, Laura already and talked to her about my concerns. And therefore we have an accessory dwelling unit task force that is currently being worked on.'",
        "'speaker_4': 'We have two of our council members, council member Black and Councilmember Herndon currently sit on that task force and they're going to talk about parking. They're going to talk about adaptive reuse as I have an older neighborhood that has older houses and so I'd like them to be adaptively reused.'",
        "'speaker_4': 'So thank you to CPD for pivoting as we are rezoning all of these neighborhoods. I believe this meets all of the criteria, so I would ask all my council support up here and thank you to District one for your belief in my leadership on such important land use issues.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Madam Secretary. Roco and Council Bill 20 20477.'",
        "'speaker_2': 'Sandoval.'",
        "'speaker_4': 'AI.'",
        "'speaker_2': 'Sawyer.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Black.'",
        "'speaker_0': 'AI.'",
        "'speaker_2': 'CdeBaca. I Clark. Flynn. I Gilmore. Herndon High.'",
        "'speaker_3': 'Haynes High.'",
        "'speaker_2': 'Cashman. Can each I Ortega. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_2': '12 hours.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1170 North Holly Street in Montclair. Approves a map amendment to rezone property from E-SU-Dx to E-SU-D1x, located at 1170 North Holly Street in Council District 5. The Committee approved filing this item at its meeting on 5-24-22.": [
        "'speaker_0': '12 hours. Council Bill 20 2-0477 has passed. Councilmember Flynn, will you please put council bill 20 2-0585 on the floor for final passage?'",
        "'speaker_3': 'Yes, Madam President, I move the council bill 20 2-0585 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded the required public hearing for Council Bill 20 2-0585 is open. May we have the staff report?'",
        "'speaker_3': 'Good afternoon, city council members. My name is Rob Hege. I'm an associate city planner with CPD and Planning Services. Today I'm going to give a brief overview and present the staff recommendation for the MAP Amendment request at 1170 North Holly Street.'",
        "'speaker_3': 'Subject property is located in Council District five in the Montclair neighborhood. The applicant is requesting a rezone from urban edge single unit D to Urban Edge Single Unit d1x. The Zone District allows for an accessory dwelling unit to be built on the property, but otherwise all form and use standards would remain the same.'",
        "'speaker_3': 'Subject property is currently zoned esu d x. And as you can see on this map, the surrounding area and immediately adjacent, the property is also zoned as ADX, the current land use of the specific property as a single unit residential.'",
        "'speaker_3': 'And the majority of the properties in the surrounding area are also single unit residential. The slide shows the character of the civic property in the surrounding area. The photos in the bottom left and top right show the separate property fronts on Holly 12th and Ivanhoe Street.'",
        "'speaker_3': 'The photo in the top left is a characteristic view of the residential character and the surrounding area. All information. Letters were sent and public notices were posted. Planning board voted unanimously to forward a recommendation of approval on the May 4th.'",
        "'speaker_3': 'Planning Board hearing. To date, staff has not received any public comment specific to this rezoning request. The Denver zoning code has five review criteria used for evaluating rezoning proposals. The first criteria requires consistency with adopted plan guidance, including Comprehensive Plan 2040 Blueprint, Denver and the East Area Plan.'",
        "'speaker_3': 'This Map Amendment bill will promote equity by creating a greater mix of housing options in this neighborhood, which is predominantly single unit residential. And it will lead and lead to an environmentally resilient Denver by promoting infill development where infrastructure and services are already in place.'",
        "'speaker_3': 'Subject property is within the urban edge future neighborhood context as identified by Blueprint Denver, which is predominantly residential and typically low scale single and two unit uses with some multi-unit residential embedded. Blueprint. Denver also identifies this property as low residential future place type, which is predominantly single unit two unit uses and it says Blueprint.'",
        "'speaker_3': 'Denver states that accessory dwelling units are appropriate where compatible. Future Growth Strategy and blueprint. Denver is all other areas of the city. These areas are anticipated to see 10% of new employment growth in 20% of housing growth by 2040.'",
        "'speaker_3': 'Blueprint. Denver also has specific housing specific policy guidance and the land use built form housing policy for focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas. The East Area Area plan that was adopted in 2020 also includes the separate property.'",
        "'speaker_3': 'The plan includes three policies applicable to the subject property and the proposed rezoning request. The Area wide policy. L six ensure that that ensures that East Area neighborhoods are inclusive places by thoughtfully integrating compatibly designed missing middle housing and accessory dwelling units in appropriate locations.'",
        "'speaker_3': 'And then there are also two policies specific to the Montclair neighborhood that promote the integration of ADA use where compatible. Staff also finds that this reasoning request meets the next two criteria in the Denver zoning code. And that the rezoning will result in uniformity of district regulations and will further the public health, safety, welfare, primarily through its'",
        "'speaker_3': 'implementation of adaptive plans, but also by finding additional housing units that are comparatively integrated into the surrounding neighborhood. The justifying circumstance for this rezoning is bound to be the city adopted plan. Since the approval of the existing ESU de Zone District, the city has adopted comprehensive plan 2040 Blueprint Denver in the East Area Plan stated through this'",
        "'speaker_3': 'presentation, the proposed rezoning ESU de one x meets the intent of these plans which has specific which have specific guidance stating that to use our appropriate. Lastly, the proposed rezoning is consistent with the urban edge neighborhood context, residential districts and ESU.'",
        "'speaker_3': 'D1 X zoned district purpose intent statements. And finding that all of these five criteria are met. Staff recommends approval of this rezoning request. Have it answering your questions. Thank you.'",
        "'speaker_0': 'Thank you. We have four individuals signed up to speak this evening. Our first is in chambers, Bruce O'Donnell.'",
        "'speaker_3': 'Thank you, Madam President. And congratulations. Members of Council. I'll be very quick. I'm here. Unavailable to answer any questions on this rezoning request at 1170 North Hawley. I concur with the staff report and especially in the East Area plan, finding this an appropriate location for you.'",
        "'speaker_3': 'And I ask that council vote to rezone 1170 North Hallway from East X to ESU d1x and I'm available to answer questions if you have any.'",
        "'speaker_0': 'Thank you. Thank you. Can you say your name?'",
        "'speaker_3': 'I'm sorry. Bruce O'Donnell. 386 Northumberland Street, Denver.'",
        "'speaker_0': 'Thank you, Bruce. Our next speaker is online, Michael Circo.'",
        "'speaker_1': 'Yes, ma'am. Thank you so much. Can you hear me?'",
        "'speaker_0': 'Yes. We can hear you.'",
        "'speaker_1': 'Oh, thank you again. I apologize for that. We we are looking for an avenue primarily to allow for our family to grow in place and also assist in allowing multi-generational living. My mother and father both live in town, and part of this was our goal to have them be able to age in place with us and help'",
        "'speaker_1': 'raise our kids and see their grandkids a little bit more. Outside of that, we our main goal was to also allow us some affordability with the home and opening it up to allow more of our family members to come in.'",
        "'speaker_1': 'I request that the City Council vote to approve CCB two to dash all 585 the rezoning of 1170 North Hawley Street from ESU de X to ESU one. And I'm available to answer any questions. Thank you very much, ladies and gentlemen.'",
        "'speaker_2': 'Think, think, think, think.'",
        "'speaker_0': 'Our next speaker is Geoff Baker joining us online.'",
        "'speaker_3': 'My name is Jeff Baker. I live at 2422 Tampa Street. As you know, Denver is in need of more housing and aid to provide this. This result in request is consistent with adopt a plan such as Blueprint Denver.'",
        "'speaker_3': 'Therefore, I request the City Council approve the rezoning of 1170 North Hawley from ESU d x to ESU d1x. Thank you so much.'",
        "'speaker_0': 'Thank you. And our final speaker is online, Jesse Paris.'",
        "'speaker_1': 'Yes. Good evening. Member of the council.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Yes. My name is Harris and I'm represented for Blackstar at the moment for self defense, positive action, command for Social Change, as well as the Unity Party of Colorado. The Heath Number of Residents Council, Frontline, Black Middle and I will be the next Mayor of Denver in 2023.'",
        "'speaker_1': 'I'm in favor of this rezoning tonight. As previous speakers have already stated, we are in a affordability crisis. So any time the city has an opportunity to provide more housing stock or add to our housing, I'm a supporter of it.'",
        "'speaker_1': 'So I support this new rezoning. It meets all five of the criteria. That's all I have to say. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions for members of Council and Council. Bill 20 2-0585. Seeing none. The public hearing is closed. Comments by members of Council and Council Bill 22, dash 0585. Councilmember Sawyer.'",
        "'speaker_5': 'Thanks, Madam President. No comments. I'm in support of this. That meets all of the criteria. And the reason no one came to talk about it is because we spent three years on the East Area Plan getting community feedback and talking about it.'",
        "'speaker_5': 'So I'm in support of this and hope the rest of the councilmembers will agree with me on my assessment of all of our criteria. And also, just as a note, I will say, you know, it used to be that all of our 82 rezoning requests came through an East Colfax, and then we re zoned that neighborhood in'",
        "'speaker_5': 'partnership with Councilman Herndon to do that. And I think we will probably focus on Montclair next based on the number of of 80 rezoning requests that have come through. So that's it for me. Thank.'",
        "'speaker_0': 'Thank you, Madam Secretary. Roll call on Council Bill 20 20585. Sawyer I.'",
        "'speaker_4': 'Black I.'",
        "'speaker_2': 'CdeBaca I.'",
        "'speaker_3': 'Clark I. Flynn I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_3': 'I. Hines High.'",
        "'speaker_2': 'Cashman Can each i. Ortega Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': '12 days.'"
    ],
    "A bill for an ordinance changing the zoning classification for 225 East Bayaud Avenue in Speer. Approves a map amendment to rezone property from U-TU-B2, UO-3 to G-MU-3, UO-3 (urban two-unit to general, multi-unit), located at 225 East Bayaud Avenue in Council District 7. The Committee approved filing this item at its meeting on 5-24-22.": [
        "'speaker_0': '12 days. Cancel the 22 days. 0585 has passed. Councilmember Flynn, will you please put Council Bill 20 2-0586 on the floor for final passage?'",
        "'speaker_3': 'Yes, Madam President, I move that council bill 20 2-0586 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The required public hearing for Council Bill 20 20586 is open. May we have the staff report?'",
        "'speaker_3': 'Yes. Thank you. Brad Johnson, principal city planner with Community Planning and Development. Bringing you today, a rezoning request for 225 East Bay Avenue from u t u v to u032g in u three. U of three. This is in Council District seven in the spear neighborhood.'",
        "'speaker_3': 'And again, the request is for general urban neighborhood, context, multi-unit with a three storey maximum height or 40 feet. This would allow multiple dwelling going units on the lot more than two as would be allowed under the baseline zoning.'",
        "'speaker_3': 'Building forms allowed would be urban house duplex, the garden court townhouse and apartment forms. And the applicant does. The Swiss have retained the Euro three overlay, which is use overlay, which is a historic structures use overlay and use overlay.'",
        "'speaker_3': 'If the building on the site was landmark, that use overlay would allow additional flexibility for a few nonresidential uses. Which are art studio office, non-medical, non dental and bed and breakfast. However, this this building is not landmarked. So for now anyway, this use of would not apply.'",
        "'speaker_3': 'If it were to be landmarked in the future, it could come into play. And this proposal is intended to facilitate re-use of the structure from from a religious institutional use to to be adapted to adaptively reuse for residential units.'",
        "'speaker_3': 'So just zooming in on this site a little bit more right here at the corner of Bad and Grant. The lot itself is 94, 95 feet wide, more or less along Green Street. That frontage and the lot areas just over a quarter acre at 12,000 square feet.'",
        "'speaker_3': 'Here. You see the existing zoning on the site that drew me to you, too, and some of the other areas around it on that block as well. And then the surrounding zoning, you see a lot more that G in Q3, which is what's what's requested here.'",
        "'speaker_3': 'The existing land uses both on the site and in the vicinity. So you see a wide variety of of different uses. The majority of them are single unit and two unit residential. But if you look along that Ad Avenue corridor, you see quite, quite a variety there.'",
        "'speaker_3': 'Here are some photos. First at the bottom bottom middle of this page are the site itself. So there you see the former Faith Center Building. It's on the site. Now, that would be the is intended to be adaptively reuse and to the left and right you see some of the immediately surrounding buildings of the subject site.'",
        "'speaker_3': 'I want to mention that the applicant has the senior staff report up and has entered into a ten year non demolition agreement for the building to maintain it in place at least over the next ten years. And the historic timber.'",
        "'speaker_3': 'This this rezoning followed all the procedural requirements of the zoning code in terms of noticing the rezoning and posting on the site and so on. In a public hearing tonight. In terms of outreach, we received four letters of support from members of the public, generally supportive of re-use with residential on the site, but also excited about the'",
        "'speaker_3': 'opportunity for this building to be maintained in place. We did receive one letter voicing concerns about parking impacts in terms of demand that this might generate relative to the when compared to the existing use. And we saw a couple of comments like that at the planning board as well.'",
        "'speaker_3': 'We haven't received any official or no comments on this. So moving to the criteria is criteria, starting with consistency with adopted plans. We did find that this rezoning would mean numerous goals, objectives and strategies in Plan 2040, just a couple of which are flagged here and others identified in the staff report.'",
        "'speaker_3': 'In terms of blueprint. Denver The future neighborhood context is urban, so that calls for small multi-unit, residential and mixed use areas that are typically embedded in one and two unit residential areas and buildings that are of a large scale and closer to the street.'",
        "'speaker_3': 'You'll notice on this map that this site is the context that's called for is urban design district. That's being requested is general urban. See, it's right on the edge there of a general urban designation. So given that and what's being proposed here, blueprint Denver anticipates as a citywide plan that we're not going to map those boundaries.'",
        "'speaker_3': 'Perfect. And this is a case where blueprint ever provides guidance. There's some flexibility could be shown in a case like this where you have a property that's right on the edge of one of those boundaries, especially if it meets goals that blueprint.'",
        "'speaker_3': 'Denver And so more on that in a couple of slides. Feature place type is low residential as predominantly single unit and two unit uses on smaller lots. Although you see this language kind of at the bottom of this paragraph says that vacant institutional uses on corner or select sites may be appropriate locations to introduce additional residential density'",
        "'speaker_3': '. So this will qualify as that type of vacant institutional use. Future street type is local and designated which blueprint? Denver says that for that type of that street type, there could be a variety of different land uses and urban farms adjacent to that that type of street.'",
        "'speaker_3': 'And so given that flexibility, we did find that this rezoning would be consistent with future street type. Growth area strategy is all other areas of the city, which calls for 10% of new jobs and 20% of new housing on the properties that are designated as all other areas of the city through 2040.'",
        "'speaker_3': 'Given that this rezoning would allow additional resident residential units on the site, it would allow for some moderate increase in housing in the city, and therefore we define it to be consistent with growth area strategy. So I talk about how the future context didn't perfectly aligned, but that blueprint does allow flexibility in that regard, especially if the'",
        "'speaker_3': 'rezoning would meet other goals of the city and that are in Blueprint Denver. And so these are a few pieces of policy language from Blueprint Denver that Carla called for facilitating compatible redevelopment of institutional sites like this, calls for additional land use flexibility in that cases and in those types of cases and actually calls out redevelopment.'",
        "'speaker_3': 'This would be a reuse of the site, but it goes even stronger than that and calls out a redevelopment of the site as being potentially appropriate. We have one area plan, which is the West Washington Park neighborhood plan.'",
        "'speaker_3': 'That's a pretty old one from 91. A lot of the focus of that plan is on maintaining the residential character of the neighborhood, which this rezoning would. There is some language that we thought was relevant, particularly relevant, which is this land use policy here, which calls for maintaining and improving historic and architecturally significant structures which we thought'",
        "'speaker_3': 'this would would fall into that category. So we did find this rezoning to be consistent with this adopted area plan. We also found that the rezoning would result in uniform district regulations and further public health and safety and welfare of the community through implementation of our adopted plans and those policies I just shared with you.'",
        "'speaker_3': 'Justifying circumstances for this one again pointing to the to that language in blueprint deliver about flexibility on institutionally institutional sites for redevelopment or in this case for and supporting that type of flexibility to infuse additional units in a compatible way.'",
        "'speaker_3': 'We felt that it did meet that justifying circumstance. And then finally, we did find that this rezoning would be consistent with a neighborhood context zone, district purpose and intent. And so with all of that, we do recommend approval finding of review criteria.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Thank you. We have four individuals signed up to speak this evening in person to Travis Mahfouz. For the record, if you could give us your name and city of residents.'",
        "'speaker_3': 'Thank you. My name's Travis Michael Foose, the city of Denver resident, the owner of this property and the applicant. And we're excited. I'm here with my development partner, Yani Bellis. We're excited to present another opportunity for the city of Denver to adaptively reuse some of our historic properties, do them in a way that the neighborhoods are excited'",
        "'speaker_3': 'about and can maintain their character and also enable future community members to participate and enjoy architecture and character in the neighborhoods that make Denver so unique. So thank you for your support and want to persuade planning support supporters.'",
        "'speaker_3': 'Well, thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is online, Jesse Paris.'",
        "'speaker_1': 'Yes. Many, many members of council. Those watching at home I name is just in the staff here and I'm up for Blackstone actionable self defense positive actually for social change as well as the Unity Party of Colorado, the East Denver Residents Council Hotline, Black News and I will be the next November 2023.'",
        "'speaker_1': 'Initially, I was against this rezoning. I thought it was going to be more gentrification as usual. But seeing from the presentation, it's not, Hey, I'm in support of this rezoning tonight. It meets all five of the criteria. So yeah.'",
        "'speaker_1': 'Should pass with. No problem. Thank you. I have less night.'",
        "'speaker_0': 'Thank you. Our next speaker also online, Michael Flowers.'",
        "'speaker_1': 'All right. My name is Michael Flowers, and I'm director of Preservation Action at Historic Denver 523, nonprofit dedicated to preserving Denver's unique identity, cultural landmarks and workplaces. Our offices are located at 1420 North Ogden Street in the old Everson School.'",
        "'speaker_1': 'Historic. Denver is fully in favor of the zoning change. The church was built in 1911 as the second Church of Christ Scientists and later was run by the Spiritual Assembly of the Beehive, Denver, for a number of years before it came up for sale with an uncertain future.'",
        "'speaker_1': 'The building is a great example of the classical revival style, and the current owners are dedicated to preserving the structure while adapting it into housing to show that commitment. Mr. McAfee has entered a ten year restrictive covenant and non demolition agreement with historic.'",
        "'speaker_1': 'Denver is also a proven and proven steward of the historic buildings. The Patterson Mansion, a Denver landmark, and Capitol Hill is a prime example. Adaptive reuse projects like this year, buildings a new life, ensuring that they will be around for years to come.'",
        "'speaker_1': 'The zoning changes are critical. Allman's project will preserve a piece of Denver's history. Now new housing units to the neighborhood. Thank you for your time and I hope you will vote in favor of the zoning change. I'm also available to answer any questions about the covenant, if there are any things.'",
        "'speaker_0': 'Thank you. Our last speaker online is Gregory Holman.'",
        "'speaker_1': 'Thank you. I appreciate the opportunity to speak now. My name is Greg Home. I've lived in West Wash Park for 33 years.'",
        "'speaker_3': 'In order for neighborhoods.'",
        "'speaker_1': 'To meet the housing needs of people at various levels of income, at various stages of life, a variety of housing types and sizes is essential. This project will provide a moderate cost option for people who want to live in the West Coast Park neighborhood but can't afford the high cost of a single family home across the island'",
        "'speaker_1': '. To the west are numerous parcels zoned Jimmy 303 and there are numerous other similar apartment buildings along are to the east in the Speer neighborhood. 225 is bad is two blocks from bus lines on Lincoln and Broadway, less than a mile from the Alameda Light rail station.'",
        "'speaker_1': 'Line residents who use transit to commute to work and shopping project said adaptive reuse of a former church building as churches has declined. Adapting former churches to multi-family use is an excellent way to respond to a current housing shortage.'",
        "'speaker_1': 'For Denver to thrive and continue to attract talent, talented people to move here. Denver needs an explosion in housing construction of various types. Sizing cost in every neighborhood throughout the city is the only way to respond to the housing crisis.'",
        "'speaker_1': 'I'm glad that staff supports this project and it's great to hear positive comments from other speakers. I said City Council approved this project. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of Council on 20 2-0586. Councilmember Flynn.'",
        "'speaker_3': 'Thank you. Travis, can I ask you to come up and I'm sorry, I am not recalling the name of the gentleman from historic Denver if he might be available also. Why a tenure non demolition agreement as opposed to a permanent conservation easement that would protect the building it since it's so very important to the to the neighborhood'",
        "'speaker_3': 'and to to you and your prior efforts as well. Sure. Thank you. And it's a good question. It was a question we received at a previous meeting and from the neighborhood as well. So I'm happy to address that.'",
        "'speaker_3': 'And also with Michael Flowers helping me from the start Denver standpoint. Our goal is as a development team is to preserve this property. We wanted to enter into agreement with historic Denver that showed that commitment and also enable us time to let the vision that this property will evolve and to evolve and come to fruition.'",
        "'speaker_3': 'There's no magic recipe in this ten year figure. And the idea is that as that time goes by, there'll be significant investment into this property with a successful rezoning. If that is how we are successful today, it will be significant capital invested into the interior of this property.'",
        "'speaker_3': 'The exterior will be very minimally, if at all worked on. And so the idea was to provide the time for the development team to put the whole picture together after we have the successful rezoning, but also show the forthcoming commitment to the city, to the neighborhood, to historic Denver, that our intent is to maintain the integrity of'",
        "'speaker_3': 'this building for for forever, not just for ten years, not just for ten years. Okay. Michael, do you have anything to add to that? Michael have anything.'",
        "'speaker_1': 'That Travis said? Sorry. I don't know what that was. I'll just second everything that Travis said. And, you know, ten years is typically long enough in a development cycle, you know, to allow for the project to be completed.'",
        "'speaker_1': 'And we just wanted it to be, you know, protection and control in place to ensure that, you know, immediately after the zoning change that there was protection in place, you know, and especially during the timeline of the project.'",
        "'speaker_1': 'We've worked with Travis before, and, you know, we think it's going to be a great project. And so we thought ten years would be long enough, you know, that we could control in the future for permanent protection. But I think for right now that the ten years shows a great commitment on Travis's part, and we're happy to'",
        "'speaker_1': 'continue working with him if he wants to work with us.'",
        "'speaker_3': 'Michael I looked through I didn't read closely the entire ten year agreement, but I think lamb's through. It doesn't give historic Denver any leverage or any oversight of any exterior modifications or alterations.'",
        "'speaker_1': 'Now this is this is just a non demolition agreement. So this is not, you know, like our easements and other documents that we have, it's just so that the property cannot be demolished.'",
        "'speaker_3': 'Okay. Well, it says if the owner promises no demolition or a significant alterations, I believe that that's going to speak to that premise. Sure. And also to the intent of designating this as a historic structure going forward. There's a number of implications that are involved in that process, all of which we're exploring as preservationists and as a'",
        "'speaker_3': 'successful track record throughout Denver of identifying properties that have the potential to work themselves into the next cycle of development. You know, the idea is that the exterior of the church will be maintained. There will be a roof.'",
        "'speaker_3': 'There'll be some roof work because of complying with modern code and the like. But the architectural detail is exquisite on this building, and we plan to really use that as the base for the whole development. We're even going to be preserving the majority of the second floor of this building, incorporating those into the interior of the units'",
        "'speaker_3': ', much as we have in this beautiful building. And so the the exterior of this building will be as minimally impacted as possible to enable its next purpose as a residence. Thank you. Does the use overlay through the historic use overlay?'",
        "'speaker_3': 'Does that have any power or any leverage in it to require any city review of any alterations? Or is it simply a a use overlay that allows. Nonresidential uses in historic buildings is the latter. However, for it to even apply, the structure would have to be designated.'",
        "'speaker_3': 'And so all of the things that keeping infrastructure, being landmarked, including review under our LPC process and so on, would be there. If that your theory was applying, right?'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_3': 'All right. Thank you. Thank you, Madam President. Fire.'",
        "'speaker_0': 'Thank you. Seeing no other questions, the public hearing is closed. Comments by members of Council on Council 1220 2-0586 Council Member Clark.'",
        "'speaker_3': 'Thank you, Council President. This is a really, really special building in the neighborhood, and I'm just thrilled that this group came together. You know, I remember the first time we sat down, just there's so much excitement and passion to preserve it.'",
        "'speaker_3': 'Right. And that's that is often not we're especially in this neighborhood where we've had very a ton of contentious ones where, you know, there is a hostile attempt to to preserve something that somebody else wants to just tear down.'",
        "'speaker_3': 'And this was the opposite. This was, you know, this ownership group coming in saying, hey, we want to preserve this. We want to find a way to work the zoning, because the zoning is these are really hard to preserve.'",
        "'speaker_3': 'But we want to change the zoning to be able to preserve this structure and then to bring residential in line with the community. And, you know, I just want to say thank you for all the time you spent with a very smart and very engaged community that does this a lot of times.'",
        "'speaker_3': 'And I know, you know, put you through the ringer as you guys were working through this. But to continue at it, to work with them, you know, and to share that excitement for preservation with some folks who really, really care about preservation, this would would just be a heartbreaker to lose a structure like this and to hear'",
        "'speaker_3': 'the plans of how to give it a whole new life for decades and decades to come is really exciting. So I just want to say thank you. And I think that it's special that we still have owners and people willing to come forward and spend time and money investing what is in not an easy project.'",
        "'speaker_3': 'This isn't just, hey, buy something, tear down and build, you know, another 3 to 5 stories that looks just like everything else. This is unique. It is special. It's going to be a really, you know, just one of a kind, kind of place to live.'",
        "'speaker_3': 'And so I appreciate all the hard work working with the neighborhood, working on what is a zone district that fits that really meets these criteria, but also meets this goal of of preservation and reuse and to bring it all together here.'",
        "'speaker_3': 'So I think as illustrated by staff, through your hard work, this clearly meets all the criteria. I'm happy to support it. Today, I want to say thank you for bringing this forward, and I would encourage my colleagues to support this tonight as well.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Tim Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. I just want to say I also recognize how hard it is to keep the historic structures. I have several in my council district and I've used the same very process and it creates a win win.'",
        "'speaker_4': 'It allows you to adaptively reuse the building and update windows and update other things that might be challenging if it was deemed historic currently right now, but allows you to build density where we need it and also bring a different type of housing stock that is lacking in Denver.'",
        "'speaker_4': 'So just want to say that I absolutely support this type of use and this type of creativity. I know it's not easy and I look forward to when they may be voting on the designation of it because it has tax credits that happened also in my council district.'",
        "'speaker_4': 'Once you've gone through this process, then coming back with the designation so that you as the owner can benefit from those historic tax credits. So thank you for being creative and helping solve some of the solutions of historic preservation and housing at the same time.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Hines.'",
        "'speaker_3': 'Thank you, Council President. I'm done. Some of the rescind of all kind of said much of what I wanted to say and that we need more people like you who are willing to take properties that are distinctive and and preserve them and and work within the structure to make it something that works today but but celebrates where'",
        "'speaker_3': 'Denver has come from. You've mentioned the Paterson so I reached out Paterson is in my district in Denver is perfect ten and we I don't know if the council recalls but we actually went through a rezoning of the Paterson not too long ago.'",
        "'speaker_3': 'So while I was it was fun to learn a bit about your property today. I've been inside of Paterson lots of times and watched its journey as it becomes more accessible to people in, you know, who use wheelchairs like I do.'",
        "'speaker_3': 'But also it is it is another example of an adaptive reuse. So thank you for. For having a track record of taking great properties and making them current as well. So thank you. Thank you, President.'",
        "'speaker_0': 'Thank you, Madam Secretary. Roll call and Council Bill 20 2-0586.'",
        "'speaker_2': 'Clark.'",
        "'speaker_3': 'I. When I.'",
        "'speaker_2': 'Herndon. I like Cashman. Kenny Ortega. Sandoval. I saw your eye blank. I see tobacco. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results.'",
        "'speaker_2': '12 hours.'",
        "'speaker_0': '12 hours. Council Bill 20 20586 has passed a preaent recess announcement. I'd like to use a little bit of privilege here real quick and say a few words about one of our City Council family members who's going to be moving on to another adventure, Zacharias Meyer, whose last day will be this Friday, July 22nd.'"
    ]
}