{
    "A bill for an ordinance amending the health and sanitation chapter of the Denver Revised Municipal Code to align testing for sexually transmitted infections with state statute. Amends Chapter 24 of the Denver Revised Municipal Code to align requirements for testing for sexually transmitted infections with state statute. The Committee approved filing this item at its meeting on 6-23-21.": [
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. And thank you all for being here as well. We're going to go ahead and move on. The next item up is Council Bill 697. Councilmember Herndon, would you please put Council Bill 697 on the floor for publication.'",
        "'speaker_3': 'And move that council Bill 21 that 0697 be ordered.'",
        "'speaker_1': 'Published? So I could.'",
        "'speaker_0': 'Thank you. It's been moved down. We have the second by Councilmember Flynn, council member state Abarca. Your motion to amend.'",
        "'speaker_4': 'Thank you. I move that.'",
        "'speaker_5': 'Council bill 21, dash 697 be amended in the following particulars on page one Strike Online 28 Strike Knows or has reason to believe and replace with nos on page two. Line four Strike others and replace with others or on page two, line four strike lines four through eight.'",
        "'speaker_5': 'On page two, line nine, strike four and replaced with three on page four, line 30, strike section. And the manager shall may pursuant to state law and replaced with Section An on page four strike line 31.'",
        "'speaker_0': 'All right. Thank you. It has been moved. Then we get a second.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'Thank you, counsel. Pro Tem Torres Questions or comments by members of Council Councilmember CdeBaca. Thank you. Council President.'",
        "'speaker_4': 'This amendment was brought forward.'",
        "'speaker_5': 'By stakeholders in the industry. This amendment eliminates departmental discretion of ordering testing of sexually transmitted.'",
        "'speaker_4': 'Infections.'",
        "'speaker_5': 'For individuals arrested for prostitution by the Denver Department of Public Health and Environment.'",
        "'speaker_0': 'Thank you, Councilmember CdeBaca. Council Pro-Tem Torres.'",
        "'speaker_4': 'Thank you so much. I have two questions, just technical ones. Councilwoman CdeBaca. One is on the amendment document. It refers to the designated consumption areas set back requirements. Just wanted to make sure that's an error on the amendment document that's uploaded.'",
        "'speaker_4': 'I believe so. I think Zach drafted this one for us, and I don't.'",
        "'speaker_5': 'Have the bandwidth to pull the one that's uploaded, but I believe that's an error. Okay. Shouldn't be. Yeah.'",
        "'speaker_4': 'Do we need to do anything on that? If the if it's in the document, an error.'",
        "'speaker_5': 'If it's it, I'll have all double check that and make sure that that gets cleared out for second reading.'",
        "'speaker_4': 'Okay. The other is numbers number two in in the amendment changes line. Page two, line four is not the one I think that you're referencing. It's page two, line three. But I want to double check that with you.'",
        "'speaker_5': 'Line three is the one that says others. So let's see.'",
        "'speaker_4': 'We're getting. You are correct on that. Okay. And then just and I think everything else checks checked out. But I just wanted to double check on impact of these, particularly think of the fifth one where you strike the May pursuant to state law kind of a position.'",
        "'speaker_4': 'And if there was any kind of legal parameter where that had to be in kind of what either from your side from imposing or the organization that is opposing the changes or even if there was a reason that that had to be in there.'",
        "'speaker_4': 'I mean, the state law piece of it is.'",
        "'speaker_5': 'The I guess you would call it the floor. But the point of it is to remove the departmental discretion for the ordering of the STI testing. And so this sentence here combines what the manager may do plus or in alignment with state law.'",
        "'speaker_4': 'Okay. And I hear that I'd like to hear from you if there's somebody who can testify about whether or not that changes substantially what you were drafting. Just any feedback. Kevin.'",
        "'speaker_1': 'Thank you, Councilwoman Torres.'",
        "'speaker_0': 'So you want to introduce yourself, Kevin?'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'My name is Kevin Kelly. I am a program administrator with the Department of Public Health and Environment. Thank you all for having me today. In answer to your question, Councilwoman. What we were attempting to do when we drafted this language was to align with state law.'",
        "'speaker_1': 'The the former version of 20 4-1 31 was written in 1973, was very outdated and specifically targeted at sex workers, which had a a racist outcome where we saw a disproportionate number of black women being affected by it.'",
        "'speaker_1': 'We drafted the or chose to draft the state ordinance because it's a more nuanced approach to mandated testing. It doesn't single out sex workers, and it provides people with a path to challenge any order if an order does come through.'",
        "'speaker_4': 'Why would you need to mandate? A medical examination?'",
        "'speaker_1': 'It's a good question. It's the biggest concern at first was with so mandate and testing for perpetrators of violent sexual crimes. In the interest of protecting the security. The survivor of the crime, if that makes sense. And also just in case of any other sort of emergency scenario.'",
        "'speaker_4': 'Okay. Okay. Okay. Thank you. Those are my primary questions. I'll jump back in those of all. Thank you for the tip.'",
        "'speaker_0': 'All right. Thank you. Pro Tem Torres. Councilman Flynn.'",
        "'speaker_1': 'But thank you, Madam President. Councilwoman CdeBaca. I just saw this this afternoon, and I was trying to read through it, and I'm not quite where I understand the intent. And I'm concerned about one section in particular. And that was the First Amendment.'",
        "'speaker_1': 'The first line was being amended, line 28, where the manager knows or has reason to believe because of evidence based medical or epidemiological information that a person has an STI. And your amendment takes out the or has reason to believe.'",
        "'speaker_1': 'And that gives me pause. Because then the only the only condition under which the manager could mandate a test would be if the manager already knows that the person has an STI. But the purpose of the test is to find out or to verify based on medical or epidemiological information whether the person has an STI.'",
        "'speaker_1': 'It would almost make more sense to amend out where the manager knows. Take out the word knows because how can the manager know and keep in the has reason to believe? So I'm confused and I'm not quite ready to vote I on this.'",
        "'speaker_1': 'This is on publication, so I'd be happy to entertain it next week if it makes sense to me. But let me ask Kevin Kelly.'",
        "'speaker_2': 'What is the impact of.'",
        "'speaker_1': 'These changes on how we would operate this program? A D for the question. Councilman Flynn So I should leave this up with a caveat. After this bill passed the Safe House Committee. Councilman CdeBaca office and the stakeholder groups she was referring to reached out to to my office to discuss some changes that they would like to see'",
        "'speaker_1': 'in this. Excuse me. And we suggested an amendment, and I actually did help answer questions within the drafting of these amendments. However, I hope that that office and that stakeholder group, an apology didn't involve the right people with entity to to fully vet the outcomes of that of some of the changes which has led to some concerns'",
        "'speaker_1': 'with them. I spoke to Bob McDonald this this afternoon about this specific piece and his concern is that it would limit exactly to your concern as well would limit the authority that she has to to mandate testing. Okay.'",
        "'speaker_1': 'That's that's kind of the way I read that first change. I want to I want to more fully understand what the stakeholders were asking for and whether this amendment actually does that or maybe frustrates that. And so I would vote no on the amendment this week, but be willing to study it more deeply and consider it again'",
        "'speaker_1': 'next week on final. Thank you, Madam President.'",
        "'speaker_5': 'And if there's any interest in pulling up promoting Becky to her Blue and Disraeli Collins. They're members of our stakeholder.'",
        "'speaker_4': 'Group that can speak to why.'",
        "'speaker_5': 'Eliminating that departmental discretion is.'",
        "'speaker_4': 'Desirable.'",
        "'speaker_0': 'All right. Thank you, Councilmember CdeBaca. We can ask the city staff to or our central staff to maybe promote them to answer a question on that. We're going to go ahead and go back to the queue. We've got Councilmember Herndon.'",
        "'speaker_0': 'You're up next.'",
        "'speaker_3': 'Hey, man, I was just going to second what Councilman Flynn talked about. This is on publication. So there are opportunities to get more information on time, recognizing that there are multiple public hearings tonight. And honestly, I believe it's necessary now to have these dialogs.'",
        "'speaker_3': 'But the fact that he doesn't appear to have such a concern gives me pause enough that I wouldn't support these, but also recognizing we have time next week to learn a little bit more. So I will be a know today.'",
        "'speaker_3': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Herndon. Councilmember Black.'",
        "'speaker_5': 'Thanks. I'll be really brief for the reasons that Councilman.'",
        "'speaker_4': 'Herndon just mentioned.'",
        "'speaker_5': 'But if I recall from when this was in committee, there was a very lengthy stakeholder process. I think it was up to two years long. So I wasn't aware of this amendment until today.'",
        "'speaker_4': 'So I definitely wouldn't vote for something I hadn't seen before tonight.'",
        "'speaker_5': 'Especially now that we've learned that Didi doesn't support it and the fact that it was not part of.'",
        "'speaker_4': 'The stakeholder process. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Black. And in the interest of time, because this is on first reading, regardless of if it passes or fails or will, if it passes, it would be a different conversation. But it sounds like there was a bit of confusion as to the document that got uploaded, and I believe the central staff is fixing that'",
        "'speaker_0': ', but we would have time to re entertain this next week on final as well. And so we're going to go ahead and. Move forward. And in the interest of time. Madam Secretary, roll call on the amendment, please.'",
        "'speaker_4': 'CdeBaca. I. Clark.'",
        "'speaker_1': 'No. Lynn Bell.'",
        "'speaker_3': 'Herndon now.'",
        "'speaker_4': 'Cashman?'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'Sandoval. No. Sawyer now. Torres. No. Black. No. Madam President.'",
        "'speaker_0': 'No. Madam Secretary, close the voting and announce the results.'",
        "'speaker_4': 'One I. Nine nays.'",
        "'speaker_0': 'Nine nays. The amendment to 20 1-0697 has failed. We will go ahead and we've got to comments by members of council on council bill 20 1-0697 as it is or I'm sorry. I believe that the. Madam Secretary, can you clarify because I have it repeated in the script, and I just want to make sure you don't need'",
        "'speaker_0': 'me to do anything additional on this since it failed.'",
        "'speaker_4': 'That's correct. We're going back to the first motion which would be ordering published.'",
        "'speaker_0': 'All right. Perfect. All right. We are going to then, Councilmember Herndon, did you have a question?'",
        "'speaker_3': 'Does it matter that I was just going to raise my hand and say we still need development?'",
        "'speaker_0': 'Very good. All right, wonderful. Then, Secretary, would you please. I'm Councilmember Herndon. Sorry. We need you to go ahead and move to put this on the floor for final passage or for final. I'm sorry. My script is resetting, as were we're here.'",
        "'speaker_0': 'All right, Madam Secretary, we are going to do roll call then on the publication of Council Bill 20 10697.'",
        "'speaker_4': 'Black. I. Slovakia. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Sandoval. Hi. Sawyer, I. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': 'Ten Eyes.'",
        "'speaker_0': 'Ten Eyes Council Bill 20 1-0697 has been ordered published. All right. It's not a good thing when you're when you're resetting and it moves your script where you're at. Councilmember Herndon, would you please put council bill 661 on the floor for final passage?'",
        "'speaker_3': 'I move that council bill 20 1066 wanted to be ordered. Be placed upon final consideration and do pass.'",
        "'speaker_5': 'I can.'",
        "'speaker_0': 'Thank you. It's been moved and seconded and thank you for that catch. It's on. Final passage. Councilmember Herndon, your motion to amend.'",
        "'speaker_3': 'And move the Council Bill $21 0661 be amended in the following particulars on page one line.'",
        "'speaker_1': '21 Strike.'"
    ],
    "AS AMENDED a bill for an ordinance amending the Building and Fire Code of the City and County of Denver. Amends Article II, Chapter 10 of the Denver Revised Municipal Code, the 2019 Denver Building and Fire Code and the 2019 Denver Green Code to correct errata found after the initial adoption in December of 2019. The Committee approved filing this item at its meeting on 6-15-21. Amended 7-12-21 to extend the time-frame in which major projects that have received approval by the city to be designed under the 2016 building and fire codes are to receive permits and begin construction. The amendment replaces the package of building and fire code amendments filed previously with the clerk, with a revised set of amendments that allows approved major projects designed under the 2016 building and fire code to receive permits and begin construction by April 22, 2022.": [
        "'speaker_3': 'June 18, 2021 and replace with July seven, 2021 on page one line 22 Excuse me, strike 20210056a and replace with 20210059.'",
        "'speaker_0': 'Thank you. It has been moved. May we get a second?'",
        "'speaker_1': 'So I can.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Questions or comments by members of council? Councilmember Herndon.'",
        "'speaker_3': 'Thank you, Madam President. The purpose of this amendment is to extend the time frame in which major projects that have been that have received approval by the city to be designed under the 2016 building, and fire codes are to receive permits and begin construction.'",
        "'speaker_3': 'This amendment replaces the package of building and Fire Code amendments filed previously with the clerk, with the revised set of amendments that allows approved major projects designed under the 2016 Building and Fire Code to receive permits and begin construction by April 22nd 22.'",
        "'speaker_3': 'Specific changes are found in Denver Building Code Administration Section 103.10 .2.6 and Fire Code Section 102.13.2.6. The prior set of amendments required permits to be obtained and construction commenced by July 31st, 2021. And if you have any questions, we do have Eric Browning from Community Planning Development.'",
        "'speaker_1': 'That can answer any questions folks may have.'",
        "'speaker_0': 'All right. Great. Thank you. Councilmember Herndon. I see Councilmember Sandoval. Go ahead, please.'",
        "'speaker_4': 'Thank you, Madam President. Eric, thanks for joining us. Can you explain what this does?'",
        "'speaker_1': 'Yes. Good afternoon and thank you. Eric Browning, the interim building official for Community Planning and Development. Thank you for having me this evening. The amendment simply changes the date by which those major projects designed under the previous codes, the 2015 and 2016 codes needed to start construction.'",
        "'speaker_1': 'The Department recognized that due to the catastrophic effects of COVID, many of these projects lost their financing over the last year and have been struggling to get it back and that the prior date that was in the code July 31st, 2021, would not have been reasonable for these projects to get under construction and were this date to'",
        "'speaker_1': 'come to pass. All of these projects would expire, costing them literally millions of dollars in lost time and redesign to upgrade to our current set of codes, the 2019 Denver Building and Fire Code. So this is a recognition of the economic impacts of these projects and a longer version of the time from which they can start construction'",
        "'speaker_4': '. But this this would be separate than his zoning permit rights for some of the zoning permits, like the old home tax amendment that's expiring right now. That wouldn't have any impact because there was a project in my council district that needed that was under this building fire code for July 31st.'",
        "'speaker_4': 'But then it also had a different zoning permit. They're not correlated, correct? They're separate.'",
        "'speaker_1': 'Correct. Yes. These are only building fire code amendments. This and this revision is under MSI Chapter ten and has no effect on zoning code.'",
        "'speaker_4': 'And then do you know how many projects are impacted? How many projects are we doing this amendment for?'",
        "'speaker_1': 'Yes. So there are, we estimate, between 50 and 55 projects that this could positively impact. All of these projects have started sort of valuations of $5 million or more. Many of them are in the tens of millions of dollars, and some of them are even over 100 million.'",
        "'speaker_1': 'So we're talking about very large developments to offer one additional piece of information. There are about 60% of these projects are for housing. And so we're talking about 6500 housing units being affected by this by this change, 1500 of which are affordable housing units as well.'",
        "'speaker_1': 'So we really feel the need for this to be approved.'",
        "'speaker_4': 'Can you after we after you're done, can you send me the list of 50 or 55 projects if you have them, so that I can know which ones and if any are in my council district that I would like.'",
        "'speaker_4': 'I would prefer to have the whole entire list, if you could.'",
        "'speaker_1': 'Yes, absolutely.'",
        "'speaker_4': 'All right. Thank you, Madam President.'",
        "'speaker_0': 'Q Councilmember Sandoval all saying no, their hands raised four questions by members of council. Madam Secretary, roll call on the amendment, please.'",
        "'speaker_4': 'Herndon. I Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Sandoval. I saw you.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Torres. I black. Hi. CdeBaca, I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'All right.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_4': 'Ten Eyes.'",
        "'speaker_0': 'Ten Eyes Council Bill 20 1-0661 has been amended. Councilmember Herndon, will you please put council Bill 661 on the floor for final passage as amended?'",
        "'speaker_3': 'Yes, Madam President, I move that council bill 20 10661 as amended be placed upon final consideration and do pass.'",
        "'speaker_5': 'That I can.'",
        "'speaker_0': 'Thank you. It has been moved and we've got the second borough council members for your comments by members of Council on Council Bill 20 1-0661. CNN. Madam Secretary, roll call on Council Bill 661 as amended.'",
        "'speaker_4': 'What I. CdeBaca. I. Claire.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Sandoval. I. Sawyer.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Tourists. I. Madam President.'",
        "'speaker_0': 'I then a secretary closed the voting and announce the results.'",
        "'speaker_4': 'Tonight.'",
        "'speaker_0': 'Ten eyes council bill 661 has passed as amended. That concludes the items to be called out this evening. All other bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Herndon, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_3': 'It's not president. I move that resolutions be adopted and bills on final consideration be placed upon final consideration and do pass in the Bloc for the following items. Everybody get comfortable in all series of 2020 1068307070708070907 ten 07320677069607040713074606990 700 0701070207250726072707290743069507 11 0724073307360737073807390740074107440657066906700674.'",
        "'speaker_0': 'All right. Thank you, Councilmember Herndon, for the motion. May we have a second? Again, thank you, Councilmember Sawyer. Madam Secretary, roll call.'",
        "'speaker_4': 'Black. I see tobacco. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Sandoval. I. Sawyer.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Torres, i. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_4': 'Ten Eyes.'",
        "'speaker_0': 'Ten eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Our pre recess announcement tonight. There will be a required public hearing on Council Bill 448 changing the zoning classification for 4785 North Key Home Street in Sunnyside are required public hearing on Council Bill 461 Changing the zoning classification for'",
        "'speaker_0': '3625 North Camarena Street and Northeast Park Hill. A required public hearing on Council Bill four six for changing the zoning classification for 1880 South Monroe Street in University Park and a required public hearing on Council Bill 592 amending Ordinance 20200961 series of 2020 to extend the duration of an interim interim zoning regulation to allow certain temporary unlisted'"
    ],
    "A bill for an ordinance changing the zoning classification for 4785 North Tejon Street in Sunnyside. Approves a map amendment to rezone property from U-SU-C to U-MX-3 (single unit to mixed-use), located at 4785 Tejon Street in Council District 1. The Committee approved filing this item at its meeting on 4-27-21.": [
        "'speaker_1': 'The property is approximately 10,297 square feet, and there is an existing three story commercial building on site that was built in 1972. The proposal is to rezone to use x three, which is a three storey mixed use serving district that allows mixed use development.'",
        "'speaker_1': 'The existing zoning is U.S. C, which is a single unit in district. Prior to adoption of Denver's zoning code in 2010. This property was previously zoned B2 pursuant to a code chapter 59. Adjacent zoning includes a piece of PDS other U.S. you see DMX to and you must you.'",
        "'speaker_1': 'Existing. The existing land use for the parcel is office slash commercial. It's adjacent to single unit residential multi-unit residential industrial uses as well as Interstate 70. Just in context and building form and scale. The building and the site in question is the upper left hand photograph.'",
        "'speaker_1': 'Process slide. Planning Board voted unanimously to recommend approval back in April and Louise forwarded it unanimously to this board. We received no or no comments and no other public comments on this proposed rezoning. Five criteria. The Council must find the rezoning to be consistent with to approve the rezoning.'",
        "'speaker_1': 'We'll start with criteria. One consistency with adopted plans. We have a plan 2040 Blueprint, Denver and the Sunnyside Neighborhood Plan, as outlined in the staff report. The proposed rezoning is consistent with a number of 2040 goals and strategies.'",
        "'speaker_1': 'Looking at consistency with Blueprint Denver located in the urban neighborhood context. In this context, small mixed use nodes within neighborhoods are appropriate. Future place types. This is classified as a local center, which primarily provides options for dining, entertainment and shopping and may also include some residential employment uses and heights, but generally appropriate up to three stories.'",
        "'speaker_1': 'Street street types. This property is at the corner of the 48 South Drive and Tyrone Street, both of which are residential collector streets. Growth area is the future growth strategy is all other areas of the city. Looking at the Sunnyside neighborhood plan specifically, it's in a mixed use area.'",
        "'speaker_1': 'The town street guidance says takeover offers a mixture of office, residential and commercial uses. When looking at criteria two, it is a uniform zone district that is being requested. This rezoning would further the public health, safety and welfare by the implementation of adopted plans and building standards and provide better health outcomes through increased physical activity due to'",
        "'speaker_1': 'the mixed use nature of the requested zone district. Justifying circumstances cited in the application is the city adopted plan blueprint Denver in this case the 2019 Blueprint. Denver reclassified this area from the 2000 to Blueprint. Denver had it mapped as a single unit area and 2019 Blueprint.'",
        "'speaker_1': 'Denver has it as a local center. That change is suitable just by circumstance. And it is consistent with the neighborhood context and history, purpose and intent. Staff recommends approval of this application, and I'm here to answer any questions.'",
        "'speaker_0': 'All right. Thank you, James. This evening, counsel has not received any written testimony on Council Bill 21, Dash 0448, and we have zero individual signed up to speak this evening on this one. And so we will close the public hearing comments by members of Council on Council Bill four for eight.'",
        "'speaker_0': 'I'm so sorry. I closed the public hearing too soon. That concludes we don't have any speakers but questions from members of Council on Council Bill 448. Do we have any questions of members of council? All right, scene one.'",
        "'speaker_0': 'We will go ahead and close the public hearing and now comments by members of Council on Council Bill 448 council members and of all.'",
        "'speaker_4': 'Thank you, Madam President. We met with the owners in September of 2019. My staff named me and this building is very unique to northwest Denver, has a garden court. So actually that when we looked at it, we thought it would comply with you and next to X to have different uses.'",
        "'speaker_4': 'And so she did with it. But then when we actually got to development services because of the garden level, it actually is a three storey. So they did the neighborhood outreach to the Sunnyside neighborhood and to the neighbors that were impacted.'",
        "'speaker_4': 'It's already a commercial use has tenants in it, so they just want to make sure that the zoning matches what's currently in the built environment. So without that, I would ask my colleagues to support this reasoning. Thank you.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Sandoval, I don't see anyone else up in the queue. And so seeing that this has met all of these zoning criteria, the rezoning criteria, I'm happy to support it as well this evening. Madam Secretary, roll call on Council Bill 448.'",
        "'speaker_4': 'Sandoval, I. So here.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'All right. I. Well, I. De La Barca. I.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'When?'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_4': 'Can I?'"
    ],
    "A bill for an ordinance changing the zoning classification for 3625 North Krameria Street in Northeast Park Hill. Approves a map amendment to rezone property E-SU-Dx to E-SU-D1x (allows for an accessory dwelling unit), located at 3625 North Krameria Street in Council District 8. The Committee approved filing this item at its meeting on 4-27-21.": [
        "'speaker_0': 'Ten I's Council build 20 1-0448 has passed. Moving on to our second hearing. Councilmember Herndon, would you please put council bill 461 on the floor for final passage?'",
        "'speaker_3': 'Yes, Madam President, I move that council bill 20 120461 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been very good. Thank you. Councilmember Sawyer, the required public hearing for council Bill 461 is open. May we have the staff report? And I see we got Fran here.'",
        "'speaker_4': 'Afternoon. Members of City Council. Madam President. Can you see? Me on my screen.'",
        "'speaker_0': 'Go ahead, Fran.'",
        "'speaker_4': 'Perfect. My name is Fred Benefit and I'm an associate city planner with CPD. And I'll send you today an overview of the MAP Amendments. Four 3625 North Columbia Street. We should not go into the next leg. The subject property is located in district eight.'",
        "'speaker_4': 'We have Councilman Christopher Herndon. Herndon. In the northeast. You are killed neighborhood. Some trouble passing this lights. Give me 1/2. The applicant is requesting to rezone the property to allow for an accessory dwelling unit. Well, all other forms and standards would remain the same.'",
        "'speaker_4': 'The property is currently in the Urban Edge Single Unit District, which allows for a minimum of 6000 square feet. And as you can see on the map, most of the surrounding properties are also an SUV. We can see some I am x three half a block to the north and some you see a block and a half'",
        "'speaker_4': 'to the south of the subject property. The current land use of the site is single unit residential and it is surrounded by mostly other single unit uses with some two unit uses and some multi-unit uses nearby. And also you can see a school half a block to the southwest.'",
        "'speaker_4': 'We can also see some industrial uses half a block to the north of the property. This slide shows the existing form and scale of the area with the site of the proposed rezoning on the bottom right and some images to show the residential character of the neighborhood.'",
        "'speaker_4': 'Now looking at the process, the informational notice of the application was sent on February 22nd, 2021. Planning Board unanimously recommended approval on April 21st. To date, staff has not received any public comment from neighbors or the owners. The Denver zoning code has five review criteria.'",
        "'speaker_4': 'The first one is consistency with the departments. There's three plans applicable to this rezoning. We have comprehensive plan 2040 Blueprint, Denver and the Parkfield Neighborhood Plan. The rezoning is consistent with several of this prejudicing comprehensive plan 2040 Balgo just over a couple of them.'",
        "'speaker_4': 'Map Amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to an environmentally resilient Denver by promoting infill development where infrastructure and services are already in place. Now looking at Blueprint Denver the subject property is mapped as part of the urban edge neighborhood context.'",
        "'speaker_4': 'The future places map designates the subject property as low residential place, though displaced types have predominantly single and two unit uses and accessory dwelling units are appropriate. Street is designated as a local street, which is mostly characterized by residential uses.'",
        "'speaker_4': 'The growth area in Denver is all other areas of the city. These areas are expected to see 10% employment growth and 20% housing growth by 2040. Therefore, that stuff points out that the request is consistent with the applicable adopted plans.'",
        "'speaker_4': 'Lupine also includes specific policy recommendations. Housing Policy four focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas. No. The Park Neighborhood Plan was adopted in 2000 and is applicable to this type property.'",
        "'speaker_4': 'This plan is silent on residential rezoning specifically. However, the proposed rezoning is consistent with the land use and zoning goal and the land use and zoning action. Recommendation number three stated in page 32 and 33 of the plan.'",
        "'speaker_4': 'The proposed city you would win would maintain the existing integrity of Northeast Square Hill and increase the mix of housing options in the neighborhood, which is comprised of single unit, two unit and multi-unit dwellings, as is thereby. And they're very consistent with this malaria plan.'",
        "'speaker_4': 'Stuff also finds that the requested rezoning meets the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare primarily through its implementation of adopted plans. Justified circumstance for this rezoning is a clear adopted plan.'",
        "'speaker_4': 'Since the approval of the existing ESU Dixon District, the city has adopted the Comprehensive Plan 2040 and blueprint. Denver stated throughout this presentation. The proposed rezoning to East One X meets the intentions of this plan's. Lastly, the proposed zoning is consistent with the urban edge neighborhood context residential district and the ESU.'",
        "'speaker_4': 'Do you want to the district? Stuff does recommend approval based on finding all review criteria has been met.'",
        "'speaker_0': 'All right. Thank you, friends. And this evening, counsel has not received any written testimony on Council Bill 21, Dash 0461. And we have three individuals signed up to speak this evening. And so we'll go ahead and start with our first speaker.'",
        "'speaker_0': 'And it's Sandra Knight.'",
        "'speaker_5': 'Hi. Yash Chandra. Thanks. Thanks. Madam President, thank you to the rest of the Council for letting us speak tonight. And thanks for all your hard work in the city. We are asking for our home 365 area street to be resold so that we can build and you for my mom or grandma so that the kids can be'",
        "'speaker_5': 'closer to her and she can age in place with us. She is 82 this year.'",
        "'speaker_0': 'And still healthy, but.'",
        "'speaker_5': 'So that's the perfect time to get her out here. And we sent out 22 letters to the neighborhood. I had them all translated into Spanish, so everybody in the neighborhood could read them. We got three letters of support back and nobody that.'",
        "'speaker_0': 'Pushed back on the plan at all.'",
        "'speaker_5': 'It's multi-generational neighborhood and.'",
        "'speaker_4': 'We got a lot of verbal support for the idea. So I am asking that you approve our rezoning plan.'",
        "'speaker_0': 'All right. Thank you. Our next speaker is Bruce O'Donnell.'",
        "'speaker_1': 'Thank you, Madam President. As members of council, this is Bruce O'Donnell at 3:36 a.m. in Denver. And we've been helping Sandra with the rezoning. And I am consistent with staff's recommendation. I ask for number of council vote to approve the rezoning request and I'm available answering questions.'",
        "'speaker_1': 'The City added Thank you.'",
        "'speaker_0': 'All right. Thank you, Bruce. And our last speaker for this hearing is Rochelle Safir.'",
        "'speaker_4': 'Okay. Everybody hear me? Okay? Mm hmm. Actually. Good evening, City Council. Thanks for. Thanks for being with us. My name is Rachel Scofflaw, and I live in the bridge neighborhood in Denver.'",
        "'speaker_5': 'I work with Russ O'Donnell on helping the client.'",
        "'speaker_4': 'With the application process for this proposed rezoning. I will try to keep this to the point and not repeat too much information you've already heard. So first, the proposed rezoning was recommended for approval by Planning Board as it meets the rezoning criteria for an amendment.'",
        "'speaker_4': 'Second, it has been support from citywide planning, such as Compliant 2040 Blueprint Denver 2019, and it's also supported by housing and inclusive Denver of 2015, which is Denver's Guide to excuse me setting housing policy strategy and Investment Priorities.'",
        "'speaker_4': 'It aligns with land use and zoning goals and recommendations of the Park Hill Neighborhood Plan. And of course, the integration of accessory.'",
        "'speaker_5': 'Dwelling units will kind of.'",
        "'speaker_4': 'Add to the much needed housing stock and diversifying the housing stock in addition to the neighbor outreach conducted by the homeowner. We reached out to local partners on January 25th to be contacted. Three are nodes in the area.'",
        "'speaker_4': 'The greater partner community think Northeast Denver friends and neighbors as well as Northeast Parkville Coalition. We provided them a copy of the application and inform them of the homeowners plans. We invited them to meet with us so they could so we could share more information if needed.'",
        "'speaker_4': 'None of the answers replied needing any other digital information, nor did they hold an opposition. For these reasons, I ask council members to please vote yes on this bill for the rezoning of 3625 Camaro. Thank you for your time.'",
        "'speaker_0': 'And. Q That concludes our speakers questions from members of Council on Council Bill 461. All right. No questions of counsel. The public hearing is closed. Comments by members of Council on Council bill 461 councilmember Herndon.'",
        "'speaker_3': 'AMA President. I think this is quite clear the criteria has been met and I just want to applaud the the applicant and her work for reaching out to the neighbors as possible neighbors as possible. So I would urge and encourage my colleagues to support.'",
        "'speaker_3': '461. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Herndon. And seeing that it does meet all of the rezoning criteria, happy to support it as well. And Madam Secretary, roll call on Council Bill 461, please.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Sandoval. I. Sawyer, I. For it. I. Black. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flint.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Madam President.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1880 South Monroe Street in University Park. Approves a map amendment to rezone property from E-SU-D to E-SU-D1 (allows for an accessory dwelling unit), located at 1880 South Monroe Street in Council District 6. The Committee approved filing this item at its meeting on 4-27-21.": [
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results. And I can I counsel bill 20 1-0461 has passed. Councilmember Herndon, will you please put council bill 464 on the floor for final passage.'",
        "'speaker_3': 'And move the Council Bill 20 10464 and be placed upon final consideration and do pass.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. They required public hearing for council bill 464 is open. May we please have the staff report and we have Libby here with us. Go ahead, please.'",
        "'speaker_5': 'All right. Okay. My name is Libby Adams of Community Planning and Development, and I'll be presenting the MAP Amendment for 1880 South Monroe Street. This application is located in Council District six in the University Park neighborhood. The property is located between Bucktown Boulevard and I 25.'",
        "'speaker_5': 'The applicant is requesting to reason from urban edge single unit D two Urban Edge single unit RD one to allow for an accessory dwelling unit. The property was red zone from ESU D X to ESU D in 2019 as part of a legislative rezoning in University Park to eliminate the suburban house building form within the neighborhood.'",
        "'speaker_5': 'The site is currently occupied by a single unit home. You can see its mostly single unit in this area, but then multi-unit directly east and south of the site. This slide shows the residential nature of the area with the subject property on the upper right hand side and then some of the single unit residences and then multi-unit'",
        "'speaker_5': 'residence just to the south. A postcard notifying neighboring property.'",
        "'speaker_4': 'Owners was sent out.'",
        "'speaker_5': 'Within 200 feet of the site on February 25th. To date, staff has received a statement from the registered neighborhood organization and three comments from neighboring residents, all in support of the proposed rezoning. Although one comment did note that while they are in support of the rezoning and abuse, they encourage staff to look at the design and then'",
        "'speaker_5': 'short term rental regulations around abuse. The Denver zoning code has five review criteria which must be met in order for a rezoning to be approved. The first criterion is.'",
        "'speaker_4': 'Consistency with.'",
        "'speaker_5': 'Adopted plans, and there are three plans that are applicable to the site. This application is consistent with the strategies.'",
        "'speaker_4': 'In the.'",
        "'speaker_5': 'Comprehensive plan, as it will create a greater mix of housing options in the University Park neighborhood and promote infill development where there are already services and infrastructure in place. The future neighborhood context in Blueprint Denver is urban edge.'",
        "'speaker_5': 'These areas contain elements of both the urban and suburban contexts and are mostly single in two unit residential areas with some multi-unit and mixed use embedded throughout. Blueprint identifies the future place type as low residential. These place types are mostly single unit residential uses, and there are areas where accessory dwelling units are appropriate.'",
        "'speaker_5': 'And then the future street type for Monroe Street is is local. And these are mostly characterized by residential uses consistent with what the applicant is proposing. The growth area strategy is all other areas of the city. This is where we anticipate to see 10% of new employment and 20% of new housing by 2040.'",
        "'speaker_5': 'And then blueprint also includes specific policy recommendations. So the land use and built for housing policy.'",
        "'speaker_4': 'For strategy.'",
        "'speaker_5': 'E states that individual rezonings to allow aids are appropriate and should be small, an area which is consistent with this single site adu rezoning. And then the University Park Neighborhood Plan is also applicable to this site and designates this area as single family residential, stating that new development should be integrated into the existing character of the neighborhood'",
        "'speaker_5': '. And this is consistent with the proposed rezoning, says ESU. D1 is a single unit district. Staff also finds the requested zoning meets the next two criteria. The rezoning will result in uniformity of district regulations, and it will further have a public health, safety and welfare.'",
        "'speaker_5': 'By providing a new housing unit that is integrated into the existing character of the area and implementing Blueprint Denver. Staff finds there's.'",
        "'speaker_4': 'A justifying circumstance for.'",
        "'speaker_5': 'This MAP amendment with the newly adopted plan guidance in Blueprint.'",
        "'speaker_4': 'Denver to allow aid to use throughout all.'",
        "'speaker_5': 'Residential neighborhoods. And then lastly, the proposed rezoning is consistent with the urban edge neighborhood context, the residential zoned districts purpose and the specific intent of the ESU de one zoned district. So based on the review criteria, staff recommends approval of the proposed rezoning.'",
        "'speaker_5': 'And that concludes the stock presentation.'",
        "'speaker_4': 'And I am available for questions.'",
        "'speaker_0': 'All right. Thank you, Libby. Tonight, council has received one written comment on Council Bill 464. There is one suspended comment in favor of the application and no submitted comments in opposition of the application application. All members of Council that are present have certified that they have read each of the submitted written comments.'",
        "'speaker_0': 'Do any members need more time in order to read all of the written testimony that was submitted? CNN council secretary let the record reflect that all written testimony, both in favor and in opposition of Council Bill 464 has been read by each member of council and all written testimony will be submitted to the official record of the'",
        "'speaker_0': 'hearing. We have this evening, one individual signed up to speak and our first speaker and only speaker is Tyler Higgins. Sorry for mispronounce you anyway.'",
        "'speaker_1': 'So that's perfect. Thank you. Hi, I'm Tyler Keegan's. I live at the property address. Just wanted to follow up real quickly that similar to the last applicant we're looking to, has a mother in law to live with us in the back of the property.'",
        "'speaker_1': 'It's pretty much straightforward like that, but I just want to join, say hi and and see if there are any questions as well.'",
        "'speaker_0': 'All right. Thank you. That concludes our speakers questions from members of Council on Council Bill 464. See no questions. The public hearing is closed. Comments by members of Council on Council Bill 464 Council Member Cashman.'",
        "'speaker_2': 'Thank you, Madam President. I do believe this application meets the requirements with with some comments in that our plans talk about ideas being appropriate to maintain the residential quality character of the neighborhood. They say its priorities are appropriate to add to our housing stock.'",
        "'speaker_2': 'What I'm asking is that our community planning and development folks get to work on a and a a an option where this an idea can be approved but without allowance for short term rentals. I would really like our CPD staff to do a merge with the list of accessory dwelling units with our short term rental licensing list'",
        "'speaker_2': '. So we get some information to find out how these units are being used. I'm getting increasingly cranky at not having that option. Am a strong believer in accessory dwelling units as important to solving our housing issues. But if I if I start seeing data that tells me it's being used as alley hotels, I will find that not'",
        "'speaker_2': 'compatible with our plans. And we'll start voting no on ADU applications until we have that available option. Tonight, I'm pleased to support this and will ask my colleagues to join me.'",
        "'speaker_0': 'Thank you, Councilmember Cashman, and agree on all of those points and seeing that this one before us does meet all of the rezoning criteria, happy to support it as well. Madam Secretary, roll call on Council Bill 464.'",
        "'speaker_2': 'Cashman High.'",
        "'speaker_4': 'Sandoval. I. Sawyer, I. For it, I. Black. I. The tobacco. Claire.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'When?'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Brendan.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_4': 'Nine three.'"
    ],
    "A bill for an ordinance amending Ordinance 20200961, Series of 2020, to extend the duration of an interim zoning regulation to allow certain temporary unlisted uses in Former Chapter 59 zone districts due to the COVID-19 disaster emergency. Amends Ordinance 2020-0961 to extend the zoning administrators authorization to approve temporary unlisted uses on Former Chapter 59-zoned land through December 31, 2023. The Committee approved filing this item at its meeting on 5-25-21.": [
        "'speaker_0': 'Nine I's Council Bill 20 10464 has passed. Moving on. Councilmember Herndon, will you please put Council Bill 592 on the floor for final passage?'",
        "'speaker_3': 'Yes, Madam President, I move that council bill 592 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved. We've got a second by Councilmember Flynn. The required public hearing for Council Bill 592 is open. And I see we have Tina Axelrod here for the staff report. Go ahead, please, Tina.'",
        "'speaker_5': 'Good evening, everyone. My name is Tina Axelrod. I work as the zoning administrator in the Community Planning and Development Department for the city of Denver. And there we go with that.'",
        "'speaker_0': 'It would be great out there. You could. You did it. Thank you, Tina.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'It was just lagging on my side. Go ahead, please.'",
        "'speaker_5': 'This bill is actually sponsored by Councilwoman Amanda Sandoval, and I imagine she might have a few words to say. I wasn't sure she wanted to kick this off or come in after me. So I'll take it. You're on mute, Amanda.'",
        "'speaker_4': 'I'll come in after you. Thank you, Tina. Okay.'",
        "'speaker_5': 'This is Council Bill 20 1-0592. This council bill amends a previously adopted interim zoning ordinance that city council passed back in October of last year. That ordinance number was 2020, dash 961, and that was in support then, as it is still today in support of the city's response to the COVID pandemic.'",
        "'speaker_5': 'At the time that the bill was originally passed late fall, it allowed COVID related temporary uses to be permitted across the entire city under an existing zoning administrator authority to do so in the Denver zoning code, which encompasses about 75% of the city.'",
        "'speaker_5': 'And the ordinance ordinance extended that that authority to land zoned under former chapter 59. So that's. Doing the math. Another 25% of the city at the time the ordinance was passing, we were in obviously still in the first six months or so of the pandemic.'",
        "'speaker_5': 'And the expiration of that interim ordinance was tied to the act of the state and city emergency public health orders. So this amendment does not change anything substantively about what was in the previous ordinance except for the expiration date, which has been extended to continue assisting the city's recovery from COVID negative impacts on both the local economy'",
        "'speaker_5': 'and on housing stability in the city. That extension would allow temporary uses that would be permitted in either former Chapter 59 until December 21, December 31st, 2023, for a year and a half out. So what kinds of emergency uses were allowed under the previously adopted ordinance?'",
        "'speaker_5': 'We primarily it was either temporary homeless shelters of a permanent nature or operated exclusively indoors and then to novel uses which were temporary managed campsites, which are outdoor shelters provided for homeless persons, and then a temporary expansion of outdoor space for patio and seating for restaurants and bars.'",
        "'speaker_5': 'And these are pictures from actually approved sites across the city and where they successful, I think by most estimations, having that authority and having that allowance to permit these types of uses. Former Chapter 59 Zone Lands was really important and played a role in the success of the program to date when it came to the temporary outdoor'",
        "'speaker_5': 'patio expansion. In total, as of mid-June, the city had assisted 192 Denver restaurants and bars to increase their capacity. Those are the yellow dots on the map, you see. And 23 of those 192 where about 12% were on former Chapter 59 zone property.'",
        "'speaker_5': 'The scale of those expansions are not shown here on the map, but they they varied and I know personally of a few that really took advantage of parking lots to substantially increase their capacity outdoors. And then when it came to the managed campsites, having the authority to allow the managed campsite on former Chapter 59 zone lad land'",
        "'speaker_5': 'did did open up the door to several private properties that were made available for this use during the pandemic and which is now continuing. The first two temporary managed campsites were established in Capital Hill and one of those two sites did include land zoned under former Chapter 59.'",
        "'speaker_5': 'Those have closed now, and we have two new managed campsites, a permitted one at Regis University, which opened up in June. And that is all on land zoned for Chapter 59 and one and Park Hill, which is actually under the Denver zoning code.'",
        "'speaker_5': 'But having that authority to permit these types of temporary uses on former Chapter 59 land did address, you know, critically needed 24/7 shelter and supportive services to persons during the height of the pandemic and now continuing where we're still feeling the impacts.'",
        "'speaker_5': 'And that's really why we're asking for the extension tonight. While the public health orders are ending, the impacts are still with us. The economic impacts from the extended business closures and revenue lost during the height of the pandemic has is is is proof and evidence of the need for continued assistance.'",
        "'speaker_5': 'So the city as a whole will be continuing the temporary outdoor patio expansion through October 31st, 2022. So the authority and the ordinance tonight would be more than enough to capture continuing and also creating new extensions on land of the former 59 through the end of that program.'",
        "'speaker_5': 'Other temporary uses that might crop up, including the managed campsites, would be able to go longer. And again, that's in response to a substantiated increase in the demand and need for shelter that's directly related to the effects of the pandemic.'",
        "'speaker_5': 'And I've put on the slide there a quote from the Department of Housing Stabilities report that was released in March of this year on their response to the housing needs generated by the pandemic. It's not ending any time soon, and it was on the advice from our housing specialists in the cities and housing providers city wide to'",
        "'speaker_5': 'extend it to December 31st, 2023. They felt that was the timeframe in which they could have the elbow room to not only continue dealing with a day to day need, but have the capacity to assist in transitioning to more permanent housing at all scale and the city.'",
        "'speaker_5': 'We take the text amendments through a read set of review criteria as well. Every time we come before you and here are the three criteria. The first criteria is, is this bill or ordinance and its intent and purpose consistent with adopted land use policies and plans.'",
        "'speaker_5': 'This ordinance, KPD finds, is consistent with the equitable, affordable and inclusive goals within the comprehensive plan as it addresses, seeks to address continuing housing needs and supporting the local economy. Similarly, the ordinances goals support strong and authentic neighborhoods by providing a new type of transitional housing on the spectrum, from overnight shelters to permanent housing.'",
        "'speaker_5': 'It provides one more option for people who are in need of housing or are currently unhoused. And then the the uses that support local businesses are certainly supportive of the goals of ensuring a vibrant local economy and authentic neighborhoods.'",
        "'speaker_5': 'Similarly, the ordinance seeks to provide the economic diversity and support the economic diversity, particularly of small businesses that have suffered and are being allowed to extend to expand their capacity has been quite the of the. Lifeboat for those businesses, as we understand it, and the feedback we've received.'",
        "'speaker_5': 'And Blueprint Denver again, we feel this ordinance is purpose and intent supports and furthers the goals. Whether it's housing policy or economic policy to the same ends as discussed before, are supported by the policies and blueprint. Denver And then being able to treat the city as the whole rules playing out in different parts of the city just'",
        "'speaker_5': 'based on the the unfortunate fate being dealt to you as a landowner, whether you're on the in the old code or the new code or the relatively new code, not having that be the differential between getting the support needed, whether it's expanded patios or or having housing choices brought, you know, brought closer to home and into communities'",
        "'speaker_5': 'where there might be demand out. Because I'm former chapter 59 so land. Other adopted plans certainly are housing plan for housing and inclusive. Denver. This ordinance fits squarely in being able to authorize more flexibility to provide housing. Overall, CPD believes that the ordinance will further the public safety and welfare, in addition to being consistent with our adopted'",
        "'speaker_5': 'plans, and will certainly provide in greater uniformity of zoning regulations and restrictions across the entire city. With that, CPD does recommend approval of Council Bill 592 and again, this will amend the previously adopted City Council Ordinance and extend the expiration date for this temporary authority of the Zoning Administrator to allow listed temporary uses of former Chapter 59'",
        "'speaker_5': 'zone lands out to December 31st, 2023.'",
        "'speaker_0': 'All right. Well, thank you, Tina, for the staff report. And Councilmember Sandoval, did you want to add anything?'",
        "'speaker_4': 'I could add things now or I can we tell our comment portion if you want to, we can go ahead with questions and then I can add during the comment portion. Thank you. All right.'",
        "'speaker_0': 'Very good. Thank you. All right. Tonight, counsel has received three written comments on Council Bill 592, and there are no submitted comments in favor of the application and three submitted comments in opposition of the application. All members of Council that are present have certified that they've read each of the written comments.'",
        "'speaker_0': 'Do any members need more time in order to read all of the written testimony that was submitted? CNN council secretary let the record reflect that all written testimony both in favor and in opposition of Council Bill five nine to have been read by each member of Council and all written testimony will be submitted to the official record'",
        "'speaker_0': 'of the hearing. We have this evening ten individuals signed up to speak. And our first speaker is Matthew Leek.'",
        "'speaker_1': 'Excellent. Thank you. Axelrod I got to say, that is an awesome name. I'm not going to comment much on the outdoor dining portion. I don't think that's going to generate much controversy. I think everyone pretty much agrees. That's awesome.'",
        "'speaker_1': 'I live in capital. I was a neighbor to a safe outdoor space for six months. The one over at the church around 13th and 14th in Grant or Logan. I got to say, the R.A. made a lot of promises to the neighborhood, and they were all true.'",
        "'speaker_1': 'The place was clean, orderly, uh, quiet. If I hadn't been told I was there, I don't think I would've known. And from what I understand, it helped a dozen people find the transitional housing they needed. I kind of like that spectrum on the continuum of housing.'",
        "'speaker_1': 'Um, so I'm happy to say that if anybody is concerned about what the presence of one of those live, I mean, in their neighborhood, my experience you really ought not to worry about. And it was fantastic. However, I do live on Cap Hill, which means I can't let this go without remarking on the flip side, which is'",
        "'speaker_1': 'my condition. My support comes with a condition here. You might notice if you walked around Capitol recently that a little bit of temporary fencing has gone off. And I think that's because people suddenly got me in this, because we've gotten the idea, got the message from the city.'",
        "'speaker_1': 'If an unsanctioned encampment chooses your lawn to set up, then you're screwed. It's at least a month of any kind of crime you can imagine. It's burglary, break ins, arson. Sometimes it's assault. It's people chasing you with a golf club and a lot of meth and heroin use.'",
        "'speaker_1': 'The reason this matters? Well, I am totally in favor of expanding safe outdoor spaces. I think they're fantastic. This has got to come with the flip side. We can't let it become a viable career path for people to operate open air, bicycle chop shops on busy intersections in Capitol Hill.'",
        "'speaker_1': 'So while I support the measure, I would ask that my support come with that qualification that City Council uses the totality of its influence to cooperate with what 83% of the voters in Denver have expressed, which is we want a goddamn camping ban.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker is Stephen Benishek.'",
        "'speaker_1': 'All right. This is working.'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_1': 'Okay. Um, hi. My name is Susan Bunch. I live in University Park, and I'm asking you to vote for this because it seems like every meeting there's someone here to talk about housing and homelessness. And this issue is very quickly becoming probably the most pressing issue in the city.'",
        "'speaker_1': 'We just had some talk about the problems cause for him. And so everyone on those council is very well aware of how there are far too many people living on the streets in this city and they have taken steps to address it.'",
        "'speaker_1': 'In all fairness, while it's still much more difficult than should to build housing in the city. Safe outdoor spaces shine as an example of cooperation among the city and the best in civil society. We hear almost every week how bad the homeless problem in the city has got.'",
        "'speaker_1': 'And yet here we have some organizations volunteering to host people on their private property and have everything taken care of by a private nonprofit group. These sites are not meant to be a permanent solution, and the longer they're necessary is a continued indictment on our failed land use and zoning policies.'",
        "'speaker_1': 'However, right now they are extremely necessary, as we just heard, and every person living these sites is one less person living on the streets. The organizations that have participated in this program should be commended for their willingness to step up and solve the pressing issue in this community.'",
        "'speaker_1': 'And for that reason, I urge you to vote yes. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jason Hornbeck.'",
        "'speaker_1': 'And. Q Madam President and Council I would, but it's been a while since I've spoken to you, and it's very nice to see and hear you all. So I'm Jason Wernick. I'm speaking on behalf of the Jason Park Neighborhood Association in Denver.'",
        "'speaker_1': 'I live at 50th Indicator, which is about two blocks away from the registered outdoor site, which we strongly support and we feel extremely safe and sound having in our backyard. Sorry, I'm speaking in favor of the extension of this temporary use ordinance for Chapter 59 just because of the all the good we can accomplish through removing unnecessary'",
        "'speaker_1': 'land use restrictions. And this is an improvement over the last several months. Our overly complicated zoning code or codes, as it were, and proven to be a hindrance on our ability to optimally use our land, as evidenced by the need for no special ordinances.'",
        "'speaker_1': 'This inefficient land use has resulted in a housing shortage which perpetuates displacement, wealth inequality, which has resulted in the need for emergency housing services like our wonderful safe outdoor spaces. Please vote to extend this ordinance. It was a very good idea.'",
        "'speaker_1': 'I was happy to support it the first time and I'm happy to support it now because it continues to be necessary. But even so, these temporary solutions are a lot like treating lung cancer with a cough drop. It's time we made some permanent changes to our zoning code because pollution, inefficiency and exclusion aren't working for us.'",
        "'speaker_1': 'Thanks for your time. Have a good night.'",
        "'speaker_0': 'Thank you. Our next speaker is Maya Price.'",
        "'speaker_4': 'Hi. Can you hear me? Mm hmm.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_5': 'Thank you, Madam President.'",
        "'speaker_4': 'I'm speaking in.'",
        "'speaker_5': 'Support.'",
        "'speaker_4': 'Of the extension.'",
        "'speaker_5': 'For.'",
        "'speaker_4': 'Safe outdoor spaces. I have been trying to educate myself on the situation of homelessness.'",
        "'speaker_5': 'I live at 1625 Larimer Street.'",
        "'speaker_4': 'So I see the effects of that every day when I walk outside of my front door.'",
        "'speaker_0': 'I understand that homelessness.'",
        "'speaker_5': 'And the affordable housing issue is extremely complicated, and there are many pieces to the puzzle. One thing that I know, and I'm sure you all know, is that we need to scale it up. There are just.'",
        "'speaker_4': 'So many people in need of.'",
        "'speaker_5': 'The housing. So while safe outdoor spaces only help, you know, 50 or 60 people at a time.'",
        "'speaker_4': 'That's one piece of the puzzle.'",
        "'speaker_0': 'And at least they're quicker.'",
        "'speaker_4': 'Than building.'",
        "'speaker_5': 'A home or obtaining a motel. So please vote yes.'",
        "'speaker_4': 'To extend the that permission. And I hope I didn't freeze up during that process. Thank you.'",
        "'speaker_0': 'Now we were able to hear they hear you the whole time. So all good. Thank you. Our next speaker is Jonathan Patoka.'",
        "'speaker_1': 'Good evening, counsel. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay, great. Yes. My name is Jennifer Patoka. I am a resident of District three over in West Colfax. I would love to emphasize everything that my Jason and Steve said before me strongly in favor of this extension, although chagrined somewhat that we need this to be a temporary use.'",
        "'speaker_1': 'I would argue that these should be sort of constantly accessible uses both the temporary outdoor patio spaces and the state housing sites themselves. During the deliberations over group living amendments. It was clear that the Planning Board, Council Committees and this council body as a whole were strongly in favor of bringing or outmoded Chapter 59 districts up to'",
        "'speaker_1': 'par with the newest Denver zoning code. It was addressed primarily as an equity issue there, and there was a lot of consternation and really just concern that we have 25% of our city. That isn't up to the latest with the rest of our code, flawed as that code may be in some cases.'",
        "'speaker_1': 'I know that a number of you have advocated for ways to get there. I do see this extension as a temporary Band-Aid in reaching that goal. 59, of course, made sense at the time when when there were some sort of large land use and sort of national plans in progress when the new Denver Zone zoning code was'",
        "'speaker_1': 'created. But to not belabor the point too much as reviewed in the comprehensive plan that was presented to us here, that go to strategy is really important and every neighborhood should be contributing to our housing solutions, not just 75% of neighborhoods.'",
        "'speaker_1': 'This is a really important use. We're absolutely still in an emergency situation here with housing. Honestly, I expect we will still be in an emergency situation by December 31st, 2023. And I'm hoping we can use these two years to resolve the failure in our zoning code that prevents these uses from being constantly accessible to our population.'",
        "'speaker_1': 'Again, I would encourage you all to vote yes in favor of this amendment, and that's all. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker this evening is Adam Astrup. And I believe we'll have to have our staff go ahead and. Bring him into the panelists, please. All right. Thank you.'",
        "'speaker_1': 'Please go ahead. My name is Adam Astrup. I am a resident of District seven and I am speaking tonight in favor of the extension. You know, I think, again, just to echo everyone else, you know, we're here because Chapter 59 was not resolved a decade ago as it was supposed to be.'",
        "'speaker_1': 'And at this point, I think probably the easiest way to do that would just be to engage in citywide land use reform extreme. You know, extending this would be helpful. These safe outdoor sites are actively helping people now in our community, and it's impossible to build housing.'",
        "'speaker_1': 'So, you know, then they kind of need to do something like this. But, you know, there's you heard anger in the general public comment. You heard anger from at least one of the speakers tonight. And nobody's going to be less angry by 2023.'",
        "'speaker_1': 'And if we don't have a policy answer for the housing crisis in Denver, it's going to be a big issue. So please vote yes. And then again, city wide land use reform. But thank you so much for all your work and I hope you guys have a good rest of the evening.'",
        "'speaker_0': 'Thank you, Adam. Our next speaker is Mina Goldstein. We'll have the central staff bring her in. I believe it was Nina Goldstein that we had up next. And Mina, if you might raise your hand and the attendees will go ahead and get you moved over.'",
        "'speaker_0': 'In the interim, we can go ahead and go to Katie Blakey. Go ahead, Katie.'",
        "'speaker_4': 'Say hello, council members. And my name is Katie Blaikie and I live in District ten and I'm speaking in support of this. I think by just about every measure, safe outdoor spaces have been really successful, both in improving the conditions of the neighborhoods and most importantly, improving the conditions of those people who live there.'",
        "'speaker_4': 'We need more safe outdoor spaces and we need multiple in every single neighborhood and every single district, as well as safe parking areas and other human centric solutions. Until we have all the affordable housing we need to accommodate all the rights.'",
        "'speaker_4': 'I agree with previous speakers that this change should be permanent. Our housing crisis is only going to be way worse in a year and a half, especially since we're not able to build housing as quickly as we need to to accommodate everyone.'",
        "'speaker_4': 'So I would also ask you to please look for other ways to add flexibility to Arizona so that in COVID and beyond, we can adapt more to the needs of our growing and changing city. Thank you.'",
        "'speaker_0': 'Thank you, Katie. And our next speaker, we have Mina Goldstein. Goldstein and Mina. We're having a little bit of trouble. There we go. We got you promoted into the panelists, if you can. Go ahead. Go ahead, Mina. All right, we'll get her promoted up here.'",
        "'speaker_0': 'Know we're not able to hear you or anything. We're not sure if we're having technical issues on our side or on yours, but we'll try to figure that out. And we'll go ahead to our next speaker. We have Tess Dougherty.'",
        "'speaker_0': 'Go ahead, please. Tess.'",
        "'speaker_4': 'Hi there.'",
        "'speaker_5': 'I am. Can everybody hear me?'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_5': 'Great. So, um, the city council is there to respond to someone's comment. I don't think that you all have done everything in your power. I was reading the the code again this week, and it sounds like definitely y'all have more power that you've not been yielding to find some additional safe outdoor spaces or to end the dramatic'",
        "'speaker_5': 'displacements and instead substitute what is happening three times a week with something more humane and and, you know, not far less negligent with our. You know, money that's being spent and just totally squandered. And so we want some damn humanity is what we want.'",
        "'speaker_5': 'And and so, you know, entitled comments like, you know, the bicycle shop shops for people living on the streets with few other opportunities to make money in the first place diminishes the very real needs of this community. And so I just wanted to name that.'",
        "'speaker_5': 'And so I'm just curious, what about Downtown Denver partnership? What about what about Denver, Inc? What about Arnault's? You know, why have Arnault's not been tasked with finding with their neighbors and businesses in each. You know, an associate in his district?'",
        "'speaker_5': 'Can't that be something that, like, we are working, you know, public? You know, government relationship, because it sounds like we're really passionate about those types of relationships, but I don't know that we're really using them in all of the ways that we could be.'",
        "'speaker_5': 'And I also wanted to point out that, of course, I am totally in support of associates. I don't think it's going to be temporary. This is something that like, you know, people need this transition even. This is something that has highlighted that.'",
        "'speaker_5': 'And people need a transition sometimes from the streets to to permanent housing. And this provides that. And so I think that we need to start thinking about it in that way and start really that's why it's so important that we find these sites throughout the city.'",
        "'speaker_5': 'And and I also just want to highlight that, you know, the government that you guys gave money to restaurants, which I think was totally fair and they needed it to build tents that were in the right of way and were encumbrances against the city code.'",
        "'speaker_5': 'And during the pandemic, some of them are still up. Some of them have blocked the line of sight, which is have caused car accidents. But apparently no additional stop signs are allowed to protect the public safety. But at the same time, we are sweeping people three times a week.'",
        "'speaker_5': 'So, you know, it's just and, you know, we're orange lining the city. It's the new, you know, mode of segregation in Denver. And so I'm just curious who gets to. Enforce the code and who has to follow it because it doesn't seem like, you know, I'm totally supporting the extension of this.'",
        "'speaker_5': 'But I would just argue and would like to call attention to the fact that it's not being equitably enforced. These extensions like who gets who gets extensions, who gets you know, who gets these these permissions during a global pandemic?'",
        "'speaker_5': 'Because people experiencing homelessness, who are being displaced not just by the housing market, but by the city of Denver, they don't get these types of extensions. They don't get these types of exemptions. So, you know, I would ask that you do that for them, too.'",
        "'speaker_0': 'Thank you. Yes, that's our time allotted for speakers. We're going to go ahead and move to our final speaker and it's David Hagan. And David, we're having a little bit of trouble with our system. And so I'm hopeful we'll be able to hear you and get you up into the queue here.'",
        "'speaker_1': 'Can you hear me?'",
        "'speaker_0': 'Mm hmm. Yep.'",
        "'speaker_1': 'Hi. Thank you for letting me speak. As you all know, I'm going to be all for this amendment. I wanted to address the fencing in the rocks along with this amendment. And we're going to continue to allow the restaurants to be encumbrances through this, but yet we're not going to enforce the code and and the zoning, which'",
        "'speaker_1': 'I've been reading a lot, is just a test was talking about you guys have the power to end these rocks on the side of the road and all the orange fencing and you need to do it because it is an absolute violation.'",
        "'speaker_1': 'Whereas right now we're trying to vote on something that is going to be law for the next couple of years or whatever. You need to enforce the law that we already have because what you're doing is hurting people.'",
        "'speaker_1': 'When bicyclists run into those rocks, they get hurt. When homeless people trip on those rocks, they get hurt. So in the fencing, it's just it's not it's not it's not logical that legal and it's not attractive. So please remove that at the earliest convenience.'",
        "'speaker_1': 'Let's see. I'm sorry. I'm driving. So I don't have all the stuff that I wrote down quickly accessible. Yeah. I mean, I guess basically, you know what I'm going to say? I don't want any of that stuff. My approved this temporary safe outdoor spaces and as was said before, that need to be more than temporary.'",
        "'speaker_1': 'They need to be able to be used as a transition for everybody. And and. Yep, that's all I would say today. Sorry. Thanks.'",
        "'speaker_0': 'All right. Thank you, David. All right. We're going to go ahead and try to get you heard during this public hearing. Mina, if you can, go ahead and unmute and go ahead with your comments, please. We're not seeing a mike associated with you.'",
        "'speaker_0': 'Mina and so. I think we are going to have to go ahead and move on showing that talking's permitted, but for some reason we're having difficulty. And so thank you all to all of our public hearing speakers this evening.'",
        "'speaker_0': 'And that concludes that portion. Questions from members of Council on Council Bill 592. Councilmember Zoya.'",
        "'speaker_5': 'He's not a president. So a couple of questions, I guess, to clarify the timing of the ordinance. So the original ordinance said it would be automatically repealed 21 days after the expiration or rescission of all comprehensive city and state public health orders as a result of the emergency.'",
        "'speaker_5': 'So the governor rescinded the public health orders last week and the cities aligned with the state. So has that automatic repeal timeline already begun? You know, I should have had the answer to that question before I walked in the door here.'",
        "'speaker_5': 'But I believe and I see Jill on, too, I don't know if she knows any more than I do. I know the state one. So 21 days from the first would be July 21st. I don't it it's not necessary.'",
        "'speaker_5': 'It's not exactly that. The city is aligned with everything the state has done. The city has its own set of emergency orders. I know a lot of them have been rescinded. I don't know if all of them have.'",
        "'speaker_5': 'If this ordinance gets adopted tonight, I think I'm still within the 21 days. So, for example, for Regis and the S.O.S., there will reissue a zoning permit under the new authority to extend its term out beyond, you know, to to the point that it asked for it originally, which I think was a six or seven month term'",
        "'speaker_5': '. And then no other no other permits. Are it at risk of expiring? The outdoor permits, the outdoor patio expansions didn't have to get zoning permits to begin with. So I will update my use determination to extend the time frame for that, and that will just apply.'",
        "'speaker_5': 'No one has to come back in for those. 23 or 25 businesses won't have to come in for new permits. Got it. Okay. So and then I guess what happens if it doesn't get extended? What does that look like?'",
        "'speaker_5': 'If it if this ordinance it's not going to adopted. Right. Then the authority would expire at the 21 day mark post as the last public health emergency order issued by the state or city and probably the city. And we'd have to shut those places down.'",
        "'speaker_5': 'Got it. Okay. And I think the city's public health order continues for another like maybe month or so. So. So that's good to know. So how was the December 31st, 2023 date for the extension chosen? As I mentioned in my presentation, it was in consultation with the executive directors of Host and CPD and Dito, and every every'",
        "'speaker_5': 'city agency had a seat at the table as we discussed the extension. And it was primarily driven by the housing need. I felt that an additional year and a half to have these sprinkled about the city would just continue to support the efforts and and deal with the the significant blip that happened during COVID, at least at'",
        "'speaker_5': 'least at the margin deal deal hopefully with most of the COVID related bump up. I mean, it's not going to solve it all or get everything, you know, get everyone housed, at least for for the after effects of the pandemic.'",
        "'speaker_5': 'That was a reasonable time frame. Okay. So not a year and a half. Two and a half years. Sorry. Yes. I can't count. Very well.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'It's good to announce this key saying December 31st, 2023. And instead of trying to count it down. Can you. Okay, there.'",
        "'speaker_4': 'Still.'",
        "'speaker_5': 'Does. Denver, do we have enough shelter in hotel beds to serve the needs of our unhoused population? Now is. I'm just trying to understand exactly what this looks like. As I understand it now that the demand and the need still far outstrips the supply that the city has either direct access to or direct control over, whether it's'",
        "'speaker_5': 'a bed in a new 24 seven city shelter or in any of our partner shelters or in some of the the smaller in place shelters that, you know, with churches not opening again. Right. We lost all that ability to do a lot of the ad hoc sheltering that was happening in the city in small on a smaller'",
        "'speaker_5': 'scale of 8 to 10 beds in a in a church across the city. So at this point, between the the the absolute increased in numbers of people experiencing homelessness and the instability that went up from March to March.'",
        "'speaker_5': 'In that report that I shared, the numbers are there is a 60% increase in the demand for housing from March 2020 to March 2021. No, we're we're nowhere close to having a bed for everyone who needs one and who wants one.'",
        "'speaker_5': 'Okay. And how many beds are there are 200 beds in safe outdoor spaces currently, is that right? The number which I. Have. It's, it's it's about 880 some beds. I'm going to find it. Um, I think it's is ability to house about 100 persons today in the to manage campsites that have recently been permitted in June and'",
        "'speaker_5': 'are open and operating now got it's 100 beds between the two campsites yet is 100 persons capacity. It's it's fewer tents but some of those tents are designed to hold more than one person. Okay. Understood. So how many safe outdoor camping sites are you as the zoning administrator considering adding between now and that proposed end date of'",
        "'speaker_5': 'December 21st, 2030, as we will consider under the criteria limitations that have been adopted in the messages to such termination, any and all applications that come our way. So the city is not has not come forward as the applicant for any of these managed campsites.'",
        "'speaker_5': 'It's been the institutional property owners that have come forward. So as many as we get, we will consider them. We'll hold them up to to the light of whether they meet the criteria that have been specified, which includes some limits on on the applicant has to be a nonprofit entity.'",
        "'speaker_5': 'Of course it's allowed in most zone districts currently, and then all the agencies review the prospect from their their disciplines, whether it's fire, electric safety, duty, PG for public health and sanitation, stormwater, sewage and wastewater gets involved with porta potties.'",
        "'speaker_5': 'And then our human service partners are all involved. So it goes through a full review with the site planning application, but we will take in as many as we get and timely review them and and get them up and running.'",
        "'speaker_5': 'The city is a partner in in so far in many of these campsites. They are given some priority expedition through the process because of the emergency and the need for housing. So we try once we do get an application, we do try to get it through very quickly because of the dire need.'",
        "'speaker_5': 'But yeah, we have it. The city is yet to bring forth one on city owned property, for example. As an applicant, though, we did spend close to six months looking for city owned land to do one of these.'",
        "'speaker_5': 'It ended up being the churches and the schools that were able to quickly mobilize and come forward with the first four. Got it. Okay. So I guess what I'm trying to sort of determine is if we're short on shelter beds and hotel rooms and safe outdoor campus spaces are the next option.'",
        "'speaker_5': 'But we only have 50 or 100 beds at two total safe outdoor camping spaces, and we're not sure when more are coming or how many people we expect to serve there. I guess I'm a little I'm trying to wrap my mind around how this is then the solution to housing our unhoused community.'",
        "'speaker_5': 'I don't think anyone said it was the solution. It's an option. It's one more way we can get people off the street and in safe shelters, be in a tent, a temporary structure. It's not it's not as hearty as being inside a building during winter, but it's feasible, it's doable.'",
        "'speaker_5': 'It's quick. And at least so far, the proponents have been able to wraparound services with the housing as well. It's it's just one more tool in our toolkit now that we didn't have before. But in no way, shape or form, I was suggesting, you know, this is the solution to ending homelessness and this, but it sure wasn't'",
        "'speaker_5': 'so. And when we looked at the original contract for this, it was 100 beds, $4 million or 100 tents, $4 million. And that included, of course, the showering facilities and the bathrooms and the tents themselves and the wraparound services and all of those things that, you know, averages out to $10,000 per tent.'",
        "'speaker_5': 'Now, we've got to save outdoor spaces, and there are 100 beds between the two of them. Is it still averaging $10,000 a tent for all of the services? I'm sorry.'",
        "'speaker_4': 'Can I. Can I say something? So in Council District one, we have a safe outdoor site. At the university site, it's 89 beds, 100 beds per site. So it's not 100 beds for two sites. I have the ability to house 100 people in Council District one according to their zoning permit.'",
        "'speaker_4': 'And then the other area in Council District 800 people. So it's it's 200 people. Just to clarify, it's not 100. I have that that we just had a 100 person permit.'",
        "'speaker_5': 'Okay. Yeah, that's what I thought. But when Tina said that it was 100 total bet on that.'",
        "'speaker_4': 'So do you.'",
        "'speaker_5': 'Know, Councilman Sandoval, if that $10,000 per tent cost is about that average is about is continuing?'",
        "'speaker_4': 'So when we first voted on the money to go to the safe outdoor site that had to those two and now so I think they're up to almost 400 people because they had those two tents, two sites that closed, and now we have two more that are helpful.'",
        "'speaker_4': 'So four total. But I didn't ask Chandler how much money per person this was costing. Got to.'",
        "'speaker_5': 'Bring in.'",
        "'speaker_0': 'Skye Stewart to clarify, just to make sure that we've got all the numbers correct and everything. And so we went ahead and promoted Skye there. Go ahead, Skye. And she had also helped out that our public health order does go through the end of this month for us.'",
        "'speaker_0': 'But go ahead, Skye. Please introduce yourself.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_5': 'Thanks. Councilwoman Skye Stewart from the mayor's office. Just wanted to clarify a couple of things. We're in a we're asking Tina some questions that are a little outside her scope. So want to step in and try and give her a little bit of a break here.'",
        "'speaker_5': 'And one of the questions that was asked was about our shelter bed capacity on on any given night. And I do want to be clear that we do have hundreds of beds available every night if every person off the street wanted to come in.'",
        "'speaker_5': 'Would we need to do some things like open rec centers? Absolutely. But we do have some flexibility in our system that will accommodate for that. One of the challenges we run into and you'll hear Brett, officials say this regularly, is that there are also barriers to people feeling comfortable in shelters.'",
        "'speaker_5': 'Some of those you don't have to deal with property, pets and partners, the three P's that she likes to bring up. And so safe outdoor space provides another option that is really important in that continuum of the system.'",
        "'speaker_5': 'But I do want to be clear. It is not that we do not have shelter beds available. We do we need different types of options to meet different types of needs. So I just wanted to get that one on the record.'",
        "'speaker_5': 'And we do absolutely. As you mentioned, Councilwoman Sonya, have contracts related to providing funding for a couple of different sites. There's some flexibility in that funding for additional sites. I can get our our host team to give you a breakdown of what that's looking like right now and what they think that that might.'",
        "'speaker_5': 'There's no like maximum. This is how much it could be per site for our per tent for each site. It's really more of a how do we make sure that we are helping to fund what is a an effort by a third party partner who's been really helpful with us in advancing this concept?'",
        "'speaker_5': 'So I can work to get a breakdown for you of what exactly that looks like kind of on a per tent basis right now and what they anticipate in the future. That'd be great. I really appreciate it. Thanks.'",
        "'speaker_5': 'And thanks for that clarification. So I just want to make sure we're on the record. The city's public health order ends August 1st is that it runs through July 31st. Right now, we're kind of taking those 30 days at a time as we're adjusting, you know, based on different sets of circumstances.'",
        "'speaker_5': 'But the existing public health order that started July 1st, a new, more condensed version runs through July 31st currently. And we'll reevaluate as we get closer to that July 31st. Got it. Okay. Thanks so much. Thanks, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer and Councilmember Sandoval, for the or for the help out and then Skye Stewart as well. Next up in the queue, we have council member Black.'",
        "'speaker_5': 'Thanks, Madam President. I had just raised my hand because I wanted to call it Sky. But you already did it, so thank you.'",
        "'speaker_0': 'All right. Great. Thank you. All right. Seeing no other hands raised for questions. The public hearing is closed. Comments by members of Council on Council Bill 592. Councilmember Sandoval Did you want to make some comments and share the sponsor?'",
        "'speaker_4': 'Thank you, Madam President. I would just like to say that Council District one has a site that just opened on Lugo and Regis University, and we have had not one incident there. Actually, what we've had our successes, we've I've checked in and people are able to get into other type of housing and that is just one use'",
        "'speaker_4': '. Also, we were able to the old image site if anyone remembers Denver when images of 38 and Tennyson stuck in a former Chester PD or former. They've been able to expand and have patio service out in the carousel area, which was not formerly allowed, and this amendment allowed them to expand into the right of way.'",
        "'speaker_4': 'And they also have other businesses, smaller businesses that were able to expand into the right of way. So I have heard from both businesses and I've also heard from people who are experiencing homelessness that this amendment to the former Chapter 59 works for people.'",
        "'speaker_4': 'And so therefore, that's why I'm sponsoring it. And I would ask my colleague to sponsor as well. And I just want to say I did read the public comment and I did read some of the letters that came in to us as council members thinking that this sanctioned and ten.'",
        "'speaker_4': 'It does not this does not address all of our homelessness issues in Denver. It does not that it is one solution and a new another tool into our zoning code to create equity throughout the entire city. So if 70% of the city is allowed to have it, why should the other portions not be allowed to have it'",
        "'speaker_4': '? I do not agree with that. I think that the city should be created and have access for all business owners to expand into the right of way if they would like to. And I also believe sites like villages that are under former Chapter 59, if they want to, on their private property, have this type of use just'",
        "'speaker_4': 'because they are limited to the former. Chapter 59 should be excluded from allowing this type of use of having their sanctioned site to help those who are experiencing homelessness get into new and other opportunities. So with that, I would ask all of my colleagues.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval. Up next, we have Councilmember Sawyer.'",
        "'speaker_5': 'Yes, Madam President, I really appreciate what Councilwoman Sandoval said a minute ago. I think it's really important to know that if it's allowed in 75% of the city, it would be fair for it to be allowed in the rest of the city.'",
        "'speaker_5': 'I guess my concern around it comes from the timing of the amendment now that the orders are starting to be rescinded. So, you know, it's a tough vote. According to the ordinance, it's both small businesses and safe outdoor spaces.'",
        "'speaker_5': 'And while I'm supportive of extending outdoor patio seating options for restaurants and small businesses, you know, I do have a lot of concerns about safe outdoor camping sites because we have a camping ban and it's a shame that the two can't be separated.'",
        "'speaker_5': 'So if private institutions and individuals want to support the Safe Outdoor Space Initiative on private property using private dollars and from donations, that's their decision. And I respect that. But the voters have spoken and they've said that they don't want outdoor camping in Denver.'",
        "'speaker_5': 'So I think using city tax dollars, city right of way city resources for safe outdoor camping sites flies in the face of a clear mandate from 83% of the voters in our city. The premise behind safe outdoor spaces was an understandable, temporary solution in extraordinary times.'",
        "'speaker_5': 'Extending them for another two and a half years is not. Especially when we've heard testimony tonight that we have hundreds of shelter and hotel beds available every night to serve our unhoused population. If people are not choosing to access those beds, it's a different matter.'",
        "'speaker_5': 'Those are probably there are probably dozens of laws, frankly, that the citizens of Denver would prefer not to follow. But we don't get to pick and choose which laws are enforced. I also have a lot of concerns about the rescission date of December 31st, 2023.'",
        "'speaker_5': 'Municipal elections will be held in May of 2023, and a new mayor and new council will be sworn in on July 15, 2023. And we're obligating those future city leaders to something that's extremely controversial without their consent. I think that's a dangerous precedent that we're setting.'",
        "'speaker_5': 'And so I am going to be a no on this. It's not a precedent.'",
        "'speaker_0': 'Thank you. Council member Sawyer. And not seen in the other hands raised. I'll go ahead and chime in here. You know, none of us saw a pandemic come in and where there are folks that the shelter system is not the place where they feel supported in spending the night.'",
        "'speaker_0': 'And especially for our community members who are maybe trans members who are, you know, in some of our shelters, same sex couples are not allowed to stay together. And so with that, you know, I understand the need for this and I'm happy to support it this evening.'",
        "'speaker_0': 'I will go ahead and pause there. I see council pro tempore is has chimed in and so I'll go ahead and abbreviate my comments and let you go ahead and chime in as well. Council pro tempore as.'",
        "'speaker_4': 'Thank you so much. Sorry it was slow to my but no commentary stuff. Just wanted to thank Councilwoman Sandoval for bringing this forward, for working with Regis, both on a vaccine site and now on a safe outdoor campsite.'",
        "'speaker_4': 'So really appreciate the partnership that you've garnered in your district and just really want to make it clear that it isn't just kind of an individual assessment.'",
        "'speaker_5': 'Initiative.'",
        "'speaker_4': '300 and authorizing safe outdoor camping or entirely different things. And even as a candidate, I was opposed to 300. But I support safe outdoor spaces. They are very different.'",
        "'speaker_5': 'And just want to.'",
        "'speaker_4': 'Make sure that we're clarifying costs. Whatever number Skye comes back with for what it costs per tent to operate.'",
        "'speaker_5': 'Guarantee you it's below.'",
        "'speaker_4': 'The amount that we spend in.'",
        "'speaker_5': 'Safety net.'",
        "'speaker_4': 'Services to individuals who cycle in and out of.'",
        "'speaker_0': 'City support.'",
        "'speaker_4': 'Services.'",
        "'speaker_0': 'Denver Health.'",
        "'speaker_5': 'The jail, whatever other kind of entities.'",
        "'speaker_4': 'When the free the social impact bonds were being developed, they calculated the cost for some of the most kind of frequent users of those services to be about $28,000 per person per year. You're not getting anywhere near that with what we're funding.'",
        "'speaker_4': 'Colorado Village Collaborative.'",
        "'speaker_5': 'They're essentially saving.'",
        "'speaker_4': 'The city money on the back end.'",
        "'speaker_5': 'Especially they're able to.'",
        "'speaker_4': 'Push.'",
        "'speaker_5': 'Individuals into.'",
        "'speaker_4': 'More permanent housing solutions. So very happy to support this and really grateful that Colorado Village Collaborative is a partner at the table for the city. Thank you.'",
        "'speaker_0': 'Thank you, Counselor Pro Tem Torres. And my last part of my comments were definitely going to be thanking Councilwoman Sandoval for her work on this and leadership, and especially as we need these different options to house folks during this time.'",
        "'speaker_0': 'And we're not out of this pandemic yet. No matter the public health orders, we're going to be feeling the ramifications of this for many years after. And so I am happy to have these other options. And with that being said.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 592.'",
        "'speaker_4': 'Sandoval. I. Sawyer? Nope. For. I. Last.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Then I. First.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Flint. Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': 'One day, I.'",
        "'speaker_0': 'Nine I's Council Bill 20 1-05. Name two has passed our pre adjournment announcement this evening. On Monday, August 2nd, Council will hold a required public hearing on Council Bill 5 to 2, changing the zoning classification for 2208 North Belair Street and South Park Hill.'"
    ]
}