{
    "A resolution approving a proposed Purchase and Sale Agreement between the City and County of Denver and Crosscheck LLC for acquisition of property located at 7900 E. Colfax Ave. Approves a $650,000 purchase and sale agreement with Crosscheck LLC for purchase of 7900 East Colfax Avenue to allow the Office of Economic Development to work with a community partner to create an affordable housing project in Council District 5 (FINAN 201631601).  The last regularly scheduled Council meeting within the 30-day review period is on 2-6-17.  The Committee approved filing this resolution by consent on 12-13-16.": [
        "'speaker_2': 'This is they realized it was going to be the same night I'm doing the bills.'",
        "'speaker_1': 'Yeah. This is a Councilwoman Ortega show tonight. Okay. Madam Secretary, can you please pull out the first resolution 1294? All right, Councilwoman Ortega, do you. These are both for quick question. Yeah. So go ahead.'",
        "'speaker_2': 'QUESTION Yeah. So in the information that was filed with the bill, it states that this is registered as a foreign company. And I just wanted to ask if someone here can tell us if there are other projects that Cross Check LLC has done here in Denver and if you could provide that information to us.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_1': 'Looks like we have Lisa Lumley from Department of Real Estate coming up.'",
        "'speaker_6': 'Good evening. Lisa Lemley Division of Real Estate. Councilwoman, I am not aware of other transactions with them. I can check on that for you, but I was not aware of it when we negotiated this particular deal.'",
        "'speaker_2': 'Okay. Thank you. Do you know what foreign company? Foreign. It says it registered as a foreign company. Do we know what country they're registered with?'",
        "'speaker_6': 'I need to go back and look because we received the W-9 in order to do the contract. And I do not remember it being a foreign entity.'",
        "'speaker_2': 'Okay. That's that's what our records show. So I will double.'"
    ],
    "A bill for an ordinance vacating a portion of right-of-way near 1750 15th Street, with reservations. Vacates a portion of the public right-of-way on the southeasterly corner of Wewatta Street at 15th Street, with reservations, at 1750 15th Street in Council District 9. The Committee approved filing this bill by consent on 12-13-16.": [
        "'speaker_2': 'At when you all have those costs more the the build out. And I know the building has capacity to maybe grow in phases. So as you know what those costs are, if you wouldn't mind sharing them, that would be much, I'm sure.'",
        "'speaker_2': 'Absolutely. Thank you.'",
        "'speaker_1': 'All right, counsel. Madam Secretary, please pull up 1274. You beat me to it. Thank you. You have a comment for Council 1274. Go ahead, Councilwoman.'",
        "'speaker_2': 'If I have this. Particular location correctly. We received a lot of communication from people regarding this vacation. For an alley in the lower downtown area, which is the southeast corner of Oui Water in 15th Street. And I, I don't know if this came to committee says it was filed on consent, but this raised a concern with the'",
        "'speaker_2': 'folks in lower downtown about closing off an alley access that would create kind of a dead end for the concern was especially expressed for women who, you know, enter and exit their buildings and would have to access it off the alley.'",
        "'speaker_2': 'And so, I don't know. Councilwoman Brooks, this is your district?'",
        "'speaker_1': 'Yes, this is my district. This is the find district nine. You know, at this particular I think you're getting it confused. There won't be any cutting off from the right of way. This was done for the development in this district, but it will not be taking any right away from the public.'",
        "'speaker_1': 'We had a quick conversation over this last last week.'",
        "'speaker_2': 'Okay. So their access is not being restricted and none of the alley is being blocked. They'll have full through access of the alley.'",
        "'speaker_1': 'Yes, I believe they will. And in do we have a representative Chris. Mr. Sheers, come on up here the great architect in Denver.'",
        "'speaker_7': 'I'm Chris. Here's 1550 when you've.'",
        "'speaker_1': 'So can you tell us about. Yeah. Tell us about the proposal in front of us. This is an Ali vacation here. Will it be cut off? They're asking will their access be cut off to the river here?'",
        "'speaker_7': 'No, no, no, no. This just this is dealing with a sidewalk area. And it has to do with a setback for the building. This proposed by Randy Nickels at the intersection of 15th and Maulana. I think that council woman I'll tell you the the issue that she brought up is a separate project and your concerns are legitimate'",
        "'speaker_7': 'for that.'"
    ],
    "A bill for an ordinance relinquishing an easement established by the New Avondale Subdivision Plat located near West Colfax Avenue and Federal Boulevard. Relinquishes certain easements established on the New Avondale Subdivision Plat recorded in 1963 located at West Colfax Avenue and Federal Boulevard in Council District 3. The last regularly scheduled Council meeting within the 30-day review period is on 1-30-17. The Committee approved filing this bill by consent on 12-27-16.": [
        "'speaker_2': 'Okay. Thank you. I was confusing this with that other project and thank.'",
        "'speaker_7': 'You for saying it's easy to get those confused. Thank you.'",
        "'speaker_1': 'Thank you. All right. We're going to bring up 1331. Thank you, Madam Secretary. Councilwoman. Last one.'",
        "'speaker_2': 'Yes. This is for the Avondale Shopping Center property. And I just want to know that when we relinquish certain easements, if properties that exist to the east of the shopping center, if their access will be affected in any way.'",
        "'speaker_2': 'And I don't know if there's anybody here that can speak to that.'",
        "'speaker_1': 'Anybody here.'",
        "'speaker_2': 'So that's your district.'",
        "'speaker_1': 'Lisa? Lisa Lumley, back up here.'",
        "'speaker_2': 'Sorry, Lisa.'",
        "'speaker_1': 'Three out of four of the bills. You're on fire tonight.'",
        "'speaker_2': 'So there are a number of businesses on the east side of that shopping center. Right. That basically access off a 14. Mm hmm. And I want to know if the. Relinquishing the the easements in any way, shape or form affects their ability to access their properties.'",
        "'speaker_6': 'I will check on this for you. This is not one of our bills. So but I am familiar with the center because of acquiring the parcel and I am part of the board for Avondale there representing the library.'",
        "'speaker_6': 'We do have a cross access agreement, though, with the other owner, so it should not impact it. But let me follow up and see exactly where this easement is an awful lot with you in the morning then.'",
        "'speaker_2': 'I'd appreciate it. Thank you. That concludes my requests.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Thank you, Lisa. All right. This concludes the items that have been called out. All other bills for introduction are ordered published. We're now ready for the block votes on the resolution, on the bills for final consideration and councilmembers.'",
        "'speaker_1': 'Please remember that this is this is a consent or block vote and we need to vote. Otherwise, this is your last chance to call at each item for a separate vote to form Ortega. Will you please put the resolutions for adoption in the bills on final consideration for final passage and do place on the floor?'",
        "'speaker_2': 'Will do I move that the following be moved in a block vote. Council Bill 17 000 for I'm sorry. Resolution. Resolution 16. 1294. 1295. 1318 0003 of 1217 1207 of 2016 1209. 13. Ten. And then. Council Bill 1193 series of 2016 and 1199 also of 2016.'",
        "'speaker_1': 'You u Ms. 1342 1274. Those other two were not on there.'",
        "'speaker_2': 'Okay. I thought those were bills for those are final. Sorry. Okay. So let me add 2016 excuse me, council bill 1274 and 1331 of 2016 as well, all in a bloc vote.'",
        "'speaker_1': 'Okay. And want to make sure, Madam Secretary, she got 1342 series of 12 and 16.'",
        "'speaker_2': 'I don't I'm sorry.'",
        "'speaker_4': 'And 1310. We got that one right.'",
        "'speaker_3': 'Okay. Yes.'",
        "'speaker_4': 'And not the other two.'",
        "'speaker_1': 'Okay. Okay. Good to go.'",
        "'speaker_4': 'I think.'",
        "'speaker_1': 'So. Okay. We're good to go. Take out those other two. Scratch. For the record, it has been moved the second it. Mr. Secretary, Roll Call.'",
        "'speaker_4': 'Black Eye Clerk Espinosa. Hi, Flynn.'",
        "'speaker_7': 'I.'",
        "'speaker_4': 'Gillmor I Cashman Canete Lopez knew Ortega I assessment i. Mr. President.'",
        "'speaker_1': 'I. 12 I's to advise. The resolutions have been adopted and bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing of Council Bill 90 1193 changing the zoning classification of 2099 and 2101 31st Street and require a public hearing for Council Bill 1199 Changing the zoning classification for 4211 Inca'"
    ],
    "A bill for an ordinance changing the zoning classification for 2099 and 2101 31st Street. Rezones property located at 2099 and 2101 31st Street from I-B, UO-2 to I-MX-8 (from industrial to industrial mixed-use) in Council District 9.  The Committee approved filing this bill at its meeting on 12-6-16.": [
        "'speaker_1': 'On the presentation monitor. On the wall you will see your time counting down. Speakers must stay on topic of the hearing and must direct their comments to council members. Please refrain from any profane or obscene speech and direct your comments to City Council as a whole and refrain from individual or personal attacks.'",
        "'speaker_1': 'Councilwoman Ortega, will you please put Council Bill 1193 on the floor.'",
        "'speaker_2': 'To do so? Mr. President, I move that council bill 1193 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved. And second it the public hearing for Council Bill 1193 is now open. May we have the staff report? And Lisa Hart from Committee Planning and development.'",
        "'speaker_8': 'All right. Good evening, members of council. My name is only Annalise Hook. I am a senior city planner. Excuse me. I'm here to present the application at 2101 and 2099 31st Street. The application is to rezone the property from ibe you oh two to I am X8.'",
        "'speaker_8': 'Moving on to Slide two. The subject property is located within Council District nine and more specifically, the Globeville neighborhood. On Slide three, you can see that the subject property is located within the global neighborhood. The specific subject property is located at 31st Street and Rings B Street, which is the nearest intersection.'",
        "'speaker_8': 'It is the former rodeo site and it is currently located across from the RTD maintenance facility. Familiar with that area and once again located in the Globeville neighborhood. Moving along to slide number five, the request itself is to rezone the property, which is somewhat over four acres, to redevelop the site.'",
        "'speaker_8': 'As such, the rezoning request is to rezone from IP use overlay to to IMX eight. The request is for an industrial context mixed use zone district with a maximum building height of eight storeys. The existing zoning context in the area is where the rail tracks are to the north.'",
        "'speaker_8': 'That is ibibio to as well with the surrounding zoning of I a and that industrial context use overlay to I being Yalta. And then to the Northeast we have CMCs 12, but the use overlay one. The existing context for the land use is industrial at this time, with surrounding land uses of industrial transportation, community utility as well'",
        "'speaker_8': 'as surface parking lot. As you can see in the top right corner, a photo of the site from Google Street View showing that it was the former ready ice site. And on the bottom right side of the page, you can see a photo of the RTD bus maintenance facility.'",
        "'speaker_8': 'The process that has gone through the rezoning has been typical in nature with the rezoning going to planning board November 16th of this past year, with Planning Board making a recommendation of approval, the Land Use Transportation and Infrastructure Committee reviewed this application in December of last year, as well as city council here tonight.'",
        "'speaker_8': 'The public outreach provided notice to all the listed renos. A notification of signs have been listed on the property property accordingly. As such, the review criteria is consistency with adopted plans, uniformity of district regulations, furthering the public health, safety and welfare.'",
        "'speaker_8': 'Just find circumstances and consistency with the neighborhood context, districts purpose and intent. Moving along to Slide 12 for review the applicable plans for the subject site. Starting with Comp Plan 2000, which provides a variety of applicable strategies related to environmental sustainability land use, which really encourages quality infill development that is consistent with the character of the surrounding'",
        "'speaker_8': 'neighborhood and offers opportunities for increased density, more amenities and broadens a variety of compatible uses. We also see encouragement for a variety of mixed use transit oriented developments, as well as continuing to promote mixed use development, which enables people to live, work near retail services and rail provided.'",
        "'speaker_8': 'Blueprint. Denver has the land use concept of this area as industrial as well as area of change with industrial having more opportunities for diverse employment areas and areas of change. Look areas within the city that we want to channel our growth where it is beneficial to improve access to jobs, housing and services.'",
        "'speaker_8': 'Additionally Blueprint Denver provides street classification as such 31st Street as well as Perkins and Rings b r excuse me, the schools where Perkins is actually a residential collector. However, as you can see, that's much further along. Specifically, we have a small area plan of the Globeville neighborhood plan, which was adopted in 2014, and that provides some specific'",
        "'speaker_8': 'land use concepts located within the industrial edge. Specifically, it's recommended as industrial mixed use. Some of those recommendations from the Globeville Neighborhood Plan are to improve compatibility between the industrial and residential uses of the area and to utilize industrial mixed use zone district as a buffer where we can improve the transition for the industrial mixed use area'",
        "'speaker_8': '. Additional strategies recommend revitalization through mixed use development with retaining light industrial uses that are compatible to the residential uses in the area, as well as transitioning to the industrial mixed use area on 31st Avenue and Rings B Court, which is a specific location of the site.'",
        "'speaker_8': 'Moving on to Slide 18, we have our most recently adopted plan, which is a 38 than Blake Hyde Amendments plan, which is an amendment of all the different plans in this area, but only specifically pertaining to building heights.'",
        "'speaker_8': 'As such, the plan recommends a base maximum building height of eight storeys on the subject site. As such, the request is consistent with the plans. Moving along. CPD finds that there is consistency with the adopted plans of Plan 2000 Blueprint, Denver, the Globeville Neighborhood Plan and the 38 the Blake Station Area Amendments Plan.'",
        "'speaker_8': 'We also find the uniformity of district regulations being applied consistently across the city that this application furthers the public health, safety and welfare through the adoption and furthering of the area and citywide plans. We find that the justifying circumstances in this area are the recently opened 38, the Blake Station area plan, as well as a transition to'",
        "'speaker_8': 'more residential and mixed uses in this area. We also find consistency with the neighborhood zone, context, district purpose and intent as the industrial context is where we see some of this irregular street grid building setback and a wider variety of uses to support employment as well as housing.'",
        "'speaker_8': 'As such, CPD recommends approval based on the findings. All of the review criteria have been met.'",
        "'speaker_1': 'All right. Thank you, Annalise. All right. We have no speakers for this specific item, so we'll go straight into questions by members of council. Are there any questions? Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President. Just a little note. You've spelled Globeville. Globeville.'",
        "'speaker_8': 'In each of your things. Let me. Before we put it officially, you might wanna.'",
        "'speaker_6': 'Cause I don't know if we have Globeville. We do have Globeville.'",
        "'speaker_1': 'Thank you. Dr. Sussman? Yes. Dr. Sussman. Here at work. Councilwoman Ortega.'",
        "'speaker_2': 'I have a couple of questions. Is the applicant here that's requesting the zone change?'",
        "'speaker_8': 'So if you maybe noticed, I was looking over my shoulder as they weren't expecting for the public hearing to start quite as soon as I've been messaging them and was hoping that they would walk in in the door if I saw me.'",
        "'speaker_2': 'Let me ask you a couple of questions, then, in a least. So you all know that we did a six month process that looked at any of our rail corridors where we are. Potentially seeing development happening. And the focus was particularly along corridors that carry hazardous materials.'",
        "'speaker_2': 'And so my first question for you and Elise is. To ask whether or not all of the training with the planning staff has occurred. Evelyn I'm forgetting her last name. Baker. Say that again. Evelyn Baker. Yes. Evelyn was going to be doing the training with the planning managers and the staff and and number one, wanting to ask'",
        "'speaker_2': ', has that transpired?'",
        "'speaker_8': 'If it has, it's possible. However, I have not personally attended that training.'",
        "'speaker_2': 'Okay. I've been asking. So one of the recommendations that came out of this report, and I want to request that we have an update of the report to the committee so that you all are privy to the details of what came out of that effort.'",
        "'speaker_2': 'But there is supposed to be a checkbox now on the application form for anybody that's requesting a zoning or that is moving to do design review, asking if their project is within a close proximity to rail. And then it allows us to do a better job in looking at some of the life safety issues related to ensuring'",
        "'speaker_2': 'that, you know, the development is thinking about or the developer thinking about and looking at some of those issues. So, for example, I'm going to pick on Mr. Zeppelin, who's in the audience. They have a development that has roll up windows that overlook the railroad tracks.'",
        "'speaker_2': 'And as we look forward, is that something we want to continue to do if we have an incident that happens on the tracks, that that poses a serious risk and threat to the people either living or working in a development that may have roll up windows that overlook some of these very train cars that potentially could be'",
        "'speaker_2': 'a harm. You know, as a city, we are required to have a hazardous mitigation plan. And if any of you have attended the LPC meetings, as a matter of fact, there was one going on this evening. This is one of the things they're working towards is creating the the the details in the basis for a hazard mitigation'",
        "'speaker_2': 'plan. This is required by the Federal Office of Homeland Security. And, you know, the work that we did for this six months that was spearheaded by Chief Tade was to help us look at how do we now address some of these life safety issues.'",
        "'speaker_2': 'And I'm wanting to ask a second question, and that is, did this issue even come up as part of this particular application looking at proximity to rail? And and was there even a discussion about that?'",
        "'speaker_8': 'This rezoning application did go through the standard course of notification. So adjoining property owners as well as all the required agencies were referred. There was not any specific comments received throughout the application and in relation to the proximity of the rail corridor.'",
        "'speaker_2': 'And what that says to me is we we have had a request in to Evelyn Baker for almost two weeks now asking if the check off box form has been changed or the form that now has the check off box so that this issue can begin to be looked at.'",
        "'speaker_2': 'And I've not had a response yet, but so that's why I'm asking these questions, because there were some very thoughtful recommendations that came out of the plan, out of the plan, out of the study session that had a report that that spoke to some of these issues.'",
        "'speaker_2': 'And so to learn that, number one, it's not clear that everybody's been trained, which was what I was told where we were at. And number two, that we're not even having that conversation is is really kind of concerning because it says to me as a city, we're not serious about addressing life safety issues as it pertains to'",
        "'speaker_2': 'development. This isn't to say, no, you can't do a development. That is not what our effort was all about. It was to look at how do we address human life and property and safety access. Egress, you know, to the tracks was a whole separate part of our conversation.'",
        "'speaker_2': 'But I'm raising this because I think it's important for my colleagues to know what came out of that effort and to learn that I'm not sure we're even utilizing any of that work that we spent six months doing.'",
        "'speaker_2': 'So thank you for answering my questions.'",
        "'speaker_8': 'And I'll follow up with our agency. I will just note that this application was submitted in July of last year, so I don't know when those changes took effect, but it's important to maybe note when that application came in, it will also know.'",
        "'speaker_2': 'It was within that timeframe.'",
        "'speaker_8': 'That the applicant has arrived, if any questions would like to be directed to them.'",
        "'speaker_2': 'If you don't mind. Mr.. President.'",
        "'speaker_1': 'Yeah, go ahead.'",
        "'speaker_2': 'Just ask the applicant if this topic of proximity to rail ever came up as part of this development.'",
        "'speaker_7': 'Yeah. So my name is Cale Zeppelin from Zeppelin Development. I reside at the same site which is 34, 57 rings record. The site is 28 acres and it follows the tracks, as you pointed out. And absolutely, it's constantly coming up.'",
        "'speaker_7': 'The what created this possibility was really the expansion of the North Line. So there's actually a 60 foot buffer, which includes the commuter line, which is electrified between the tracks and and the building parcel. So that effectively serves as a buffer.'",
        "'speaker_7': 'And the specific project that we're talking about building on that site includes tax credit financing. So there's actually a higher level of scrutiny. It's a deed restricted, affordable called Logitech program that looks at the tracks. And we've been able to kind of address the issues that came up so that that is a consideration for HUD and a'",
        "'speaker_7': 'requirement. And and we've been able to kind of get through that. It doesn't directly relate to the zoning or it has been an issue with the zoning. But to go forward with this specific project, we have had to address the proximity to the tracks and confirm that it's safe.'",
        "'speaker_2': 'Thank you. I appreciate that detail and the fact that that was, in fact, part of the conversation. Thank you, Miss.'",
        "'speaker_1': 'Thank you, Councilwoman. All right. Any other questions for this public hearing for council? Bill 1193 is now closed. Any comments by members of council? All right. I see none. And it has been moved and seconded. Madam Secretary Rocha.'",
        "'speaker_4': 'Sorry. One moment. Black Eye Clark by Espinosa I. Flynn. I. Gilmore, i. Herndon. I. Cashman. Kennedy. Lopez. I knew. Ortega. Sussman. Mr. President, I.'",
        "'speaker_1': 'Close voting as a result.'",
        "'speaker_4': 'We just need a few more to vote.'",
        "'speaker_1': 'We got some folks hanging fire here. Oh, shoot.'",
        "'speaker_4': 'All right. Right.'",
        "'speaker_1': 'Someone accidentally voted nay.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4211 Inca Street. Rezones property located at 4211 Inca Street from I-A, UO-2 to C-RX-8 (from industrial to residential mixed-use) in Council District 1. The Committee approved filing this bill at its meeting on 12-6-16.": [
        "'speaker_4': 'On 13.'",
        "'speaker_1': 'Eyes. All right. 13 Eyes Council. But 1193 has passed. Congratulations. Okay. Councilman Ortega, will you please put Council Bill 1189 on the floor?'",
        "'speaker_2': 'Mr. President, I move the council bill 1190. 93 right now. You said 99.'",
        "'speaker_1': 'Next page.'",
        "'speaker_2': '1199. Sorry, I was just looking at the agenda. Celtic 1199 be placed on final consideration. Do pass.'",
        "'speaker_1': 'Right. It has been moved. And second at the hearing for council 1199 is open. May we have the staff report? Courtland Heiser, Community Planning and Development.'",
        "'speaker_9': 'All right. Thank you very much. Here to present the proposed rezoning for 4211 Encke Street, Cortland, Hisar and CPD. So moving on to slide two shows the location within City Council District one. Slide three shows the location within the Sunnyside neighborhood.'",
        "'speaker_9': 'And Slide four shows the specific location of this proposal, said 4211 North Anchor. This is the northwest corner of Anchor Street and 42nd Avenue. This is within the 41st and Fox station area, and specifically one block north of the new pedestrian bridge that was constructed at 41st to connect Sunnyside to the station platform across the tracks and'",
        "'speaker_9': 'in the Globeville neighborhood. Slide five shows the specific request which affects this property, which is approximately a half acre in size, little smaller than a half acre. The current use as a concrete and construction company. There is no billboard on the site, although the billboard use overlay is currently mapped on the site.'",
        "'speaker_9': 'The applicant is requesting rezoning to allow for transit oriented development on the site, and the specific request is to go from the Light Industrial Zone District with the billboard use overlay to the S.R. eight district with no overlay.'",
        "'speaker_9': 'S.R. eight is the urban center residential mixed use eight stories maximum. The Sierra eight district emphasizes residential uses. Commercial uses are secondary to the residential uses within this district, and so properties are allowed to have street level retail office and commercial uses.'",
        "'speaker_9': 'But the upper stories are limited to residential and lodging uses only. The zone map is shown here on slide seven. The site and surrounding properties have the I.A. you oh two zoning. The exception to this is to the east where the freight rail tracks have the general industrial zone district.'",
        "'speaker_9': 'I'd be. And Slide eight shows land use for the site in the surrounding area. The property and properties around it are an industrial use. TCU to the East stands for transportation, communication and utilities. In this case, it's the rail infrastructure.'",
        "'speaker_9': 'And Slide nine has some images to go along with the map. So starting with the subject property in the upper left hand corner of the slide with the red arrow pointed to it, that shows the current use the concrete and construction company.'",
        "'speaker_9': 'And then moving clockwise around the slide slide to the upper right shows the property to the north, which shows up on a records as being a vacant property, but in fact has an industrial style storage building located on it.'",
        "'speaker_9': 'Then to the east, the image below that middle right shows the new improvements that have been made to Inca Street, the multi-use path that was recently installed, and then the freight rail infrastructure to the east beyond that lower right hand corner shows the property to the south across 42nd Avenue, which is another industrial property, and then to'",
        "'speaker_9': 'the west, across the alley in the lower left corner of the slide. Another industrial use. Moving on to process here in Slide ten. So informational notice was provided when the application was received back in June and then in August to announce the receipt of a revised application.'",
        "'speaker_9': 'The revised application removed the UO to overlay from the rezoning request. Planning Board was originally scheduled to hear this case back in September, but that hearing was postponed at the applicant's request to allow for additional outreach to the neighborhood and surrounding property owners.'",
        "'speaker_9': 'It was rescheduled for October, but there was a posting error that required the hearing to instead be delayed again until November. So when Planning Board did hear the case, they recommended approval by a vote of 7 to 0.'",
        "'speaker_9': 'It was at Luti back in December 6th and then is at City Council tonight. We followed our standard notification procedures throughout all those steps. In terms of public outreach, there are many registered neighborhood organizations within a couple hundred feet of this property.'",
        "'speaker_9': 'Those are listed here at the top of the slide and each was notified throughout the process. We did receive a good deal of public comments on this particular proposal, including a letter of support from the Sunnyside registered neighborhood organization.'",
        "'speaker_9': 'They provided a letter initially at the planning board phase of the process, which was included in the staff report as an attachment. And they have since updated that letter, continuing their support, but indicating that they've reached a private agreement with the developer for moving forward.'",
        "'speaker_9': 'And that was emailed to you directly to the city council inbox just yesterday. In addition to that, and also included as attachments to the staff report, we have five or excuse me, 15 signed statements of support, mostly from surrounding property owners.'",
        "'speaker_9': 'Slide 12 outlines the five review criteria for rezoning. All of which apply in this circumstance. And so, starting with Slide 13, will begin with consistency with adopted plans, beginning with comprehensive plan 2000. Slide 14 shows of the points of consistency of the proposal with guidance from comp plan 2000.'",
        "'speaker_9': 'Details on each of these can be found in the staff report. Slide 15 shows consistency with Blueprint. Denver So the proposal is located within a Blueprint Denver area of change. The blueprint land use is urban residential, which is defined as higher density, predominantly residential, including a noteworthy number of commercial uses and with retail or active uses on'",
        "'speaker_9': 'the ground floor. So the requested district aligns very well with the guidance from Blueprint. In that respect, street classifications for adjacent streets are UN designated local for both INKA and 42nd Avenue. Moving on to Slide 16, this shows the recommended guidance from the Sunnyside Neighborhood Plan, which was adopted back in 1992.'",
        "'speaker_9': 'That plan does predate Blueprint Denver and the conception of the fast tracks system, and therefore some of the land use guidance within the plan is now out of date and we have more recent plans that would apply in this area.'",
        "'speaker_9': 'So for current guidance, in this particular location within Sunnyside, we need to look to the station area plan, which is summarized here on Slide 17. The station area plan does not recommend any industrial within the portion of Sunnyside that it covers along the eastern edge of the neighborhood.'",
        "'speaker_9': 'It recommends urban residential 2 to 8 stories for the majority of the edge along Inka Street, running along the commuter rail corridor. There is an error in this particular plan for this specific location. You can see the red box showing the location of the proposed rezoning and the land use map states.'",
        "'speaker_9': 'Substation. The substation is actually located a block to the north, so this property is not located co-located with the substation. It is an area in the plan. And so therefore we must infer the land use and building height recommendation from the plan because the land use recommendation is consistent along the entire edge of Inco within this area'",
        "'speaker_9': 'and there isn't any variability in the recommendation. It's urban residential to date stories. For every block along that edge, the staff feels comfortable asserting that the intended land use recommendation was urban residential 2 to 8 stories. So wrapping up here on Slide 18, then showing points of consistency with the other four required criteria, starting with uniformity of'",
        "'speaker_9': 'district regulations. The finding in the staff report is that the proposal is consistent. Number three, it advances the public health, safety and welfare by implementing adopted plans. The justifying circumstances a change or change in condition. In this case, the pending opening of the 41st and Fox station, new pedestrian and bike infrastructure along Inca Street.'",
        "'speaker_9': 'Ongoing revitalization of the neighborhood. And increased development activity and interest in the station area. And then finally, point five regarding consistency with neighborhood context, zone, district purpose and intent, the finding was that it is also consistent. So Slide 19, the CPD recommendation is approval based on finding that all of the criteria have been met.'",
        "'speaker_1': 'All right. Thank you for the presentation. We have five speakers. I apologize in advance if I mispronounce any of your names. Well, actually, we have four speakers. Why don't you guys make your way down once I call your name on this front bench?'",
        "'speaker_1': 'Billy Wang. Mark Stroh. Niles Emerick. Xin Wang. First up will be Billy winning. You'll have 3 minutes, sir.'",
        "'speaker_7': 'Good evening, councilmembers. My name is Billy Wang. I am a Denver resident here and have been for. About 20 years now I am the applicant to the entity that submitted this rezoning at 4211 Anchor Street, and I'm available for any questions that you may have.'",
        "'speaker_1': 'All right. Thank you, Mr. Wing. Mark Stroke.'",
        "'speaker_7': 'Good evening. Thank you. Mark Stroh. I'm a resident of the city.'",
        "'speaker_0': 'And county of Denver in Sunnyside and.'",
        "'speaker_7': 'Represent the registered neighborhood organizations. And you say the United Neighbors, and I'm available for questions.'",
        "'speaker_1': 'All right. Thank you, Mr. Stroh. Niles Emerick.'",
        "'speaker_7': 'Niles Emmerich, resident of City and County of Denver, board member for Sunnyside United Neighbors. And I'm available for comment.'",
        "'speaker_1': 'All right. Thank you. And lastly, and Chin Hwang. Sorry if I'm wrong. Hi. My name's Ancient. I'm a resident of Denver, and I'm here for if I can answer any questions. Great. Okay. Congratulations, the four of you. That was the quickest comments I've ever heard.'",
        "'speaker_1': 'Wow. Okay. Questions by members of council. And I'll actually start them off real quick, Courtland, and just ask you. I've wondered this and I struggle with it a little bit around this forty-firsts and Fox area, the city of Denver, when reaching out and working on this, working on this area plan.'",
        "'speaker_1': 'Categorize it as C.R. X instead of C-Max instead of. I mean. Tell us a little bit more why it is so stringent on Citrix.'",
        "'speaker_9': 'So this shows the land use recommendations from that plan. On the slide, if you can you see it on your.'",
        "'speaker_1': 'It's coming to okay on our huge.'",
        "'speaker_9': 'So the when this plan was created the philosophy was to create a more intensive major urban center on the east side of the tracks, on the Globeville side of the station area. And you can see that in the purple and blue colors that are map there.'",
        "'speaker_9': 'The uses are pedestrian shopping, district, mixed use office and residential mix. And some of the building heights are 12 stories and more. They go as high as 20 story recommendation there. And then on the sunny side, half of the station area, the philosophy was to focus more on residential development.'",
        "'speaker_9': 'Just to paraphrase what's in the plan, I think that that was viewed as being more compatible with the residential Sunnyside neighborhood that exists. It needs to step down pretty quickly and intensity from Anchor Street over about a three block period to where you have existing single family homes and duplexes.'",
        "'speaker_9': 'And so I think that's why the residential mixed use was emphasized. More so than commercial mixed use.'",
        "'speaker_1': 'Mm hmm. Mm hmm. And so the C, our X, it still promotes ground floor activation and and things like this. So you can still do mixed use development. I've heard folks lately complaining about the C.R. X model not allowing as many uses as the senior MCs.'",
        "'speaker_1': 'Do you get it? I mean, is that true? Do you have anything to say about that?'",
        "'speaker_9': 'Well, the big difference between the two would be that in the CRCs, you're required to have residential uses if you have a building that's taller than one story. So your upper floors have to be residential, whereas in a cmcs district, they, they wouldn't be what you could do residential.'",
        "'speaker_9': 'You wouldn't be required to. Yeah. So this is, you know, the zone district that's supposed to promote higher density and mid density residential.'",
        "'speaker_1': 'Yeah. Okay. Councilman Ortega and then Councilman Espinosa.'",
        "'speaker_2': 'Yes. Courtland, if you could just stay there for a second, I want to ask some of the same questions I asked on the previous zoning, because this one also is adjacent to rail. So number one, have you been through the training with Evelyn Baker?'",
        "'speaker_9': 'No, I have not.'",
        "'speaker_2': 'Okay. So my second question is, did the issue of proximity to rail come up in your conversation with the neighborhood, with the developer? And if so, how was that addressed?'",
        "'speaker_9': 'It has been a topic of conversation. The focus of the conversations, though, have been the the transit, the commuter rail in this particular location. That's just one type of rail that's located there, the freight rail. There's a great deal of that just to the east of the site.'",
        "'speaker_9': 'And that was not discussed nearly as much as the the TOD opportunity associated with commuter rail.'",
        "'speaker_2': 'So I know this this is a little different than the developments that we've done on the east side of the tracks because those actually have the commuter rail as the buffer from the the the cargo. And so on this side, I'm I'm not sure that there is a buffer from the freight tracks or the the the cargo'",
        "'speaker_2': 'being carried on those freight trains. Is that something that you all looked at at the planning department? Did you have any feedback from the agencies? You know, we used to get all the agency input as part of the applications.'",
        "'speaker_2': 'But I guess in the rewrite of the zoning code, we don't see that level of detail anymore. So can you tell me whether there was any input from the fire department, environmental health around the proximity to rail and in any of the health safety concerns?'",
        "'speaker_9': 'So we do have agency feedback summarized in the in the staff report. I'm just looking for the specific page. That it's on. So that's summarized on the staff report beginning on page 11. You can see the agencies that commented and what they had to say.'",
        "'speaker_9': 'I don't recall any of the agencies calling out freight rail specifically in their comments. I'm just scanning through to see if that's the case.'",
        "'speaker_2': 'And I'm wondering if it's because we are not yet using the checkoff box on the application form that is supposed to be coming. I'm looking at the information that you. Directed us to. There are some environmental concerns about the Vasquez I-70 Superfund site and potential soils contamination.'",
        "'speaker_2': 'That would have to be addressed as part of their cleanup of the site. Assuming there's any of that on there, but I don't see anything in here related to rail. Okay. That's that's all my questions. Thank you.'",
        "'speaker_1': 'Yeah, thank you, counselor. Take it, Councilman Espinosa. Yeah, sort of. Actually, I wasn't going to talk about it, but since it's come up twice with both these rezonings, I want to say that I support the idea of a checkbox because I think it would sort of force us to at least ask the question.'",
        "'speaker_1': 'But again, I go back to sort of my frustration about traffic concerns, which I hear a lot about as the District one representative. And and a lot of times we can't do mitigation because it doesn't hit that threshold of of a problem.'",
        "'speaker_1': 'You know, we design those solutions to a certain percentile of counts. Councilman, I just this is the question section. Is that is there a question sort of answering, Councilman Ortega because it was my you know, I could have at some point raised my own concern relative to the real safety and the proximity of this project, but chose'",
        "'speaker_1': 'not to. And what it amounts to is that there's there that the well, there is a hazard and it is present. We have other mechanisms to address that. And then the sort of prevalence see of how much of the hours of the day does that?'",
        "'speaker_1': 'Is that issue present sort of has to factor in. We can design for that the sort of rarity of that event and compel a new development to address it when, you know. So I think I welcome the discussion and I do think the checkbox would sort of help in sort of promoting people looking into that.'",
        "'speaker_1': 'But I'm not sure that it would consequently change the sort of whole scale development options that are available in the future. So I do have two questions and I'm sorry. Thank you, Councilman Brooks. I appreciate that. The the.'",
        "'speaker_1': 'I wanted to say that because I don't think you mention it. There are agreements between the the R.A. that is present and represented and the owner. Is that correct?'",
        "'speaker_9': 'Yes, there is. And I mentioned it is just that it was emailed to you yesterday.'",
        "'speaker_1': 'Okay. So to the users, I think those agreements modify the uses to some degree. So Councilor, Councilman Mean President Brooks has concerns about the full gamut of uses that are available in our acts are sort of shaped by that in those agreements is that there's somebody from the R.A. or the owner want to say so?'",
        "'speaker_9': 'Or I would say that from the city perspective, the agreement can limit the users. It couldn't add users. They would be entitled to have whatever use is allowed under the zoning that's in place. But for specifics on the agreement itself, I'd refer you to the applicant in the neighborhood.'",
        "'speaker_1': 'Yeah. I mean, you don't need to go into detail if you don't want, but I do think that it actually truncates the total amount of users available. Is that correct?'",
        "'speaker_7': 'That is correct. Councilman Espinosa, we have gotten to a memo you right now which will adopt and record with the city once the the the actual closing occurs at the end of the month. And specifically, the use would add commercial space on that ground for to activate the the first level to engage more community orient oriented destination'",
        "'speaker_7': 'on the INC side. Now that doesn't preclude the fact that we may also look into the 42nd site as well. But for sure our agreement with the Sunnyside and even the East Sunnyside R.A. is to to activate that with a minimum requirement of 2000 square feet of commercial, retail or office space.'",
        "'speaker_1': 'So thank you, guys. I'm glad your questions are led to mind so that it's some of that stuff. Some of those does nuance mean those details could be shared?'",
        "'speaker_7': 'Thank you. And if I could add one more councilmembers, I think I was talking to my architect in addressing the life safety issue. Some of that is, I believe, encompassed in the building and the fire codes that we have to adapt to when we do the design phase itself.'",
        "'speaker_7': 'Mm hmm. Great.'",
        "'speaker_1': 'Okay. Any other questions from members of council? All right. Public hearing for Council Bill 1189 is now closed. This is the comment portion of our time, Councilman Espinosa. Go ahead. Yeah. So I'd like to thank the applicant for doing robust outreach when it appeared that none had been done.'",
        "'speaker_1': 'Initially, the applicant reached out further and wider than ordinarily expected, which was critical because there aren't a lot of directly impacted property owners. But recognized that the greater community would be impacted by these initial redevelopments at this rail station.'",
        "'speaker_1': 'The community itself has conducted a thoughtful dialog and authored a small area plan for East Sunnyside to get ahead of redevelopment of the redevelopment conversation. The community's work speaks to the nature of redevelopment of redevelopment projects that would marry the generalities of the adopted station area plan for the 41st and Fox station and focuses these recommendations to'",
        "'speaker_1': 'suit the vision and needs of the current and future Sunnyside neighborhood. The agreements between the applicant, owner and the R.A. accompanying this rezoning are welcome voluntary commitment by all involved and for the people of North Denver to comment mean to commit to address the concerns communicated to the owner and the applicant.'",
        "'speaker_1': 'I want to thank the applicant and future owner Billy Wang for negotiating in good faith. And I want to thank Marc and Niles for their volunteer efforts to assert to to to get these to reach these agreements, to communicate these agreements, and to advocate for the language that addresses these community concerns.'",
        "'speaker_1': 'So well done, all of you. Thank you very much. With that, I will be supporting this rezoning. All right. Thank you, Councilman Espinosa. And, you know, I just want to underline to both parties, thank you for coming to the table.'",
        "'speaker_1': 'You know, the the developer, the coming in, sitting down with the neighborhood. We're finding there's issues all over the city dealing with this that folks are not able to reach a compromise. But to those who are developing into the neighbors, it's our city.'",
        "'speaker_1': 'And so how do we begin to come together? So I really appreciate you reaching out, just echoing and Councilman Espinosa's comments. All right. It has been moved in, seconded. Um. No more comments by members of council's. Madam Secretary, Roll Call Flynn.'",
        "'speaker_4': 'Hi, Gilmore. Herndon Cashman. I can eat. Lopez. I knew Ortega. I Sussman. Black Clark. Mr. President.'"
    ]
}