{
    "A proclamation recognizing The Presidential Awards for Excellence in Mathematics and Science Teaching honor bestowed upon Elizabeth Grabois, a Denver Public School Science Teacher. \n A proclamation recognizing The Presidential Awards for Excellence in Mathematics and Science Teaching honor bestowed upon Elizabeth Grabois, a Denver Public School Science Teacher. \n": [
        "'speaker_3': 'No, Madam President.'",
        "'speaker_1': 'Do we have any communications?'",
        "'speaker_3': 'No, Madam President.'",
        "'speaker_1': 'We do have two proclamations this evening, and I have a distinct pleasure of reading the first one Proclamation number 179 in recognition of the Presidential Awards for Excellence in Mathematics and Science Teaching bestowed upon Elizabeth Vinson Grabara, a Denver public school science teacher.'",
        "'speaker_1': 'You'll hear more about that later. Whereas the Presidential Awards for Excellence in Mathematics and Science Teaching Award are the highest honors given by the United States government, specifically for K-12 mathematics and science, including computer science teaching. The awards were established by Congress in 1983 and annually.'",
        "'speaker_1': 'The Pay EMC Camps program authorizes the President to bestow this award on up to 108 individuals. And. WHEREAS, Awards are given to mathematics and science teachers from each of the 50 states and four U.S. jurisdictions, the award recognizes those teachers who develop and implement high quality instructional programs that enhance student learning.'",
        "'speaker_1': 'And. WHEREAS, the winners are selected by a panel of distinguished scientists, mathematicians, mathematicians and educators after a state level selection process is conducted. And. WHEREAS, on December 20th, 2013, President Obama named 102 mathematics and science teachers as recipients of the prestigious PMC t Award and Denver Public School teacher Elizabeth Vinson Grubb, WA from Carson Elementary was named'",
        "'speaker_1': 'as one of the 2013 winners of this very prestigious award. And. Whereas, the winners of this presidential honor will receive a $10,000 award from the National Science Foundation to be used at their discretion. The awardees are also invited to Washington, D.C., for an award ceremony and several days of celebratory events, including visiting with members of Congress and'",
        "'speaker_1': 'the administration. Now, therefore, be it proclaimed by the Council of the City and Council, City and County of Denver, Section one. The Denver City Council joins the U.S. government in honoring Miss Elizabeth Vincent Gregoire for her inspiration, leadership and high quality contributions she's given to her students and in her profession.'",
        "'speaker_1': 'And Section two that the clerk of the city and county of Denver shall a test and affix the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Ms.. Elizabeth Benson grab wa.'",
        "'speaker_1': 'And so I will move and hope that my fellow council members will join me in making a motion to adopt Proclamation number 179. And it looks like I have a second and now we will go with comments. I love it when I make proclamations.'",
        "'speaker_1': 'I can tell what we're going to do next. I know. Not yet. We're going. I, I just I am so excited because Carson school is about three blocks from home and of course is in District five. And it's the school where my daughter went to school for her grade school and has such fond memories for me.'",
        "'speaker_1': 'But to have this award be awarded to a school in Denver, which is so wonderful in District five, in my neighborhood, and I'm so proud that we have such a teacher in our midst and has inspired all these young learners at Carson.'",
        "'speaker_1': 'And you should have seen them today. The mayor did a proclamation at the school today. She got about three standing ovations from these absolutely darling children in the school that are so excited to have such a teacher on their on their faculty.'",
        "'speaker_1': 'And she continues to inspire them every day. And just especially in science and math. And she's a. Girl, which makes it even more special because of the message that that sends to boys and girls. But we're so very proud to have you here.'",
        "'speaker_1': 'And I would like to ask my fellow council people to please vote in favor of this and see no other comments. Mr. Secretary, roll call.'",
        "'speaker_3': 'On the president.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'Brooks. Hi, Brown. Hi. Hi, Herndon. Hi, Damon by Lopez. Hi, monteiro. I never. Hi, rob. I shepard.'",
        "'speaker_5': 'Hi.'",
        "'speaker_3': 'I'm just waiting on lehman.'",
        "'speaker_4': 'And no payments.'",
        "'speaker_3': 'Doesn't work.'",
        "'speaker_2': 'Okay, I'll do that.'",
        "'speaker_1': 'Okay. There you go. Okay. Ms.. Secretary, close the voting and announce the results.'",
        "'speaker_3': '11 eyes, earnings.'",
        "'speaker_1': '11 ICAO, nays. It is unanimous. The proclamation is adopted. And I would now like to call Ms.. Chrissie Faraci up to the podium because I think she's going to make a little introduction, and I think she has a couple of Carson students with her.'",
        "'speaker_1': 'Christie isn't the one that the proclamation is about, but she is our introducer.'",
        "'speaker_4': 'Hi. Members of Denver City Council and Honorable Denver City Council president something that says then I'm Chrissie Faraci and I live at 240 south for us in District five. I'm a proud parent of these two characters.'",
        "'speaker_1': 'Sophia Faraci and Nick Faraci.'",
        "'speaker_4': 'Nic had the pleasure of having Ms.. Vincent Gregoire for two years in second and in third grade. Now, most of you know me. You know my kids. You've probably heard the stories about the infamous NEC who's here in Kermit.'",
        "'speaker_4': 'You know, he was not held back. She was promoted to third grade, and he was lucky enough to have.'",
        "'speaker_1': 'Her for two years in a row.'",
        "'speaker_4': 'And I cannot tell you the difference it had made in my son's education and especially in math and science.'",
        "'speaker_1': 'It is by far and.'",
        "'speaker_4': 'Between his strongest subject. Sophia is lucky enough to now have Ms. grab LA as her assistant principal. So we are so thrilled. This is a huge honor for Denver Public School. It's a huge honor for Carson and even bigger honor and so well-deserved for Ms..'",
        "'speaker_4': 'Gregoire. And thank you so much for sponsoring this proclamation in her honor. And so with that, here's the honored guest.'",
        "'speaker_1': 'Thank you so much, city council President Sussman and the city of Denver for inviting me here today. This is a huge.'",
        "'speaker_5': 'Recognition for.'",
        "'speaker_1': 'Me, and I'm I'm completely honored to be here. I recognize that with this recognition comes a responsibility to continue to promote science and mathematics education in our city and our state. I just want to keep moving forward with STEM education and promoting opportunities for students to have meaningful hands on science experiences in their classroom.'",
        "'speaker_1': 'And as new standards come and new challenges, we just need to keep this in mind of how important this is for the nation, for the future of our nation. Science, technology, engineering and mathematics should always be on our minds when we're thinking of even elementary schoolchildren and giving them those opportunities to fall in love with science and'",
        "'speaker_1': 'mathematics. So I'm so honored to be here, and I just want to thank you again for recognizing me here this evening. Thank you very much. Thank you for making us so proud. We have another proclamation. I am very.'",
        "'speaker_1': 'I have to give my apologies. I need to vacate this particular seat. But I was so excited to be able to hear your wonderful presentation. And I am taking my hat even though I can't stay here. But thank you very much for the hat.'",
        "'speaker_1': 'And I'd like to turn the meeting of procedures over to the president pro tem councilman Herndon.'"
    ],
    "A proclamation congratulating the Denver St. Patricks Day Parade Committee on the Occasion of the 52nd Annual Parade on March 15, 2014": [
        "'speaker_3': 'All right. We are going to move forward to the council proclamation for to congratulating the Denver St Patrick's Day parade coming on the occasion of their 52nd annual parade and sponsored by Councilwoman Monteiro. Will you please read Proclamation 42?'",
        "'speaker_4': 'Thank you, Mr. President. Proclamation number 400 for two congratulating the Denver St Patrick's Day Parade Committee on the occasion of the 52nd Annual Parade on March 15th, 2014. And it reads. Whereas Denver has one of the largest St Patrick's Day parade in the United States and the largest parade west of the Mississippi.'",
        "'speaker_4': 'And. Whereas, this year the theme is Sweet Home Colorado, which pays tribute to the citizens by birth or the citizens by transplant. We all share one love for our great state that we call home. And. WHEREAS, the Denver St Patrick's Day parade exemplifies how diverse people can gather together with a glance at the past and a look'",
        "'speaker_4': 'to the future while enjoying the pipe and drum bands, Irish step dancing and honoring all divisions of our military to the delight of over 200,000 spectators. Whereas, congratulations and thanks to all volunteers of the Denver St Patrick's Day Parade Committee, including many who have passed on but are still remembered for their endless hours and never ending commitment'",
        "'speaker_4': ', which makes this celebration possible. And. Whereas, we hope the Colorado Sun and the Mile High Air lifts the spirits of all who march or watch the 52nd Annual Parade this Saturday, March 15th, 2014. And we hope for a warm wind at our backs as we celebrate.'",
        "'speaker_4': 'Now, therefore, he had proclaimed by the counsel of the city and county of Denver, Section one, that the Council hereby congratulates the Denver St Patrick's Day Parade, a volunteer organization on a well-organized, peaceful and spirited gathering at the 52nd annual event.'",
        "'speaker_4': 'Section two that the Clerk of the city and County of Denver shall attest and affixed the seal of the city and county of Denver to this proclamation, and that a copy be transmitted transmitted to Dan Lagrange, president of the Denver St Patrick's Day Committee.'",
        "'speaker_3': 'Thank you, Councilwoman Martel. Your motion to adopt.'",
        "'speaker_4': 'Thank you, Mr. President. I move that proclamation 40 to be adopted.'",
        "'speaker_3': 'It has been moved and second hand comments by members of Council Counsel Monteiro.'",
        "'speaker_4': 'Thank you, Mr. President. This is such an exciting part of the city's history. Every. Every year. So we have the holidays and then, you know, there's a little bit of a slump there. And then it's time for National Western.'",
        "'speaker_4': 'And then there's a little bit of a slump there. And now it's time for the Saint Patrick's Day parade. And the weather is so beautiful today, so it couldn't be more fitting. But I want to say that this committee is a charitable organization with all committed volunteers.'",
        "'speaker_4': 'Each member I've noticed has a deep love for the Irish culture and enjoys sharing that sense of pride with the entire Denver community. With year round effort culminating with the Parade Parade Day event in 1972, over 30,000 people watch the parade.'",
        "'speaker_4': 'The temperature was a balmy 71 degrees. This was the first time the parade claimed it was the second largest, second only to New York City Thursday prior to the parade. Mayor Hancock and myself would join the parade committee in renaming YRC Street, where it crosses 17th Street to Tooley Street in honor of Dale Tully, our former district'",
        "'speaker_4': 'attorney for Denver and a longtime supporter of the parade. The parade marshals have the task to stage thousands of people, all in order in just 3 hours. That's deal with horses. Bands lost kids and trees as large as 50 vehicles.'",
        "'speaker_4': 'Elected officials, VIP's and just about every kind of culture, military organization and dancing organization. Their day starts at 6 a.m. and does not stop until the staging lot is cleared. Planning takes nearly a year, and yet they do what they do with love.'",
        "'speaker_4': 'The 2014 grand marshal is John Chandler, who is awarded the 2000 2009 Spur Award for the best song from the Western Writers of America for his song, Linwood. He was also named 2009 Best Living Western Musician by True With Magazine.'",
        "'speaker_4': 'So, Mr. President, it's with my honor to sponsor this proclamation and ask for support from my colleagues as well.'",
        "'speaker_3': 'Thank you, Councilwoman Monteiro. Councilman Nevitt. Thank you, Mr. President. I don't know why Councilwoman Monteiro got that cool looking beret, and I'm wearing that, but that's okay.'",
        "'speaker_0': 'We're all Irish on St Patrick's Day. This event is always.'",
        "'speaker_4': 'Always in.'",
        "'speaker_0': '30 seconds. It'll be on Facebook.'",
        "'speaker_6': 'You know.'",
        "'speaker_0': 'This event is always is always fun.'",
        "'speaker_3': 'And the the committee does a fantastic job putting it, not just putting.'",
        "'speaker_6': 'It together, but also making it an occasion where everyone.'",
        "'speaker_0': 'Is brought together.'",
        "'speaker_6': 'Denver's a diverse city.'",
        "'speaker_3': 'And.'",
        "'speaker_0': 'All its diversity is.'",
        "'speaker_6': 'Represented at the St Patrick's Day parade, which is very cool.'",
        "'speaker_3': 'There's also a lot of.'",
        "'speaker_6': 'Remembered.'",
        "'speaker_0': 'At the St Patrick's Day parade.'",
        "'speaker_3': 'And, you know, someone like.'",
        "'speaker_6': 'Dave Dale truly gets remembered. But I would never.'",
        "'speaker_3': 'Want to forget one of the city and county's own Walt.'",
        "'speaker_6': 'Becker, who was a.'",
        "'speaker_3': 'So that's it. Mr. President, I just wanted to.'",
        "'speaker_0': 'Remember Uncle Walt.'",
        "'speaker_3': 'Thank you, Councilman. Do we have any other comments from members of council seen on Mr. Secretary? Roll call?'",
        "'speaker_4': 'Montero I.'",
        "'speaker_3': 'Never I. Trump I covered. I'm proud, i. But I. Lemon Lopez. All right. The president. Hi. Councilman Rob. So hanging fire. And that is it. Mr. Secretary, please call the voting and announce the results tonight. As Ernie and I, the resolution has been proclamation excuse me, has been adopted.'",
        "'speaker_3': 'Councilman Montero. I do not see anybody here. Is there anybody you want to call for, Father?'",
        "'speaker_4': 'Thank you, Mr. President. Accepting the proclamation will be Theresa miller. No. Did I say right? Miller, Rog? No. The public relations chair. And please feel free to bring up other members of the committee to accept this proclamation. And, Diane, you're welcome to.'",
        "'speaker_4': 'Come on. Thank you, Mr. President, and members of our council, and especially Councilwoman Monteiro. I'd like to introduce you to some amazing people. Our board of Directors for the Parade Committee, whose leadership has seriously inspired close to 300 people whose dedication is unwavering.'",
        "'speaker_4': 'To put the best parade on the streets of Denver for the citizens of Colorado, and I'd like to have all of our board members please stand. And now I'd like to introduce to you a woman who actually her mother in law was one of the original parade organizers in Denver.'",
        "'speaker_4': 'And how it happened was her husband, Buck Lagrange, invited her to a meeting long ago and she said, okay, I'll go, but don't ask me to do anything. And now she's the president of the largest parade west of the Mississippi, gathering people and accomplishing amazing things for our city.'",
        "'speaker_4': 'And her mother in law, no longer with us, but with us in spirit, would be so very proud of the work that you've done. Mrs. Diane Lagrange. Thank you very much. Mr. President, City Council members. We gratefully accept this proclamation and thank you for support of the Denver St Patrick's Day Parade Committee throughout our 52 year history'",
        "'speaker_4': '. There are over 300 volunteers who have invested thousands of hours yearlong to bring this event to the streets of Denver. We expect over 250,000 spectators coming together on parade day to celebrate the Irish culture. Our theme, Sweet Home Colorado pays tribute to all of us who call Colorado home.'",
        "'speaker_4': 'And I am a second generation Coloradoan. Thank you. Thank you. Thank you once again.'",
        "'speaker_3': 'So much. And thank you, Councilwoman Monteiro, for bringing that. We're looking forward to that at the end of the week. We are now ready for their resolutions. Mr. Secretary, will you please read the resolutions from Health, Safety, Education and Services?'"
    ],
    "Changes the zoning classification from B-4 with waivers and Use Overlays 1 and 2 (Former code, relatively high density mixed use and overlays allowing billboards and adult businesses) to C-MX-8 and C-MX-12 (Urban Center context, Mixed Use, 8 and 12 stories maximum) for property at 351 S. Jackson in Council District 10. (LAND USE, TRANSPORTATION & INFRASTRUCTURE) A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 1-28-14.": [
        "'speaker_3': 'It has been moved and seconded. The public hearing for Council Bill 34 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening. Chris Glasner Community Planning in Development. The first item in front of you today is Council Bill 34. This is a proposed rezoning at 351 South Jackson Street. The site is currently B4 with waivers and old Chapter 59 Zone District.'",
        "'speaker_6': 'The proposal is for a mix of CMCs eight and CMCs 12 or mixed use eight story and mixed use 12 story. We are in Council District ten in the Cherry Creek Statistical neighborhood. The location itself is the northwest corner of Jackson and Dakota.'",
        "'speaker_6': 'It's a standard rectilinear block. It's approximately 1.3 acres in size for the site. Currently, most folks know it as the Colorado Private Reserve Club, along with the Associated Parking for it. We do have a variety of building forms surrounding this site.'",
        "'speaker_6': 'The applicant is 351 South Jackson, LLC. They are rezoning to conform to the Cherry Creek Area Plan recommendations and again rezoning that before with waivers to the CMCs eight and CMC's 12 zone districts which are the urban center context mixed use zone districts eight and 12 stories respectively.'",
        "'speaker_6': 'The general character is an emerging mixed use neighborhood in what we call the Cherry Creek Triangle, including residences, offices, hotel and residential uses. We have a standard district block pattern. We are very close to Colorado Boulevard, which aids our mobility.'",
        "'speaker_6': 'Colorado has a surprising amount of transit access with sub 15 minute service along the route for pretty much the entire day. Our existing context we have Talavera just across the street is the picture. On the left is a residential building.'",
        "'speaker_6': 'We have Monroe Point, which is the top right picture, as well as quite a bit of open space along the Cherry Creek Trail, which is the bottom right picture there. The existing building on site is this one. Most folks will recognize that if you spent any time down in the triangle and as you can see, our land'",
        "'speaker_6': 'use is quite varied throughout the district, but it does point to a mix of existing land uses consistent with where we anticipate the future being. Planning Board did review this and the applicant has conducted public outreach. We'll walk through our criteria, starting with our adopted plans and comprehensive plan 2000.'",
        "'speaker_6': 'We do find that this is consistent with Comprehensive Plan 2000, addressing several strategies, including land use strategy. One See incorporating relevant recommendations from small area plans. In this case, the Cherry Creek Area Plan Land Use Chapter Strategy one H encouraging development of housing that meets our increasingly diverse needs.'",
        "'speaker_6': 'And then new strategy three Be encouraging quality infill development consistent with the character of the surrounding neighborhood blueprint. Denver identifies this as an area of change, which was confirmed in 2012 Cherry Creek Area Plan and as a regional center, anticipating a balance of retail employment and residential uses and accommodating a variety of uses across that that can'",
        "'speaker_6': 'be either mixed vertically or mixed horizontally, as we often talk about mixed use areas. Finally, the Cherry Creek Area plan looks to improve the pedestrian realm. So the recommendations from page 76 include this being part of our pedestrian priority zone.'",
        "'speaker_6': 'This is only the second pedestrian priority zone in Denver, with downtown being the first and looking to increase pedestrian mobility, making sure that that's a high priority in the neighborhood, we seek to encourage positive change. With Cherry Creek Triangle remaining an area of change, we anticipate further growth in the area looking for new development, including a mix'",
        "'speaker_6': 'of uses, as we already discussed in adopting form based and concern. Text based zoning for the Cherry Creek Triangle properties is what this proposal will do tonight. We will also be seeking to create an identity for the Cherry Creek Triangle if you've been there.'",
        "'speaker_6': 'Several years ago it was often seen as quite a few surface parking lots and some office buildings. Since the Cherry Creek Area plan passed, we've already seen quite a bit of development happening in the district and this will continue that evolution of Cherry Creek Triangle.'",
        "'speaker_6': 'This will result in a uniformity of district regulations across the site and redevelopment of the site will further the health, safety and public welfare of the surrounding neighborhood. We'll dove into our justifying circumstances and that this is a change of conditions and rezoning.'",
        "'speaker_6': 'This site will bring the property into alignment with the recommendations of the 2012 Cherry Creek Area Plan. And we do conclude that the existing conditions of the property are consistent with both the urban center neighborhood context and the CM zoned district.'",
        "'speaker_6': 'Purpose and Intent Planning Board did unanimously recommend approval of this rezoning application and CPD recommends approval as well. Thank you.'",
        "'speaker_3': 'Thank you, Mr. Glasner. We have four speakers this evening and I'm going to call all four of you up and ask you to come to the first pew. They are done and I apologize if I say anyone's name incorrectly.'",
        "'speaker_3': 'Don Ruggles, Ray Terrill, Thomas Petrie and Chairman say COO. And Mr. Ruggles, when you feel free to come on up and begin your remarks. I'm Don Ruggles. Thank you for having us.'",
        "'speaker_6': 'We're white. We haven't prepared in a final plans or even actually in initial plans were the beginning ideas for this was that we wanted to develop a project that is pedestrian friendly, high.'",
        "'speaker_3': 'Quality, and it's a sustainable project.'",
        "'speaker_6': 'There's a.'",
        "'speaker_3': 'Good structure currently on the.'",
        "'speaker_6': 'Property and we want to save that and utilize that as we carry forward. And actually the new architecture would work with the style and sense of the old architecture and try to incorporate sustainable ideas to be a pedestrian friendly project.'",
        "'speaker_6': 'And I think we're aiming.'",
        "'speaker_3': 'To develop something as high.'",
        "'speaker_6': 'Quality as we possibly can.'",
        "'speaker_3': 'Thank you. Thank you, Mr. Ruggles. Mr. Terra Caspi. Okay. In that case, Mr. Retreat Petrie.'",
        "'speaker_6': 'Thank you. My name is Tom Petrie, and I'm one of the three owners of the property. We acquired it at the beginning of the last financial meltdown right after the Lehman event, and felt that the existing structure was was very solid.'",
        "'speaker_6': 'And we've been looking for the right, right opportunity to see how the the overall property could be brought into line with the neighborhood. There's a lot of senior living there, senior apartments. And we envision something that could very well be consistent with that, but also have the amenity of this clubhouse structure that's there, which would be good'",
        "'speaker_6': 'for the whole neighborhood.'",
        "'speaker_3': 'Thank you, Mr. Petrie. Mr. Sekou.'",
        "'speaker_8': 'Yes. Say. Blacks are actually a movement advocate for poor, working, poor and homeless people. We support this project for a couple of reasons. One, the building is outstanding in the history of the area, is outstanding in terms of neighborhood and friendliness.'",
        "'speaker_8': 'And we have a crisis for the city, for existing families who have experienced foreclosures and are being displaced and need a place to come back up. And this would be a great opportunity for them to be an environment that's nurturing and also a place where they could bring families and there would be safety issues.'",
        "'speaker_8': 'And so that can happen. Now, one of the things I heard tonight was that with the money being transferred in from this disaster fund to build a new recreation center. I suggest since but since we're not going to go according to any accounting measures and look at the numbers, we considered that housing for displaced family and poor'",
        "'speaker_8': 'people is emergency. It appears right into the funding that you got $108 million. Why not put some of this money in partnering with these people so they can make this happen for us? We have to put some kind of urgency on the real emergencies in the city, and the need for these families ranks up there with the'",
        "'speaker_8': 'need for recreation center. I mean, come on. I mean, let's be for real with it. But the concern for the people is that we're not considered when these things are being done. So I want to put the kind of thought process among these gentlemen here who look like, all right, folks, you and me, by noting the possibility'",
        "'speaker_8': 'that that could happen. And with that, with the money being available, with funds everywhere, we got plenty of money in different plans everywhere. We can figure out how to match the bridge to get this done. Like Charlie Brown would say right now, get it over and get it done.'",
        "'speaker_8': 'Like in the name of it, we can rename the house. In the name of Joe Shoemaker is what Joe would do. All right. Thank you very much.'",
        "'speaker_3': 'Thank you, Mr. Sekou. That concludes our speakers for this public hearing. Do we have any questions from members of council? Catamaran?'",
        "'speaker_7': 'Yes. My question is for Mr. Pietri or Mr. Ruggles.'",
        "'speaker_3': 'Microphone and microphone on Catamaran.'",
        "'speaker_7': 'I'm wondering, from what I heard tonight, if you have a firm timeline yet. I mean, it sounds like some of the specifics you're still working out. But I wanted to know if you have a timeline.'",
        "'speaker_6': 'We do not at this point do we think the timing is right in terms of where the economy is and other things that are happening in the area. So I expect this to move ahead following the decision, assuming the decision is favorable.'",
        "'speaker_7': 'And then just some other follow up questions. Are you still looking at the idea of residences for older adults a year?'",
        "'speaker_6': 'Senior living is is definitely what we're thinking about.'",
        "'speaker_7': 'And do you have a potential unit number.'",
        "'speaker_6': 'To about 200?'",
        "'speaker_7': 'Okay, great. Thanks. Those are just the sort of details they wanted on the record. Mr. President, I have one other question. If I could ask Chris Meissner to come to the microphone. Chris, your presentation showed the open space along the Cherry Creek corridor there, and you also talked about Cherry Creek being a pedestrian priority plan.'",
        "'speaker_7': 'If you have a slide that will help us see it, that would be great. Otherwise, could you just describe how pedestrians are going to get across Cherry Creek.'",
        "'speaker_4': 'Drive.'",
        "'speaker_7': 'To the creek, and what the plan is there?'",
        "'speaker_6': 'It's a great question. I don't know if folks have tried to cross that stretch of Cherry Creek North Drive. Sometimes it's nice and quiet and you can saunter across. Sometimes there's cars that are kind of in a hurry and you have to hustle a little bit.'",
        "'speaker_6': 'What we know is that with our re-envisioning of Alameda, this stretch of Alameda, believe it or not, is a designated as a parkway. With this stretch of Alameda, we do anticipate improvements to the western terminus of that parkway.'",
        "'speaker_6': 'So that helps facilitate crossings. We know that the crossing down at Virginia, while not necessarily local to this project, we know that the timing of that signal is fairly generous. So that helps facilitate that crossing. The missing link is really Dakota and how we get across Cherry Creek North Drive at Dakota with some of the investments that'",
        "'speaker_6': 'are going in at 367, South Monroe, 3360 South Monroe coupled with Monroe and Alameda redevelopment coupled with this development. We've started discussions with public works to look at what types of enhanced crossings we may be able to put in place.'",
        "'speaker_6': 'At that point, I don't have a firm commitment, but that is on everyone's okay.'",
        "'speaker_7': 'I am glad those conversations have begun because that's an important point for me to make in this hearing. And the plan contemplates a bridge possibly over the creek at Garfield as well, does it not?'",
        "'speaker_6': 'Some sort of pedestrian kind of connection? Yes.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman Robb, do we have any other questions from members of council? Seen on the public hearing for council bill 34 is close comments by members of Council Councilwoman Rob.'",
        "'speaker_7': 'Thank you, Mr. President. I can just continue from my questions right into my comments. Exciting times in Cherry Creek. You can see there is no opposition to this project. I do know that it's been vetted primarily with the Cherry Creek East neighborhood because this triangle that some of you will think of as the neighbor to Glendale, right'",
        "'speaker_7': 'across Colorado Boulevard from Glendale, really great connections to Glendale along the creek. Has it really developed its own neighborhood group yet? It's young enough where the transition from parking lots to residences is just begun. But the thing that I you'll probably hear me say in every Cherry Creek rezoning is we are looking at tremendous growth.'",
        "'speaker_7': 'This project with 200 units puts us well over 1300 units on either in the ground or on the drawing board for Cherry Creek. That's a lot of new residences. And we talk about land use and transportation going together a lot, but we're not seeing a lot of investment in Cherry Creek in transportation infrastructure, like a pedestrian bridge'",
        "'speaker_7': 'that we've been doing in other parts of the city. And and we've been looking at the Steele Street intersection, but particular to this project, I think getting all the residents that will eventually be in the Triangle connected south and across Colorado Boulevard is going to be an important thing so that we're not always hopping in our cars'",
        "'speaker_7': '. I will be supporting this. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Robb. Councilwoman Fox.'",
        "'speaker_4': 'Thank you, Mr. President. I just wanted to make a comment because a couple times tonight we've had reference to this large amount of reserves that we have and I want for especially for the people at home, to understand the nature of them, because they are not sitting around waiting for good ideas to come up for us to'",
        "'speaker_4': 'spend them. The large majority of it's in fund balance. The city policy is that we will have 15% in fund balance, which we don't have yet. And that, of course, is well over $100 million would even be the 10%.'",
        "'speaker_4': 'If you go below 10%, the bond houses will go bananas. You really need to keep that amount in there to protect our bond ratings. The other 2% that makes up that large amount is the contingency reserve, and that's for the spending that runs over in various agencies, whether it is overtime, that was unexpected for some kind of'",
        "'speaker_4': 'incident that comes up. Police overtime quite often takes advantage of it or we have had large snowstorms where we've had unexpected amounts of money needed to clean up the snowstorm of deposits. And so it's that type of use that people are now calling reserves, not exactly like my savings account, that I could go out and blow on'",
        "'speaker_4': 'a new dress. So I just wanted to make it clear.'",
        "'speaker_3': 'Thank you, Councilwoman. But do we have any other comments from members of council seen on Mr. Secretary? Roll call from my boss I Laman. Hi, Lopez. Hi, Monteiro. I never i. Rob I. Shepherd I. Mr. President. Hi, Councilman Lopez.'",
        "'speaker_3': 'Voters and fire. There we go. Mr. Secretary, please close the voting and announce the results. 9809990 nays council bill 34 has passed. Now we are moving on to Council Bill 35 before an ordinance change the zoning classification for 1465 South Colorado Boulevard.'",
        "'speaker_3': 'Councilwoman Sheppard, will you please put Council Bill 35 on the floor for final passage?'",
        "'speaker_5': 'Thank you, Mr. President. I move that Council Bill 35 series of 2014 he placed on final consideration in due passed.'",
        "'speaker_3': 'It has been. Just 1/2. We're going to pass on one technology to catch up with us. It has been moved. I need a second.'",
        "'speaker_4': 'Second.'"
    ],
    "Changes the zoning classification from B-A-3 (Former code, large-lot commercial) to C-MX-3 and C-MX-12  (Urban Center context, Mixed Use, 3 and 12 stories maximum) for property at 1465 S. Colorado Boulevard in Council District 6. (LAND USE, TRANSPORTATION & INFRASTRUCTURE) Changes the zoning classification from B-A-3 (Former code, large-lot commercial) to C-MX-3 and C-MX-12  (Urban Center context, Mixed Use, 3 and 12 stories maximum) for property at 1465 S. Colorado Boulevard in Council District 6. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 1-28-14.": [
        "'speaker_3': 'Moved in second in the public hearing for council Bill 35 is now open. May we have the staff report?'",
        "'speaker_6': 'Good evening. Chris Glasner Community Planning and Development Constable, 35, is a proposed rezoning at 1465 South Colorado Boulevard. This is from B.A. three, another former Chapter 59 Zone District two, CMCs three and CMCs 12, or a mixed use three story and a mixed use 12 story zone district.'",
        "'speaker_6': 'This is within Council District six in the Cary Mayoral statistical neighborhood. This is located on the west side of Colorado Boulevard at Arkansas. The site itself is about three and a quarter acres. It's currently B.A. three, as I mentioned.'",
        "'speaker_6': 'The reason it's still a three is it's it's part of a planned building group of PGE. And that was one of the subsets of properties that we did not rezone with the citywide rezoning. So this is an applicant driven proposal to bring this into conformance with the current Denver zoning code.'",
        "'speaker_6': 'The site itself, when folks think about it, it's they either remember the courtyard by Marriott Hotel that's there or they remember the Shamrock Gas Station that's at Colorado Boulevard. That's the general location. We're talking about the gas stations and actually not part of this rezoning.'",
        "'speaker_6': 'You'll notice when you look at the map that's contained within your packet, there seems to be a little chunk left out along Colorado Boulevard. That is the existing Shamrock Station. That's not part of it. The applicant is represented by Bob Golic, who's here for comments and questions.'",
        "'speaker_6': 'The rezoning, as I mentioned, is to come into the Denver zoning code and again will be rezoning from V3 to a mix of CSX three along Colorado Boulevard and see a mix 12 deeper in the site where that 12 story hotel exists today.'",
        "'speaker_6': 'The general character of the area is a mixed use corridor. Recent development pattern is trending more toward an urban center. Mixed Use Development Pattern. This was kind of an interesting piece during the review of this rezoning application because you'll notice a lot of the ground around the area is the suburban context, and this proposal is actually an'",
        "'speaker_6': 'urban center context. The street block and access pattern, all of our access is along Colorado Boulevard at the Arkansas Avenue alignments. And again, our mobility along Colorado is quite good. It's ten minute peak service with 15 minute off peak service.'",
        "'speaker_6': 'So we do have quite good access to this site. The existing context I talked about is really shown well in this slide. It's kind of amazing. If you think of the older development along Colorado, it is a little bit more of that set back parking lot in front of it where we've seen newer development patterns that are'",
        "'speaker_6': 'really coming up, addressing the street, creating a wide tree lawn, wide sidewalks and walkability. Granted, we have to grow into that, but we do see that is the pattern for all the recent development we've seen along the corridor, which is why we do find that urban center context to be appropriate, even though it is a pretty big'",
        "'speaker_6': 'jump from the suburban context that exists on parts of this area. The existing context, as you'll note, is a mixed use district up and down Colorado. That's not a surprise to anyone. It exists in a variety of scales from small individual tenant shops to larger multi-tenant kinds of pieces.'",
        "'speaker_6': 'Planning for did review this. The applicant has conducted their public outreach. You do have a letter of support in your packet from the adjacent registered neighborhood organization who walk through consistency with our adopted plan, starting with conference plan 2000.'",
        "'speaker_6': 'Specifically land use strategy to A is to initiate comprehensive review and detailed revision of the Denver zoning ordinance. We don't often get to pull this one out in our staff reports, but it's kind of interesting because this does directly speak to the new Denver zoning code that we have, as well as land use strategy for a encouraging'",
        "'speaker_6': ', mixed use transit oriented development, making effective use of existing transportation infrastructure. That's why it's so important that we do have that high frequency bus service along Colorado. The land use concept for this is an area of change and a commercial corridor.'",
        "'speaker_6': 'This does intend to orient development to the heavily used arterial streets, in this case Colorado. It does share similarities with the pedestrian shopping corridors, which was how we know that it is supposed to develop in a pedestrian friendly manner.'",
        "'speaker_6': 'And looking at street trees, wide sidewalks, pedestrian activities is really some of the goals that are set out for that commercial corridor. The proposed rezoning is consistent with the Boulevard plan. This is a jointly developed plan with Glendale and the city of Denver, recommending office and retail uses on the site, identifying the benefits of promoting a mix'",
        "'speaker_6': 'of uses along the corridor, especially as it relates to traffic patterns and continuing a pattern of compatible redevelopment, which we do think this will do of uniformity of district regulations rezoning this site will result in uniform regulations across the site and redevelopment of the site will further the health, safety and welfare of the surrounding neighborhood justifying circumstance'",
        "'speaker_6': '. Is this a change of conditions changes including the creation of that form base Denver zoning code and the pattern of reinvestment along Colorado Boulevard necessitate this rezoning. And finally, we do conclude that the existing conditions in the properties are consistent with both the urban center neighborhood context and the Cmax Zone District purposes and intense planning board did'",
        "'speaker_6': 'unanimously recommend approval and CPD also recommends approval.'",
        "'speaker_3': 'Thank you. Mr.. I. We have two speakers this evening for this film, Mr. Garlic and Mr. Sekou. So Mr. Garlic feel free to take the podium.'",
        "'speaker_6': 'Mr. President, pro tem members of Council. Good evening. My name is Bob Garlock and I'm here this evening representing the owners of the property in Council Bill 3530 2014. Sometimes I look at this rezoning and I kind of think it's almost akin to taking out one of the giant redwoods up in the northwest.'",
        "'speaker_6': 'The site plan goes back 44 years on this site. The hotel's been there for over 53 years and the zoning on the site goes back to 1953. It's one of the original zoning in all of Denver. So I think it's probably right up there with some of the sequoias and some of the redwoods with some of those'",
        "'speaker_6': 'old zoned districts did. And this one in particular to be a three. Controlled density through a zone lot coverage. In this case, we can't have more than 30% of his own lot covered with the structure. So we've done that or they did that back in the fifties.'",
        "'speaker_6': 'But that leaves nothing but an enormous sea of parking with nothing else you can do on there. We have over 400 feet from the edge of our building to the curb on Colorado Boulevard, more than a football field.'",
        "'speaker_6': 'And in this development plan, we have 1260 parking spaces. We need about 520. So taking this out of the bay, three will leave the hotel just the way it is. That's why I see him. X 12 The Courtyard Marriott is a c a mixed 12 structure and it'll allow us to do some small commercial uses in front'",
        "'speaker_6': 'of the hotel facing Colorado Boulevard, where some of this vast parking is. And that's why it's a mixed three along that frontage. So if you recall the project that's on Colorado Boulevard, right where Cherry Creek Drive meets Colorado, there's a Hilton Garden in there and there's a couple of restaurants.'",
        "'speaker_6': 'There's a real a garbanzo that's the same property owner and the same concept that we'll be doing on this site. So Planning Board recommended unanimously approval. The Corey Merrill neighborhood sent a letter of support. CPD recommends approval. I hope you'll do the same.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_3': 'Thank you. Mr. Garlic. Mr. Sekou.'",
        "'speaker_8': 'Yes. Chairman Sacred Black Action Movement Advocate for working for home people. We are enthusiastically support the journey. The only change for this particular project for a couple of reasons. One, the space is underutilized represents an opportunity to be utilized as a place where construction can happen for residential assistance for transitional families who have suffered under a downturn'",
        "'speaker_8': 'for the economy. Now, these are regular, everyday people who have become poor because of economic conditions. And so one of the things we want to do is to resettle them in the area where they already at. So when they do come up, there's some kind of continuity with the education for the kids, the very people and their'",
        "'speaker_8': 'friends and that kind of thing. And one thing that we're confronted with in the city is that we got poor displaced people all over the city. They're not just on the east side and they're not just downtown. They're not just in the five points over there, all over the city.'",
        "'speaker_8': 'And they represent a diverse population of all kinds of folks. So now we've got to put some consideration. As a matter of fact, we put we should put most consideration to these families that when they are under stress and they are sent to these places temporarily transition, they split up the families and then social services come in'",
        "'speaker_8': ', they split up the kids, and now there's kids in foster homes and it's all crazy. So crazy. So crazy, man. And it don't have to be this way. See, I know we can do better than this. We got to do better than this.'",
        "'speaker_8': 'Otherwise, who are we? Who are we? Who are we? And what kind of city are we? Because the city's greatness is in the greatness of the people. And it comes from the inside out, not from the outside in.'",
        "'speaker_8': 'So who are we? We choose to be because in these kind of things, yeah, we have to be creative in finance. Yet the account has got to make sense. You know, and I'm glad you brought up those issues about the money.'",
        "'speaker_8': 'So we real clear that it ain't like that. It's not like that. And thank you very much for bringing that to because I'll hope somebody else is going to say that, you know. But the money is there. But we have to reorganize the priorities, man.'",
        "'speaker_8': 'We got we got we got to really lift up the bottom of this boat that's got a big hole in it. So you build the boat from the bottom up, not from the top down. And I'm not concerned about who's going to be the captain, because that's going to come from the shipbuilders.'",
        "'speaker_8': 'If we're going to put the shipbuilders to the boat to say, who's going to be the captain so we can get a break now with the captain thing, we got to get busy with construction and construction to build a boat whose hold a double hold so that no matter what happens with emergencies, weather, whatever.'",
        "'speaker_8': 'We're there and we can weather the storm. Kind of like a Noah's Ark. Say two by two. We come in two by two. So we're taking this thing two by two, because I can't see how if you can't do the little things, the ones he chooses when we're playing Jackson's kids, how you gonna do the sweep on'",
        "'speaker_8': 'all ten and be Mr. Psycho Jacks? So let's not drop no more Jacks. Let's get in the game for the people. And thank you very much for your consideration.'",
        "'speaker_3': 'Thank you, Mr. Speaker. That concludes our speakers. Do we have any questions from members of council? Seen none. The public name for Constable 35 is closed. Comments by members of Council. Council Member.'",
        "'speaker_6': 'Thank you, Mr. President. I support the rezoning.'",
        "'speaker_3': 'And by the way, this is South Colorado.'",
        "'speaker_6': 'Boulevard and I think we can all agree is a very strange sight, especially to see all the asphalt with no cars park. It's it needs help. And I think this will be an asset to South Colorado Boulevard. And I will encourage your support.'",
        "'speaker_3': 'Thank you. Thank you. Councilman Brown, do we have any other comments by members of council seen on Mr. secretary? Roll call from brown. I thought i. Laman hi. Lopez. Hi, monteiro nevett. Hi, rob shepherd. Mr. president. Hi. Mr. Secretary, please close voting and announce the results.'",
        "'speaker_3': '99099809 accounts. About 35 has passed. There is no pre adjournment announcement, so seen no other business before this body. This meeting is adjourned.'",
        "'speaker_1': 'Denver eight TV. Your city. Your source. Denver eight is about your city. Tell us what you think.'",
        "'speaker_4': 'I enjoy watching your programs because they explain everything thoroughly.'",
        "'speaker_9': 'The show really keeps me current with the city government.'",
        "'speaker_4': 'I think the Denver News.'",
        "'speaker_9': 'Showed that you have each weekend an informative and concise.'",
        "'speaker_0': 'Time.'",
        "'speaker_1': 'To talk back to your television call or email us for your direct connection to Denver TV.'"
    ]
}