{
    "A proclamation congratulating the Denver St. Patricks Day Parade Committee on the occasion of the 55th annual parade on March 11, 2017.": [
        "'speaker_1': 'All right. Next up, we have proclamation number 17, dash 0299 congratulating the Denver St Patrick's Day Parade Committee on the occasion of the 55th Annual Parade on March 11, 2017. Whereas Denver has one of the largest cultural parades in the United States and the largest Saint Patrick's Day parade west of the Mississippi.'",
        "'speaker_1': 'And. WHEREAS, this year's theme, The Emerald Celebration, pays tribute to the 55th anniversary of the parade. And. WHEREAS, The Denver St Patrick's Day parade exemplifies a peaceful celebration, along with a community of diverse citizens who gather together with a glance at the Celtic past and look to the future while enjoying Irish cultural fanfare, pipe and drum bands'",
        "'speaker_1': ', Irish step dancing and honoring all divisions of our military to the delight of over 300,000 spectators. And. WHEREAS, congratulations and thanks to all volunteers of the St Patrick's Day Parade Committee, including many who have passed on but are still remembered for their endless hours and never ending commitment, which makes this celebration possible.'",
        "'speaker_1': 'And. Whereas, we hope the Colorado Sun and the Mile High Air lifts the spirits of all who march or attend the 55th Annual Parade Saturday, March 11th, 2017. And we hope for a warm wind at our backs as we celebrate the Irish culture in the great state of Colorado.'",
        "'speaker_1': 'Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Council hereby congratulates the Saint Patrick's Day Parade Committee, a volunteer organization on a well-organized, peaceful and spirited gathering at the 55th Annual Event, Section two that the Clerk of the city and County of Denver shall attest and affixed to'",
        "'speaker_1': 'seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the Denver Saint Patrick's Day Parade Committee President James Leasure i. I will move that proclamation to 99 we adopted and it looks like I have a second comments by members of City Council and I'll start, since I got lucky tonight'",
        "'speaker_1': 'to be able to read this proclamation, even though it's not in my district. But you know, I my my personal heritage is one that is a broad mix of a lot of different things, none of which I am more proud of than the slice of that.'",
        "'speaker_1': 'That is my Irish heritage. And it was something that my whole life I took a great deal of pride in. Green, to this day, remains my favorite color. And I just want to say that as someone who has grown up in Denver, was a kid in the city and now I'm raising my kids in this city.'",
        "'speaker_1': 'This parade has been such a joy and a wonderful thing for me and my family to take pictures of my babies when they were just born down at the parade with, you know, earmuffs on so that they didn't get startled by all of the fire trucks coming by.'",
        "'speaker_1': 'But it's such a great thing for our city, such a great tradition, such a great celebration. And having worked in the nonprofit sector most of my life, I know how much work something like that must be. And so I just want to share my thanks for all of the hard work and encourage all my colleagues to support'",
        "'speaker_1': 'this great proclamation tonight. Are there any other comments? All right. Seeing none. Madam Secretary, roll call.'",
        "'speaker_3': 'Espinosa. Hi. Flynn. Hi, Jasmine.'",
        "'speaker_7': 'Hi.'",
        "'speaker_2': 'Can I. New Susman my black eye.'",
        "'speaker_3': 'Mr. President. Hi.'",
        "'speaker_1': 'Madam Secretary. Please close the voting and announce the results.'",
        "'speaker_3': 'Eight eyes.'",
        "'speaker_1': 'Eight Eyes proclamation to 99 has been adopted. And to accept the proclamation, I would like to bring up and I apologize if I say your name wrong. Teresa marano and Jay Leasure. Come on up.'",
        "'speaker_5': 'Thank you, President Pro Tem. Yes, my husband is to blame for the Italian name, but I would like to say thank you to the council and I would like to introduce the nine board members. Could you please stand?'",
        "'speaker_5': 'The board members are the guide. They guide and lead and inspire over 300 volunteers to put this parade on the streets. Our board of directors. With us today. We also have our little Miss Shamrock. Can you give us a wave?'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'However, Queen Coleen and Coleen refers to a woman of great character. She reflects compassion, kindness, intellect, social responsibility, and, of course, her Irish heritage. And today we have with us Laura Farley, Queen Coleen. We are most fortunate today to also have our grand marshal.'",
        "'speaker_5': 'His name is Jim Lyons and he is the honorary Irish Council to Ireland. He was appointed by President Clinton to succeed Senator George Mitchell. Mitchell as a special adviser to the President of the United States and Secretary of State for Economic Initiatives in Northern Ireland and the border counties of the Republic of Ireland.'",
        "'speaker_5': 'He was responsible for numerous economic initiatives in support of the peace process and promoting partnerships at all levels between Ireland and the Southwestern United States. Mr. Lyons, a senior partner at Louis Rock, Roth Berger Christie is a perfect choice for grand marshal, and he is with us today.'",
        "'speaker_5': 'I would like to recognize him as well. Here to accept the proclamation is our President, Mr. Jay Leasure.'",
        "'speaker_7': 'Mr. President, pro tem and council, I'd like to thank you all for your continued support of the Denver St Patrick's Day. A lot. We couldn't do it without you guys and all your support in the background. So thank you very much.'",
        "'speaker_5': 'Thank you.'"
    ],
    "A proclamation in support of National Native HIV/AIDS Awareness Day & National Women and Girls HIV/AIDS Awareness Day.": [
        "'speaker_1': 'Thank you. All right. Our third proclamation tonight is. Councilman Espinosa, will you read Proclamation 304?'",
        "'speaker_7': 'Yes, Mr. President. Thank you. Proclamation number 17 0304 in support of national native HIV AIDS Awareness Day and National Women and Girls HIV Awareness AIDS Awareness Day. Whereas, more than 1.2 million Americans are living with HIV and more than 50,000 become infected with HIV every year, one in four between the ages of 13 and 24.'",
        "'speaker_7': 'Whereas, according to the Colorado Department of Public Health and Environment at the end of 2015, more than 13,000 people were reported to be living with HIV in the state of Colorado. And. WHEREAS, HIV and AIDS has affected Denver more than any other county in the state of Colorado, reporting the most persons living with the disease.'",
        "'speaker_7': 'Most HIV or AIDS related deaths. And 36% of new HIV infections in 2015. And. WHEREAS, the continued spread of HIV in the American Indian and native Alaska, mainly Alaskan native communities, poses a significant risk to the health and well-being of these communities.'",
        "'speaker_7': 'They have the third, third highest rate of new HIV infections in Colorado from 2011 to 2015. And. WHEREAS, when compared with other ethnic ethnic groups, American Indians in Alaska Natives are ranked fifth in estimated estimated return, mean an estimated rates of HIV diagnosis and have poorer survival rates after an HIV diagnosis.'",
        "'speaker_7': 'HIV infection was the ninth leading cause of death among American Indians and Alaska Native youth, aged 25 to 34 in 2014. And. WHEREAS, approximately one in four people living with HIV in the U.S. are women. Cases, despite cases, disproportionately affect African-American and Latino women who represent 29% of all women in the United States, but account for 78%'",
        "'speaker_7': 'of HIV cases among women. And. WHEREAS, the city and county of Denver recognizes the continued work to bring HIV and AIDS awareness by groups such as Cafe Cultura Children's Hospital Immune Immunodeficiency Program, Denver Indian Family in Resource Center, Servicios de la Raza, Sisters of Color, United for Education, the Empowerment Program and the GLB Community Center of Colorado'",
        "'speaker_7': '. Whereas HIV it and now therefore it be complaints are therefore be proclaimed by the city and county, the Council, the city and county of Denver, Section one. The Denver City Council proclaims March 10th, 2017, to be known as the National Women and Girls HIV AIDS Awareness Day and March 20, 2017 as National Native HIV AIDS Awareness Day'",
        "'speaker_7': '. Section two that the Clerk of the city and County of Denver shall test and affix the seal of the city and county of Denver to this proclamation, and that copies be transmitted to Caf Cultura, the Denver Indian Family and Resource Center, and the Sisters of Color.'",
        "'speaker_7': 'United for Education.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. Your motion to adopt so moved. It has been moved and seconded comments by members of Council Councilmen Espinosa.'",
        "'speaker_7': 'I just was I was honored that Councilman Lopez asked me to read this. I was shocked and stunned when I did those statistics about the African-American and Latino women who represent 29% of all women in the United States.'",
        "'speaker_7': 'They account for 78% of HIV cases among women. I'm not one to sort of go too much into national politics, but I did last year. And, you know, we just had the the proclamation honoring Saint Patty's Day parade.'",
        "'speaker_7': 'And last year I did mention how the Irish were persecuted people. And then I sort of warned about what was looking like a trend in the United States at that time that is sort of come to fruition to some degree on discrimination.'",
        "'speaker_7': 'And so I hope that we see we work to see these statistics reduced, but at a time when groups such as Planned Parenthood and funding for women's health is targeted and we've already seen these these numbers disproportionately affect minority women.'",
        "'speaker_7': 'I'm worried that this is going to go the opposite direction. So with that, I'm just I'm glad that this this the reading of this proclamation fell into my hands.'",
        "'speaker_1': 'So. Thank you, Councilman. Seeing no other comments, Madam Secretary.'",
        "'speaker_3': 'Rocco Espinosa. Hi, Flynn. I Herndon.'",
        "'speaker_6': 'Hi.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'Can each new assessment? I black.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Mr. President, i.'",
        "'speaker_1': 'Madam Secretary, please. Because the voting announced the results.'",
        "'speaker_3': 'Nine Eyes.'",
        "'speaker_1': 'Nine eyes. Proclamation 304 has been adopted. Councilman Espinosa, is there someone you'd like to invite up to receive the proclamation?'",
        "'speaker_7': 'Yes, Mr. President. I'd like to invite on a cruise in Alvin, Chile to receive the proclamation. And family. Yeah. Take advantage. Yeah. Look, until I shot someone dosage. I surely don't Oliver. She will you. Subject cannon slander teaching position hunting nationality audition injustice che Qatar aid peninsula.'",
        "'speaker_7': 'Hello, councilmembers. My name is Alvin Chee. I am the mayor or Navajo from Arizona. I am born to the bitter water, the honeycombed rock people, and born to the bitter water clan people of my tribe. I am a health care program manager with the JLP Community Center here in Denver, and I want to give my gratitude to'",
        "'speaker_7': 'Councilmember Espinosa and Councilmember Lopez and the council itself for passing this proclamation today. The stats you've read is, although profound, is becoming more manageable these days. However, our goal as a community is to bring that number down to zero.'",
        "'speaker_7': 'And with your help today, you brought that to light. Bringing this problem to the council to light. And with your help, we're able to reach out to the community at large to help in this awareness. Thank you so much, council members.'",
        "'speaker_7': 'And again. Good evening. I'd like to thank the Council for considering this proclamation. I think we were talking about it. I think this might be the fifth year that the Council has passed this proclamation as part of a community effort to bring greater awareness around HIV and AIDS to to the native community here in Denver, as well'",
        "'speaker_7': 'as women and girls. And is part of a larger program that we've been organizing called Rise Up the second Friday of March every year. And we collaborate with a lot of different organizations that are listed in the proclamation to provide free HIV and gonorrhea and chlamydia testing and as part of a community celebration, to be able to'",
        "'speaker_7': 'recognize, obviously, ways that we can protect our community from from these illnesses, from these infections, but also to be able to celebrate those people who are who are continuing to live and thrive with these these these illnesses. And so we really want to welcome you all if you have the time this coming Friday from 630 to 930'",
        "'speaker_7': 'over half of ninth and Lopez go at the space of the Denver inner parish LA academia. Our home Catholic will do the so. We have free food, free HIV testing and we definitely welcome the community to attend. And it's something that I think is continuing with the energy that has built the last couple of years, including recently'",
        "'speaker_7': 'with Native people being more present in the national conversation and you know, example being the struggle at Standing Rock and the fight against the Dakota Access pipeline and to divest from those banks that are funding it. And so I think it's definitely a representation of people, Native people, being present and visible in the public eye.'",
        "'speaker_7': 'So I just wanted to say that much and thank you for for passing this proclamation.'",
        "'speaker_1': 'Thank you. All right. That brings us to our resolutions. Madam Secretary, will you please read the resolutions.'"
    ],
    "A bill for an ordinance amending the Denver Code of Ethics, and making conforming amendments to the Article V of Chapter 2, D.R.M.C. concerning financial disclosure requirements. Approves amending the Denver Code of Ethics.  The Committee approved filing this bill at its meeting on 2-21-17.  This bill was approved for filing by title only by Council President Brooks.": [
        "'speaker_1': 'Now I'll do a recap. Under resolutions, we have nothing called out under bills for introduction, we have nothing called out under bills for final consideration. Councilman Flynn has called out Council Bill 1202 for a comment. Councilwoman Kennedy has called out Council Bill 156 for a vote and Councilman Cashman has called out Council Bill 153 for a vote'",
        "'speaker_1': '. Under pending, we have nothing called out and miss anything. All right, Madam Secretary, would you please put the first item on our screens? Councilman Flynn, go ahead with your comment on Council Bill 1202.'",
        "'speaker_4': 'Thank you, Mr. President. Pro Tem Council Bill 12 zero two Series of 2016 consists of several amendments to the Denver Code of Ethics. About every 2 to 3 years, the ethics code has had amendments made to it. But this is the first time in 16 years that some fairly substantive issues are going to be addressed.'",
        "'speaker_4': 'Primarily, it is that in place of the limit on meals and event tickets that was adopted in 2001 after a very, very, very contentious 18 months of debate and division on the council finally being mediated by Mayor Webb.'",
        "'speaker_4': 'There was in place a limitation that consisted of the number of times and the number was four, that people could accept a meal or a ticket to an event from a person who had over whom we had direct official action.'",
        "'speaker_4': 'What we're doing here is bringing the Denver Code of Ethics into line with every other city and state code of ethics that we could find on the task force last year to put a dollar cap instead of a number of times.'",
        "'speaker_4': 'So we're using a dollar cap of $300 on an event ticket and other things that fall under those limitations on the task force. There was a lot of debate about this. My colleagues, as you know, there were a number of people, myself included, as a former journalist, who would rather have seen just enhanced transparency and no limitation'",
        "'speaker_4': 'on the dollar amount. And that has as if I were still a reporter, I'd love to have that in place because I'd love to write a story that said, you know, Councilman Flynn accepts trip to the Bahamas for $10,000, but it's better for the public good.'",
        "'speaker_4': 'Actually, I wouldn't rather see that story just to clear that up.'",
        "'speaker_7': 'Right.'",
        "'speaker_4': 'But it's not good for public confidence in this body and what we do. It's not sufficient that we go to bed each night knowing in our hearts that we have behaved and conducted ourselves ethically. We have. And but that's not enough.'",
        "'speaker_4': 'It's important that the people of Denver go to bed each night feeling the same. And by putting a dollar limit. On the amount that we can accept from people with whom we do business is the way to do it.'",
        "'speaker_4': 'I wanted to thank a number of folks. I want to thank, first of all, the council member right next to me on my right, Councilwoman Canete, who has helped me through this process. It's been very valuable to me.'",
        "'speaker_4': 'Thank you very much. I want to thank council members Ortega, who is not here, Gilmore and Black for the input that they gave me that I think improve this. And I also want to thank our clerk and recorder, Deborah Johnson.'",
        "'speaker_4': 'In January, we passed amendments to the disclosure requirements that now require us to keep track of every penny. That we received from someone who has business with the city. Under the old rules, the $25 was the threshold. But what we did was we limited our reporting to people with whom we do business.'",
        "'speaker_4': 'But starting from the first penny. And because we now must keep track of that, what this ordinance does, what these amendments do is it just says, stop when you hit $300. So with that and also, I should thank the task force that worked all last year on this consist of the city attorney's office, some other city employees'",
        "'speaker_4': 'and outside stakeholders, including the League of Women Voters, Ethics Watch and Colorado Common Cause. So with that, Mr. President, I would ask all my colleagues to join me in voting yes. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Flint. Councilman Espinosa.'",
        "'speaker_7': 'Yeah. I just wanted to thank Councilman Flynn for champion this and doing that work with the task force and with council and committee. I think this took a long time. I mean, took quite a bit of time before, you know, this could have been presented to council some time ago.'",
        "'speaker_7': 'But it it did sit in committee. We did talk about it and we debated some of the points. And I think this, along with a whole host of things that we vote on and pass and opine on, are benefited from that dialog and and may not be where it originated.'",
        "'speaker_7': 'But I do think that that it it was improved by the process. And I just wanted to thank the Councilman Flynn for having done that that work, because I know it wasn't easy at times. Thanks.'"
    ],
    "A bill for an ordinance making supplemental appropriations from the General Contingency Fund to the General Government Special Revenue Fund. Approves a $4 million supplemental appropriation from the Citys General Fund Contingency to the Office of Economic Development to support the Business Incentive Funds support of a general merchandise mass retail store on the 16th Street Mall at 1601 California Street in Council District 9.  The Committee approved filing this bill at its meeting on 2-21-17.  This bill was approved for late filing by Council President Brooks.": [
        "'speaker_1': 'Thank you, Councilman Espinosa and Councilman Flynn, I just want to clarify, you had said asking everybody for your vote, but you're still okay with us going on the block vote. You want to call it out for voting no.'",
        "'speaker_1': 'Okay. All right. Madam Secretary, if you could please put the next item on our screens. And, Councilwoman Blackwell, you put Council Bill 156 on the floor for passage.'",
        "'speaker_2': 'Yes, Mr. President pro tem. I move that council. Bill 17 DASH 156. Be.'",
        "'speaker_1': 'Ordered published a final consideration in due pass.'",
        "'speaker_2': 'Thank you. We placed upon final consideration and do pass.'",
        "'speaker_1': 'Excellent. It has been moved. Can I get a second? All right. It's been moved and seconded comments by members of Council Councilwoman Cannick.'",
        "'speaker_2': 'Thank you, Mr. President. We had some discussion about this bill last week, so I won't repeat that. We had two different bills last week. One was a contract to make the investment with the developer, and the second was the contingency fund allocation to transfer the money in the budget.'",
        "'speaker_2': 'So that's a two reading bill. This is the second reading of that bill. And I continue to have concerns both about the fact that we do not have a direct contract with the retailer as well as the fact that we.'",
        "'speaker_2': 'Do you not have high enough quality, full time jobs for me to feel like this is an appropriate investment of this level from this particular fund? So with that, I will vote again this week to decline to support this.'",
        "'speaker_2': 'And thank you for your time, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Espinosa.'",
        "'speaker_7': 'Yeah, I wasn't here last week, but. And she only touched on it. But I do agree with everything that Councilwoman Cannick mentioned last week and then the structural portion portion that she mentioned this week as well. The. The the and I wish people actually were able to have heard the public comment.'",
        "'speaker_7': 'There was a pretty a pretty harsh criticism of this that I think deserves to some degree, some bit of airwave airtime. I wish I could speak as well on the subject as that person did. Yes. In my past life before I was here, I was an architect and I was involved in a bit of urban planning projects'",
        "'speaker_7': 'and things like that. And so, um, you know, there's a lot of, if this was in fact an eight to 6 to 8 year project effort to get to this point, I would have expected a far more thorough and robust sort of understanding and explanation on how this really is the catalyst that we need for the 16th'",
        "'speaker_7': 'Street Mall. And so there is a large effort. A lot of public money goes into that corridor, and I'm just not convinced that this is it. And so for that reason, I'll be voting in opposition as well, because when we make a public investment like this, we should be getting good, stable jobs and a thriving community as'",
        "'speaker_7': 'well. Too much money going into this corridor without adequate support for the the why. So thank you.'",
        "'speaker_1': 'Thank you, councilman. Seeing no other comments. Madam Secretary. Raquel.'",
        "'speaker_3': 'Can each new Sussman.'",
        "'speaker_2': 'I black I.'",
        "'speaker_3': 'Espinosa. No. Flynn Gilmore. I.'",
        "'speaker_7': 'Herndon, i.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Mr. President. I.'",
        "'speaker_1': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': 'Eat ice. Two nays.'"
    ],
    "A bill for an ordinance vacating a portion of an alley bounded by 15th Street, Wynkoop Street, Wazee Street and the Cherry Creek, with reservations. Vacates a portion of the public alley bounded by 15th Street and the Cherry Creek and Wynkoop Street and Wazee Street, with reservations, in Council District 9. The Committee approved filing this bill by consent on 2-14-17.": [
        "'speaker_1': 'Ayes, two nays. Council Bill 156 has passed. Madam Secretary, can you please put the next item on our screens? And, Councilwoman Black. Will you put please put Council Bill 153 on the floor for passage.'",
        "'speaker_2': 'Thank you, Mr. President pro tem I move that council bill 17 dash 153 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded comments by members of Council. Councilman Cashman. Yes, I have a question. Mr. President.'",
        "'speaker_4': 'Is Angelica Sears in the house?'",
        "'speaker_1': 'It's kind of like I walked.'",
        "'speaker_4': 'Down the red carpet. And so last week when this was put before us on first reading, I asked if there was a response from the fire department, and you indicated that there was. And then we found out that there was a little bit of confusion there.'",
        "'speaker_4': 'Can you go through that.'",
        "'speaker_1': 'For me, please?'",
        "'speaker_2': 'So, yeah, last week I did say that there was a response from the fire department. So this is what happened. So one of our agents, John Reynolds, he called Dave Clark of the fire department to discuss this very specific vacation and asked him if he had any other comments about this vacation.'",
        "'speaker_2': 'He indicated that he had no other comments. So what John Reynolds did then is follow up with an email saying this is just an email confirming that you have no other comments. He did not respond to that. What I was referring to or what I misspoke on is that they did have a conversation.'",
        "'speaker_1': 'Okay. And can you describe the inn in case.'",
        "'speaker_7': 'Of a fire on on how.'",
        "'speaker_4': 'The fire department would approach that particular situation in the alley?'",
        "'speaker_2': 'You know, to be honest, I cannot speak to that.'",
        "'speaker_4': 'I believe one of the representatives can. Good evening. Council members Brian Connolly with the law firm of Art and Johnson representing unico properties. So the requirement of the fire code is that there be two points of ingress or egress access to the building.'",
        "'speaker_4': 'And so for any one of those buildings is located along the alley, you've got the front door, which is either on Swasey or on Wynkoop, and then you've got the backdoor which is on the alley as you move down the alley.'",
        "'speaker_4': 'And I only know this because I was in a meeting with Dave Clark from the fire department on this on November 3rd of 2015. And so as you move down the alley, there's actually a bridge over the alley as you get closer to our client's property.'",
        "'speaker_4': 'So a hook and ladder truck actually cannot access all the way down the alley. A hook and ladder truck can only go as far as the bridge over the alley. So you still have two points of ingress and egress from each of those buildings.'",
        "'speaker_4': 'You have the point that's on the front side on either wing Cooper wasI, and then you have the point that's on the back side. So a hook and ladder truck could drive down the alley. It would then back out once they're done fighting the fire.'",
        "'speaker_4': 'But they do have access to that to that building. I also just to follow up on on Mukasey's statement, we also have a letter dated October 3rd of 2016 from Scott Briscoe, the chief building official, which confirms that the vacation of the alley would meet the requirements of the building and fire code.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_1': 'All right thing. No other comments. I'm comfortable with passing that through. Okay, so no, you don't need a vote anymore, not a secretary, since it's already been moved and seconded and put on the floor. What do we need to do if we're going to move it to the black vote?'",
        "'speaker_3': 'We're doing the first and second degree. Then we can cancel it and just put it with the black vote. So that would be Councilmember Black in Herndon.'",
        "'speaker_1': 'Any objections from Councilwoman Black or Councilman Herndon?'",
        "'speaker_7': 'No. No.'",
        "'speaker_1': 'All right. So go ahead. Move that back to the black vote. Um. They think that all our items that were called out, all of their bills for introduction are ordered published. We are now ready for the block vote on resolutions and bills on final consideration.'",
        "'speaker_1': 'Kels members remember that this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. Councilwoman Blackwell, you put the resolutions for adoption and the bills on final consideration for final passage on the floor.'",
        "'speaker_2': 'I move that resolutions be adopted and bills on final consideration be placed upon final consideration and do pass in a block for the following items. 17 Dash 015 117 Dash 022 517 Dash 022 717 Dash 022 817 Dash 022 917 Dash 022 317.'",
        "'speaker_2': 'Dash 013 117. Dash 013 217. Dash 167 17. Dash 022 117. Dash 2023 217. Dash 022 216. Dash 1202 17 Dash one 4317. Dash zero one 5317. Dash zero 155.'",
        "'speaker_1': 'It has been moved and seconded. Madam Secretary, Roll Call.'",
        "'speaker_3': 'Black.'",
        "'speaker_2': 'Eye.'",
        "'speaker_3': 'Espinosa, i.'",
        "'speaker_4': 'Flynn, i.'",
        "'speaker_3': 'Gilmore, i. Herndon, i. Cashman. I can each.'",
        "'speaker_2': 'New.'",
        "'speaker_3': 'Assessment.'",
        "'speaker_2': 'Hi.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results tonight. Tonight, the resolutions have been adopted and the bills have been placed upon final consideration and do pass. Since there are no public hearings, and if there are no objections from members of council, we will not take a recess this evening.'"
    ]
}