{
    "A resolution approving a proposed on-call engineering Agreement for Campus Placemaking Services at the National Western Center between the City and County of Denver and Moore Iacofano Goltsman, Incorporated. Approves a two-year, $5 million on-call contract with Moore Iacofano Goltsman, Inc. for campus design standards and guidelines, facilities program refinement, a campus public realm study for design, and construction procurements for the development of the National Western Center Campus (201735049). The last regularly scheduled Council meeting within the 30-day review period is on 6-26-17. The Committee approved filing this resolution by consent on 5-30-17.": [
        "'speaker_3': 'So as you just said in your explanation that this is a $1.1 billion project, that ch2m Hills is is programing. So are they actually is so is that actually the total cost relative to the project actually diminished because they're actually doing program management for the entirety of the project, even though they're the $14 million was only based'",
        "'speaker_3': 'on the first.'",
        "'speaker_7': 'So so the. So two parts there, Councilman. One, it would be it would make no sense. Even though we're focused on phases one or two and it's an eight phase project, we have to think about all eight phases because things that we're going to do in the early phases ultimately either allow us to get to future phases'",
        "'speaker_7': 'sooner or certainly have an impact on future phases. So we always have to think about the campus as a whole, which is another reason why you have a program management team always thinking about the larger aspects are impacts on the overall program as we break the project into individual project components.'",
        "'speaker_7': 'So we're going to, you know, one of their roles or the collective role of the National Western Office is to think about the whole campus and the planning. So the design standards and guidelines, the ride away, the infrastructure that ultimately feeds the campus, all those things have to be thinking thought about as a whole and not just'",
        "'speaker_7': 'the individual parts, because if you only thought about them as the individual parts and started at the project level first and work back to the program, we could find errors that we missed in thinking about things the overall campus might need.'",
        "'speaker_7': 'So again, this is an approach that we we thought long and hard about and one that we've we've always thought about it from the campus first. And we're putting in place more and more detail so that when we do go to a project level, we are then managing the appropriate levels of risk as opposed to trying to'",
        "'speaker_7': 'do it the other way around.'",
        "'speaker_3': 'Okay. Mostly I was concerned about. Does that mean then that that somebody would come by come back in later years asking for the balance of the program management for for for projects that aren't essentially in phase one or are they in fact, programing phases one, two and beyond.'",
        "'speaker_7': 'So the so again, remember, the 14 million that you keep referring to is a maximum amount. That doesn't mean we're going to spend all 14 million. That is our best guess as to what we think it's going to take could take to fulfill the objectives of of the program.'",
        "'speaker_7': 'Certainly, you know, the time frame and I remember it's three years, Steph, three years for the program management and it's for predominantly over phases one or two. But I could argue we're actually leveraging the the investment that they're making in the time they're there.'",
        "'speaker_7': 'They're putting into this because we are thinking about the full program and not just those first two phases as well.'",
        "'speaker_3': 'You know, the reason why that all that matters in recognizing there's a maximum is this could be a sub consultant to coach to m through their contract. Not necessarily direct they know they couldn't.'",
        "'speaker_7': 'I don't.'",
        "'speaker_3': 'Sorry. I was reacting to your teammates that were saying that that couldn't be the case.'",
        "'speaker_7': 'So what's the question?'",
        "'speaker_3': 'So it just again, I would rather us my concerns then and as they are now, is is is making huge allocations for four unknowns.'",
        "'speaker_7': 'So so but I can I mean, again, I've been doing this a long time. And the decisions we're going to make as a team and that and the work that the team collective team is doing over the next, let's say 12, 18, 24 months ultimately affect the whole campus.'",
        "'speaker_7': 'So the fact that we are bringing in the best and brightest, I think, in terms of helping us think through this is.'",
        "'speaker_3': 'Maybe I didn't say that right in that I'm not concerned about the work product that's going to be generated, actually expected to be superb and world class and in precedent setting. I wouldn't expect anything less out of you and your staff and your team and the resources that are are being allocated to this.'",
        "'speaker_3': 'It is more of a of a fiscal responsibility. These are large sums of money. And where this comes from is, is I, I represent a district that is ten times the size of the 250 acres. That is the structure.'",
        "'speaker_3': 'And I would love to have design guidelines and standards in at least targeted areas of my district, which require the city to allocate funds to that endeavor. And since to 2012, my taxpayers in my district have been paying loads and loads, millions and millions and millions of dollars to the city expecting those sort of services, and they'",
        "'speaker_3': 'have not received them in any great detail. And so here you are receiving these sorts of funds through a taxpayer, my taxpayers approved bond request, I mean, a tax ballot initiative. And so the expectation is, is that we are in fact, my concerns are that it's trying to find out and give them some assurance that the this'",
        "'speaker_3': 'is the most fiscally responsible way that you guys are, in fact, doing that in a fiscally responsible way, because these are very large sums of money that pay for very good consultants that I'm sure my own constituents would love to have addressing their own physical built environment concerns in the district, which has not happened.'",
        "'speaker_7': 'So I can only speak to the project for which I'm in charge, and I can say in the strongest way that I absolutely believe we are being fiscally responsible. And ultimately the decisions that our collective team will make will deliver the project on time and on budget.'",
        "'speaker_7': 'And hopefully what you're going to see later this year is a schedule that moves faster and is really smart about how we deliver a very complicated program. So I'm I'm standing here before council telling you I feel very good about the decisions we've made.'",
        "'speaker_7': 'It's been done in a competitive procurement process. We've seen some great firms and we're standing before you today as a result of that. One of those processes bringing forward this this professional service provider to help us move to the next stage.'",
        "'speaker_3': 'Wonderful. Thank you very much.'",
        "'speaker_4': 'Thank you, Councilman Espinosa. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. Kelly, can you tell us if you're still looking at a P3 partner to accelerate the build out of the the overall vision?'",
        "'speaker_7': 'Sure. So the short answer is, is yes, because again, the work we're doing now predominantly focuses on phases one and two, although that impacts 80% of the project. You know, the focus really is between and I wish we had a map here, but between the Burlington Northern, which is divides the space all the way to the river'",
        "'speaker_7': ', that's where these first three facilities have to be built as a result of the time frame we're under because of the state RTA money. But to fulfill the future phases, which is phase three through eight, we are exploring a wide range of other funding options and certainly one of those that we're exploring is a public private partnership'",
        "'speaker_7': 'that that will have to go through its own level of due diligence and scrutiny as we get there. But we have certainly been active in engaging folks that do that sort of work and we'll we'll look at it in due course, but it's one of many possible future strategies we use to complete the campus.'",
        "'speaker_8': 'So I'm assuming if there is something moving in that along those lines, that would be part of that schedule that we would be seeing later on.'",
        "'speaker_7': 'Absolutely. And, you know, and there's a bigger effort afoot, obviously, within the city where we would be one of many possible projects looking at those sorts of arrangements where there's got to be a structure put in place that all city projects that might explore, that would would go through some evaluation.'",
        "'speaker_7': 'And we would just we would have to marry up and go through that of. I was like any other project.'",
        "'speaker_8': 'Can you tell me if the project in general is expected to be a design build?'",
        "'speaker_7': 'Don't know yet. I mean, we are. So I want to share with you. I mean, I've you know, I presented I've presented on this in front of industry probably a half dozen times over the last year. And one of the things that that I've said and our team has said is, you know, again, with a program like'",
        "'speaker_7': 'this, it's so complex, we have to actively engage industry to help us think through different procurement ideas, design, build. Being one of many. And then the interesting thing about this program is there's certainly a variety of procurement strategies that may make sense.'",
        "'speaker_7': 'And my hope would be is that we align the right procurement strategy with the right project at the right time. So we're we're actively talking to industry. We're going to continue to do that. Our team is right now thinking through a preferred procurement approach or approaches for these early phases, which include both infrastructure and ultimately vertical development'",
        "'speaker_7': '. We will reengage industry again before we actually settle on a strategy because we want to make sure that industry is comfortable with the approach that it makes sense. How is it aligned with, you know, attracting businesses small, medium and large to a program like this?'",
        "'speaker_7': 'But we haven't we have not yet settled on an approach or any approach for any of the program at this point and are going through that process now.'",
        "'speaker_8': 'So can we talk about jobs for just a second? You betcha. I know you all have hired some folks to help begin to look at that. And I'm not sure that you all are planning to put some dollars into apprenticeships with the kind of construction that's going on in our city today.'",
        "'speaker_8': 'I know every big project is dying for a trained workforce, making sure that they've got the best folks on their team to help build out what they have envisioned for their location. And I also know that Seedat will be making an announcement this week in terms of what that structure is going to look like for rolling out'",
        "'speaker_8': 'the apprenticeship jobs that they will have as part of the I-70 project. So can you just speak to a commitment to apprenticeships and to both construction and non construction jobs that will be part of national Western?'",
        "'speaker_7': 'Sure. So, you know, we have, as you know, councilwoman, and it's been something that I've certainly personally been passionate about, is how do you leverage projects like this to to do some pretty incredible things. And, you know, Colorado is in a unique place.'",
        "'speaker_7': 'Denver is in a unique place in leveraging projects like National Western to build the next generation of of skilled workers for our city. So we have two people on our team that are that are specifically working on that one from stage two and then one that is part of the DCC shared resources with NewCo and one that's'",
        "'speaker_7': 'really focused at a neighborhood level and one that's thinking about it from the business side. But the long and short of it is, is we're going to lay out a workforce development plan as part of the National Western Center.'",
        "'speaker_7': 'That's going to include collaboration with projects like Sea Dots, I-70 Project and others. And how do we align forces and leverage resources to bring workers on? And absolutely, I think apprenticeships have to be part of the mix for us to to provide a range of opportunities for folks to find the right place to enter and then ultimately'",
        "'speaker_7': 'get the training they need and then move on to projects and helping us deliver those projects. So I can guarantee you that apprenticeships are going to absolutely be a part of that effort.'",
        "'speaker_8': 'Thank you. I have no further questions.'",
        "'speaker_4': 'Thank you, Councilwoman Ortega. Councilman new you're up.'",
        "'speaker_7': 'Kelly, you just wanted to say you get a lot of questions. Were so proud of what was going on out there. You know, it's going to be one of the greatest assets we have and and really gives the public an opportunity to hear you talk a little bit more about what's going on out there and the progress'",
        "'speaker_7': 'that you're making. Just one question. I had one of the issues that you talked to us a good bit about land acquisition and getting the properties there. How's that going? And, and, and what's the update on it? So, you know, I knew someone was going to ask me about land, so I called my land person.'",
        "'speaker_7': 'But I will tell you that, you know, again, there are 38 private parcels that have to be acquired as part of this effort. As of this last week, we now have 28 of those, 38 under some level of control, which is about 74% completion.'",
        "'speaker_7': 'Again, my goal was we started last April, so April of 16, which is when we issued the first two seed money for our per, our project, our program. My goal was to have be at 50% by April. So here we sit in June and we're at 74%.'",
        "'speaker_7': 'So we're a bit ahead of schedule in terms of where we need to be. We just had a property come under our control here, this in the last week or so. That's at the north end of the campus, which is the largest land component to help us build the equestrian center.'",
        "'speaker_7': 'So we are in in a really good place with we still have some tough ones ahead of us. But I'm feeling with each passing day really confident that we're going to have the land we need assembled well in advance of when we need it to start demolition and then ultimately improvements on the site.'",
        "'speaker_7': 'That's great. Nice for you and what your team is doing. Appreciate it. Thank you. And thank you for your continued support.'",
        "'speaker_4': 'Thank you, Councilman and Councilman Snow, you're up. But I'm have Councilwoman Sussman go because she hasn't had the opportunity to speak. Is that okay? Yes, absolutely. Got some assessment group.'",
        "'speaker_8': 'I just want to.'",
        "'speaker_2': 'Echo councilman news thoughts about what a great job that's happening there. Also to let them let folks know that you do quarterly reports, land use, transportation infrastructure which are televised and can't remember the next date.'",
        "'speaker_7': 'You're coming up here this month. I think it's the 27th Council.'",
        "'speaker_2': 'Something something close by. So people that do want to get all the straight skinny about the Western Center.'",
        "'speaker_8': 'Can tune in to Ludi on Tuesdays at 1030.'",
        "'speaker_7': 'Well, and if I can, I mean, obviously, I'm the one that usually gets to stand before you and for questions like this. But there's a team of people that in our combination of city employees and. Attracted employees to help us get this done.'",
        "'speaker_7': 'And I couldn't be more proud of the team we have and I would stack this team up against anyone in terms of the work they're doing, the commitment to the project and helping. And it's not just about the project.'",
        "'speaker_7': 'We constantly talk about the importance of making sure that we deliver on our promise for the adjoining neighborhoods Globeville area, Swansea and everyone is committed to figuring out how we leverage this effort to make sure that as we reconnect global interests.'",
        "'speaker_7': 'Swansea, that there have been a factor as well.'",
        "'speaker_4': 'All right, Councilman Espinosa, you back up?'",
        "'speaker_3': 'Yeah. I just wanted to let you know that hearing you say that, you know, there's a dedication or commitment to an apprenticeship program or some sort is music to my ears. And I think before we become the agricultural Mecca, I think we could lead the way.'",
        "'speaker_3': 'And we're skilled workforce training and development with with the scale of project that we're talking about and the number of project opportunities. I think it would be really, really good for this city to do that. And again, like I said, I think we have the right team to do that.'",
        "'speaker_3': 'I know we continue to do that. So thank you very much.'",
        "'speaker_7': 'Well, you know, and I would just you know, on the workforce side, I think one of the interesting things that we have to think about is, you know, if you if you talk to economists, they say we're at full employment.'",
        "'speaker_7': 'Right. But the reality is, we know that's that's not the case. Right. And I think it's it's moments like this where industry, both public and private, have to come together and reevaluate our traditional approaches to growing our workforce.'",
        "'speaker_7': 'And is there is there are there new creative ways or are there different ways to think about old ways of doing things that make sense? And I will tell you, I just had a great conversation with folks from AGC, and I think everybody recognizes that not just what's going on in Denver, but in the entire front range'",
        "'speaker_7': 'is really forcing industry to rethink how we grow, attract and build a workforce. And I'm really excited about about what could be in front of us if we do this right.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you, Kelly. Thank you, Councilman Espinosa. All right. So that was just for questions. Last comments, that is concludes all the bills that we called out. So we're ready for the black vote. All other bills are introduction to Order published.'",
        "'speaker_4': 'And Council members. Remember, this is a consent or block block and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. Councilman Cashman. Sir, are you pleased with the resolutions for adoption and the bills on file consideration for final passage on the floor?'",
        "'speaker_4': 'Mr. President, I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in the block for the following items. All series of 2017 627 six 539 612 576 2621 622 623 624 631 499 593 610 488 489 494, 91 492 four, 93, four, 94, five, 63, five, 71.'",
        "'speaker_4': 'And I think that's all of them. Yes, sir. You get them all. It has been moved and seconded. Madam Secretary. Roll call.'",
        "'speaker_2': 'Black. All right. Espinosa. Hi. Flynn. I. Gilmore. I. Cashman. Hi. Lopez. I knew Ortega, but. Sussman. Mr. President. Hi. Dennis.'",
        "'speaker_4': 'Thank you. Tonight's resolutions have been adopted and bills have been placed on final consideration and do pass pre recess announcement tonight. There will be a combined required public hearing in Council Bill 435, changing the zoning classification for 4201 40 2003 4211 and 4022 4221 Brighton Boulevard in Elyria, Swansea and Council Bill 436 Changing the zoning classification for'",
        "'speaker_4': '4000 4020 and 4120 Brighton Boulevard in Elyria, Swansea. Anyone wishing to speak on either or both of these matters must be the Council Secretary to receive a speaker card to fill out and return to her during the recess of council.'",
        "'speaker_4': 'If there are no objections from members of council, it seems like we do not have a lot of speakers. Let's see if we can take a five minute recess. Council members, please be back at 615.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4201, 4203, 4211 & 4221 Brighton Blvd. in Elyria Swansea. Approves an official map amendment to rezone property located at 4201, 4203, 4211 and 4221 Brighton Boulevard from I-A, UO-2 to I-MX-8, UO-2 (industrial to industrial, mixed-use) in Council District 9. The Committee approved filing this bill at its meeting on 4-25-17.": [
        "'speaker_4': 'State your name and know that you are available for questions of council. Speakers will have 3 minutes unless another speaker has yielded his or her time, which will result in a total of six. On the presentation monitor. On the wall you will see your time counting down.'",
        "'speaker_4': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from using profane or obscene language. Direct your comments to the Council as a whole and refrain from individual or personal attacks.'",
        "'speaker_4': 'Councilman Cashman, will you please put Council Bill 435 on the floor? Yes, Mr. President. I move that council bill 534 be placed on the floor backwards. 435 on time. Sorry. Council Bill. 435. All right. Placed on final consideration and do pass.'",
        "'speaker_4': 'It has been moved and seconded. The combined public hearings were canceled before 35 and 40. 36 is open. Speakers may offer comments on either or both bills when call to speak. Tell us which adjacent property you are speaking to or if your comment is pertaining to both after the conclusion of the public hearing.'",
        "'speaker_4': 'Council will vote separately on each bill. May we have the start of work? Abe.'",
        "'speaker_7': 'Thank you very much. Members of city council. Good evening. A barge with the Department of Community Planning and Development and I'll be making a combined presentation for both of these two related map amendments which are right across Brighton Boulevard from each other and have been made by the same applicant.'",
        "'speaker_7': 'They are in City Council District nine. In the Elyria and Swansea, a neighborhood. And the request is for a math amendment to the I am a zone district that's in the industrial context. It's a mixed use district with an eight storey maximum height limit.'",
        "'speaker_7': 'The existing zoning is IMX five on the southeastern side of Brighton Boulevard with the Billboard Use Overlay you oh two and on the northwest side of Brayton Boulevard, the existing zoning is I a that's an industrial zone district.'",
        "'speaker_7': 'It also has the billboard use overlay district. The surrounding zoning is consistent with the zoning on the site with the exception of the site to the north, which has a campus entertainment zone district designation. That's the Forni Transportation Museum.'",
        "'speaker_7': 'Existing land use is industrial primarily and a little bit of parking on the map amendment site similar to surrounding sites at cept again for the sites to the north which are entertainment and cultural uses. And then the sites to the south, which is a railroad yard, has a transportation, communications and utilities land use designation.'",
        "'speaker_7': 'Looking at the existing character of the site, the building form in scale, primarily one storey tall, one storey warehouse and industrial buildings. The process to date these Map Amendment applications went to a combined hearing planning board on April 5th and received a recommendation of approval.'",
        "'speaker_7': 'They were discussed at the Land Use Transportation and Infrastructure Committee at April on April 25th, and are now here for your final consideration and a public hearing. For public outreach, there are quite a few RINO's that are active in the area.'",
        "'speaker_7': 'All have been notified of each of the meetings and hearings for this map amendment and we've received letters of support from four of the. Relevant Arnaud's. The site is is large. It's about 17 acres in many cases, according to Denver zoning code guidance.'",
        "'speaker_7': 'A general development plan would be required for such a site at the discretion of the manager of CPD, using a number of criteria of size being one of them over ten acres. And we are directed at CPD to determine whether a GTI GDP will be mandatory prior to going through a rezoning process like this.'",
        "'speaker_7': 'In this case, considering all relevant site specific circumstances, we have determined that a GDP is not necessary. Some of the relevant site specific circumstances include the fact that there is a metropolitan improvement district on in place on the site that was approved by council that will provide funding for infrastructure and ongoing maintenance.'",
        "'speaker_7': 'The applicant has also signed a development agreement with the city that specifies that they will provide 10% open space at a minimum in their development. And there are a number of specific criteria for the performance of that open space as there would be in a GDP.'",
        "'speaker_7': 'And so I'll walk through the the review criteria for considering this MAP amendment. First, a consistency with a number of adopted plans, starting with comprehensive plan 2000, which just provides some general citywide guidance about encouraging mixed use, transit oriented development, making use of transportation infrastructure where it exists.'",
        "'speaker_7': 'As is the case here, very near the 38th and bleak commuter rail station. And it also directs us to identify areas in which increased density and new uses are desirable and can be accommodated in part to take pressure off of other areas that where that might be less compatible.'",
        "'speaker_7': 'Blueprint Denver designates the site with a future land use concept of industrial. One of the things that says about that land use concept, though, is that we should consider converting such sites to mixed use, particularly when they're near transit and when they're in a position to buffer adjacent neighborhoods.'",
        "'speaker_7': 'The site is also designated as an area of change by Blueprint. Denver The Blueprint Denver Future Street classification for Brighton Boulevard as a mixed use arterial, which is intended to emphasize a variety of travel choices and to be located in areas that are intended to become high intensity, mixed use, commercial, retail and residential areas with substantial pedestrian'",
        "'speaker_7': 'activity. Also note that there's a map in Blueprint Denver that designates enhanced transit corridors and Brighton Boulevard. The section of Brighton Boulevard is shown as an enhanced transit corridor, which would be a corridor that's prioritized for enhanced bus service, including things like Priority SIGNALIZATION and that it's a priority corridor for pedestrian infrastructure.'",
        "'speaker_7': 'And we're certainly seeing implementation of that recommendation with the Brighton Boulevard reconstruction that's underway now. The River North Neighborhood Plan from 2003 designates the concept land use as transit oriented development, a move through these relatively quickly since there are so many relevant area plans.'",
        "'speaker_7': 'From 2009, the 30th and Blake Station Area Plan has a concept land use of mixed use employment, which is intended to include warehouses, incubator spaces and also residential space. It's in a sub area of that plan. This site, which is called the Brighton North Mixed Use Employment District, where the priorities are to maintain an employment base, improve'",
        "'speaker_7': 'the esthetics of the area and accommodate a greater mix of uses in the future. The 2015 Illyria and Swansea. A neighborhood plan designates the land use concept as industrial mixed use, which looks at exploring opportunities to transition land uses from industrial to industrial mixed use to better protect the neighborhood from heavy industrial uses, and also to invest'",
        "'speaker_7': 'in higher density housing services and employment opportunities near rail stations. Finally, last fall, City Council adopted the 38th and Blake Station area height amendments. This plan or these amendments amended those earlier plans that had been adopted for the area in part to clear up some confusion about how the plans overlapped in that area.'",
        "'speaker_7': 'And in some cases, particularly with building height made recommendations that were hard to interpret. And so these height amendments clarified the vision for height. As part of that process, though, and working with the neighborhood and local stakeholders, it actually became clear that there was quite a bit of support even for higher density, taller buildings in the area'",
        "'speaker_7': ', as long as that future development provided community benefits and incorporated appropriate transitions to lower scale neighborhoods. And it makes a very specific recommendations to adopt a regulatory approach that will ensure greater design quality throughout the neighborhood and help integrate affordable housing in to the neighborhood.'",
        "'speaker_7': 'This is a map from the adopted plan amendments clarifying the building heights and making future recommendations. So this map is a little bit unusual. The numbers on the map are the numbers that we're used to seeing. That's the clarification of what had previously been the policy for building heights in the area.'",
        "'speaker_7': 'And so the site here, it's the red dashed line. The recommendation there is for eight storeys. And then the way that that increased height that came out of the community vision was expressed is in the colors, which are called maximum incentive height.'",
        "'speaker_7': 'And so what the plan recommends is that it be possible to go to those taller heights in the future if specific rules are put into place about how you get there, specifically providing affordable housing as part of the development and then integrating higher design quality.'",
        "'speaker_7': 'And so Councilman Brooks is planning to sponsor zone district overlays that will implement those specific recommendations. And assuming those overlays are adopted, they'll apply to the site. Any development of the site that didn't have an approved site development plan by the time those were adopted would have to follow the the new rules.'",
        "'speaker_7': 'The applicants would, if those were adopted in the future, actually be able to go taller than the eight stories that they've requested by the system that would require them to provide additional affordable housing within the station area or within their development.'",
        "'speaker_7': 'So the remaining review criteria will first KPD staff find that the Knapp Amendment application is consistent with the adopted plans, and CBD staff also find that the proposed MAP amendment is consistent with uniformity of district regulations criteria. Because rezoning to the Max eight district will result in uniform application of zone, district, building, form, use and design regulations'",
        "'speaker_7': '. CPD staff also find that the proposed MAP Amendment will further the public health, health, safety and welfare of the community by implementing adopted community objectives through appropriate building heights, form standards in allowed uses, and also by facilitating a transition to a more varied mix of high intensity uses with expanded pedestrian connections, community planning and development staff find'",
        "'speaker_7': 'that changing conditions is an appropriate justifying circumstance for the MAP Amendment application. The area, of course, has changed a lot and will continue to change with the 38th complete commuter rail station, the completion of the Brighton Boulevard reconstruction and the all the work that of course will happen at the National Western Center to the north and CBD'",
        "'speaker_7': 'staff find that the proposed zone district is consistent with neighborhood context and district purpose and intent statements. The IMX districts are intended to develop in a pedestrian oriented pattern. Buildings up to the street in the Annex eight zone district specifically is noted by the Denver Zoning Code as being appropriate for areas served by primarily and collect primarily'",
        "'speaker_7': 'collector or arterial streets, as is the case here. CPD therefore recommends approval of the Map Amendment applications based on a finding that all review criteria have been met, and I'd be happy to answer any questions.'",
        "'speaker_4': 'Thank you, Abe. We have two speakers. I'll call them both Kevin McClintock and Jim Bischoff. So you both can make your way. Kevin, you can begin your remarks when you're at the podium.'",
        "'speaker_6': 'Hi. My name's Kevin McClintock with Westfield were the applicant for both both properties. And I'm happy to answer any questions you guys may have for us.'",
        "'speaker_4': 'Right. Taking our other questions out to all speakers, Jim Bishop.'",
        "'speaker_6': 'High Council members Jim Birkhoff.'",
        "'speaker_7': '3003 Larimer with Lars architecture. And I'm also here.'",
        "'speaker_6': 'To answer any questions you might.'",
        "'speaker_7': 'Have about.'",
        "'speaker_6': 'This zoning application. Thank you.'",
        "'speaker_4': 'Great. Thank you both. That concludes our speakers and councilmembers. It's now time for questions for either or both bills. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. Chair. My first question is asking Abe if this particular project and the one specifically on the east side that about the railroad tracks. If if the new form that has the check off box proximity to rail was even utilized when this application came in.'",
        "'speaker_8': 'We've had that new form for some time and I'm just curious about what. Number one, if that was checked off and if it was, what how was that addressed?'",
        "'speaker_7': 'Thank you, Councilman Ortega. I believe that form was used. The applicants may be able to say specifically, regardless of the use of the specific form. As you know, Mayor Hancock convened a team to address the issue of safety issues around freight rail in 2015, and the team issued a report that made specific recommendations regarding education and the'",
        "'speaker_7': 'need to both refer projects that had that adjacency to the to the railroad and to make sure that the applicants were aware of the report recommendations. And so right now, our development services project coordinators, who are who are the ones reviewing the actual project proposals on these sites, are working with applicants to follow the recommendations of that'",
        "'speaker_7': 'report. And Kevin, do you do you remember that specific form? Okay. So not sure if this.'",
        "'speaker_8': 'So I'd like to ask the applicant then. Given the fact that the parcel on the east side that does in fact abut railroad tracks and the concern has been specifically more about freight traffic on our rail lines that carry various types of hazardous materials and flammable liquid that could pose harm and risk to your tenants, whether they're'",
        "'speaker_8': 'going to be commercial tenants or a mix of commercial and residential tenants. This issue is something that we've been talking about for some time, and I would like to know, number one, what kind of conversations you're having with CPD around ensuring that protection of human life and property are part of that.'",
        "'speaker_8': 'Discussion.'",
        "'speaker_6': 'Yeah, I. When we purchased the property, we have existing buildings that sit on our eastern property border that serve as a protection. I mean, they're about 18 foot wall, no windows, no openings. There's some old dock doors that exist.'",
        "'speaker_8': 'But will they remain as part?'",
        "'speaker_6': 'And so when we had we had a deed restriction overlay with up over the property that we had to work with, up on a consensus that would provide safety to what we've developed in the future. And B, if we were to tear down those existing walls, what would happen?'",
        "'speaker_6': 'So if we tear down an existing wall that sits on our property, we're required to build a at least an eight foot wall that has certain specs that we've negotiated with up. That's a safety wall. We have deed restrictions against residential and hotel.'",
        "'speaker_6': 'So dwelling units that have to be a certain distance from the property line on the eastern border. So almost a third of our site that fronts the eastern side. We cannot have a residential dwelling unit. We cannot do schools, parks.'",
        "'speaker_6': 'There's there's certain restrictions that we can't do that basically would would put the public at harm's way, what we can do, our parking structures, other commercial uses. But we would have to adhere to the restrictions that we've worked with U.P. on regarding safety.'",
        "'speaker_6': 'And we've shared those with with the city and planning and then working with them based on those guidelines.'",
        "'speaker_8': 'So I'm really pleased to hear that you all are taking those precautions because I think you're the first actual applicant that, when I've been asking this question, actually has taken some steps or have already had those steps in place because of, as you're saying, there's a covenant on the property.'",
        "'speaker_8': 'Right. So let me move onto my next couple of questions. Given the fact that this is a 17 acre site, I heard a 10% commitment to open space. Is there an expectation that that would be open space that is maintained by the developer on the project?'",
        "'speaker_8': 'Or has there been discussion about turning that parcel over to the city to maintain at some point in time in the future?'",
        "'speaker_6': 'No, that'll be maintained by the the developer. We've got a metro district in place, a significant part of our public investments going to be plazas and open space and a combination thereof.'",
        "'speaker_8': 'And will that site also serve a dual purpose of also including your own storm drainage onsite.'",
        "'speaker_6': 'Do you know.'",
        "'speaker_3': 'How?'",
        "'speaker_8': 'Because we've been told anything over an acre has to provide their own onsite storm drainage. And so I'd like to hear what that what those discussions are including.'",
        "'speaker_7': 'I'll let Kevin add anything that he'd like to add about the specific review that they're in right now with development services about drainage. But I can't speak to the contents of the development agreement with regard to open space and drainage, which says that drainage areas can count as required open space if certain conditions are are met.'",
        "'speaker_7': 'And that is primarily that the drainage system itself has been completely under grounded and that the on the surface it's a publicly accessible, unimproved area. Do you have anything to add, Kevin about? Your drainage plan right now?'",
        "'speaker_6': 'You know, I think we're we're in design right now on what the drainage plan will be. But as it relates to what can be used as public space, there's there's real definitive requirements of what constitutes public space and accessible space that we've worked with the city on.'",
        "'speaker_6': 'And it'd be challenging to have our our detention serve really as the open space requirement. And truthfully, that is such a big part of what we're trying to accomplish with the project is the public space. That's a big part of why we went with the Metro District that, you know, I think we will have a minimum of'",
        "'speaker_6': 'ten. But we you know, that's not what we're shooting for necessarily.'",
        "'speaker_8': 'Do you have plans for any affordable housing on the site?'",
        "'speaker_6': 'We do. We are working with a group called Artspace that would provide something north of 100 units. There's somewhere between 100, 250 units. They have another Y with us. We've been working with them for about two years now.'",
        "'speaker_6': 'They are going to go through for their funding in January, but they've been actively working through that.'",
        "'speaker_8': 'Low tech funding. Pardon me, low income tax credits.'",
        "'speaker_6': 'So we've been working with them as being part of our initial phase for the project since it's been a little over a year, almost two years now.'",
        "'speaker_8': 'So. You're with Westfield. Can you just speak to a couple of other projects you've done in the Denver area?'",
        "'speaker_6': 'Yeah, we've we've been a we're basically a Denver based development company. I've been in Denver for 20 to 30 years. We've done a mix of projects, quite a few in Denver, but in other municipalities as well. We've been really heavy in office development over the years.'",
        "'speaker_6': 'The PRI, the largest office building we've done is at 18th, and Larimer, the Xcel building. In addition to that, we've got a mix of strategic infill sites similar to this site here. We've got a for sale condo project at the other end of the neighborhood under construction now that we purchased from D.H. and that's 100 for sale'",
        "'speaker_6': 'condos that are going to deliver here in the next year.'",
        "'speaker_8': 'So so I guess I'm asking that question because I was trying to. You know, get a feel for whether or not you plan to build on this site or zone it and turn around and sell it and have somebody else build on it.'",
        "'speaker_6': 'I mean, we're moving our office to the site on the east side. So this is something we plan to be involved with for a long time.'",
        "'speaker_8': 'All right. And I just have one last question, Mr. President, pro tem on page 20 of the PowerPoint, the map. I was trying to understand where on the map above you could maybe pull that up. To see where this particular site is in correlation to that particular map.'",
        "'speaker_7': 'Sure. And, you know, I apologize. This is a relatively complicated map. The. This is the map you're referring to. Yes, that's one. Yes. The site is here. Can you see that? Yeah. And so the height amendments, the adopted Hyde amendments designate that with an eight storey maximum base height and that orange color goes with a 12 storey'",
        "'speaker_7': 'maximum incentive height. And the planning amendments are very specific about map amendment applications and say that until specific tools are developed to allow for the incentive heights by requiring affordable housing and the higher design quality that it's only appropriate to request a rezoning to the maximum base height, which is eight storeys.'",
        "'speaker_7': 'And that's consistent with this request.'",
        "'speaker_8': 'Okay. So the I am x five. Was that done when the citywide rezoning happened or was that done at a later time?'",
        "'speaker_7': 'I believe it was in the 2010 rezoning.'",
        "'speaker_8': 'Okay. And so at that time, it was envisioned that generally five storeys in that area would be sufficient. And it looks like since then, the TOD site in particular is being identified for higher densities. Is that.'",
        "'speaker_7': 'That's correct. I would say that the vision over time, even over the last ten years, has been for greater and greater density. And I think partly, you know, from what I know about the previous planning conversations, it was partly that there.'",
        "'speaker_7': 'It was hard to imagine what could happen in this area. And now that everybody sees it beginning to happen, I think there's more excitement and it's more real and there's been a more real conversation about it. Certainly with the Hyde Amendment conversation last year about what really could happen.'",
        "'speaker_8': 'So along this quarter, what is the maximum height at this point, notwithstanding the discussion we just had about the potential for anybody that would be, you know, with the incentives for them to build higher.'",
        "'speaker_7': 'So you mean under existing zoning? What is the tallest entitlement along the corridor right now? There actually is an area that has existing entitlement that is not completely consistent with the the vision set forth on this map that has CMCs 12 zoning now.'",
        "'speaker_7': 'So that would be a 12 storey maximum height.'",
        "'speaker_8': 'Is that the old Tanaka property?'",
        "'speaker_7': 'No, actually, it's it's closer to the proposed map amendment site we're looking at tonight. I believe it's at approximately 36th and Brighton Boulevard there. There are several parcels that have 12 storey zoning.'",
        "'speaker_8': 'So the buildings are not there, but the zoning exists.'",
        "'speaker_7': 'Right. And I've done some research into that zoning and it looks like it's a transit translation of entitlement that goes quite a ways back. And so I wasn't able to trace it all the way back to the time when it was determined that those particular sites like the that the rezoning that allowed for that height there and'",
        "'speaker_7': 'it's just been carried forward and a series of rezoning since.'",
        "'speaker_8': 'Okay. I have no further questions. Thank you.'",
        "'speaker_4': 'Thank you. Councilwoman Ortega. Councilman Espinosa, you're.'",
        "'speaker_3': 'Probably in part where my colleague, Councilman Ortega, was going. There was some realization in looking during this presentation about one of my sort of concern, ongoing concerns about missed opportunity by granting an additional entitlement in supporting an additional entitlement through our zoning code.'",
        "'speaker_3': 'That said, I a I have I'm not trying to stymie what's going on here or anything like that, but I just want to have a real candid conversation with the developer about what they're proposing and in their thinking, because back in 2014, when the land was acquired, this map wasn't it was probably being discussed, but the height'",
        "'speaker_3': 'overlays and all that stuff weren't were probably probably factored into your acquisition decision making. I mean, there's a lot of other things that were going on Breton Boulevard redevelopment. So question for you, Kevin. Mr.. Mr.. McClintock. The. The.'",
        "'speaker_3': 'The current project that was discussed, what are the what's the total number of unit count? The total number of units that you think you're you're you're you're discussing right now.'",
        "'speaker_6': 'What exists out there today is 350,000 feet of vintage fifties warehouse.'",
        "'speaker_3': 'I know it's out there today. And what are you proposing with this?'",
        "'speaker_6': 'Part of our business plan is maintaining as much of the existing improvements as we can while mixing with with new construction as well. Part of what makes this part of Brighton Boulevard, specifically north of 38th, is different than what's happening south of 38th on Brighton Boulevard.'",
        "'speaker_6': 'This is truly an industrial corridor. Pepsi's across the street from US Fortrust Data Center is to our north. So turning our back to the industrial routes that we have on the site would would from our perspective be a mistake.'",
        "'speaker_6': 'We want to have a true mix of uses there. We want to ultimately end up with a package of amenities that not only are good for the project but serve the the neighborhoods as well. This is the largest assemblage, one of the largest assemblages outside the the urban core.'",
        "'speaker_6': 'And the opportunity to truly create a neighborhood exists at this site. And it's it's a responsibility we don't take lightly. And we've spent since our our acquisition and May of 14, with consultants like ours and others, an extensive amount of research in the neighborhood, what needs to exist.'",
        "'speaker_6': 'This is a project speaking to timing that isn't going to happen overnight. It's going to be a phased project. I think ultimately you'll start to see that those densities are warranted. They're not obviously all there today for the entirety of the site, but it is a it's an opportunity where you can take existing structures and this development'",
        "'speaker_6': 'cycle repurpose those. We think that after we get the infrastructure in, which is significant and that's why we had to have a metro district is a there's an opportunity to enhance the infrastructure that surrounded the site that would allow ultimately for the types of densities that the market will will support, I think, down the road.'",
        "'speaker_6': 'But again, this is this is going to be a this is a long term, long term project for us. When we purchased it in May of 14, the catalyst that we thought would drive development was National Western. And it will be a wonderful bookend for us on our project.'",
        "'speaker_6': 'But really with the 38th and Blake stop and with what the city is doing to Brighton Boulevard and their commitment to infrastructure, that's really what's sparking from our from our perspective, a lot of the development that's happening now on our end of Brighton Boulevard.'",
        "'speaker_6': 'So we've had to empty out a bunch of our existing tenants. We've got a couple that we hope to reintroduce to the project, but initially I think you're going to see a lot of the existing buildings repurposed and some new construction as as the market warrants.'",
        "'speaker_3': 'Okay. Let's take a different approach. You said that Artspace is looking at you know, you're partnering on a hundred units. Is that the entirety of the units that you've got, essentially, that you're even investigating and proposing? No, I.'",
        "'speaker_6': 'Think you know, I think ultimately, I mean, you can our metro district plan shows an ultimate what we think an ultimate build out could be. I think with art space, there are 100 to 150 units. I think from another residential perspective, we could support another 2 to 300.'",
        "'speaker_6': 'It'd be tough to get done in this cycle, but I think Art Spaces is a wonderful user for obviously their mission and what they can fulfill for the for the neighborhood. But it's also something that can get done in today's environment and today's capital constraints.'",
        "'speaker_6': 'So that'll be the initial residential piece. I think out of the 350,000 feet, we can keep about 100,000 feet that can be repurposed into retail or office. I think we'll have to wait till the market allows for some of the new construction we have planned.'",
        "'speaker_6': 'But, you know, I think ultimately we could have a million square feet of office on this site with the eight story zoning would allow for that. It would allow for about another 200,000 feet of retail ultimately, too.'",
        "'speaker_3': 'Perfect. Because you just answered essentially where our next question was. I still want to have couple more questions for you. But Abe, can you bring up that slide 20? Just so it's in the background. So the development rights the difference between AM three and what are we going to again.'",
        "'speaker_6': 'A five day.'",
        "'speaker_3': 'That is CMCs eight or I don't want to close. Well, I guess I have it up here now. So let me get IMX eight is only three additional stories and some additional feet in height. Significant feet in height actually.'",
        "'speaker_3': 'But. So. The. So there's not a big change. I mean, you probably could have easily developed IMX five comfortably certainly do. All you're talking about with repurposing the existing industrial buildings and adding some some additional residential probably not to the same density.'",
        "'speaker_3': 'You know, so we put in these height incentives, essentially hoping that somebody would take them, take advantage of them. But what you're talking about in the long term build out is comfortably captured in eight stories. Is that correct?'",
        "'speaker_6': 'The reason IMAX stops at eight. If we were to go to 12 stories, we could go to see IMAX. If you go from IMAX to see them, actually, you lose a lot of flexibility on industrial uses, which is a, you know, the soul of the neighborhood.'",
        "'speaker_6': 'So know we want to we want to cherish those uses and maintain the ability to have those uses. Artspace is planning an eight storey building. I mean, eight storeys is what they need to fulfill their program. So we think we've addressed a preserving the existing uses, but also B with eight stories.'",
        "'speaker_6': 'We're able to accommodate groups like Art Space. In a sense.'",
        "'speaker_3': 'The sort of genuine candor part that I'm looking for is because I do I appreciate and I recognize that IMAX is our most versatile, right. Zoning code. I mean, zone district, you know, it captures industrial, it captures residential, it captures commercial, it captures everything.'",
        "'speaker_3': 'And so it's pretty creative. And I appreciate everything that you're speaking to because that's you know, if you know me on council, that's sort of music to my ears as far as adaptive reuse and sort of letting a building or project sort of play itself out over time and not just wholesale scrape and replace with something that'",
        "'speaker_3': 'is alien. That said, one of the things that was, was that I was sort of coming to terms with once this slide went up, is the fact that the other portion of the parcel is I IAEA, which has fairly limited redevelopment opportunity the way I am X does.'",
        "'speaker_3': 'And you know, Abe, can you tell me what is the number of floors allowed in AIA in the height, maximum height.'",
        "'speaker_7': 'Yes, Councilman, there actually is no maximum height limit in the industrial purely industrial zone districts. There's a maximum floor area ratio of 2.0.'",
        "'speaker_3': 'But no residential component.'",
        "'speaker_7': 'And no residential uses.'",
        "'speaker_3': 'So one of the things that I missed when we did these height amendments was the large tracts of of of areas here that don't have eight storey entitlement that when we did those Max Heights, we now put we codified and it's consistent with plans.'",
        "'speaker_3': 'I get that the sort of latitude to to go up and not and go up to eight storeys, which is a sweet spot on the development scale. And and it's going to be very difficult for us to see people take advantage of that height incentive to go to 12 because that last four storeys is an expensive four'",
        "'speaker_3': 'storeys to add. Whereas if we had gone to IMX three or even IMX five and I am and given them eight story IMAX eight incentive, I think you'd see a lot more people sort of voluntarily complying between the linkage fee and whatnot.'",
        "'speaker_3': 'And so that's actually a question I have for you, Mr. Quinn McClinton. Do you actually again, I'm not trying to put you back in there. I want a real candid response from somebody who does this for a living.'",
        "'speaker_3': 'Right. If the city was trying to encourage private developers to come to. Take advantage of the incentive. Was the eight storey base zoning sufficient incentive? I mean, is 12 story going from 8 to 12 a sufficient incentive that that or would it was there actually a lower sweet spot that would have made more sense for to get'",
        "'speaker_3': 'private developers on board?'",
        "'speaker_6': 'From a cost perspective, if you're looking at a residential building, for example, apartments you see or five stories, once you go over five, you can't use that construction. And so there's an incremental cost to get to eight. There isn't a necessarily an incremental cost to go from 8 to 12.'",
        "'speaker_3': 'Okay.'",
        "'speaker_6': 'Obviously, where land values are in that neighborhood, you're going to see folks going to 12 stories there. I think from my my perspective, I think the city and the neighborhoods is doing the right thing, incentivizing with affordable housing and street activation and the other elements that a developer would be required to do to go to 12.'",
        "'speaker_6': 'I mean, we're not required to even have the affordable housing component within our plan at all. It's it's something that's right to do there. Wonderful fit for our project. And that's why we're committed to work with them on it.'",
        "'speaker_6': 'We're not doing it to go from five our existing 5 to 8 where costs are in today's environment, we need the incremental density when the market warrants it to support our project. Costs are really what's driving where both land, but then construction costs are driving where folks need to go on their densities to make their projects, you'",
        "'speaker_6': 'know, viable.'",
        "'speaker_3': 'So actually so sort of what I was talking about is in there, right, which is if there was an AM X three zone district, which, you know, you could still do a 75 foot building with mezzanine and five stories for all intents and purposes.'",
        "'speaker_3': 'But if you were somehow limited to three stories and you could go to five, that's an easy sort of leap for a developer to go with from 3 to 5 in. But now what we're talking about with like tech tax credits and things like that to go from 5 to 8 and do it affordably.'",
        "'speaker_3': 'I mean, to make your numbers work, it's you're now asking for a third party to go get tax money. I mean, tax credits to to not even take advantage of the maximum height number of stories we're allowing, but the maximum to date, which is the eight.'",
        "'speaker_3': 'You know, I mean.'",
        "'speaker_6': 'For art space, specifically, they make their program work with 100 units. So the way they're building lays out it's it fits in eight stories. That's what they're doing around the country. Yeah. So I couldn't speak to others. I think if you if you had three stories zoning in place, people couldn't do residential.'",
        "'speaker_6': 'I mean, you just can't make residential work in three stories. And you don't want you don't want if you want a mixed use project in a great, you know, viable commuter rail stop, you're going to need residential.'",
        "'speaker_3': 'Trust me, I wish that were the case because I've said it before, that West End project over there, North, you know, on Route Rock, Mount Square across from the corner of Oak Park is two stories on top of on top of a tuck under parking, you know, in a sea of X 20 zone district.'",
        "'speaker_3': 'And it drives me crazy, but. So. Okay. I appreciate that. I just. I didn't realize. The difficulty that I had with Slide 20 during this presentation was, is, is that going to aid is not much of incentive for that vast of an area.'",
        "'speaker_3': 'Eventually, yes, you're I think you're right that the city's making enough investment. If the if we come along with additional investment into your projects and others to compel affordable housing and make it worthwhile to go above those, we'll start to see those come up.'",
        "'speaker_3': 'But, you know, getting voluntary. The developers to voluntarily do affordability. You know wasn't that that's this incentive doesn't get us there it's still additional public money in public investment that's going to compel people to sort of take advantage of those incentives today anyway.'",
        "'speaker_3': 'Hopefully the market changes and continues to improve the way it does. So thank you very much for your candor. I really appreciate it. Thank you. Thank you.'",
        "'speaker_4': 'Thank you, Councilman. That's another. See no other questions. Public hearing on accountability for 35 and for 36 is now closed. Comments on either or both. Bills from council. I feel as if we kind of bled a little into that.'",
        "'speaker_4': 'Councilman Cashman. Europe, sir. Thank you, Mr. President. I just wanted to thank the.'",
        "'speaker_6': 'Developer for.'",
        "'speaker_4': 'Taking a fairly aggressive stance.'",
        "'speaker_6': 'At contributing to the needs for affordable.'",
        "'speaker_4': 'Housing in Denver. I'm really.'",
        "'speaker_6': 'Excited about our space and will look.'",
        "'speaker_4': 'Forward to seeing this.'",
        "'speaker_6': 'Build out.'",
        "'speaker_4': 'Thank you very much. Thank you. Councilman Cashman. Councilman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. Pro tem. So this used to be part of my district, and when I left city council in 2003, that just shows you how fast. When Blueprint Denver was adopted, this was envisioned to be the new growth area for the city.'",
        "'speaker_8': 'And to see how quickly that development has taken place is just it's it's amazing. It's moved way faster than the central the build out of the Central Platte Valley was built out. So I just also want to give my extend my appreciation to the developer, number one, for doing the rezoning and actually planning to build on the'",
        "'speaker_8': 'site. We've had a number of developers who come in. They do the request for the rezoning and they turn around and flip the land. And then when we start talking about trying to get affordable housing, we just screwed ourselves by not really figuring out how to make sure that we're we're truly doing that and utilizing the incentive'",
        "'speaker_8': 'for the significant increase in in densities that we've been doing in various locations. So to to hear your commitment to, number one, addressing proximity to rail. I appreciate that. And your commitment to addressing affordability is so important to this city and to the people who actually made the Reno corridor, what it was that begin to attract the'",
        "'speaker_8': 'investment. Besides the city investment, obviously, which was really important for for everybody, I mean, it's kind of what we did in the valley where the city took the viaducts down, you know, put the access at the floor of the valley, built the parks, and then the developers came and started started building.'",
        "'speaker_8': 'So I think this is going to be a good project and just appreciate all your efforts. Thank you.'",
        "'speaker_4': 'Thank you. Councilwoman Ortega, in the comments, 435 or 436. CNN just reminded our council members who are going to vote on both bills separately. Currently, we have 435 on the floor. Once that is voted on, I'll ask Councilman Cashman to put forth 36 and we will vote on that separately.'",
        "'speaker_4': 'All right. First vote is on 435. So you know the comments, Madam Secretary. Roll call.'",
        "'speaker_2': 'Black, I. Espinosa. Hi. Flynn, I. Gilmore, I. Cashman.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Lopez New Ortega. Susman Mr. President.'",
        "'speaker_4': 'I am secretary. Please close the voting results.'",
        "'speaker_2': 'Uh. Let's see.'",
        "'speaker_4': 'He was missing mine. Uh.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'There we go.'",
        "'speaker_2': 'Ten Eyes.'",
        "'speaker_4': 'Ten eyes for 35 has passed. Councilman Cashman said We please put council bill for 36 on the floor for final consideration and do pass. Yes, Mr. President, I move that council bill 436 be placed upon final consideration and do pass.'"
    ]
}