{
    "A MOTION supporting the expansion of the Social Security and Medicare programs and benefits and the elimination of the cap on earnings that are subject to the Social Security payroll tax, and directing the council clerk to distribute this motion to Washington's congressional delegation.": [
        "'speaker_0': 'Okay. All right, then. We won't start with you then. All right. Always interesting. Okay, then I guess we will have to start. And no, they don't have their panel here at all, so. Okay. So what we will do then is we will have to start then with item number five and that will be proposed motion 2016 0439'",
        "'speaker_0': '. And this is a briefing today on a motion supporting the expansion of Social Security and Medicaid programs and benefits. And so, Mr. Nicholson, if you'd like to begin the briefing, that would be great.'",
        "'speaker_2': 'Thank you, Madam Chair. And members of the council. First time presenting in front of you. So looking forward to it.'",
        "'speaker_0': 'Excellent. We won't be painful as possible.'",
        "'speaker_2': 'I appreciate.'",
        "'speaker_3': 'That.'",
        "'speaker_0': 'I mean, pain. Life, not pain. You didn't catch that either way. Thank you.'",
        "'speaker_2': 'So the proposed motion in 2016, dash 0439 would add four items related.'",
        "'speaker_4': 'To Social.'",
        "'speaker_2': 'Security and Medicare programs to King County's 2017 federal legislative agenda. Specifically would add to the agenda that Social Security benefits should be expanded to address the financial insecurity among among present and future recipients, and that this expansion of benefits should be paid for by eliminating the cap on earnings subject to the Social Security payroll tax.'",
        "'speaker_2': 'That cap right now is at $118,500. Employers and employees each.'",
        "'speaker_5': 'Pay.'",
        "'speaker_2': '6.2% of their salary up to that cap. The motion proposed motion would also state that the Medicare program eligibility should be expanded to include younger people, and that benefits should be expanded to include comprehensive dental vision and hearing coverage, and that this expansion should be funded by raising the Medicare payroll tax.'",
        "'speaker_2': 'That tax rate is currently 1.4 or 5% of all covered wages, and it's paid by the employee and the employer. And that's really what this proposed motion does. I know there's a panel here to further discuss the issue and answer questions.'",
        "'speaker_0': 'Remind me again. So it's 1.4 or five. Is that matched or is that split?'",
        "'speaker_2': 'The employer each pays it. So the employee pays 1.4 or 5% and as does the employer.'",
        "'speaker_0': 'Okay, great. All right. That sounds like a given. You survived and did a nice job. So welcome to presenting. Okay. If the panel would like to come up. I know we have several people. The president of the Puget Sound Advocates for Retirement Action, Mr. Ravi Stern, policy director, Economic Opportunity Institute, Dr. Marilyn Watkins, and somebody from the'",
        "'speaker_0': 'Washington Community Action Network. And I'll let you pronounce your name when you speak. That would be great. All right. Would you like to begin?'",
        "'speaker_1': 'Yes, I will. Thank you very much for hearing us this morning. My name is Marilyn Watkins. I'm the policy director of the Economic Opportunity Institute. And this is Social Security is one of the issues that I've worked on in that capacity for the last 17 years now.'",
        "'speaker_1': 'So, first of all, the Social Security and Medicare programs are vitally important to everyone here in our country and including here in King County. 22% of Kane County households receive Social Security income, according to the most recent American Community Survey data.'",
        "'speaker_1': 'And that income that people receive, it totals nearly $5 billion a year that comes into King County's economy because of Social Security benefits. We typically think of Social Security as a retirement program, but I want to share actually my own story to illustrate that this is something that's really important to people of all ages.'",
        "'speaker_1': 'Nearly 20 years ago now, when my children were nine and 11 years old, my husband dropped out one day of a heart attack. I was working part time, as many women do at that time, and so we were, even though we were a middle class family, financially secure in many ways, we were very much dependent on my'",
        "'speaker_1': 'husband's income. And from the very beginning, within a couple of weeks, Social Security benefits where survivor's benefits were flowing into my checking account. And every single month until my younger son turned 18, we received a Social Security check every month from the government.'",
        "'speaker_1': 'That was just hugely important to maintaining economic security, allowing me to keep our house, keep a functioning car, keep two growing boys and sneakers without holes and pants that weren't too short for them. It just made a huge difference for us, even as a middle class family.'",
        "'speaker_1': 'And it's something that that really impacts everybody. Every day, 15,000 children here in King County receive Social Security benefits directly. And the estimate is that twice that number of kids are actually benefiting from Social Security because they live in a household with somebody who's receiving Social Security benefits.'",
        "'speaker_1': 'So this is something that really spans the lifespan in terms of its importance to our economy. But as good as Social Security is, as important as it is to everybody's economic security, we could make it so much better.'",
        "'speaker_1': 'Almost every you know, every few years until the last couple of decades, we've actually tweaked and improved and expanded Social Security. And it's time to do that again for our changing economy to make life more secure for people thanks to Social Security and Medicare.'",
        "'speaker_1': 'Seniors as a group have the lowest levels of poverty of any major demographic group in our community. But very many live right above that poverty level. The percentage of people living between poverty and 150% or 200% of poverty really still struggling to meet the basics is really high.'",
        "'speaker_1': 'And of course, many people's medical bills and other expenses actually go up as they get older. So it's time to scrap that cap on the Social Security payroll premium, let everyone pay equitably into the system. And that would really provide us with the with the resources to expand the program, to expand benefits, especially for women of all'",
        "'speaker_1': 'races and men of color who historically and still today make less money for all sorts of reasons than than do white men. And we see the highest levels of poverty and near poverty among very elderly women who are widowed or single in other ways, who really, really struggle to cover the basics.'",
        "'speaker_1': 'And we could make life a lot better for them by expanding benefits. And I'll turn it over to my colleague. So she now. Hi, my name is Sochi Markovich, and I'm an organizer with Washington Community Action Network. I know my name's a hard one to say.'",
        "'speaker_1': 'So thank you. So we're a grassroots organization and we have 40,000 members throughout the state. And we strongly support expanding and strengthening Social Security because we view it as a racial, economic and gender justice issue. So for women, I think I'll talk about women first.'",
        "'speaker_1': 'So women not only are paid less than their male counterparts, they are often the caregivers for their family members. And I'll just talk about my mom as an example. So I have an older brother who has special needs and my because of the expense of like finding specialty care, my mom has stayed at home with him and'",
        "'speaker_1': 'has like maybe two years of work history, which is not enough to qualify for Social Security. And so she will not get any Social Security whenever she gets older. And she has to rely on my father for for that economic security.'",
        "'speaker_1': 'And having that dynamic is really problematic because, one, I think that leads to many women staying in unsafe. And luckily, my parents are not in this category, but there are women out there who stay in unsafe relationships because for that economic security, especially when you're older and if we had something like a caregiver credit, which would recognize'",
        "'speaker_1': 'the work that women do as caregivers and and count that time towards Social Security so that they could get Social Security, that is a will help. So so so many women in our not only our country, but in our state.'",
        "'speaker_1': 'And then I think as far as racial justice goes, Marilyn was touching on this. People of color are disproportionately impacted by poverty, lower wages and not having pensions. And so they are disproportionately reliant on Social Security. But the average payment you get a month is about, I think, 1300 dollars.'",
        "'speaker_1': 'And if talking about King County in particular, when you look at things like rent it, it doesn't match up with the actual costs that people face. So the last study I started is from Zillow. Rent in the Seattle is about $2,000 a month on average.'",
        "'speaker_1': 'And if your Social Security payment is 3000 dollars, there's no way you can really. Find a place to pay that rent with just your Social Security. And I know that a lot of people have this idea that renters are just young folks.'",
        "'speaker_1': 'But if you look at the communities of color within King County, 70% of African-Americans are renters. And so there are many, many seniors, as well as people on disability who are renters and are, you know, at the whim of the ridiculous housing cost in the city.'",
        "'speaker_1': 'And Social Security is not keeping up with those costs. And health care is also getting more expensive, especially for people as they get older. And so it's really important to make sure Social Security actually keeps up with the cost that people face.'",
        "'speaker_1': 'And so if we scrap the cap and people are equitably paying into the Social Security fund, then we're going to be able to expand Social Security to help fill these gaps that women and people of color face.'",
        "'speaker_3': 'Thank you. My name is Ravi Sternum, president of Puget Sound Advocates for Retirement Action. We're an organization of some 1200 members. We're multigenerational. We take as our primary role trying to make it possible for everyone in our society when they reach the years that they are, should be able to have a decent retirement, that they're able to'",
        "'speaker_3': 'have retirement with dignity, respect and some economic security. Just in the last two days, it was rather incredible yesterday. And then again this morning, I got emails from news services, one from Bloomberg and the other from one called Just Bread that talked about what we are facing in terms of the retirement crisis.'",
        "'speaker_3': 'It's estimated that our retirement deficit is $7.7 trillion. That, as most of us remember, when we were coming up, we were told that being able to have retirement was a three legged stool and the three legs were Social Security, a pension and savings.'",
        "'speaker_3': 'And the reality is at this point that we have a one legged stool or a defined benefit. Pensions have become smaller. The percentage of people that have it now are smaller and smaller. We have a growing population that depends on Social Security for 90% or more of their income.'",
        "'speaker_3': 'So what does that mean? Well, there's something going on called the age wave where you have this huge population that's moving from being baby boomers. And I think that's probably where most of you are into their retirement years.'",
        "'speaker_3': 'And what we have is we have this huge deficit and we have a Social Security system that's going to become more and more critical for our ability to be able to have retirement with dignity, respect and Medicare, which is also absolutely essential for seniors and people with disability to be able to live with dignity and respect.'",
        "'speaker_3': 'Medicare fails to fund vision, dental and hearing. There are emergencies that can be funded through Medicare, but basically for anything that is basic, dealing with your your teeth, your hearing or your eyes, you have to come out of pocket.'",
        "'speaker_3': 'Social Security, the average benefit is 1300 dollars a year. So we're looking at a situation where senior poverty is going to become more and more a reality in our lives, and we have to deal with it. We're coming to you with this resolution because you are influential and what you say matters.'",
        "'speaker_3': 'And if you say, listen, we recognize in the county that we have jurisdiction over, we have a crisis that's creeping up on us and one only needs to go outside. I got the statistics from the downtown emergency center in Seattle.'",
        "'speaker_3': 'And over the last nine years, the age of the people that they're serving over the last nine years has gone up by ten years. The age that the face of poverty is growing older and older, the face of poverty is more and more women and people of color.'",
        "'speaker_3': 'And we have to have a response to that. And you can help influence that with this resolution. What we're asking you to do in this resolution, as Mack said, is we're asking you to say that King County is in favor of expanding these programs with Social Security.'",
        "'speaker_3': 'It's just an equity issue. As as was said, the cap is $118,500. What that means is that someone who's earning $1,000,000, whereas we are paying 6.2% or we're paying 6.2%. Someone who's earning $1,000,000 is paying point 1/10 of 1%.'",
        "'speaker_3': 'They're done paying into Social Security after the first couple of weeks of the year. It's crazy. We need to have an equitable system that, in fact, provides the kind of Social Security system that we're going to need. What it does do, according to the chief actuary of the Social Security trust fund, is it means that Social Security'",
        "'speaker_3': 'will be able to pay full benefits for the next 57 years. 57 years is an actuarial lifetime. So we need we need to take that step with Medicare. We need to make sure that it covers the essential services that seniors need, including dental vision and hearing.'",
        "'speaker_3': 'We can do that by raising the social I mean the Medicare payroll tax from 1.4 or 5% to 2%, which would raise $90 billion annually, which would cover the cost of vision, dental and hearing. That would be the equivalent of $0.08 an hour for someone earning $15 an hour.'",
        "'speaker_3': 'So we're asking you to pass on to the full council this motion that will provide for the council going on record supporting the expansion of these two vital programs and having your federal legislative agenda reflect that, and letting our congressional delegation know that you're on board with this movement that is happening across the country at this point'",
        "'speaker_3': '. And we'd be happy to answer any questions you might have.'",
        "'speaker_1': 'And I just also want to say, I realize I forgot to mention this, is that as a young person who was in college during the recession, we don't have a whole lot of faith in IRAs and borrowing case to really be there for us in 40 years.'",
        "'speaker_1': 'And I don't really know anyone my age who has a pension. And so for people in my age group, we know that Social Security is like the only thing we can really depend on in retirement.'",
        "'speaker_3': 'Just how old are you?'",
        "'speaker_1': 'So I'm 26.'",
        "'speaker_2': 'Example, Robbie.'",
        "'speaker_3': 'Someone might ask you the same question if you want to.'",
        "'speaker_0': 'That's great. I do hope, though, that people your age will start looking at what are some of the funding mechanisms that they can have, because as I said, it is a three legged stool. So hopefully saving a little bit.'",
        "'speaker_0': 'And I know even with my grandchildren, I decided to put a little bit away every month and a 529 account for their education when they first start. This is so little, it's not going to make any difference. And now, five years later, I'm looking at them somehow going, Oh, my gosh, this pays for your college.'",
        "'speaker_0': 'And it was painless for me because it was such a little amount. So it was it was good to be able to do that. Councilmember Coble.'",
        "'speaker_6': 'Thank you, Madam Chair. Well, Rob is eloquent as ever. That was very, very moving. And also Sochi and Maryland, just really compelling testimony. Thank you for bringing this to us. I, I don't know if you're aware of another mechanism.'",
        "'speaker_6': 'That we have in the current year. We may have yesterday in the Health, Housing and Human Services Committee, we gave a do pass recommendation and this will be going to the full council pertaining to the Veterans Human Services Levy, which is currently operating and which likely will go on the ballot next August or November.'",
        "'speaker_6': 'And in a motion that we passed out of the committee yesterday, we directed the executive, the county executive to come back with the report in January with an assessment of how well this Levy's been doing and what might be some areas to expand it, including older adults.'",
        "'speaker_6': 'This would be services for older adults. So you might want to become engaged in this effort as well. There'll be community conversations going on later. That's starting next week and into October. So it's just a suggestion.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember at the Grove.'",
        "'speaker_3': 'Thank you, Madam Chair. A comment and a question and I have no comment. So she made about young people trying to say something that resonates with the experience I've seen with even college educated folks coming out of school now trying to get employment that covers one the cost of their student debt, plus being able to afford to'",
        "'speaker_3': 'live. I know a lot of folks who even tucking that little bit away, they're already making choices between being able to afford their bus fare or food or medicine. And so it heck, we make Bankers County Council. I'm having trouble putting money away, but but I have no excuse.'",
        "'speaker_3': 'But I just want young people in particular now. And I think student debt is a factor in that to having to make choices among basic needs and not having that ability to put something into savings. That was one of the things I like is, you know, it's the classic line for the movie you had me at.'",
        "'speaker_3': 'Hello. But one of the things I enjoy is hearing effective spokespeople articulate issues, and it helps me be a better advocate. And along those lines, I'm wondering if you can help me answer. One of the most common questions or the pushback comes from, you know, increase in the payroll tax or Medicare.'",
        "'speaker_3': 'Yikes. You're piling on working people. So what what do I say to someone who who says that that creates an economic burden on people who may be stretched already making lower wages?'",
        "'speaker_1': 'Well, you know, I think we have a lot of evidence of all kinds that social insurance, including Social Security and Medicare, has been one of the most effective things we've ever done together as a country. And it actually, as our economy continues to change and evolve and as people actually, you know, unlike when Social Security was founded'",
        "'speaker_1': ', people don't get out of high school and get a job and stay in that job for their whole career. People move around a lot. When I get resumes of young people applying for jobs, they often have changed every year or two.'",
        "'speaker_1': 'And and that's just increasingly common. But I mean, employers aren't don't have loyalty to their employees. And employees really do need to move around a lot as well. And actually, a social insurance program like Medicaid and Medicare and Social Security follows people around.'",
        "'speaker_1': 'So you actually continue to be able to have those benefits as you move from job to job to job. That's that's a really important thing. These amounts that we're putting into these programs are very low. And one of the keys to our to this proposal is actually making the system a whole lot more equitable by we years'",
        "'speaker_1': 'ago scrapped the cap on Medicare, but we still have that cap on Medicaid and as we've seen inequality and increase in our increase in our society. And it's really particularly evident here in King County that the growing income inequality where you have the top one and 10% actually doing really, really well on everyone else is not even'",
        "'speaker_1': 'keeping pace with inflation in terms of their income. This is one of the things that we can do that is really going to help everybody survive and thrive together because our whole economy does better when when individuals have the economic resources at every level in order to just go out and spend for those basics that are going'",
        "'speaker_1': 'to really keep themselves and their families healthy.'",
        "'speaker_3': 'I just would want to add, I mean, clearly, your question relates to the payroll tax on Medicare, not on Social Security, because we're not taxing anyone who can't afford it. So we we we were asked that question before.'",
        "'speaker_3': 'And as I said, it's $0.08 an hour or it comes down to three. $3.20 for a $15 wage. $3.20 a week, or what comes to around $14 a month. So it is a weighing question because people are I know I'm not going to say that it's not it's a weighing question.'",
        "'speaker_3': 'And so it is a question of how do you weigh off those same young people not being able to access that, not being able to take care of themselves, their hearing, their vision, their their dental work when they get older against what will be a small amount, but nevertheless an amount that they would pay out.'",
        "'speaker_3': 'And I just think that it's a matter of values there. That's right.'",
        "'speaker_0': 'Okay. Thank you very much for your presentation. We appreciate it.'",
        "'speaker_1': 'And for allowing.'",
        "'speaker_3': 'Us to make the president.'",
        "'speaker_1': 'I have a report that we've prepared on Social Security. I'd like to.'",
        "'speaker_0': 'Create five for you. Thank you. Okay. And with that, we're going to move down to number eight. Our briefing 2006, briefing 155. This is the maritime and recreational boat industry impact. And if you would like to come on up, we will go straight to your presentation.'"
    ]
}