{
    "AN ORDINANCE proposing to amend the King County Charter to utilize ranked-choice voting for the election of county officers, including the King County executive, the King County assessor, the King County director of elections, the King County councilmembers and the King County prosecuting attorney, effective January 1 following the council's adoption of an ordinance approving protocols for ranked-choice voting; amending Section 610 of the King County Charter; and submitting the same to the voters of the county for their ratification or rejection at a special election to be held in conjunction with the November 2, 2021, general election.": [
        "'speaker_0': 'This takes the item seven. Our final agenda item is an initial discussion of an ordinance that would place a charter amendment on the November ballot. This amendment would change the charter to utilize ranked choice voting for the election of county officers.'",
        "'speaker_0': 'Randy Luskin of Council Central Staff is here to give us an overview of the legislation. Ms.. Luskin, please go ahead.'",
        "'speaker_1': 'Thank you, Mr. Chair. Good morning. Members of the Committee for the Record, Randall scanning with council staff. I'll begin by noting that a copy of the full text of the proposed ordinance was emailed to members yesterday morning at 11:59 a.m. on Next Notes b as the chair of the committee noted, and the scope for today's briefing will'",
        "'speaker_1': 'be to Orient Committee members to the language of the proposed ordinance, and also to provide a few notes regarding process. I will note that staff analysis is ongoing and a full written staff report will be included in the packet materials for your next committee meeting, I believe, on July the seventh, as well as any follow up from'",
        "'speaker_1': 'any questions from today's meeting. So with that, I will begin by noting that the proposed ordinance before you would propose to amend the King County Charter, specifically Section 610, and to utilized ranked choice voting for the election of county officers.'",
        "'speaker_1': 'This would be effective against subject to voter approval and would be effective January 1st following the council's adoption of an ordinance that would approve protocols for ranked choice voting. If the Council were to propose to adopt the proposed ordinance, this proposed charter amendment would go to the voters on the November ballot.'",
        "'speaker_1': 'So with that, I'll go ahead and walk through the proposed changes in the ordinance. So as I mentioned, the proposed ordinance would utilize ranked choice voting for the election of county officers, including the county executive, the county assessor, the director of elections, King County Council members, as well as the King County prosecuting attorney.'",
        "'speaker_1': 'And again, subject to voter approval of the proposed amendment. This would take effect January 1st following council's adoption of an ordinance approving protocols for ranked choice voting. And the general premise would be that ranked choice voting would give voters the option of ranking candidates in order of preference and that the voting would be conducted in rounds.'",
        "'speaker_1': 'So in each round, each voter's ballot would count as a single vote for whichever continuing candidate. The voter has ranked third the highest. And then in each round, the candidate with the fewest votes would be eliminated. And then the eliminated candidates and votes would be redistributed to the next ranked continuing candidate until one candidate would receive a'",
        "'speaker_1': 'majority of votes, and then the candidate would be deemed elected at the time of certification. I'll note that in the proposed ordinance there is a provision that if at the end of the candidate filing period, there were only two candidates that filed for an office that the election for that office would be would there be a choice'",
        "'speaker_1': ', essentially? So it could be conducted by either ranked choice voting or in accordance with general laws governing nonpartisan county offices. I will note that the proposed ordinance is silent in terms of who would make that decision. That's a policy choice for this council as to whether that would be addressed in the protocols ordinance that council would be'",
        "'speaker_1': 'required to adopt, or if council would prefer to address that in this proposed ordinance. Lastly, note that when ranked choice voting would be conducted per the proposed ordinance, there wouldn't be a primary for the impacted offices and all of those qualified candidates would appear directly on the general election ballot.'",
        "'speaker_1': 'So those that's an overall high level overview of the proposed ordinance language. Just I'll wrap up by noting a few notes on process. So this item was introduced and referred to this committee at yesterday's council meeting. As I mentioned, if the Council were to approve this proposed ordinance, the proposed charter amendment would be placed.'",
        "'speaker_1': 'On the November ballot. As such, the last regular council meeting for action on this item as a non emergency would be the July 20th meeting of the full council. Mr. Chair, that concludes my remarks for today.'",
        "'speaker_0': 'Thank you much. As the prime sponsor. I'll ask council members hello if he has any comments to begin.'",
        "'speaker_2': 'Thank you so much, Mr. Chair. We all share the goal of creating a more fair, just and multiracial democracy. And this requires that we address not only who can vote, but how we vote. Right now, we have an either or electoral system, a winner take all system, where voters are limited to choosing just one candidate.'",
        "'speaker_2': 'And too often, candidates win, even though a majority of voters chose someone else. The winner take all system that we have right now is at the heart of so many political problems. It creates negative partizanship and polarization where the different sides and the different candidates and their supporters attack each other in hopes of becoming the one candidate'",
        "'speaker_2': 'who's elected. Instead of pitting communities against each other, though in zero sum elections, ranked choice voting allows like minded communities to vote together as coalitions. And furthermore, winner take all elections also incentivizes people to vote for who they think will win rather than the candidate who reflects their values.'",
        "'speaker_2': 'So ranked choice voting provides greater electoral access that creates more equitable results, and it can even save money by combining the primary and general elections into one. This all would bring us one step closer to that multiracial, fair and just democracy that we described at the beginning.'",
        "'speaker_2': 'And lastly, I just want to say, for those who are still not certain about this legislation, I just want to emphasize two things that Miranda already shared that may give you a little bit more is, number one, we're putting something on the November ballot.'",
        "'speaker_2': 'So ultimately it will be the public that decides what kind of voting they want. If they want ranked choice voting, we can move in that direction. If they say no, then we won't. The other thing that I wanted to add to maybe put you at ease is this ordinance is permitted.'",
        "'speaker_2': 'It does not obligate us to immediately adopt ranked choice voting, for example. The plan would be if the voters approve this change to our charter in November, then we could all come together and work on an ordinance that lays out the details, that hammers out the timeline, the technology, the getting state level permission for the technology, getting'",
        "'speaker_2': 'all of our buy in and ducks in in order from our wonderful elections director Julie Wise and her team. So this is number one adopted by the public. Number two, a permissive ordinance that would allow us to get our ducks in a row later down the line.'",
        "'speaker_2': 'But the clock is ticking since November is coming up fast. And our our timeline for putting something on the ballot is coming up soon. So I urge everyone's support. I know we're not voting today, but we will have time to work through this, think through this and ask all our questions.'",
        "'speaker_2': 'Finally, I wanted to say thank all of the advocates who have been working on this matter. My co-sponsor, Councilmember Cole Wells and also Miranda and all of our central staff and my my team, Graciela, for help on this legislation.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. I would encourage members to surface their questions, though. It's not a branch. Today, I would encourage members to surface the questions in this conversation today so the staff has a chance to prepare and have responses to them either at our next conversation regarding this legislation or even before then individually.'",
        "'speaker_0': 'Councilmember Bellevue. She.'",
        "'speaker_1': 'That actually wasn't me speaking up. But I do have questions after whoever was speaking up.'",
        "'speaker_0': 'Councilman Raquel Welch.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Mr. Chair, I don't have a question, but I want to let you all know that The New York Times has a very timely and informative article in its publication today. It's titled The Dove into Ranked Choice Voting. I will forwarded it to everybody, but it profiles the race right now for the New York City mayor's race, which'",
        "'speaker_1': 'involves ranked choice voting. And also that name has been used in federal elections since 2000. Team in Alaska will begin doing so next year that more than 30 cities, including Oakland, San Francisco and Minneapolis have decided to use it, as have state parties and Kansas for children.'",
        "'speaker_1': 'So it's certainly interesting and I will again look forward to this article.'",
        "'speaker_0': 'Council member, Balducci.'",
        "'speaker_1': 'Thank you, Mr. Chair. Apologies. I have to step away from my computer as we reach the end of our scheduled time here. But I'm going to do the best I can on my phone. So I am very intrigued personally by the concept that our our electoral methods have not evolved in a very long time.'",
        "'speaker_1': 'And by there's there's a lot of promise, in my view, and in ranked choice voting. A lot of it was described by council members. Charlie I do as I as I do want to make sure that we fully think through the pros, the cons, the implementation challenges, the implementation costs, all of the things that we should as'",
        "'speaker_1': 'fiduciaries of this government really care for when we make major changes. I really appreciate what council members Angela has offered to do in making this change to the charter to be permissive. I think that makes a lot of sense and it enables me to feel more comfortable moving forward on the timeline that we're on, because if the'",
        "'speaker_1': 'voters say, yes, we want this, then we we can work through details in a in a legislative process that we will have to do. But this did come out of the Charter Review Commission with the recommendation that we not proceed with it.'",
        "'speaker_1': 'They suggested a study and involvement of a community based process to do public engagement with diverse communities and make sure that we had thought this all the way through and involved people who would be impacted. I am a little bit skeptical and we haven't done that.'",
        "'speaker_1': 'Just to be clear. I'm a little skeptical that there's any cost savings to be had unless we move all levels of of of of government on any particular ballot off of the primary, because we'll still have to run a primary.'",
        "'speaker_1': 'It just doesn't include county members. And truthfully, I'm very interested to see what happens this August. We have a very diverse slate of candidates, more than we've seen in the past for multiple levels of local and county offices.'",
        "'speaker_1': 'And and so the the the case that this will that this will be needed in order to diversify our council is I think I think being tested right now as we speak. So I'm I'm appreciative that we had this time to talk to to hear the briefing.'",
        "'speaker_1': 'I would like to ask staff to bring forward some analysis of places where ranked choice voting has been used and what has been the results in those places compared to prior to their adoption of ranked choice voting. In terms of the the candidates that have been attracted, the results and and demographics and all of the things that'",
        "'speaker_1': 'we like. Let's look at what we think we want to achieve with ranked choice voting and put that to the test by looking at those places that have used it and see in what outcomes they have had. Truthfully, I'm not sure that means federal elections are what I want here.'",
        "'speaker_1': 'So, you know, I am concerned that ranked choice voting might lead to us sort of wiping off the rough edges, if you will, and electing the most inoffensive candidates in the middle, as opposed to people who really stand for something strong in a policy way.'",
        "'speaker_1': 'You know, and I offer for your for your consideration, Senator Susan Collins. So thank you for this moment to say that. I do I do look forward to moving forward this proposal. I've stated my concerns for the record and asked for whatever analysis we can get on how this actually works in other places by our staff.'",
        "'speaker_1': 'I would appreciate that. Thank you, Mr. Chairman.'",
        "'speaker_0': 'Thank you for the questions. Councilmember Lambert.'",
        "'speaker_1': 'Thank you, ma'am. Mr. Taylor. I look forward to the article that Council Member for Wales is talking about. I too would like some more information. I've been briefed by some very good enthusiasts about this recently and they admitted it's complicated to explain.'",
        "'speaker_1': 'They said if you can do it in a group of people, move around, it's easy. But doing it on paper is a little more difficult. So it is complicated for people that figure out to begin with. So I think how we are going to all figure it out is going to be important.'",
        "'speaker_1': 'And I know Julie's been working with our members, and that is good. I, too, would like to know more places where it's been used. I think there was a town in the south of us who did use it for a short time and abandoned them.'",
        "'speaker_1': 'So I would like to know what happened there. Worse is that law bars certain local governments from doing this kind of thing. We are not under that because we are a home world charter. But I'd like to know why the legislature decided that.'",
        "'speaker_1': 'And apparently this last legislative session they decided to not forward this in the legislature. So it would be interesting to know what the debate was in the legislature and why they chose not to do it so that we have an open cross.'",
        "'speaker_1': 'Opinions on what this is before we jump on in. Thank you.'",
        "'speaker_0': 'Councilmember DEMBOSKY, thanks. And I know we're late here. Mr. Chair, I'll be brief. I'm in the analysis that comes back from Miranda. I would like us to pay particular attention to whether our top two system that we have in this state makes any difference when comparing to other states.'",
        "'speaker_0': 'And I heard comes from Brazil, I talk about a candidates winning with less than a majority and I know that can occur. It's occurred in a number of presidential elections. Right. We have a plurality, but I think that often occurs in partizan elections here with our two step process, a primary and a general with top two advancing'",
        "'speaker_0': '. I think someone always gets a majority to get elected in November. And so I'm kind of curious about the implications of that and whether that mitigates. And I want to say early on that I'm a little agnostic, I'm interested in this.'",
        "'speaker_0': 'I have some serious questions. I'm concerned about the timeframe. I'm concerned about getting a general green light from voters and then having politicians pick the rules about how we're going to be elected. That I just I'm interested in thinking through that.'",
        "'speaker_0': 'And and and and I guess I'm losing track of my last question there. But that kind of the timing here is of concern because this is very important in terms of our democratic processes and in how we do it.'",
        "'speaker_1': 'Oh.'",
        "'speaker_0': 'This is maybe my biggest concern, eliminating the primary. I really think there is tremendous value in a winnowing process and then a debate that with clear competing values and ideas and proposals for voters to look at and weigh in on, and I get that that's not totally lost when you go straight to a general.'",
        "'speaker_0': 'But it's a it can be a lot more crowded and tougher to decipher out and distill out those messages. And I have some real concerns, just at least out of the gate. I want to share with you all about eliminating a primary and going straight to the general and and then resolving it.'",
        "'speaker_0': 'I know in New York, they limited their ranked choice voting proposal in the mayor's race to the primary. And they're because they're partizan, I guess the primary kind of solves their race. But in our top two system, I see tremendous value in having that debate through the fall, where voters have time to assess things, where candidates are'",
        "'speaker_0': ', where there's time for the press and the community to vet candidates and for that real robust debate in our democracy. So those are some of my initial thoughts. I'm really interested in this debate, and I appreciate the advocates bringing them forward in the kind the goals that are attempting to be achieved.'",
        "'speaker_0': 'Thank you, Mr. Chair. Thank you. Other colleagues. Seeing none. I want to thank Miranda for the briefing and my colleagues for surfacing questions and issues that can be looked into between now and our next meeting, our next regular meeting of the committee.'",
        "'speaker_0': 'The whole and Mr. Chair, can serve double duty.'",
        "'speaker_1': 'I'm sorry. I just had one last question very briefly to the list. I want just to confirm that we all mean the same thing when we say permissive. I just pulled up and I'm looking at the language and I see a lot of shells.'",
        "'speaker_1': 'So I just would like to make sure we understand what what we're actually asking the voters and what happens if they say yes to this language. Exactly. Thank you.'",
        "'speaker_0': 'Thank you. I might suggest that for those of us visual learners, also some sort of graphs, some visual representation of what would happen, say, if there were four candidates for a particular office. How ranked choice voting, if implemented, might play out, would help me track and follow through.'",
        "'speaker_0': 'With that. The only vote we've had was on it on the agenda approving the minutes of our previous meetings. So I won't ask if anybody missed that vote and having no other business before us today, we are adjourned or remain members.'"
    ]
}