{
    "AN ORDINANCE naming the Children and Family Justice Center Building the Judge Patricia H. Clark Children Family Justice Center Building, in honor of the late Patricia H. Clark, Superior Court Judge and revered community member; and naming the new building's resource center the Justice Bobbe J. Bridge Resource Center, in honor of Washington State Supreme Court Justice (retired) Bobbe J. Bridge, courageous juvenile justice services leader.": [
        "'speaker_0': 'Thank you. I believe that concludes public testimony for today's meeting. Is there anyone else who would like to offer public testimony? Yeah. Anyone else. Then we'll close the public hearing and we'll move to item seven on today's agenda.'",
        "'speaker_0': 'The county's Children and Family Justice Center will be opening later this year. This ordinance, ordinance 2019, 210 would name the building itself and the resource center within the building after two prominent local jurists, Patricia Clarke and Bobby Bridge, both of whom had a tremendous impact on the improvement of services provided to juveniles within the juvenile justice system'",
        "'speaker_0': '. Here to brief the committee on the legislation is Patrick Hamacher. Thank you, Mr. Chair. Council members, for the record. Patrick Hamacher, council staff. The discussion of this ordinance begins on page 28 in your packets today. And as you noted in your introduction, Mr. Chair, this ordinance would name the facility, the Children and Family Justice facility after Judge'",
        "'speaker_0': 'Patricia Clark. It would name the resource center within the facility after Justice Bobby Ridge. Just by way of background towards the bottom of page 28. Patricia Clark served as a King County Superior Court judge from 1998 until 2015, and she served as the chief judge of the Juvenile Division from 2000 to 227.'",
        "'speaker_0': 'During her time on the court, Judge Clark received many awards, some of which are the Vanguard Award from the King County Women's League, Women's Women Lawyers, the 2005 Voices for Children Award from the Washington State Children's Alliance and the Trailblazer Award from the National Black Prosecutors Association.'",
        "'speaker_0': 'She also served as a member of the Superior Court Judges Association, Board of Trustees and the Superior Court Judges Association, Family Juvenile Law Committee. Moving to page 29, in your staff reports, she chaired King County's disproportionality committee and the State of Washington's Committee on Racial Disproportionality.'",
        "'speaker_0': 'Judge Clarke also led the county's implementation of Dependency Family Treatment Court, and it was instrumental in the Reclaiming Futures Treatment Court and Family Treatment Court. The ordinance would name the facility formerly would formally name the facility. The judge, Patricia H.'",
        "'speaker_0': 'Clark Children and Family Justice Center Justice Bobby Bridge served as a superior court judge for ten years. Four of those were as the chief judge of the juvenile court and two years as a presiding judge of the King County Superior Court.'",
        "'speaker_0': 'In 1999, she was appointed to the Washington State Supreme Court, where she served until 2007. After leaving the bench, she served as the founding president and CEO of the Children for excuse me, as a Center for Children and Youth Justice.'",
        "'speaker_0': 'As with Judge Clarke, Justice Bridge also received many awards throughout her career, a sampling of which is the David W suck up Speak Up for a child from the Washington State Association of Court Appointed Special Advocates and Guardian Ad Litem.'",
        "'speaker_0': 'Jurist of the Year from the Washington State Bar Association and Judge of the Year from the King County Bar Association. Justice Bridge also served as co-chair for the Supreme Court Commission on Children in Foster Care. The chair of the Domestic Violence Child Maltreatment Statewide Protocol Project and chair of the State, a task force.'",
        "'speaker_0': 'Judge Britt Justice Bridge contributed to the establishment of a Unified Family Court in King County and in establishing a child care facility at the Mailing Regional Justice Center. Moving to the very bottom of page 29, the proposed ordinance would name the Resource Center after Justice Bobby Bridge and just four by way of further information.'",
        "'speaker_0': 'The Resource Center at the Children and Family Justice Center actually includes a large number of services, including a full list that's on page 29 and 30. Some of the more important of which are the housing coordinators, transportation support, legal resources, community based services, and behavioral health services for the families and the children involved with the criminal justice'",
        "'speaker_0': 'system and having interactions at the Children and Family Justice Center. As I noted, the ordinance would name the Resource Center as the Justice Bobby Jay Bridge Resource Center. That concludes my staff report, and I'd be happy to answer any questions you may have.'",
        "'speaker_0': 'Thank you. See? No questions of Mr. Hamacher. I would invite Judge Bill Bowman and Michelle Clarke to join the presentation table. Councilmember Lambert, you want to speak from there or during the presentation table?'",
        "'speaker_1': 'Well, it's okay.'",
        "'speaker_0': 'Of course.'",
        "'speaker_1': 'Put the ordinance before us first.'",
        "'speaker_0': 'Yes, please.'",
        "'speaker_1': 'Okay. Thank you, Mr. Chair. I'd like to move. Proposed Artist 3019 020210.'",
        "'speaker_0': 'Councilmember Lambert has moved adoption of Ordinance 2019 210. Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I'm very excited about this day that we're getting. We've gotten here when I actually thought at this point we would already be in this courthouse. So took a little longer than. We had expected. And I'm very excited that today we're talking about naming it for these two wonderful women.'",
        "'speaker_1': 'Judge Patricia Clark used the power of hope, compassion and seized opportunities to improve the lives of youth in their families. She was a strong advocate for prevention programs to help young people out of the detention system. She was truly a pioneer for change.'",
        "'speaker_1': 'I went with her on a trip to Illinois to look at juvenile justice best practices. She was truly a leader, and then during her time, the number of incarcerated youth dropped dramatically. New children in Justice Center will soon be a place where children and families will be treated with them utmost respect and access to a wide range'",
        "'speaker_1': 'of services, as Pat just talked about. The facility will include child care for families on court business, additional space for youth and family services, and a resource center connecting youth and family with the services in their communities. And I just like to tell you three times that stick out in my mind with Justice Clark.'",
        "'speaker_1': 'I met her when I was the legislator and we were doing a project. We went across the state looking at different courtrooms and trying to decide what made the best judges the best judges. And she was one of the three judges in the state that I chose as being the best judge.'",
        "'speaker_1': 'And the reason for that was she had great interaction with the people before her. She had great compassion, and she expected the best out of people. And when I was giving a report in front of a clear continuing education for justice guy in front of members of the bar, she was in the audience when I was talking'",
        "'speaker_1': 'about this wonderful judge, and everybody started looking at her and I went, Oh, there she is. So that was fun. And it was fun to have her peers hear all the different things that she had done because some of them they hadn't heard of.'",
        "'speaker_1': 'One of my favorite meetings with her was where we were going out to lunch and she was wearing a a pink outfit. It was not my favorite pink outfit. And when Blackman was waiting in the waiting room and he was there by himself, and she went up to him and she said, Can I help you?'",
        "'speaker_1': 'And he said, No, you can't help me. And she said, Well, why not? And he said, Well, that lady of there supposed to have helped me an hour ago, and she isn't doing anything to help. And so she said, Now tell me what the problem is.'",
        "'speaker_1': 'And so the boy told her, and she called clear across the room to the clerk and said, Hey, when is that going to be ready? And she goes, Oh, Judge. Just a minute. And the boy looked up at her.'",
        "'speaker_1': 'His eyes were like saucers. And he said, You're the judge. And she looked over at him. She said, not only mad, the judge, I am the presiding judge. And yes, we will get this. And I have one more thing to tell you.'",
        "'speaker_1': 'Never underestimate the power of a black woman. And I just thought that was so amazing. He was very impressed that and that she was there to help him. And she truly did. And she also got the law and the Bar Association Award.'",
        "'speaker_1': 'And it was really nice to be there that night and hear all the wonderful things and compliments that other judges and attorney had to say about her. The other part of this is that the resource center is going to be named after Justice Bobby Bridge.'",
        "'speaker_1': 'And we just heard her background. She also is the woman who's the visionary. And not only did she help establish the first court based child care center in the Pacific Northwest at our center, and if you haven't been able to get in and see that it is so child friendly and appropriate and has all these great safety'",
        "'speaker_1': 'precautions. She also most people don't know this, but she was the guiding force between the on the legislation and the family unification law. And she and I worked on that when we were I was in the legislature. So she had a guiding force in family unification to make it even possible that you could unite those kinds of'",
        "'speaker_1': 'cases. So I'm very excited that this court is going to be named after these two amazing pioneer women. And as soon as we hear from two other great speakers, I'd like to that we have a yes vote on this ordinance and to thank the many co-sponsors who have made this possible.'",
        "'speaker_1': 'And so with that, I would like to introduce as to the listening audience, because we all know and love her, Michelle Clark, her daughter, followed by our assistant presiding judge, Judge Bowman. Michelle, if you don't mind, Councilmember, we're going to flip that order.'",
        "'speaker_1': 'Oh, okay. Judge by members. Okay. Thank you, Judge.'",
        "'speaker_5': 'Good afternoon, everybody. Judge Bill Bowman. I'm the assistant presiding judge for the King County Superior Court. In behalf of the King County Superior Court, I want to thank all of you for the opportunity to speak in favor of this ordinance.'",
        "'speaker_5': 'I actually had the honor of appearing in front of a judge, Patricia Hall Clark, when I was a lawyer and then working with her as a colleague for a number of years. And I think everybody here knows that she was a fierce advocate for the kids in our community.'",
        "'speaker_5': 'Some may not know that she had a career in social work and youth services before she ever attended law school. In fact, it was at age 40 when she obtained her J.D. and her master's in public administration from the University of Washington.'",
        "'speaker_5': 'And then she had another career with the King County prosecutor's office, where she was a deputy prosecutor and worked her way up to be a senior deputy prosecutor in 1996. She brought all of her passion and experience from decades of working with youth to our bench as a commissioner.'",
        "'speaker_5': 'At first, her focus then was on at risk youth and children in need of services cases. She became a Superior Court judge in 1998 and continued working as a champion for families in our dependency and juvenile offender cases.'",
        "'speaker_5': 'She served among her many roles in our court as chief juvenile court judge for many years, and I'll use the same word that Councilmember Lambert did. She was truly a pioneer in juvenile justice reform. She was committed to collaborating with the community in an effort to approach juvenile justice issues as a team.'",
        "'speaker_5': 'She was acutely aware of and worked hard to address the disproportionality of kids of color in our system and was in fact one of the earliest voices to advocate for incarceration of youth and to and worked to provide viable alternatives to detention.'",
        "'speaker_5': 'And finally, she was a proponent of examining the juvenile justice process from the child's point of view. Her vision has served as a driving force behind our current approach to restorative justice. Justice Bobby Bridge has spent an entire career in and out of the courtroom advocating for kids as well.'",
        "'speaker_5': 'In her ten years, a superior court judge, four of which I think, as you mentioned, she served as our chief juvenile court. She led the creation of the Juvenile Justice Operation Master Plan, which many of you know is Jay Jump, which effected significant changes in juvenile offender court practices and led to a significant reduction in the number'",
        "'speaker_5': 'of kids in detention. She also led the effort to create juvenile drug court and chaired the Oversight Committee for the Parents Representation Project, which improved representation for parents in abuse and neglect cases. And as a Supreme Court justice, she was co-chair of the Commission on Children in Foster Care and chaired the Beckett State Task Force and led'",
        "'speaker_5': 'the Committee on Adolescents in need of long term placement. When she retired from the Supreme Court. She founded the Center for Children and Youth Justice, an organization that advocates for system reform to benefit kids. On behalf of the King County Superior Court.'",
        "'speaker_5': 'We can't think of two more appropriate namesakes for the Children Family Justice Center, where we will continue to collaborate with our communities and partners to provide the therapeutic and culturally responsive services to all youths and families. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'So I think that it would be appropriate not to speak of my mother as a judge, but as a mother. She spent her life fighting for children that other people didn't think were worth it. So as a social worker, as a prosecutor, as a judge, she served as a mentor to young women, young lawyers of color, new'",
        "'speaker_1': 'judges on the bench. But she never lost her focus for her kids. And they want me and my brother. Her kids are the kids, actually. So some of her innovative sentences were to sentence kids to book reports the book or to sends them to book reports to have them come back and share with her the times that'",
        "'speaker_1': 'they went to the library, what their reports were, and whether or not the kids wrote the reports. It was a success for going to the library, doing the research, coming back, and then she would serve as their cheerleader.'",
        "'speaker_1': 'The other thing that she thought about children were when kids end up in juvie, it's not because they have failed. We have failed them. And so she would be greatly honored to see that the county is now working toward zero youth detention and recognizing that with the Unified Family Court, that when your kid is in crisis, your'",
        "'speaker_1': 'whole family is in crisis. And so we need to look at it from a family systems if we're going to do so. This is a great honor for my family and my mother would be proud. Thank you.'",
        "'speaker_0': 'Thank you, Michelle.'",
        "'speaker_1': 'Can I ask Michelle, will you tell us about the picture in front of you? Maybe I can. Maybe. Okay. So this is a picture that the kids at end juvenile detention is a mural that they made for her when they found out that she was retiring.'",
        "'speaker_1': 'So in this picture is a kid with a backpack in the rain and a woman in robes. That's my mother in the rain. And she is holding the umbrella over the little boy. She is getting wet, but she is protecting him.'",
        "'speaker_1': 'So that's what they did for her when she retired.'",
        "'speaker_0': 'A fitting tribute.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you for the discussion. Councilmember Gossett.'",
        "'speaker_2': 'Thank you, Mr. Chair. I had the pleasure of working very closely with both of these women. Even though Bobby Bridge shared, I was the chairperson of the Juvenile Justice Operation Master Plan. I was one of the lead county council members that worked to figure out a creative way based on best practices, that we could dramatically reduce the'",
        "'speaker_2': 'number of kids in juvie because we were very fearful that we would have to build another youth. Yeah, we had just been told that if we did not do anything at the adult novel, that we would have to build another new jail by 2008.'",
        "'speaker_2': 'That was the nature of growth in both our adopting the youth populations. Bobby Bridge and Patricia Clark both served and played leadership and innovative roles. So I think it was appropriate that some of my colleagues and the judge earlier mentioned, I referenced these women as pioneering because they were indeed pioneering.'",
        "'speaker_2': 'I also had the pleasure of going to college in the mid 1960s at the University of Washington, where Patricia and a couple quarters I had classes with her and she noted that I like to play with her maybe a little too much.'",
        "'speaker_2': 'So she just took it upon herself to holler. And I'm glad, Larry, it's time to go to class. And, you know, I had to get on that and go to class. But that showed me that she cared about me being successful at the university.'",
        "'speaker_2': 'And when Bobby Bridge left the court, she was so committed to youth services that she served on some of the broader youth justice conferences and commissions and committees that we set up here in King County. And some that the state set up.'",
        "'speaker_2': 'And Olympian always played a leadership role based on her judicial experience. Our commitment to you and I cannot name the number of African-American youth and Latino youth and just poor white youth who have come to my office with stories about Patricia Clarke, Judge Clark, and how she handled down in court.'",
        "'speaker_2': 'And half of those stories came from their parents who just observed her interaction with their kids and with them. And I think that's an example when Margaret and Patricia Clarke, one of the most difficult cases that we ever had to handle here.'",
        "'speaker_2': 'Martin Luther King, Jr. Connie was the killing of Mr. Robert Thomas senior, and it was extremely controversial. And the alleged shooter was a King County sheriff's deputy, and the African-American community was extremely upset. Rod Sims was the executor.'",
        "'speaker_2': 'He couldn't he couldn't pay a judge to handle this case. And finally, Patricia Tarrant I will handle it. And she and earning the respect of the families involved, the police involved, you know, judicial leadership and our government and our extremely hard manner, a difficult situation to earn respect from all these parties because three or 400 black people'",
        "'speaker_2': 'took over the freeways one day, but she stayed calm. How about the inquest? So I want to invite them. Both of these women's extraordinary leadership as judges and as human beings absolutely warrant our support for them. Judge Clarke, having a whole facility named after her and Judge Bobby Bridge having the learning center, which is going to be'",
        "'speaker_2': 'used a lot named after her. And I genuinely hope that we follow through and support both of these nominees for these extremely important and symbolic and inspirational positions at our new children at Valley Justice Center. Thank you.'",
        "'speaker_0': 'Thank you. With that, I'd ask the court to please call the role.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Baldacci. Councilmember Dombrowski. Councilmember Dunn. All right. Councilmember Garcia. Councilmember Colwell. Councilmember Lambert. Councilmember of the crowd. Councilmember one right there. Hi, Mr. Chair. Hi, Mr. Chair. The vote is a 99 zero no's.'",
        "'speaker_0': 'Thank you. Haven't received the required majority. We have. We've given ordinance 2019 210 a do pass recommendation. We will send that to full council and I would suggest we could put it on consented for council. We expedite and we'll expedite to Monday to Wednesday's agenda.'",
        "'speaker_0': 'We can't expedite to tomorrow's because there is an ordinance and needs are to Wednesday. It needs a public hearing and hasn't been recognized. So we can do it next week, though. Then we'll do it regular course and we'll put it on consent.'"
    ],
    "A MOTION making an appointment to fill a judicial vacancy in the east division, northeast electoral district judge position number five of the King County district court.": [
        "'speaker_0': 'Thank you. Thank you very much. That takes us to items five and six. The King County District Court, Northeast Division currently has two openings to the incumbents being appointed to the Superior Court by Governor Inslee. Pursuant to King County Code, I instructed staff to coordinate interviews with all of the eligible applicants, and that subcommittee consisted of myself'",
        "'speaker_0': 'and council members Baldacci, Dombrowski and Lambert. We conducted six interviews on July 8th and July 10th and are recommending three candidates as finalists to be interviewed today. The county code requires a procedural motion to select the finalists to be interviewed, and I wish to call on Councilmember Dombrowski to make that motion now.'",
        "'speaker_0': 'Thank you very much, Mr. Chair. It's my pleasure to move that. The King County Council take up the appointment of the two open seats for Northeast District Court, and that we consider the recommendations of the select committee that you mentioned Kevin Peck, Jill Kling and Michelle Gilson, and conduct interviews here today and make a recommendation to the'",
        "'speaker_0': 'full council if that is the motion you were looking for. I believe it. I believe in fact it is. Discussion Council Member Gossett.'",
        "'speaker_2': 'Yes, thank you, Mr. Chair. I want to ask Councilmember DEMBOSKY does that mean we are filling two positions today or just one?'",
        "'speaker_0': 'Two positions?'",
        "'speaker_2': 'Oh, thank you for that clarification.'",
        "'speaker_0': 'Yes, I see no further discussion. All those in favor, please say I oppose. Nay, the ayes have it. Thank you. Today, the full committee will interview. The three finalists, will provide about 15 minutes for each finalist. And until the finalists are before the panel for the interview, I'm asking that they be sequestered in the actually in a'",
        "'speaker_0': 'conference room in the administrative offices of the council. Grant Lemon will facilitate that, and that allows us to interview each candidate in open session and allow each one of them to be hearing the questions and participate in with as much warning as the others.'",
        "'speaker_0': 'Sam Porter is here with counsel staff to answer any procedural questions and point out anything I may have overlooked. No one seems to think I've overlooked anything, Mr. Lemon. We have names of the applicants, but the paper randomly at first will be back, followed by Will King County Television is not happy.'",
        "'speaker_0': 'The clerk of the show again. You don't.'",
        "'speaker_2': 'Know how where they.'",
        "'speaker_1': 'Go.'",
        "'speaker_0': 'Oh, General, I would just go with that. Everybody has, right?'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'It's not.'",
        "'speaker_2': 'Appropriate for you to be.'",
        "'speaker_0': 'Against it.'",
        "'speaker_2': 'You have to apply their word. But they have made it their personal. Yeah. I mean, you know.'",
        "'speaker_0': 'Yeah. All right.'",
        "'speaker_2': 'We gotta go.'",
        "'speaker_0': 'Yeah I've been feeling you know I we have not pre assigned who asks the questions and will be making that up as we go along. So let me begin actually by welcoming Kevin Peck and ask you to briefly introduce yourself.'",
        "'speaker_0': 'Describe your background and why you'd like to serve it as a district court judge.'",
        "'speaker_3': 'Thank you, and thank you for the honor to address the entire council today. My name is Kevin Peck. I served as a trailer in King County for the past 36 years, and I've been honored to serve as a pro-tem judge in the King County District Court for the past 29 years.'",
        "'speaker_3': 'At age 14, I began working at McDonald's in Chicago. I graduated high school a semester early and took a position as a law clerk in a Chicago law firm where in my spare time I would go to the courthouses in Chicago, either the federal court or state court and watch trials.'",
        "'speaker_3': 'And it was there at the age of 17, I began my love and fascination for our legal system. I moved to Seattle 41 years ago, where I worked in the shipyards and as a vendor at the kingdom in order to help pay for law school and graduating from law school.'",
        "'speaker_3': 'I immediately took the job full time as a public defender in King County for three years, where a guardian significant trial experience in representing indigent clients and communities of color. I also advocated for caseload standards for public defenders that that based on the overwhelming caseload we were being presented with to make sure that being provide adequate representation'",
        "'speaker_3': '. After I was served as a public defender, I was then hired as in-house counsel to the hotel and restaurant employees. I served in that position for two years where I negotiated collective bargaining agreements for fair and sustainable wages, safe working conditions, and work to try and eliminate sexual harassment, which was rampant in that industry.'",
        "'speaker_3': 'I subsequently went into private practice where I've now been for 31 years, where I continue to represent indigent defendants in federal court, criminal proceedings, and continue to practice employment law representing over 200 individuals in employment matters based on discrimination of race, sex, national origin, religion, disability and sexual orientation.'",
        "'speaker_3': 'I've been honored in that position to also sue a case all the way through the U.S. Supreme Court, a criminal case where the U.S. Supreme Court struck down a statute based on free speech. I've come up with some ideas.'",
        "'speaker_3': 'I started serving as a pro tem judge in the district court 29 years ago. Over the past 29 years, I've made it over the time.'",
        "'speaker_0': 'It was until just a second ago.'",
        "'speaker_3': 'Over the past 29 years, I've presided over hundreds and hundreds of proceedings, criminal cases, civil cases, trials, jury trials, every type of case that comes before a district court judge. There's not a day that I filled in as a district court judge that I haven't relished and love the opportunity.'",
        "'speaker_3': 'I find the work intellectually stimulating, and if I had my choice, I would do this work every day. The rest of my life, the lawyers that appear before me, the lawyers that appear before me advise me. They feel respect.'",
        "'speaker_3': 'It's okay.'",
        "'speaker_0': 'I'm sorry. Oh, pardon us.'",
        "'speaker_3': 'No, that's okay. Over the past 29 years, until the end, as a district court judge, the lawyers that have appeared before me advised me they feel listened to, respected. They appreciate. I get to the heart of the matter quickly and I have good judicial temperament.'",
        "'speaker_3': 'Two years ago, in the lobby of this courthouse, a lawyer stopped me and said he had appeared before me a month before on a motion hearing in Shoreline District Court. He said he lost the motion, but he wanted me to know my decision was well-reasoned.'",
        "'speaker_3': 'I didn't know this lawyer, he said. He wanted me to know my decision was well-reasoned and he was uplifted when I announced the decision. He said, You should run for judicial office. We need more judges like you. Three years ago, a claimant appeared before me in District Court on what's called a tow hearing, trying to get reimbursement'",
        "'speaker_3': ', alleging his car had been illegally towed by a property owner. I showed him the statute and said the way the statutes written, I couldn't order reimbursement for him. But I said, here's the copy of the statute. You can go in the back of the courtroom and when you're ready, I'll recall the case and we can discuss it'",
        "'speaker_3': 'further. When he came to the front of the courtroom, he said, You're right, the way the statutes are, you can't order reimbursement. But I want you to know this is real justice and I really appreciate this opportunity. So those are some of the stories to people who've lost their hearings in my courtroom, but still appreciated the type'",
        "'speaker_3': 'of justice that I was able to provide. And I look forward to answering your questions. Thank you.'",
        "'speaker_0': 'Thank you. We have a volunteer to ask the second question. Councilmember up the grove. Yeah. You're making me put my old man glasses on. Well, it's a pleasure to meet you. Thanks for being here. Thank you. You touched on this very briefly in your introductory comments, but maybe you could flesh it out.'",
        "'speaker_0': 'Could you describe your understanding of the racial inequities in our justice system and our judicial system? And describe how you've worked to address these issues in your career and how you could seek to address them in a position as a permanent district court judge.'",
        "'speaker_3': 'Thank you. Thank you for the question. Do I feel sad that there such a racial inequality in our justice system? As I said, I've dedicated a good part of my life to pursuing discrimination, so it's not esoteric to me.'",
        "'speaker_3': 'I deal with it every day, people in the workplace being treated differently based on race or gender. But I also see it in the criminal justice system. The communities of color are well, overrepresented, unfortunately, in the criminal justice system.'",
        "'speaker_3': 'And that's actually why I'm honored by my reading by the Latino Bar Association, exceptionally well-qualified and by the Lawrenceville or Mars Bar Association, exceptionally well-qualified, because I think they recognize the work I've been doing on behalf of communities of color over the last 36 years.'",
        "'speaker_3': 'And I think we can do a lot to change and reduce the inequities in the criminal justice system. Actually, some of some of you, if it's okay, if I pass out the.'",
        "'speaker_0': 'Call, do it for you. My cousin. Thank you.'",
        "'speaker_3': 'What I've come up with is based on my experience of 29 years as a pro tem judge and 36 years practicing in in court is a trial lawyer. I've come up with some ideas and some of the ideas I think would help reduce the racial inequity in the district court system.'",
        "'speaker_3': 'So I quickly go through those ideas. The first pages ideas and the second piece pages, a criminal case timeline. I know some of you are familiar with criminal case timelines. Others perhaps it would be a help to. But some of the ideas I have to reduce the racial inequity we have way, way too many people miss court'",
        "'speaker_3': 'hearings and warrants are put out for them. You know, when a warrant is put out for an individual, not only is that judicial time and public defender time and prosecutor time and police time and share of time, you know, then once they're taken into custody, they have to stay in jail potentially overnight and then come back and'",
        "'speaker_3': 'be brought before the court the next day. Transportation time, it's mass cost to the district court system. So and what it does to the individuals is the individual that is has to stay in jail overnight or perhaps longer.'",
        "'speaker_3': 'They can't support their family because they're in jail. They might lose their job. They might have to miss school. It can create havoc for persons. And at least based on my experience, I see it affects persons of color to a greater degree.'",
        "'speaker_3': 'And I think what we need to do is work to reduce warrants. So my first idea is we put out text notification to individuals the day before their court hearing. Too many people miss court hearings. As I explained to the subcommittee, when I need medication, Costco sends me a reminder.'",
        "'speaker_3': 'I press the text. It's it's time. Yes, I want to renew my medication. And then they tell me when it's ready so we can send that same notification out. And as part of the notification, I also put in my ideas that we can describe the type of court hearing and again, my representation of persons of color for'",
        "'speaker_3': '36 years and interdependence. A lot of people don't come to court because they're afraid to come to court or they don't understand and they think they're going to end up in custody and they can't afford to lose their job.'",
        "'speaker_3': 'They can't afford to lose their housing. They need to take care of their children. So I think we can reduce those inequities. And you can help describe what happens in an arraignment hearing, simply a plea of guilty or not guilty.'",
        "'speaker_3': 'You can describe what happens at a pretrial hearing so it can reduce those inequities. But the second you can have agreed pretrial continuances in an arraignment hearing, as I said, I've been protesting for 29 years and on an increasing, frequently based, frequent basis, I think the court steps know that I'm willing to do the work.'",
        "'speaker_3': 'I can get the job done in an efficient manner and provide the type of justice that's needed. And I'm willing to drop what I have to show up to protest. So when you go to an arraignment hearing, there's 60 to 80 people be arraigned after the arraignment hearing based on the timeline.'",
        "'speaker_3': 'The second piece of paper is the pretrial hearing. What happens at the pretrial hearing? You either have worked out some arrangement to resolve the case or there's a plea or the case is going to get set over to another pretrial.'",
        "'speaker_3': 'So 80% of the cases are set over at the pretrial to another pretrial. So all that happens. It's a minute hearing people come before me. I asked them, did you go through this speedy trial with the attorney? And you understand it's a knowing decision, volunteer decision, educated decision.'",
        "'speaker_3': 'You understand by signing this, the prosecutor is going to have until March 2020 to try you. Is that okay? Yes. They signed a waiver. We presented to the clerk. I said, I want to see the clerk. We can give you another hearing in six weeks.'",
        "'speaker_3': 'So that whole hearing was completely unnecessary. If based on the person's criminal history, which hopefully there is none. But if there is criminal history, if they've shown up for court in the past, you could agree with the prosecutor, the defense attorney and the prosecutor can agree in advance that if the person files the waiver seven days in'",
        "'speaker_3': 'advance of the hearing, that hearing can be stricken. You can have hundreds of less hearings in King County district courts every week. It's completely unnecessary. What does it do? It would save persons that are low wage earners, potentially persons of color from having to come to court.'",
        "'speaker_3': 'Transportation costs, child care costs, missed a day of work. So if you could equal some of that, create equality in some of those situations, approximately 30% of the people that appear in an arraignment hearing are eligible for what's called a deferred prosecution, meaning if they enter into alcohol treatment or drug treatment or some kind of behavioral health'",
        "'speaker_3': 'treatment, they can have their charge put off for five years. And then if they're successful, it can be ultimately dismissed. So in the arraignment hearing, again, when there's 60 or 80 people in front of me, we can in advance, if people are willing to do so voluntarily, come and tell their story.'",
        "'speaker_3': 'You know, I was arrested seven years ago on a DUI or whatever the case. I went through a deferred prosecution. I went through treatment. I successfully completed it in my life is much better now. My case was dismissed.'",
        "'speaker_3': 'You know, it can be a two minute recitation or five minute recitation voluntarily. And hopefully the audience is going to listen to that person much more. They're going to listen to a public defender, which they're not going to the public defender's not going to talk to him about it until the next pretrial, which is six weeks later'",
        "'speaker_3': '. And then they might talk to him about it for 10 minutes. And then when they think, oh, that's a possibility. No, said it over another six weeks to get the alcohol evaluation. So if you get people thinking about a deferred prosecution earlier, you can save again and reduce these unnecessary retrials.'",
        "'speaker_3': 'And it also reduces the cost, the hidden costs, I call it. Again, I was public defender years. It reduces the hidden cost of public defense increase because you don't have these unnecessary pretrial hearings occurring again in terms of the equity.'",
        "'speaker_3': 'You increase the use of video hearings in the district court and there is a lot of video hearings occurring, but there can be more. Most of the defendants are held at the facility, the score facility it's sitting in, if I'm protesting in Bellevue, Redmond, or whatever the case may be.'",
        "'speaker_3': 'It's a video period. A person was taken into custody on a warrant. Then you determine whether or not they should be released and you can introduce the inequities in the court system. Like one of the last times I filled in, there was a gentleman that it was a video hearing.'",
        "'speaker_3': 'I was in Bellevue based on his history of failure to appear for court. He probably should potentially receive some type of bail. But the prosecutor and the defendant was pleading. He said, Your Honor, I just got out of jail.'",
        "'speaker_3': 'I just got out of prison. 90 days ago, I served a three year sentence. I now have a job. I know I have a place to stay. So do you know how hard it was for me to find that job because he was an African-American gentleman?'",
        "'speaker_3': 'He said, you know how hard it was for me to be able to find that job. He said, I miss my court hearing. I know I missed my ordering, but my job, me, if I wasn't there for the first 60 days, I would lose my job.'",
        "'speaker_3': 'So I think those type of situations, inequities have to be taken into consideration. The prosecutor wanted thousands of dollars of bail. I let the man out, no bail so he could keep his job and hopefully appear for court.'",
        "'speaker_3': 'So I think a judge in district court has that capacity. The same thing that just the defendant's out of custody. Instead of someone coming, driving all the way from Auburn to Redmond to appear at a pretrial for a few minutes, why not have a hotspot or head of a video location where they can appear for court?'",
        "'speaker_3': 'And then again, it could save transportation time. Unnecessary missing of work, child care, unnecessary expenses. We can equalize these things. I think these are just some of the ideas. And I should point out, when I in my pursuit of this position, I met with the prosecutor.'",
        "'speaker_0': 'Please continue.'",
        "'speaker_3': 'In my pursuit of this position, I met with prosecutor Dan Theodor burg, went over my ideas with him. He said if you get a chance to hear from the county council, go over these ideas with them. He liked my ideas.'",
        "'speaker_3': 'He endorsed me for the position. I also met with the county executive. He said When I went over my ideas, he said, Where have you been? We want you for this position. He endorsed me for the position. And he said, We need to keep this dialog open.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you. And with the next question, Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. Mr. Peck. Handling a mistake can reveal a lot about a person's temperament. And I would like you to tell us about a time you've made a mistake and how you realized you made that and what made you change your mind and did you correct yourself or reverse your mistake?'",
        "'speaker_1': 'So kind of a lot of questions there, but I hope you get the idea.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'I think it's a very good question. I think based on my experience as a pro tem, I've learned to be very, very careful before I make a decision. And I've learned to listen carefully to the evidence. If I need further research on a matter, I can ask the parties to present further testimony, either oral argument or research'",
        "'speaker_3': ', or I can take a break, go do research myself. So my experience as a pro tem and in one of the most difficult cases I had filling in as a pro tem is the individual was it was approximately a year ago now that I tried the case in individuals driving in Bellevue West toward the sun it right'",
        "'speaker_3': 'at sunset they turn left into an intersection. And fortunately there was an elderly person in the intersection. They hit the person and unfortunately the person died. There would have been extensive pretrial in litigation in that case, I wasn't part of.'",
        "'speaker_3': 'I was called again. I think it was an early morning call. Can you fill in today? First Judge So-and-so, whatever the case may be. I was called it turned out to be a three day trial. Extensive exhibits, very, very difficult decision to determine whether or not the person was negligent.'",
        "'speaker_3': 'But I learned through that decision. I took my time. I went through all the exhibits. I finally came to the decision. And in response to your question, whatever decision I made, I think I wasn't going to be satisfied with because it was such a difficult decision.'",
        "'speaker_3': 'And I found the person was not negligent. They were they were found responsible for a lesser traffic infection, but not the higher traffic infraction. But what I learned from that is just to be very, very careful. And if I do make a mistake, which I hope we don't, but there's an appeal process available to people.'",
        "'speaker_3': 'But I always am very, very careful about my decisions. And I think actually that the matter was so difficult that the sitting judge actually apologized to me. When they came back, they said, oh, I didn't mean for you to get stuck with that statute.'",
        "'speaker_3': 'I said, No, I appreciate it. I do. I really appreciate the opportunity to experience.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Opportunity for follow up questions from members. I would ask I would ask you to provide your closing remarks.'",
        "'speaker_3': 'Thank you. And thank you again for this opportunity. I sincerely appreciate it. Over the past 36 years as a trial lawyer, I've represented hundreds of individuals in either criminal cases, civil cases or employment cases. And what I've done over those past 36 years is try to find justice for individuals and improve their lives.'",
        "'speaker_3': 'And I'm proud that I've been able to help people improve their lives. When we leave court, either as a citizen or a lawyer or a litigant, what is it we want? We want to feel respected, listened to and received a decision that's fair and impartial based on the facts and the law.'",
        "'speaker_3': 'And I think, based on my experience filling in as a pro tem judge, I provided that type of justice. The mission statement for the King County District Court is to provide fair, understandable and efficient justice in a dignified and respectful manner.'",
        "'speaker_3': 'And I respectfully submit that that's what I've been able to do over the past 29 years. As I said, I love the position. I love filling in as a pro tem judge based on the fact that I love the interaction with the individuals in court.'",
        "'speaker_3': 'Many people call the district court the People's Court, and they call it the People's Court, because I think if if the odds are a person has interaction with a court in King County, it's most likely the district court.'",
        "'speaker_3': 'In addition to serving as a pro tem judge. I've represented communities of color, indigent, indigent clients for the past 36 years. And again, I think it's based on my experience representing those communities. Again, the Latino Bar Association and the Laura miller Bar Association gave me the highest rankings, exceptionally well-qualified.'",
        "'speaker_3': 'And I think it's because I work with those communities. I understand the unfortunate issues that they face and I work to try and improve some of their lives. In specific, I've worked with individuals that are unfortunately afflicted with addiction to either heroin or methamphetamine or.'",
        "'speaker_0': 'Alcohol or.'",
        "'speaker_3': 'Cocaine. I work with individuals that are homeless, that don't have a job, don't have any family support, have little education, may have little hope for the future. And what I've been able to do on behalf of those individuals is provide them hope and work, work with them to get through the system and hopefully get out of the'",
        "'speaker_3': 'criminal justice system or the cycle of the criminal justice system in getting individuals out of the cycle of the criminal justice system. It not only helps that individual, but it helps all the citizens of King County. It betters King County for all of us.'",
        "'speaker_3': 'So if I had the opportunity to serve as a pro tem judge, I would love the opportunity. As I said, I don't I'm not applying for this job as a stepping stone. I love the district court. I love the People's Court.'",
        "'speaker_3': 'And if I'm so honored to be selected for the position, I plan on staying. If I had the opportunity, I would do this work every day the rest of my life. I relish this position. This position is a dream job to me.'",
        "'speaker_3': 'Essentially, I have 29 years of intermittent on the job experience in this position, and I would like to be able to continue to put my skills and ability to work on behalf of all the citizens of King County.'",
        "'speaker_3': 'I commit to you that I will work as personally humanly possible, work as hard as humanly possible on behalf of the citizens of King County. I want to better the citizens of King County. I want to work collaboratively with you and the judiciary to improve the judiciary and the administration of justice.'",
        "'speaker_3': 'I've been honored not only to be endorsed by and what's interesting is 36 years of practicing criminal law on one side of the aisle. But I've been endorsed by King County Prosecutor, Dance Theater Bird, and I've also been endorsed by the former U.S. attorney, Jenny Durkan.'",
        "'speaker_3': 'So I think it shows these people understand my ability to be fair, honest and impartial. We had a discussion the other day in the subcommittee, and I think those are in practice law. Know that you as a lawyer, you can file what's called an affidavit to have one judge removed if you don't think hypothetically you're going to'",
        "'speaker_3': 'get a fair trial. So over my 29 years of filling in as a pro tem judge, only once ever did someone file what's called an affidavit to have a different judge. And that was only because that case was tied into essentially 29 other cases.'",
        "'speaker_3': 'And they wanted a sitting judge to be there over the next few months to be able to resolve the matter. So I'm proud that the lawyers that appear before me, as I said, they like my judicial temperament. They feel respected, they appreciate I get to the heart of the matter quickly.'",
        "'speaker_3': 'And I would relish again the opportunity to be able to continue to provide justice on behalf of the citizens working on your behalf. And I would work tirelessly not only in the courtroom, not only in the courthouse, but I'm willing to commit to work and go out in the.'",
        "'speaker_3': 'Community and publicly speak. Tell individuals. Tell public school events, community meetings. If you're gracious enough to invite me to a constituent meeting 10 minutes as a guest speaker, I'm happy to speak on what new laws there are out in the community.'",
        "'speaker_3': 'My example is I said to the subcommittees, there's distracted driving laws that have been in effect for two years now. 30% of the drivers, unfortunately, suffering fatalities in King County, in the state of Washington on the road, it's now related to distracted driving.'",
        "'speaker_3': '25% of all serious accidents are related to distracted driving. So I'm willing to go to community meetings and at least as a judge say this is what the law is. Just so you know, this is what's legal under this is what's illegal.'",
        "'speaker_3': 'And if each person there just tells one or two of their friends, the word can spread and hopefully we can save lives or protect lives. So thank you very, very much for this opportunity. I sincerely appreciate it.'",
        "'speaker_0': 'Thank you. Thank you. Thank you very much. We'll take a moment to invite in. GMs Clang, clang, clang, clang.'",
        "'speaker_3': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you. Swing back. Yes. Good afternoon. Welcome back.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'I would ask you to please introduce yourself, describe your background and why you would like to be a district court judge.'",
        "'speaker_6': 'Thank you very much, Councilmember, and to all the honorable council members, thank you all for being here today. I'm exciting. And I want to start just by thanking you all for all of the hard work you do for King County and all of the time and commitment that I know that you've spent in making this really important'",
        "'speaker_6': 'decision today. It's very much appreciated by myself as a citizen of King County, as well as the candidate I. As you know, my name is Jill Kling, and I am King County District Court Judge Pro-Tem. I have been a Judge Pro-Tem on King County District Court for five years.'",
        "'speaker_6': 'For three years that has been my primary occupation, as well as many of the municipal courts in King County, including Renton, Issaquah and Taboola Municipal Courts. My primary employer is the King County District Court. Last year I covered for 23 of the 25 current and recently elevated King County District Court judges.'",
        "'speaker_6': 'I have sat in every branch in King County except for Vacation Island, which I understand only meets once a month. So they haven't got me out there yet. And and I love I love the job is a job that I feel is very close to my heart and it's something that I love going and doing every day'",
        "'speaker_6': '. I have also lived on the East Side since 1996. My husband and I have raised three children on the East Side and sent them to the public schools there. And my community involvement has been heavily centered in the East Side, particularly in Bellevue and in Issaquah.'",
        "'speaker_6': 'I worked for 13 plus years as a prosecutor for the city of Redmond, so my work experience is on the east side in King County District Court in Redmond previous to being a judge. So my experience and involvement on the East Side and my qualifications for this position with respect to my experience, speak for themselves the many'",
        "'speaker_6': 'judges, staff members and community members that have written letters on my behalf. I am humbled by the support that they've given me and they have they speak for me as well as the King County pro-tem. I've been exposed to this job far beyond the day to day operations of the courtroom.'",
        "'speaker_6': 'While my position involves working in the courtroom. I am there behind the scenes, in the chambers and in the hallways nearly every day. And I've had the opportunity to be exposed to all of the facets of what it means to be a King County District Court judge.'",
        "'speaker_6': 'The judges and staff in King County are some of the hardest working people I know, and they work tirelessly to improve and maintain the quality, accessibility and efficiency of justice in King County. I have spent many afternoons talking to Judge Finkle in Redmond about the therapeutic courts, particularly mental health court, which is his passion, and the new'",
        "'speaker_6': 'community court, which we've just begun in Redmond, and the workings of those and the benefits that we're seeing from those therapeutic courts I cover for Judge Chapman in Seattle on Thursdays when the Case Management Committee meets in his chambers and they are about to roll out a new electronic case management system that will make us essentially paperless'",
        "'speaker_6': 'and frankly catch us up to many of the municipal courts that I work for that are already completely paperless. And I sit as a fly on the wall in those committees and listen to how they operate. I have also discussed with Judge York in Auburn the importance of a stronger district court representation in the District and Municipal'",
        "'speaker_6': 'Court Judges Association, and is something that I would be very interested in contributing to. So I understand the multifaceted nature of the job of King County District Court Judge, and I am yearning for the ability to make a larger contribution to King County.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Everyone here for the second question. Councilmember Gossett.'",
        "'speaker_2': 'Thank you. Thank you, Mr. Chair. And thank you, Jill, for being willing to move forward in a very competitive position. I have a question that deals with you, as requested of you, that you describe your understanding of racial inequalities in our judicial system.'",
        "'speaker_2': 'And we'd also like for you to talk a little bit about how you might have worked to address racial inequality or race related issues in your career, even if it's in other arenas. And then lastly, how would you seek to address some of the issues relative to racial disproportionality as it may exist in the district court?'",
        "'speaker_6': 'There's a lot of questions that I'm going to address each of them, so I hope you'll be patient with me. Councilmember Gossett, first of all, it's good to see you again. I thank you for meeting with me last month.'",
        "'speaker_6': 'And and I had a nice time chatting with you then. And I hope that I can expand on some of the things that I told you then about these issues. First of all, we're very fortunate that in King County there is no shortage of conversation about access to justice, about implicit biases, about racial disparities in the criminal'",
        "'speaker_6': 'justice system. It is a topic that is widely and vigorously discussed, and there are ample opportunities to go to workshops and go work in committees, read articles and learn about what the issues are and how we can possibly contribute to solving them.'",
        "'speaker_6': 'There is certainly a disparity in our criminal justice system and it has many causes as a criminal justice system as a whole, that the racial possible racial biases, the implicit biases can come in at every level, starting with who gets arrested and why they get arrested to who the prosecutor charges with the crime and what crime they'",
        "'speaker_6': 'charge them with, to how that case then plays out in court to then ultimately what sentence, if any, is imposed in that case. So this is an issue and just in the criminal justice system that needs to be attacked at many different levels, not in the courtroom, and it needs to be addressed holistically, which is why the'",
        "'speaker_6': 'conversations need to keep happening between all of the players. Beyond that, there are further social issues that are that these these criminal justice issues are rooted in other social issues that need to be addressed as well. And so there's many, many players that need to come together in community to solve what is a continuing problem in the'",
        "'speaker_6': 'in the criminal justice system. As a judge, I have some abilities to affect the outcome of cases in my courtroom. I have the ability and I'll just give one example, because there are several. One of the big things that we're all talking about right now is who's on a jury, who gets picked to be on a jury'",
        "'speaker_6': 'and who gets thrown off of a jury and whoever even gets called to be on the jury. And when they are called, who shows up for jury service? And the the factors are many. But the result is we do not have enough diversity on our juries, and it is affecting the outcome of cases in negative ways.'",
        "'speaker_6': 'Recently, in the last few years, great work has been done in this area. There was a symposium at the Temple of Justice in Olympia that discussed this issue, and it resulted in the Washington Supreme Court justices passing g r 37, which changes greatly the way that we select juries in our state.'",
        "'speaker_6': 'And it has helped judges it has given judges some tools that we can use to make sure that candidates for being on a jury are not being dismissed improperly. And it is more power than judges had previously. So that is one thing that I take very seriously and have looked into.'",
        "'speaker_6': 'I also recently read an article in Northwest Lawyer magazine about the social sciences of a juror who says that they can be fair, even though they've had an experience in the past that makes them feel, you know, biased and this social science.'",
        "'speaker_6': 'A study discussed. When a person says, even though this happened to me, I can still be fair in this trial. The question is, can they really and will they really be fair? And our attitudes are changing about that.'",
        "'speaker_6': 'And the way I approach that situation in the courtroom as a judge is changing because of the changing awareness and social sciences that are happening in our community. So one of the things that I'm doing is trying to stay educated, trying to talk to as many people I can read as much as I can learn as much'",
        "'speaker_6': 'as I can, so that I can apply these concepts in my courtroom to make sure we get the most fair outcomes possible. You also asked what I am doing in my community to address issues of racial disparity and race relations.'",
        "'speaker_6': 'My community service is focused primarily outside of my profession. And at first blush, it may appear that my community involvement has little relation to my work, my career. I believe that's not true. My community involvement focuses on trying to reach young people of disparate communities before I ever have to see that in the courtroom.'",
        "'speaker_6': 'And that is how I believe it's related primarily. My work right now is with Village Theater in Issaquah. I'm on the board there and a primary mission that we have is arts, education and outreach to underserved communities. Last year we reached over 40,000 young people.'",
        "'speaker_6': 'One third of that programing was free or subsidized. And the purpose is to expose young people of underserved communities to the arts and arts education, which studies have shown result in positive community outcomes and less kids ever happening to see me in the courtroom.'",
        "'speaker_6': 'So that's something I'm very passionate about. I also serve on the Equity Diversity and Inclusion Committee at Village Theater, where we are trying to identify barriers that exist in getting more diversity in the arts, both on our board, our patrons on our stage, and the people who support us, identifying those barriers and figuring out how to break'",
        "'speaker_6': 'them down. And I think that those themes really cross over into many different societal areas, including our criminal justice system, a barrier in one areas, often a barrier in the other. So I bring my education and experience from that field to my work as a judge.'",
        "'speaker_6': 'And in that way, I think it's very relevant.'",
        "'speaker_0': 'Thank you. Thank you very much. Third question.'",
        "'speaker_6': 'What's up.'",
        "'speaker_0': 'Council member Carl Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. Ms.. Kling, how people handle a mistake can tell a lot about their temperament. And we'd like to have you tell us about a mistake you've made and how you realized you made that mistake and what made you change your mind.'",
        "'speaker_1': 'And did you correct yourself or reverse your mistake? Kind of a lot of questions. Yeah, there.'",
        "'speaker_6': 'But now I appreciate that question. Obviously, I do make mistakes and the struggle with being a prosecutor or a judge is that a lot of what my job is about is making judgments. So there's legal mistakes where you think the law is one thing and then you made a mistake and it's something else.'",
        "'speaker_6': 'And that's a little bit easier to identify and correct. And then what you think might have been a mistake in judgment. And so as a prosecutor, I had the luxury of speaking to juries after jury trials. And win or lose, I always took that opportunity to have a conversation with the jury about how they perceived the case'",
        "'speaker_6': 'that I had put on. And it taught me a lot about my judgment, my perceptions and theirs. And I learned a lot about how everybody might not see things the way that I see them. And I needed to be aware of that and learn from that.'",
        "'speaker_6': 'So there were times when I would have particular cases and the outcome would result in a way that I was concerned that I made a mistake in judgment. And in those times, I would talk to as many people as I could that would have some perspective on that situation that would be different than mine and try to'",
        "'speaker_6': 'learn what that perspective was so that I wouldn't make that same mistake in judgment again. Now I have a similar issue. Being a judge, I have to make judgment calls every day, and I don't know if I'm making a mistake or not.'",
        "'speaker_6': 'But being able to question that regularly is important. I did have a situation come up recently or I made a ruling in a case it was just about a month ago. So I need to be careful because I think the case is still pending.'",
        "'speaker_6': 'So I don't want to say too much specifically, but what happened was it was a motion to suppress evidence. And I made a ruling. And after I made the ruling, but before we left the courtroom, I had a moment where I was not confident that I had made the legally correct ruling.'",
        "'speaker_6': 'And what I did was I called the case back up. We went back on the record and I said to the attorneys, I'm having a moment, and I'm not 100% confident that I've made a correct ruling. I'd like to invite both of you to further brief this issue.'",
        "'speaker_6': 'And if you would like and so we can talk about it further, because I'd like to reexamine that decision that I've made. So I wanted to make sure that when I had that moment of not being confident that everybody had an opportunity to think about this a little bit more.'",
        "'speaker_6': 'And in criminal court, it is extremely rare for a judge to take a case under advisement. I have done it. Nobody likes it very much. It takes time. It means everyone has to come back to court. The attorneys want an answer because they want to be able to move on with their case.'",
        "'speaker_6': 'So it's not great, though I have done it. But in this case I didn't because I gave instead I gave the attorneys the choice if they wanted to bring that back before me and further argue it. So that's one way that I handled what was a potential mistake.'",
        "'speaker_6': 'I have not been appealed as far as I know, so I don't know of any specific legal mistakes that I have made. But if I truly made a ruling that was adverse to a part of the party and in particular adverse to a defendant that I later learned was an incorrect legal decision, I would undoubtedly have to'",
        "'speaker_6': 'make a suicide motion to reconsider, reconsider that. I would give the attorneys an opportunity to come back in and argue some more before I changed my ruling, because I don't think it would be appropriate for me to just go back into chambers.'",
        "'speaker_6': 'Guilt. You know what? I think I changed my mind and give everybody another shot at it, but I would take affirmative action to correct the mistake. I would never let a ruling lie that I felt was adverse to a defendant.'",
        "'speaker_6': 'That was incorrect.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'I don't know if other questions come to mind about the group. Thank you, Mr. Chair, and thanks for being here. I've enjoyed listening. I was not one of them on the interview panel. I've had the opportunity to get to know everyone.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'As well. So I was going to ask you to focus very much on your professional career. And I wanted to ask more of a personal question just to get to know you. Growing up in, you know, early in your life, maybe you could speak to any experiences that were formative and helping shape your values.'",
        "'speaker_0': 'And then secondly, people, you know, those are two very kind of different things. But were there moments in your life or experiences you had growing up that have shaped that particularly stand out as sort of shaping who you think you are as a person and the values you bring to life and as well as what individuals in'",
        "'speaker_0': 'your life have and how have they shaped your values.'",
        "'speaker_6': 'All right. Thank you for that question. So I grew up in a middle class, primarily white neighborhood in the East Bay of California. I did not have a very diverse upbringing. We were pretty homogenous group out there in Alameda County.'",
        "'speaker_6': 'And I went through life pretty comfortable. I had a family that was a whole family that never that never broke up in any way. My parents are still married after 62 years. I think it is now. They are still married.'",
        "'speaker_6': 'And and I and I had it, I'm going to say pretty easy. And the most formative times for me was when I started law school. And when I went to law school, I went to King Hall, which is named after Martin Luther King at UC Davis.'",
        "'speaker_6': 'And that is where I started getting the most exposure to different people and different ideas. And it was a good time to get it because it was in an environment where people were thoughtful, they were passionate, they were smart, and they wanted to talk about these issues.'",
        "'speaker_6': 'And I really started forming a lot of my feelings and opinions about the world and people and who I was throughout law school when I went to law school. I will admittedly tell you that I at 18 years old, I decided I was going to go to law school and I didn't know why I was going to'",
        "'speaker_6': 'law school. It just seemed like I would like it. It would be good at it. I was I liked to talk. You might have noticed, you know, I was a talker. And so it seemed like a good fit for me.'",
        "'speaker_6': 'And it wasn't until I got to law school and I started meeting people and speaking with people that it really started forming who I was as a person. And now, looking back, that's not surprising when you're 18 to 22 years old.'",
        "'speaker_6': 'And I now have kids that are 21 and 24 years old, and I get it, you haven't formed that quite yet. So I started meeting people who are particularly influential in my life, and I would say that many of them were women and they were women who were strong women in the legal community who introduced me to'",
        "'speaker_6': 'opportunity. At that time we were doing pretty well. I think we were about one in four attorneys were women. So it was still we're still in the minority, but I wasn't the only one. And I had significant role models that were women.'",
        "'speaker_6': 'And I had one internship as a young woman in law school with a private attorney who had her own practice in Davis, California. And she really empowered me to believe that I could do this and that I could be good at it and that I could live in what was still primarily a man's world.'",
        "'speaker_6': 'And then I had an internship with the Sacramento Prosecutors Office, and in that job, many of my supervisors were women. Many of the people in power there were women. And I worked in the domestic violence unit, and I was an intern and I wasn't a graduate of law school.'",
        "'speaker_6': 'And so my duties were limited. And what I primarily did was was provided support to victims and witnesses in domestic violence cases. So I would walk them through the process and help them understand what was going to happen, sit with them and talk with them about their stories.'",
        "'speaker_6': 'And that was the the day that I understood why I had gone to law school. Everything happens for a reason, and I hadn't figured out what it was yet, but that that internship woke me up to why I was meant to be there.'",
        "'speaker_6': 'So I did go on then to get my dream job, which was at the Alameda County Prosecutor's Office in Oakland, was one of the best respected. Prosecutor's offices in the country. And I was so fortunate to get to work there.'",
        "'speaker_6': 'There again, I had fantastic role models. My direct supervisor is now the elected district attorney in Alameda County. She's a fabulous woman. Fun fact. One of the women that started with me just a year apart, one year older than me was Kamala Harris.'",
        "'speaker_6': 'And we worked together for many years at the prosecutor's office. So so those were really special times. And I was surrounded by very strong, dynamic women who were able to teach me how to be not a prosecutor that goes for a conviction, but a prosecutor that seeks out justice.'",
        "'speaker_6': 'And one of the reasons that Alameda County was so respected is the diversity that we had on our team of prosecutors and the perspectives that we all brought. I also had the opportunity to work in Oakland for six years as a young, white, skinny prosecutor who did not come from that world at all.'",
        "'speaker_6': 'But I lived in it and I worked. I didn't literally live in it. I lived that world of Oakland, California. They were my witnesses. They were my victims. They were my defendants. And I learned so much about people during those six years and people who come from different places than I have since I've gotten to Washington.'",
        "'speaker_6': 'Some of my greatest influences have been the women who serve on the bench, particularly in King County, who have mentored me and encouraged me to seek this appointment. And it's those women who have told me that I can do this, that I am good at this, and that I am well suited for it, and that I should'",
        "'speaker_6': 'put myself out there to try to do it. So so I would say those would be my greatest influences are a combination of fabulous women. And of course, my mother, who had her first baby at 18 and her and me at 27 and I was the third by 21, she had two babies and she did a two'",
        "'speaker_6': 'year community college stint to become a dental hygienist. She had a loving and supportive husband. As they told you, they've been married 62 years. And and she also, of course, always through my life, was one who told me that I could do anything but maybe don't get pregnant when I'm 18 like that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Our last question would be an opportunity for you to provide any closing remarks.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'I will.'",
        "'speaker_6': 'All right.'",
        "'speaker_1': 'So by now.'",
        "'speaker_6': 'I think most of you probably know a lot about me.'",
        "'speaker_1': 'A lot more.'",
        "'speaker_6': 'Than a lot of my friends do. Probably you've heard about you've read my application, you've heard from me, you've heard from judges who I'm so humbled by the letters that they have written on my behalf. I believe that you've heard from staff that I work with.'",
        "'speaker_6': 'You've heard from ratings committees, you heard from community members. So you know a lot about me, what I do, who I am. So I would like to just leave you with some bullet points of why I think I'm uniquely qualified for this appointment.'",
        "'speaker_6': 'I would like to return to the theme that this is a very multifaceted job, and I have a breadth and depth of experience that I think fits well in the job of 15 years in the King County District Court, both as an advocate and as a judge.'",
        "'speaker_6': 'I have strong connections with the East Side communities. Bellevue was my home. Redmon was my workplace. I worked for the city of Redmond, and in that capacity I worked on committees. And Redmond is one of King County District Court's clients, if you will.'",
        "'speaker_6': 'They were they contract for that service. And so as an employee of Redmond, I sat on committees with the King County District Court representatives and with the mayor's representatives and with representatives from the prosecutor's office and other places in the city.'",
        "'speaker_6': 'And we work together to find solutions to issues that would come up. And we worked together to figure out how to King County and Redmond, the city of Redmond, would work together. So I have experience with that. I have relationships there, and I understand the complexity of that relationship.'",
        "'speaker_6': 'I understand budgeting. I worked in Redmond with the Budgeting by Priorities Initiative. Every year we had a cut where in the prosecutor's office 20% sounds like a lot, but 20% of our work force was cut when we had two full time and one part time prosecutor and the part time job that cut and that's an extreme cut'",
        "'speaker_6': '. When you now go to only two full time prosecutors, it was myself and Larry and. And we figured out how to make it work and we had to revise our budget and we had to work with the mayor and his committee on figuring out how that was going to work.'",
        "'speaker_6': 'I went through the lean process in Redmond where we went through each department and figured out how we could work more efficiently to save money. As president of Village Theater, which I will start my term as president elect in September and then followed by a three year term as the president of that organization.'",
        "'speaker_6': 'Not only will I lead 30 very diverse board members, but I will oversee a $14.4 million budget which our board sets and approves and enforces every year. So I and arts are notoriously underfunded, so I understand doing more with less.'",
        "'speaker_6': 'I understand budget cuts and I understand finding creative solutions to budget issues. So I want you to understand that I am obviously qualified to do the courtroom work. I do the courtroom work every day and the judges that I work or who have spoken on my behalf and made that clear.'",
        "'speaker_6': 'But I want you to know that I'm also qualified, prepared and eager to do all the other aspects of the job of King County District Court judge. And not only am I prepared and qualified, but I'm excited. I hope that you will decide to appoint me to this position, and I will have so much more to contribute'",
        "'speaker_6': 'as a full time sitting judge.'",
        "'speaker_0': 'Thank you. Thank you very much.'",
        "'speaker_6': 'All right.'",
        "'speaker_0': 'We appreciate it.'",
        "'speaker_6': 'We do it.'",
        "'speaker_0': 'Yes.'",
        "'speaker_6': 'Thank you, everyone, so much. All right.'",
        "'speaker_0': 'It was a brief pause as we wait. Michelle Goldston, who? If you let me go here.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Let's see what.'",
        "'speaker_0': 'Kids yours.'",
        "'speaker_1': 'First. Your second.'",
        "'speaker_5': 'The second one in there? Yep.'",
        "'speaker_0': 'Our third one. Good luck.'",
        "'speaker_1': 'Thank you. Sorry. Sorry. Thank you.'",
        "'speaker_0': 'First to discussion. Welcome. I'll start off with the first question, and that is to ask you to briefly introduce yourself. Describe your background and why you'd like to be a district judge. All right.'",
        "'speaker_1': 'Thank you, Mr. Chair. Kent County Council members. My name is Michelle Gelfand. I am a Bothell, the municipal court judge. Can you hear me okay, Councilman? About that? Thank you. Being a judge enables me to make a difference in people's lives.'",
        "'speaker_1': 'I am seeking the King County District Court position because King County is at the forefront of innovative restorative justice programs such as community court, mental health court and Veterans Court. Those programs make a difference and they are a solution.'",
        "'speaker_1': 'And I want to be a part of the solution by bringing my skills, experience and dedication and commitment to improving justice. My legal experience began in King County as a special deputy prosecuting attorney. I then was hired by Snohomish County Prosecutor's Office.'",
        "'speaker_1': 'I was a prosecutor in the criminal division for four years, and then I was in the civil division for three years as a mental health prosecutor. During that time, I also was a pro tem for three years, and in 2010 I was appointed to the Berkeley Municipal Court bench as the sole judge.'",
        "'speaker_1': 'I have been there for nine and a half years and I have presided over approximately 35,000 cases, 45 jury trials and hundreds of motion. In addition, I also am in charge of the management and operation of the court.'",
        "'speaker_1': 'I manage a court team and they are an amazing court team of seven and I operate $1,000,000 annual budget. I also believe truly that a good judge is not only in the courtroom, but is in our community and in our neighborhoods.'",
        "'speaker_1': 'And I have volunteered thousands of hours in local elementary, middle school and high schools teaching civics. And I also saw a need when I was very early on the bench that we needed a ball for youth court. And I created the Bubble Youth Court.'",
        "'speaker_1': 'I created a bottle probation department, as well as assisted in establishing a mental health court in Snohomish County. I have a track record of leadership. I am the President elect at this time of the District Municipal Court Judges Association.'",
        "'speaker_1': 'That association is composed of 200 of my colleagues, fellow judges, and I am slated to be the President next year. I want to make a difference in our community, and I hope to be on the Austin 16 bench of King County District Court, and I'd be happy to answer any questions.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Question two. Councilmember Gossett.'",
        "'speaker_2': 'Thank you, Mr. Chair, and thank you, Michelle, for being willing to go through these grueling interviews and going out and getting community support. I had the opportunity to read many, many letters of support that you've gotten and you got them early on.'",
        "'speaker_2': 'That was significant. Interesting to me. But I'd like for you to describe your understanding of racial inequities or the way in which racial injustice or injustice works in our judicial system. And you can determine whether or not you think it works.'",
        "'speaker_2': 'And then secondly, I'd like to know if you've worked on issues, on cases in your career relative to conflicts based on race and class. And then lastly, how would you seek to address issues related to race or class inequities if they should arise and the district court that you have that you preside over?'",
        "'speaker_1': 'All right. First of all, I think the first question is racial inequities and racial injustice. Injustice.'",
        "'speaker_2': 'And I don't think racial inequities exist.'",
        "'speaker_1': 'No, I'm not going to correct you. Unfortunately, they do exist. And there, as we know, that our system penalizes, I believe, people of color and low income because of the incarceration rates that we see in our county pretrial.'",
        "'speaker_1': 'And so what I'd like to do is how would I address those issues? I've addressed them in Bothell as well under the as we've seen from the Gender and Justice Commission. And the study that they have completed is that I believe that we have 14,000 people sitting in jail, 16, 500 awaiting trial.'",
        "'speaker_1': 'And that just does not correlate with the presumption of innocence. This is pretrial. And we know that the people that are incarcerated are much higher numbers of people of color and poverty. And I think that as a judge, to address those issues, you have to be questioning the prosecutor.'",
        "'speaker_1': 'I'm constantly questioning our prosecutors on 3.2, and that's the criminal rule when the jurisdiction and why you cannot hold or release somebody. And I think that as a judge, that's how that's one of the things that you can do to address that issue.'",
        "'speaker_1': 'And I think that we have to do better and that we can say I think that the the I know that it's stated in the article that you could say save up to $12 million by releasing people pretrial.'",
        "'speaker_1': 'Now, of course, you have to keep into consideration the public safety aspect as well. And so that is what I do every day is weighing public safety with personal liberty. Thank you. You're welcome.'",
        "'speaker_0': 'Thank you. Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. Michel. Judge Gilson, rather. Welcome. Thank you. And so again, how an individual handles a mistake can reveal a lot about that person's temperament. So we'd appreciate it if you could tell us at a time in which you've made a mistake and how you recognize that, how you handled it.'",
        "'speaker_1': 'Did you correct yourself or reverse the mistake or just give us a feel for how you handle have handled that or would handle. All right. Thank you. Thank you. Definitely over my legal career and as a judge, I've made mistakes.'",
        "'speaker_1': 'We are not infallible. We are not perfect. And I think that what we have to do is absolutely recognize the mistake and correct it. And a judge does that either by making having the parties come back and change their ruling.'",
        "'speaker_1': 'But I can't give you a specific example of something that I did on a sentencing. And I had a judge. Woman in front of me who was in custody. And I truly believe that that in a district in and use of a court and as a municipal court setting as the People's Court, it is the judge's job'",
        "'speaker_1': 'to try to get somebody to change behavior. And you're always looking for the sweet spot as a judge. How much time do you do you have to give jail time? Is there a different is there a least restrictive alternative that you can give to get them to change behavior?'",
        "'speaker_1': 'So I had a gentleman in front of me. I he had substantial criminal history. I gave him a high end sentence. And you could tell it had completely deflated him and he stopped listening. And I believe the sentence was on a Friday.'",
        "'speaker_1': 'I thought about it all weekend, and I had him brought back. I had a discussion with him, dialog with him. He had a he didn't have enough time to really tell me what had brought those issues in his life.'",
        "'speaker_1': 'And so we created a plan. And so I said, I want you to do, you know, get treatment. I want you to do this. I want you to do this. I'm going to see you in 30 days. If it's not done, then we're going to start with a 60 days jail.'",
        "'speaker_1': 'You're welcome. Thank you. Councilmember Cool.'",
        "'speaker_0': 'Are there any follow up questions that I would ask you to share, any closing remarks?'",
        "'speaker_1': 'I just want to just briefly as well to follow up on Councilmember Goss's question as well. So I think that we truly we really need to look at our least restrictive alternatives that we now have, which is the SCRAM bracelet, the GPS, DV unit, those sorts of things to keep people out of custody and keep our community'",
        "'speaker_1': 'safe. Thank you. You're welcome. Well, again, I want to thank council members for having me here this afternoon. As I stated, I would really like to be appointed to the King County District Court because I have a desire to make a positive difference in people's lives.'",
        "'speaker_1': 'And I think as a judge, you have an extreme amount of power to either make a positive difference or a negative difference. I have nine years of judicial experience plus three years of protesting. I have created innovative programs, and I have a track record of leadership.'",
        "'speaker_1': 'I have been acknowledged by my peers from Snohomish County as winning judge of the year, from Washington woman lawyers. I by winning the Vanguard Award or being given the Vanguard Award and also am on the Legal Education Flame of Democracy Award.'",
        "'speaker_1': 'These awards reaffirm that what I'm doing in the community is making a difference and inspires me to do more. I am passionate. I have a strong work ethic. I am dedicated to improve our justice system, and I would be honored to be appointed to the King County District Bench, which it is such an esteemed bench.'",
        "'speaker_1': 'Thank you for your time.'",
        "'speaker_0': 'Thank you very much. Thank you. We'll now invite the first two interviewees to join us. And why is it the committee's desire to have a few minutes in executive session then before we actually invite them into the room, will excuse everyone from the room.'",
        "'speaker_0': 'And to do that, we will have executive session under CW 4231 ten. The committee is going to an executive session to evaluate the qualifications of an applicant for public employment. We will be in executive session for approximately 10 minutes and until approximately 344.'",
        "'speaker_0': 'Now I'm asking the public to leave the chambers at the time, as well as any kind of employee not directly necessary for these discussions. Thank you. That's the big theme to the dedication. Good afternoon. We're coming out of executive session.'",
        "'speaker_0': 'This is a committee of the whole continuing our Monday, July 15th meeting, and I would entertain a motion on item five on today's agenda. Councilmember Dombrowski. Thank you, Mr. Chair. On proposed motion 2019 0307.1. That's position number two.'",
        "'speaker_0': 'I move. Adoption Council member Dombrowski has moved adoption of Motion 2019 307, making the appointment to position two of the Northeast District District Court. Councilmember Dombrowski Mr.. Online 25 where the is a blank space I move that we insert the name of Michelle Gilson.'",
        "'speaker_0': 'It's been moved in seconded. We amend motion 2019 307 to have the name of Michelle Gilson speak to speak to each member. Dombrowski. Just very briefly, Michelle was the strong choice coming out of the select committee. Her background and experience impressed us and me as a representative of the Boston community.'",
        "'speaker_0': 'She comes before us with the strongest of recommendations, including many from our friends to the North, with her roots in Snohomish County, putting their prosecuting attorney. She has served the city of battle extremely well in terms of administering justice, but also in running the court from an administrative perspective.'",
        "'speaker_0': 'Her work has been recognized with the awards that she noted here. Frankly, unusual for a municipal court judge to be recognized in some ways. And that caught our attention. Our bar rate ratings are also impressive. I tend to look at those and weigh those heavily.'",
        "'speaker_0': 'I think as many members do in this process. And I just think she will serve us very well on the district court and encourage my colleagues support for her. See no further discussion. Councilmember Gossett.'",
        "'speaker_2': 'I'd like to second Councilman Dombrovskis recommendation. I first time I met her, I was so impressed with the wide variety of letters that she's gotten from legal as well as community folks and politicians. And still, at the end here, when I look at all the support letters and comments for all three candidates, the quality and the number'",
        "'speaker_2': 'are just amazing for her. So I look forward to joining Councilmember DEMBOSKY and supporting this extremely well qualified person for this position.'",
        "'speaker_0': 'Thank you, Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'd also like to say that I support this. I believe that Michelle is very innovative. I really liked reading all the letters, and it was clear that she's done a lot in the community and dealing with restorative justice.'",
        "'speaker_1': 'And she also has starting the youth court. And during the interviews earlier we she talked about how there were many changes and adaptations and things to improve that, and I really respected that. She continued her perfected work going on and on.'",
        "'speaker_1': 'And I know in one conversation we were talking about some ways to help children, and she followed up with me afterward to say, Tell me more about children and their vision problems and how that impacts. So I was very impressed with the idea that when she heard an idea, it just clicked.'",
        "'speaker_1': 'So I support this.'",
        "'speaker_0': 'Thank you, Councilmember Bell, DG.'",
        "'speaker_1': 'Thank you, Mr. Chair. There's not a really good time in the agenda to say this, so I'm just going to say it now. If we had three openings, these are all three extraordinarily well qualified candidates. So I just wanted to say that at this moment before we start picking people to be appointed and and I hope that'",
        "'speaker_1': 'it comes through to the public and to everybody who's following this process, that what we have here are three people who are really committed to strong judicial practice. They've given years of their lives to working on the bench.'",
        "'speaker_1': 'And that takes that takes a little bit of that takes some sacrifice. You can't have a completely unlimited private civil practice or even criminal practice and and pro tem the way these folks do. You have to give up some stuff to do that.'",
        "'speaker_1': 'And so and they all come with strong recommendations, a great deal of relevant experience, and importantly, a civic record of working outside the court just to make the community a better place, which I think reflects well on their on their abilities and what they will bring to the courtroom.'",
        "'speaker_1': 'So I just wanted to say that before we started picking and I agree with my colleagues and everything that's been said about Judge Gilson, you know, we ask questions. And one of the questions that I had was whether a municipal court experience translates directly to a district court experience.'",
        "'speaker_1': 'But from everything I've been able to judge, from talking to folks who have worked with Judge Gilson and others, that they believe very strongly that she would be able to make that transition very well. And I was exhausted reading her her application materials, and she's done all of that stuff.'",
        "'speaker_1': 'So I think she's going to work very, very hard to make sure that she she is a strong district court judge. And I look forward to voting yes on the motion.'",
        "'speaker_0': 'Thank you for the discussion. Others in favor of Councilmember Dombrowski is amendment. Please say I opposed nay. The ayes have it. The motion as amended for the discussion. Councilmember Dombrowski, just to close the story from Judge Wilson's application materials, she's a hands on practitioner of restorative justice practices, and she described the youth court that she founded in'",
        "'speaker_0': 'the city of Bothell and observing a difference in the outcomes based on whether it was a young man or a young woman in a justice circle, a peace circle, if you will, where the conduct, as she described it, of the young woman warranted perhaps a more lenient sentence.'",
        "'speaker_0': 'It was reflective of the young woman's understanding of the infraction and her ability and willingness to do better versus the young man who was a little less sympathetic. But it turns out the result was different. So she took that experience to heart, reflected on whether or not they were really practicing the principles of restorative justice and changed'",
        "'speaker_0': 'the system. I thought that encapsulated all that we want in our judicial system today awareness, a willingness to implement new practices and a willingness to continue to revise and improve them. Her initiative and not just saying she's doing it, but actually doing it and doing it well, really struck home with me and confirmed everything that we've heard'",
        "'speaker_0': 'about her. I'm excited to see her join the district court. Congratulations. Thank you. Madam Croak, will you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Balducci. Councilmember Dombrowski. Councilmember done. Councilmember Gossett, I. Councilmember Caldwell's. Councilmember Lambert. Councilmember of the Grove. Councilmember Bond right there. Mr. Chair. Hi, Mr. Chair. The vote is 99 zero no's.'",
        "'speaker_0': 'Thank you. We have given a do pass recommendation to motion 1219 307 as amended. We'll send that to full council and regular course on on consent without objection. That takes us to item six in today's agenda. Congratulations that exist item six on today's agenda.'",
        "'speaker_0': 'Motion 2019 308 Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'd like to move. Propose motion 2019 0308.'",
        "'speaker_0': 'Councilmember Lambert has moved adoption of Motion 2019 308.'",
        "'speaker_1': 'Councilmember Lambert I'd like to move an amendment for Lane 25 and insert the name juggling.'",
        "'speaker_0': 'Councilmember Lambert has moved that we amend motion 2019 308. Councilmember Lambert.'",
        "'speaker_1': 'Thank you. Well, I'm I agree with what Councilmember Balducci said. We have a strong group of candidates that we were able to interview among the strongest group of candidates that we've ever had. And so the decisions are difficult.'",
        "'speaker_1': 'But I feel that Jewell's solid experience, she's effective and efficient on the bench. She has a very caring manner and looking to people and how to make people's lives better. And she also has experience that's going to be particularly powerful right now as we transition to the new computer system.'",
        "'speaker_1': 'And so I thought that that would be helpful. She's also known and highly respected in the community, and I think that that's important, that the judges be respected in the community. And I think her transition for many reasons will be very smooth.'",
        "'speaker_1': 'And I look forward to her being on the bench on the east side.'",
        "'speaker_0': 'Thank you for the discussion.'",
        "'speaker_2': 'Councilmember Gossett I just wanted to have the opportunity to concur with my colleagues that all three of these candidates were and are extremely well qualified. I do. But before we close, I did want to say about Kevin Peck that his excellent interviews that he had with the Latino and African-American bar associations, I was thought that I pay'",
        "'speaker_2': 'particular attention to, and that is the articulation of issues relative to social justice. And this community in this society are ones that, you know, if he doesn't get elected, I hope that he will continue to stay involved in looking for a judicial position or a leadership position in the judicial system, where he can even more effectively carry'",
        "'speaker_2': 'on the kind of understanding, experience and skills that that he has. But I agree with everybody. All three of these candidates are superbly well qualified.'",
        "'speaker_0': 'Thank you, Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. What Councilmember Bell did, she said, was really very poignant and very significant. And a number of us have known Kevin Peck for a long time and have the greatest respect for him. And when she said and a couple of others implied that, that we really do hope that the third person in this case'",
        "'speaker_1': ', Kevin, will apply for the next opening. And I think there would be a lot of support. You never know. But I certainly would encourage that. Thank you.'",
        "'speaker_0': 'Thank you. See no further discussion of those in favor of the amendment. Please signify by saying i. I those opposed nay. The ayes have it. The motion as amended. Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I just want to say a final passage to say that we have great candidates. And I think that Joe will do an awesome job representing the east side of the county. I know that they rotate around the county, but I think her demeanor and her caring attitude will be useful and helpful to people changing their'",
        "'speaker_1': 'lives.'",
        "'speaker_0': 'Thank you. But Councilmember Belushi.'",
        "'speaker_1': 'I know I should stop at this point, but I'm very I'm very excited to support Judge Kling becoming that full time seat at the table, person getting involved in helping to make change in our courts. But I really, really do hope that we get an opportunity to elevate Judge Peck as well, because I was very impressed with'",
        "'speaker_1': 'your deep, lifelong commitment to equity and justice that comes out in everything that you do and everything that you say. And and frankly, these proposals, people should steal them and do them anyway. And then you should get the credit.'",
        "'speaker_1': 'And I hope that you don't give up. I hope that we see you here again. Thank you.'",
        "'speaker_0': 'Councilmember Dunn. Thank you. Forgive me. A little cold here. Just wanted to say thanks for your your interest in this. And you guys all ran the gantlet. It's really challenging to get this appointment. It's the first time I've seen three really, really outstanding candidates come before us where there was very little to create gaps in terms of'",
        "'speaker_0': 'how to rank order the cabinet. You and I had a chance to litigate against each other back in the day when I was a federal prosecutor. And you had a fantastic job for your clients. And I will tell you this.'",
        "'speaker_0': 'This is an interesting job because we get to see people again and again come up at appointments that occur for positions that we might have another one at six months or three months or eight months. And so I've seen many times where so it did get get the gig that they came forward a few months later and'",
        "'speaker_0': 'got it. And it has a part to do with your continued commitment, but also we're familiar with you. We like you. There's a lot of good stuff that was said here about you today. So I'm just really excited that all three of you are here in our county, work at various capacities.'",
        "'speaker_0': 'Look forward to supporting the nominees today, and we'll take great interest if you decide to play again. Thank you. Would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council Bell. Duty Council member Dombrowski. Council member. Done. All right. Council Member Gazette. Council Member. Coles. Council member. Member. Council. Member of the group. Council Member one right there. Mr. Chair. All right. Mr. Chair, the vote is 990.'",
        "'speaker_0': 'Thank you. By your vote, we've given a do pass recommendation to motion 2019 308 as amended, and we will send that to full council in regular course meeting a week from Wednesday on consent. Without objection and without congratulations.'",
        "'speaker_0': 'Thank you. In knowing of no other business to come before the committee. We are.'"
    ]
}