{
    "A MOTION confirming the executive's appointment of Shawn Peterson to the King County gender identity and sexual orientation inclusion task force, representing the Na'ah Illahee Fund.": [
        "'speaker_0': 'Any person in the minutes have been abducted. Well, now go to number five on our agenda, which is to confirm the appointment of Shawn Peterson to the King County Gender Identity and Sexual Orientation Inclusion Task Force. And Shawn is representing the nonaligned he fund.'",
        "'speaker_0': 'The task force was established in 2000, meeting to develop a recommended countywide gender identity and sexual orientation inclusion strategy and work plan to implement the use of an additional gender designation or designations in all appropriate administrative processes and use by county departments.'",
        "'speaker_0': 'We have Sam Porter with us from our central staff to provide the briefing on this item, along with the appointee to answer any questions. Sam, I'll turn it over to you. And do we have Shawn with us?'",
        "'speaker_2': 'Yes, we do.'",
        "'speaker_0': 'You are as Shawn.'",
        "'speaker_2': 'Thank you, Madam Chair. For the record, Sam Porter, Council policy staff. The documents for this appointment began on page eight of your packet. Your summary of its course was very comprehensive. It was established through motion 15162 in June 2018.'",
        "'speaker_2': 'And they have the task force has been meeting in accordance with the initial framework that was adopted through motion 15623. According to executive staff, they are anticipated to complete their work in mid 2022. The proposed motion would appoint Shaun Peterson.'",
        "'speaker_2': 'She currently serves as the Gen seven program coordinator for the Lahey Fund. According to the organization's website, she has more than five years of experience in youth program development and implementation, including a program called Native Girls Code, which is focused on computer coding, coding and culturally relevant STEM content for Native girls.'",
        "'speaker_2': 'That concludes my remarks. Sean is with us along with Mina from the Executive Office.'",
        "'speaker_0': 'There and Max. Sam, before we proceed. Are there any questions of Sam? Okay. Well, welcome, Sean, to our committee of the home meeting and congratulations on your appointment. And I would like to invite you to tell us a little bit more about yourself and about why you wanted to be serving on the task force.'",
        "'speaker_2': 'Thank you, Chairwoman. My name is Sharon Peterson. She her.'",
        "'speaker_0': 'Channel.'",
        "'speaker_2': 'Baby.'",
        "'speaker_0': 'Will come.'",
        "'speaker_2': 'From Vancouver Island, Canada. And I work for the not only fund. And my current role actually is community partnerships manager. I just changed roles and this work is very important to me because within my organization I'm really trying to bring forward LGBTQ.'",
        "'speaker_0': 'Lens to separate lens.'",
        "'speaker_2': 'As our organization historically has served native women and girls and as a queer identifying person, it's really important.'",
        "'speaker_0': 'That we're visible.'",
        "'speaker_2': 'And that we have a place. And so I was.'",
        "'speaker_0': 'Approached to sit.'",
        "'speaker_2': 'On this task force because there weren't very many there wasn't another indigenous person sitting in that space. And I think it's really important for me as an indigenous woman living in the city of Seattle to have a voice when it comes to these kinds of things as relates to the county.'",
        "'speaker_0': 'Thank you. And congratulations. Have you been able to attend any church? Yes, I.'",
        "'speaker_2': 'Have been attending regularly for probably the past three months.'",
        "'speaker_0': 'Terrific. Yeah. Is there anything you would like to share with us about your impressions of the task force and thing that you particularly want to work on or emphasize?'",
        "'speaker_2': 'Oh, yeah. I have really been impressed with my colleagues in the committee and how much experience that they have, and it's a variety of communities represented, which I think is really important. And a lot of, you know, communities in this area that are marginalized and really trying to put a voice to how these things are implemented, and'",
        "'speaker_2': 'then also how one of the mechanisms at which any of our recommendations are put into place in the county, and that those that we see those through and that we have a way to understand. And once we put things forward, like how it's actually.'",
        "'speaker_0': 'Going to be done.'",
        "'speaker_2': 'Is something we just variously.'",
        "'speaker_0': 'Talking about. Anchor. Are there any questions of Sean or comments anybody would like to make on the council? Let me. Constantly rebounding.'",
        "'speaker_2': 'I was just a thumbs up. And I thank you for serving. Yeah, thank you.'",
        "'speaker_0': 'Yes, very much. Thank you for serving. Councilmember Dombroski was the honor, I should say. Yes. Councilmember Brenda Dombroski was the one who actually came up with the idea for this task force and got it going. And Councilmember Dombroski, give anything you want to comment on.'",
        "'speaker_1': 'I just will thank Shawn for their service and move approval of the motion if you're ready.'",
        "'speaker_0': 'Okay. The motion has been made. Before we go to that. I'm wondering, though, if Meena from the executive office would like to say anything. Good morning, Mina. Thank you, Madam Chair.'",
        "'speaker_2': 'For the record, Mina Hashemi with the executive offer. We are excited about Sean and that path for our staff. Significant time in 2021 doing outreach to ensure that we had a diverse and full task force. And we are excited about Sean's experience and the passion that she'll bring to this work.'",
        "'speaker_0': 'Thank you. Thank you. Is there anybody else? The motion has been made to a proposed motion 2020 20051 to give it a due course recommendation. Does anyone else on the committee want to say anything else? Okay with that, could you please call the role and propose motion 2020 20051.'",
        "'speaker_0': 'Thank you, Madam Chair. Council member Banducci. Hi. Council member Dombrowski, I. Councilmember Dunn.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'And some of them.'",
        "'speaker_1': 'McDermott, I.'",
        "'speaker_0': 'Councilmember Berry.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember at the ground. Councilmember Bond. Ray Bauer. Council member. Caroline.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Madam Chair, on the board is ayes. No, no. Council member. Bond. Bye bye. Excuse. Thank you. Council member. And can vote before the meeting screen. That. Please let us know. Thank you, Rick. Our vote. We have approved proposed motion 2020 2005.'",
        "'speaker_0': 'When we will send this motion with the due pass recommendation for the consent agenda to the April 30 Council meeting on stemming objections. Great. Congratulations, Sean. We will be taking this up on the consent calendar. You do not have to be at the meeting to speak.'",
        "'speaker_0': 'And if you are wanting to be there, you can tell them otherwise. And we will, of course, let you know after the fact as well. Thank you.'",
        "'speaker_2': 'Great. Thank you all so much. And thank you, Madam Chair. Thank you.'",
        "'speaker_0': 'Great. Okay. Our next item, number six is a briefing on a 2020 to be 0039 with King County Regional Homelessness Authority. Providing an update will be Mark Jones Chief Executive Officer and also Felicia Sauceda, who is Executive Director.'"
    ],
    "AN ORDINANCE relating to the membership of the King County board of health; amending Ordinance 14989, Section 3, as amended, and K.C.C. 2.35.021, Ordinance 14989, Section 3, as amended, and K.C.C. 2.35.021, Ordinance XXXXX, Section 3, and K.C.C. 2.35.XXX (Section 3 of this ordinance), Ordinance XXXXX, Section 4, and K.C.C. 2.35.XXX (Section 4 of this ordinance), Ordinance XXXXX, Section 5, and K.C.C. 2.35.XXX (Section 5 of this ordinance) and Ordinance XXXXX, Section 6, and K.C.C. 2.35.XXX (Section 6 of this ordinance), adding new sections to K.C.C. chapter 2.35 and repealing Ordinance XXXXX, Section 2, and K.C.C. 2.35.XXX (Section 2 of this ordinance).": [
        "'speaker_0': 'Great. Thank you for the time. Our next and final agenda is an ordinance that would conform the membership of the King County Board of Health to a new state law, as amended last year by the state legislature and second substitute House Bill 1152 that was adopted in May of 2001 and made some additional related changes.'",
        "'speaker_0': 'Councilmember McDermott is the sponsor of this legislation. I just marry my name to that to a council member. About a council member. McDermott is chair of our Concurrent Board of Health, and we are going to have Sam Porter from our central staff to provide the briefing along with Amber Quinn and Susie Baby from Public Health, Seattle and'",
        "'speaker_0': 'King County to answer any questions. But before we start, Councilmember McDermott, you want to make any opening remarks.'",
        "'speaker_1': 'Madam Chair, I'll just briefly say, as we introduced in the Senate will spell out in more detail this is coming about because the legislature in 2021 amended or restructured local boards of health. And so this is the step we need to take as a council, as a county, to then allow the Board of Health to engage in'",
        "'speaker_1': 'an active recruitment process for its non-elected members, which by state law now has to increase and prompt attention to. This legislation, will give us the opportunity to have a very robust outreach and recruitment process for non-elected members of the Board of Health, and then to take up to bring those nominees back to this council who will actually'",
        "'speaker_1': 'make the legal appointment to the Board of Health. And as as you and council members Ottaway and Taberski know, as members of the Board of Health, we have great participation and involvement from our smaller number of health professionals that are on the board now.'",
        "'speaker_1': 'And in fact, we have a history of including non board members, public members on task forces and committees we have formed over the decade. I have served on the Board of Health. So I think this is a way to strengthen and bring more voices to our work and look forward to its outcome, even as it will be'",
        "'speaker_1': 'a major topic of work, body of work for the Board of Health this year.'",
        "'speaker_0': 'Thank you, Councilor McDermott. And as I went over to the staff report, there was a lot I've learned in terms of what I hadn't realized I was going to be part of this. So it's a bit complicated. I think it's by reaching very significant and I think it seems like we're going to end up with a very'",
        "'speaker_0': 'much stronger Board of health in terms of the composition. So thank you. And with that, we will turn to Sam Corder. Go right ahead, Sam.'",
        "'speaker_2': 'Thank you, Madam Chair. The documents for 2020 20103 begin on page 15 of your packet. By way of background, the King County Council was originally designated as the Board of Health in 1993 through Ordinance one 1178. In December of 1995, Ordinance 12 098 added four council members from the city of Seattle, three electeds from suburban cities, and'",
        "'speaker_2': 'three health professionals to the 12 King County Council members for a 22 member board. Subsequent ordinances have resulted in the current 11 member board, which consists of three King County members, three from City of Seattle, and two electeds selected by the city's association, and three health professionals under state law and the entire local agreement for public health'",
        "'speaker_2': 'services between the City of Seattle and King County. The King County Board of Health is responsible for setting countywide public health policy, enacting and enforcing local public health regulations in line with state law, and establishing fees for license, licenses, permits and other services.'",
        "'speaker_2': 'As you mentioned, in 2021, the Washington state legislature has passed House Bill 1152, which increases the number of non-elected members on local boards of health across the state. Proposed Ordinance 2020 20103 would conform the membership of the King County Board of Health to this law.'",
        "'speaker_2': 'And these changes include requiring an equal number of non-elected members, as there are elected on the board, replacing the existing three health professional positions with eight non-elected members, with one of those selected by the American Indian Health Commission and seven members recruited, selected, recruited, and selected by the King County Board in accordance with State Law and Washington'",
        "'speaker_2': 'State Board of Health Rules. These members are required to represent three categories, which are public health, health care facilities and providers, consumers of public health and other community stakeholders. Non-elected members shall have voting powers on all matters except those pertaining to setting or modifying permitting, licensing and application fees.'",
        "'speaker_2': 'The proposed ordinance also sets appointment procedures and terms structure for non-elected members. Codifies the current practice for elected member alternates and removes the requirement that it King County Council members vote is counted as two votes. In addition to these changes to comport with state law.'",
        "'speaker_2': 'The proposed ordinance would also codify the practice for election of the Chair, provide compensation of $225 per board meeting for non elected members who are not otherwise compensated by their employers for their participation and require alternates for non elected members.'",
        "'speaker_2': 'The proposed ordinance would also allow the current membership requirements that are in King County Code to remain in place through the. December 31st of this year. House Bill 1152 directs the Washington State Board of Health to promulgate rules regarding the selection and appointment process for non-elected members of local boards of health.'",
        "'speaker_2': 'State law requires that these board rules go into effect no later than July 26, 2022. And the changes to the membership of local boards of Health due to 1152 are to go into effect July 1st of this year.'",
        "'speaker_2': 'The proposed ordinance would retain the existing elected member positions on the board and codify current practice of selecting alternates. This means that the elected membership would continue to include three King County Council members and one alternate three elected officials from the City of Seattle and one alternate and two elected officials from cities and towns other than Seattle'",
        "'speaker_2': 'and two alternates. The proposed ordinance would remove the requirement of to that King County members would have to weighted votes and codify the current practice that the board chair is elected from among the King County members. The proposed ordinance would replace the three health professional positions on the board, with eight new non-elected members that are representing positions'",
        "'speaker_2': 'as shown in Table one, which is on page 18 of your packet. State law requires that one of these members is selected by the American Indian Health Commission. The remaining seven members are to be selected from those three categories described in Table two in more detail, which is page 19 of your packet.'",
        "'speaker_2': 'Only members selected from the public health consumer category are required to be residents of King County. Only one non-elected member can be selected from any single type of background or position as described in the three categories. And the proposed ordinance would require an equal number of non-elected alternates, as there would be elected alternates with one of those'",
        "'speaker_2': 'non-elected alternates to be selected by the American Indian Health Commission. The proposed ordinance states that one of the non-elected members representing public health, health care facilities and providers should have knowledge of environmental health, including septic systems and groundwater quality.'",
        "'speaker_2': 'This provision is currently in King County code to be fulfilled by one of the health professional members on board. State law includes a formula for the distribution of non-elected members across these three categories. For the King County Board, it becomes the number of not elected members.'",
        "'speaker_2': 'After the eight agency member is seven, there must be two members from each of the two from two of the categories and three members from the third category, which results in a mostly even distribution. Given that it's an odd number.'",
        "'speaker_2': 'The proposed ordinance. Section five outlines the proposed term structure for the non-elected membership of the board. For initial terms, this would be two members serving a one year term. Three members serving a two year term and three members serving a three year term.'",
        "'speaker_2': 'A full term would be considered three years, but initial terms are considered full terms when considering eligibility for future service. The proposed ordinance states that the Council would appoint by motion the non-elected member candidates selected by the Board and the HRC member and outlines the requirements for what the Board needs to transmit for these appointments to be'",
        "'speaker_2': 'made. The Board would need to transmit these materials to no later than October 28th of this year. Section six of the proposed ordinance would allow for compensation to be paid to non-elected, regular and alternate members of the board who are not being compensated for their participation through their employer.'",
        "'speaker_2': 'The proposed rate of compensation is $225 per full board meeting attended not to exceed that amount each month beginning January 1st, 2024 and each year thereafter. The compensation amount would be automatically adjusted by the Consumer Price Index for all urban consumers the Seattle Tacoma Bellevue area, also known as CPI U.'",
        "'speaker_2': 'If the 12 month change in CPI was negative, there would not be an adjustment. This CPI view provision is included in the most recent board compensation package for the Children and Youth Advisory Board adopted in Ordinance 19397. The estimated maximum annual compensation for the board would be approximately $27,000.'",
        "'speaker_2': 'Executive staff indicate that they would include the cost of the compensation and any additional staffing needs to support the board expansion in their 2020 324 biennial budget request. Information is included in the staff report regarding a 2020 supervisor report that was transmitted on board compensation.'",
        "'speaker_2': 'Information about this is on pages 22 and 23 of your packet. As I mentioned earlier, the Washington State Board is directed by House Bill 1152 to promulgate rules establishing requirements for the recruitment, selection and appointment process of non-elected members of local points of health.'",
        "'speaker_2': 'On February 25th, 2022, the State Board filed a C.R. one or two proposed rule with a stakeholder adviser to create this chapter of the Washington Administrative Code. The formal public comment period for the proposed rule is anticipated to run through March of this year with a public hearing in April, according to the estimated rulemaking timeline provided by'",
        "'speaker_2': 'the State Board. These rules are anticipated to be effective July 1st, which is the same day that House Bill 1152 is effective. Proposed Ordinance 2020 20103 is in alignment with the proposed rule, as it appears in the C.R. one or two.'",
        "'speaker_2': 'The Board of Health will be briefed on its proposed ordinance at their meeting tomorrow, and public health staff indicate that the board will begin the formal recruitment and selection process this spring. In addition to the process to amend Board of Health Code to align with state law and its proposed ordinance and board staff indicate that they don't'",
        "'speaker_2': 'have any issues with the timing included in the proposed ordinance. Before I conclude, I want to point out the timing issue that you have probably noticed resulting from the effective date of House Bill 1152. These changes go into state law effective July 1st, but the state board rules are not required to be effective until July 25th.'",
        "'speaker_2': 'As structured, the proposed ordinance recognizes the board's role in recruiting and selecting candidates for the non-elected positions and requires that the new reconstituted board be in place by January 1st of 2023. Figure one on page 24 of your packet provides an estimate of timelines for implementation.'",
        "'speaker_2': 'There is a technical striking amendment that begins on page 26 of your packet that would make technical corrections to the proposed ordinance and ensure that the language in sections 8 to 12 that would remain in code starting in January of next year, matches Section one V in the ordinance.'",
        "'speaker_2': 'And we have Susie Levy, the board administrator, on the call, and I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you, Sam, for an excellent staff report. So Andrew Quinn is not telling us about it?'",
        "'speaker_2': 'No, not today.'",
        "'speaker_0': 'Okay. So we have Suzy with us, who is the board administrator. And thank you for being here, Suzy. Are there any questions of your Sam or Suzy? Councilmember DEMBOSKY.'",
        "'speaker_1': 'Thanks, Madam Chair, and thanks for this overview of this big restructure. I'm wondering which of these are all local choices for structure and requirements versus those dictated by state law?'",
        "'speaker_2': 'Sure. So the changes requiring an equal number of non-elected electeds and the three categories are required by state law. And removing the weighted votes for King County members, the state law allows the county and legislative authority to provide compensation if they wish.'",
        "'speaker_2': 'And the let's see, codifying the current practice for the election of the chair is not required by state law.'",
        "'speaker_1': 'That's super helpful. So if I understand the answer, Sam, the number of members we're doing here and kind of their basic qualifications, that's generally we're just following the state law change.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'All right. Thank you so much.'",
        "'speaker_0': 'Thank you. Good question. Councilor Dombroski.'",
        "'speaker_1': 'Madam Chair, if I may.'",
        "'speaker_0': 'Of course, Counselor. Chairman.'",
        "'speaker_1': 'I would just further elaborate. Council Member Boesky What the state law requires that we have an equal number of non-elected and elected members, but it doesn't set that number at eight. In drafting the legislation, I chose to keep the same number of elected members and increased to that same number of the non-elected members.'",
        "'speaker_1': 'Thanks. Rider I was picking up on that. You didn't want like a 40 member board to join you, nor did I want to start telling colleagues on the Board of Health they were losing their have to go. Gotcha.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Are there any other questions? Council member about it?'",
        "'speaker_2': 'Thank you. And I apologize if you said this and I missed it, but has.'",
        "'speaker_0': 'The board there have they been consulted.'",
        "'speaker_2': 'About these changes? And did they have any feedback or.'",
        "'speaker_0': 'I think that's coming up tomorrow. That's Council Councilmember McDermott going on.'",
        "'speaker_1': 'It in advance of this hearing. I have shared the legislation and the staff report with the members of the Board of Health. But their formal briefing on this legislation as introduced will be tomorrow. I'm at our Board of Health meeting.'",
        "'speaker_2': 'Thank you. I appreciate that. And just it seems like something is kind of more more I have to do than I wanted to do and a very reasonable proposal.'",
        "'speaker_0': 'But before we vote on.'",
        "'speaker_2': 'Final passage, it would be really good to hear if there were any strong thoughts or ideas from from the board themselves. Thank you.'",
        "'speaker_0': 'And a council member belted chai referring to during the time we have final passage. Yes. So not in the committee.'",
        "'speaker_2': 'Correct? Yes. By final passage at the council. Thank you for clarifying.'",
        "'speaker_0': 'Sure. Thank you. Are there any other questions? SESAY Do you have any comment you would like to make.'",
        "'speaker_2': 'Now to thank you for taking the steps so we can continue with this empowering restructure work?'",
        "'speaker_0': 'Right. Okay with that unless there are any questions. Councilmember Turner, would you like to move proposed ordinance 2020 20103?'",
        "'speaker_1': 'I'd be happy to. I mean, we give a do pass recommendation to ordinance 2022, 103.'",
        "'speaker_0': 'Thank you. And we do have a striking amendment. Would you like to go ahead and move that? And then we can take everything up and move.'",
        "'speaker_1': 'Adoption of striking the amendment. S1.'",
        "'speaker_0': 'The motion has been made. Councilmember McDermott, would you. Well, first I would take a strike. The. The striking amendment. Would you like to speak to that?'",
        "'speaker_1': 'It's largely technical. I'd actually defer to Mr. Porter.'",
        "'speaker_0': 'And she gave us a short description of it already that it was strictly technical. But Sam, do you want to add anything?'",
        "'speaker_2': 'Yeah. So basically the way that the ordinance is structured, there are sections of it that, well, the timing of it allows the code adviser to remove no longer necessary sections from King County code. And this technical amendment just makes sure that that section, the sections that are remaining in code, match another section.'",
        "'speaker_0': 'Are there any questions of Sam under the stroke amendment? With that all in favor of striking amendment one please signify by indicating I'm I any opposed to this striking amendment is adopted and we will now go to proposed ordinance 2020 20103 as amended.'",
        "'speaker_0': 'Councilmember McDermott, any words?'",
        "'speaker_1': 'Thank you, Madam Chair. I'll reiterate what I said earlier, but underscore I'm an important part of that. There will be times during the coming year when at the Board of Health this will be a major part of our work plan and taking up our time and will feel like an imposition.'",
        "'speaker_1': 'But at the same time, this is including larger voices in our Board of Health that will be that are currently under referenced, unrepresented and underrepresented, and they will greatly enrich our work and our conversation. So while some of the logistics and mechanics of the restructure will take work, and I'm sure I'll be frustrated at times in the'",
        "'speaker_1': 'process, it will lead to a more and more robust, engaged public participation and currently underrepresented or unrepresented voices in the Board of Health. So the end result will be a much stronger conversation and work on behalf of the people of King County.'",
        "'speaker_0': 'Thank you, Councilmember McDermott. Very well said. And I echo what she said. I'm actually very excited about the changes that we will be making and bringing in more inclusiveness. And I think it will be very helpful not only to our board but to all the people in our King County.'",
        "'speaker_0': 'Are there any other comments anybody wishes to make? Okay. Now, could you please call the roll? Enjoy, Madam Chair. Council Member Ritchie High Council member them asking.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Council member di.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'As a member McDermott.'",
        "'speaker_1': 'High.'",
        "'speaker_0': 'Council member Perry.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Council member at the Grow. Councilmember Van de Boer.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember. So, hello.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Madam Chair. Hi. What is this? No, not in council member rescues. Okay. We have both. We have approved proposed ordinance 2020 20103 as amended. And unless anybody has a concern about placing and I'm concerned, we will send this ordinance with the due pass recommendation for the consent agenda to the April 7th Council meeting.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. And that concludes the action items on our agenda. But before we adjourn, I want to make sure that any council member was unable to vote. I think there may have been one during the approval of the minutes.'",
        "'speaker_0': 'Is there anything else that we need? The proposed motion as in 20 20051 council member bond. Bye bye. We had a vote.'",
        "'speaker_1': 'I voted I on confirmation.'",
        "'speaker_0': 'Thank you so much. Okay. Is there anything else? Angelica councilmember are. I figure you present. You can still vote today, can you not? That's correct, yes. So perhaps you could contact him afterwards. Okay. I'm next regular AGM and our next regular meeting of the committee of the whole is scheduled for April six.'",
        "'speaker_0': 'And I'd like to thank everybody who participated in today's meeting. And if there's no other business to come before the committee. Apparently not. We are adjourned. Thank you all.'"
    ]
}