{
    "AN ORDINANCE proposing an amendment to the King County Charter to make the office of King County prosecuting attorney nonpartisan; amending Section 610 of the King County Charter; adding a new Section 649 to the King County Charter; amending Section 680.10 of the King County Charter; and submitting the same to the qualified voters of the county for their approval or rejection at the next general election occurring more than forty-five days after the enactment of this ordinance.": [
        "'speaker_0': 'Thank you so much. We'll now move on to item number five. This is a charter amendment and this is charter amendment number 2016 0044. And it would be to make the office of the King County prosecuting attorney nonpartisan and provide for filling vacancies in that office in the same manner as vacancies in other nonpartisan county elected offices'",
        "'speaker_0': '. Mr. Wagner, did you want to make some beginning comments?'",
        "'speaker_4': 'No, Madam Chair. I gave a staff report at the committee's last meeting, and I don't have anything to add unless there are any questions.'",
        "'speaker_0': 'Okay. So we did have the presentation, like you said, two weeks ago, and we had our prosecutor speak. We had a member of the legal staff for the county. Answer some questions. So today we are ready potentially to take the vote.'",
        "'speaker_0': 'And so I am open for somebody to put this before us. Councilmember Gossett, would you be willing to put this before us?'",
        "'speaker_6': 'Okay. When you say but this before.'",
        "'speaker_0': 'Or since 2016 0044.'",
        "'speaker_6': 'Okay. I'd like to know that we had ordinance 2016 0044 or four. And as Councilmember Lambert said, we had a very robust discussion on this issue at our last meeting. But, Councilman Lambert, I think that it would be helpful to members if the staff or somebody kind of indicates and reiterates what the issue is, because we have'",
        "'speaker_6': 'a different listening audience today and then recommend that we vote. But I'm putting that before us now.'",
        "'speaker_0': 'Okay. So you want to give us like two sentences or a very brief rendition again, of what this does?'",
        "'speaker_4': 'Sure. There are basically two two effects of this amendment. One is that currently for Partizan offices, each candidate's party preference is listed on the ballot. If the if the candidate so requests or each candidate's party preference is listed.'",
        "'speaker_4': 'If this office were made nonpartisan. That would not be permitted. So each candidate's name would be on the ballot. But there would be no indication of party preference, party endorsement or anything like that. The second effect has to do with the way in which vacancies in the office are filled for a partizan office.'",
        "'speaker_4': 'The the council is required to choose someone to fill the vacancy from among. First of all, it has to be someone from the same political party as the person who previously occupied the office. And the replacement has to be chosen from among three persons nominated by the County Central Committee of that party.'",
        "'speaker_4': 'For nonpartisan officers, that is not the case. It's entirely up to the council's discretion who to choose to fill a vacancy. Those are the main differences.'",
        "'speaker_0': 'Thank you. Councilmember Garcia.'",
        "'speaker_6': 'Thank you, Madam Chair. And I'm going to urge members to vote for this measure and remind or reinforce the fact that what we're doing is presenting an amendment to our charter or our county constitution that would essentially make put the King County prosecuting attorney in the same state as of every other elected official here in King County'",
        "'speaker_6': '. And that is make him nonpartisan. I believe that the majority of people in the community who are eligible to vote will come out and vote and vote positively for this measure, because it's a progressive measure that I think will serve the community really well.'",
        "'speaker_6': 'Lastly, I mentioned this last meeting, but I'd like to mention that again, I think it is particularly beneficial to African-American and other people of color communities who have the perception, rightly or wrongly, here in Seattle and King County, as well as and just about every other urban area across the nation that, if they are at the prosecutor'",
        "'speaker_6': ', is have a party, they will like Republicans and that he or she is going to think a certain way or if he or she is a Democrat, that that he or she is going to think a certain way.'",
        "'speaker_6': 'And that certainly is not always been the case. And I mentioned that our last meeting, there are lot the two prosecutors that I worked under have been very responsive and accountable to all of our people, all of our communities, not always in a way that I would like.'",
        "'speaker_6': 'But I think taken as a whole, they've been very responsive. And I mentioned a damn saddleback in particular, where some of the most challenging cases, those dealing with three strikes, has shown significant insight has been beneficial. And I just think that this measure is important and that this is the time to pass it.'",
        "'speaker_6': 'And I hope the members will join me in putting this on the ballot this fall for our voters. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. Any other comments? Okay. I'm sorry to see you here, Councilmember McDermott.'",
        "'speaker_4': 'Thank you, Madam Chair. We'll have a charter review in two years overseen by the King County Charter Review Commission. And that would seem to me a good timeline to have this conversation about making this charter change. I would also point out that all the all 39 counties in the state have a partizan election for their prosecuting attorney'",
        "'speaker_4': '. And therefore, I'm going to oppose this today and ask members to join me in voting no. We can take this conversation up as part of the charter review in two years. But I also want to be very clear that my vote today is in no way a reflection on the excellent work that Mr. Sandberg does every day'",
        "'speaker_4': 'in this office and has brought some very innovative programs and to the office, and I commend his work highly. It is not at all a personal reflection, but a concern about when best to have this conversation.'",
        "'speaker_1': 'Councilmember WG So I also had some questions about the timing. And Nick, maybe you can help me out here. How long has this office been?'",
        "'speaker_4': 'Partizan Since 2008.'",
        "'speaker_1': 'The press.'",
        "'speaker_4': 'Oh, no. I'm sorry. Not sorry. I was thinking of a different question. I'm not sure the answer to that question.'",
        "'speaker_1': 'But as long as we can.'",
        "'speaker_4': 'Remember, at least 50.'",
        "'speaker_1': 'Years. Okay. And these positions have been nonpartizan since the vote in 2008. That's what you were thinking, right? And so the next regular vote is in two years, is that correct?'",
        "'speaker_4': 'That's what actually the county charter requires the executive to appoint a charter commission every at least every ten years. And the ten years is up in January of next year.'",
        "'speaker_1': 'By January of next year.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'I'm just kind of wondering why that is. So if we're going to start looking at charter changes in January of next year, why are we doing this particular charter change now? Because I'll tell you, when we first arrived here and I was sworn in, I was and then I was given my notebook full of the charter and'",
        "'speaker_1': 'all the information. I noticed that it referred to the the office of councilman. Right. And I'm not a councilman. I'm a council member. So I thought, okay, that seems like a fairly easy thing. We should just change it.'",
        "'speaker_1': 'And I talked to staff and so we should just change that because it's obviously out of date. And I was told, well, yeah, but we will take it up at the next charter change and that makes sense to me.'",
        "'speaker_1': 'And so I just sort of held back on making that change, which is admittedly less substantive than what we're talking about here. But why take this one up now? What's the what's the the impact of taking it now versus waiting until we do the charter as a whole?'",
        "'speaker_1': 'I think Councilmember Gossett might want to say something.'",
        "'speaker_0': 'Councilman Gossett.'",
        "'speaker_6': 'Thank you very much. I would like to respond to councilman about dirty, if I may, Madam Chair. Last year, after discussion with our chair, our councilmen, our fellows, he and I decided to put forth a change in the Office of Law Enforcement Oversight and submit that to the voters for a charter change.'",
        "'speaker_6': 'And my response is that both what they are and what the prosecuting attorney is in the criminal justice arena, that throughout our nation we've inherited some really difficult times, creating a more solid, open and and and fair relationship between criminal justice officials and oversight entities and the communities, all particularly the African-American communities around the country.'",
        "'speaker_6': 'And I just think that it's time to lead. We, we think, were successful with all our Office of Law Enforcement Oversight. And I'm just I just think it's time that we should do it with the only nonpartisan elected position in our county that's central to the operations of our criminal justice system.'",
        "'speaker_6': 'Yesterday, when we were in our Law and Justice Committee, it was pointed out that, you know, in King County, we're about seven times more likely to refer African-American youth to consideration for having charges filed against him or her than we are white youth and other year.'",
        "'speaker_6': 'And I just want to create the fair environment possible. And not having our prosecutor be partizan is a significant step in that direction is not a revolutionary step, but it's a significant step in the right direction, in my opinion.'",
        "'speaker_6': 'And I think we should do it now rather than waiting in two years and hope and hopes that the commission would take this issue up.'",
        "'speaker_1': 'Madam Chair, though, that, in answer to my question, completely remarks.'",
        "'speaker_0': 'Thank you and then will be followed by Councilmember Van Barrow.'",
        "'speaker_1': 'Thank you, Mr. Gosset, for your answer. And look, clearly the voters prefer to have these positions be nonpartisan. I mean, I think that's an obvious fact. They've made the council nonpartizan, they've made the executive nonpartisan. In fact, the only remaining partizan position we have here in the county is the prosecuting attorney.'",
        "'speaker_1': 'So I think it's a matter of, you know, sensible organization of the county and and organizing in a way that the voters support. This proposal makes some sense, but the timing of it to me, I'm not hearing a compelling reason to do it right this minute.'",
        "'speaker_1': 'I'm not hearing you. Compelling reason not to do it. This minute doesn't cost us anything. There's already going to be a ballot measure it there's always going to be a ballot to go into the general. Right. As you know, in the general election.'",
        "'speaker_1': 'Is that correct, Nick? Yes. No, but but the idea that that somehow changing the partizan or nonpartizan nature of the prosecutor now would somehow affect people's perception of the fairness of the office. I haven't heard particular problems around the perception of the fairness of this office.'",
        "'speaker_1': 'In fact, I think this office has a tremendous reputation for fairness and justice. And I also don't see any connection between whether this is a partizan office or a nonpartisan office and the disproportionate referral of African-American youth to the criminal justice system for charges that I just don't see that tie at all.'",
        "'speaker_1': 'What it is, is it's about how the voters perceive the office when they are casting their vote. And I think, quite honestly, the reason the change is now is because there's an election next year. Let's just be honest with people that that's the reason why we're doing things.'",
        "'speaker_1': 'I don't necessarily have to stand in the way of it, but I think the claim that there's some big problem we're solving here today, personally, I will admit I voted no on the on the, you know, in my personal ballot on the changes to the partizan nature of this body and the exact elected executive.'",
        "'speaker_1': 'Because I do think that party affiliation is shorthand that a lot of voters rely on for some types of values that an O candidate brings to the table. However, the voters didn't agree with me. The voters decided to make us nonpartizan.'",
        "'speaker_1': 'So I'll tell you, I'm torn about whether to support it or not. I think probably this is the wave of the future, regardless of what we do. And and therefore, maybe it's time to get it over with. But I think that we should be open and honest about the fact that we're doing it now because there's an'",
        "'speaker_1': 'election next year and it's going to be easier.'",
        "'speaker_6': 'For elections next year. I don't know. I just think, you know, what election.'",
        "'speaker_1': 'The election for the prosecuting attorney, it's.'",
        "'speaker_6': 'Not next year.'",
        "'speaker_4': 'When it 18.'",
        "'speaker_1': 'Well, then why don't we just wait and do? Okay, well, then I'm going to vote no along with Councilmember McDermott, because I was misinformed. I'm sorry. I was. I misunderstood. So because I think we could wait until we do it along with the rest of the charter update.'",
        "'speaker_0': 'So I'll step in there for a second and then Councilmember Vaughn. Mike, there are some of them, right? And I go after you.'",
        "'speaker_4': 'I'm going to pick up.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'No, no, no, no. Quite. You've been. Wait.'",
        "'speaker_0': 'Okay, Councilman, go ahead.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So that's polite people here today. That's okay. You know, when you look at the fact that we are home rule charter and the people have already voted, as Councilmember Balducci said, for having a nonpartisan people representing them. I think that this is consistent with that.'",
        "'speaker_0': 'You did mention the only remaining office that is not nonpartisan, and I think it's important to do this. The Charter Review Commission takes a year or more. And I think, you know, a lot of people like to have things, you know, not quite so many things on the ballot all at once.'",
        "'speaker_0': 'So I think it's a good idea to be able to have this brought forward now. And I think the idea that the people who are coming forward, we have with us today a former prosecutor, Chris Bailey. I believe I've been told that Jenny Durkan will also be supporting this.'",
        "'speaker_0': 'So we have former prosecutors that are supporting this, and I think it's a good time to do this and there's no reason why not to. So Councilmember Caldwell's next.'",
        "'speaker_1': 'Thank you, Madam Chair. Actually, you said just about everything I was going to say, but I as I understand, Jenny Durkan, you as former U.S. attorney, will be on will be one of the voices on the ballot in support of this measure.'",
        "'speaker_1': 'I wrestled with this a lot, too. As I understand, the charter review can take a year, yes, to two years. And so that plays into my decision to support this proposed ordinance. I also believe that of all of the positions that are elected in King County, the prosecutors should certainly not be a partizan office.'",
        "'speaker_1': 'I mean, there should be nothing partizan about law and justice. And we I think the people of King County would like to know overall would like to know that there are not partizan issues coming up for this office.'",
        "'speaker_1': 'So although I've wrestled with it, I am going to support the proposed ordinance. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. And right there.'",
        "'speaker_4': 'Thank you, Madam Chair. And I want to thank customer Raquel Welch for articulating why I'm going to also supported by the privilege of sponsoring the original. Legislation that was eventually passed through initiative to make King County Nonpartizan. We wanted to make this position Nonpartizan, but we were restricted by state law at that time.'",
        "'speaker_4': 'Council member duties correctly said that the voters have spoken loudly and clearly on this issue in a bipartisan fashion, and I think.'",
        "'speaker_3': 'That this is an opportunity for us to follow up on what Councilmember.'",
        "'speaker_4': 'Gossage said. We've been very fortunate in the history of this county to have an incredible number of individuals serving both as prosecuting attorney and also in an office. And they've dealt with issues that have evolved from the original time that we got involved beyond Ferguson in particular, and very sensitive to a number of issues in this region'",
        "'speaker_4': '. And we have had prosecutors we've been blessed with who have evolved and responded to the changes that have taken place in King County. And I think if we're going to recognize that the voters of this county wildly called for nonpartizanship, we should finish the job.'",
        "'speaker_4': 'I don't think we're overwhelmed by work right now. I think we can do some of the work that could precede what the Charter Review Committee is going to review. But I'm prepared today to take action and support with the public guilt by initiative in King County.'",
        "'speaker_4': 'And I want to thank Councilmember Gossett and Caldwell in particular.'",
        "'speaker_0': 'Thank you, Mr. Chair. With that, I will. Okay.'",
        "'speaker_2': 'Thank you, Madam Chair. And I've been listening carefully to the debate and discussion here with an open mind. And I've had the opportunity to meet with prosecutor Senator Byrd a couple of times on this and, in fact, speak with former prosecutor Bailey at a recent event about it.'",
        "'speaker_2': 'And, you know, I think my cosmetology torn on it when I was out door belling, you know, people saying, well, is it a Democratic or Republican? They say it's nonpartisan. They say, well, what are you. You know, they kind of want to know your philosophy a little bit.'",
        "'speaker_2': 'And that party preference, remember, we don't run in this state anymore on a party ticket. You prefer a party. Now, that's a and it's a distinction to preserve our top two primary system. But I think it does give a little information.'",
        "'speaker_2': 'And the staff report pointed this out to the voter, at least an initial clue. And most folks still, I think, vote the person, not necessarily the party, and will do further investigation if they're interested. I appreciate the arguments about wanting to not have justice be a partizan issue, but I don't think stating a partizan preference brings partizanship'",
        "'speaker_2': 'into the administration of justice. I just don't. And I know I've certainly not seen that in Prosecutor Sderberg nor his predecessor, Mr. Mailing in Mr. Mailings predecessor Mr. Bailey wrote a terrific book addressing some of the history of the office.'",
        "'speaker_2': 'But I do think that the prosecutor's political philosophy matters and the parties matter a little bit, whether you're for or against the death penalty. Whether you are more in favor of sentencing reform initiatives, diversion initiatives. Our prosecutors led, frankly, by example with the programs like Lead and 180 and has really been a leader on these issues.'",
        "'speaker_2': 'And as Councilmember Garcia points out, is looked back at some three strikes cases where you felt justice in the in hindsight was not ultimately served and has gone and petitioned the clemency board to do justice. And so I have the highest degree of respect for Mr. Chabot.'",
        "'speaker_2': 'That's not what this issue, in my view, is about. But I don't think taking off the label eliminates Partizanship. And I think, in fact, you can see it right now in our state Supreme Court races where they are nonpartisan, but there are three challengers to three sitting incumbents.'",
        "'speaker_2': 'And to be quite blunt, there is a partizan bent to those challenges. There's been some frustration that some of, I think, are more conservative friends about some of the rulings of the court. And and I believe that generally one political party is supporting some challengers.'",
        "'speaker_2': 'I mean, I'm just being candid that taking off a partizan label doesn't take politics out of politics. So I don't think that that argument here is a compelling one necessarily. It doesn't mean we shouldn't do this or that the voters want do, but I don't I'm not convinced by that argument.'",
        "'speaker_2': 'On the process, it is true that we have sent charter review amendments to voters out of the regular cycle. We did that last year and cast member Lambert's point that sometimes there's value in not overwhelming voters, which I remember I think is a good one.'",
        "'speaker_2': 'In this case. I'm surprised that kind of the lack of input we've received. I think one of the values you get from a charter review process is you have the Municipal League and the League of Women Voters and civic leaders come together and debate in a robust way these issues of governance, structure and what reforms should be'",
        "'speaker_2': 'undertaken. And we could have had a little bit more of that here in the process. I did some of my own research. I reached out, talked to people I trust like Hugh Spitzer. He's the kind of an expert on Washington constitutional law.'",
        "'speaker_2': 'And I don't think he would mind me saying he agrees with the prosecutor that this should be nonpartisan. So I would have liked to had a little more input on it. And to be honest, I'm still torn on on what to do here.'",
        "'speaker_2': 'But I want to share my my thinking on it. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. Well, I agree with you also. He's true. And I don't think that whether you're for or against diversion as any relations, whether you're already I know others and I know does that agree with that? So and I do know that the book that Chris Bailey wrote talked about a time when there was Partizan ism in'",
        "'speaker_0': 'the office. And as citizens get the opportunity to vote on this, hopefully this year they will have plenty of opportunities to read more about it and to properly vetted. So with that, the clerk, will you please call for the vote?'",
        "'speaker_1': 'Thank you, Madam Chair. Customer of duty. Now, Councilmember Dombrowski.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Councilmember Dunn by.'",
        "'speaker_1': 'Councilmember Gossett, I recall. Well, Councilmember McDermott.'",
        "'speaker_4': 'No.'",
        "'speaker_1': 'Councilmember of the Girl Council member. But I know.'",
        "'speaker_6': 'Quickly.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_6': 'Captain. Until it was on the farm.'",
        "'speaker_0': 'Yeah, he's on the phone, but he can't vote and.'",
        "'speaker_4': 'Yeah, it's not recorded.'",
        "'speaker_1': 'Yeah, understating my preference. Councilmember.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Madam Chair, I am sure the voters by those three, those that's voting no are council members duty Dombrowski, McDermott and council member of the Rivers excuse.'",
        "'speaker_0': 'Thank you very much with that. The motion has passed ordinance just passed charter amendment. And is there any objection to expediting it to this week? It will not be on consent, obviously. Is there.'",
        "'speaker_2': 'Needed for.'",
        "'speaker_0': 'That? Well, we need to have it done before the end of the month in order to get it on the ballot. So I think since we've had the conversations there.'",
        "'speaker_6': 'Like right.'",
        "'speaker_4': 'Now, I don't it does have to be on the you know, to take final action before the end of this month, but before the August recess.'",
        "'speaker_0': 'Oh, okay. I thought it was the end of this month, not the end of July. Okay, well, then it doesn't matter. Okay, well, that would be great. Okay. Thank you. And thank you very much for your being here today, both of you.'"
    ],
    "AN ORDINANCE relating to telephone or electronic attendance at council and standing committee meetings; and amending Ordinance 11683, Section 15, as amended, and K.C.C. 1.24.145.": [
        "'speaker_0': 'All right. That means is item number six and make it by paperwork here. Item number six is proposed ordinance 2014 zero 3 to 0. This is one we've been talking about for a number of time. This will not be voted on today.'",
        "'speaker_0': 'This is purely a briefing, although it does say possible action at the top. It is purely a briefing to talk about where we are, get some background information, and then during the next week or two weeks, people can decide what they want to do and we will move from there.'",
        "'speaker_0': 'So, Mr. Wagner, will you please brief us on this issue?'",
        "'speaker_4': 'Thank you, Madam Chair. Nick Wagner, counsel. Staff. The staff report on this item begins on page 67 of your materials. This proposed ordinance addresses the issue of when council members are permitted to attend council meetings by telephone or other electronic means, which I will refer to shorthand as remote attendance.'",
        "'speaker_4': 'There is a proposed Amendment One, which is that pages 81 to 85 of your materials that makes several non substantive wording changes in the operative section of the ordinance. On the recommendation of the code revise or so in my staff report, I'll be referring to Amendment One.'",
        "'speaker_4': 'And a red line has been distributed to each council member this morning that shows the changes that Amendment one would make in the original ordinance. And I should make clear that the changes that Amendment one would make are in red.'",
        "'speaker_4': 'There's lots of underlining and crossing out, which is in the original proposed ordinance, Amendment One makes only the changes that you see there in red. I'd like to begin by describing the current county code provisions governing remote attendance, and you can find that description on page 68 of your materials.'",
        "'speaker_4': 'Currently under Section 1.24.14 or five of the county code, remote attendance at full council meetings is permitted in three situations. First, in an emergency as defined in section 12.50 2.01 area of the county code. And here we're talking about a public emergency, not an individual council members personal emergency.'",
        "'speaker_4': 'The second situation is if if there's a special council meeting convened during the council's summer or winter recess. And the third situation is if a council member declares to the council chair before or during a meeting that the council member is unable to attend the meeting in person because of urgent circumstances and the term urgent circumstances is'",
        "'speaker_4': 'defined to mean either of two situations. First, inclement weather that poses an immediate life health or safety risk to the member. If the member were to travel to the meeting and the examples given are a flood alert or snow in the member's district or in an area that the member would have to travel through to get to'",
        "'speaker_4': 'the meeting. And the second situation is a medically related emergency or urgent need for assistance that makes the member unable to attend the meeting. And the emergency. The emergency or urgent need for assistance must must be either the members or that of the member's immediate family, which is defined as you see there in the middle of page'",
        "'speaker_4': '68. Pardon me always. A member. The definition of family member.'",
        "'speaker_6': 'I think would be helpful for the listening audience to know what is meant by immediate family.'",
        "'speaker_4': 'Currently under the code, it includes a spouse or domestic partner, a child, a child of a spouse or domestic partner, a parent. And that would be the member's parent, the parent of a spouse or domestic partner of the member, the grandparent or of the member or the grandparent of the member's spouse or domestic partner.'",
        "'speaker_4': 'Those are all the categories that are included. Currently, only three meetings per calendar year may be attended remotely on the basis of urgent circumstances. As I said before, the current rule limits remote attendance to meetings of the full council.'",
        "'speaker_4': 'There is currently no provision for remote attendance at council committee meetings such as this meeting today. The changes that the proposed ordinance would make are described on pages 69 to 71 of your materials. And as I mentioned, I'll be referring to the language in proposed Amendment One, which is attachment to pages 81 to 85.'",
        "'speaker_4': 'First, the ordinance would allow a council member to attend up to three meetings of standing committees of the council each calendar year, as well as three meetings of the full council to provide context for that change and the other proposed changes.'",
        "'speaker_4': 'There is a table attachment six which follows page 92 of your materials. It compares the meeting attendance rule rules of King County and nine other government or government related entities. Eight of those nine entities allow remote attendance in some form, and none of those eight distinguishes between meetings of the full entity and meetings of its committees.'",
        "'speaker_4': 'Six of the other entities place no limits on the number of meetings per year that a member may attend remotely. One has a limit of six meetings, and one has a limit of four meetings unless absent for medical reasons.'",
        "'speaker_4': 'The second change that the ordinance would make is to allow remote attendance at more than three full council meetings and three committee meetings per year on the basis of urgent circumstances. If a majority of the members present at the meeting vote to allow the member to attend remotely, and if it were a full council meeting that we'",
        "'speaker_4': 'were talking about, the ordinance would permit remote attendance only if there were a quorum present at the meeting. The other eight entities that permit remote attendance that are listed in the table that I refer to. One makes remote attendance contingent on approval by other members of the entity, and seven do not.'",
        "'speaker_4': 'The third change would be in the definition of urgent circumstances, and that change is shown in the red lining at the bottom of page 69 and the top of page 70 of your materials, as proposed in excuse me, inclement weather would justify remote attendance if it made it difficult for the member to attend the meeting.'",
        "'speaker_4': 'It would not need to be so severe that travel to the meeting would pose an immediate life, health or safety risk for the member, and a medically related issue or other urgent need for assistance would justify remote attendance if it made it difficult for the member to attend the meeting.'",
        "'speaker_4': 'But it would not need to be an emergency and the member would not need to be unable to attend in person. Of the eight other entities that permit remote attendance. Five do not limit the circumstances under which is permitted.'",
        "'speaker_4': 'One permits it only under extraordinary circumstances such as emergencies, illness, accident, being away from the agency's region due to official business or similar circumstances, and one permitted only for emergency meetings. It was clear the fourth proposed change would require a member attending remotely to have the member's voice be audible so that the public can hear the discussion'",
        "'speaker_4': 'and voting process. Six of the comparable entities listed in the table have a similar requirement. And fifth. And finally, the proposed ordinance would add the following notice provision quote to facilitate connection to the broadcasting system. Requests for participation by telephone or other electronic means should be made half an hour in advance of the meeting when possible.'",
        "'speaker_4': 'And, quote, five of the comparable entities have no notice requirements for attending remotely and three have some form of notice requirement. There are three proposed amendments in your materials. Amendment one, as I mentioned, which is attachment two at pages 81 to 85, consists of non substantive changes in wording.'",
        "'speaker_4': 'As shown in the red line that you have in front of you Amendment two, which is attachment three at page 87, would permit remote attendance when a council member would have difficulty attending a meeting because of the council members need to attend a meeting of an outside committee to which the Council member has been assigned under the'",
        "'speaker_4': 'council rules. And I should mention that both Amendment two and Amendment three, which I'll describe in a moment, are amendments to Amendment one. Amendment three would expand the definition of family members. That's because the individuals whose urgent need for assistance would warrant remote attendance to include all immediate family, as defined in section 3.12 .010. g g of'",
        "'speaker_4': 'the county code. And that section specifies the family members for whose death King County employees are eligible for bereavement leave under Section 3.12 point 210 of the county code. And those additional family members are the member's daughter in law and son in law, and the siblings and grandchildren of the member or of the member's spouse or domestic'",
        "'speaker_4': 'partner. And that concludes my staff report, unless there are any questions.'",
        "'speaker_0': 'Council Member Goss.'",
        "'speaker_6': 'Thank you, Madam Chair. Where is this list of eight jurisdictions that you keep referencing? What page?'",
        "'speaker_4': 'There's a table following page 92 of your materials.'",
        "'speaker_0': '92 and at the top right here. Right. Yeah. There's always has to top this here.'",
        "'speaker_6': 'Okay. And there I could see some of these changes being necessary if we had a problem with member attendance. Belichick It's been 13 years since we haven't had a quorum at Cairo and 21 years since we weren't able to get five people at a regular county council meeting.'",
        "'speaker_6': 'I'm trying to figure out what is broken that would be fixed by allowing this kind of flexibility. And I do see now that there are other jurisdictions that do it, but why most jurisdictions don't do this. And I just think it's so much more responsible when you have a rule that one has to be here and there'",
        "'speaker_6': 'are serious emergency reasons for one not being here in order to vote. May I answer my question?'",
        "'speaker_0': 'Okay. Let me answer that one. All right. Unfortunately, I've had more opportunities probably than most people to want this to happen. First of all, I think it's important for us to come into the 21st century.'",
        "'speaker_6': 'And what does that mean?'",
        "'speaker_0': 'It means we use the technology that's available to us. As you can see, all of these other entities make it available. There have been occasions when I have been out at a Nako convention doing county business of which, you know, I'm assigned to that committee and while I'm out doing county business, I'm marked absent from county.'",
        "'speaker_0': 'So I don't get any any credit. And it looks like I wasn't doing my job when in fact I was doing my job. But it doesn't appear any way. And in one occasion, I did go and listen to the part of the meeting so that I could put comments in so that I was attending back and forth'",
        "'speaker_0': 'to meetings at the same time. And I'm sure we're all aware that there are many times when we need to be in two places at the same time. So having the ability to use this technology is important. There was a time when I called because there was a huge snowstorm in my district and the person from the'",
        "'speaker_0': 'county said There's no snow here. And I said, well, that's true. There may not be any snow in Seattle this morning, but there is in my district and I chose to come in, but it was not a safe driving environment.'",
        "'speaker_0': 'And I was driving and thinking, what the heck am I doing? Although those were the exact words I was thinking because it wasn't safe. And so there needs to be opportunities because it's a very large county. There can be things happening in one part of the county that are not happening in the other.'",
        "'speaker_0': 'And the third reason is even more important is it brings the voice of that district that is available because you are available to the phone, to the conversation. Should that community voice need to be heard on any and all topics?'",
        "'speaker_0': 'So I think it's important that we allow and encourage all the members to be here in whatever way they can be here. Obviously, it's the best possible for us to be here personally, but when the circumstances are either dangerous or you've had a family emergency or you're in one case, I was on the phone when my husband'",
        "'speaker_0': 'was in surgery. And, you know, it was good for me to be concentrating on something that wasn't quite as nerve wracking as what was going on in the operating room. But I was here. I was making the conversations that needed to be for my district and hearing what needed to be done.'",
        "'speaker_0': 'So I think it's important, and that is why all these other jurisdictions are already doing it with much more flexibility than we're talking about here. We have had this available to us in our council meetings, not in our committee meetings for years, and it has not been abused.'",
        "'speaker_0': 'So I think it's time for us to move on to the next step. So, member Dunn.'",
        "'speaker_4': 'I think there's going to be some questions relating to this. I, I support this in principle. We might need to smooth that just a little bit because I think it will actually approve, improve attendance as opposed to early.'",
        "'speaker_4': 'And I think it's always good for us to be able to connect in as having lived having served on the council, lived in Maple Valley where, you know, traffic was a roughly an hour and windstorms and trees down.'",
        "'speaker_4': 'I think there's a lot to be said about this just provided that it's not abuse. And I'm very confident it won't be this without a similar provision in place for a while. And it certainly hasn't been abused by the members.'",
        "'speaker_4': 'But I would mention that a few of us have called in. In fact, our council by Roger goes on the phone right now. And if you've done that, you realize that the acoustics are not good. And we need to, if we're going to support this, make a commitment to and and and those TV that we will.'",
        "'speaker_4': 'Improve the system so that we can hear and communicate well. It is sometimes difficult to hear the chair and other members of the committee for a variety of reasons. So I just wanted to add that that thought.'",
        "'speaker_0': 'Thank you. I think that's really important. And I know I listened to it a lot. Even committees when I'm not on, when I'm driving and there are certain members who speak right into a microphone, you can hear every word and there are others you cannot.'",
        "'speaker_0': 'So I think as a politeness that we all need to hold each other up to saying, Hey, I don't think you're speaking as a microphone. Councilmember Bell, D.C..'",
        "'speaker_1': 'Thank you, Madam Chair. So I possibly stand alone as coming from a jurisdiction where we did have a rule allowing this sort of thing. When when I was at Bellevue. And in fact, our rules are listed here and similar to what Councilmember Dunn was just saying, it wasn't used all that frequently.'",
        "'speaker_1': 'I recall using the rule myself. For example, when I was on vacation, it wasn't a family emergency of any kind. I was enjoying the beach with my family, but that was for scheduling reasons that couldn't be avoided. That happened to be the week of the meeting when the council was going to be debating some very big and'",
        "'speaker_1': 'very contentious issues around the light rail project that I had been working on very, very diligently for a long time, and I wanted to participate. And so I did. And it was challenging. I mean, it's not easy to have that kind of a substantive discussion when one of the members is on the phone.'",
        "'speaker_1': 'But I feel that it was important that I had the ability to do that, and it was important to the ultimate outcome of that issue for the people of the jurisdiction that I represented at the time. So I understand the value of this.'",
        "'speaker_1': 'And frankly, there's a lot of regional bodies that allow for phone calling, sound transit allows for it. And we have members here who have taken advantage of that. It's on transit. Others have. I think that it's important that we have everybody we're stronger body when the entire body is represented, whether it be a committee, whether it be'",
        "'speaker_1': 'the full council, whether it be this committee of the whole. And so I think in general, reducing barriers to participation is a good thing. And for that reason I'll support this. However, it is logistically very challenging in this chamber.'",
        "'speaker_1': 'I really appreciate what Councilmember Dunn just said, and I had it noted that I was going to say something as well, that if we're going to move to having marginally or even substantially more frequent phone participation, we have got to do something about the setup.'",
        "'speaker_1': 'It's just okay. The heavens have spoken. Wow. That's great. Yeah. We've got because they've got the acoustics in the chamber are not just for the people who are calling in, for the people who are in the room listening to the person talking.'",
        "'speaker_1': 'They're not they're not the best. And so we I think we'll have to look at a budget item possibly to upgrade our system, you know, as we go forward. So I think it makes good sense. As Council Member Lambert said there, we have had the ability to do this with committees and I haven't noticed that people take'",
        "'speaker_1': 'on do advantage of it. And so it seems like a really it seems like a common and not at all controversial thing to me to do. We just have to make it work. We have to commit to each other that we're going to make it work.'",
        "'speaker_0': 'Thank you. Thank you. And I think the courtesy is going to be really important to, as far as, you know, letting somebody know that you can't hear. And also at the end of each section to be able, say, you know, council member at the Grove, do you have anything you need to say so that, you know, the'",
        "'speaker_0': 'person on the phone knows that they don't have to be interrupting? Hello. Hello. So that they know that they'll have some opportunity to make input. So I think, you know, some minor adjustments to making this work will be needed.'",
        "'speaker_0': 'Council Member Oh yes.'",
        "'speaker_1': 'Thank you, Madam Chair. I have a comment and then a question and I appreciate what's been said thus far. And in fact, I think as Councilmember Dunn said, it can increase attendance or participation even if telo telephonically. I recently last month was chairing a commission meeting in another state and tuned into the Health Housing Human Services Committee'",
        "'speaker_1': ', which had Vice Chair Lambert chaired. And I went through airport security besides parking the rental car going through it that my husband did that and I was on the phone through all of that, through airport security, through waiting at the gate, boarding the plane, and was on for the whole time of the committee, except the last few'",
        "'speaker_1': 'minutes. So my partner said it was very difficult and I think it would be nice if, you know, I'm going to that amount of effort to participate that I could be able to vote a vote or an action were needed.'",
        "'speaker_1': 'My question is on amendment number two and two questions on it, actually, and this has to do with the A members. I'm looking for tenants at a meeting of an outside committee in which the members service would make it difficult.'",
        "'speaker_1': 'Now, in my case, it was an outside commission of north of Western State. But if that wouldn't be included, I would not think. Are we talking about an outside committee that's in a formalized committee that council members are assigned to?'",
        "'speaker_4': 'My intention in drafting the amendment, council members council member Lammers direction was to refer to the the provision in the council rules that provides for the chair to appoint members to various outside committees. And that was my intention.'",
        "'speaker_4': 'I don't know if that council member, Lambert may want to explain her view on that.'",
        "'speaker_0': 'Now, we were trying to find something that would be a guideline, and so that's what we use as our official list. So my example was it being at Naco and not being able to participate, even though I was on the phone and I, I could have so.'",
        "'speaker_1': 'I can understand that with Naco, but I don't think other committees would be meeting the same time. That may be an exception.'",
        "'speaker_0': 'I bet. Well, Mr. States, if I.'",
        "'speaker_1': 'So in transit or, you know, whatever outside communities that.'",
        "'speaker_0': 'Have found transit is actually listed on that resolution.'",
        "'speaker_1': 'Oh, I know it is. And I'm just in. I can't I'm trying to think of circumstances where outside committees would be meeting the same time as our council meeting, which is the designated time.'",
        "'speaker_0': 'So if you want to amend that, add something or it's fine. I was just trying to get the idea that we shouldn't be absent from doing our duties if we're actually doing our duty. And that's why we're absent.'",
        "'speaker_0': 'Commissioner Make absolutely no sense. Councilmember Bassett.'",
        "'speaker_6': 'Thank you, Madam Chair. Nick, what is the current policy for being marked absent from attending our meeting?'",
        "'speaker_4': 'Well, the clerk may want to elaborate on this, but my understanding is that if you're permitted to attend under the current rules, then you would be marked present. And if you're otherwise, you need to be physically present.'",
        "'speaker_6': 'And anything you want to add.'",
        "'speaker_1': 'Well, so members are either present or excused. There's no. No, we don't.'",
        "'speaker_6': 'What about the from.'",
        "'speaker_1': 'So right now, for council meetings, if a council member participates by phone, we're required to. The chair makes that announcement at the beginning of the meeting, and then we note that in the minutes that the member participated telephonically.'",
        "'speaker_6': 'You know what goes on the record?'",
        "'speaker_1': 'Well, then they're there. Then for council meetings, members who participate telephonically are considered present for purposes of the quorum. And then they their votes are counted when we take the oath.'",
        "'speaker_6': 'What about for the committees?'",
        "'speaker_1': 'For the committees. There's no that's what this I think this ordinance does is extend that rule that applies in the council meetings to the committee meetings. And make some other technical changes. But essentially now there is no provision for participation in a committee meeting by telephone.'",
        "'speaker_1': 'He keeps the Sony C one.'",
        "'speaker_6': 'Madam Chair, one of the additional concerns that I have, again, and reflecting back upon our history and there's been the concern Don needs to hear this. There's been two political races that involved members of this body running against each other where attendance at meetings became a key issue.'",
        "'speaker_6': 'And there's been three other meetings where King County Council members were running against others in the community that are not concerned with where it was raised, their attendance. And in all five races, attendance at meetings became one of the two or three more important issues that members of the general public considered.'",
        "'speaker_6': 'So I would need to know whether or not being able to call and make you present or not present at a meeting.'",
        "'speaker_0': 'It would make you present. You were present if you are here telephonically or if you were here in person as you are during a council member under existing rules. But you are not allowed to be present even if, as Councilmember of the Grove is present at this moment, is not considered present for this meeting because it's a'",
        "'speaker_0': 'committee meeting and not a council meeting. So if you are telephonically at a council meeting, you are present as if you were here in the body.'",
        "'speaker_6': 'And this is also expanding non emergency reasons that you could call in. Right. Those concerned about duty used an example where she was at the beach and she was able to call in and Bellevue.'",
        "'speaker_0': 'Yeah, I really do not go that far. I'm on another committee and in one meeting they were able to say anybody can can be attending remotely any time they want in one sentence, as long as everybody can hear them.'",
        "'speaker_0': 'And and I had to laugh as I voted on that. But, you know, they can do it in one sentence. And here we are, months and months and months later at several pages long. I think the most important thing is that everybody has life around them, whether it's happy circumstances, death, bad circumstances, illnesses, traffic accidents.'",
        "'speaker_0': 'And there are ways of getting here, you know, whatever happens, you know, rainstorm, snowstorm, sleet, hail, whatever. And we have to deal with those. And we're professionals. And as has been said in doing this at the council, it has not produced any problems.'",
        "'speaker_0': 'Nobody's abused it. And I think that we need to take in in my mind, this is the next baby step. It's not even as robust as five out of the eight surrounding jurisdictions that have no limits on the reasons and six out of eight that have no limits on the number.'",
        "'speaker_0': 'So this is a very, very modest step, but it does allow each of us to participate and have our individual citizens be able to participate through us, no matter what the weather is or what other issues are being faced.'",
        "'speaker_0': 'And so that is your question.'",
        "'speaker_6': 'Yeah. Essentially extends what we currently have to all of our committees and makes the criteria. One can use a more flexible and broader.'",
        "'speaker_0': 'Yes. In the fact that you can go to other council approved meetings and not be considered absent and that there are more family members such as grandchildren and in my daughter in law as the son in laws that should they die, you would be.'",
        "'speaker_6': 'Is this sick?'",
        "'speaker_0': 'Well, I think it's been.'",
        "'speaker_6': 'A little traumatic.'",
        "'speaker_4': 'What it would do is the amendment you're referring to would expand the group of immediate family members whose urgent need for assistance would justify attending remotely to include all of the categories who currently if if they did die, the member would or a county employee would be entitled to take bereavement leave on that account.'",
        "'speaker_4': 'So it uses the same just the same categories of, of individuals for this purpose, as well as for the categories that are currently makes someone eligible for bereavement leave.'",
        "'speaker_6': 'So you are only talking about bereavement then. See, I thought Cathy said the relative would have to be dying in order to be able to call that.'",
        "'speaker_4': 'No. No. It uses those categories. It borrows those categories.'",
        "'speaker_6': 'Category categories, the.'",
        "'speaker_0': 'Bereavement category.'",
        "'speaker_4': 'The relationship categories, and.'",
        "'speaker_6': 'Number of bereaved means about to die. I thought.'",
        "'speaker_4': 'Right. Certain category if someone in a certain category, certain relationship to a county employee dies. The county code provides that they can take bereavement leave. Right. This proposed ordinance would use those same categories and say if any of those individuals has an urgent need for assistance and I'm paraphrasing now, that that would be a justification that would'",
        "'speaker_4': 'constitute urgent circumstances, justify a council member to attend remotely by phone or other electronic means.'",
        "'speaker_6': 'All right. Thank you for that clarification.'",
        "'speaker_0': 'So just to make sure I'm clear on the language. What does amendment number three mean? That you could be marked absent if you have a sick family member? But does it also mean if your family member died, you would still be marked present if you participated?'",
        "'speaker_4': 'Well, if a family member died, I guess I haven't.'",
        "'speaker_0': 'Thought about under that category.'",
        "'speaker_4': 'That is. That would.'",
        "'speaker_0': 'Be urgent. There'd be an urgent care category.'",
        "'speaker_4': 'Well, yeah, it's I guess it doesn't really fit the definition that the proposed ordinance would use it, which is that there has to be a medically related issue or other urgent need for assistance that makes it difficult. So you might want to clarify that if that's what your attention is.'",
        "'speaker_0': 'Well, medically urgent, I guess, with death is considered a pretty medically urgent issue. But if anybody's questioning whether death is considered medically urgent or not.'",
        "'speaker_1': 'Then it's all over. Yeah. Council member Belushi.'",
        "'speaker_4': 'See what happens if we just.'",
        "'speaker_1': 'We still don't know what.'",
        "'speaker_6': 'We're going to replace it.'",
        "'speaker_1': 'Just a confirmation. As I read this, you basically have three discretionary times when you call in for whatever reason, which would cover not only a death, but my beach vacation or I mean, we don't do that every year, by the way, but so you'd have up to three times as I read this as a councilmember to choose'",
        "'speaker_1': 'to call in.'",
        "'speaker_4': 'No, no, that's. Currently, there are three different categories of reasons why.'",
        "'speaker_1': 'I'm talking about with the amendment, but they're new with the.'",
        "'speaker_4': 'New rule. Okay. All that would do it would address the urgent circumstances as a ground and it would modify the definition of urgent circumstances. But it would not create it would not give members the right to attend remotely in the absence of urgent circumstances is.'",
        "'speaker_1': 'So I would go further. I don't.'",
        "'speaker_0': 'Know. That's what I was hoping somebody would say that I would like to do a new striker that took in the fact that we have.'",
        "'speaker_1': 'For.'",
        "'speaker_0': 'That we have four amendments before us because this has been here for so long that some of the language has gotten older and that we do keep the three for no reason and then we go into the urgent.'",
        "'speaker_0': 'Um, so anyway, this is up for a briefing because there are obviously some various opinions about how this would be implemented, should be implemented. It just boggles my mind that other groups can do it on one or two sentences in one meeting.'",
        "'speaker_0': 'But anyway, here we are. So during the next two weeks, if you would like to bring amendments, let me know and we will go for that. Council Member Duncan.'",
        "'speaker_4': 'I have to make this point because of the record on it. With all due respect to my good friend and colleague, Mr. Goss, our districts are different and yours is is right here and close. And I know you don't do a lot of skateboarding, but if you wanted to, you could skateboard to work.'",
        "'speaker_4': 'My friend. My district goes, Do you know that my district goes all the way to where King County borders, Yakima County and Natchez Pass. And I have people that live out there and I am frequently out there and it is in elevations up to 6000 feet.'",
        "'speaker_4': 'Kath has got places, I've got almost 8000 feet. We are out there doing a lot of work and sometimes things happen and I had a situation where down at the state of the county last year and I got in a really bad situation in terms of traffic and and just missed the meeting and then of course, you'",
        "'speaker_4': 'know what happens there, but if I could have called in, it would have been fine and I would have attended. So I just I want people to remember that we all come from different circumstances. When I lived out in rural, unincorporated King County outside of Maple Valley, and it took at least an hour to come to work'",
        "'speaker_4': 'in traffic, that's that was really hard on my family and my children because of the amount of commute times going back and forth. These are choices we make. But I'm urging my colleagues to remember the diversity of our districts and what challenges may exist, especially relating to weather, where the big windstorm with 29 trees around it couldn't'",
        "'speaker_4': 'get anywhere and power was out. So anyway, just just to chew on food for thought and always with great respect. Mr. Gossett you had to stop that skateboarding came out.'",
        "'speaker_6': 'You.'",
        "'speaker_1': 'Mr. Guys.'",
        "'speaker_6': 'But what are we, uh, I mean, other examples are that Councilman DEMBOSKY there's a way out north, and for three years he's been on the county council and never missed one meeting being physically here.'",
        "'speaker_4': 'Mr. Dombrowski is is.'",
        "'speaker_2': 'I was doing so well, you know, in avoiding this conversation.'",
        "'speaker_4': 'He's always sat right at the front of the class to give that kind of guy.'",
        "'speaker_0': 'A halo came with it.'",
        "'speaker_2': 'Position. I appreciate the comment there. I was just but I you know, last week I was out in Reagan's district at his invitation to look. Get some of the marijuana growing issues and and income and coming back. I was reminded, you know, we were coming down the valley highway and the traffic there, it it it is a'",
        "'speaker_2': 'long way out there. And these are big districts. And I, I think very often every day when I'm coming down either on the bus or in the car or now sometimes on light rail, how easy it is for me from Northeastern to get here to participate.'",
        "'speaker_2': 'I mean, it's it's easy and I'm lucky then. So I, I'm not sure we'll look at these from this perspective. I've supported these interest in having a little more flexibility here. I think it's a pro participation measure. I want to make sure we do it the right amount so it stays a pro participation measure.'",
        "'speaker_2': 'There is a lot of value in face to face dialog and in that I want to preserve that. It's one of the great things about this body, I think, is that we're here and can see each other and the debate is richer.'",
        "'speaker_2': 'We've got to fix if we're going to be more flexible, we've got to fix this technology because frankly, today it's more disruptive than it is helpful when you're here in chambers on the call. And it just is. But I think there's solutions to that.'",
        "'speaker_2': 'I think there probably are solutions to that. So I look forward to working with you, Councilmember Lambert, I think to see if we can get this to the right spot for a little more flexibility while preserving the really tremendous value of being here and working with all of you.'",
        "'speaker_2': 'Face to face brings.'",
        "'speaker_0': 'A lot of thank you and I appreciate that too. I think, like I said, we have work balance. We have very large districts, my district, 1007 square miles. And it's a little different to be commuting if you have a meeting in the morning and frequently I do.'",
        "'speaker_0': 'I have a mayor's meeting at 7 a.m. at North Bend sometimes and getting back in here on time and sometimes I listen to the meeting on the way in, so then I'm prepared when I get here. And it does help us that have large districts to be able to be in two places at once.'",
        "'speaker_0': 'And as Councilmember Caldwell said, lots of times we are scheduled from more than one place at the same time. So all of these things are helpful to us and we need to be able to get to that. This is a robust discussion and so I look forward to hearing from you as to exactly what you would like'",
        "'speaker_0': 'to see. We will try to get a compromise. Everybody has very different ideas and so not everybody's going to have 100% what they want in it. But I think as long as we can keep the flavor of getting this done and moving on, it will be great.'",
        "'speaker_0': 'So we have now moved the other two items for today off to the next meeting. And so at that, this meeting will be a.'"
    ]
}