{
    "A MOTION authorizing the chair of the council to enter into a contract for services to represent the county with the Washington state Legislature.": [
        "'speaker_0': 'Thank you very much. See you in a couple of weeks. Thanks. In Coex. That takes us to item six. The proposed motion would authorize the Chair of the Council to enter into a contract for services to represent the county before the Washington State Legislature.'",
        "'speaker_0': 'Jeff Mumm from council staff will provide the staff report. Mr. Mumm, the light is yours.'",
        "'speaker_3': 'Thank you, Mr. Chair. Just count the staff. As you accurately described, proposed motion 0264 would authorize the council chair to enter into the contract prescribing services. An RFP was issued earlier this year, and Amendment One, which is found on page 14 of your packet, would insert foster government relations as the RFP awardee.'",
        "'speaker_3': 'Also, I just want to point out Mac Nicholson, Council's government relations director, is here as well as Simon Treanor and then also David Foster and Cynthia Jackson from the tax office is also here to answer any questions. But this is the standard lobbying contract that the council members are used to seeing, and they should be used to'",
        "'speaker_3': 'seeing David Foster as a committee or face who has been awarded the contract in the past. It's a two year contract, and it would also allow the chair, the council chair, to enter into a one year extension if the chair so desires at the time that we can answer any questions.'",
        "'speaker_0': 'Colleagues. Any questions? Councilmember Bell duty.'",
        "'speaker_1': 'I'm going to make a motion, if you'd like one.'",
        "'speaker_0': 'I would be happy to have one move approval.'",
        "'speaker_1': 'For the do pass recommendation.'",
        "'speaker_0': 'Councilmember Bell, this year's move will give a to pass recommendation to motion 2021 to 64. Councilmember Belushi.'",
        "'speaker_1': 'I just spoke to this. Well, I thought every now and again it's good to open our contracts and make sure we run a competition. And we did that. And this is the result. You know, it seems that there's not a lot of competition in this industry, or at least not in this way.'",
        "'speaker_1': 'And we might find a way to get around that at some future point. But we've gotten good service and this is a good contract. So I, I urge it for our continued support.'",
        "'speaker_0': 'And Councilmember Bellucci, in addition to those eloquent words, I'd also welcome a motion to adopt Amendment One that members will find on page 14 of our packet.'",
        "'speaker_1': 'Of Amendment One.'",
        "'speaker_0': 'Amendment one is before us discussion on Amendment one. All those in favor of Amendment one, please signify by saying i. I. I opposed nay. The ayes have it. Further discussion on the motion as amended. Council Member DEMBOSKY.'",
        "'speaker_2': 'Thanks, Mr. Chair. And last time we this came up, we had some dialog and kind of trying to signal that we did hope to actually get some competition and other proposals. I understand we didn't hear and appreciate Councilmember Du Chair Chair kind of noting that, at least for the record.'",
        "'speaker_2': 'My question is just on the amount of the contract is that is what we're paying for this the same less or more than the prior contract with this provider?'",
        "'speaker_3': 'In on this journey on that one. Certainly have an answer for the council members. Magnificent and relations. Councilmember Dombroski. The contract amount is the same as it was awarded last time, which is 11,000 a month. So last year, at the start of sort of the COVID lockdown pandemic, the council asked the state contractor to take a bit'",
        "'speaker_3': 'of a haircut on that contract, about four for that last year of the contract. So that was a little bit of a lower amount last year. Otherwise, the contract amount for this new contract is the same as it was for the previous contract, which is 11,001.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_0': 'Further discussion. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Bell Duchin, I. Councilmember Dombrowski.'",
        "'speaker_2': 'I am.'",
        "'speaker_1': 'Councilmember done.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'Councilmember kowalski. I councilmember lambert, a councilmember of the ground.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Andre Bauer, I. Council members online.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 99 zero notes.'",
        "'speaker_0': 'Thank you. By your vote, we have given a do pass recommendation in motion 2021 to 64 as amended. We will. We will expedite that to full council. And if there is no objection, I would suggest we put it on consent as well.'",
        "'speaker_0': 'Thank you. And Mr. Foster and Mr. Shaw will would be disappointed if I didn't note that they are both here, though they did not turn on their video so I could not ascertain whether they were wearing a tie.'"
    ],
    "A MOTION requesting the executive provide an assessment report that makes recommendations on roles and responsibilities of the county and the King County Regional Homelessness Authority in responding to the regional homelessness crisis, and a motion accepting the assessment report.": [
        "'speaker_0': 'But I will point out that Mr. Nicholson's tie is overrated and unnecessary. With that, we will move to item seven on today's agenda. Motion 2021 to 89, which would request that the executive provide an assessment report that makes recommendations on roles and responsibilities of the county, city of Seattle and King County Regional Homelessness Authority and other cities'",
        "'speaker_0': 'in King County in responding to the regional homelessness crisis. April Sam Saunders from Council South will provide the staff report. Misunderstood. The line is yours.'",
        "'speaker_1': 'Thank you. Good morning for the record. April Sanders Council Policy Staff. The materials for item seven begin on page 65 of your packet. As a reminder, on December 11th, 2019, Council passed Ordinance 19039 authorizing the executive to enter into an interlocal agreement with Seattle for the development of the King County Regional Homelessness Authority.'",
        "'speaker_1': 'The authority has the mission to significantly decrease the incidence of homelessness throughout King County using equity and social justice principles. Additionally, on October 12th of last year, Council passed Ordinance 19179, which imposed a 1/10 of 1% sales tax for housing and related services.'",
        "'speaker_1': 'Since passage of the through housing sales tax, the executive has announced purchases of six hotels to house individuals experiencing chronic homelessness and of the six, three are located in Seattle and one each in Renton, Auburn and Redmond. With that background, I'll get into the legislation in front of you today.'",
        "'speaker_1': 'Proposed motion 2020 10289 would request the executive transmit an assessment report to the county on or before March 31st of 2022, as well as the motion accompanying the report. The report would provide a vision for and make recommendations on roles and responsibilities of various entities in responding to the homelessness crisis.'",
        "'speaker_1': 'The entities for which the assessment report would account are King County, the city of Seattle, the King County Regional Homelessness Authority and cities represented by the Southern Cities Association. The Assessment Report would provide these recommendations for roles and responsibilities in the near term, the immediate term and the long term.'",
        "'speaker_1': 'In addition to recommendations on the roles and responsibilities, the assessment report would do the following. It would identify investment and funding for the care program and describe how investment in programs will align with those administered by other entities.'",
        "'speaker_1': 'It would describe how the entities would coordinate on capital investments in facilities and operations in and maintenance of the facilities. It would identify which, if any, recommendations should be implemented from challenge to Seattle's Chronic Homelessness The Crossroad Report.'",
        "'speaker_1': 'And it would describe each entity's role and response roles and responsibilities and implementing challenge the panel's recommendations. As a bit of background on these last two components of the report, the organization Challenge Seattle is an alliance of chief executive officers from 21 of the region's largest employers, including Alaska Airlines, the Bill and Melinda Gates Foundation, Costco and'",
        "'speaker_1': 'the Expedia Group. Challenge Seattle released a report entitled Chronic Homelessness A Crossroad, which provides recommendations on addressing homelessness. The recommendations are in the following categories emergency housing for individuals experiencing chronic homelessness. Individualized on demand services. A command center to support individuals experiencing chronic homelessness.'",
        "'speaker_1': 'Utilizing real time data. Qualified. Experienced case managers. And transparency. Accountability and evaluation. The proposed motion states that the executive should consult with the City of Seattle, the Regional Homelessness Authority and the Sound Cities Association in development of the report.'",
        "'speaker_1': 'That brings me to the end of my staff report, and I'm happy to take any questions.'",
        "'speaker_0': 'Angela Bassett. Did you want to speak?'",
        "'speaker_2': 'Maybe if I could, Mr. Chair, just just provide a little bit additional context. First of all, I appreciate you scheduling this so quickly after introduction, and I'm not looking to move it today. There's not a rush on this.'",
        "'speaker_2': 'Second of all, let me see if I can undersell it a little bit. This is not intended to be, nor is it a policy motion. I'm not looking to set any new policy here with the council in this area.'",
        "'speaker_2': 'It is not a motion that calls for a new plan. I think we've got enough of those. And the Regional Homes Authority is going to develop kind of the regional plan. This is a very basic, at its core motion requesting kind of a status report that we took out the words plan and not looking for anything there'",
        "'speaker_2': '. And it's really driven by kind of the developments in the last couple of years since we set up the Regional Homelessness Authority, which is getting going now, and major developments, including our health through housing, where we're hoping to bring on some 1600 units of a kind of a new kind of housing that we've led the effort in'",
        "'speaker_2': 'creating here and the hoteling programs that have kind of come out of the pandemic that the county and the city have done just cares and similar ones efforts by some of our cities, like over in Bellevue, where they're standing up the new men's shelter.'",
        "'speaker_2': 'And basically there's a lot of additional kind of major developments that have occurred, I think, since the regional homeless authority was envisioned. And we, of course, the county will continue to provide, I think, our behavioral health services role.'",
        "'speaker_2': 'So this motion and then we've had this fairly significant report from Challenge Seattle, which looks at some other jurisdictions like Bakersfield, California and San Diego and has some recommendations there. It seemed like an important report that's gotten some attention that we ought to at least consider enough in a formal way.'",
        "'speaker_2': 'So I guess what I'm seeking to do here, Mr. Chair, and colleagues in the motion, is say, given those things that have occurred, and particularly after we transition some of our contracts over to the Regional Homeless Authority, Homelessness Authority here toward the end of this year, what is our role as the county going to be?'",
        "'speaker_2': 'What are some of the other players roles? And what, if any, recommendations should we be doing out of that challenge? See, I don't report a dialog with the executive and I think we have Kelly Ryder here in a for her for comments.'",
        "'speaker_2': 'They have a request for some additional time, which makes sense to me. And also, if I understand it correctly, some additional scoping modification. We don't want to be recommending what other jurisdictions should be doing. I think as I understand the core of it, and that all seems fine, fine to me.'",
        "'speaker_2': 'And I would like a little more time, a little more time, Mr. Chair, to work on language with them that suggested that we get into amendment form and bring it back to you. So that's it. And I'm happy to answer questions about that.'",
        "'speaker_2': 'Or you can have staff or maybe Kelly has a comment.'",
        "'speaker_0': 'As writer do you have? I will take that as an invitation. As writer, if you'd like to ask for comments, you're welcome to.'",
        "'speaker_1': 'Thank you, Mr. Chair. For the record, Kelly, writer, government relations manager for the Department of Community and Human Services. Happy to provide some brief comments here today. We think this is a reasonable request. We will be working through and over the next several months, especially as we prepare for the 2324 biennial budget process.'",
        "'speaker_1': 'We know that the homelessness system has always had close intersections with our mainstream systems, and so we will be doing the work to ensure that we have clarity around roles and responsibilities in the evolving work of the King and Regional Homelessness Authority.'",
        "'speaker_1': 'And it makes sense for us to be very transparent with you all in identifying where those are and our evolving work to ensure that we can meet the housing and homelessness needs of our region.'",
        "'speaker_0': 'Thank you, Councilmember Lambert.'",
        "'speaker_4': 'Thank you. Kelly, tell me the name again. What? Our program is where we're at the medical home where we put mental and physical health together. What's the name of that program?'",
        "'speaker_1': 'Are you thinking of the King County Integrated Care Network? Councilmember.'",
        "'speaker_4': 'Yes. So an integrated care network. Some of the counties are not having a lot of good success there. And so as as people are homeless, they may also have medical or mental health issues. And I want to make sure that we keep we keep that final authority even over the integrated network, because some of the counties have'",
        "'speaker_4': 'experience where they're not happy. But they have lost the control. So I'm very concerned about that. And then in the conversation that we had the other day, where not all of the information and a person is going into HMRC, only certain kinds of information is going into HMRC.'",
        "'speaker_4': 'So whatever information is not going into HMRC, we have to have a central place that you put in, you know, person X that whatever portal they came in to get services that the providers all know what those services are.'",
        "'speaker_4': 'So we're not being redundant and we're not getting good data. So those are my two concerns. Where's our data? If it's not integrated? HMRC and then keeping our role with Integrated Care Network are two things that I want to make sure that we are clearly on top of.'",
        "'speaker_4': 'Thank you, Mr. Chairman.'",
        "'speaker_1': 'Thank you, Councilmember. We certainly share your interest in maintaining our role in the King County Integrated Care Network. We believe that it's an innovative and strong program to be able to address the region's behavioral health needs and maintain our ability to really find intersections with the work that we are already doing as the county and be able'",
        "'speaker_1': 'to leverage those Medicaid benefits. What we know is that there are folks experiencing homelessness with behavioral health challenges and behavioral health disabilities. We also know, though, that the broad number of folks experiencing behavioral health disorders are not homeless.'",
        "'speaker_1': 'And so we want to make sure that we have a behavioral health system that's able to address the wide ranging needs of all of our county residents, while ensuring that those specific needs of our folks experiencing homelessness are being met.'",
        "'speaker_1': 'And so we feel that that's a great opportunity for the King County Regional Homelessness Authority to partner with us, to be able to help inform where there may be gaps that they're identifying among our folks experiencing homelessness. We I also heard your question the other day about the data system when we're speaking about the Navigator program.'",
        "'speaker_1': 'We are doing some work right now, especially to figure out how we ensure that the behavioral health data system and the homelessness data system are able to inform each other while being very careful, as always, about the requirements that we have to maintain secure and private data.'",
        "'speaker_1': 'We're doing some work on that. We will continue to build out our ability to really understand the systems. And I think having the King County Regional Homelessness Authority really lead on how we address the needs of homeless folks and inform our mainstream systems while our mainstream systems are able to inform them, is going to be a great'",
        "'speaker_1': 'path forward to informing you more about that through this report.'",
        "'speaker_0': 'Colleagues. Other questions regarding the motion before us. Discussing. Looking forward to the continued work by Councilmember Dombrowski and everyone's otherwise on board. I'm going to put words in your mouth and see if I can get anybody to say anything.'",
        "'speaker_2': 'And seeing some nice things. Thanks, Mr. Chair. And if colleagues have ideas, you know, this is a very simple kind of leap motion and Malcolm, other thoughts, but that's kind of where we're headed. And Kelly signaled one other thing that I didn't mention, which in my conversation with the exac I thought are the exact branches should be'",
        "'speaker_2': 'clearer I thought would be helpful and that is we will be heading into the, you know, a new a new budget season next year. And this document, the report coming out of it could be helpful in kind of just setting some.'",
        "'speaker_2': 'Setting setting the table a little bit in this space to help us see, you know, who's doing what and where we're going to be. And so I think it will be from a timing and content perspective, could be helpful there, too.'",
        "'speaker_2': 'So I appreciate colleagues taking a look at it and their time on the agenda today. So quickly out of the gate, Mr. Chair.'",
        "'speaker_0': 'You're very welcome. We look forward to discussing it further. Madam Clerk, we didn't miss anyone in any votes today. Is that correct?'",
        "'speaker_1': 'That is correct, Mr. Chair.'",
        "'speaker_0': 'Then we will move toward executive session again, as I said at the beginning of the meeting. There is no intention to take a vote after executive session, but I will come back to this zoom to reconvene and adjourn.'"
    ]
}