{
    "A MOTION proposing the allocation of future lodging tax collections to support arts, culture and heritage programs, workforce housing and youth services, and capital or operating programs that promote tourism.": [
        "'speaker_0': 'All in favor, say i ii i any post those are approved. Okay. We'll turn now to item five proposed motion 2018 0266 and asked Jeff Mumm and Andrew Kim, our central staff analysts who have been analyzing the legislation and related issues to come before us and make their presentations.'",
        "'speaker_0': 'Good morning.'",
        "'speaker_3': 'Good morning, Mr. Chair. Thank you. For the record, Andrew Kim, the counsel central staff, the staff report for this item begins on page 19 of your agenda packet. However, I would begin my briefing with some background information actually starting on the top of page 20.'",
        "'speaker_3': 'In 2011, the Washington state legislature passed. I'm sorry, the Washington State Legislature amended RTW 67.2 8.18 to allow the county to allocate the county imposed 2% lodging or hotel and motel tax revenues that will become available in 2021 for the following at least 37 and a half percent for arts museums, for art museums, culture museums, heritage museums'",
        "'speaker_3': 'at least 37 and a half percent for nonprofit organizations or public housing authorities for affordable workforce housing within one half of a mile of a transportation transit station, or for services for homeless youth and the remainder for capital or operating programs to promote tourism and attract tourists to the county.'",
        "'speaker_3': 'In 2015, the Washington State Legislature again amended RTW 6728 180 to give the county the ability to issue either general obligation bonds or revenue bonds to help finance the affordable workforce housing allocation of the lodging tax revenues. The bill requires that debt service or revenue bonds pledged against these revenues can make up no more than half of'",
        "'speaker_3': 'the 37 and a half percent of lodging tax revenues. It's one of just two episodes from the rising taxes think center jeff man counsels. Just to emphasize on this revenue stream, this is a credit against the state sales tax.'",
        "'speaker_3': 'So if the county the county technically opposes it, but if the county were not to impose it, the funds, a taxpayer would not see a reduction in tax. The funds would wind up just going to the state and the county would not receive any funds.'",
        "'speaker_0': 'Thank you. And I may have missed it, but did you specify the actual source and rate and on which transactions this is imposed.'",
        "'speaker_3': 'That it's a 2% credit against the state sales tax on hotel stays in King County?'",
        "'speaker_0': 'Is that all hotel stays, Jeff, or are there certain sizes in terms of property?'",
        "'speaker_3': 'Yeah, I think there's a 60 room limit, but I have to get back to you place of it. Thanks, Jeff. Now, if I can direct the members to table one on page 25, that provides a good summary of the proposed motion in alignment with the with the state law.'",
        "'speaker_3': 'So on page 25, there's a table. Table one provides a comparison between the state law and proposed motion 2018 00266, which is before you today. The table also references past council actions taken by Council in lieu of the state legislation action and in anticipation of future lodging tax revenues.'",
        "'speaker_3': 'So I'll go through. So the first column of the table one provides the allocation guidelines as per the state law, which I just brief the members. And the second Collinwood specified the allocation as proposed by the current motion before you.'",
        "'speaker_3': 'So the proposed motion would state the county's intent to allocate the lodging tax revenues that will be available beginning January 1st, 2020 for the following. 137 and a half percent shall be transferred to Fort Culture to support art museums, culture museums, heritage museums, the arts and the performing arts.'",
        "'speaker_0': 'This okay, I'm hearing some folks having trouble hearing pull the microphones and I sometimes talk softly myself. So Andrew and Jeff, both of you, pull up those mikes real close and Mark, crank it up to 11.'",
        "'speaker_3': 'Make sure the second allocation would be 37 and a half percent shall be allocated to Department of Community and Human Services to support transit oriented development development, including projects that preserve or develop workforce housing and ongoing services or projects that support homeless youth.'",
        "'speaker_3': 'And the last allocation, 25%, shall be allocated for the following one building for culture, bond, debt service and of the remaining 60% remaining to the Washington State Major League Baseball Stadium, Public Facilities, District for capital projects, and 3% of the remaining amount to the Kent Special Events Center Public Facilities District to support capital maintenance of the Acesso'",
        "'speaker_3': 'Show Wear Center. The proposed motion would also require the executive, in consultation with the Council, to develop a countywide strategic arts, heritage, historic preservation and Culture Plan. And the Strategic Plan is required to be sent to council by December 31st, 2019.'",
        "'speaker_3': 'Section C of the proposed motion would require the Council, the executive and the county visitor and tourism organizations to work in collaboration to set up a tourism promotion fund. And lastly, S.D., of the proposed motion request executive to develop and transmit legislation to support identified plan allocation as specified in the proposed motion related to the employment.'",
        "'speaker_3': 'Back to table one on the third column shows past Council actions related to this particular proposed motion related to the Affordable Workforce Housing allocation. In 2016, Council adopted a motion acknowledging the receipt of a transit oriented development bond allocation plan, which plans to issue $87 million of bonds revenue backed by lodging taxes for transit oriented development projects'",
        "'speaker_3': '. The plan also specifies that remaining lodging tax proceeds not allocated for debt service payments would be available for annual funding awards for other TOD projects or transit oriented development projects. The 2017. Transit Oriented Development Annual report states that approximately 16.2 million have already been awarded or set aside as specified as specified by the allocation plan.'",
        "'speaker_0': 'And Andrew, if I can jump in on that, on the 16.2 million of the $84 million, does that include the $10 million allocated to the Northgate Project?'",
        "'speaker_3': 'The the the 16.2 million that's already been set aside is actually part of the all county allocation, the 30.2 So the 10 million for the Northgate Project has not been allocated.'",
        "'speaker_0': 'That would be on top of that.'",
        "'speaker_3': 'That's correct. All right.'",
        "'speaker_0': 'And members could jump in with questions as they're going along. Councilmember Gosset.'",
        "'speaker_4': 'Thank you, Mr. Chair. Were you reading from the ordinance or the state law and rise to this measure?'",
        "'speaker_3': 'So initially, Councilmember Garcia, I recited the provisions of the state law and then I so if you look at table one on page 25, the column one provides the provisions of the state law. And then I recited the allocations, specify the proposed motion on column two.'",
        "'speaker_3': 'And then now what I'm doing is I'm reciting some references to past council actions that you've taken in lieu of the the lodging tax revenues.'",
        "'speaker_4': 'And okay, then can you could you reiterate what just very briefly what the state said about how much money should or shall, I don't know what language they use, go to culture and how much would go to housing like for homeless?'",
        "'speaker_3': 'Oh, sure. So the state law states that at least 37.5% of the lodging tax revenues beginning they'll be collected starting January 1st, 2021 would go for arts and then at least 37 and a half percent would go to work for the federal housing.'",
        "'speaker_4': 'Okay. So my interpretation is that the other 25% could go to these two items if the legislative authority and the county king wanted it to.'",
        "'speaker_3': 'Yeah, that's correct. Correct. Okay.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Continuing on, Mr. Chair. And then lastly, related to the towards the MAP allocation, in 2015, the Council adopted a motion which established the Building for Culture Program to fund capital projects that supported arts, culture and heritage using the future lodging tax revenues.'",
        "'speaker_3': 'Various ordinances effectuated the motion to implement the program and issued $29 million of bonds for 102 capital projects. As council members are aware, the full council will take up proposed Ordinance 2018 0257 to reallocate $1.7 million and modify the adopted list of projects this afternoon.'",
        "'speaker_3': 'I would also like to note that the the allocation is specified in the proposed motion complies with the guidelines of the state law. And with that, I'll turn it over to Mr. Mom. Thank you, Andrea. Now, I'd like to take the committee to page 22 of the staff report.'",
        "'speaker_3': 'And this is where I've done a draw down on the provisions of the PFG. This is the this is the end of the proposed motion. 60% of the of the tourism allocation would go to the public facility district starting in 2021.'",
        "'speaker_3': 'So in 1995, the state legislature authorized the county to impose three new council magic taxes to finance construction of what's now known as Safeco Field. It was a half a percent restaurant tax, 2% car rental tax, and a 0.017% sales and use tax, which was a credit against the state sales tax.'",
        "'speaker_3': 'So again, this is a situation where the taxpayer wouldn't see an increase, but normally state dollars are coming back to help build the facility. In October of 1995, the county enacted Ordinance 12,000 to oppose these taxes and then also to create the Washington State Major League Baseball Stadium Public Facility District, which we had been calling the BFD'",
        "'speaker_3': '. And and that it was the BFD was was formed to build and maintain and operate. They've got the party is governed by a seven member board, four of whom are appointed by the county and three of whom are appointed by the state.'",
        "'speaker_3': 'The county can then land associated with the ballpark's construction to the BFD issued 336 million in bonds to be repaid with the revenue stream stated above and the bonds repaid back in October of 2011. And those taxes expired with the bonds.'",
        "'speaker_3': 'The. Legislature also authorized the FDA to impose a 10% parking tax and a 5% admissions tax on ticketed events at Safeco. These taxes are still in effect and go to maintaining and operating the facility in as a part of the financing package, the Seattle Mariners pledged to contribute up to $45 million for the ballpark's design and construction'",
        "'speaker_3': ', as well as they pledged to cover cost overruns associated with the ballpark's construction. The final costs for the ballpark amounted to 517 million, with the county and state contributing 372 million, and the Mariners contributed $145 million. The the Mariners entered into a 20 year lease, which expires at the end of this year.'",
        "'speaker_3': 'In 2015, the Mariners and the PFG began discussing new lease terms and hired BND venues and populous architects. This is a consulting firm to investigate future capital costs over a 20 year period. The consultant team issued its preliminary report in 2015 and updated it in May of this year and identified 385 and a half million dollars worth'",
        "'speaker_3': 'of necessary improvements to keep the ballpark in first class condition through 2021. The report also identified proposed upgrade improvements and these would enhance the ballpark's economic vitality through that same time period. The report did not include cost estimates with these upgrade improvements.'",
        "'speaker_3': 'In May of this year, the PFA adopted Resolution 18 004, which identified the $385 million in necessary improvements identified in the consultant's report, and also cited the Mariners estimate for upgrade improvements to cost an additional $160 million. No specific upgrade improvements were identified in this resolution.'",
        "'speaker_3': 'However, the Mariners have provided a list of potential upgrade improvements to council staff totaling $180 million, and have stated that this list represents a minimum of what they believe would be necessary. Upgrade improvements. The merits of also stated a council staff that expansion of the current parking facility may also be necessary in addition to the upgraded improvements'",
        "'speaker_3': '. However, executive staff has confirmed to council staff that the proposed funds to the city would only be used to support major maintenance needs at the ballpark and would not be used for upgrade improvements. An attachment A of the staff report shows the list of proposed upgrade improvements.'",
        "'speaker_3': 'On May 23rd, 2018, the Mariners agreed to new lease terms in a term sheet for use of the ballpark from January 1st, 2019 through December 31st, 2043. However, no final lease has been executed. Attachment seven of the report includes a copy of these terms of this term sheet.'",
        "'speaker_3': 'So just to make thing boiled down, boil some things down for the council members. We included a chart on page 26 and the report to show a roll up of the funds proposed under the fund allocations proposed under the motion.'",
        "'speaker_3': 'And as you'll see that under this proposal a over the time period under lease and the motion, 476 million would be allocated to arts, culture and heritage at 476 million would be allocated for affordable workforce housing near transit.'",
        "'speaker_3': 'And we show and this is the council has already allocated some of these funds and then the remainder that's 25% would total 318 million, with 22 million going for a past debt service on the Building for Culture program between 177 180 million going to the PFA, 1.3 million going to show Showa center in Kent and then the'",
        "'speaker_3': 'remaining being is unallocated. And then just to sum up, I wanted to briefly just feature four for future actions by the Council on Friday, the executive transmitted to the Council staff into the Council and a proposed agreement between the city and the county to transmit the funds as proposed in the motion we received on Friday.'",
        "'speaker_3': 'So me all review is still ongoing on that. But the Mariners have indicated to council staff that that they won't be able to start lease negotiations with the BFD until that INTERLOCAL agreement is adopted by the county and the Council also will need to take if they approve.'",
        "'speaker_3': 'The motion also need to take take legislative action to to approve the funds for the show work center and then the executive which would need to transmit the two reports, the strategic reports regarding arts and heritage funding and tourism promotion to the Council.'",
        "'speaker_3': 'I believe the next I think the council chair at the of the committee chair at the beginning of the meeting stated that the committee will take this issue up again in on August 29th. And with that, that is our our staff report and we are happy to answer any questions.'",
        "'speaker_0': 'Okay. Councilmember Up the Grove.'",
        "'speaker_2': 'Thank you, Mr. Chair, of a couple of questions. And thank you, Jeff, for the presentation. You noted that the parking and ticket tax revenue will go to support stadium upkeep. Do you have a sense of how much money that those public tax dollars will generate for the stadium over the duration?'",
        "'speaker_2': 'If there were 25 year lease.'",
        "'speaker_3': 'Approximately $175 million.'",
        "'speaker_2': 'That's it. And you mentioned the different categories of funding proposed in the consultant's report that were identified. There were some maintenance upgrades. And you characterized I don't know if these were your words, but there is 160 million in optional I'm calling them optional upgrades or the nice to haves separate from the necessary required maintenance and upkeep.'",
        "'speaker_2': 'And would there be anything preventing the 160 million that are being proposed in a financial plan for the optional upgrades from instead being spent on the necessary upkeep and maintenance? No. And last one more, if I might, Mr. Chair.'",
        "'speaker_2': 'That's. I don't.'",
        "'speaker_0': 'Know. Only have three.'",
        "'speaker_2': 'We have three. I'm sure that we have another hearing coming. That's the. You talked about the well, Andrew talked about what the state law says about spending or what have you talked about what the state law says about how we have to spend this hotel, motel money that at least 37.5% on arts and culture, at least 37.5%'",
        "'speaker_2': 'on housing and the remainder on tourism. I guess what is the bare minimum required by state law that we have to spend on housing? And how does that compare to this proposal?'",
        "'speaker_3': 'So as per state law, there isn't a bare minimum I'm sorry, as per state law, at least 37 and a half percent would be spent on affordable housing. So I guess that would be the bare minimum for affordable housing, at least 37 and a half percent for arts and culture.'",
        "'speaker_3': 'And based on the past council actions of for the building for a culture program, I would say that based on that motion and legal analysis still ongoing on this, but the funds dedicate it for the debt service payments are the Building for Culture program should be dedicated for the tourism portion of the lighting tax revenues.'",
        "'speaker_2': 'So to clarify, this proposal does spend the bare minimum required by state law on affordable housing.'",
        "'speaker_3': 'That's correct. Okay.'",
        "'speaker_0': 'Thank you. Councilmember up and remove other questions or comments. Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. Andrew and Jeff. I just want to clarify that what we're talking about is if this proposal were to go through or some version of it, that some amount of funds would go to the public facilities district for use at a publicly owned stadium, not to the Mariners organization, which is the key tenant of'",
        "'speaker_1': 'the building.'",
        "'speaker_3': 'Yes, that's correct.'",
        "'speaker_1': 'Okay. So the public facilities district makes the determination in entering into contract with the Seattle Mariners and how it would be the funds would be expended. Is that accurate?'",
        "'speaker_3': 'Actually, I believe that. And I've only I've only been able to read the Interlocal agreement between the county and the PFA. And so in that agreement it specifies that the funds have to go to and upkeep. Big. Yeah, big maintenance.'",
        "'speaker_3': 'Yes. Yeah.'",
        "'speaker_1': 'Not for brewpubs or anything.'",
        "'speaker_3': 'Great. It says it can't it cannot go to those types of things.'",
        "'speaker_1': 'That's right. Thank you. And secondly, do you have any information about the revenue that comes in to the county that can be used for affordable housing and other projects because of the Safeco Field? I know there are other tenants besides the Mariners.'",
        "'speaker_1': 'Are there other other programs going on there? Concerts and all sorts of events at Safeco Field? You're looking at me quizzically, Jeff. So we have revenue coming to the county because.'",
        "'speaker_3': 'We know.'",
        "'speaker_1': 'The hotel motel.'",
        "'speaker_3': 'Oh, okay. Are you asking about hotel stays? That would happen because of events at Safeco Field that are not the Mariners.'",
        "'speaker_1': 'Yeah. Any money that is spent for people attending events.'",
        "'speaker_3': 'I can try to find that type of information for you.'",
        "'speaker_1': 'I'd appreciate it. Thank you.'",
        "'speaker_3': 'Clarifying.'",
        "'speaker_0': 'Sure. Guzman broke the rules.'",
        "'speaker_2': 'Thank you, Mr. Chair. That last question confused me a little, I guess. Are the Mariners the sole tenant, and if somewhat other activities are taking place there? Don't the Mariners keep the revenue and the ticket and stadium taxes generated also go back in there?'",
        "'speaker_2': 'I mean, I guess it is the are the Mariners the sole tenant or are there multiple tenants?'",
        "'speaker_3': 'Yeah, the Mariners are the total tenant and then they and yeah. And then they I guess, I don't know, but the proper term means. But they sublease that tether to concerts and events and things. The ticket tax revenue for any of those events goes to the the D imposes that tax and so it goes to the top'",
        "'speaker_3': 'of the ticket tax revenue.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'A few other questions or comments of staff. I have a couple of follow ups in your staff report. You indicate that the updated report you're talking about the body and populous architecture report, that the update report indicated 385 and a half million dollars worth of necessary improvements would be necessary to keep the ballpark in first class condition'",
        "'speaker_0': 'through 2041, where the county is not being asked to fund all of those, quote, necessary improvements with the hotel motel tax. Are we.'",
        "'speaker_3': 'No. The county is being asked for approximately 870, $790 million. So a significant portion, but not not the entire.'",
        "'speaker_0': 'And do you have any understanding of where that number came from? Why is it that.'",
        "'speaker_3': 'Number, that 385.'",
        "'speaker_0': '177, 290 million?'",
        "'speaker_3': 'It's my understanding that it's the me, the delta between what under the new lease, there are there's specified contributions from a team to a maintenance fund and then, you know, had to get back to you. But the short answer is it's sort of what the what the what the team believes it needs to make the upgrade improvements'",
        "'speaker_3': '. It's the. It's what's left over in the budget. What the team's going to contribute to the the facility with the can contribute through its taxes and then to make all of the necessary improvements and then $160 million worth of upgrade improvements to keep the ballpark relevant through the terms of the lease.'",
        "'speaker_0': 'Well, the upgrade improvements here, the rationale is and there's $160 million of those to enhance the ballpark's economic vitality. Does that mean make more money?'",
        "'speaker_3': 'I can read from you that.'",
        "'speaker_0': 'I mean, I'm trying to understand we're talking about.'",
        "'speaker_3': 'I think it's to make.'",
        "'speaker_0': 'You know, to get 500 and some million dollars over the 25 years here. What is the purpose? We've got some purpose for basic maintenance and some purpose is for upgrade enhancements to enhance the ballpark's economic vitality. If I understand the base of the proposal, the Mariners will pay for the upgrade improvements.'",
        "'speaker_0': 'Based on your answers here earlier, those dollars could also be used otherwise to pay for the basic maintenance and necessary improvements if they weren't going for the upgrade improvements.'",
        "'speaker_3': 'So the consultant report on page 94 of the consultants report when they talk about the upgrade improvements and this is the consultant's words and for reasons maintaining or approving upon the patron experience, expanding or maintaining revenue streams, attracting new demographic groups to the facility, and maintaining Safeco as competitive position within the market.'",
        "'speaker_0': 'Okay. And is there any quantification of the additional revenues that those investments might generate.'",
        "'speaker_3': 'And have been provided.'",
        "'speaker_0': 'With respect to the timing of these dollars currently? What is the use of these proceeds? Where are they going to today?'",
        "'speaker_3': 'Right now, they're paying up bonds for CenturyLink.'",
        "'speaker_0': 'And are those bonds paid off? When are they expected to be paid off?'",
        "'speaker_3': '2021.'",
        "'speaker_0': 'When under the proposal, would these dollars be transmitted to the BFD if the Council were to approve this legislation?'",
        "'speaker_3': 'The revenue stream would become available for the tourism in 2021. So that's that's the soonest that the county could transmit to the update. I'm not remembering that the terms in the alagoas is precisely, I think, annual transfer, but I don't know the precise date.'",
        "'speaker_3': 'But it can't happen until 2021.'",
        "'speaker_0': 'All right. And so is there can you help me understand, is that just the expiration of the current lease that brings this issue before us today? It sounds like we're being asked to spend money today that we don't quite have yet coming in yet.'",
        "'speaker_3': 'Yeah. It's probably best answer by executive staff, by the proposals before us today.'",
        "'speaker_0': 'Okay. I think we do get I want to if she's here, I think Rachel Schmidt, the executive's chief of staff, was going to be present and members should have a chance to ask her questions. If she is. I don't.'",
        "'speaker_0': 'She's. Oh, she's here. Okay. There she is. Thank you for being here, Rachel. We might have a couple of questions for you. Are there a couple other questions, Jeff, if you might, or Andrew? Does every jurisdiction in King County collect this hotel motel tax and transmit it for disposition by the county council or other jurisdictions that keep'",
        "'speaker_0': 'it and spend it on other purposes?'",
        "'speaker_3': 'So the tax is imposed by the county and county wide. However, in the city of Bellevue, the city of Bellevue retains the tax that is collected in Bellevue and hotel motel stays.'",
        "'speaker_1': 'All right, Mr. Chair.'",
        "'speaker_0': 'Councilman Bell.'",
        "'speaker_1': 'The 2%. Not all of it.'",
        "'speaker_3': 'That's correct. The 2%. The county imposed tax. Thank you.'",
        "'speaker_0': 'And we're just talking about the 2% here. Or are we talking about something else?'",
        "'speaker_3': 'We are only talking about the county imposed 2%.'",
        "'speaker_0': 'I see. So I'm just trying to understand the mechanics of this. So hotel stays in the city of Bellevue would not contribute to this fund.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_0': 'And what do they is that for maiden power? Is that what they use?'",
        "'speaker_3': 'As my understanding?'",
        "'speaker_0': 'Okay. All right, counsel. Sorry, Counselor McDermott. Thank you, Jeff.'",
        "'speaker_2': 'Thank you, Mr. Chair. Gentlemen, I'm interested in delineating the affordable workforce housing portion of the funds, the 37.5% or greater that would be dedicated to housing. Can you walk me through what has already been announced or invested from those funds and what remains and whether and I believe there's been an announcement from the executive about part of'",
        "'speaker_2': 'those.'",
        "'speaker_3': 'I can take that one. So on page, on top of page 22 provides a list of the allocations as the Council adopted in terms of the transit oriented development program.'",
        "'speaker_2': 'So that's the work we did a couple of years ago. That's correct. Okay.'",
        "'speaker_3': 'And and so that would allocate that would total approximately $87.87 million, which would be funded to fund those projects. And the revenues would pay the debt service for those bonds. The allocation plan also states that any portion, any remaining portion of the Affordable Workforce housing allocation would be used for annual funding awards for other types of transit'",
        "'speaker_3': 'oriented development, housing projects.'",
        "'speaker_2': 'So we've already bonded. We've already announced and bonded 87 million, the details of which are at the top of page 22. And then there's another 360 million available for annual awards or potentially to bond for a larger investment upfront.'",
        "'speaker_3': 'That's great. We haven't bonded yet, but but we're anticipating to start with the bonding process in 2021. And the remaining, as you said, would go to the annual funding awards. But you mentioned 60 million that you mentioned.'",
        "'speaker_2': 'Okay. Yeah. Thank you.'",
        "'speaker_0': 'Thank you. Could I. Do you mind if I follow up on that? The 360 million has over what time period?'",
        "'speaker_3': 'So that's if you go to table two, that that would be the time period from 2021 to 2023. So there isn't a there hasn't been a time specified in the total allocation plan. But if we're using the time frame, as we've provided through this analysis, it would it would total approximately 316.'",
        "'speaker_0': 'Okay. And I think I understood. Would you confirm for me with respect to the executive's announcement of another $100 million in bonding from the 37% for housing fund? Does that consume that entire revenue stream for this period of time, or would there be additional housing designated resources available.'",
        "'speaker_3': 'If it doesn't consume all of it? It consumes a bunch of it. I've done some initial work on it, but I don't know. I haven't compared notes with the executive on things like assumptions of interest rates and things like that, but it's a good chunk of it.'",
        "'speaker_0': 'We've spent we don't like we've announced all the allocations, in essence, it sounds like, on that. And there could be some right here.'",
        "'speaker_3': 'I think finding an additional $100 million would take up a significant chunk of that stream. Okay.'",
        "'speaker_0': 'Thank you. Councilmember Coe Wells.'",
        "'speaker_1': 'Used to chair for either of you on page 25. Table number one and the first column number two. So the the allocation that could go in terms of a guideline of at least 37.5% for affordable housing, has some constraints to it.'",
        "'speaker_1': 'That's correct. Which are delineated in A, B and C.'",
        "'speaker_0': 'Hmm.'",
        "'speaker_1': 'Is there any provision under the statute that would allow some other type of funding or some other type of allocation? Or does it absolutely have to be one of those three categories?'",
        "'speaker_3': 'There's no other delineation, Councilmember. Those are the provisions as per state law as you read it.'",
        "'speaker_1': 'And could you just re go over number C here again? Because it's kind of convoluted. I'm trying to figure out what all could be possible within that category.'",
        "'speaker_3': 'Sure. So provision C was a provision that was amended by the Washington state legislature in the second round of amendments to that particular provision. So initially, the at least 37% was to be used for affordable housing. But Provision C allows that portion to be bonded using either general obligation bonds, which we wish the council members have already'",
        "'speaker_3': 'dedicated to do so through the bond allocation plan. And it also allows it to it also allows some of the revenues to repay any bonds related to projects authorized by the Community Preserve Preservation and Development Authority, which is another entity.'",
        "'speaker_3': 'If they were to propose a project that that those funds could be used to repay any bonds that they would have authorized.'",
        "'speaker_1': 'And there is a provision about housing, affordable housing or sustainable workplace opportunities near a community impacted by the construction or operation of tourism related facilities.'",
        "'speaker_3': 'So for that particular provision where it says community impacted by the construction or operation of tourism related facilities, that that particular provision is related to any project that would be authorized by the Community Preservation and Development Authority. So it's a bit independent of the Affordable Workforce housing provision that we generally know for that particular application.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Performance Councilmember Up the Grove.'",
        "'speaker_2': 'Thank you, Mr. Chair. This one is probably for Jeff. It's a two part question. Under the terms of the current lease, the one the Mariners are currently operating under, who's responsible for maintenance and upkeep of the field?'",
        "'speaker_3': 'The Mariners are responsible for day to day maintenance and upkeep and and also a lot of major maintenance. If there's some unanticipated expense that is associated with the design of the ballpark or something to that, then that the parties are responsible.'",
        "'speaker_3': 'The Mariners, I think in practice and I can get back to you. More details on this minor stand ins then in practice the Mariners have gone in there and fix would have ever had to get fixed right away and then are reimbursed by the by the PFA for those and the PFA uses its its funds, its ticket'",
        "'speaker_3': 'tax revenue and rent to reimburse for those types of expansions.'",
        "'speaker_2': 'And what do you what have you been able to discern from public sources about the any profit or revenue made by the team during the time the terms of the first lease? And also, what do we know about the growth and the value of that business?'",
        "'speaker_2': 'And I guess what I'm getting at is, is it possible for a business to be responsible for the maintenance and upkeep and still generate wealth? So I guess it's a two. It's a two. Do we do we know what what do we know about it?'",
        "'speaker_2': 'From the research we've done about the so the finances.'",
        "'speaker_0': 'And I think the region grantees are getting excited back there.'",
        "'speaker_2': 'Hold tight, let us do our work and we get to Austin. And I know we don't have access to the private financial records, but I know there's been some reporting about the growth in the value of the team and in the revenue generated by the business.'",
        "'speaker_3': 'Under the terms of the current lease, there's a profit sharing provision in it that if the Mariners have a profit in the year, they are to contribute 10% of the profit to the to the BFD. However, the lease also recognizes that the Mariners incurred a $200 million operating loss between 1995 and 1999, and so that every year'",
        "'speaker_3': 'when they do their profit sharing or when they report to the FDA their profits, they if they have a profit, they credit against the loss that they incurred. So over the over the last 20 years, according to the last profit sharing report in 2017, the Mariners have winnowed that $200 million loss down to a bit over $5'",
        "'speaker_3': 'million. And the second part of your question on valuation, the team, I have no way to provide that information. There are a bunch of different news outlets from time to time provide that information. In 2016, a portion of the team, the team bought out one of the majority owners and I believe they bought about 40% stake at'",
        "'speaker_3': '$600 million. So you can maybe come up with some sort of valuation. Somebody thought that that was worth $600 million.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilmember Von Bauer, then Councilmember Lambert, who's on the phone?'",
        "'speaker_2': 'Well, thank you, Mr. Chair. Just picking up on some of the concerns or questions from the previous speaker customer, Goss and I have had the privilege of being through this process before.'",
        "'speaker_3': 'And we understand that there's a lot to be said, not only for the major issues that many of the people in the audience are here to discuss.'",
        "'speaker_2': 'But also we recognize we have we're partners in this, and it's important to know about our partners in terms of who are getting into an agreement with. I think it's also important, Mr. Chair, to recognize that Major League.'",
        "'speaker_3': 'Attendance is the lowest in 15 years. Across the board. Attendance is down in Major League Baseball, and we're very fortunate that we have a winning team here that's been very successful. But we have to recognize that they're also facing some of the changes in today's economy.'",
        "'speaker_3': 'So looking at these figures, I don't want to be confused about the reality. And we're not operating in a vacuum here because the agreement we have here with the Mariners is not something separate from what's going on in Major League Baseball in.'",
        "'speaker_2': 'Particular, in sports in general. There's a lot of changes taking place.'",
        "'speaker_3': 'Flat screen TV is very attractive to a lot of people who are no longer attending.'",
        "'speaker_2': 'Games at all levels. And so it's very important to recognize that some of the dollars that we are talking about may not project forward.'",
        "'speaker_3': 'As much as they have been something out of the past. I also recognize that this is an opportunity for us to get some issues.'",
        "'speaker_2': 'Reviewed, and especially during this.'",
        "'speaker_3': 'Month that you've asked us to come up with. And I think it's important to see what's happening and other teams around the league. And Jeff and I hope that you have a chance to see what's happening with other negotiated contracts, how this contract stands in.'",
        "'speaker_2': 'More recent contracts around the league. Again, we've been through this process before.'",
        "'speaker_3': 'We almost watched this team. I don't want us to get into a nose to nose battle where we find ourselves faced with a potential loss of a major factor in this community, one of the best sporting events where families can still attend.'",
        "'speaker_3': 'And I'm hoping that we recognize that this is still a financial challenge for everybody across the board and that this is not a golden goose that's going to lay all the.'",
        "'speaker_2': 'Golden eggs for all our.'",
        "'speaker_3': 'Problems. We have to deal with a lot of problems as members of the King County.'",
        "'speaker_2': 'Council not too long ago without. And I guess about.'",
        "'speaker_3': 'Five years ago we had the anniversary of the time we said we'd end homelessness in ten years. And money does not answer all our problems. But hopefully today that will begin a serious discussion and our due diligence on the campgrounds process of this contract and recognize that we're working as partners in this with the mariners and not'",
        "'speaker_3': 'adversaries. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Lambert. And then we'll move on to public comment pretty quickly.'",
        "'speaker_5': 'Thank you, Mr. Chairman. Interesting that parking fees are back again. That was the last item in the negotiations that did originally and in Olympia. So I think said he was here on the council. I was in Olympia when they were working on this before.'",
        "'speaker_5': 'So I would like to know more. And I remember earlier they were talking about the package. I'd like to hear more about that plan to vacate that amount. I'd also like to know what you believe is the condition of the building.'",
        "'speaker_5': 'We think that it's been well maintained as there have been some deferred maintenance. And my last question is, if we were to pay the bonds up early, how much could we save? And over again what the bond interest rate is that we are still paying.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. So some follow up information on the parking revenue and condition of the stadium. Maybe you could touch briefly on that, quote, applicable standard, end quote, in this column for here. And then the interest rate and potential for early pay off is what I heard.'",
        "'speaker_3': 'So that under the terms of the current lease, there's something called the applicable standard and we'll have more on the leases in the next briefing. But basically the team needs to keep Safeco up to a first class as a first class stadium compared to stadiums that were built between 1990 and 1999.'",
        "'speaker_3': 'And it's my understanding and I think the PFA and want to speak for them, but in conversations I had with them, they were very satisfied with the condition that the that the stadium has been it is in right now as far as paying off the bonds early, even if if the bonds were to be paid off early'",
        "'speaker_3': ', the state law, I believe those funds wind up going to it like a youth sports facility, like a statewide youth sports facility program. So they're already spoken for. So paying them off and it's just we can't control the stream.'",
        "'speaker_3': 'We'd have to we'll have to get more get back to you on that one. But the funds are spoken for under statute from now through the foreseeable future.'",
        "'speaker_0': 'Thank you, Councilmember Kowalski.'",
        "'speaker_1': 'Yes, thank you, Mr. Chair. Another question. With regard to the upgrades and maintenance needs that's identified by the Mariners or by the PFG, are those included in the lease requirements? Are they something that the Mariners, for example, are required to do to maintain the lease?'",
        "'speaker_1': 'I don't know if I'm asking.'",
        "'speaker_3': 'Yeah. They are required. They would be required to. The facility needs to be maintained and I'll have to get that direct the exact. I can't remember how specific the consultant's report is identified in the in the there's no new lease yet.'",
        "'speaker_3': 'But in the resolution adopting the term sheet for the new lease, it calls out the $385 million and presumes that those will be done. That has to be done.'",
        "'speaker_0': 'Thank you. Thank you. Any other questions? We do have a representative, vice president, general counsel for the mayors. Fred Rivera is here and is available, has made himself available. If members have questions, he's going to speak during the sign up time.'",
        "'speaker_0': 'But does any member have a question for the Mariners organization at this time? Exactly. Sure. And we have Rachel Smith here as well. I don't want to put them on the spot if there's no questions. So does any member have a question or would Rachel, do you have anything you'd like to offer on behalf of the executive'",
        "'speaker_0': '? No. Councilmember one right there.'",
        "'speaker_2': 'But I make sure I understood what you said. I want to make sure that we have an opportunity here from the public here.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'I also want to make sure that if anything were raised in the preliminary discussion by our staff, the Mariner Organization, to respond or clarify or add.'",
        "'speaker_2': 'To the fair, they have that opportunity.'",
        "'speaker_0': 'Okay. And I'm see a nod from Mr. Rivera. Now, come on up here, Fred. And the BFD, our public facilities district was invited. I don't believe they're here, but if there is a representative from the public facilities district, would you make yourself known?'",
        "'speaker_0': 'No. Okay. Thank you, Fred. Welcome. Go and introduce yourself.'",
        "'speaker_3': 'Thank you. Fred Rivera, executive vice president and general counsel. All right.'",
        "'speaker_0': 'You heard the dialog there. Is there anything you want to add to or clarify?'",
        "'speaker_3': 'Yeah, I want to I want to summarize the overall expenses over the next 25 years that we've determined and also addressed the upgrade capital improvements that will be required. First, the overall anticipated expenses over 25 years is $800 million.'",
        "'speaker_3': 'That includes $250 million for operation and maintenance, which the Mariners will pay 100% of. There's the capital upgrades that were referenced before, and this is necessary. These are not discretionary. This is not discretionary work that needs to be done under the applicable standard and the term sheet.'",
        "'speaker_3': 'For the next 25 years, the ballpark will be judged against the top one third of ballparks and Major League Baseball in order to keep it relevant. Those upgrades or those concepts at a minimum will need to be required.'",
        "'speaker_3': 'And so that estimated $180 million is the minimum for the upgrades to meet the applicable standard under the new lease. The last component is the necessary capital improvements. That's the $385 million for which the allocation would, would would go towards.'",
        "'speaker_3': 'And that's the only bucket of maintenance that this allocation would address.'",
        "'speaker_0': 'Thank you. Councilman up there.'",
        "'speaker_2': 'Thank you, Mr. Chair, and thanks for being here this morning. That's the question. That's part rhetorical, but it's an honest one. If you're to believe Forbes magazine and I don't that hasn't been independently analyzed that the their valuation of the team shows the value has increased by $1,000,000,000 over the last seven years.'",
        "'speaker_2': 'Given that, why couldn't the owners finance these upgrades rather than drain public resources that could be used for housing?'",
        "'speaker_3': 'Or I'll repeat what I just said, and that is the Mariners are paying for the upgrades. We're paying 100% of the upgrades we've negotiated for over a year with the public facility district that owns the stadium. We are the tenants.'",
        "'speaker_3': 'These are the terms that we negotiated. I think both parties think it's fair for members of that body are confirmed by by by the county. And these are the terms that overall we think represent a fair allocation of responsibility for a publicly owned asset.'",
        "'speaker_0': 'Other questions for Mr. Rivera. I'll say if they happen to listen or watch this. You mentioned that four members of the party are appointed and confirmed by this county. I'd like to hear from them. There they are. They are looking out and running the public entity for the public.'",
        "'speaker_0': 'And to be honest, Mr. Rivera, I don't I'd like to see a little bit more of them to make the case. And I haven't. Just to for two more questions, then we'll open up to public comment. Mr.. Jeff.'",
        "'speaker_0': 'Mr. Mom, you indicated it was a range hundred 65, $190 million with respect to hotel motel tax. Under this agreement, is there any cap or any limit or is it a percentage of the receipts?'",
        "'speaker_3': 'Yeah, under the end of the ordinance or I'm sorry, end of the motion. It's a percentage. It's 60% of the that the tourism of the funds that would be available for tourism for 60% of the 25% of the 99 estimate.'",
        "'speaker_0': 'So it could be higher if we keep growing and have more rooms and stays. There's no cap.'",
        "'speaker_3': 'There's no cap.'",
        "'speaker_0': 'And can you help me understand why? No. All right. Mr.. That's an open question that maybe something can help in like next month. Mr.. Garrett You've indicated that the Mariners do generate tourism visitors here to the region and hotel motel nights stays.'",
        "'speaker_0': 'Can you tell us a little bit about the studies that have been done in terms of the dollars of this hotel motel tax that the Mariners believe that they generate?'",
        "'speaker_2': 'A third party report.'",
        "'speaker_3': 'That was commissioned by both the PFO and the Mariners identified $3.8 billion in economic activity during the 25 year lease term. I believe it's 2.8 billion of that is right here in the county, including 3300 full time equivalent.'",
        "'speaker_2': 'Jobs per year.'",
        "'speaker_3': 'Inside and outside of the ballpark in the area, which you may be familiar with, Silver Cloud in Hoover, Bill Bar, those type of areas. And over the term of the lease, that'll generate $2.2 billion in wages, according to the third party report.'",
        "'speaker_0': 'And with respect to the hotel motel tax receipts, what is the study show that those are generated from Mariners days?'",
        "'speaker_3': 'I don't know. I'll have to get back to you. I don't know that it's specifically identified that portion.'",
        "'speaker_0': 'There's not a number of $50 million.'",
        "'speaker_3': 'I don't know, off the top of my head.'",
        "'speaker_0': 'Okay. Mr. Mom, have you seen anything on that?'",
        "'speaker_3': 'The consultant report. It says that the folks who come to Mariners games, 5% of them would need hotel stays. And I think that's 100,000 stays a year something that in that nature but I can get more information can.'",
        "'speaker_0': 'Be helpful because we're on our guard.'",
        "'speaker_2': 'Well, just a question relative to what I raised earlier, Mr. Rivera. You know, I've been reading the.'",
        "'speaker_3': 'Same Fortune magazine that my colleague has been reading, and it's pointed out that Major League attendance is down. Can you speak to that and some of the concerns? Because obviously that's a.'",
        "'speaker_2': 'Financial concern for the organization.'",
        "'speaker_3': 'It's a major concern across the league. The commissioner addressed that at the All-Star break just a couple of weeks ago. Attendance is significantly down and that's because people are watching games in a different way. They're not going to the game.'",
        "'speaker_3': 'They're watching it on devices when they come to the game. It's not necessarily a sit and watch experience. It's a social experience, a social gathering experience. There's one ballpark design in the works that will only have 24,000 seats in it, and the rest will be social space.'",
        "'speaker_3': 'And that will have a significant impact on revenue and the ability to operate a team and to operate the stadium. So it's a paramount concern in in Major League Baseball that we're keeping our eye on and will sure to impact us in the coming years.'",
        "'speaker_2': 'Again, as I pointed out earlier, Mr. Rivera, Guzman, Gossett and I were involved.'",
        "'speaker_3': 'With.'",
        "'speaker_2': 'Baseball brinkmanship when we were going to lose the.'",
        "'speaker_3': 'Team and we were had threats. And I personally was raising questions about the ability of the organization to meet the construction and the financial plan. And I was criticized very strongly by the then chairman of the Seattle Mariners.'",
        "'speaker_3': 'So I hope I have some credibility in raising the questions today to make sure, because I was ostracized and criticized and front page of the Seattle Times or raising questions along with my colleague, Councilmember Larry Phillips, Councilmember Cynthia Sullivan, and then Councilmember Ron Sims.'",
        "'speaker_2': 'And the four of us were.'",
        "'speaker_3': 'Lambasted because we dared raise questions. But we have to raise these questions because this process is so critical. The people behind you have a particular issue. We have to look at the broader issues. I think, again, that you have a venue that is family friendly.'",
        "'speaker_3': 'It is the last place where people can take their families and don't get hit by.'",
        "'speaker_2': 'Too many of our sports today are suits. Only people can afford to do it.'",
        "'speaker_3': 'They can write off the expenses. So I want to thank the Seattle.'",
        "'speaker_2': 'Mariners publicly.'",
        "'speaker_3': 'For providing that resource for so many families around the sound.'",
        "'speaker_2': 'We're going to go through a question period. I hope you can work with us, because I know there.'",
        "'speaker_3': 'Will be some hard questions for my colleagues, but in the end, I think the solution will be a a conversation that I think will bring about a resolution of some of the issues that we raised here today and we raised by some of the audience who I hope we can start hearing from.'",
        "'speaker_3': 'And I want to thank you and I thank the chair. I got to leave this anecdote because my my colleague, Larry, and I will understand, there's a previous county executive negotiated with the then president of the Seattle Mariners.'",
        "'speaker_3': 'His name is Tim. And Tim raised, you know, finished his his negotiations. And then he said, oh, by the way, then the council is going to to be involved. And the then president of the Mariners said, council, what's the council you're finding out about the council today?'",
        "'speaker_3': 'The council is is a process. And in our process of county government, we hope to be a deliberative process, one that's.'",
        "'speaker_2': 'Going to look at the long term.'",
        "'speaker_3': 'Not the short term. Thank you very much, Mr. Chair.'",
        "'speaker_0': 'Thank you. And for one clarifying follow up, Councilmember Up the Grove, then we'll get the public come out, Councilman, for a.'",
        "'speaker_2': 'Well, no, thank you. I the I've heard this this fear that as people attend games less and watch TV more, it can have an impact. But didn't you don't you own the TV station that airs? The airs, the Mariners.'",
        "'speaker_3': 'We have an interest in those articles. I'm sure.'",
        "'speaker_2': 'You.'",
        "'speaker_3': 'Read mention how that's that's a dying business again folks folks are not watching and those in those ways and so the deliverable people are watching through what's called over-the-top methods of television. Exactly. And so that that is a that is a dying that is a dying business.'",
        "'speaker_3': 'And I would be happy to share with you a number of articles that mention that.'",
        "'speaker_0': 'Thank you. And Councilmember Cole to bring us home.'",
        "'speaker_1': 'Thank you, Mr. Chairman. Speaking of homes, so let's see the signs around here, homes over home runs. I don't think anybody would deny that that is critical, that people have homes. And it's you know, we're in an enormous situation here in Seattle, King County, the state all over the country with regard to this.'",
        "'speaker_1': 'And rather than arguing over why that's the cause, we have to have more homes built and have homes affordable, which is what Claudia Bowdich, his task force that's working on. But for me, it doesn't have to be an either or a mutually exclusive situation.'",
        "'speaker_1': 'If we can have a sports team here, a safe field that is well maintained so we don't have roof tiles falling off as we did with the kingdom, but also have the revenue that's needed for building homes that are affordable.'",
        "'speaker_1': 'And I think we can find the right balance. And so at some point, I would really like to see some more numbers about what the revenue limit and what the revenue level is that we gain by having the Mariners play at this publicly owned facility that go.'",
        "'speaker_0': 'Into.'",
        "'speaker_1': 'Housing, human services and so forth, because I know that that is taking place. It's just where is the right balance? Maybe we have a lesser amount than is in this proposed ordinance, but we have to find that balance.'",
        "'speaker_1': 'So I don't know if you have any comment on that.'",
        "'speaker_3': 'I agree with you 100% on on the on those topics. I think we did try with the four years we negotiated the term sheet to come to the correct balance of of cost sharing of of those items. And I'm happy to try to provide, along with with staff, additional information beyond those I referenced in terms of economic'",
        "'speaker_3': 'generation so we can get that information to you.'",
        "'speaker_1': 'Thank you. And I should have said proposed motion not or in the thinking that.'",
        "'speaker_0': 'No, thank you very much. Thank you for being here, Fred. And thank you to our central staff for your work on this. You've now heard some of the questions, concerns from members and got some time before this next comes before the committee to work on that.'",
        "'speaker_0': 'I think I said in my opening remarks about opportunities for public comment that the general public comment is heard the third Monday of every county council meeting. And I made a mistake. It's the fourth Monday, so August 27th at 1:30 p.m..'",
        "'speaker_0': 'The full King County Council takes public comment on any topic, and you're welcome there. This again will be in committee on Wednesday, the 29th at 9:30 a.m. Here is an opportunity to provide public comment, and then it'll either be in committee for one more hearing for comment or up to the full council.'",
        "'speaker_0': 'And whenever it's heard it full council, there's public comment opportunities. So I want to clarify those prior remarks. We will now open the public comment item on this agenda. I do have a number of folks lined up. We are going to set the clock on either podium at a minute, 30, you'll have a 32nd warning with the'"
    ]
}