{
    "A MOTION making an appointment to fill a judicial vacancy in the west division, west electoral district, judge position number three of the King County district court.": [
        "'speaker_0': 'Indeed. Thank you. The next item on our agenda today is making an appointment to fill a judicial vacancy in the King County District Court. Members will have received the application materials most recently this morning. I believe the email was sent at 933 this morning.'",
        "'speaker_0': 'So I will call your attention to that. And a few minutes before about the questions that I referenced before we got rolling this morning. So you might have both of those materials open. The council advertised the judicial vacancy and accepted applications until October 4th, 2021.'",
        "'speaker_0': 'We received applications from five eligible candidates during the application period, and since there were five eligible applicants, a subcommittee process was used to narrow the final list to be interviewed by the entire committee, the whole councilmember council members.'",
        "'speaker_0': 'Caldwell's, Zala and I held interviews for all five candidates. I'm a member of 15 and 19 to narrow the field to the two candidates we have invited to join us today. At this point, I would ask Councilmember Caldwell's perhaps for a motion this to select Rebecca Robertson and Jennifer Cruz as the finalists to be interviewed by the'",
        "'speaker_0': 'committee consistent with inclusion code two 1720.'",
        "'speaker_1': 'Thank you, Mr. Chair. And some.'",
        "'speaker_0': 'Thank you. Motion is performed in Nova Scotia, and all those in favor please signify by saying I oppose name. The ayes have it. Thank you. Before we proceed further, I'd like to provide members and attendees with an overview of how this process will work.'",
        "'speaker_0': 'Members have received the application materials by email. Most recently, as I said this morning, these materials were central to your email. At 933, it would begin today's proceedings with a brief staff report on the proposed motion from Erica Hanuman of council staff.'",
        "'speaker_0': 'And after the staff report, the committee will interview each candidate one at a time during the candidate. I'm sorry. During the interview, the candidate not being interviewed will be placed in a zoom waiting room as do not get an advance on the interview questions or the other candidates responses.'",
        "'speaker_0': 'Once each candidate has been interviewed, there's interest among the council. The people go into executive session to evaluate the qualifications of candidates for appointment, and then we will rejoin this Zoom meeting and take up any action in the legislation if there are questions.'",
        "'speaker_0': 'Are there any questions on how this process will work, either for members or from the candidates? Before we get started. See none. I'll introduce Eric Newman of Council Central Staff, who is supporting us through this process with women.'",
        "'speaker_0': 'The line is known as.'",
        "'speaker_1': 'Thank you, Mr. Chair. Eric Newman Council Central Staff The items for proposed motion 2020 10434 begin on page eight of your packet. The applicant packet includes the judicial ratings, which start on page 14 of your packet. Are you aware the District Court of the Council for the Limited Jurisdiction and has responsibility for processing small claims and misdemeanor'",
        "'speaker_1': 'criminal offenses? The court handles a $250,000 annually throughout the four divisions, which are the north, south, east and west divisions. The proposed motion is to Opposition three and the West Electoral District, which was made vacant by the retirement of Judge Arthur Chapman.'",
        "'speaker_1': 'Under state law, the County Council has a legislative authority to fill district court vacancies. As you mentioned, there are two eligible applicants to be interview that weren't yeah that will be interviewed today and the selected candidate will fill the remainder of Judge Chapman's term ends in January of 2023.'",
        "'speaker_1': 'In its current form, proposed motion 2020 10434 has a blank for the name of the person being appointed as able in a will be needed to insert the name of the selected appointee. Mr. Chair, that concludes my remarks.'",
        "'speaker_0': 'Thank you. Are there any questions for Ms.. Newman? All right. I interviewed to say roughly 20 minutes and I'll ask the candidates to provide opening and closing remarks, each to be limited to 2 minutes. So we will time and you'll hear a timer.'",
        "'speaker_0': '2 minutes for the opening and closings and we don't have a timer running. But ask the candidates to be mindful of time and perhaps aim for the responses to the other questions not to exceed 2 minutes. Members have received this morning a set of prepared suggested interview questions.'",
        "'speaker_0': 'In accordance with best and worst practice, I'll ask members to volunteer to read the interview, the prepared interview questions and will use the same questions for each candidate. Candidates will be encouraged. I'm sorry, I'm afraid I. But now I'm reading from my script.'",
        "'speaker_0': 'So we would ask you to attempt to keep your responses to the untimed questions, also to 2 minutes. And before the meeting we randomly assigned the order of interviews. And we'll begin with Jennifer Cruz, followed by Rebecca Robertson.'",
        "'speaker_0': 'I mean, that's the only questions are now asked the club to place Mrs. Robertson in the zoom waiting room is reminding reminded to members and staff, please let the current staff admit people from the waiting room and avoid the very hard temptation to click the admin button when it appears on your zoom screen.'",
        "'speaker_0': 'Madam Court, can you confirm when Ms.. Roberts is in the zoom waiting room?'",
        "'speaker_1': 'Yes, Mr. Chair, she has.'",
        "'speaker_0': 'Thank you. Is crude from my screen. And I want to welcome you to the committee as a whole and again, to thank you for your interest in serving on the King County District Court, the time you've taken the interview and the materials and look forward to this conversation with us today.'",
        "'speaker_0': 'I will begin by asking you to share a two minute opening statement, opening comments with us.'",
        "'speaker_4': 'Good morning. Thank you so much. It's a pleasure to be before all of you again. And I'm very happy to be here. Again, my name is Jennifer Cruz and I am applying for the open position of District Court Judge in the West Division.'",
        "'speaker_4': 'I have been a pro tem for King County District Court now for over six years, and I have worked in every division of King County District Court and handled every type of hearing that there is within the jurisdiction of District Court.'",
        "'speaker_4': 'So I'm very familiar and can step into district court. Additionally, I have also pro tem and continue to pro tem in other jurisdictions such as the city of Kent, the city of Tukwila, the city of Normandy Park, as well as the city of Des Moines and Federal Way and Kirkland.'",
        "'speaker_4': 'In addition to this. One of the things I wanted to let you know is that I am a lifelong member of King County. I was born and raised in Rainier Valley, and I am the daughter of immigrant parents.'",
        "'speaker_4': 'My father came here in 1929 when he was only 18 years old, and he only had a third grade education. He worked as a migrant worker and he followed the crops and continued to do that as long as he could.'",
        "'speaker_4': 'And then he eventually served in the military after World War Two. I grew up in Rainier Valley attending school, and I came from a very small family. I was the first person to graduate from college, as well as the first person to graduate from law school.'",
        "'speaker_4': 'My family instilled in me the value of hard work, the value of education and the value of service to community. And I have continued on with that in terms of my trajectory for my career. When I was in college to help pay for college, I did work.'",
        "'speaker_4': 'I worked as a work study for the King County Prosecuting Attorney's Office as a victim advocate. Later on, I was a well known intern for the city attorney's office. And then I began my career as a lawyer, as a public defender, working for several different agencies.'",
        "'speaker_4': 'Before I opened up my own office and I have now contracted for over 20 years with the King County Department of Public Defense. And I have represented indigent clients. So from that broad base of experience and knowledge and my community, my community involvement.'",
        "'speaker_4': 'I'm hoping that you will consider me as a candidate for the West Division. Thank you.'",
        "'speaker_0': 'Thank you. And I'll lead off with the first question and perhaps councilmember roles will be ready with the second question. First question would be what? What about district courts interests you the most?'",
        "'speaker_4': 'Thank you. Yes. What about district court? That interests me the most is it is very much a people's court. It is the first line and sometimes the only line of court interaction that the general public has with the court system because of the fact that we see so many different people and we handle cases where it would'",
        "'speaker_4': 'not be something like a felony, it would be more something like a traffic ticket. And I think that it's important that the general community, especially the community that we serve, have a good experience with the court system, since it is the only system a lot of people experience.'",
        "'speaker_4': 'And in terms of that, I think that it's important for people to see the diversity of our community represented in individuals who work in the court system. And I don't think that we have enough of that. And I think that it is important to have people who are capable, who have knowledge and who have the background and'",
        "'speaker_4': 'a passion to want to help the community and help them understand the different things as they navigate a lot of times, particularly in small claims courts. They are individuals are not represented by attorneys. And so they are coming to the court not knowing what to expect.'",
        "'speaker_4': 'And I think that it's very important for the judge and the court community to set that tone so that they feel that they're being heard as individuals in the community and are being processed in terms of a fair and fully being heard.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Miles.'",
        "'speaker_1': 'Thank you, Mr. Chair. And good morning, Ms.. Cruz. Good morning. Congratulations on making it to this round and so much. I have a question for you, which is how do you approach judicial matters with which you are unfamiliar?'",
        "'speaker_1': 'And when that happens, what resources do you seek out to help?'",
        "'speaker_4': 'Thank you, Councilmember Colwell. When I'm unfamiliar with a particular issue, the first thing I do is I turn to the law. And so I look to see what is the issue? What is the law? And I call that out.'",
        "'speaker_4': 'And then I look at that. I look at the cases that relate to that. And then I also take a look and see what what is coming before me. Is it emotion? And if it is emotion? Have both sides filed briefs?'",
        "'speaker_4': 'And if they have, then I turn to those and I look and see what the arguments are in each of the briefs. I carefully read both of them and I pick out what the cases are that they're relying on in terms of the law.'",
        "'speaker_4': 'And if there's any new law that I am not familiar with, I will go and seek out those cases. Then what I do is I will also listen to the arguments of the parties. Obviously, each side has a different take on what the law is, and I take a look at that, and then I apply that to'",
        "'speaker_4': 'the law and apply it to the facts of the case, because each case is very different that there's no two cases that are the same. The law, however, is normally the same. It it does change. And so I want to be aware of what the basis of the law is, the policy of the law.'",
        "'speaker_4': 'If I have other questions. I also will turn to other judicial colleagues who have been familiar with the issue and see how they feel about it. Although I would use my own independent judgment, I did. I would also look to see as to how they've ruled in the past if this is something that is a district wide'",
        "'speaker_4': 'policy in terms of how we rule or if it's something where I can use my own independent judgment and look at the law and the arguments of the parties. And so I will take all of those things into consideration.'",
        "'speaker_4': 'And then I can also do my own independent research. I'm familiar with using Westlaw and all the other resources that we have. We have a lot of great resources, but I would also rely on my other judicial colleagues for advice.'",
        "'speaker_4': 'But ultimately it would be up to me and looking at the law itself. Thank you.'",
        "'speaker_0': 'Thank you, colleagues. Volunteer now. Question number three.'",
        "'speaker_3': 'I got your job.'",
        "'speaker_0': 'Thank you. Goodbye.'",
        "'speaker_3': 'What is one change you think the district court can take to further the goals of equity and social justice in the legal system?'",
        "'speaker_4': 'One change that I think that can be made is and I think that it is already being made in in some form is due to COVID, is that we are trying to make the district court more accessible to individuals.'",
        "'speaker_4': 'And by that, I mean there's a lot of Zoom hearings. The law has changed in terms of when individuals have to appear. And in terms of if they can let their attorneys appear on their behalf. And I think that that really helps because a lot of individuals who are coming before district court do have challenges in terms'",
        "'speaker_4': 'of economically and financially and just getting there in terms of being in court. I think that having Zoom helped that where people do not have to take time off work, when they don't have the time to take off work, they don't have to get child care.'",
        "'speaker_4': 'If they are able to access Zoom, that's great because then they can log on or they can let their attorney appear on their behalf. More cases where they're not doing anything major, where they're just continuing the hearing and and getting a new date.'",
        "'speaker_4': 'I think that that that is helpful. I think that we do need to be more mindful because even though we do have zoom of the fact that there are some challenges, obviously there's individuals who do not have access to to getting Internet.'",
        "'speaker_4': 'And that is something that we need to take a look at. Where do we have access to justice for all individuals, as well as the fact that it is difficult on Zoom with individuals who English is not their first language, it is very difficult to have an interpreter interpret when they're on Zoom as opposed to as in'",
        "'speaker_4': 'person. But I think that because of this change, although COVID has very much affected everyone and and it it has been something that has been a challenge. I think some good things are coming out of it because district court really is taking a look at how do we really access and help individuals access the court system.'",
        "'speaker_4': 'And are there other different ways where we can make it easier for people to appear before the court without them having to have the challenge of finding travel, taking off work and doing all of those things? So I think that that is one way where we can continue to do that and continue to look at it.'",
        "'speaker_4': 'And it sounds like just in terms of listening to Mr. Digi, that this hybrid model is something that is going to happen with not just the courts, but all all over in terms of King County. I think that that may be very, very important to remain in terms of access of justice and helping people to access the'",
        "'speaker_4': 'courts. Thank you.'",
        "'speaker_0': 'Thank you. COLLINS But unfortunately, we now have a volunteer for question number five, and I'm looking for one, four, four and six. So, Councilmember Banducci, last question. Number four.'",
        "'speaker_1': 'Thank you, Mr. Chair. Good morning and welcome today. Have you encountered a challenging ethical dilemma in your experience? And if so, can you describe what it was and how you approach to resolve the situation?'",
        "'speaker_4': 'Yes, thank you. I was thinking back in terms of an ethical dilemma, and this is when real recently, maybe in the last year or so, I was protesting on the bench in district court and I had an individual who needed an interpreter and this was all via Zoom.'",
        "'speaker_4': 'So this kind of Segways into my last answer, but we were all via Zoom and the individual interpreter was via Zoom. The person who needed the interpreter actually had appeared in court with a family member and the other parties appeared via Zoom.'",
        "'speaker_4': 'So there's a hybrid of everything going on. And one of the things that happened is, as the case was proceeding as we were, the interpreter was interpreting. And I noticed that there was a lot of commotion from the individual who was in court and their family member, and there was a lot of talk back and forth.'",
        "'speaker_4': 'And so I stopped the proceedings and I said, What's what's going on? You're not paying attention to what's going on, is there? Is there an issue? And what came out of it is the family member said, yes, there's a problem.'",
        "'speaker_4': 'The interpreter is not interpreting word for word. They're not interpreting correctly. And so then I asked the individual who was there for their particular hearing, not the family member. I said, Are you understanding? And I couldn't really get a sense from them whether they were either afraid to answer that because of the fact that they had the'",
        "'speaker_4': 'interpreter there and they didn't want to be disrespectful to the interpreter or if they really, genuinely did not understand what was going on. And so then I had this the family member kind of telling me what was going on, but obviously they're not a party to the whole proceeding.'",
        "'speaker_4': 'And so that was of concern. The other piece that was of concern to me was the fact that there's this interpreter and she's interpreting honestly and there's an issue with not understanding. And so I had to also speak with her and say, you know, there's that there's an issue.'",
        "'speaker_4': 'Can we discuss this a little bit further? And it became very, very sticky in terms of everything. And what I eventually did was I did take a recess so that I can continue to consult with presiding. I wanted to find out more because I had not seen this interpreter in my court before in any of my other'",
        "'speaker_4': 'proceedings. It turned out that this interpreter actually was not someone who we wanted to have come interpret because they had had that problem before and not interpreting one for work. And so in terms of that, I would not have known that had I not after presiding because as a pro tem, you just kind of get put in'",
        "'speaker_4': 'situations. But it was an ethical dilemma in terms of how do we make sure that this individual who's here is on one side of a case, is actually understanding the proceedings and is being told what actually is going on?'",
        "'speaker_4': 'And so I was able to handle it. What we did end up doing was we did it. We were able to not have that interpreter. We were able to bring in another interpreter, actually recess for a while, and we were able to proceed forward with the proceeding.'",
        "'speaker_4': 'The individual who needed the interpreter did feel a lot better about the second interpretation and was able to present their case in a timely manner. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. So the volume of cases at the district court level is significant for the judge. How do you approach managing multiple high priority.'",
        "'speaker_4': 'Matters in front of you at the same time? Thank you. That's that's a great question. And and I am. As a program, I have been in quite a few courts where there is a high volume caseload. I think in terms of priority, you have to take a look at who you have before you.'",
        "'speaker_4': 'Obviously, there are people on Zoom. There are people in the courtroom. And then you have to take a look at who else is there. Is are the public defenders ready? Are the private attorneys ready? And do we have interpreters who are waiting because everything is based on time?'",
        "'speaker_4': 'Obviously, we don't want an interpreter waiting around for two or 3 hours. So those matters take priority and we want to get those done so that individuals will have a chance to talk with their attorney, with the interpreter.'",
        "'speaker_4': 'And so I think that it's really about trying to manage and make sure that you match up the parties and you see where you're going in terms of things. And take a look at if you know ahead of time what the issues may be.'",
        "'speaker_4': 'And that's what I always try to do is look at the calendar. I am told ahead of time that I'm going to be in a court. I try to prepare and read through the dockets and read through the cases so that I have an idea of what may be coming and can anticipate.'",
        "'speaker_4': 'Oh, this case may take a little bit longer. This case is going to be a continuance. And so I know we can take this first and try to manage so that we don't have a courtroom full of people waiting for hours and hours, but rather we're able to move smoothly, even though it's not normally at a pace'",
        "'speaker_4': 'that sometimes people want. I mean, people want to come in and out very quickly. And while I would like to do that, when you have 20 or 30 people on the calendar, that's just not possible. But to acknowledge that people are waiting to acknowledge and say, yes, I know that you're here.'",
        "'speaker_4': 'Just give us a chance. We'll get to you. And I think that that's the important piece of it, is to make sure that people know I know you're here. I know you're waiting. I know you have a case and we will take it.'",
        "'speaker_4': 'I'm sorry that it's taking so long, but I think that even that piece of acknowledgment makes people feel better and makes people feel heard and that they're not just a number, but that somebody knows their case is coming up.'",
        "'speaker_4': 'And so it is quite a balance. And I think that I, from my program experience have been able to meet that balance and that I can continue to do so if I am selected as the U.S. district judge.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. I'm customer service.'",
        "'speaker_1': 'Mr. Chair, for lack of other persons, I'd be happy.'",
        "'speaker_4': 'To do that.'",
        "'speaker_1': 'What do you see as the most significant challenge facing the district court and how do you think it should be addressed?'",
        "'speaker_4': 'Well, the most significant problem currently is obviously our backlog of cases due to the COVID 19 pandemic. And I think that we are taking steps to address it in terms of trying to add additional individuals, programs and commissioners who can take on cases and get through the backlog.'",
        "'speaker_4': 'I think adding additional calendars, adding night court or weekend court are ways that we can do that, because obviously there are a significant amount of cases, particularly small claims cases where individuals have been waiting a long time to have their day in court.'",
        "'speaker_4': 'And it is difficult to make sure that they do get their day in court. That is what the whole process about being in district court is. It's a people's court where people come and they bring their problems that are considered not felonies that are minor, but to individuals.'",
        "'speaker_4': 'They are major, their major things that have happened to them. And we need to be mindful of that. And I think that that's the hard part where a lot of people are feeling due to the shutdown of from COVID 19, that they were forgotten about, that their their individual case was not heard.'",
        "'speaker_4': 'And I think that we need to work to try to get back up to speed with how we are processing the processing the cases and making sure that each individual person we touch base with them and say, hey, I know it's been X number of months and we have not heard your case yet.'",
        "'speaker_4': 'Here we are now. We're trying to process this. And I think that it is going to have a lot to do with coordination with all of the the different divisions in district court to get there. But I think that it is possible.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. And unless there are follow up questions from colleagues. And I paused for a moment. I would invite you to share your closing remarks with us.'",
        "'speaker_4': 'Thank you so much. Again, Council members, I wanted to thank you for your attention and for having me here again. I'm pleased to be here. As I had stated, I do have the experience, the knowledge and also the temperament to handle the court and to handle the deposition as West District Court judge.'",
        "'speaker_4': 'I have been a committed member of King County. I have grown up here. I continue to give back to the community. I work very closely. I am on the board of the Filipino Community Center of Seattle, which is very important to me, where I help with both of the programs that I am the chair of, which is'",
        "'speaker_4': 'the Programs Committee Chair for the Senior and Senior Housing, as well as the Youth Development Committee. And those are very important to me because I think that it is important to give back to the community. I also think that as a judge, it is important to be visible and to be seen.'",
        "'speaker_4': 'In terms of my experience as a judge, I have been a pro tem for over six years and I have over 20 years of experience as an attorney. I take that experience with me having been able to work with individuals who are marginalized, who are people of color, and also who do have issues such as mental health'",
        "'speaker_4': 'issues, alcohol, drug issues. And I think that that experience and sets me apart from other individuals where growing up in a household as an immigrant daughter and in a community where we didn't take vacations, we had to work for everything we had.'",
        "'speaker_4': 'I think that that helps me make a connection to the people that I would serve in district court who are individuals just coming before the court for things that are simple matters, which we would deem a simple matters.'",
        "'speaker_4': 'However, those are very important matters to them. And I see those individuals as extensions of myself because I can see myself and my family in them and I want to help the community as well as help King County as a whole by serving as a district court judge.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you very much, Ms.. Cruz, for sharing more of your experience and passion for serving on the bench with us this morning. And again for your interest in serving on the district court. We very much appreciate this opportunity to talk with you and learn more about you.'",
        "'speaker_4': 'Thank you. Thank you so much. I appreciate it as well. Thank you to everyone.'",
        "'speaker_0': 'And Madam Kirk, if you might excuse Ms.. Cruz to the waiting room and invite Ms.. Robertson back.'",
        "'speaker_1': 'We will have to ring shortly, Mr. Chairman. Thank you.'",
        "'speaker_0': 'I would remind everyone that in zero two please do not use the admit. But we are excusing this cruise to the waiting room intentionally as we had Ms.. Robertson and so to please only have the clerk's office be using the admin button.'",
        "'speaker_0': 'And with that quirk, I believe we have Ms.. Cruz has moved to the waiting room is Miss Robertson and with us?'",
        "'speaker_1': 'That's correct, Mr. Chair. We are ready.'",
        "'speaker_0': 'Was Robinson, welcome.'",
        "'speaker_4': 'Thank you so much. I should let you know, I was accidentally admitted for about 15 seconds.'",
        "'speaker_0': 'I understood that. That's why I was reminding people not to do that.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'No concerns. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'There. And now Jim has you someplace I can see you. Welcome.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_0': 'I want to thank you again for joining us for this interview and for the work you've done to express your interest in the fight for the position in King County District Court and for the work you do in serving the people of King County already in your career.'",
        "'speaker_0': 'We have, as I think you know, about six questions, an opportunity for you to share opening and closing remarks. But this we look forward to this conversation. With that, I would invite you to share your opening comments with us.'",
        "'speaker_4': 'Good morning and thank you so much for giving me the opportunity to speak with you again about my qualifications for the District Court bench. I've been a judge and Federal Way Municipal Court for 12 years. I believe I have two unique qualifications that are critical to the district court right now.'",
        "'speaker_4': 'A dozen years of daily judicial experience and a proven track record of inclusive leadership. The judicial system is transforming itself to meet the changing needs of the people it serves, addressing every day the overlapping challenges of mental illness, substance abuse, homelessness and systemic racism.'",
        "'speaker_4': 'We are reevaluating and reimagining every day. There are many moving parts and stakeholders in the justice system. I have had years of experience building coalitions in my own court and statewide to create real results. And I will continue to do this at King County as president of the District and Municipal Court Judges Association.'",
        "'speaker_4': 'I have worked with judges and other stakeholders who eagerly embrace innovations as well as those who don't. I have experience collaborating with all of them to create meaningful solutions. The courts must take progressive actions to help people get the services and treatment need must is.'",
        "'speaker_0': 'Well.'",
        "'speaker_4': 'It's based approaches to increased public safety. Yes.'",
        "'speaker_0': 'Vibrates in your headphones for just a moment there. I apologize.'",
        "'speaker_4': 'Okay. I'll go ahead and start. Start again. Throughout my career, I have addressed the burden of legal financial obligations, encouraged the creation of therapeutic courts, helped create caseload limits for public defenders, adopted new technology, created pretrial release and jail alternatives, and advocated for judicial independence and court security.'",
        "'speaker_4': 'In 2018, I spearheaded the creation of a community court in federal way with no funding to address issues that cause people to commit crimes. We provided people with mentors, intensive support and quickly quick linkages to treatment and housing.'",
        "'speaker_4': 'The courts must be able to provide immediate resources to people to empower them to address their issues. What I have learned from the successes of Community Court can be and has been applied to all other aspects of the justice system.'",
        "'speaker_4': 'I have the experience and the leadership skills to help King County to continue to move in this direction. And I would be happy to answer your questions.'",
        "'speaker_0': 'Thank you so much. Our first question would be, what about district court? It was you the most?'",
        "'speaker_4': 'I am from King County. I live in Seattle. I am very passionate about the justice system and I'm very passionate about my community. And I would love to be able to serve my community in a greater way through King County District Court.'",
        "'speaker_4': 'I know that King County is on the cutting edge of innovations for how we address legal problems that people face in the community, either criminal charges and their struggles with what causes those criminal charges to happen, or their small legal civil needs, which the King County District Court can also address.'",
        "'speaker_4': 'We have a real ability to help people redress their problems when they have been wronged and to interrupt their cycle and downward spiral into criminal behavior by intervening with assistance, with help, with accountability for them. I know that King County has been working towards progression on how to progressive, meaningful ways to address these issues.'",
        "'speaker_4': 'And I would love to be a part of that community. I also think I can bring my 12 years of experience in federal way and statewide to bring new and fresh ideas to King County and how to innovate, how to be more highly efficient, and how things maybe a little bit differently than they have not thought of'",
        "'speaker_4': 'before. And I can bring my experience in doing those things to King County.'",
        "'speaker_0': 'Thank you so much, Councilmember Cole Wells. No, I knew.'",
        "'speaker_1': 'Thank you, Mr. Chair. And good morning, Judge Roberts, and congratulations on making it to this round.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_1': 'I have a question for you, which is how do you approach judicial matters with which you are unfamiliar? And when that happens, what resources to seek out?'",
        "'speaker_4': 'I'm so sorry, but you cut out a little bit, so I didn't quite hear the question.'",
        "'speaker_1': 'Okay. How do you approach judicial matters with which you are unfamiliar? And when that happens, what resources do you seek out?'",
        "'speaker_4': 'So I approach it as my opportunity to learn and to grow in my legal knowledge in my career. First, I would identify what issues it is that I'm going to have to be learning about. I would seek out assistance and mentorship from other judges who have lots of experience dealing with those issues to assist me in framing'",
        "'speaker_4': 'them. I would go to the numerous bench books that are available on a variety of different issues to assist me with that. And I would also let the attorneys teach me about the law. Often the attorneys are there to educate the judges on the various areas of the law, which with which they might not be familiar.'",
        "'speaker_4': 'We can often ask attorneys to brief to certain issues so that they can frame it in the way that they would like the judge to decide it. And I find that incredibly valuable, an incredibly valuable way to.'",
        "'speaker_1': 'Learn the.'",
        "'speaker_4': 'Law is constantly changing, both in the criminal and the civil world. So we always have to be adaptable and be willing to learn and to be willing to understand that we are constantly in a state of learning and to really keep up with the changes in the law.'",
        "'speaker_4': 'We do that through reading new case law, being familiar with the new court rules, etc. So I have constantly tried to look at this as a learning opportunity for me. Thank you.'",
        "'speaker_0': 'Thank you, members online.'",
        "'speaker_3': 'Thank you. What is one change you think the district court can take to further the goals of equity and social justice in the legal system?'",
        "'speaker_4': 'So I think one change that they could utilize were is an audit system that is starting to happen in the District and Municipal Court Judges Association. There is an organization that will come into court as sort of a secret shopper.'",
        "'speaker_4': 'They won't be won't know that they're coming. They'll come in as a court user and they'll analyze the entire court system as far as how easy it is for court users, what their interactions are with even the signage on the door, with the people greeting them at the front door security, with the court staff, with the judge'",
        "'speaker_4': ', with the attorneys, and how they are treated as a person. I think this sort of audit could really inform the courts of things that they need to be doing better. Often we are so caught up in our high volume how things have always been done, our knowledge of the system that we don't realize how difficult it is'",
        "'speaker_4': 'for people to come into court and navigate that system and how difficult it might be for them to understand the languages used to. To understand all the complicated processes that there are to be treated like a number instead of a person.'",
        "'speaker_4': 'And that is a complaint that I take very seriously. People have to be treated like they're a person. Like this might be the most difficult day of their life. And to ease that process for them to make it less complicated, to make it more equitable.'",
        "'speaker_4': 'There may be things we don't see or realize that are causing an equitable or racial racially inequitable. Beside that, we don't understand that we're doing because we are so immersed in our own system. So I think having an audit this organization come to audit King County District Court could really inform the court and all other courts of'",
        "'speaker_4': 'what kind of improvements could be made in all ways and all systems. And that could be fairly easy changes. I volunteer Federal Municipal Court for this audit and I truly hope that the other courts are going to do that as well.'",
        "'speaker_4': 'We've already adopted Zoom so that court is more accessible to people, but I think we need to go much further than that.'",
        "'speaker_0': 'Thank you, Councilmember.'",
        "'speaker_1': 'WC Thank you, Mr. Chair. Welcome. Good to see you again. Thank you so much. Thanks for being here. My question is, have you encountered a challenging ethical dilemma in your experience? And if so, can you describe that for us and how you approach to resolve?'",
        "'speaker_4': 'I have you know, judges are bound by the judicial canons. We have to be very careful. And what we do say and how we advocate, we don't normally get involved in policy issues or realms of the executive or the legislator would have.'",
        "'speaker_4': 'But we also can see how some things that other branches do can affect the criminal justice system and people's rights and lives. In my particular case, we were using a jail in federal way that was giving wholly inadequate medical care and mental health care to defendants.'",
        "'speaker_4': 'We knew that it was a problem. It's not the it's the police department's in the executive's bailiwick to handle what is in the jail. But we could see systemically that this was becoming an issue. I how we got involved is was an ethical quagmire for the courts.'",
        "'speaker_4': 'I called John Straight, who was an ethics professor at the Catholic University, to ask him exactly what and how can I go about doing this? Because it was a systemic issue affecting so many people, not just the people who appeared before me.'",
        "'speaker_4': 'We discussed how I could do that. And so we I contacted the jail itself. I contacted our mayor. I explained to them these are the issues we're facing. I am literally not putting people in jail who should go, because I'm afraid that the jail is going to kill them.'",
        "'speaker_4': 'And that is the situation that we are facing right now. We met with the jail. On numerous occasions to discuss how things could be improved. It took a long time for them to understand and realize that there really was a problem.'",
        "'speaker_4': 'We also met with disability rights Washington, which came in to the jail and forced and made some significant changes. They actually sued the jail. And I'm happy to report that the jail, that particular jail is now one of the best jails to be set if you have mental health or physical issues that need to be dealt with'",
        "'speaker_4': 'because of the changes that were made, because of the advocacy that I provided and that the other judges provided, because of what we saw on a day to day basis. But it was a very difficult we can't tell the executive what to do and or how to do things.'",
        "'speaker_4': 'So it was a very difficult legal quagmire, but I made sure that I got the appropriate advice and I approached it in a way that I knew would be the ethical way under the canons to do so. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Lambert.'",
        "'speaker_1': 'And Mr. Chair, welcome. And my question is, the volume of cases facing the district court judge is significant. How do you approach managing multiple high priority matters in front of you at the same time?'",
        "'speaker_4': 'So I also work in a very high volume court and about a third of our caseload criminal. Criminal caseload is domestic violence. So those are always very high priority. What a judge needs to realize going in is we are the face of justice as we walk in the courtroom.'",
        "'speaker_4': 'Our demeanor, how calm we are, how we handle things, really flows down to how everyone feels about the experience. If it's a very high volume situation, I explain to people, we have a lot of cases here today. Everyone's case is important and I'm going to hear everybody's case and handle all of their issues.'",
        "'speaker_4': 'We need to have some patience. And I really appreciate your patience and thank you for working for us. And once people realize I'm going to be heard and my case is important, they usually feel much better. We handle the cases that are an absolute we must do this today cases first.'",
        "'speaker_4': 'So I work with the attorneys to determine what cases need to be handled today, what things could be maybe set to a different day, and really what narrow it down to what is it that I need to know to make this decision?'",
        "'speaker_4': 'I've interrupted attorneys and said, I need you to answer this question for me so I can handle this case. This is what I need to know. This is what you need to tell me. Sometimes it's difficult. Sometimes we have to go through lunch and you just have to do that to make sure that the people who are'",
        "'speaker_4': 'there before you are being heard, that's the most important thing in their day. It might be another case to everybody else, but to them it's their life. So just understanding that, also understanding how your decisions on a particular case might affect.'",
        "'speaker_4': 'The cases might affect the administration and the back office is very important. Some people might not realize that every single decision we make has a flow through out the court system. And so to kind of understand how the systems work, to make sure that you're not creating bigger problems as you go through.'",
        "'speaker_4': 'But I've had a lot of experience in this in federal way, which is very high volume and triaging cases and getting down to what you really need to know in this case and what you need to do while making sure that a person is heard in every single instance.'",
        "'speaker_4': 'Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Is there another volunteer to ask question number six? Same? None. I would go back to Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. Be happy to do that. What do you see as the most significant challenge facing the district court and how do you think it should be addressed?'",
        "'speaker_4': 'So I know a lot of people talk about COVID. We are addressing COVID. We know what we need to do. And I appreciate the council giving the district court money to keep addressing that. But one of the most enduring challenges that all courts are going to face is how we unravel.'",
        "'speaker_4': 'Systemic racism in the justice system, both real and perceived. So that we can do a better job of treating people equitably. Of addressing racial injustice. So this is going to be an ongoing problem, an ongoing issue for all courts to address and really deciding how far we are willing to go to address this.'",
        "'speaker_4': 'As I talked about, I think the audits are a first step in addressing the racial inequities that we may not even see in our courts on a day to day basis. Continuing to educate judges and on race, the problem of systemic racism and how racism and how we address that.'",
        "'speaker_4': 'Really working with the attorneys and. The prosecutors, the defense attorneys, so that they have that knowledge as well. And to make sure that as we handle cases with unrepresented defendants or unrepresented persons in, say, a small claims court, that we are really viewing all of this and making sure that we understand how they may view the justice'",
        "'speaker_4': 'system and how we can address that and make it better for them, and to acknowledge people's different experiences and craft individual responses to any of their issues for them so that they realize we are looking at you as an individual and a person with all your past experiences, etc..'",
        "'speaker_4': 'Yeah, I think that is one of the more important issues facing the justice system right now, and we are making Herculean efforts on that in the statewide judiciary to address these issues through education, through audit systems, through continuing to make changes in the justice system where we can to make sure that we address these.'",
        "'speaker_4': 'Issues with the end goal that everyone voices a just justice system that works for everybody so that we can really be more effective. What we want to do is make people's lives better. And if they don't feel that, we are acting equitably.'",
        "'speaker_4': 'That's going to be more difficult for us. So it's a it's a long haul for us. And I think it is the most important thing we need to be working on right now. Thank you. Thank you very much.'",
        "'speaker_0': 'Thank you. And he wants to follow up questions from the council members. I would invite you to share your closing comments with us.'",
        "'speaker_4': 'Thank you all again for your questions and the opportunity to speak to you. King County District Court needs someone with both judicial and leadership experience. Someone who can build coalitions among all the justice system stakeholders to continue to move this court forward and continue its mission of practical, sustained and compassionate accountability and helping people overcome their barriers'",
        "'speaker_4': 'to success, both systemically and individually. In my years of experience working one of our county's busiest municipal courts, I have seen many opportunities to respond and adapt to a changing community and continual changes in the requirements of our justice system.'",
        "'speaker_4': 'I know what works and what hasn't. The courts have such an amazing opportunity to interrupt a downward spiral and help people out of it, improving their lives and increasing public safety. Additionally, we have the ability to fashion civil remedies for people who have been taken advantage of or wronged.'",
        "'speaker_4': 'I have learned from the innovations of courts statewide and nationally, and I will use these connections and experiences to provide fresh ideas and leadership in King County. Thank you so much for this opportunity.'",
        "'speaker_0': 'Thank you very much. Cause I'm home with this today in this conversation and your interest in serving on the court. We really appreciate the chance to talk with you today in your interest. With that, Madam Kirk, I can invite you to invite Ms..'",
        "'speaker_0': 'Cruz back to the board meeting. And colleagues. I believe we'd like a moment or three in executive session. And so we will have we will move to executive session. The committee will go into executive session to evaluate the qualifications of a candidate for appointment to elective office, will be in executive session for approximately 10 minutes until about'",
        "'speaker_0': '1125. For me, it will be all this Zoom call for executive session together with only those 20 employees directly necessary for the discussion and the conclusion of executive session. We will return to this Zoom meeting, which will continue without.'",
        "'speaker_0': 'We are in executive session. Thank you. All.'",
        "'speaker_1': 'The chair has asked me to let the listening public know that the executive session will be extended an additional 5 minutes. Right. But.'",
        "'speaker_0': 'Back to order. And we're back from executive session. And colleagues, I would entertain a motion to adopt a motion. 2021 343.'",
        "'speaker_3': 'Mr. Chair, so most.'",
        "'speaker_0': 'First member of our most power is moved. We give a do pass recommendation, the most we adopt most most in 2021 434 Council member Andre Fowler.'",
        "'speaker_2': 'Thank you, Mr. Chair.'",
        "'speaker_3': 'I also move to amend 2020 10434.'",
        "'speaker_0': 'Please proceed.'",
        "'speaker_3': 'I'm moved to amend it by adding the name Rebecca Robertson.'",
        "'speaker_0': 'Thank you. The amendment is before US Council member Van Roy Fowler.'",
        "'speaker_3': 'Chair members of the council. I believe these are two outstanding. And before us today, I think I share this with my colleagues that we are extremely pleased by the commitment. And the experience and the background of and have come before us lately.'",
        "'speaker_3': 'And it's really been, from my perspective, reassuring to see so many qualified candidates come before us who are interested in serving in this capacity. I believe from my personal experience in Federal Way and my experience on the County Council, that Judge Robertson would be a very successful candidate for this position.'",
        "'speaker_3': 'Not to take away from the. Presentation of the other candidate. But is my personal experience with Judge Robertson talking to others in the community and King County at large, that she will bring the right. Elected to this position at this time.'",
        "'speaker_0': 'Thank you. Further further comments on the amendment.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'As a member of the House.'",
        "'speaker_1': 'Thank you, Mr. Chair. I had the pleasure of sitting on the subcommittee and taking part in the interviews to the five applicants, and I was very pleased to have both Mr. Robertson and Mr. Crews be back to our committee, the whole today.'",
        "'speaker_1': 'And I think that both were very strong candidates and I am going to support Mr. Robertson for the position to advance that name to the full council. But I would like to say that I found Ms. Cruz very compelling and very, very involved, engaged in her community, which I thought was very strong.'",
        "'speaker_1': 'And I would encourage Ms.. Crews to see another opening that comes up in the future. But I am very, very strongly supportive of Judge Roberts and.'",
        "'speaker_0': 'The numbers are hollow.'",
        "'speaker_3': 'Thank you, Mr. Chair. I think this is one of the most impressive top two that we'd ever had. It was an incredibly difficult decision because both people were amazing. And I just want to speak quickly to Ms.. Crews.'",
        "'speaker_3': 'You know, I thought your interview, your materials were amazing. And on a personal level, I'm also a first generation college student and grew up in South Seattle. So hearing from you was, on a personal level, just a wonderful experience.'",
        "'speaker_3': 'And I encourage you to apply again, if I'm not mistaken. Judge Roberts, and I think this is your second go around. And you came back. Yeah, you came back and you didn't let the first round put you down.'",
        "'speaker_3': 'And now you're going to hopefully be our next judge here out in federal way. And so I just wanted to take a moment to say that to Mr. Crews. Please, please do come back and and apply again, because you were you were awesome and so was Judge Roberts.'",
        "'speaker_3': 'And I'm very happy to support Judge Roberts today. Thank you.'",
        "'speaker_0': 'Member was local member.'",
        "'speaker_1': 'Thank you. I too think we have two stellar candidates and it's a blessing to have that. And I know the people of the county will be, well, appreciative of the fact that both of them said that we need to treat people in our court system as people, and not just a number or not just a felon or'",
        "'speaker_1': 'a misdemeanor, but a person and really getting to know what their issues are and bringing the resources of the county to help. I really liked how this person said that we need to have a just justice system and that we are the face of justice, which was the words that normally we set and it is on the'",
        "'speaker_1': 'plaque in the courthouse. So I think that's important and I really.'",
        "'speaker_4': 'Appreciate the hearing that.'",
        "'speaker_1': 'I also appreciate the idea that she brings innovation not only from the state and her many contacts there.'",
        "'speaker_4': 'But also nationally.'",
        "'speaker_1': 'The Court of the Future and the national think tank reports are really important assets, and I am very hopeful that in the future we will continue to draw even more heavily on those resources because there's a.'",
        "'speaker_4': 'Lot of exciting things that other places are doing that we could.'",
        "'speaker_1': 'Learn from as well as we can teach them too. So I am very appreciative of the fact we have two great candidates and that there will be more opportunities for other appointments in the future. But I feel really good about where we are today.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. The comments. All those in favor of the amendment to remove. I'd like to add Ms.. Robertson's name to the amendment. Please signify by saying i.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'I. Those opposed nay. The ayes have it. The amendment is adopted. Further discussion on the vote on the motion as amended. Oh.'",
        "'speaker_4': 'I would like to take this opportunity to thank you so much. I am so grateful for this appointment and honored.'",
        "'speaker_0': 'Well, that's out of order and we'll see if we carry a little passage.'",
        "'speaker_4': 'I didn't know quite whether to get it.'",
        "'speaker_1': 'What?'",
        "'speaker_0': 'I'll write. Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Council Member. County Chief I. Council member. Dombroski. I council member. Done.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Councilmember Coles and Councilmember Lambert. Councilmember of the. I. Councilmember one right there.'",
        "'speaker_0': 'I don't.'",
        "'speaker_1': 'Council members. I. Mr. Chair. Oh, Mr. Chair. The vote is 99 zero notes.'",
        "'speaker_0': 'Thank you. By. By your vote. I'm given a do pass recommendation to vote in 2021 134, as amended. Mrs. Robertson, congratulations.'",
        "'speaker_4': 'Thank you so.'",
        "'speaker_0': 'Much. We will expedite this to full council and put it on the consent agenda here on the council's full agenda for next Tuesday. I'm concerned that we wouldn't anticipate conversation or question, but expect it on next Tuesday's agenda.'",
        "'speaker_0': 'I want to congratulate you, thank Ms.. Crews and look forward to continued contributions to our criminal legal system and our civil legal system. Thank you.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_0': 'That advances those two items. Seven On today's Agenda for cultural for cultures, annual report and budget as required by code. The high I'll from council staff will provide an initial briefing and then we'll have a presentation for culture staff.'"
    ],
    "AN ORDINANCE relating to employment; ending the hazard pay requirement for additional compensation for grocery employees working in the unincorporated area of King County; and amending Ordinance 19247, Section 14.": [
        "'speaker_0': 'Thank you. By your vote, we have moved a motion 2021 for 16 the full council without recommendation. And we will expedite that to next Tuesday's full council meeting. That takes us to item eight on our agenda. I want to thank everybody for sticking with us.'",
        "'speaker_0': 'And this is ordinance 2021 to 90, which would end the current requirement for grocery stores in unincorporated King County that meet certain requirements to provide hazard pay to their workers. Very pregnant from council social staff will provide the staff reports is please go ahead.'",
        "'speaker_1': 'Thank you, Mr. Chair.'",
        "'speaker_4': 'For the record, I'm Mary Bergeron from the council staff. And the materials for this item begin on page 72 of your packet. Back in March, the Council enacted our King County enacted Ordinance 19247, which, as you noted, Mr. Chair, required hazard pay for grocery workers in.'",
        "'speaker_1': 'Large.'",
        "'speaker_4': 'Stores in unincorporated King County. That ordinance stated that the hazard pay would expire upon the expiration of the executive's proclamation of emergency or at such time as the Council, deemed it appropriate to take other action in this ordinance before you proposed ordinance 2020 10290 would amend that earlier ordinance to add additional findings to the legislation about the'",
        "'speaker_4': 'vaccination progress that has been made in King County and then add a termination date. And I will note that there is an amendment in your packet on page 80 which would add additional findings about recent vaccination progress, including the ability of children from ages five up to be vaccinated and would incorporate two dates into the legislation January'",
        "'speaker_4': '10th, 2022 or the expiration date for the hazard pay, and then January 10th, 2025, three years later for when recordkeeping requirements for hazard pay would end. That concludes my report. Mr. Chair.'",
        "'speaker_0': 'Other comments? Questions. Okay, colleagues. Seem that to entertain emotion. Councilmember Barghouti.'",
        "'speaker_1': 'Thank you, Mr. Chair. I move approval of proposed ordinance 2020 10290 with a do passed recommendation, and I commend the amendment as well.'",
        "'speaker_0': 'Like Councilmember Banducci amended, we're going to do pass recommendation most in 2021 to 90.'",
        "'speaker_1': 'Councilmember Bellucci Passing of Amendment one.'",
        "'speaker_0': 'Amendment one on page 80 of our meeting package before it starts.'",
        "'speaker_1': 'Member Bellucci Thank you, Mr. Chair. I think our members are keenly aware that we adopted this hazard pay earlier in the pandemic at a time when grocery workers were in the private sector, some of the most critical workers that never, ever got to step away or work from home or do any of the things that that many'",
        "'speaker_1': 'of us could do to protect themselves because they had to supply us with our food. Much has changed since then. As we heard earlier, some of the jurisdictions, there were a handful that adopted this have already sunset or rescinded their hazard pay.'",
        "'speaker_1': 'I understand the city of Seattle, which is, I think the largest other jurisdiction that has this now has got a similar action working its way through their legislative process to sunset primarily on the justification that we vaccinations are in a very different place.'",
        "'speaker_1': 'Mask compliance remains good. We seem to have gotten through the Delta wave, but all, most to all businesses are now open in public. And so the justification for having this special requirement for one one sector doesn't seem appropriate any longer.'",
        "'speaker_1': 'That doesn't mean that there isn't something to be done, but it would probably be a lot broader than what we have now. And finally, we have kept in close touch with the representatives of the CW who were key advocates for this provision on behalf of their members.'",
        "'speaker_1': 'They understand we're taking this up. They have not raised any objections to us doing so, and they've been very helpful, informative and cooperative as we move to sunset this at an appropriate time. So I would urge our support at this time.'",
        "'speaker_1': 'I really am glad we did this. I am glad that that this county council stood up for the folks who are some of the most vulnerable and the most important and often not very well respected for the jobs they do.'",
        "'speaker_1': 'But I do believe it's time and we're ready to move on. Thank you, Mr. Chair.'",
        "'speaker_0': 'We have the Amendment one before us for the discussion.'",
        "'speaker_2': 'Well.'",
        "'speaker_0': 'Dombrowski That's number ten.'",
        "'speaker_2': 'Musky Thanks. Mr.. I think I'm still comfortable with the original legislation that had this Concur as the primary decider with the declaration of the emergency. That was the basis on which I thought it made sense to provide this.'",
        "'speaker_2': 'And so I understand different views may differ on that, but I think that it's why I asked earlier about the status of our local emergency order. And and I think this is these folks are doing essential work on the on the front lines.'",
        "'speaker_2': 'And I think from my view, the policy is is grounded in that, not necessarily from any one particular advocacy group. So I'll be a gentle note today.'",
        "'speaker_0': 'A further discussion was my rapid growth.'",
        "'speaker_2': 'I also wanted to get some clarity about where we are in the process here in terms this is. And Amendment two, or is this comment on final passage?'",
        "'speaker_0': 'This is Amendment one is before us.'",
        "'speaker_2': 'I'll reserve my comments for final passage.'",
        "'speaker_0': 'Thank you and that others in favor of amendment one piece by Bible saying I.'",
        "'speaker_1': 'II and.'",
        "'speaker_0': 'Those are both way under the I's habit. The amendment is adopted. We have a motion 2021 to 90 as amended before us. Further discussion.'",
        "'speaker_2': 'Up the Grove.'",
        "'speaker_0': 'House member up to no.'",
        "'speaker_2': 'Thank you, Mr. Chair. Speaking in favor. I want the first thing I want to say is I'm really proud of us as a council for what we have done to support employees at a time when the rest of the economy was shut down and they were essentially required or needed to perform a function of ensuring that people'",
        "'speaker_2': 'could get food at a time of the lockdown. This was certainly never intended to be permanent, and I think that's evident by the other other jurisdictions that are closing it down. Things have changed significantly. All parts of the economy are open now.'",
        "'speaker_2': 'And I'm very sympathetic to a colleague who spoke previously the results. I'm just I think there's a chance that that declaration of emergency could be extended as long as possible due to probably the state's interest in obtaining federal funds.'",
        "'speaker_2': 'And. WHEREAS, the actual. A threat facing those workers relative to the rest of the economy, I think has been reduced dramatically. So I'm comfortable using a new date specific criteria. Generally speaking, I would like to see wages keep up with inflation.'",
        "'speaker_2': 'And but I don't think it'd be appropriate to use a backdoor tool. If we want to do that, then we ought to take up a minimum wage ordinance that applies to not just groceries, but to other businesses. And we have some challenges with that given our we only have unincorporated areas.'",
        "'speaker_2': 'So I'm I think it's the right thing to do and happy to support it today.'",
        "'speaker_0': 'Amber That's Number Lambert.'",
        "'speaker_1': 'Thank you. I'd like to ask a question and I've been going back and forth on the the amendment we just passed. I understood all but the last word. And I'm trying to figure this out, because how does the vaccination.'",
        "'speaker_4': 'Rate.'",
        "'speaker_1': 'Of five year olds have to do with this? And why is that record keeping going on for three more years separately? Well, I think public health is already doing that. So could you explain to me the effect statement on the attachment to the last page of our of our package?'",
        "'speaker_1': 'Thank you. Council member.'",
        "'speaker_4': 'So the recordkeeping requirement was in the original ordinance, and it's not about vaccination rates, but it's rather for the employers to provide to have records available on hazard pay that was paid. And that requirement in the original ordinance was to extend for three years beyond the termination of the hazard pay.'",
        "'speaker_4': 'And so the dates in the amendment would do that. They'd set the date for the hazard pay to end and then a date three years later when record keeping or the records would no longer be required to be kept.'",
        "'speaker_4': 'In terms of the findings about the vaccination, as Councilmember Balducci, who sponsored this legislation, have noted back in March when the council adopted the legislation originally there were a number of findings in the legislation about the fact that at that point, only high risk and older adults were eligible to be vaccinated, meaning that most of the people'",
        "'speaker_4': 'affected by this ordinance and their families were not able to be vaccinated at that time. Since then, all adults and then ages 12 and up and then ages five and up have been eligible to be vaccinated. And as those facts are material to the health and safety of the workers, those were included in.'",
        "'speaker_1': 'Findings in this new ordinance. So, Mr. Chair, may I follow up on that?'",
        "'speaker_0': 'Oh, yes.'",
        "'speaker_1': 'They do. So who does this? Does public health do this? Or does the grocery workers do this? Who is.'",
        "'speaker_4': 'Doing this? So Councilmember, unlike in the city of Seattle, which has an Office of Labor Standards which enforced their hazard pay requirement, King County does not have an enforcement mechanism. And so the original ordinance that the county enacted in March was based on essentially what is a private right of action.'",
        "'speaker_1': 'Where a grocery worker who.'",
        "'speaker_4': 'Felt that they were entitled to hazard pay because of where they worked and what they did but was not receiving it, had the ability to take action to secure that pay. The recordkeeping is a requirement of the private companies.'",
        "'speaker_4': 'So it's not something that public health would be doing.'",
        "'speaker_1': 'So this is a little troubling. So I realize that it was already three years, you know, but. We're working on it. I mean, we have the opportunity to discuss it. You know, we are actually extending from September 30th, 2024 to January 10th, 2025.'",
        "'speaker_1': 'I'm wondering if if we really need to be doing it for that long as putting in that kind of extra paperwork on a individual business is burdensome. So I just want to throw that out. That wasn't what I heard in the briefing I hadn't heard.'",
        "'speaker_1': 'That was I was reading and I was like, We're aware of this. So anyway, I throw that out for the discussion of the body to see if we want to change that date by oral amendment. Mr. Chair.'",
        "'speaker_0': 'Councilmember Banducci.'",
        "'speaker_1': 'So the general rationale behind requiring some record keeping is that if there is any dispute as to whether a particular employer paid the required the legally required wages during that period of time, that dispute might not ripen for some period of time.'",
        "'speaker_1': 'And that's why we have a statute of limitation and all those sorts of thing. So I don't I think that employers routinely keep and retain records of the wages that they pay the better for lots of good reasons.'",
        "'speaker_1': 'But I am very happy to if we if we move this forward to final two to council, I'm very happy to do a little bit of digging as the sponsor of both the the original ordinance and the sunset to do a little digging and make sure that there's a good rationale and that it's not unduly burdensome.'",
        "'speaker_1': 'Thank you. I appreciate that. I think we should at least know that. So I appreciate that. Thank you.'",
        "'speaker_0': 'Councilmember Baldacci, just to chime into the conversation I'm not afraid of. I've been expecting employers to maintain records. They already have to ensure compliance. Other other discussion. Would you please call them all?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Banducci, I. Councilmember Dombrowski. Oh. Councilmember Dunn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council member Wells. I remember I. Council member of the group I. Councilmember one right there. Something in personal life.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Oh.'",
        "'speaker_1': 'Mr. Chair, the vote is seven. I Council Member DEMBOSKY both new and Council member one my third excused thank you.'",
        "'speaker_0': 'By your vote we have given a deposit recommendation to ordinance 2021 to 90 as amended. We will send that to full council on regular course of business on the regular agenda. And in a moment, Madam, I will ask Mr. Chair, Councilmember Banducci, I'm.'",
        "'speaker_1': 'Sorry to jump in his regular comments, put it on the agenda on December 14th.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'For this. My understanding, staff, is welcome to correct me, if I'm mistaken.'",
        "'speaker_2': 'That is correct, Mr. Chair.'",
        "'speaker_0': 'Thank you, Mr. Tracy. Hey, now, in a moment, I'll ask staff that we've missed any votes. And I know we did, so we. We'll be prepared for that. But even at this late hour, I just want to very quickly acknowledge that this is the last meeting of the committee of the whole for the year.'",
        "'speaker_0': 'We have done some outstanding work due to significant implementation plans, but large pieces of work. The county is undertaking the best targets for kids levy renewal and the health through housing implementation. Funds have come through committee. We've taken up our legislation regarding discharge of fireworks in unincorporated King County, a facial recognition down to charter amendments.'",
        "'speaker_0': 'But we've put it on the ballot and the voters have subsequently approved protections, legislation, hazard pay for grocery workers and no fewer than six appointments to the King County District Court as we have done all this work. I want to thank Marcus Steadman and Jade Tracey, our lead staff for the Committee of the Whole, for their work'",
        "'speaker_0': 'throughout the year. Anything I have done right and been well put forward because I'm very eager and happy to work to make sure that we were on top of things and with that. Are there votes we have missed that we can try to catch?'",
        "'speaker_1': 'Mr. Chair, council member John Boehner was excused for the votes on 2020 10290 and 2020 10416.'",
        "'speaker_0': 'Council Member But right now, are you able to unmute at this time and cast those votes? Not seeing or hearing him unmute. We know that he has the ability to record those votes for our remote operations bills to by email and by the end of the day.'",
        "'speaker_0': 'And with that, I do want to thank everyone for their work in the community throughout the year. Jake and Martha and I wish everyone a great holiday season end of the year. And with that, we are adjourned.'"
    ]
}