{
    "A MOTION acknowledging receipt of a Cedar Hills Tonnage and Capacity Report prepared in accordance with the 2017/2018 Biennial Budget Ordinance, Ordinance 18409, Section 107, Proviso P2.": [
        "'speaker_0': 'All in favor say I any oppose those are approved. Turning to the consent agenda, this would be subject to signature accounts from up there. I would you put that before us.'",
        "'speaker_1': 'Thank you, Mr. Chairman of the consent agenda. I was five and six be approved.'",
        "'speaker_0': 'Thank you, Corporal Kolawole.'",
        "'speaker_2': 'Thank you, Mr. Chair. Councilmember Bell, Duchin. Councilmember Dunn, Councilmember Gossett, Councilmember Kowalski. Councilmember Lambert, Councilmember McDermott, council member of the Grove Councilmember phone right there. Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_2': 'Mr. Chair. The vote is three eyes. No, Nos. Six excuse.'",
        "'speaker_0': 'All right. So these two things that we've given do pass recommendation on those items. Should they be expedited, Erin? No art regular calendar consent for council. We have two substantive items today to take up and that is the confirmation of our decennial charter review commission.'",
        "'speaker_0': 'I see we have a number of nominees here in the audience and we'll do a panel once we get going. Of of you. I think there's five or six. Raise your hands if you're a nominee. I think I recognize.'",
        "'speaker_0': 'Oh, we've got better attendance than that. Outstanding. All right, May, due to panels in your packets, there are responses to committee questionnaire for folks to get an idea to help move that along. And then I hope that we'll be able to take up our harassment and discrimination ordinance by Councilmember Cole.'",
        "'speaker_0': 'Wells So that'll be the second hearing on that item, see if we can't move that today, but so that we have a little bit better attendance, I think folks are coming. I've heard from Councilman one right down who is has a breakfast on these days down federal way and and that he's does regularly and he's running a'",
        "'speaker_0': 'little bit late and may have to dial in and I think we'll get some better attendance here in a couple more minutes. So we will recess for let's try 5 minutes and reconvene at 945. Thank you. All right.'"
    ],
    "A MOTION relating to the King County Charter, confirming the executive's appointment of members of the charter review commission in accordance with Section 800 of the King County Charter.": [
        "'speaker_0': 'We're coming back into session after a short recess. We've got a number of colleagues who have made it to the dais. And we will turn now to proposed motion number 2018 0274. That's item seven on your agendas, which is a motion which would confirm the appointment of members of our Decennial Charter Review Commission pursuant to Section 800'",
        "'speaker_0': 'of the King County Charter. In your packets, colleagues, there is a committee questionnaire and responses to basic questions which should give you a general idea of what each person's interest in this work is. And we have a number of folks here, and I think we're going to have two panels.'",
        "'speaker_0': 'Mac, do you want to do a set up on this for us as our staff? And then.'",
        "'speaker_1': 'A couple of you say.'",
        "'speaker_0': 'Oh, I said it all.'",
        "'speaker_3': 'Oh, all right. Well, as the first.'",
        "'speaker_0': 'Set of five come up, I will note that this is the 50th anniversary of the King County Charter that was first adopted by voters in 1968, taking effect in May of 1969. It's had some remodeling over the years, particularly after the merger with Metro in about 1993, where we added some of our regional committees because the municipality'",
        "'speaker_0': 'of metropolitan Seattle had those municipal powers, metropolitan powers under state code, at least a couple of them were activated. But I would also note that our region is growing at 2.2 million people, 39 cities. It's complex, complicated. And I think from my perspective, we're starting to see some strain on this government's ability to respond adequately to regional'",
        "'speaker_0': 'challenges, particularly, and I think most acutely our regional, affordable housing crisis is is evidence of that. And what I've observed in my short time here is we tend to be we're too often it seems to be governing by one off interlocal agreements, taskforces, special committees.'",
        "'speaker_0': 'And that's not an efficient way, it seems sometimes to be able to address our regional challenges. So I hope that this Charter Review Commission will take a look at our charter and our region as it stands today and will continue to grow in terms of its complexity and needs and make sure that we can, if possible, have'",
        "'speaker_0': 'the right tools in this regional government to address those challenges for our community in the coming decades, or at least maybe for the next ten years. And of course, we also serve as a local government, about 250,000 folks in unincorporated rural, but some parts of urban King County.'",
        "'speaker_0': 'And there may be some work to do there as well. So I would invite up maybe by self-selection the first five folks as they're coming up and also give my colleagues any opportunity that they would wish to share some opening remarks if they would like to do so.'",
        "'speaker_0': 'I don't see that. All right. And I'm going to ask you to all introduce yourselves, maybe just give a short bio and why you're interested in serving. Then we'll see if any members have questions or want to engage in dialog.'",
        "'speaker_0': 'Thank you all for being here. Alejandro, would you like to lead off?'",
        "'speaker_2': 'Of course. My name is Alejo. Yes, I'm executive director for the Municipal League of King County. In addition to having a keen interest in policy analysis and nonpartizan work, I have traditionally also done work with immigrant refugee communities.'",
        "'speaker_1': 'I'm Toby Nix and I currently serve on the Kirkland City Council, previously served in the Washington State Legislature as a representative from the 45th District. And I really am looking forward to this. When I was in student government in high school, I rewrote the Constitution of our student government.'",
        "'speaker_1': 'That was one of the first things I did. And I have always loved digging into the structural issues. And and so I look forward to working with everyone on seeing how we can improve the King County Charter. I am Kevin Williams.'",
        "'speaker_1': 'I'm an attorney and partner with the law firm Ensley Best and also a member of the Washington State Bar Foundation Board. I've served on a number of different community committees and my interest in this is basically efficiency and good government.'",
        "'speaker_1': 'I note that Councilmember Demovsky noted that there was, you know, seems to be some inefficiencies and that might have something to do with that. I think we have over 160 special purpose districts in this county alone, and then you add that on to the various cities and then the legal hoops that everybody has to go through.'",
        "'speaker_1': 'Each time we approve a911 ballot, we do flood control, anything like that. These are regional issues that need to be more simplified and directed towards individuals and the people. Thank you.'",
        "'speaker_2': 'I'm Louise Miller.'",
        "'speaker_0': 'Not familiar.'",
        "'speaker_3': 'Former. Are you off the council? Councilor, see that shop here all the time?'",
        "'speaker_2': 'Exactly. About six months after I retired in 2001, I was on, you know, I was chairing the regional water quality, etc., etc.. And I've been doing things like that ever since, two different projects in the last few months.'",
        "'speaker_2': 'So I think maybe I might be the lowest north of the commission because everybody keeps saying, Well, wait a minute, did you do this ten years ago? Lois and I actually live in the same building now, so people get us confused.'",
        "'speaker_2': 'I was came from the legislature to the county council as we were transitioning and taking over metro responsibilities. So I was a member of a council of 13 members. And and the growth now compared to the size of our responsibility then is huge.'",
        "'speaker_2': 'So I have concerns about that. And also I realized that over the number of years that we have worked on, quote, growth management GMA, we have found that promises and maybe legislative thinking of well will take care of the problem of helping counties do their work with infrastructure.'",
        "'speaker_2': 'We'll find we'll take care of that later. And the problem is we haven't been able to get them to give us the ability to pull in the resources we need. Your budget is still totally lopsided to the criminal justice side.'",
        "'speaker_2': 'When you look at the pie chart, you see how much of the general fund goes to that. So it's a concern to me that we won't be able to keep our infrastructure up and that we need to have the authority and the ability to bring in the resources that are needed.'",
        "'speaker_2': 'So I think that's a major problem that maybe we can help a little bit with the commission.'",
        "'speaker_0': 'Let me pull out a microphone right up to you there. There you go.'",
        "'speaker_4': 'Hi. My name is Nat Morales. I am currently the organizing director for an organization called Front and Center. As a once undocumented immigrant from Mexico, I think this opportunity to serve on this commission is important not just for the county, but I think our country as a whole.'",
        "'speaker_4': 'It has been my mission since moving to King County from rural Tennessee to bring the perspective of community, of immigrants, of refugees, of my brothers and sisters in the movement. And I think that this opportunity will be sufficient enough for bringing the voices of community to the table.'",
        "'speaker_4': 'I think when we're looking at the at our infrastructure, when we're looking at who is making the decisions here in King County, here in Seattle in particular, I think we oftentimes don't include the most marginalized. And so it will be my mission and it'll be my distinct honor to be able to do that while serving on this'",
        "'speaker_4': 'commission.'",
        "'speaker_0': 'Very good. Thank you. Well, thank you for those introductions and comments. I'll turn it open to councilmembers questions or comments at this time. Councilmember Lambert, would you like to start?'",
        "'speaker_2': 'You may be happy to do so. It's great to see so many of you. I've seen all of you before here doing great things. So thank you for bringing that expertize began to help us. So I think what do you think you mentioned earlier about the different taxing districts.'",
        "'speaker_2': 'What do you think about the different taxing districts that we could do to streamline some of that?'",
        "'speaker_1': 'I assume, Councilmember Lambert, you're directing that question towards me since I had mentioned that 161 different taxing districts right now that there has been. If you follow the growth management, there has actually been some policy statements whereby some of the taxing districts should actually merge, consolidate and things like that.'",
        "'speaker_1': 'We also have, you know, within the county, certain countywide taxing districts, there needs to be some form of legislation that would, I guess, incentivize further the consolidation of special purpose districts that are serving regional as regional areas. Because right now there appears to be, in my mind, of serving special purpose districts the desire to maintain local control'",
        "'speaker_1': ', even when a local control doesn't necessarily benefit the citizens. But there's obstacles in that. There have been a couple of minor legislative changes out there that will make it a little bit different, make it easier. But still, there isn't the incentive to regionalize.'",
        "'speaker_1': 'And part of that has to do with affects of labor law, affects of local control, things like that. So I think it would be important to look at ways that the county could, as a ambarella agency, move and consolidate and maybe bring those little services under, much like it did with Metro.'",
        "'speaker_2': 'She took, I thought, this conversation or these questions.'",
        "'speaker_0': 'I'm not sure the difference there, but you're welcome to proceed as you wish, as long as you don't abuse our witnesses, which I know.'",
        "'speaker_3': 'And I don't think Mr. Williams going to let you down.'",
        "'speaker_2': 'I'm not happy the mayor worried about painting that. Anyway, I think you have a good point. My concern is, as you know, a member of many boards and commissions that the number of expertize this bridge is, I don't know how to run a hospital.'",
        "'speaker_2': 'I do not know how to run a fire district. I could probably administer it, but I don't know whether you need more of this kind of chemical or that kind of chemical. So I'm glad they're firemen that know this chemical fire, people that know this is the chemical used for this that this and the ratios.'",
        "'speaker_2': 'So that part, I think we need other experts and I don't know if they report to us so that we do all the overhead, but the one area that we do have a problem is that nobody has the authority inside the millage rate to decide who gets more millage and what do we do if that knocks off'",
        "'speaker_2': 'a junior taxing district? So I think one of the considerations I'd like to throw out is somebody should have, whether it's us or somebody, probably us have the ability so that if somebody wants to increase their taxing rate by $0.10, but that knocks off three other taxing districts, that we have some ability to say, no, that isn't'",
        "'speaker_2': 'going to work. So that for me is the part that needs to be fixed.'",
        "'speaker_1': 'Interestingly enough, and I don't want to digress too far on on ad valorem taxes, but interestingly enough, special purpose districts, really, they make the levy request to the county. The county is the actual one that levies the taxes.'",
        "'speaker_1': 'All they do is make the request. And depending on what county you're in, certain counties exercise the the the power of levying a little bit differently than King County does. King County is pretty much we ask for it and we give it to you, unlike certain other counties that actually exercise a great deal of oversight.'",
        "'speaker_1': 'Because, remember, the process is we make the special purpose districts make levy requests, and then the county approves that levy. So I don't know if there needs to be another layer involved in the county charter that would be able to balance that out and take those things in consideration.'",
        "'speaker_1': 'That's a big political issue. As you mentioned, the statute already addresses the priorities between senior taxing districts, junior taxing districts. That's a that's a very interesting conversation. And obviously, it's something to have that you're going to really have to work through.'",
        "'speaker_1': 'The other point that I wanted to make is, is that I think it's also important to separate operational issues from policy. A lot of what you were describing was operational issues. And I'm going to be the last person in the world to tell a fireman how to put out a fire.'",
        "'speaker_1': 'But at the same time, I think that there's an appropriate spot for you all in in determining regional services.'",
        "'speaker_2': 'Great. Thank you very much.'",
        "'speaker_0': 'Thank you. Councilmember Dunn.'",
        "'speaker_1': 'Thank you. And thanks for your comments on special purpose district reform. It's something that I've been interested in and worked on some in the last decade or so. And it is such an antiquated tax system and it's been built on layers, upon layers upon layers without a whole lot of regard to the layer, previous layer.'",
        "'speaker_1': 'And it's kind of a mismanaged mess. We see it most particularly what we run into levy suppression issues where junior taxing districts get suppressed and that's happened and where that junior taxing district literally has to pay the more senior taxing district not to levy its rate, which is the same thing.'",
        "'speaker_1': 'It's burning money for the junior taxing district. So I'd like to work with you on those issues. And I think it needs to interface also with the state legislature in terms of how we prioritize those taxing districts and how high on the world fire districts get close to suppression sometimes in hospital districts.'",
        "'speaker_1': 'I mean, that's just crazy. And history has taught us anything. It's taught us this that we're going to have a recession. It might be in two years, it might be five years, possibly eight years, but it's going to happen.'",
        "'speaker_1': 'And so we need to reform that. And I'd like to work with you in advance of that coming before. For the voters and the council. I want to say very generally, the charter of your commission is a very important process and it was really very necessary every ten years.'",
        "'speaker_1': 'It really should be every five. But that's a lot of work to kind of clean house and to reorganize the way that we fine tune, the way that we run as a government very broadly. And so we put our brightest minds in this table here.'",
        "'speaker_1': 'But I can say that about all of you. My nominee, Sean Kelly, is the mayor of Maple Valley. And he's very, very, you know, worked very closely with the Thomas School District. And I hope the council approves him as well.'",
        "'speaker_1': 'But these are really fine folks. It's a lot of work we're asking you to do, but we appreciate it very much. And I have found that working the charter of your commission, working with council members as that process moves along, yields a better result than if it's done in isolation.'",
        "'speaker_1': 'So just encourage that. Appreciate your willingness to work and look forward to working with you on special purpose district reform. Thank you.'",
        "'speaker_0': 'Very good, Councilman Belushi.'",
        "'speaker_2': 'Thank you, Mr. Chair. Thank you all for being willing to serve on the charter commission. It's a it's a it's going to be a bit of work. We appreciate you bringing all your expertize. One thing I've been thinking a lot about lately, and I noticed in many of the responses to the questions is how do we effectively'",
        "'speaker_2': 'work as a region to address regional challenges? County is the regional government, but we don't have all the authority and the responsibility here required to address effectively some of our biggest regional challenges from transportation, homelessness, affordable housing, economic development.'",
        "'speaker_2': 'When we talk about where does where do jobs go and how do we, you know, lift all boats around the county? We really need to be able to work effectively with cities and with the state. And it's just a topic that's on a lot of and a lot of meetings these days.'",
        "'speaker_2': 'So I would be really interested to hear anybody's thoughts now or when you get to meeting about how do we structure ourselves so that we can work as effectively as possible and challenge ourselves and each other while recognizing the authority and role of each level of government?'",
        "'speaker_2': 'If it was easy, somebody would solve it by now. But, you know, jump right in. I will say one of my interest actually in being involved with reviewing the charter is not only look at really looking at the policy analysis pieces, but really having an overview why I didn't actually like some of the questions we were asked'",
        "'speaker_2': 'beforehand. I thought, you know, in some ways we really can't answer those until we do like a deep dove on how our county has really changed and not only how our county has changed in terms of demographics and challenges, but also how government has changed in the last ten years about how we should be working.'",
        "'speaker_4': 'Together.'",
        "'speaker_2': 'How we should really be having communities in leadership, in ways that I think didn't happen as regularly ten years ago. And, you know, I have worked with other regional parts of the country and Seattle has attended Seattle and King County.'",
        "'speaker_4': 'Have.'",
        "'speaker_2': 'Some really good models they could be looking at in terms of a regional approach that does not seem to be as present here. I look forward to hearing more about that. Thank you.'",
        "'speaker_0': 'And I'll just note, it's a long standing tradition that the municipal league be involved. They helped get our 1968 charter passed and of course, the few decades before that reform the Seattle City Government Charter. So we're really pleased that the Nesbitt League has a representative here and hope that we can rely on your broader organization as well'",
        "'speaker_0': 'on its skill set and resources to be a part of the process.'",
        "'speaker_2': 'I'll be happy to. I think one of the things we forget and part of our job will be to educate the community as we go along. Because the reason we have so many special purpose governments in the West and it's mainly in the West, the larger West is because we didn't trust the feds at all.'",
        "'speaker_2': 'So we had to have our own little pockets of a commission for this and a board for that. And that's sort of how we got and and I actually was an elected member of the Special Purpose District, i.e. a water sewer district, separately elected, etc..'",
        "'speaker_2': 'And I agree with the idea of the management of the what you're doing is one thing, but the governance is another. And I agree that maybe it's time that we quit worrying about being the wild, wild west and get things together.'",
        "'speaker_2': 'But we'll have to do a real we'll have to do a lot of educating to the general public, because I always said if King County on the day stop everything they do, suddenly people would realize how many services the county is providing that affect their daily life.'",
        "'speaker_2': 'And I would just add to that, I think there really can be a litmus test around safety and so on, so forth. As part of a 32 house sewer water district on Basilan, I could tell you that we've not always had the greatest water quality standards and so on, so forth, and it's difficult.'",
        "'speaker_2': 'One of the volunteers in the neighborhood running it, and there is a point of professionalizing that process and.'",
        "'speaker_0': 'Putting in other questions or comments for this panel. Councilwoman Raquel Welch.'",
        "'speaker_2': 'Thank you, Mr. Chair. I don't know if you are in the position yet to be able to answer this question, but if any of you have any thoughts, I'd appreciate hearing what going into this process. What do you think is the number one challenge for King County?'",
        "'speaker_1': 'I think that this is kind of Williams again. I think that when I look at the charter. And I look at what's going on in the county is. You need to be a little bit more nimble. There's a lot of issues in the world's changing rapidly, and it seems like maybe it's just because I'm getting older.'",
        "'speaker_1': 'But it seems like as things keep changing, it seems like the pace of change keeps getting faster and faster. And when I read the charter, I, I felt like to some degree it was antiquated and in a way, it had a lot of a lot of restraints on action.'",
        "'speaker_1': 'And I think that in order for the county to be able to address the issues such as homelessness, whether you call it homelessness, affordability or streamlining government, it's going to have to be a little bit more nimble because it's very confusing from a consumer perspective or a taxpayer perspective when you have to call eight different places in'",
        "'speaker_1': 'order to get an answer in your state and you're in the same house, you know, it's not like you're going different places, but you're there's a lot of different layers of government here that's very confusing to most people.'",
        "'speaker_1': 'And I think that being able to streamline it and make it easier for people to understand their government and how they work and get responses is going to be a challenge for everyone.'",
        "'speaker_0': 'Very good. Let's see. Toby, you wanted to?'",
        "'speaker_1': 'Yeah. You know, in reviewing the charter, I really don't see structural issues in the charter itself. That would be changing. That would make a huge difference, because I see the biggest challenge facing the county as a sustainable revenue and the limitations are not in the charter.'",
        "'speaker_1': 'The limitations are in state law and what what the county is allowed to do. And so it'll be interesting if we go through this process and we end up not making many changes to the charter, but giving you all a long list of requests to the state legislature.'",
        "'speaker_1': 'And I don't know if that's actually within our scope to do that.'",
        "'speaker_0': 'I hope so.'",
        "'speaker_1': 'Maybe one of the things that we end up doing.'",
        "'speaker_0': 'Thank you. Yeah. I want to just reinforce for my perspective those comments that there may be some state based changes. We need to be able to effectuate a contemporaneous, contemporaneous charter.'",
        "'speaker_4': 'And I would say just real quickly, I also want to say that I think one of the biggest challenges right now in the county is the lack of equity when it comes to a policy that is passed, when it comes to looking at who is in leadership positions, when it looks to when it looks at how decisions'",
        "'speaker_4': 'are made and who they're being met by. I think that everyone, obviously on the council and everyone who represents King County is capable of doing so. And I mean, we appreciate everything all the time that council members have given and your efforts thus far.'",
        "'speaker_4': 'And I do think that there is still a lack of representation. I think there when we look at the county, when we look at how it has changed and we when we look at how it will continue to change, we need to make sure that government governing bodies and decision makers are reflective of the people who are'",
        "'speaker_4': 'most impacted by those decisions. So I think when we look at how equity is applied and that lens is applied to governance, I think that's still a challenge for King County.'",
        "'speaker_2': 'I know. I'm sorry. Did you want to go? No, I would certainly agree with Natalie. I would also say, you know, not to be glib about this, but how do we look at this as an opportunity as well as a challenge?'",
        "'speaker_2': 'I mean, King County, I think, is known for innovation. Our region is known for innovation and wanting to find unique solutions. And I've, you know, had a chance to work with the council. And I know that's also a desire there as well.'",
        "'speaker_2': 'So the question is how can we create litmus test and the constructs of equity throughout our work that we could be striving way beyond just tinkering with things, but having that really reflect what we would like to see in the county.'",
        "'speaker_0': 'All right. In the interest of time, Kasperowicz, can we move to the next panel or do you have a specific question here.'",
        "'speaker_2': 'For this panel? That's okay. Sure. It was triggered by something that our panelist, Toby Nixon said. You know, one example of that is the Rhodes formula. Rhodes formula is broken. And when you talk constituents, the reason I can't fix your road as much as I would like to and as much as the 43% of the King County'",
        "'speaker_2': 'Roads employees that got laid off, they have no job. Would love to be out fixing your road, but because of the formula at the state, we don't have the money for that. It's mind boggling to them. What do you mean?'",
        "'speaker_2': 'You don't have the money for that? What do you mean? The formula is broken. How did that work? Why did that happen? Why hasn't been fixed? Oh, perfectly legitimate question. So I think, you know, having something that it has to be sustainable is really important.'",
        "'speaker_2': 'You know, one of the things that we do fairly well is we acknowledge where. Regional government. But the thing we don't do as well as acknowledge with the local government and I think it's really important as we go forward because if they were a city, they would be the second largest city in the state.'",
        "'speaker_2': 'And yet they have no mayor, they have no city council. They have us, but not all of us are actively engaged in what goes on out there. And sometimes it's a difficult dichotomy. And so I think putting the fact that this the section of our county needs to fully be represented is really going to be important.'",
        "'speaker_2': 'And hopefully we'll have the Department of Local Services. But what should that department be able to do to make it more empowered as a city and not just sucked up into being, you know, part of a regional government?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Nixon, I know you've got to go. And just maybe if I can, one final question, since I think you may be our only city council member on, we have the mayor of Maple Valley who'll be serving.'",
        "'speaker_0': 'But you're here today. A big part of our work involves partnering with the 39 cities in the county who are the direct service providers to most of our residents. And we have some structures via the Regional Policy Committee in the Regional Transit Committee to integrate our governance.'",
        "'speaker_0': 'But do you have thoughts on how that process might be or what relate those relationships might be improved? Because I think there is still occasionally some tension between the county in the cities on the issues that are facing our region, just in terms of how we address them and getting them done.'",
        "'speaker_1': 'Well, I think that the current system is actually pretty effective with the South Cities Association having representation on all the regional committees or nearly all of the regional committees and the SCA Public Issues Committee, which I serve on, and the and the board being able to work on consolidating positions among the cities in communicating with the county'",
        "'speaker_1': '. I think it's been pretty effective and making sure that the interests of cities are addressed by the county. So no, I don't have anything on the top of my mind right now in terms of what would be changed.'",
        "'speaker_1': 'But I certainly look forward to the process and considering concerns and proposals that others might raise.'",
        "'speaker_0': 'All right. Well, thank you very much. I want to echo Councilmember Dunn suggestion that as you do your work, that you make time to make time to interview and dialog with members of the council. The executive are other separately elected officials.'",
        "'speaker_0': 'I'm sure you'll outline a process or work plan to do that as you get going. And we are providing staff from both the legislative and executive branches and hopefully we'll get you a lawyer. Do we have an act?'",
        "'speaker_0': 'We have a lawyer for we got a lawyer for him. Okay. You're going to need that.'",
        "'speaker_2': 'We don't want too many.'",
        "'speaker_3': 'No, no. Canon is not allowed to practice law and order.'",
        "'speaker_0': 'But thank you for being here. We'll expect a move if you have to do, but expect to move this motion forward today. We'll invite up the next panel. You guys have cleared a lot of the heavy, heavy brush for that.'",
        "'speaker_0': 'Thank you all. All right, welcome. And Will, you guys saw how we did that? And we'll let you do brief introductions and a little bit of background on why you're interested in serving that. Have a little dialog and we'll start on the left.'",
        "'speaker_0': 'All right.'",
        "'speaker_4': 'Good morning. I'm Beth Segal. And I guess the thing that the charter and I have in common is we both just turned 50.'",
        "'speaker_3': 'And I.'",
        "'speaker_4': 'Didn't get a committee panel thing. I just had cake. I am a the founder of a nonprofit that education network that focuses on education policy, primarily with suburban Seattle school districts, but also statewide issues. I have a lot of experience also representing foster children, and that actually right here in King County courthouse, also with a lot of'",
        "'speaker_4': 'policy and hands on experience helping the disability families and students with disabilities and special education policy specifically. Also, I have been very involved in overcrowding issues in our school districts, campaigning actively for too many losses and a few wins for school bonds.'",
        "'speaker_4': 'And with all of these domains, I can bring a user perspective to these discussions, whether it's people with disabilities trying to access public transportation, trying to explain to voters what a bond is and why we have to keep voting them up or down.'",
        "'speaker_4': 'And also, as a ten year resident of unincorporated King County, just the issues that you face, trying to raise a family and go to work every day from Novelty Hill area and the traffic and issues and things like that that we face pretty good.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'I thank you for having me. I'm Jeff Natter. I'm executive director of Pacific Hospital Preservation Development Authority, which is the city chartered but county wide PDA standard up on Beacon Hill where the stewards of the Pacific Hospital campus.'",
        "'speaker_1': 'And we use our funding to provide services and grants to people in King County who are addressing health equity issues. We work with quite a few organizations. I'm really excited to see members of the council again. I've been having one on one meetings with several of you.'",
        "'speaker_1': 'It's great to see you again and thank you for welcoming me here. I've been doing health and social services in King County now for about 30 years, and I still feel like a newcomer and in a honeymoon phase at this county.'",
        "'speaker_1': 'Just quickly, last week we were in my staff and I were in North Bend to meet with Encompass, which works with two small children, and we passed a herd of elk by the side of the highway. And one of the reasons I would like to really work on this county charter and feel very honored to be able'",
        "'speaker_1': 'to do so is I would still like this county to be a place where we can have herds of elk in the county under the shadow of Mt. Sinai and have world class opera and have competitive sports teams like the Seattle Storm.'",
        "'speaker_1': 'And I also think it's really important for us because the charter is only reviewed every ten years to look at the ways in which practice may differ from actual policy. In the past ten years, I think we all know in terms of administration and management, we often engage in practice that might be different than the written word'",
        "'speaker_1': 'and some of it's often for the right reasons. I'd like to make sure the charter can reflect that, and I really want to work with the Council themselves as the stakeholders of this of this Charter, to see what your opinions are and what your ideas are about how we can make effective changes.'",
        "'speaker_1': 'Thanks.'",
        "'speaker_0': 'Thank you. Morning, Brooks.'",
        "'speaker_1': 'Hey, Brooks Selzer. I'm an executive board member of the King County Labor Council, representing about 150,000 workers. And also the Washington Federation of Public Employees represented about 45,000 state workers. The reason I wanted to be part of this committee, which I was really shocked when Joe actually nominated me, was I really do want you guys to have'",
        "'speaker_1': 'that nimbleness, to actually attack some of the problems that we have in our community. And also it's just to make sure that workers are a stakeholder in our charter because, you know, those are our voters and those are the constituents that you guys represent.'",
        "'speaker_1': 'And that's why I'm here. Thank you. Hi, I'm David Heller. I'm a lawyer with an office in Burian and I live in Normandy Park. I don't know much about municipal law. The other lawyer knows far more about it than me.'",
        "'speaker_1': 'Obviously I do know quite a bit about history and the Constitution, which I think is how I got nominated. It seems to me I agree with Mr. Nixon. The biggest problem the county has is it doesn't have enough money to do what it needs to do.'",
        "'speaker_1': 'And I'm not sure how much of that is a structural problem within the charter. I think it is more of a state problem. So as someone else suggested, we might come forth with some suggestions regarding what the state ought to be doing to change that.'",
        "'speaker_1': 'Someone mentioned, and I'm well aware of this as a lawyer who goes to court, that the court system, the justice system is taking a. A huge amount of the budget and it's, in my opinion, absurd that Washington is the last state in the union after even Alabama and Mississippi in state funding for its court system.'",
        "'speaker_1': 'I mean, the county is paying all this money to prosecute people in the name of the state. Does not make sense to me there. There's been talk about regional solutions and I agree that we need regional solutions. But the region is bigger than King County, and I think that's something we need to think about as well.'",
        "'speaker_1': 'Take a quick example. If we if King County did something that caused homeless people instead of ceasing to be homeless, to move to Everett or Tacoma. Problem is not been solved, just been moved. And I think there's a number of problems as the region grows and as people leave King County, because the housing prices, they're moving to'",
        "'speaker_1': 'Snohomish and Pierce counties. And I think increasingly these three counties need to be working together. And I'd like to see some structures that can make that happen. And if, for example, all three counties went to the legislature and said, we need this or that, that's a lot of votes and it might have some impact down there.'",
        "'speaker_1': 'So I'm looking forward to getting up to speed and working on this. Thank you very. Hello. I'm Michael Hermanson. I think I bring a perspective, which is a little bit different from the other panelists I've heard this morning, simply because I have never been involved in government and have worked primarily in the in arts and culture in'",
        "'speaker_1': 'King County. And so I felt like, I suppose, that the position I once had that had the broadest sweep was being the director of the Museum of History and Industry. So I've had a different a different way of looking at things.'",
        "'speaker_1': 'I'm now retired, so my history activities are focused on it really narrowly seems, you know, as as I get older, my life gets more local. So I'm now president of the Queen Anne Historical Society, which is very narrow but still touches on a wide range of issues that affect the county.'",
        "'speaker_1': 'I'm also very active in bicycling in Seattle and King County. And, you know, I'm sort of the the old man out in Seattle neighborhood greenways. But I'm very interested in finding solutions to density through the reduction of our intense use of automobiles.'",
        "'speaker_1': 'And I think that King County, because of Metro, is really very much in the lead insofar as all of that is concerned. And the other thing thing about bicycle riding is that you get to see history where it's happening.'",
        "'speaker_1': 'That's one thing. And the other thing is you get to explore the whole county. I rode two weeks ago, 67 miles from Mary Moore to North Bend and back, and it's a really a great opportunity to get to know what's happened.'",
        "'speaker_1': 'Oh, that's the same Mount Index experience. Mount Sinai, was it in North Bend? Well, it was really beautiful. But so you get to know the county in ways that's really different, a kind of an intimacy with the landscape.'",
        "'speaker_1': 'That is something that I hope we can bear in mind as we explore how the the organization of the county can be improved. And I'm happy to hear, having read the charter, I'm happy to hear that there could indeed be a focus on establishing protocols for approaching the state to change the way things are operated.'",
        "'speaker_0': 'Thank you all very much. Members questions or comments to any of these panel members? Councilmember Bell Duchin.'",
        "'speaker_2': 'I think that you heard our questions before and some of you went and answered them. And I really appreciated the comment about regionalism being bigger than just the borders of King County. I think the only thing I would offer is I do think that there is we are bumping up against the limitations of our current structure within'",
        "'speaker_2': 'King County to work regionally, effectively and our different layers of government to address our problems. And I think we need to kind of solve that and work with our neighbors. I mean, I think these are and not or so it's just more of an observation.'",
        "'speaker_2': 'But I really appreciate your your. I wanted to make sure not to not ask you the question. You're welcome to answer it again if you like. But thank you all very, very much for giving your time and your expertize to this process.'",
        "'speaker_2': 'It seems like a really high powered group we have here is going to be very interesting to see what you do. I do want to share just a I my very first run for office was for a charter commission in Bellevue, and I won that race.'",
        "'speaker_2': 'So I've been where you've been before. But the charter itself, the the vote to establish the charter commission failed. So we never had to do anything. So you're going to go further down this road than I ever got to go.'",
        "'speaker_0': 'Okay. Councilmember one right.'",
        "'speaker_1': 'Our question after this.'",
        "'speaker_0': 'Okay, proceed. Okay. Very good. Are there any other Councilmember Lambert?'",
        "'speaker_2': 'Thank you. So I'm glad you were for Mary Moore to mount site because that's all my district and all 1007 square miles of it. And it is beautiful but it doesn't have a lot of busses and so and Vikings long I'm glad you can do that so there's a problem with roads out there and there are problems'",
        "'speaker_2': 'that are unique because of the amount of water and the number of trees and the distance and many things. How do you feel that you'll be able and this is for anybody to really be able to address the uniqueness or get to know the uniqueness outside of the urban core.'",
        "'speaker_1': 'Oh well, I'll just respond directly. I'm one of the things that didn't come up in this conversation were were environmental issues surrounding the county. And so much of the county in terms of square feet is actually rural as compared to what we have in the urban core.'",
        "'speaker_1': 'And so I think that we have to take the environment and the impact on the environment into account and kind of see ways that we. To expand the purview of the county. I think there's a real balance to be achieved between, you know, providing access to where people have to work and shop and protecting the environmental quality'",
        "'speaker_1': 'of the of the area. I think the Growth Management Act had a huge effect. It's really been successful. At the same time, when you write from Mary Moore to North Bend, it used to be as soon as you left Mary Moore, you were in rural King County.'",
        "'speaker_1': 'That was the first time I did those rights not that long ago, like 15 years ago. I used to love getting out of Mary Moore, and now you have to crank up these suburban hills until you actually get to rural the rural part of the county.'",
        "'speaker_1': 'So it's very important to to bear in mind that we need to understand that while there are regional problems, there may be social and political, there are also huge environmental questions that need to be taken into consideration. I don't have an answer.'",
        "'speaker_2': 'So most people do not know that 61% of this county is owned by government or open space or has an easement. So there's a lot of issues because government owns and we haven't quite got our noxious weeds under control.'",
        "'speaker_2': 'We haven't got a lot of things under control that need to be under control. And I think people don't realize that 61% was anybody else want to answer that question?'",
        "'speaker_1': 'Sure. I'd like to jump in and thanks for the opportunity. I think my role and I hope our role as the Charter Review Commission is not necessarily to solve each of those problems, but to help create a framework that allows the county council and the citizens of King County to address those problems.'",
        "'speaker_1': 'I mean, obviously, all of us come with real strong concerns about certain issues, if not a whole variety of issues, mine being, health care for underserved. I don't think the Charter Review Commission can improve health care for the underserved.'",
        "'speaker_1': 'I wish we could. I wish we all could. But we're going to have to work together. And I hope that our role as a commission is to provide, as I said, that framework that allows the county council to take action to address those issues on a on a more granular level.'",
        "'speaker_4': 'Just as a semi-colon to these, these are all really great answers. And the issues that you're raising are spot on. I'm a I'm also a lawyer. And I in reading through the charter, it wasn't jumping out to me what specific provisions are hindrances or barriers, but that is where I'm going to absolutely tap into your expertize to'",
        "'speaker_4': 'say, look, you know, we have these challenges. Are these things that can actually be addressed by the charter or do we need to go to Olympia or something else to follow up, especially on what Councilmember Tom said earlier in the process of whether it was campaigning for a bond or trying to help a.'",
        "'speaker_2': 'Foster child get.'",
        "'speaker_4': 'Services in South King County and all different types of advocacy I've done. One of the things that becomes really clear just from the lawyer perspective is exactly what he said, which is we've have layer upon, layer upon, layer upon, layer upon layer of fixes that addressed.'",
        "'speaker_2': 'A specific problem.'",
        "'speaker_4': 'But weren't necessarily global. Just because the reality is whether it's helping somebody take the bus or making sure waste is picked up or whatever things have to happen. And so perhaps this will be an opportunity.'",
        "'speaker_2': 'To fix.'",
        "'speaker_1': 'Some level.'",
        "'speaker_2': 'To make some.'",
        "'speaker_4': 'Global changes that could at least streamline or make things a little better.'",
        "'speaker_1': 'I just wanted to add, I grew up in a very, very small town. It was back east, but a good analog would be Omak with that kind of a place, that kind of weather. And it was east. We did have layers and layers of government in my town which had 5000 people.'",
        "'speaker_1': 'That was both a village board and a town board that met separately and made their own rules. So I'm somewhat familiar with that. But I understand your concerns. And I'll just tell you quickly, I was just back there visiting.'",
        "'speaker_1': 'My family still owns a very small parcel of land. We have some beavers who moved in a couple of years ago and at first they were cute and now they're taking over the place and we're not sure what to do about it.'",
        "'speaker_1': 'And so that's part of the issue. That county is both very urban and very rural in different places, and sometimes they need different things. In my overlong essay that I wrote in response to the questions or didn't make it, it was a.'",
        "'speaker_0': 'Very interesting response. You might take a look at that questionnaire.'",
        "'speaker_1': 'Thank you. I suggested that perhaps we should look at restructuring the council. Maybe it should be larger, maybe it should be different. Maybe there should be some at large seats. That could be if there are groups that are not being adequately represented that or perspectives that are not being adequately represented, that could be a way to address'",
        "'speaker_1': 'that. I realize that's a pretty touchy subject, but it might be something for us to study and think about it real quick.'",
        "'speaker_0': 'That's why we're done.'",
        "'speaker_1': 'On that point. I appreciate your courage in coming forth and saying. It's, of course, been done before. Yeah, we all or some of us lived through that and having to campaign against the person that represents this district now, because ultimately the charter was struck and the 13 denied but larger.'",
        "'speaker_1': 'Yeah, I heard that as well. We hear what we want to hear up here. Here's the point I'm trying to make. It is so critical that this board, the commission, were made independent and I mean really independent and and to the point where, like I said, you know, worked closely with members of the council as you shape'",
        "'speaker_1': 'a particular proposal. But at the end of the day, you're going to have to take the tough votes. Let's talk about special purposes. Who reform? Do you think fire commissioners are going to like the idea of giving away their jurisdiction or sewer district commissioners or irrigation district or whatever it is?'",
        "'speaker_1': 'There are so many. You're just going to have to take the tough choices. And I appreciate the independent spirit by which that was said. And so regardless of I'm up here griping in a couple of years about something.'",
        "'speaker_1': 'Remember what I'm saying now? You need to be independent. Thanks a lot.'",
        "'speaker_0': 'Councilmember Cole.'",
        "'speaker_2': 'WELLS Thank you, Mr. Chairman. We don't have much time. I'm aware, but I did ask the earlier panel about what they thought might be the greatest challenge. And one of the Palin powers thought maybe a more appropriate question would be what are the greatest opportunities but that you have before you as being a member of the commission'",
        "'speaker_2': '? Would you like to just give like a 32nd response? Any of you?'",
        "'speaker_1': 'Well, I think we've talked a lot about managing growth. I'd like to frame it as managing change. The nature of the county in terms of our demographics and our population in the past ten years has been dramatic. The nature of the the urban versus rural of balance has been demographic.'",
        "'speaker_1': 'Ten years ago, Bellevue was not Bellevue as it is today, and much of Seattle is not what it is today. So I think that's a great opportunity for us just to be able to recognize what has changed in the past ten years and hopefully make sure that the voices who are the individuals behind that change, whether it's'",
        "'speaker_1': 'environmental, social, health related, political, are respected in the upcoming charter. Thank you.'",
        "'speaker_0': 'Okay. Thank you very much. We obviously you have 23 members who are nominated division. It's tough to get folks. Kojo, we appreciate everyone, all nine of you that were able to attend today. I sent out the questionnaire to help give members some insight into the nominees, especially those that were unable to attend.'",
        "'speaker_0': 'And we got pretty good responses on those. Mac, do you know how many out of the 23 responded to the questionnaire? 15 or so, 15 or so. Okay, 16 so far. I did hear from Senator Joe Fein, who was courteous enough to let me know that he would not be here today because the number two child was'",
        "'speaker_0': 'expected to maybe be delivered. I don't know how that's going, but I would be right now in my chair to refer to.'",
        "'speaker_1': 'Child which just born.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'And I just got a text from Joe and mother and son are doing well and it appears to be it's 8, ten ounces born at 957. Otherwise he would have been here. Your mother and baby are very healthy, sweetheart, but before.'",
        "'speaker_0': 'Well, he yelled to a question.'",
        "'speaker_3': 'Well, boy or.'",
        "'speaker_1': 'Girl, so.'",
        "'speaker_0': 'Boy. Okay, second boy. All right. Do you know. All right. And also Sung Yang indicated that he wanted to be here but was was not able to join. I don't think I heard from other folks. I want to pass along those items.'",
        "'speaker_0': 'So Councilman Ron Wright power.'",
        "'speaker_1': 'I just had a procedural question. It has nothing to do with the panel here, which I'm very appreciative of. Bob and I nominated Center Payne and I feel that he because he worked here at the county for ten years, both for Julie Patterson as well as myself, he brings a really good perspective.'",
        "'speaker_1': 'I couldn't help but notice that looking at the sheet that Councilmember Dunn, Councilmember Baldacci, Councilmember Lambert and Councilmember Bowen are all have one nominees, whereas other districts have large is their vote weighted or I'm just curious as to how this process developed because it seemed the suburban district councilmember I do chief myself Lambert Dunn all seem to'",
        "'speaker_1': 'be having represented by one person on this rather large panel. I was just curious with how this was set up.'",
        "'speaker_0': 'Yeah, that's a good question. And I see that we're going to get some help from our legal counsel to perhaps give us some background on the extensive and long process that is undertaken between the executive and legislative branch to get these nominees here.'",
        "'speaker_1': 'Well, good morning. I am Mike Hooper, counsel to the council. And the question was, is the wait, are the votes on the charter commission weighted? They are not. It is one person, one vote when they actually serve, because ultimately what they are doing is providing recommendations for you to act upon or or not act.'",
        "'speaker_0': 'If I took that question as rhetorical, but the underlying point was the question was, what's been the process that's led to this ban?'",
        "'speaker_1': 'That's that's correct. I'm going to answer that. And if I may, I'm going to turn it over to the very knowledgeable Mac Nicholson on how the actuals like the actual selections in front of you. Joe. Thank you, Mac Nicholson staff.'",
        "'speaker_1': 'I've been working with this charter view process since 2016 and 2016. The charter requires 15 members, one from each district, or at least 15 with at least one from each district. So the way we kind of split it with the exact staff is reached out to council members for a recommendation from their district which would cover the'",
        "'speaker_1': 'one from each district. The executive side made appointments equal in number.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Okay. With one additional appointment to kind of not to get to 23 total. And so from from there, the list of folks that were nominated or appointed by the council, you'll see we end up with at least one in each district.'",
        "'speaker_1': 'And then the executive side went through kind of their internal process to it to end up with that. The folks that they appointed, which I think is why you see the picture, it appears to me just looking at the raw number that not all districts are created equal.'",
        "'speaker_1': 'You mean to respect you don't Bellevue councilmember duties larger district over there and compared to some others it just doesn't seem like there was a good communication between the council and the executive to make sure that all these districts were represented.'",
        "'speaker_1': 'That this does not look like a well-balanced panel. It looks like a very distinguished panel, but well balanced panel. When you see the five suburban districts at one person, Dave has two people, whereas other districts have one, two, three, six, five people.'",
        "'speaker_1': 'It appears to me, Mr. Chair, that we could have done a much better job spreading the burden and the opportunity to represent King County.'",
        "'speaker_0': 'I think that I concur that that is an ongoing issue, Councilwoman, right there in our major board appointments, as someone who represents both Seattle and non Seattle, one third of my district being in the city and two thirds being out, i, I am sympathetic to your point.'",
        "'speaker_0': 'I think the chart could be I wouldn't say misleading, but not tell the entire story. For example, a position number 11, William Ebersol is listed as King County Council District one. Public sector was. Magic Kirkland. I mean, he was a as the former mayor of Duvall and I.'",
        "'speaker_0': 'I don't believe well, lives in district one he may work there so I think the chart well giving a clue I think to some degree at least that is an example that jumping out at me is as maybe not indicative entirely of the geographic balance here, but we obviously could not control the executive side nominees.'",
        "'speaker_0': 'We did our balancing here with mostly one member per, but I think there were a couple of council add ons as well. Councilmember up the Grove.'",
        "'speaker_1': 'Thank you, Mr. Chair. I'm going to pick up where you ended. I was very if Mac could clarify kind of how we got to 23, each council member I know was asked to nominate someone for possible appointment. So that was nine.'",
        "'speaker_1': 'And then we if I recall, the executive recommended more than nine. Correct. And I thought it was ten. I may be mistaken. 11. Okay, it was 11. And then so we had a process where empowered our chair to nominate two additional and it got to 22 and there was a discussion among one of the council members and'",
        "'speaker_1': 'the exact surrounding concerns over one of the nominees. And that was kind of worked out between that particular council member and the exact site and resulted in the additional appointee that is kind of be part exact part council member individual who was appointed.'",
        "'speaker_1': 'Okay. Thanks.'",
        "'speaker_0': 'Councilman Belushi.'",
        "'speaker_2': 'Looking at the chart, can you just remind us which of these positions by position number were appointed by the council?'",
        "'speaker_1': 'Yes. If you allow me to just grab my.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Thanks to the panel. You may step down. And while we have our as you can follow up on Councilmember Dunn's comment, you can see why independence of the panel will be so important. Because now here we're wanting to make sure that there's been fairness in the process.'",
        "'speaker_0': 'Mac, why don't you come to the table here?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'And, Carolyn, is this something that you could add some information or value to as well as a participant in this or not? Really, Max, the one. All right.'",
        "'speaker_1': 'That's, I believe, the position numbers, if you'll give me just 1/2, because I don't have them listed by the one through 23 yet on that particular green sheet.'",
        "'speaker_2': 'Is the first green page. You look at his 41.'",
        "'speaker_1': 'So I'll just run through real quick. Position number seven. And these are the council appointees. Position number seven.'",
        "'speaker_2': 'Three.'",
        "'speaker_1': 'Position number three, position number 16, position 15. The names I.'",
        "'speaker_2': 'Know he's just going through the.'",
        "'speaker_1': 'Position chart. I see. Okay. Thank you. 1895 position number 18, right.'",
        "'speaker_2': 'One.'",
        "'speaker_1': 'Right position 21.'",
        "'speaker_2': 'Six.'",
        "'speaker_1': 'No position number six was a executive side appointee. Position number eight. Seven. Position number seven.'",
        "'speaker_2': 'No, no, no. I'm saying I'm saying that. So I'm doing a running tally. Seven people.'",
        "'speaker_1': 'Position 23. Position 21. And I've already said that. One.'",
        "'speaker_2': 'Two, three, four.'",
        "'speaker_1': 'I'm not talking in my sheet, but position number 414. Correct. Okay. Is a council appointment position 12, four.'",
        "'speaker_2': 'One, two, three, four, five, six, seven, eight, nine, ten. So that's nine plus the.'",
        "'speaker_1': 'Extra and there should be position 11 also we should be at 11.'",
        "'speaker_2': 'How do we end up at 11.'",
        "'speaker_1': 'Nine plus the two council at large.'",
        "'speaker_2': 'One or two counsel I thought there was one odd one.'",
        "'speaker_0': 'Now you don't remember.'",
        "'speaker_1': 'McDermott Thank you, Mr. Chair.'",
        "'speaker_2': 'I'm sorry, Mr. Chair. I wasn't done asking. Can I finish? Well, I'm.'",
        "'speaker_0': 'Sorry. I was clear McDermott was going to explain or kind of.'",
        "'speaker_2': 'Answer.'",
        "'speaker_0': 'Your question. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Yes, thank you. I was trying.'",
        "'speaker_0': 'To get you two to look each other because Joe was trying to say, I've got the answer.'",
        "'speaker_2': 'Sorry, I can't look at.'",
        "'speaker_3': 'Him.'",
        "'speaker_1': 'Thank you, Mr. Chair. There are nine appointees by council members. And then when the executive what having them have 11 appointees, there was an interest in making sure that the Council had an equal number of appointees, as the executive branch did.'",
        "'speaker_1': 'And so I sent out an email to all of the soliciting names and input on making two additional appointments, and based on those responses, made two additional appointments. And that's how the council seats got to 11. I'm sure those two.'",
        "'speaker_0': 'Alejandro Trace was one.'",
        "'speaker_1': 'And just a moment, if you would. Sure. Or if I can help me out.'",
        "'speaker_0': 'And Linda Larson.'",
        "'speaker_1': 'Human Director Yes.'",
        "'speaker_0': 'Okay. Councilmember Cole Wells.'",
        "'speaker_2': 'Thank you, Mr. Chair. I just want to make sure it's understood that, at least in my case for District four, I had nominated one who was included. And then I was asked for a follow up because most of my selections were white men, very bluntly put, and there was the need for more diversity.'",
        "'speaker_2': 'So I offered another one as a suggestion, and that's what happened.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'I appreciate councilmember run rate Bowers concern. I often also look to district representation. But I think the point that was made by the chair is a good one. There are a number of names on here that while they have a district number after them are, they come with a set of experience and background that makes them good'",
        "'speaker_2': 'representatives for a much broader geography. And I will just without embarrassing her point out Louise Miller, who is listed as a District four person, but throughout much of her career was a District three three person and clearly has a much broader perspective.'",
        "'speaker_2': 'And there are a number of people like that on here. I feel that this is a good panel overall and I'm prepared to support it today. I do think that we should remind ourselves also that whatever recommendations come out of this charter commission come to the council and the executive, and then we get to vote at the'",
        "'speaker_2': 'council, whether they go forward and are voted on by the voters or not.'",
        "'speaker_1': 'Correct. You actually have to vote on our recommendation.'",
        "'speaker_2': 'Yes or no, but we get to vote yes or no, right? Yeah. Thank you.'",
        "'speaker_0': 'That comes run. Right. Power it.'",
        "'speaker_1': 'Just clarification then on the contest again. Yes. Let's assume again those five members representing suburban King County are these 23. Yeah, we have five people. Mr. Kelly, Mr. Fein, Mr. Nixon and Beth are one, and then we're actually six people representing the Duke and David district.'",
        "'speaker_1': 'Those six people who actually represent or live in South King are in suburban King County district. If they decide to come together on issues, are they going to be restricted by a majority vote on this panel from recommending recommending things that might affect their area?'",
        "'speaker_1': 'Well, I'm not sure how the charter commission's going to want to vote on these things. I can say previous reports have included both majority recommendations and minority recommendations. So if there were areas where there was a unanimous vote as a recommendation and then there would be some that were partial recommendations and then minority recommendations as well.'",
        "'speaker_1': 'We have 23 people on this board, six of whom are in or represent the rural or suburban areas of King County district. And those are the districts most affected by King County. With all due respect to my friends in downtown Seattle, by our decisions, because our constituents out there are the most affected by King County's decision.'",
        "'speaker_1': 'So I'm until I have confirmation that those six lonely voices from our suburban King County are going to be heard. I'm going to vote no. I'm sure it's going to pass. But I just I feel very just disappointed that so many didn't communicate together to make sure there more than six votes.'",
        "'speaker_1': 'Of 23 members representing King County suburban or working county. And with all due respect to my colleague, we talked about the broad experience. I agree with you on that. But nothing like living in your neighborhood talking. We believe in communities and if they live there, they're talking to their neighbors at the Safeway store.'",
        "'speaker_1': 'They're talking at their community clubs. I think it's incredible that we have six people on a 23 member board that actually are coming from districts that are primarily suburban or rural districts.'",
        "'speaker_0': 'Councilmember Lambert.'",
        "'speaker_2': 'So this is going back to like ground zero after hearing what Councilmember sorry, Andre Gardner said. So one third of the population of this county live in Seattle, and yet it's about two thirds of them will be representatives from Seattle.'",
        "'speaker_2': 'So I get the broad. But for the nine and I had said my person was number 20, 28 and 33 and I adopted her, but I had actually done a number. Well, Avatar, who is that is my number three.'",
        "'speaker_2': 'But anyway, I do want to point that out just for clarity. So but my question is, has to do with the executive. Is it in the charter that the executive gets to represent? To put that many in. Was that something that we had decided?'",
        "'speaker_2': 'How did he gets to match us and not have it be? And fine with the matching, as if he picked people from all of our districts. But the fact that each of them predominantly from Seattle, kind of exacerbates the problem outside the county, that only Seattle is matters.'",
        "'speaker_2': 'So how did that happen? Is it the charter?'",
        "'speaker_1': 'Is it so the charter just says the exact points council confirms and there need to be at least 15 with one from each district or at least one from each district. As far as how the exec chose his appointees, I would defer to the executive because I don't know how he met that.'",
        "'speaker_0': 'Remind us who is the executive branch staffer on this?'",
        "'speaker_1': 'So there is Kelly Carroll who has been working with this.'",
        "'speaker_0': 'And again, is Ms.. Carroll here? No, no. And who else?'",
        "'speaker_1': 'And Kelly Knight, who's calling recently. So I don't know how many boxes.'",
        "'speaker_0': 'Over.'",
        "'speaker_2': 'There in the back corner.'",
        "'speaker_0': 'Okay. Kelly's here. Ms.. Knight, would you like to respond to Councilmember Von Powers issue regarding the geographic diversity of the executive side nominees? On behalf of the executive.'",
        "'speaker_2': 'I can.'",
        "'speaker_0': 'Why don't you come forward if you're going to speak? So we have it on the record.'",
        "'speaker_4': 'Name calling night. And I work on the external relations team for the exact office. This is my first time up here. It's really nice to see all of you.'",
        "'speaker_1': 'Welcome.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Usually we do a pretend hazing, but it seems like this.'",
        "'speaker_3': 'Is more of a.'",
        "'speaker_2': 'Outreach.'",
        "'speaker_4': 'I am actually coming on to this project new so I can take your feedback, bring it back to my team in the expects office and respond offline. If that works best, I feel not equipped to answer questions about our selection process because I was not working on this issue when that process was going forward.'",
        "'speaker_0': 'That's a reasonable chance. Counseling everyone right now.'",
        "'speaker_1': 'We have to pass this out today.'",
        "'speaker_0': 'We do not.'",
        "'speaker_1': 'I would like to have a chance to have a dialog with the executive, because, again, we have 23 members, six of whom are represented by district. So I think if he has that capacity or we can work together, I just want I like everybody who's been nominated.'",
        "'speaker_1': 'Yes. I just wish everybody would nominate across the board. We talk about, you know, Supreme Court decisions about representation. I don't see that in this process. Okay.'",
        "'speaker_0': 'Colleagues.'",
        "'speaker_1': 'Customer McDermott Thank you, Mr. Chair. Mr. Nicholson, are these appointments? They're being sent to us by the executive. Are they technically all of the executives appointments? And he's taking our recommendation on 11 of them? Yes. I think that's kind of a fair way of saying it, that under the charter, the exec appoints counsel, confirms the discussions we'",
        "'speaker_1': 'had early in the process as a way to try to ensure that counsel had representation and had some input to have the council members pass along. Nine are turned into 11 members that the exact would then add to their list of of appointees and sent over for confirmation.'",
        "'speaker_1': 'And has the Council always have approved or confirmed appointments to the Charter Review Commission? No, but this is the previous Charter Review Commission recommended a charter provision that was passed by the voters to require council confirmation of charter review appointees, and also that the ending piece of having the Council act on every recommendation in an open public'",
        "'speaker_1': 'meeting. Okay, thank you.'",
        "'speaker_0': 'And if I've got the numbers right from the charter, you said it's at least 15 with nine council members, one from each district having a representative person.'",
        "'speaker_1': 'It's at least 15 with at least one from each council district.'",
        "'speaker_0': 'I see. And do they have to reside there?'",
        "'speaker_1': 'It's unclear. I guess I would at this point kick back to Mr. Hoover, because we did have that discussion about kind of how how strict that that kind of requirement was, whether it was a residency or.'",
        "'speaker_0': 'That the charter says council. It doesn't.'",
        "'speaker_1': 'The charter says. Hello, Mike Hoover, again, county council counsel. The charter says from each council district. So it's it is a little bit ambiguous. You can read it as residing there. It could be representing that. It could be that you are free to appoint somebody from that district that you think will represent that district.'",
        "'speaker_0': 'Council member Ron Wright power.'",
        "'speaker_1': 'And I just want the opportunity to have a chance to talk to some of the members who are being appointed to make sure that the minority of folks that are six out of the 23 voices will be heard because they represent in terms of this district or this county, two thirds of the county.'",
        "'speaker_1': 'And I want to make sure that I have a chance to talk to somebody individually, to make sure there's a respectful process that's going to include the minority, as well as the substantial majority who are appointed by the executive.'",
        "'speaker_0': 'Thank you. And just one more general question, if we might, Councilman, through. Remember, it was my understanding is this has been worked for months now that it was going to be ten and ten or at least it would be even.'",
        "'speaker_0': 'And I will confess to see an odd number of 23 and 11 council, nine plus two at large. That's not even half. So what happened? Why why wasn't understanding that I should have been reached with I understood have been reached with the Executive Office to have a balance of counsel on executive nominees.'",
        "'speaker_0': 'Not here before us.'",
        "'speaker_1': 'So if I'm understanding the question, why are we at kind of 23 instead of 22? Yeah. With that were the extra one came from and I would defer again to that particular council member who had a discussion around kind of some of the appointment in the appointment process.'",
        "'speaker_1': 'And, and there was a discussion that was reached or a discussion was had between that council member and the staff that resulted in the appointment of a 23rd to the body.'",
        "'speaker_0': 'Well, I'll just say this is a problem when all council members aren't treated the same on these kind of appointments. It can lead to these kinds of challenges and concerns because, you know, I served before I came here on the redistricting commission with five commissioners, and that was a sensitive topic.'",
        "'speaker_0': 'There were two nominally are two now heads, and we had selected a fifth person as a chair. And one of the rules we adopted, an internal rule related to transparency suggested by Judge Carroll, was if there were contacts from an interested party, a council member, about where a line should be drawn or what precinct should be made'",
        "'speaker_0': 'aware that those be disclosed with the entire committee. And that was, I think, our first of its kind sunshine rule. And it worked pretty well because there wasn't a fear or concern that somebody was gaming the system. And I think what you're seeing here in this dialog is some concerns about transparency in a panel that is going'",
        "'speaker_0': 'to recommend changes to the Constitution, this government and the structure. And for all of the reasons, as articulated somewhat by Councilmember Dunn about independence and the importance of this work, you can you can see why we care and why Councilman Ron Redbirds are raising these procedural concerns about how we got to today on the on the nominees'",
        "'speaker_0': 'without raising any concerns individually about the quality of the nominees before us. He's been very clear, and I think I think probably all members here agree with that. It's outstanding group of folks, but sometimes where you sit determines where you stand and maybe from what your district you work from, like determine where you put your work in'",
        "'speaker_0': 'to on some of these issues. Councilmember Lambert.'",
        "'speaker_2': 'Thank you. So I agree that these are a great list of people, but I am also concerned with what councilmember bombmaker brought up about. The idea that that happens frequently is that the people most impacted by our decisions are frequently people that are in the unincorporated area, both urban and operated in unincorporated.'",
        "'speaker_2': 'And yet frequently or like 99% of the time, they have a few people there to advocate for whatever is or isn't. So it's just systemically looking for ten years from now, you know, maybe saying that, you know, whatever the numbers are that the executive needs to, you know, choose the people he chooses along with each of us'",
        "'speaker_2': ', where he would say, there's somebody in your district I would like to appoint. Is there somebody that you agree with so that it is more evenly divided? But even so, there are five districts in Seattle and four districts that are not.'",
        "'speaker_2': 'So even then, we still have a preponderance. So I think it gets back to the question that Councilmember asked earlier. You know, will the people that are going to be on this committee, like many of us have to do?'",
        "'speaker_2': 'You know, one minute I'm a floating district supervisor and I have a supervisor, and then you take that off. And now I'm a council member and pretty soon I'm a board member. So, you know, flexing their ability to say and keep in mind that Seattle, as wonderful as it is, is not the epicenter of the entire county'",
        "'speaker_2': ', and that there are other people who live and work outside the county but also need to be taken into account. And if it's going to impact them more than other places in the county, that that really needs to be taken into concern.'",
        "'speaker_2': 'And, you know, one of the one of the members brought up an issue today, I think, kind of tongue in cheek. But it was on the beaver issue. That is a huge issue. And I have pictures I took.'",
        "'speaker_0': 'I was going to tell them we could have a whole session on beavers, but we're not doing that.'",
        "'speaker_3': 'Councilmember Lambert has no new beavers.'",
        "'speaker_0': 'We have had committee meetings on the beaver.'",
        "'speaker_2': 'We haven't have new pictures. But it is a serious issue. And unless you have to deal with it, those cute little things are so cute until they destroy everything. And how do you tell people who don't who only see them as cute and adorable, that when they've destroyed everything, it's not so cute and adorable?'",
        "'speaker_2': 'And how do you deal with it? And unless you know that, you have no idea. So I think it's going to be important that whoever is ultimately on this committee that they really have the pep talk thinking outside of one city but the entire county.'",
        "'speaker_0': 'Thank you, katherine. I want to get to councilman wrote the grove, but just. In the interest of movements like hearing your concerns, Karl Rove of Rick Perry, but understanding the constraints of committee time and it is this committee has been it's not the committee of the whole in the past.'",
        "'speaker_0': 'We have been added a whole bunch of substantive jurisdictional issues around parks, sewer. We are overwhelmed. And the July and August meeting schedules are tough. I would ask and hearing your concerns and knowing that there could be a solution because these are flaws, not ceilings on nominees.'",
        "'speaker_0': 'If we might be able to if you would be comfortable with without recommendation, moving the members forward today, knowing that that's two weeks plus a week to at least think about that. Okay. Okay. All right. Thank you. Councilmember up the Grove.'",
        "'speaker_1': 'Thank you, Mr. Chair. I as a south ender, along with my colleague, I appreciate his sentiments. I maybe don't have quite as much fear as I heard in his voice, in part because the nine of us, you know, a majority of this county council's from outside Seattle, from the you know, five of us are from rural and'",
        "'speaker_1': 'suburban areas, and the chair of the committee is in a divided district. So I think if there were shenanigans based on geography that took place on the Charter Review Commission, the fact those come back to the council would would provide some certainty.'",
        "'speaker_1': 'That being said, I think the point that I heard was broader about making sure that that life experience is truly reflected in the in the diversity and the geographic diversity and the the numbers districts. I'm sympathetic to how they can mean different things.'",
        "'speaker_1': 'For example, there's somebody from my district there, the executive director of a Seattle based nonprofit. I thought the example of the former councilwoman serving a suburban area but living in Seattle. So these numbers kind of at times can be somewhat arbitrary.'",
        "'speaker_1': 'But I I'm actually more troubled by the notion of that nine of us not being treated equally, especially if that threw it out of whack. And I don't I don't know the back story on that. But if having one council member get an additional appointment ended up skewing these even further, that would have been more problematic.'",
        "'speaker_1': 'So I want to express my concern about that, my, my, my empathy. But also just I wanted to point out that we do have a majority of folks up here from outside our urban core. So I think if like I said, if there was something that wasn't geographically balanced, we have a safety valve.'",
        "'speaker_1': 'But I would love to work with Councilman von Reich power between now and full council if there is identified needs for any changes.'",
        "'speaker_2': 'Sorry. Just very briefly, in addition, we put this list together quite some time ago. I mean, we've been working on this for over a year and things have changed in that period of time. There are some topics that are extraordinarily hot now that were merely, you know, simmering then and things that.'",
        "'speaker_2': 'And so if we're going to take time and have conversations between now and another committee meeting, maybe we could consider that as well.'",
        "'speaker_0': 'Because we're on regular.'",
        "'speaker_1': 'I mean, we we passed that motion on to the full council without recommendation.'",
        "'speaker_0': 'Thank you very much. It's about for us and I take the motion is not going to concern about the substance of individuals and their qualifications.'",
        "'speaker_1': 'And I'm extraordinarily impressed with the addition of all these individuals who took the time to do it, some of whom I've known for 30 years, some I've just gotten over the last 30 minutes. But I want you to know from this is a process question, not a not a personal question, a process question.'",
        "'speaker_1': 'And I think you can appreciate that comment. And I want to thank each one of you for your willingness to serve.'",
        "'speaker_0': 'A very good clinical call the role.'",
        "'speaker_2': 'Thank you, Mr. Chair. Councilmember Bell Duty Council Member Done.'",
        "'speaker_1': 'By.'",
        "'speaker_2': 'Council Member Gossett. Council Member Caldwell. I Council Member Lambert. I. Council Member McDermott. High Council Member Squirrel.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Councilmember one Right now. Mr. Chair. Hi, Mr. Chair. The vote is 18 is no no's. One excuse.'",
        "'speaker_0': 'Here again, we've given a recommendation that this be advanced without recommendation of the full council. It'll come to Mondays from now. Although under our practices and procedures there can be an additional courtesy delay if a member has it.'",
        "'speaker_0': 'And it seems like, Kelly, that maybe the executive might want to get with the councilman one. Right. Bauer and others have expressed concerns about regional balance on this and see if there isn't anything that can be done there to work on that.'"
    ],
    "AN ORDINANCE relating to discrimination and harassment, including sexual harassment, and inappropriate conduct in the King County workplace; and adding a new chapter to K.C.C Title 3.": [
        "'speaker_0': 'Thank you for being here. We appreciate it. MACK Thank you. Thank you to all our members and good luck. You do not need to come back for the full council meeting. We will turn now to item eight. And as we do that, Jennie Giambattista will brief us I.'",
        "'speaker_0': 'Wanted to let staff know on item nine that I in a prior dialog I thought that had passed out on our consent agenda. So I see why you're still here. This on the biomethane. We'll see what we can do.'",
        "'speaker_0': 'I'm not optimistic, but we'll see what we can do to get to it. Hi, Jenny. We had a substantive hour and 15 minute briefing on this piece of legislation that's been worked on very hard by Councilmember Cole. Wells Really the harassment and discrimination last time and we are here today to take a look at her striking amendment'",
        "'speaker_0': 'and other potential amendments and see if we can't get it advanced.'",
        "'speaker_4': 'Good morning. Council members Jenny and John Batiste. Council staff if it's helpful for you, I can give a brief recap of the ordinance or I can jump right into the striking amendment. Which would you prefer? Mr. Chair, I think.'",
        "'speaker_0': 'We've had the ordinance briefed basically, and we heard concerns last time, and so would it help? Councilman wants to jump to the striking amendment to see how you have proposed to address the House.'",
        "'speaker_2': 'Thank you, Mr. Chair. Yes, that's fine. And I do want to bring to attention of my colleagues that we do have the materials that were distributed on our table today. So you can get those up. Thank you.'",
        "'speaker_4': 'So thank you, Mr. Chair. So I'll go through the striking amendment. I have prepared a red line version for you, so the line numbers I will refer to are the red line versions. I think that will allow you to see the changes both clearly.'",
        "'speaker_4': 'So the primary substantive change that you will see before you in this striking amendment is that the judicial branch participation is now voluntary. And you can see that in lines 191 to 194, where there is a specific language that is added.'",
        "'speaker_4': 'There's a new Section five that's added that simply requests the Superior Court and the District Court to give consideration to the sections of this ordinance. Additionally, they are encouraged to transmit training options. That is the most significant substantive change to the ordinance.'",
        "'speaker_4': 'Other changes that I will walk through in the striking amendment largely reflect some of the discussion that was had at the last meeting on this topic. Throughout the ordinance, the phrase each entity managed by a separately elected official is replaced, and that is replaced by simply listing the offices of those separately elected officials.'",
        "'speaker_4': 'So, for example, on line 72, you will see that that has been replaced by listing the assessor, director of elections, sheriff, counsel and prosecuting attorney. That doesn't change the intent of the ordinance, except, as I indicated earlier, the effect is that the judicial branch is no longer included.'",
        "'speaker_4': 'So you will see those that phrase deleted, threw out the striking amendment.'",
        "'speaker_0': 'And if I may, Jenny, just an obvious question for you, or are the are legal officer, but can we direct those separately elected officials to to do this? Or did they have any independence similar to the judiciary, although they're not a separate branch, if you will?'",
        "'speaker_0': 'I just go back to our paid leave program where, you know, it was essentially.'",
        "'speaker_4': 'I believe we can, but I would like to defer for confirmation to our legal counsel, Mike Hoover, on that question.'",
        "'speaker_2': 'He's got rules.'",
        "'speaker_0': 'He's like, you might as well take a permanent seat here at the green table.'",
        "'speaker_1': 'Thank you again, Mike Hoover, counsel to the council. This has actually been worked fairly extensively and we believe as it's written now, we do have the ability to direct it, direct those officials named in the current version. There were other versions where we went back and forth on this quite a bit, the courts being the primary ones'",
        "'speaker_1': 'that we removed inside over.'",
        "'speaker_0': 'I see. And I see we have executive branch books here from H.R.. Is that your understanding as well? Okay.'",
        "'speaker_2': 'Oh.'",
        "'speaker_0': 'I'm just trying to square in my mind. The reason for the silence is in the prosecuting attorney's office. The prosecutor, Soderberg, I thought, stepped up and did the right thing by on the one paid weeks of leave, offering to, you know, grant that benefit.'",
        "'speaker_0': 'But I understood that it was discretionary. And so I'm getting nods from some maybe this is somehow different, but it's a still an important now there are now they're shaking their heads. Could somebody from the executive branch come forward and educate me?'",
        "'speaker_0': 'I'm looking at the lawyer. Yeah, this is I'm not I'm just to understand the difference if there is one or how this works, just from not that I think it should apply to all branches of the government. Right.'",
        "'speaker_0': 'But I'm trying to understand as a legislator, our ability in this context.'",
        "'speaker_2': 'Excuse.'",
        "'speaker_4': 'Islamica prosecutor's office. And Mr. Hoover and I haven't talked about this issue, but I do.'",
        "'speaker_2': 'Think the prosecutor, like with paid parental leave, agreed that they would be part of this ordinance. But I think there is a question and actually, you know, apropos of your charter review decision or excuse me, discussion this morning, there have been some lines where we have done things because we've always done them that way.'",
        "'speaker_2': 'And there's some things we're going to need to clarify in the charter about whether the this body can regulate what courts are doing or the prosecutors because.'",
        "'speaker_4': 'We like the courts.'",
        "'speaker_2': 'Are a separate branch.'",
        "'speaker_4': 'But Ms.. Jean Baptiste is correct that the prosecutor's office is happy to, you know, be part of this this effort to.'",
        "'speaker_2': 'Update policies and report back to the council. But I think that question, if we want to talk about it.'",
        "'speaker_4': 'Deserves a little more research.'",
        "'speaker_0': 'Okay, that's helpful. So we're proceeding here with concurrence of the separately elected. But there well, there is a.'",
        "'speaker_2': 'Or and again, the separately elected in the executive branch.'",
        "'speaker_0': 'If someone's doing the crazy executive.'",
        "'speaker_4': 'The assessor, the elections and my sheriff.'",
        "'speaker_2': 'The sheriff.'",
        "'speaker_4': 'All of their employees, it says in the charter, in.'",
        "'speaker_2': 'The executive.'",
        "'speaker_0': 'Branch.'",
        "'speaker_2': 'That prosecutors, employees are not in the executive branch.'",
        "'speaker_0': 'Because that office is established by state.'",
        "'speaker_2': 'Correct?'",
        "'speaker_0': 'Yes. Okay. But we.'",
        "'speaker_2': 'Do have some sort of mix up on how we'll get that all squared away in charter.'",
        "'speaker_4': 'Review.'",
        "'speaker_0': 'All right. That's helpful. I appreciate the tutorial.'",
        "'speaker_4': 'And if I may add just non-legal information. Our chief of staff, Carolyn Bush, did convene a meeting with the chiefs of staff with each of these separately elected officers to discuss the ordinance and the Stryker. And all of those officers were supportive and in fact, suggested the list, the way that this is listed here in terms of'",
        "'speaker_4': 'rather than using some phrase, such as each entity managed by a separately elected to actually list them out. So moving on, if I made lines 74 to 75, this was just a a edit to clarify the writing. It doesn't change the intent where the edits here are done to clarify that, that there is a requirement for new'",
        "'speaker_4': 'or revised training rather than just recommendations for training later on in the ordinance. It's clear that we've tried to make it clear that what is to be transmitted on September 24th, 2018, in terms of training, are training options line 100.'",
        "'speaker_4': 'The striking amendment insert the word encourages in order to emphasize the intent that the county does want to encourage reporting. So it now reads a description of a reporting system for employees that encourages those who experience workplace discrimination and harassment, including sexual harassment and inappropriate conduct, as those as well as those who observe such behavior to report'",
        "'speaker_4': 'it lines 107 to 113. This language was added at the request of Councilmember Balducci in order to provide more direction on what the guidelines for how to handle a complaint should address. I think the information that is added here is consistent with the intent of the underlying ordinance.'",
        "'speaker_4': 'There are, looks like, a lot of changes on lines 122 to 143. This is just moving text around for clarity. There is a new requirement in there at the end of line 130. And the new requirement is that resources for employees to understand the policies and procedures shall be easily locate able online lines.'",
        "'speaker_4': '158 to 164. Were edited for clarity. The prior version could have been read to suggest that we were trying to prevent complaints, which is certainly that was not the intent. And then on lines 177, this is a substantive change in that the requirement for reporting data on informal reporting is changed to when possible.'",
        "'speaker_4': 'And that was done in consideration that it may not always you may not always have the data on the informal reporting. I would note that the striking amendment has been shared with the executive staff and it has been supported by the executive staff.'",
        "'speaker_0': 'Get a note on this issue. We got a nod from RH, our director. Okay.'",
        "'speaker_4': 'So that concludes my comments on the striking amendment. I think you have also has a amendment from Councilmember Lambert as well, which is an amendment to the striking amendment. For a discussion of that amendment, I would like to turn to our legal counsel, Mr. Hoover.'",
        "'speaker_1': 'Good morning. This amendment is fairly straightforward. The the over the underlying piece of legislation actually directs a variety of departments and agencies in specifically including us to go back, revise and develop our own policies. This amendment that's boring would actually be a little more specific on what should be included in those council policies.'",
        "'speaker_1': 'And it specifies that if there is a concern or a complaint between council members, not necessarily staff, but council members themselves, a mediation process would be imposed and it would be mandatory. This particular language essentially just directs us to adopt that.'",
        "'speaker_1': 'So we would be passing. If you pass this amendment, you would be passing an ordinance telling yourselves to go forth and adopt a policy, implementing a a mediation process that would be mandatory where there are concerns or complaints between council members over and above whatever other policies we also have.'",
        "'speaker_0': 'So this is some specific the ordinance itself is more procedural in terms of asking that processes and politics be developed.'",
        "'speaker_1': 'I think it's fair to characterize the although the ordinance has some specific standards and benchmarks to meet, the ordinance generally tells departments and agencies to go and develop something. This would be a fairly specific directive to us. Yeah.'",
        "'speaker_0': 'All right. We'll take these up in order. Councilmember Caldwell's, would you like to put the legislation before the committee?'",
        "'speaker_2': 'Yes. Thank you, Mr. Chair. I move by ordinance, proposed ordinance 2018 0256 pertaining to discrimination and harassment, including sexual harassment and inappropriate conduct in the King County workplace.'",
        "'speaker_0': 'All right. And would you like to move striking Amendment One?'",
        "'speaker_2': 'Yes. Thank you, Mr. Chair. I move striking Amendment One.'",
        "'speaker_0': 'All right. And Jenny has given us an overview of it. Would you like to speak to it?'",
        "'speaker_2': 'Okay. Do where do we need to take up the Councilmember Lambert?'",
        "'speaker_0': 'And then after we take after we well, before we vote on the striking amendment. All right. Councilmember Lambert, would you like to move your amendment?'",
        "'speaker_2': 'I would. Thank you so much. I'd like to move amendment number one. And it would.'",
        "'speaker_0': 'Serve. I need a procedural ruling on this. Is this within the scope and object of the legislation Council?'",
        "'speaker_1': 'I believe it is. I yes, I could elaborate.'",
        "'speaker_0': 'All right, Councilmember Lambert.'",
        "'speaker_2': 'Thank you, Mr. Chair. This idea came to me during the meeting that we had with all of our employees. What date was that? Is that Thursday? Thursday? And the question that came up and then we had legal advice is, is what how do these things that other employees can go to their manager?'",
        "'speaker_2': 'How would that be handled by the council? And I thought, okay, that's an interesting question. And the advice was that we would self-police. And that was very difficult to do. And so I thought, well, how could we do this in a way that's respectful and a way that would be a good example to all the employees that'",
        "'speaker_2': 'even when you're an elected official, you're still held to the same kinds of standards and that if we don't have a manager over us, although we do have our constituents, but that doesn't help on a day to day basis that we have a process where we can make sure that we are able to do whatever we need'",
        "'speaker_2': 'to do to make sure that this is a healthy working environment. And I thought this is a good way of being an example to all of our employees that we to take this very seriously. And if there's a problem that we will go to mediation and get it worked out in a timely way as possible.'",
        "'speaker_0': 'Thank you. And I'm sorry, Governor, did you move that amend? That's because other council members are concerned about the issue.'",
        "'speaker_2': 'Thank you, Mr. Chair. So this is one of the innovations, and I think I mentioned this in our last meeting about this ordinance that's in front of us, is that it does include council members. We're not exempted from the requirements that Councilmember Caldwell's has put forward to review our policies and to adopt policies and procedures that address'",
        "'speaker_2': 'all of the things that have been now stated as in the ordinance. I will say I lived through an experience on another body where there was an elected official who was alleged to have committed some behaviors that could have qualified as sexual harassment that was on senior staff, possibly not just senior staff, but also was problematic among'",
        "'speaker_2': 'some of the female council members. And so it's very difficult to deal with a situation like that. It's important to deal with it. But it's very difficult because each one of us is here, because the constituents in our district voted for us.'",
        "'speaker_2': 'And there is nothing that the rest of the council can do about that, that the people we are here and we're here until we get voted out of office or we do something that enables us to be recalled by law.'",
        "'speaker_2': 'So however, it sends the wrong message if we just shrug our shoulders and say, therefore, there's nothing that can be done if there are complaints like this. I asked a question earlier on the side that I want to ask you again, now that we're speaking in public, and that is can you talk about so first of all'",
        "'speaker_2': ', I think the before I frame the question, just one more thought. I'm doing this in real time. I do think that the issue of councilmember behavior is a correct thing that we ought to address. I don't think it should be about councilmember behavior just to other council members.'",
        "'speaker_2': 'It should be about councilmember behavior to anybody. And I think that there should be a process that is as effective as we can make it, that gets developed, that we use in situations where there is a concern about sexual harassment or discrimination that meets the definition of this policy.'",
        "'speaker_2': 'Do we have anything like that in the ordinance here? And if so, can you explain what it does now?'",
        "'speaker_1': 'Yes, we do. The the at the beginning of the ordinance, we actually directed many entities, including ourselves, to go back, review and revise our policies in line with standards that were set forth. If you then go down, I'm trying to think, I guess it's section two D, there actually is a specific provision that is, I think, fair'",
        "'speaker_1': 'to say, aimed at what you're raising, which is although it applies to any interactions between staff members, etc.. We also ask that the policy include a specific look and and procedures for accounting for power dynamics. I didn't say that very elegantly, but it is to account for the power differential.'",
        "'speaker_1': 'But when elected officials erect with staff or with each other, I would think.'",
        "'speaker_2': 'Can you point to line number?'",
        "'speaker_1': 'Yes, I can. It's in I hope I've got.'",
        "'speaker_4': 'A very striking amendment on s one lines, 144 to 148.'",
        "'speaker_1': 'Right. And it reads the policies, procedures and training developed by the and I'm skipping all of some of the people council shall specifically address the power dynamics involving staff and elected officials and how to respond to and prevent discrimination, harassment, sexual harassment and inappropriate conduct by elected officials.'",
        "'speaker_2': 'So the way I read this amendment in keeping with the striking amendment and the ordinance, because this isn't new language, this is in the underlying proposed ordinance. Right.'",
        "'speaker_1': 'This what I just read. Yes.'",
        "'speaker_2': 'Is that the ordinance and the striking amendment would direct all of these parties, including the Council, to go create procedures and policies that do all these things, including this particular thing. And the amendment would say what at least one of those procedures must be in a specific type of situation.'",
        "'speaker_2': 'It's like sort of getting to the end on this one question, though, because it's so so here's what I'm suggesting. And I look at Councilmember Lambert for a second. I completely agree that mediation is a tool in our toolbox that ought to end up in our final policy, in an appropriate place, with appropriate language around it.'",
        "'speaker_2': 'Who does it when? I don't know that we can require each other to engage in mediation, but we can certainly encourage each other to do so. But I do think that we're set up right now with this ordinance to tell everybody, apparently set the courts to go and figure out what your policies, procedures and training are going'",
        "'speaker_2': 'to be and then come back and then we're going to adopt those things or we're going to implement those things anyway. So I. Wonder, Councilmember Lambert, if you wouldn't be willing to accept that this language says we're going to work on exactly this sort of thing.'",
        "'speaker_2': 'I'd be willing to work with you. I'm sure Councilmember Caldwell's would be willing to help us with this, as he's been the guiding light on these things, to come up with a procedure that at the end does what we need it to do.'",
        "'speaker_2': 'Because I support your idea. I do. I like it. There are some tweaks I might propose, but I do think that this gets to a place of stating the end result when this entire ordinance is really about dictating a process to get to the end result tonight.'",
        "'speaker_2': 'Councilmember Caldwell's stating that correctly in your mind. And thank you, Mr. Chair. Yes, I believe you are. And what we what I've wanted to do throughout this is to be consistent. And my concern with the amendment is that we would be going for a level of specificity with the council and especially particularly with relations between council members'",
        "'speaker_2': 'that we do not have anywhere else in the proposed ordinance. And I think that's the way to go about this. And I agree it's very important is to work on the council's policies and procedures and training to reach the objectives that Council Member Lambert is wishing to have included.'",
        "'speaker_0': 'Councilmember Lambert, Thank you.'",
        "'speaker_2': 'I am very concerned about power differential with a staff member. I think it'd be very difficult for a staff member to say Councilmember X has whatever yelled at me, screamed at me, jumped up and down, giving me funny looks, turn green, whatever, because they work for us.'",
        "'speaker_2': 'And so they would come through either us or through H.R., through the county, if they felt that the processes here weren't working. But for council members, I think that we need to set the tone of good behavior and treat each other with respect and what we you know, what we say to our kids.'",
        "'speaker_2': 'And, you know, sometimes we give a greater example by what you do than what you say and hopefully what you do and what you say match. But when they don't match, then it's a very bad messages to our children or to anybody around us.'",
        "'speaker_2': 'And so I think that as we go forth and make our own policies, I think this is an aspect that is very touchy and something we haven't ever talked about before a very much. Although if you look upstairs, we at one point, Julia Patterson did the chart on the wall upstairs about how to treat each other nicely'",
        "'speaker_2': ', which has been there a long time. So I'm going to withhold this amendment for the fact that, as we do our own, this is a aspect that I think we need to include and that we also need to make sure that our employees know that we intend to model the very best behavior and not allow things to'",
        "'speaker_2': 'continue that could be swept under the rug in the past.'",
        "'speaker_0': 'Are you withdrawing Amendment One?'",
        "'speaker_2': 'I am.'",
        "'speaker_0': 'All right. That's withdrawn. Are there any other amendments council member made?'",
        "'speaker_2': 'Just as a final comment, I everything you just said, I agree with and support and will work on. As we move forward to our Council proposal, I commit to working on getting to a place that acknowledges all of those realities that you just outlined.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Very good. Thank you. Councilmember Caldwell. So I'm sorry, are there any other amendments? No. All right. Councilmember Cole Wells.'",
        "'speaker_2': 'Thank you, Mr. Chair. In speaking in support of the striking amendment, I would like to just bring out a few things that I think are really critical. First of all, thank you to all the staff and all of the H.R. just across the board.'",
        "'speaker_2': 'It's been a very productive process that we've been going through for the last six months. But secondly, I think it's really critical that we bring up our whole county, including our council policies and procedures relating to harassment, discrimination, sexual harassment and inappropriate conduct, which would be new in this case.'",
        "'speaker_2': 'We have to modernize what we have in place, which has been good but has not been adequate to really achieve what we all want. And that is a welcoming work environment where people feel as though they can thrive in a safe and an equitable, a respectful and inclusive environment.'",
        "'speaker_2': 'And we know that people across the country. In government entities as well as in the private workforce, are reluctant to come up to report discrimination and harassment and inappropriate conduct. And I want to make sure that we're not dealing with the abstract here.'",
        "'speaker_2': 'We have good policies, but if they're not ones in which people feel comfortable coming forward, then we are having effects on individuals that can be mental, they can be physical, they can result in economic difficulties if they feel like they have to resign.'",
        "'speaker_2': 'And so my main effort here has been to make sure we have something that works that. We don't have a workforce here that is reluctant to come forward. We are the best county in the state. And I believe with this amendment, with this ordinance, if it is indeed approved by the Council, we will go a long way'",
        "'speaker_2': 'in making sure that we have the most productive workforce and that we value our employees as they should. We need policies and procedures that are easily understandable, that don't result in people trying to read them in their eyes, glaze over because, you know, it's like they just don't even want to continue reading that they feel comfortable and'",
        "'speaker_2': 'all the King County reflects and what we want to have happen. This would result in some cultural change, but it's needed and we will all be better for it. Thank you, Mr. Chairman.'",
        "'speaker_0': 'Councilman Coles, thank you for your impressive leadership on this issue, and the amount of work that you've invested in is very impressive given the time. I'd ask that the clerk call the roll on this. I'm sorry. All in favor of the strike amendment.'",
        "'speaker_0': 'Say I am opposed. That carries. And as they turn to the underlying ordinance as amended, I ask the clerk to call the wrong.'",
        "'speaker_4': 'Thank you, Mr. Chair.'",
        "'speaker_2': 'Councilmember Belted. Councilmember Dunn. Councilmember Garza. Councilmember Cornwell's Councilmember Lambert. Councilmember McDermott. Hi, Councilmember of the Grove. Councilmember one right there. Mr. Chair. Hello, Mr. Chair. The vote is seven. Eisner's no nos. Two. Excused.'",
        "'speaker_0': 'All right, we'll advance that to the full council. Does it does it need to be or can it be expedited? We'd like to expedite it.'",
        "'speaker_4': 'It can be expedited. That is your policy decision.'",
        "'speaker_0': 'Would you like to do that, Councilman? Also, let's expedite it and we'll have it on the regular calendar so it can be spoken to with my colleagues permission, if you will. There's one more item that the waste our Truman Division would really like to get addressed today.'"
    ],
    "AN ORDINANCE relating to the sale of biomethane and related environmental attributes held by the county; authorizing an amendment to an agreement approved under Ordinance 18363 and amended under Ordinance 18439, for the sale and purchase of biomethane and environmental attributes associated with purified biomethane produced at the South wastewater treatment plant to IGI Resources, Inc.": [
        "'speaker_0': 'I think we can do it in 4 minutes. Mr. REED 4 minutes. We went a little long on the charter review, and this is with respect to our environmental attributes legislation which the Council has adopted before. And I think we've got a fine tuning ordinance.'",
        "'speaker_1': 'Yeah, very much so. Thank you, Mr. Chair. I will be brief. So this is 2013 0230. You will recall that in 2016 you approved two pieces of legislation. First, that authorized the well that authorized the sale of bio gas from the South Premium Plant to II resources, and it also authorized the sale of environmental credits which are'",
        "'speaker_1': 'associated with the bio gas. These credits are created under the Federal Energy Independence Security Act. Under that act, EPA used to authorize credits to generators of alternative fuels that are used in the nation's fuel supply. So in this case, Air Resources, which is an affiliate of BP products, North America, would purchase the fuel and the environmental credits'",
        "'speaker_1': 'in 2016. The council actually approved two pieces of legislation. The first would have approved would approve the sale of the bio gas and the environmental credits. The second, because there was going to be a waiting period during which an EPA registration process to authorize county participation in this market would be required and the legislation allowed for storage'",
        "'speaker_1': 'of the bio gas during that registration period. So the EPA approval process did go forward. Approval came in August of 2017 and the sale to IEI went forward. The county realized actually $629,000 for the bio gas purchase. A portion of the sale realized $5.6 million up for of the environmental credits piece.'",
        "'speaker_1': 'So since that time, county attorneys and AGL attorneys have been communicating and I identified a number of changes needed to the legislation.'",
        "'speaker_0': 'They are those changes I'm going to jump in here are listed on pages 233 and 234 of the staff report. That's too numerous to list here. Morally, right?'",
        "'speaker_1': 'That's true. All right. But I will quickly note, Mr. Chair, that that is a striker. I, I have to apologize. I got that. The request for your sponsorship for the Stryker to you quite late. And so as I understand, you are considering not acting on the Stryker this morning.'",
        "'speaker_0': 'No, I. I'm happy to do that. I thought we had advanced this on the consent agenda when I spoke to you in the meeting here. So I thought it was too late to do the Stryker, but I'm happy if the peo and department, you know, it's fine to further refine it.'",
        "'speaker_0': 'Right. So we're short on time. Okay. Is the committee willing to advance this? Yeah, it can be subject to signature. Is the committee willing to advance this on a regular calendar, which I understand is basically a contract clean up?'",
        "'speaker_0': 'The legislation? That's correct. Councilmember Lambert.'",
        "'speaker_2': 'So, yeah.'",
        "'speaker_0': 'We can do without recommend.'",
        "'speaker_2': 'Yeah, I think so. I just wanted to make sure that that I'm reading this correctly, that this is an existing contract where they pick up our gas from rent and treatment plant.'",
        "'speaker_1': 'That's correct. It's gas and environmental credits that are created under VICE, which is the Federal Energy Security Act.'",
        "'speaker_2': 'So there's an I have no problems with the contract. There are some issues with that. And as far as the leachate and stuff that's coming and some of the gas issues that we can talk about that another time.'",
        "'speaker_2': 'So I'm okay with doing that, that recommendation.'",
        "'speaker_0': 'Does this change the fundamental economic return to the county on this contract there? Is there a major change in the economic benefit to King County? Because we spent a lot of time looking at this before.'",
        "'speaker_1': 'It does and it basically extends the process that's in place. I will will note that there had been contemplation of an actually increase in the environmental credits revenue that has been pulled back through the striking amendment force, which I could go into.'",
        "'speaker_1': 'But I don't want to unless you ask me to.'",
        "'speaker_0': 'Just for our department. Could I ask colleagues that we advance this without recommendation to full council on the regular schedule? And I understand that we've had a very limited time here, and people may want to look into it a little bit more.'",
        "'speaker_0': 'Councilmember Lambert, would you be willing to put them on force without recommendation? 2018 230.'",
        "'speaker_2': 'Thank you. I'd like to propose ordinance 2018 0230. Whether you pass out is Iraq without recommending that recommendation?'",
        "'speaker_0': 'And would you be willing to offer the striking amendment?'",
        "'speaker_2': 'I would be happy to. I'd like to move a Stryker amendment, number.'",
        "'speaker_0': 'One S-1, all in favor of S-1, making technical and legal changes, say I. Any oppose that's approved, ask the clerk to call the underlying ordinance roll call. This is without recommendation.'",
        "'speaker_2': 'Thank you, Mr. Chair. Councilmember Banducci. Councilmember Dunn. Councilmember Gossett, Councilmember Qual. Councilmember Lambert. Councilmember McDermott, councilmember of the grove.'",
        "'speaker_1': 'Does not have the votes. I.'",
        "'speaker_2': 'Councilmember von Richter. Mr. Chair. Mr. Chair, the vote has five eyes. No nos.'",
        "'speaker_0': 'Right. We've given a a. We've advanced that legislation with that recommendation to the full council on the regular schedule. And Councilmember Lambert has a question.'",
        "'speaker_2': 'To I just want to check item number six, which was earlier today, the tentative Cedar Hill. Yes, that was on our consent calendar.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Are you putting that on consent for the full council or is that going to go regular?'",
        "'speaker_0': 'We did advance that on consent. So if you wanted to pull it off at the full council to discuss that, you would want to do that.'",
        "'speaker_2': 'Well, maybe if they could talk to me beforehand, because the tonnage that's on here is considerably less than the tonnage that we have had. Okay. So I was just wondering why the numbers were different.'",
        "'speaker_0': 'We had Pat McLaughlin and a couple other folks from Solid Waste here for that item, but we did move it out early in the meeting. So I think, Erin, I'll get you answers.'"
    ]
}