{
    "AN ORDINANCE relating to planning and permitting; amending Ordinance 1888, Article III, Section 5, as amended, and K.C.C. 6.01.150, Ordinance 10870, Section 334, as amended, and K.C.C. 21A.08.070, Ordinance 10870, Section 335, as amended, and K.C.C. 21A.08.080, Ordinance 10870, Section 336, as amended, and K.C.C. 21A.08.090, Ordinance 10870, Section 407, as amended, and K.C.C. 21A.18.030, Ordinance 10870, Section 536, as amended, and K.C.C. 21A.30.080, Ordinance 15606, Section 20, as amended, and K.C.C. 21A.30.085, Ordinance 10870, Section 537, as amended, and K.C.C. 21A.30.090, Ordinance 10870, Section 547, as amended, and K.C.C. 21A.32.100, Ordinance 10870, Section 548, as amended, and K.C.C. 21A.32.110, Ordinance 10870, Section 549, as amended, and K.C.C. 21A.32.120, Ordinance 17485, Section 43, and K.C.C. 21A.38.260 and Ordinance 13623, Section 37, as amended, and K.C.C. 23.32.010, adding new sections to K.C.C. chapter 21A.06, adding a new section to K.C.C. chapter 21A.55, adding a new chapter to K.C.C. Title 6, repealing Ordinance 15974, Section 5, and K.C.C. 21A.06.1427 and pre": [
        "'speaker_0': 'The August 19th minister before us see no discussion. All those in favor. Please say I oppose. Nay, the ayes have it. Minutes were approved. That takes us to the last item on today's agenda. An update to the counties development regulations regarding wineries, breweries and distilleries will take public comment on this item.'",
        "'speaker_0': 'We have 25 people signed up to testify. I will ask you to limit your testimony to one minute each, and when I call your name, I'll try to call about three people at a time. You're welcome to approach either podium.'",
        "'speaker_0': 'The same rules apply that applied earlier to not campaign for or against any one or any ballot measure and to avoid obscene speech. With that, I will apologize in advance for any mispronunciations. And we'll begin with Susan, Bernie Sanders, Ryan Ervin and Dominique Jorgensen.'",
        "'speaker_1': 'Shall I go ahead and start?'",
        "'speaker_0': 'Yes, go ahead.'",
        "'speaker_1': 'I'm Susan Bounty Sanders. My remarks today should be taken as those of me individually, not in my role as one big city council members. I want to thank you for the fixes so far in Councilmember Bell due to strike.'",
        "'speaker_1': 'That's presented today, but I urge you to go farther in your fixes. The goal, as I see it, is to preserve irreplaceable agricultural land and to honor the Growth Management Act and to make that that urban growth boundary as bright a line as possible, rather than eroding the urban growth boundary.'",
        "'speaker_1': 'Wherever you see someone or interact with a landowner that you like, rather than making.'",
        "'speaker_6': 'Your.'",
        "'speaker_1': 'Decisions based on the public policy questions and the specific fixes that I would ask for are first, eliminate overlay. A second, sharpen up the definition of winery so that it is not prone to abuse. And third, I remove the provisions that grandfather people who are currently in violation.'",
        "'speaker_1': 'These problems still leave the door open for land speculation and environmental degradation, and that's why I'm asking for their removal. Thank you very much.'",
        "'speaker_3': 'You have your own Ron Irving of Fashion Winery, and I'm here to support the amendment to the ordinance. And I'll make it short. I wanted to tell you some of my background and I maybe have enough time, but there are a couple of great exceptions and I worked on both of them.'",
        "'speaker_3': 'The Pike Place Market is historic district from the city of Seattle, Seattle, and work with the Pike Development Authority and also in 1976, the Save the Farm Lands. And both of those have been really critical too, to us.'",
        "'speaker_3': 'Vachon is very unique and right now we're struggling with people coming over because it is so unique. And and I think that I hope that you can see that and making an exception will work and it'll keep me in business.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And following don't Dominique will be then it's but it's going below. Melissa Earle and Cliff Otis.'",
        "'speaker_6': 'This striker is still terrible. We should all be ashamed of King County, of how bad, how corrupt, how inept and discriminatory our whole system is, especially permitting businesses like ours have been claimed as being harmful to the environment.'",
        "'speaker_6': 'You know, King County's lack of good infrastructure has left billions of gallons of raw sewage dumping into Puget Sound over the last three years alone, yet were the ones that are claimed to be damaging the environment. We don't have good infrastructure, period.'",
        "'speaker_6': 'Yet you're pushing for rural businesses to go into urban where you can't even support who is already there. I am so ashamed of our county and flabbergasted that it can be so blatantly hypocritical. I honestly believe if Dr. Martin Luther King were here today, he would be ashamed to have his name associated with this county.'",
        "'speaker_6': 'We all have a dream. We won't be able to live equally, be successful, and be able to enjoy family, friends and life itself. Well, this is not a dream. This is a nightmare. And King County has nobody to blame but themselves for the issues we have today.'",
        "'speaker_6': 'Issues like this are exactly what people hate. King County. We're the worst county in supporting agriculture, local business and residents. We have no accountability. We have no recourse. We are wrong and we have no recourse. When permitting doesn't follow their own code as WDM or even state law, the current Stryker breaks multiple state laws now, sir, to'",
        "'speaker_6': 'be completely thrown out the window. You want accountability from the people. How do you start with the government? Have accountability first, this ordinance initiated from a study that represented only 0.0 1% of the entire unincorporated areas, yet then will blanket the other completely unrepresented 99.99%.'",
        "'speaker_6': 'Do you realize how ridiculous this doesn't results from such a minuscule area to affect everyone else. This would be like conducting a random medical drug study where after one person the results are in. So let's not take it to the rest of the population.'",
        "'speaker_0': 'Thank you. And I recognize that people perhaps came with expecting a longer amount of time to testify. If you have written testimony, by all means you can provide it to our clerk and copies will be made and distributed to all of us.'",
        "'speaker_0': 'Good afternoon.'",
        "'speaker_3': 'Afternoon. My name is Dan Scrambler and I'm an owner of Horse and Brewery. Just wanted to let everyone know. Four agricultural farms throughout Kent Valley in 1882 1891, hops were planted throughout the entire valley. So we are completely agricultural businesses.'",
        "'speaker_3': 'But, you know, I have a real big problem with this grandfathering clause where it says, like, you have to be in compliance as of the date of the ordinance passes. Just that verbiage is against state law. And can you explain how difficult this is?'",
        "'speaker_3': 'We've spent over $20,000 to file a 1400 dollars permit and that it's just crazy how hard it is to get any sort of permit. When departments can't talk to each other functionally. So I just I it's really hard to make this ordinance better because it just started wrong and it really, I think it just to waste any'",
        "'speaker_3': 'more time, money and effort, it should just be thrown out. And if something needs to happen, it needs to start with the fresh start. Thank you. Thank you.'",
        "'speaker_1': 'Hello, counsel. My name is Melissa Earl and I'm.'",
        "'speaker_6': 'One of the owners of Lumber House Brewery in Hobart.'",
        "'speaker_1': 'I'd like to state for the record that our various parties have not been notified of these swift scheduled ordinance hearings from the beginning all the way to now. We've never been notified and we've put our information down.'",
        "'speaker_6': 'We've been told we were going to be communicated with.'",
        "'speaker_1': 'And we've never been told about these. And they always end up being really quickly dropped. And most people can't take off work to come here and do public testimony with a few days notice. The most recent version is not clear on grandfathering or vesting businesses.'",
        "'speaker_1': 'Please make sure to review vesting state law. We do not believe that this is in compliance with state law, nor.'",
        "'speaker_6': 'Is.'",
        "'speaker_1': 'Licensing the sale of alcohol, which again is only regulated by state and federal law. This ordinance proposes that we can make but not sell our products, which I don't think that's a very successful business model for us unincorporated breweries, which in turn has forced us to move our businesses.'",
        "'speaker_1': 'Actually, I had to separate mine, leaving my brewery in Hobart and taking part of it to Black in the city. Yeah, I came with a two minute long speech, I guess from a show of hands. Can anybody else in this room say majority?'",
        "'speaker_1': 'We don't support this ordinance. It was like that last time when we came here and did public testimony and most people here said they didn't support it. And I think that today we're pretty much in the same boat.'",
        "'speaker_0': 'Following Mr. Harris will be Paula Waters. Brianne Ebsen in any Magrath Hello.'",
        "'speaker_3': 'My name's Cliff Otis. I'm the owner of MATTHEWS Winery in Woodinville. So greetings. Several of the changes that have been identified in this Stryker will have a very negative impact on our ability to run our business and sustain our winter operations at the current location.'",
        "'speaker_3': 'Both the new 15% tasting room limit and the parking changes have really caught us off, you know, off guard and surprise. So we're we're suggesting that you guys just take a little bit more time, because structurally this doesn't make any sense.'",
        "'speaker_3': '15% of the tasting room space is not enough to run our business. And the parking, if you index that with the top, if you're having a tip for 150 people or 250 people we would have the most of at WB the two eight parking spots to be the three of 17.'",
        "'speaker_3': 'How are you supposed to do an event of 125 people or 250 people on eight parking spots and 17? If we don't change the parking stuff inside this to a minimum, you're going to have a mess because you're going to have people parking on arterials and side streets all over the county.'",
        "'speaker_3': 'And I don't think you want that. So really think through the structural pieces of this ordinance because there's some big deficiencies in it. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. I'm Paula Waters. I'm speaking today to you also as an.'",
        "'speaker_6': 'Individual, not as a city council member, and wouldn't vote in 2013. I ran for city.'",
        "'speaker_1': 'Council specifically to protect the valley.'",
        "'speaker_6': 'From the threat of annexation of parcels that was.'",
        "'speaker_1': 'Being considered by the city, parcels in the action being considered by the city council. At that time, we were able to forestall that threat. But regrettably, the threats now of land speculation and environmental and environmental degradation will not be solved, I believe.'",
        "'speaker_6': 'By this legislation, but perhaps even enshrined.'",
        "'speaker_2': 'So I get.'",
        "'speaker_6': 'It. We've been looking at this for a long time.'",
        "'speaker_1': 'It's very hard to manage competing interests. But I just want you to know that if this legislation gets passed as it is, I will be deeply disappointed. Thank you. Good afternoon, council members. My name is Amy McGrath and I'm the executive director of the Washington Brewers Guild, which represents the state's small and independent craft breweries.'",
        "'speaker_1': 'There are currently 400 breweries in our state and 111 of those breweries are located here in King County. We continue to have concerns regarding the proposed ordinance requirement that breweries obtain an adult beverage business license to be issued by the county, and the state would require or the stated reason for requiring this additional licenses so that the'",
        "'speaker_1': 'county can better track these businesses operating within unincorporated King County and then provide regulation for compliance. And the state already is required to notify the county if these businesses come up for a new brewery license or a renewal.'",
        "'speaker_1': 'And we're also required to do monthly reporting to the state on production and taxes paid. And so it's very easy to track active licenses further where we're concerned that the requirements attached to this license go into the territory of regulating the manufacture of beer in the state, which we believe is regulated by the state and the TTB'",
        "'speaker_1': 'at the federal level. We're very highly regulated and are concerned about the overall reaching precedent that this could have for other local jurisdictions that would implement their own licenses and their own enforcement structure for this very important business for our state.'",
        "'speaker_1': 'Thank you so much for your time and work on this.'",
        "'speaker_0': 'Thank you. Following Brian will be Barb, Larimer, Greg, Lill and Larry Savage.'",
        "'speaker_1': 'Hello.'",
        "'speaker_6': 'I am a resident of District seven.'",
        "'speaker_1': 'Of unincorporated King County. I'm pretty much here just to.'",
        "'speaker_6': 'Do my public testimony of loving my community and loving the brewery that is walking distance for my own residents and enjoying the the kind of sanctuary of having my neighbors being able to to relax after work and kind.'",
        "'speaker_1': 'Of get to meet your neighbors and.'",
        "'speaker_6': 'Stuff like that, as well as the agricultural.'",
        "'speaker_1': 'Affects of it as well, like the selling of eggs. Say you want to bake a cake, you can go to your neighbor and get some eggs.'",
        "'speaker_6': 'And I just think it's positive. I kind of industry in our.'",
        "'speaker_1': 'Small neighborhoods and like bring the community together and stuff like that. Yeah, I know. Is the whole thing.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'You the. Ah, Barb. Hi, I'm Barb Larimer, a longtime resident of King County, which I love and I'm attending today on behalf of Forager on Settlers. We are a Walla Walla based winery and operate three tasting rooms across the state.'",
        "'speaker_1': 'We've operated successfully in the Woodinville area for over six years, and our business is very dependent upon the ability to sell our product and access residents of King County. We are very pleased to see the renewed attention to this very important matter, and we thank you very much for your efforts.'",
        "'speaker_1': 'We respectfully request more time to review and clarify the questions concerning the latest proposed or amendment and how it impacts all of us at the wineries and tasting rooms in King County in particular, we'd like to have the opportunity to discuss some of our questions around parking requirements, event definitions and hours of operation.'",
        "'speaker_1': 'In general, some of us, many of us feel that the latest Stryker amendment has come together rather quickly without a lot of time for us to review and consistently provide input from all sides. And we'd like to ensure that there's sufficient time to review those prior to sending this amendment to the full council.'",
        "'speaker_1': 'Thanks very much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Hello. My name is Greg Lill and I'm the owner of a family. Owns a nearly ten acre parcel of property on the Windmill Redman Road that we call our family farm and we call Chateau Lill. We have been there since the early eighties, so we are a long time resident of the area.'",
        "'speaker_3': 'I also helped start the Little Cellars back in 1992, which I'm still part owner of, but we have moved that business to the old red hot facility to repurpose that because we needed more space and more room and we really didn't want to take away from the great pastoral kind of setting we have at our chateau in'",
        "'speaker_3': 'Woodinville because of the size of our property and the grounds we've been able to offer it for our customers. Our wine customers have special events, their birthday parties, celebrations, just lovely lunches in the gazebo. It's a it's a wonderful place to be.'",
        "'speaker_3': 'You know, so far I've been excited to see how the county council is working together and for really trying to solve these issues that we've had. You know, but to have this all of a sudden change as of late took us all, I think, a little bit by surprise.'",
        "'speaker_3': 'We'd like to see this worked on a little bit longer and come to some new resolutions that will change what we see in the strike agreement. Now, we hope that this will bring about a collaboration so we can still be our farm.'",
        "'speaker_3': 'We have alpaca, we have sheep, we have goats on our property. And if we were to be limited and could not do our events and continue on with our winery as we use it now, it probably would lead us to have to sell the property to a real estate developer, which is, by the way, less than we'",
        "'speaker_3': 'all want to see. So thank you.'",
        "'speaker_0': 'Thank you. Is there a Larry sandwich? I'm having trouble with the handwriting will admit. Following Larry will be Delia Darby, Patrick O'Connor and Darlene Dare not seen Larry. Larry have to deliver. The lower. There is privilege. Yes, that's exactly what's written here.'",
        "'speaker_0': 'I see it now. My name's Larry's privilege and the property owner of the cave winery tasting room. And over the A and another property overlay. I would you know, this has been going on for us for close to three years now since this came up.'",
        "'speaker_0': 'And I'm just asking for a little extra time since his stroke limit came to be. We need more time to understand what it is and seems like it's very, very enforcement oriented and we don't know what the rules are.'",
        "'speaker_0': 'There's question zero, how certain things can be enforced. As example, the outer space is limited to 500 square feet and we have half an acre there. If someone wanders off with a glass of wine outside to 500 feet away in violation, I don't understand exactly how that's being forced to just like a little more time so we'",
        "'speaker_0': 'can look at it, understand it, let you guys know how it's going to impact us so you guys can make a good decision on which way to vote.'",
        "'speaker_3': 'That's it. Thank you. Thanks.'",
        "'speaker_1': 'Hi, I'm Delaware Derby, and I'm representing the Castillo family, and I wish to acknowledge council member Val Dutchy for her recent work. But what happened to the work that was done from the Local Services Committee that was fully vetted and passed on March 11th?'",
        "'speaker_1': 'Out of that committee, I'm concerned that the new version language of requiring creche and for many could actually harm the APD and forcing development of industrial uses on rural land. It could negatively impact down gradient areas, and the 15% square footage and associated parking limitations are close to home occupation businesses, which are also proposed to be eliminated'",
        "'speaker_1': 'through the ordinance and would surely eliminate the existing small businesses. Is this the goal? I thought the goal was supporting burgeoning wine businesses and protecting the APD, and I'm a proponent for both. I think there's common ground in our shared love for agricultural land.'",
        "'speaker_1': 'Let's meet in the middle. Let's meet in that place by supporting the the March 11th version that was fully vetted and passed out of the local services committee. As Martin Luther King stated, we can make a way out of no way.'",
        "'speaker_1': 'So let's not reinvent the wheel. We need to get on with the business of restoring harmony to the Sammamish Valley and to King County. Thank you.'",
        "'speaker_3': 'Thank you. Hope ADAMS Patrick O'Connor I'm the farm manager at MATTHEWS Winery. In the past few years, a farms in the valley, both in the APD and in the buffer area. And I'm certainly an advocate for for more food production in the Valley and the current version of the Striker.'",
        "'speaker_3': 'I, I don't believe will necessarily have the intended effect of supporting agriculture in the valley if it especially some of the portions that they're acquiring the the products sold necessarily be have a percentage, you know, you know, from from the area.'",
        "'speaker_3': 'Because honestly, like a lot of the farmers there who grow fruit and flowers and and other products do with do do do bring in produce some other areas. And it's really important to have year round sales. So. And and really tasting rooms are not the most high impact land use.'",
        "'speaker_3': 'So I do think there there are ways to to have ethical water use and and not be polluting the farmland and and and for the majority of of the apt in in in Woodinville there there's drainage systems where so so so most of the runoff that come from Hollywood Hills and throughout go through the bio drainage.'",
        "'speaker_3': 'So it is a water quality issue for the salmon. But in terms of polluting the actual farmland, that's not it's not entirely accurate. So it's been presented as such. So, um, thank you.'",
        "'speaker_0': 'Thank you for following. Carla will be Laura Cherry, Sarah Wolsey and Cheryl Lovatt.'",
        "'speaker_1': 'Hi, council members. I'm Carla Da, the guest manager for MATTHEWS Winery. And its new version is the game changer. Several of these new proposals will strangle existing businesses and rural King County, including hours. Jobs will be lost, sales tax revenue will be lost.'",
        "'speaker_1': 'The whole farm to table culture that we have worked so diligently to create will be lost. You are potentially destroying a place the people flock to, a place to gather with friends and family, to talk about life and to celebrate life.'",
        "'speaker_1': 'Please carefully think this through before implementing ordinances that would be so detrimental to these existing businesses that may result in our closing our doors to employees and visitors alike. I strongly request that you not approved the revised strike or amendment as a minimum.'",
        "'speaker_1': 'Please take more time to assess its impact on these businesses and the community at large. Please work with existing businesses to find a balanced solution that both preserves the rural character of the area. The store fulfills our farm to table destiny and promotes Washington wines.'",
        "'speaker_1': 'Thank you. Cheryl had to go.'",
        "'speaker_6': 'Okay, now, my name is Laura Terry, and I'm the owner of Dragon's Head Cider on Passion Island. And today I'm here to voice support for the amendment that Councilmember McDermott has proposed to the ordinance. We're part of a community of farmers and beverage producers on Passion Island.'",
        "'speaker_6': 'There are five wineries with tasting rooms and several others that are small producers that don't have tasting rooms. When the county began looking at ways to remedy the issues in Sammamish Valley, most of us on vacation didn't believe that any ordinance changes or recommendations to the county council would have an impact on our businesses.'",
        "'speaker_6': 'After all, there were no stakeholders from Fashion Island ever involved in any of the conversations with the county as they developed recommendations for the ordinance. There was no analysis done on any aspect of the businesses or community on Fashion Island.'",
        "'speaker_6': 'So imagine our surprise when we learned that these ordinance changes would be applied to our businesses as well. None of our businesses have ever had any of the kind of complaints, environmental or traffic issues that we hear about in this mama's valley.'",
        "'speaker_6': 'And when it comes to the local alcohol beverage industry, fashion island is nothing like Sammamish Valley. Wineries on Bastion Island are integral to the community on the island. They contribute to the economy, a very fragile economy, in very special ways.'",
        "'speaker_6': 'Our tasting room visitors and wine club members, they visit our wineries and then they go into town and they eat in the restaurants and they shop in the stores. King County needs to find better ways to support small business development on Passion Island because of our very fragile economy and not shut down existing businesses or create more'",
        "'speaker_6': 'decline in the economic activity of our constrained community. Thank you.'",
        "'speaker_0': 'Thank you. Following server will be Bryce Yeadon, Chase Kilborn, followed by Janet Bryant.'",
        "'speaker_1': 'Hello. I'm Sarah Tankersley at I.'",
        "'speaker_6': 'Managed Police Winery on Vachon Island.'",
        "'speaker_1': 'There aren't more of us here today because we're getting our.'",
        "'speaker_6': 'Fruit in and we're.'",
        "'speaker_1': 'Making our beverages. But we're this is very important to us.'",
        "'speaker_6': 'Our company.'",
        "'speaker_1': 'Small. Very small. Five. Remember Wine Club? We've been around for 18 years as a cottage industry. If this ordinance passes without McDermott's proposed.'",
        "'speaker_6': 'Amendment, then we will have to shut down.'",
        "'speaker_1': 'There is no way that we can comply. There just isn't. We've been in operation for a long time. We're solid business, but there's just no way that we can do that. And when we shut down, that ripples out and.'",
        "'speaker_8': 'Affects.'",
        "'speaker_1': 'The economy of our island. It's a small ecosystem, very small. There are a limited number of businesses, and when one fails, the others fail. So I hope.'",
        "'speaker_6': 'That you will support Councilman McDermott's proposed amendment to Ordinance 20 1802.'",
        "'speaker_1': 'For one. Thank you.'",
        "'speaker_3': 'Chair, members of the committee Brazier Aden here today on behalf of feature wise.'",
        "'speaker_0': 'We'll start off by saying thank you.'",
        "'speaker_3': 'For the updated drafts by council member about.'",
        "'speaker_0': 'The issue. We think it's gone a long way in resolving most of our concerns that we've had it. It is a lot better than what we said during the last iteration and the.'",
        "'speaker_3': 'Last council hearing. I want to say thanks regarding the removal of demonstration area.'",
        "'speaker_0': 'Be including the.'",
        "'speaker_3': 'One acre limit on.'",
        "'speaker_0': 'Agricultural land. Those things are extremely important to my organization. I did want to point out a couple of things that we would like to see changed or tweaked a little bit. The first.'",
        "'speaker_3': 'Is allowing distilleries, these facilities, twos and threes in the rural.'",
        "'speaker_0': 'Area. We think a change could occur in which the majority of product could be found out of King County or the surrounding counties. And that would solve one of our issues that we have. The other one has to deal with Group B water systems.'",
        "'speaker_0': 'We know that three's was great.'",
        "'speaker_3': 'That threes.'",
        "'speaker_0': 'Must connect to a group A We think that that's important. We also think that that too should connect to a group as well. And I'm happy to take and help respond to any further questions after the hearing and would like to work with anybody else who.'",
        "'speaker_3': 'Needs further clarification of our comments.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_8': 'Hello. My name is Chase Killebrew and I work at Blue Lane, an engineering and land use planning consulting firm based in Kirkland. So we're Blue Line. I've been working with Matthew's Winery regarding proposed ordinance number 2018 0241 and helping them determine the potential effects of the proposed ordinance on their operations.'",
        "'speaker_8': 'Today, we would like to specifically address the draft striking amendments submitted by Council Member about Dewji ahead of today's meeting. The moment seems to contain a few conflicting standards for the newly defined Winery Brewery Distillery. Use this so we are seeking clarification for the WB, D2 and WB D3 users than the A&R reasons.'",
        "'speaker_8': 'Onsite tasting retail sales would only be allowed to occupy 15% employed area of the WB facility if a WB D2 is built to its maximum, a building size of 3500 square feet and only 525 square feet of the building would be allowed to be occupied by tasting rental sales.'",
        "'speaker_8': 'This would essentially make it with the new proposed parking standards the only minimum of five parking stalls required and the maximum allowed would be eight parking stalls. This number seems especially low and consider in conjunction with the proposed event standards with a temporary use permit, WPT to facilities would be allowed to host an event with a maximum'",
        "'speaker_8': 'of 125 guests. And, you know, it's just like they would have to either provide the parking on site or through a managed parking plan. And so that just doesn't seem to be feasible at this time. And then also the with only allowed 15% of the floor area to be dedicated to tasting retail sales.'",
        "'speaker_8': 'It's just like how would they be able to accommodate up to 125 guests? We just believes that with the maximum building size, maximum permitted service and setbacks, some of these might, such as a proposed parking standard and the tasting and retail sales space for minimum are just redundant.'",
        "'speaker_8': 'So we just we appreciate your guys effort and we hope that some of these things can be clarified before it's passed. Thank you.'",
        "'speaker_0': 'Janet will be followed by Mike Michael Tomasky, Barbara Lao and Serena Glover.'",
        "'speaker_1': 'Hi. I'm Janet Bryan with the State Winery. Once again, I'd like to thank the council for sharing an incredible amount of information and input on this issue. The issues are complex, and each of us in this room has a different have different interests and desires.'",
        "'speaker_1': 'Our cave B tasting room is an overlay we learned of the new Stryker last week and are still working to understand all the details as it applies to tasting rooms. I'm here asking that you give us a little more time to fully review and comment on the newest proposal.'",
        "'speaker_1': 'After learning of the Stryker last week, I attended the town meeting in Warrenville last Wednesday evening. A lot of information about unincorporated King County was provided, and during the question and answer period I became concerned about the permitting piece as it might apply to our tasting room.'",
        "'speaker_1': 'I would ask that the new tasting room regulations, when they become final, that they so that the information associated with those with that is made available to us clearly, so that we know our expectations and limitations. We want to comply and avoid violation.'",
        "'speaker_1': 'The concern is that without clearly understood definitions, mistakes happen and our business wants to continue in its current location. We want to get along with our neighbors, comply with the rules, and sell our products. We need to know the details and definitions of what's expected of us so we can be successful.'",
        "'speaker_1': 'Anyway, I'll just cut it short to say that we continue to be a family friendly business. We're quiet. We have. We've always operated within the recommended business hours that are now within the proposal. And this winery proposal has been a challenging one for all of us.'",
        "'speaker_1': 'And we thank you all for your hard work and continuing to listen to all the stakeholders.'",
        "'speaker_3': 'Thank you. Hello, I'm Michael Tankersley. And over a quarter century ago, when I moved into the rural area of King County, no knowing nothing about most of these issues. But at that time, wineries, breweries, distilleries were not legal in the rural area at all.'",
        "'speaker_3': 'And so 20 years ago and we worked and supported the ordinances that began to allow these here, we did think this was a great idea and the vision was boutique wineries. Obviously, there's a bunch of limitations on how big these could be for reasons you and I tend to go into here.'",
        "'speaker_3': 'We had a vision of that and we supported it. Perhaps we opened a Pandora's box in the first time because you know that this seems to be a bit of a mess. However, I think there's some things we agree on.'",
        "'speaker_3': '20 year old ordinance needs some upgrading for sure. And also we really need to get past this issue. There's so many things we all need to work on. This is a deeply flawed ordinance still, and I think it's sad that you guys were saddled with this.'",
        "'speaker_3': 'The way it was written from executive in the first place was and such a surprise. Goodell and his staff have been really good on most of these issues. You guys were handed a real bad piece of ordinance and it's really gotten only more complex.'",
        "'speaker_3': 'The fact that it's so hard for you to understand is kind of evidence right up front that this is deeply flawed. It should be simplified, clarified, and the loopholes should be removed from it. That let us stick with the original vision of Yes, we can have boutique wineries in the rural area without compromising our neighborhoods, our farmlands'",
        "'speaker_3': 'and and keeping the urban sprawl from spreading across rural King County. So I hope we can stretch out this suddenly very accelerated schedule on this a little bit. But hopefully we can also get past it because there's lots of other things we need to work on in the rural areas as well as your urban areas.'",
        "'speaker_3': 'Thank you. Thank you.'",
        "'speaker_1': 'Ha. Hi, my name is Barbara Lyall and I'm a surface water hydrologist and a representative from Climate Reality. And this latest version of the ordinance still does not protect our farms or rural areas from environmental degradation in land speculation on Friday, people around the world will be striking because of the climate emergency.'",
        "'speaker_1': 'You'll be asked on September 25th a vote for a climate emergency in King County and the farmers in Sammamish Valley are really feeling it. The corn, the squash crop failed this year because of blossom timing versus bees versus versus whether this corn was grown on Harvey's land, which I gave Claudia before last year.'",
        "'speaker_1': 'It's still delicious. But he grows his corn right below a grassy slope where 200 cars park on every event. That grass slope has car grease, oil, all that stuff going on onto his property, into the soil, into the sammamish valley, sammamish river where our orcas depend on it.'",
        "'speaker_1': 'You need to strengthen our environmental protections and stop the degradation that the wine industry is providing here. And they don't need their support. Your children and grandchildren need the support they will need to eat. We need to keep this land for them, for the future because.'",
        "'speaker_0': 'And soon Serena will be followed by Jo Chan.'",
        "'speaker_2': 'Hi. Serena Glover, executive director, Friends of Some Average Valley. There have been some positive changes in this new striker, but there's still two very serious flaws. The key issue here is not about real wineries brews the stories.'",
        "'speaker_1': 'That make product. Those are all in eastern Washington or in the urban areas. This is about where these.'",
        "'speaker_2': 'Businesses put.'",
        "'speaker_1': 'Their retail outlets. The ordinance is seriously.'",
        "'speaker_2': 'Flawed in two ways. The first is they put these retail outlets in demonstration project overlay.'",
        "'speaker_1': 'It rewards five of our eight Sammamish Valley violators and opens another eight new.'",
        "'speaker_2': 'Parcels to.'",
        "'speaker_1': 'Urban use development. The second problem with the ordinance.'",
        "'speaker_2': 'As we still have.'",
        "'speaker_1': 'Opaque definitions of would be these that are riddled with loopholes and it will allow these sham bids to really operate as retail outlets in the rural area.'",
        "'speaker_2': 'These urban uses cause two huge problems for the farmland in the watershed.'",
        "'speaker_1': 'The first is toxic runoff. You've heard a lot about this already. The second is land price speculation.'",
        "'speaker_2': 'You've also heard a ton about that.'",
        "'speaker_1': 'And it's getting worse, not better. And so any ordinance that skirts.'",
        "'speaker_2': 'The.'",
        "'speaker_1': 'GMA rewards the violators is only going to.'",
        "'speaker_2': 'Increase speculation.'",
        "'speaker_1': 'Increase environmental.'",
        "'speaker_2': 'Degradation.'",
        "'speaker_1': 'And create more public.'",
        "'speaker_2': 'Health and safety issues. And because of that.'",
        "'speaker_1': 'We will fully challenge any ordinance that violates GMA and allows these urban use businesses in the rural area of the Sammamish Valley. It's only two miles long and one mile wide, and it cannot.'",
        "'speaker_2': 'Take.'",
        "'speaker_1': 'This kind of development if you want to preserve the farmland and the watershed. Thank you.'",
        "'speaker_8': 'Thank you, cousin members. My name is Joseph Chan, I. I live right in the valley of Sammamish. For a long, long time. I'm here to bargain for the essential right for life. And I'm begging for a. Essential economic department.'",
        "'speaker_8': 'You know, any kind. I'm not just limited to the winery, but this winery, Jack. Too long. And it has a negative impact to my property and to property price increase, my property tax increase. And even the impact my exemption I heard was because of this ordinance.'",
        "'speaker_8': 'Please have an essential like the complain the introduction. The key point is that equity in other words have an equal opportunity of economy development, every essential development. So to me the concept is wider. You know, the niche of the valley is the tolerating anything related to have people enjoy life.'",
        "'speaker_8': 'I would encourage but anyway these these development the new striking whatever is winding here and there and getting worse. Thank you. Bet.'",
        "'speaker_0': 'Thank you. That includes the people who had signed up in advance. Is there anyone else present who would like to offer testimony? Anyone else who'd like to offer testimony, then we'll close the public hearing. And the issue before us is ordinance 2018 241.'",
        "'speaker_0': 'The Council has been working on this ordinance for more than a year. It was taken up first by the Local Services Regional Roads and Bridges Committee. When that committee finished its work, the legislation was sent to the full council where it was determined that more work was needed and that all nine of us should be involved in'",
        "'speaker_0': 'that work. And therefore it is before the committee of the whole at this time. Today we'll have a hearing, a hearing, a briefing from Aaron Osnes of Arts Council central staff on the legislation and amendments. And it's my hope we'd be ready to take action today.'",
        "'speaker_0': 'Ms.. Osnes.'",
        "'speaker_2': 'Sorry. Good afternoon. Aaron Austin's council staff. The materials for this item in your packet began on page 35, but we're not going to use it, so don't bother looking at it. You also have a larger supplemental packet that looks like this.'",
        "'speaker_2': 'This has the Stryker and other amendment materials. You also got public comments that were received today as a packet and a smaller amendment package that includes some amendments from Councilmember Lambert of the New Matrix. So again, the big packet, the center does have a bit of background in it, but I'm not going to go through it today'",
        "'speaker_2': 'unless you really want me to, except to say that my daughter is three years old and I was pregnant with her when the executive started this.'",
        "'speaker_3': 'One.'",
        "'speaker_1': 'Just to graduate from high school.'",
        "'speaker_2': 'I don't know.'",
        "'speaker_7': 'What does she think of this legislation?'",
        "'speaker_2': 'She would like me to drink less.'",
        "'speaker_0': 'And mommy to be home more. Yeah.'",
        "'speaker_2': 'So I'm going to go through what starts on the back page of the big supplemental packet. Your your copies have a purple column. So that's what you're looking for. This matrix is organized. It includes two columns. One is the legislation that came out of the Local Services Committee or version two.'",
        "'speaker_2': 'I'll refer to it either way. And then the purple column is what is in striking amendment S1 and I. The bigger subset of items are first and then there are several pages we probably won't get to. There just have more clarifying changes or tactical changes that we can answer questions about.'",
        "'speaker_2': 'So starting at the top of page two of your supplemental packet as recommended by the Local Services Committee, the ordinance would prohibit weeds, which is winery brewery distillery facilities and remote tasting rooms as home occupations and home industries.'",
        "'speaker_2': 'The version two of the legislation allowed for some grandfathering that gave these businesses one year to come into compliance with the zoning requirements for home occupations and home industries. In the striker S-1 there, the changes to that proposal include removing the 12 month period to come into compliance and replaces it with a 12 month period to demonstrate'",
        "'speaker_2': 'their previous compliance with the with the code as it exists today, but will no longer exist after it's adopted. If it is adopted. It also tighten some language to avoid unintended consequences and loopholes. And that removes the 12 month compliance period for home industries because those always require a conditioning instrument which are they don't have an ambassador'",
        "'speaker_2': 'application, they won't be able to arrest.'",
        "'speaker_0': 'Masters. What's the difference between a 12 month grandfathering period and 12 months to demonstrate the previous compliance?'",
        "'speaker_2': 'So under the S1 proposal, a business that is compliant today will have non-conforming status. They have a year to prove that they were conforming on that day versus what's in version two is they get a year to come into compliance with what is in the code today.'",
        "'speaker_2': 'That makes sense. Okay. Next item, the business license version two carries forward the exact proposal to require an adult beverage business license for all production facilities and remote tasting rooms as well as non-conforming home occupations. The. S1 adds language requiring existing businesses attempting to demonstrate that past compliance by submitting some documentation with their first business license.'",
        "'speaker_2': 'It allows a single six month county business license to be issued to such existing businesses that are demonstrating their compliance. It would be extended for an additional six month without charge if they have demonstrated they were making substantial progress to prove their compliance and then subsequent county business licenses would not be issued unless that they have demonstrated'",
        "'speaker_2': 'their legal nonconforming status. They have again made substantial steps to prove compliance or they comply with the zoning regulations that are in the proposal. And it also adds a provision so that the permitting division can deny a business license if they do not, if the business does not comply with the zoning code and modifies the appeal period'",
        "'speaker_2': 'for the license to provide consistency with other types of zoning appeals. Moving onto page three of the packet, page three.'",
        "'speaker_7': 'Questions, Mr. Chair, as we go on. Yes. On point questions.'",
        "'speaker_0': 'Yes. Council Member Debates.'",
        "'speaker_7': 'Thank you, Mr.. I'm sorry, I don't know this, but does the county require, like many cities, a general business license today?'",
        "'speaker_2': 'No.'",
        "'speaker_3': 'All right.'",
        "'speaker_2': 'We require some business licenses, mostly for tracking purposes, but also have some dependent.'",
        "'speaker_7': 'Is it just industry specific?'",
        "'speaker_2': 'Thank you. Okay. The next item on packet page three. There is one demonstration project now proposed by this ordinance. It is a remote tasting room demonstration. Demonstration project. A I'm not going to go through every single specific item on the left side, but I will talk about the changes.'",
        "'speaker_2': 'The striker would clarify the purpose statement and the business license requirements. It would eliminate the fashion rural town, CB zoning and the fall city rural town CB zoning from the demonstration projects and instead would make permanent zoning modifications to allow remote tasting rooms in the S.B. zones of Vachon Rural Town and Falsity Rural Town.'",
        "'speaker_2': 'It also clarifies the limitation on events, which is two per year maximum of 50 guests. No two permit required for is for all proprietors of a single site within that demonstration project. It also makes some substance substantive changes to the evaluation language.'",
        "'speaker_2': 'That was done in consultation and coordination with the executive staff to make it a little bit more manageable. Going on the next page. Page four of the.'",
        "'speaker_7': 'Mr. Terror.'",
        "'speaker_2': 'Packet went to.'",
        "'speaker_0': 'The mosque.'",
        "'speaker_7': 'I think you I don't know if this is appropriate for central staff is going over a factual assessment or or summary. But could could you help me understand with respect to the changes there on the rural town centers?'",
        "'speaker_7': 'What what's the rationale for.'",
        "'speaker_2': 'For taking them out? Yeah. So. The. Remote tasting rooms are being added to the permitted use tables for the first time. That wasn't a use in the code before. So since. It is a new use and the piece of explanation or adios for the falsity investment in real town list specific uses out.'",
        "'speaker_2': 'It was its added to those users to be consistent with the underlying zoning for the rest of the county for those for the KB Zone. Mr. Chair.'",
        "'speaker_0': 'Councilmember Bell.'",
        "'speaker_6': 'Maybe since the question went to the reason for the including this, I could just say a word. The idea was that in the previous versions, I think all of them Vachon Town Center and Falsity Town Center were included as part of what's called overlay a as a demonstration area.'",
        "'speaker_6': 'And because these are real town centers with businesses in them, like including bars and things like that, it seemed like it wasn't really a major change to the area to allow tasting rooms in those areas. So we just went ahead and made it a permitted use instead of having it be part of a demonstration project.'",
        "'speaker_1': 'I hope that was.'",
        "'speaker_7': 'Very helpful thing.'",
        "'speaker_2': 'Okay. Going to a packet page for the version to the legislation included a second demonstration project, which was special events demonstration and Project B, the S-1 removes that from the ordinance. Moving on to page six. There is an additional efficacy evaluation that is in version two.'",
        "'speaker_2': 'The Stryker makes modifications to that efficacy evaluation, remove some of the requirements that had been in there before and then add some requirements for evaluation of the regulations on existing businesses and recommended code changes on a number of the development regulations and then ties the public comment period and transmittal of that final report with the one required'",
        "'speaker_2': 'for the demonstration project. Okay. Turning on page seven is the development condition modifications that are proposed by the striker. If I go too fast, just slow me down. These are also spelled out more clearly in the tables below, but I'm not going to go through each table individually.'",
        "'speaker_2': 'So the substantive changes to the permitted use tables and the development conditions associated with them in the striker include eliminating facility ones in the agricultural zone as an interim use, so the smallest facilities would not be allowed in the zone.'",
        "'speaker_2': 'It eliminates the allowance for 8000 square feet of underground storage for facility threes, both in a and free zone. So the maximum size for those facilities would be 8000 square feet total. For all facilities in the A and R zones.'",
        "'speaker_2': 'It limits impervious surface to a maximum of 25% or whatever the underlying zoning allows, whichever is less. It requires facility threes and the agricultural in our zones to connect to a group, a water system, eliminating the option to connect to a group B water system.'",
        "'speaker_2': 'For facility ones in the rural area zone. It prohibits onsite testing and retail sales. For facility twos and threes in their a an hour zone. It limits onsite tasting and retail sales to 15% of the aggregated floor area for facility twos and threes in the zone, it limits conversion of agricultural land to less than one acre for'",
        "'speaker_2': 'nonagricultural accessory uses for all facilities in a no zones, it requires one. The version two requires at least two phases of production to occur on site. This goes further and says that one of those phases has to be either crushing, fermenting or distilling.'",
        "'speaker_2': 'For our facilities, it removes the option to reduce the setback from rural area and residential zones with a C up to 25 feet. So the setback would be 75 feet in such instances, four facility ones in the RC zone.'",
        "'speaker_2': 'It allows once one onsite parking stall for the use. It eliminates a provision that had been added into version two that would allow for some grandfathering of existing parking spaces and then for facilities, twos and threes in a and ARI zones that modifies the maximum parking to 150% of the minimum required.'",
        "'speaker_7': 'I have another.'",
        "'speaker_3': 'Thing.'",
        "'speaker_7': 'Mr. Chair, another kind of reason question if that's okay. And with respect to the WB, D1 is also the smallest of the three, right. In terms of their production. Could could someone help me understand the philosophical reason or the land use rationale?'",
        "'speaker_7': 'Maybe to put it in central staff terms for discouraging, if I'm reading this correctly, the small facilities on the ag lands. What's what's.'",
        "'speaker_2': 'The. I'll speak to what happened. And then I read that he can take over the exact.'",
        "'speaker_7': 'As opposed to the big ones, which would seem to be.'",
        "'speaker_2': 'Permitted. The executives transmittal did not include the facility ones in the ASM. The version two added an interim facility. One use in the ASN. They would have had to go away or convert to a facility to within five years.'",
        "'speaker_2': 'And I'll speak to Councilman Bolden to speak to why the Hershiser takes it out. But so this goes back to what the executive proposed.'",
        "'speaker_6': 'Just another word on the executive proposal here. One of the big challenges with current code and with enforcement of current code is the home occupations. And it's just really hard to do fact finding around what is truly a home occupation versus what is not.'",
        "'speaker_6': 'And so our understanding from the Department was that a big part of the WB ones was a sort of a replacement for home occupations to be better defined and better able to be managed. And I see a little nodding.'",
        "'speaker_6': 'So that makes me feel better because I'm speaking to their rationale, the idea for and those were never proposed to be allowed in the ag zones. That would have been an expansion of uses from what we currently have.'",
        "'speaker_6': 'The idea for having the WB ones in the ag zones was as an incentive, if you will, for farmers. Those of you who who represent farmers or know about farming know that the challenge of making a living as a farmer is such these days that many of them are branching out into side businesses or to other activities'",
        "'speaker_6': 'in order to support their farms. And so the idea was that if you could try out the sales of something before you had to commit your fields to growing the necessary crops, you could discover whether it was financially viable and then commit your fields to growing.'",
        "'speaker_6': 'And it was a way of giving farmers a step up into a new business, if you will. When we proposed this as part of the combined striker last time at Local Services, after that went public, I have to say there was not a single person who expressed any support for this idea.'",
        "'speaker_6': 'Farmers didn't like it, businesses didn't see any need for it, it just didn't do anything. And some people thought that it was a foot in the door to really expanding commercial uses in the ag zones. And that's why I proposed taking it out, because it didn't solve anything for anybody that I heard from.'",
        "'speaker_6': 'If there's somebody listening now who thinks it solves something, please let me know. But I haven't heard from anybody like that, and it did cause concerns from people who cared about the ag zone. So I just took it out.'",
        "'speaker_2': 'Think that the thing else that Christine wanted me to mention is that the current code requires that 60% of the products be grown in Puget Sound counties for the A zone, it's proposed to be changed to 60% grown on site.'",
        "'speaker_2': 'So the facility ones would have a maintained that Puget Sound counties it was a as because member mentioned it it was kind of like a starting point for those smaller facilities.'",
        "'speaker_6': 'Can I also say the other thing we heard the thing we I heard from farmers, they actually and I asked I said, why doesn't this do anything for you? And what we heard was it takes a lot longer than five years to establish a crop big enough and in a sustainable enough way to be able to really'",
        "'speaker_6': 'rely on it as your business crop. And so to just say, here's five years, see if you can grow enough wheat to have a brewery. Right. Wasn't. It wasn't helpful. It was an attempt to be helpful. It didn't hit the mark.'",
        "'speaker_6': 'And so we backed away.'",
        "'speaker_2': 'That's all I was going to present on so I can take questions or speak to the line amendments if you like.'",
        "'speaker_0': 'Questions on the striker is striker from committee or the striker before us. The striker would be proposed today by Councilmember Balducci. What would members find helpful to continue discussion of the line amendments to take up the ordinance line amendments?'",
        "'speaker_0': 'Let's brief on the amendments.'",
        "'speaker_2': 'So now we're going to go to the smaller packet. There's some odd numbering here just because of how amendments became public today. So bear with me. 0.18 would remove the 15% square footage limitation for onsite tasting and retail sales of products for facility twos and threes in the eight and ARI zones.'",
        "'speaker_2': 'A moment 0.2 B for all facilities for properties that do not about an agricultural zone. It would add the option to reduce the 75 foot setback from residential and rural areas on properties to 25 feet, with a signatory as permit and with screening.'",
        "'speaker_2': 'Amendment one.'",
        "'speaker_0': 'A Before we question about the amendment, Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I'm not sure that everybody both here and the listening audience understands what a conditional use permit is, how much time it takes, and what the cost is. So if you could give a little conditional use permit one on one, that would be helpful.'",
        "'speaker_2': 'We'd have Johnny pull it up. It is a type two land use permit, so it requires public notice, environmental review and it a written decision by the permitting division. It is appealable to the hearings, amateur and then to superior court.'",
        "'speaker_0': 'And as an Internet.'",
        "'speaker_1': 'What is Mr. Adobe?'",
        "'speaker_2': 'Well, I.'",
        "'speaker_1': 'Think.'",
        "'speaker_0': 'You did great. You did? That's what I'm saying. Needs Internet. Who needs to look something up? You just did that.'",
        "'speaker_2': 'I think it costs somewhere between six and $8,000, depending on what they use it and how.'",
        "'speaker_1': 'Long it usually take.'",
        "'speaker_2': 'I don't know. Yeah, it really depends.'",
        "'speaker_1': 'I have an answer sitting in that back corner I saw, but I don't library very well.'",
        "'speaker_2': '62 months. Six, 6 to 12 months.'",
        "'speaker_1': 'Sometimes it feels like 62, so it was 6 to 12 months and could be 6 to $8000. So this is not something that is willy nilly. And I think it's important for people to understand that this is this is a process, not a crackerjack.'",
        "'speaker_1': 'I got it in the cracker jack box and I got it.'",
        "'speaker_2': 'Okay. Amendment one A would make some changes specific to Basho Mori Island only in the gray zone and only for facility two. It would for historic properties set the minimum lot area at two acres would allow up to 7000 square feet of aggregated floor area for historic properties would exempt existing businesses from the minimum lot size requirements'",
        "'speaker_2': 'from the arterial access requirements. And from the 75 foot setback, four from rural and residential zones also would remove the 15% square footage limitation on tasting and retail sales for that's for existing businesses and for historic properties only on Russian Maria Island.'",
        "'speaker_2': 'One, B, E and G are alternatives to one a. If the first two pass or don't pass a moment. Two would modify the minimum parking ratio for the tasting and retail areas of production facilities to one space per 150 square feet of tasting and retail area.'",
        "'speaker_2': 'And there is a tidal limit.'",
        "'speaker_0': 'So we would have a structure before us. We, as it was referred from for council, we have another striking amendment before us and then just one page of amendments.'",
        "'speaker_2': 'Yeah. You have a version to then a striking amendment. That's an 18 out.'",
        "'speaker_0': 'Colleagues. Council Member Belle du Jour.'",
        "'speaker_6': 'Questions in order about the line amendments right now or should we wait until we walk through the process?'",
        "'speaker_0': 'Yes, we took questions on the structure. I think it'd be appropriate to take questions on the line amendments now as well.'",
        "'speaker_6': 'If I may. Yeah. On Amendment one, a just generally sort of I have a technical question and a background question. The background question is how many businesses are we talking about? And based on Moray Island and a lot of email.'",
        "'speaker_6': 'But how many businesses?'",
        "'speaker_2': 'Less than ten.'",
        "'speaker_6': 'Analyst Okay. And if I'm reading this correctly, it exempts historic. Properties and existing businesses as to most of the requirements. But what about the 15% square footage limitation?'",
        "'speaker_2': 'Yeah, there's a typo in the matrix. It's the 15% limitation on chasing your cells again is only for existing businesses and historic properties.'",
        "'speaker_6': 'And the technical question is, with existing businesses leaving historic properties aside for a moment, that would be existing as of.'",
        "'speaker_2': 'January 1st.'",
        "'speaker_6': 'January 1st of 2019 this year. And it would what happened if those businesses wanted to expand.'",
        "'speaker_2': 'They would be considered legally non-conforming. And then the requirements for legal.'",
        "'speaker_6': 'Non-Conforming, there's a certain amount of squish, but not a whole lot of squish, as I recall here. Not the legal term.'",
        "'speaker_1': 'Okay. Thank you. I like.'",
        "'speaker_0': 'Council member Col Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. I just have a clarification question. I was the for both the striking amendment and the line amendments was the striking amendment and have been these amendments today. The line amendments been provided to people online.'",
        "'speaker_1': 'I guess at the time.'",
        "'speaker_2': 'The striking amendment was online. Last week. They left Monday so we could go.'",
        "'speaker_1': 'But these are.'",
        "'speaker_2': 'New, not correct. Thank you. Well, Councilman McDermott has been sharing his amendment.'",
        "'speaker_1': 'And I know for the broader community.'",
        "'speaker_2': 'They were not published.'",
        "'speaker_0': 'No more questions on the linemen line amendments. Councilmember Dombroski.'",
        "'speaker_7': 'Thank you, Mr. Chair. I'll just take that opportunity to say I have a lot of questions, but I don't frankly have the ability to ask them in an intelligent and an integrated way with the other stuff, because they're so new on this coming forward here today.'",
        "'speaker_7': 'And this is I know we spent a lot of time, a whole baby's lifetime working on this. But and I think we are making substantial progress. And I want to commend those who have taken the lead on it for their hard work.'",
        "'speaker_7': 'But I would just want to note, you asked about process, and I heard you say that you'd hope we can move forward today. I'm not prepared to move forward today. I won't be able to support any of this today.'",
        "'speaker_7': 'I might be able to get there after I've had a time to think about it and to look at it because a lot of it's new. I think we do our best work by sharing the information and I credit customer about that for publishing a schedule and sharing her advice.'",
        "'speaker_7': 'Striking an amendment. Last week, it was helpful to be able to look at the chart and I'm still digging in. But our public also, as we heard in public comment today, deserves, I think, the opportunity to have these materials provide input.'",
        "'speaker_7': 'We have delivered us here, I don't know, 40 pages of 62 page pages, a public comment from September 13th through the 16th. I've not been able to read it. I know that we have time after a hearing, but one thing that would help me would be just to spend a little time with, I think, where we stand'",
        "'speaker_7': 'today on this on these items. And I know you, Mr. Chair, have made time on your schedule, so all of my members can weigh in on this committee. And I know it's very limited. Just a thought. We do have a five week month here.'",
        "'speaker_7': 'And that fifth week, as we know, is available for special meetings or one. If members wanted more time and there was availability Monday, the 30th could be another opportunity and folks had time to do additional reflection. But that's kind of where I'm at.'",
        "'speaker_7': 'I'm going do the best I can today day. But I will tell you, I would like to be more familiar with the materials than I am and the public input on them than I'm able to be today. But thank you.'",
        "'speaker_0': 'Further dialog input from members. This legislation was introduced at least a year and a half ago, I believe well over a year ago, has gone through the committee process and made its way to full council and has now been referred back to the committee of the whole so we can all do work on it.'",
        "'speaker_0': 'We've had a striker out since last Monday for all of us to have a chance to review if there is interest in moving today, we could take up amendments and vote. If there's an interest in having more time to make sure we've got a good handle on the legislation before us and there would be value in that'",
        "'speaker_0': ', then I would make time at our next count, our next committee, the whole meeting to take this up. After that, it might get challenging, but it'd be my expectation that we would all, to borrow perhaps an overused phrase, lean in and be in a position to come ready to take up this work in an earnest sense at'",
        "'speaker_0': 'our next regular council meeting. Is with an interest in moving it today on my part to have the committee calendar open up again. Councilmember Lambert.'",
        "'speaker_1': 'I agree with Councilmember Dombrowski. There is a lot of changes to what we had been talking about for over a year. It came out of committee. There was a task force nearly four years ago now, even before your baby.'",
        "'speaker_1': 'So. I have worked on legislation that has been national with fewer hours and weeks and months going into it. And so I think that what it comes down to and is do we want to have a place that businesses can thrive, that the ambiance of the rural area can be preserved?'",
        "'speaker_1': 'People who live in the rural area and go out to the rural area want to see the farmlands. They want to see the beauty of the area. Rural people like to meet together. When you drive by this area, there are happy faces there.'",
        "'speaker_1': 'Places are full. People are having a great time. We have put together something here today where as it was testified to, there could be 7 to 18 parking slots. So with some of the changes that certain kinds of fermenting and such would need to be done on site, that would mean that there have to be extra employees'",
        "'speaker_1': ', which would also cut into the profits of the business, which are also cut into the idea that there would be parking available. So if two couples decided, I'd like to go out and have a drink with you tonight, let's all meet at X place.'",
        "'speaker_1': 'They would get there and if there were seven parking spots that would be four cars. Hopefully there'd be somebody there to wait on them. So that could be two or three. So now there would be no other parking spaces for anybody else to come.'",
        "'speaker_1': 'I would guess that at least when I owned a business, if I didn't have any parking spaces for my customers to come to, I wouldn't be in business very long. So when we talk about rural character, we need to be looking at not killing all of the places where people want to go to congregate.'",
        "'speaker_1': 'This is a place where people are happy to be there. This place would not have thrived for this many years if it weren't some place that people like to come to that 15%. I don't even know where that number came from, but it has huge impacts and people say, well, they can park on the arterials or the'",
        "'speaker_1': 'arterials, that there are two main roads, there are no places to park. They said, Well, you can take a bus. That would be really nice that there were busses saying that you were going to prohibit on site sales.'",
        "'speaker_1': 'They can do it in the industrial area. I went door to door to I don't even know how many industrial areas and asked them how many slots they would have per month for sales from another tasting room. And almost to a person.'",
        "'speaker_1': 'They said, Oh my gosh, I get so many phone calls about this, I can't even keep up with the demand. So that's not a viable option. And over and over in demonstration, a two events per year with a maximum of 50 people, you're allowed that in your own backyard, in your own house.'",
        "'speaker_1': 'And it's not even even a real route. It's not even a business. You know, when you look at one of the amendments on one of the amendments, it says to preserve historic properties that I agree with, completely historic properties should be able to continue on with those kinds of things.'",
        "'speaker_1': 'But then it says to be exempted from the amendment requirements. We worked really hard on adding minimum requirements so that it couldn't proliferate and the value in the valley. We talked about arterial access as opposed to some flexibility with rural access.'",
        "'speaker_1': 'We talked about the idea, the setbacks and having some flexibility under a C u.p. And last but not least, I'd like to show you the chart Fiji poll that showed up on the wall. I have it here bigger for people in the audience.'",
        "'speaker_1': 'No. Everything in green on this chart. I get my stats, all that up for me. Everything in green on this chart has been preserved already by. By either our farm preservation or our agriculture production. Just we have some kind of claim on everything in green that shows you that we care about this.'",
        "'speaker_1': 'This part right here is where they want to build a 22 acre parcel, which originally was going to be called the Wine Village. Thank you. So with all of that green area, it's clear that we are trying to get the balance between between protecting our farmlands and also keeping rural, rural lifestyle in many places in the country'",
        "'speaker_1': '. Wine tasting is considered an ag use. So we tried to get the balance over a year of collaboration with I don't even know how many hours of your time and other legal staff. For people who don't know, we have a very extensive legal team in King County, and I think they probably all have ulcers from dealing with'",
        "'speaker_1': 'all this over and over. So I think I think there's two things we as a council need to decide. Do we want to put all these businesses out? And if that's what the council wants to do, then let's just say that if that is not what we want to do, then we need to say, okay, how are'",
        "'speaker_1': 'we going to make them viable and how are we going to then have a a rich rural lifestyle where there is balance? This is not balance. This is putting them out of business just about. And I'm sad that after all these years of working and trying to come up with a compromise, that today we're sitting here with'",
        "'speaker_1': 'something that will put these businesses pretty much out of business. And then my next question after that, myself, at 3:00 in the morning, when I woke up and wrote the speech, was what will happen? Yes, I will go to three in the morning.'",
        "'speaker_1': 'Yeah, I did go to sleep all night long. What will happen to these businesses? These are small little houses where people have turned them into very delightful places for people to congregate. And for the record, people have said that I am trying to get this compromised because I spend so much time out there.'",
        "'speaker_1': 'For the record, I drink very little alcohol in my entire life. So the idea that that's the motivation is blatantly inaccurate. But moving on from that. So we need to decide what we want to have. And if if we take and say, okay, no tasting rooms, no wineries here, no anything, then what's going to happen to these'",
        "'speaker_1': 'businesses? We're going to have a section leading up to a 22 acre industrial, commercial, industrial, commercial place that is going to be vacant. And is that what we really want? Or could we find a way of making an ambiance that is compatible with what is going to be there?'",
        "'speaker_1': 'And what I would say is already there. When you talk about, say, Michel and Columbia Winery and the the tourist district of wouldn't those so I agree we should put this on at a future meeting and we need to get everybody in a room to decide, are we going to continue to have real lifestyle out here or'",
        "'speaker_1': 'are we going to completely get it? And I think that's where we are today. So I hope that we will make a decision to come together with a more reasonable plan.'",
        "'speaker_0': 'Giving you discussion of the details, I thought we were ready to take action and make decisions. Councilmember Bell Duty.'",
        "'speaker_6': 'Thank you, Mr. Chair. Question Point of order. Did I hear you say that there is room on the September 16th call for this or there may be room on this?'",
        "'speaker_0': 'Councilmember Bell Dutchie, I'm really glad you are sorry. Today is. No, no, no, no. You know what? I'm don't interrupt the chair. I guarantee you, there is action in the committee, the hall on September 16th.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'Let me rephrase. Is there room on the agenda at the next council meeting to work on this, or is it something that is not not yet determined?'",
        "'speaker_0': 'We can make sure I can make room on the October 7th next regularly scheduled meeting of the committee of the whole.'",
        "'speaker_3': 'To take this up so that it would.'",
        "'speaker_0': 'Be with the it would be tough to do so anytime after that. Right. Given the committee's workload for the rest of the year. Okay.'",
        "'speaker_6': 'In that case, just stating my own opinion with regard to the timing. If members feel that they need some more time to have more committee discussion and we can do it within the next couple of weeks, that makes sense to me.'",
        "'speaker_6': 'There is or there should be a 30 day comment period after we pass it out of committee again, which we've done before, but we should do again. So that means that we're not seeing this for final action at the earliest until late October, early November.'",
        "'speaker_6': 'I just wanted to point that out. So people are aware because there's been some conversation about this being rushed through, that's that's not going to be the case between now and the end.'",
        "'speaker_2': 'I would say if you don't take action until October 7th, you're not seeing this in full council until December because of Thanksgiving.'",
        "'speaker_6': 'So it gets pushed quite a ways back. I would be willing to move this item forward without recommendation today in order to get that notice out there and to get it moving. But it means taking up substantive amendments at full council.'",
        "'speaker_6': 'So I want to pause and see how people feel about that before making any kind of motion.'",
        "'speaker_0': 'Councilmember Gossett.'",
        "'speaker_3': 'Thank you very much, Mr. Chair. A little earlier, I was going to say that I concurred with Councilman DEMBOSKY and Councilmember Lambert that we wait. But Cathy made a case for taking certain kind of positions and that extended that a little bit more.'",
        "'speaker_3': 'But it just added to the questions that I had. I really think that I'm in the camp that we need to wait a couple of weeks. I was struck by the fact that it was both representatives of the industry, the winery industry, as well as people here who are here to protect what they deem to be the'",
        "'speaker_3': 'real character of the affected area. And they really were kind of surprised about the latest set of amendments to what we have been working on a year. And to me, it's reasonable that they would get an opportunity to vet what is being proposed and a bit more from both the side of the industry as well as of'",
        "'speaker_3': 'protecting the real character of the affected areas. And then lastly, Mr. Chair, I was surprised that all of this impacts Bash on either in looking at the amendment that you presented, I, like some of the folks that spoke, did not know that what we were talking about would have such a profound impact on bass and island.'",
        "'speaker_3': 'And maybe I should have and I'd like to have time to look at that. So I'm hopeful that we'll be able to put it off for two weeks and not even make a vote on it without recommendation today.'",
        "'speaker_3': 'Thank you, sir.'",
        "'speaker_0': 'Councilmember of unranked power.'",
        "'speaker_3': 'Thank you, Mr. Chair. First of all, I want to thank you for taking a leadership role on your amendment. It was something that I know you've been working on over the last seven days, in particular, trying to find a even balance between the concerns have been raised countywide and but recognizing the uniqueness of Ashe on island.'",
        "'speaker_3': 'I really do want to thank you for doing that. People don't truly appreciate how unique fashion is and how you can. By applying a county view, sometimes you do bad work, hurt a very fragile economy and a fragile part of our county, which has not benefited from the growth and development of other portions of King County, but'",
        "'speaker_3': 'is very much a part of King County and wants to be a part of King County. But sometimes when you try to apply Bellevue. Tactics to bash on Allen they backfire. And I'm upset that both Councilmember Dunn and now do cheers from Bellevue.'",
        "'speaker_3': 'But the reality is Virginia is a very unique area. And I want to thank you as somebody who actually is still a taxpayer from based on our. That said, Mr. Chair, I think just as wine ages. Well, so should this legislation age a little.'",
        "'speaker_3': 'Well. And I want to thank Councilmember Baldacci, who has taken a hard lot of work on this issue, trying to find some balance. And it's a very difficult one given not only here own philosophy, but also on his her district.'",
        "'speaker_3': 'So I'm hoping we can age this process a little bit, give it a chance for it to settle in and have a chance to digest it properly.'",
        "'speaker_0': 'Council Member one Mike Bauer I am all for a well-aged wine. I'm concerned about vinegar.'",
        "'speaker_3': 'And I also point out to you that contrary to what Councilmember Lambert said, that she is not someone who has drank a lot of wine. I cannot make that same claim. Thank you.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'And that I'm going to intervene and point out that we have that the waiting period, the the comment period that would be announced would be a 45 day wait comment period. I would suggest that would happen from time of of committee action prior to so a 45 day period between committee action and full council action.'",
        "'speaker_0': 'And the comment was made that if we took it up and I would be clear at the next regularly scheduled council meeting, not in two weeks, but three weeks would. There would need to be committee committee work. I would suggest there needs to be more than committee work, but work among members to have conversations about the legislation'",
        "'speaker_0': '. So we are ready to take action at a committee meeting at the next regularly scheduled committee of the whole meeting on this legislation. And with that, I would suggest it would be best handled by taking it up, leaving it in committee, and taking it up at our next regularly scheduled council meeting.'",
        "'speaker_6': 'Councilmember Bell Dutchie Mr. Chair, may I ask the indulgence of my colleagues for just a couple of minutes to explain what I did and why, since we're not doing this here today and since we've had a lot of discussion.'",
        "'speaker_6': 'So I'm just going to thank you. I'm just going to go ahead and do that, please. So with apologies again for the repetition. The current code was written in 2003 prior to the proliferation of the winery brewery distillery industry that you've seen in the last 15 years in our cities and in unincorporated King County.'",
        "'speaker_6': 'The code did not adequately predict this future, and therefore it's ambiguous. It doesn't match the reality we're seeing today, and it's been hard to enforce. The ambiguity has made it hard for people who want to follow the rules in established businesses to figure out how to comply with the code.'",
        "'speaker_6': 'And we've heard a lot of that. It's also meant that there's been a lack of enforcement in places where there probably ought to have been enforcement. We've heard today, and I've personally met with people who've spent thousands of dollars trying to comply with the code and they can't quite get there.'",
        "'speaker_6': 'So my pitch to my colleagues between now and the next meeting is we should pass something. I'm not one to be overly attached to every detail of something that I have personally proposed, but we should pass something because leaving things the way they are now is is kind of an untenable situation, I think, for everybody.'",
        "'speaker_6': 'So in recognition of this fact, the county committed to updating the code some years ago, prior to Councilmember Caldwell's and I coming on, the council and the executive entered into settlement agreements with businesses that had not been able to be permitted or that were violating code.'",
        "'speaker_6': '20 businesses, I understand, signed letter agreements. This is all in the Sammamish Valley. They agreed that they would not expand their businesses or change operations while we went through the code update process. There are dozens more that are not subject to agreements but have been in limbo for years and will continue in limbo as long as this'",
        "'speaker_6': 'is pending, as pending, as is the community not knowing what the rules are going to be. So as we all know, the executive convened a winery's study. It was focused on the Sammamish Valley. That's correct. That we heard from some of the Vachon and other folks.'",
        "'speaker_6': 'It was not really focused on county wide, although there was some study of countywide trends and impacts within the the adult beverage industry. That was not the focus. However, this code proposal has been focused on all of King County since at least April of 2018 when we received it.'",
        "'speaker_6': 'So it's not a new thing that this is a county wide code. It's just that as we get towards the end here, the changes that are made to apply countywide and are are new. I will recall to everybody that Councilmember Lambert and I worked hard on amendments to the executive's proposal after we received it, and we tried'",
        "'speaker_6': 'very hard to get to a place of real compromise. That meant that she compromised on things that were important to her, and I compromised on things that were important to me. We put together a proposal that was an attempt at a good balance between proposing agriculture, preserving excuse me, agricultural land and the rural character, and providing clear'",
        "'speaker_6': 'rules under which businesses could know how to operate and successfully operate. In some ways, that proposal was more restrictive for businesses and more protective of the environment than the executive's proposal. In a few ways, it was more flexible.'",
        "'speaker_6': 'We went to the full council with this proposal. We, after hearing it at the Local Services Committee and we heard in between there and at the meeting from many, many people and there was a lot of folks on both sides who thought they didn't like it.'",
        "'speaker_6': 'We didn't hear a lot of support and there was not support on this council to pass that proposal. So it was referred back to committee and not back to the smaller committee, back to this large committee of all of us, because that was the level of importance and focus that the council body, in our collective judgment, felt'",
        "'speaker_6': 'it needed. So when people ask what happened to that prior proposal, that's what happened. There wasn't support on this council to pass it, and so we had to do something. So in response to the extensive comment and Councilmember Lambert and I also had a big public meeting, we went out at night into the An Amish Valley.'",
        "'speaker_6': 'We listen to over 100 people. I've made visits. I know she has and others to to folks all over on all sides of this issue to try to grasp and understand the issues as best we can. So in response to all of that, I had been thinking about this for a very, very long time, and I prepared'",
        "'speaker_6': 'this new set of amendments. That's how we work here. When you've got a piece of legislation in committee, we, each of us have the ability and the right to propose amendments. And I've done that. What I tried to do was to further protect agricultural lands and, yes, tighten up the definitions and the rules for the businesses.'",
        "'speaker_6': 'That's correct. That's what I attempted to do in order to make it clear what was allowed and not allowed and to make sure that there isn't an opportunity, which we heard a lot of fear about expansion of these businesses in the unincorporated areas.'",
        "'speaker_6': 'So you heard a lot about I'm not going to talk about what the striker contains. We've already had that all briefed. But one of the main features of this was that it was meant to limit the amount of ongoing activity and expansion in the unincorporated areas.'",
        "'speaker_6': 'That was the goal to make sure that this wasn't something that could expand and continue to provide. To to put in place more impervious surface, more activity, more parking, more more things that impact not just the rural areas, but also the agricultural valley below in the sammamish valley.'",
        "'speaker_6': 'So just. I'm almost there. But let me just say, I want to be very clear what this code does and doesn't do this whole code, not just this proposal, not just my amendment, not just this code, change the code addresses, uses the state grants, licenses that allow people to produce alcohol.'",
        "'speaker_6': 'We are regulating only unincorporated King County. So when people say this will wipe out the industry, untrue, the industry is flourishing, flourishing in the incorporated areas just across the street in a ceramic valley and in other places the business.'",
        "'speaker_6': 'But this will this code. Regulates where businesses can be located and to some extent how they operate. So there are still life safety rules, building codes, critical areas, regulations, shoreline management, Endangered Species Act requirements, storm water, water requirements, surface water standards.'",
        "'speaker_6': 'Public Health Code. All of these continue to apply to every single one of these businesses, regardless of whether we pass this or not. So the impact of those businesses is being managed through a number of different codes, not just this use code.'",
        "'speaker_6': 'I just say that because I want to make sure that people are aware that King County is committed to the health and safety of our residents and the preservation of agricultural lands and rural character in more ways than just the use code.'",
        "'speaker_6': 'I also want to say that I'm committed and I hope we all are committed, that when we update this code, no matter what it says, no matter how it impacts businesses and residents, we should make targeted investments to help businesses come into compliance if they can.'",
        "'speaker_6': 'And we should make investments to make sure that there's code enforcement for those who won't or can't come into compliance, because not enforcing the code has been part of the problem that grew in the Sammamish Valley, as we heard.'",
        "'speaker_6': 'I want to say, I've heard from the people on Virgin Island and and I've heard from Councilmember von Reich Brower, who I did not realize was such a version, a proponent of, you know, maybe you could work together a little bit there.'",
        "'speaker_6': 'And I'm happy to learn more about what's going on on Bastion Island. And the number of businesses is quite small. It doesn't have the same growth and expansion and therefore impact that we've seen in other places. So I look forward to talking to Councilmember McDermott about his perspective.'",
        "'speaker_6': 'But but I think we need to move forward and we need to adopt something in 16 months that we've had this in front of us. We've heard from hundreds of residents, dozens of businesses, organizations, and we're reaching the end.'",
        "'speaker_6': 'I think we should take some time to understand what we're doing, but if we're going to act at all, we should act soon. The current situation isn't sustainable and it isn't working for people. So I look forward to us finding a way through within the next few weeks, and I thank you for your time to let me'",
        "'speaker_6': 'say some words, Mr. Chair.'",
        "'speaker_0': 'COUNCILMEMBER Louder.'",
        "'speaker_1': 'Thank you, Mr. Chair. Well, we worked really hard on this, both in our committee and then individually. And at the beginning, many of you said, Let's have two people go out and find it. They could come up with a compromise bill that was good public policy and there were many compromises being made.'",
        "'speaker_1': 'And, you know, as it came over originally, it was supposed to close at 5 p.m. tasting rooms close by PM. I don't even get out of my last committee meeting until after 5 p.m. many days and then an hour, hour and a half to get to get home again, change my clothes.'",
        "'speaker_1': 'They would be closed every night of the week. So should I want to join Councilmember Von Right Barua? He drinks a glass of wine. It would already be closed. Wine or beer? Maybe two to as many as you want.'",
        "'speaker_1': 'I'll be your designated driver. I'm good at that.'",
        "'speaker_3': 'You know. Happy to do that if you want. I'm happy to just.'",
        "'speaker_1': 'About get into that, though. And we we many people on this council said it's complicated. Let's two of you go up who have a vested interest because it touches your district and come up with good public policy. And public policy needs to be clear defined rules and it needs to balance the things that we hold dear.'",
        "'speaker_1': 'And what we hold dear is protecting the agricultural land. And we also hold dear the idea that there needs to be a rural lifestyle and a rural lifestyle includes places where people can go and congregate and be together.'",
        "'speaker_1': 'And yes, if they would like, they can have a glass of whatever they choose to drink. And code enforcement, we talked about repeatedly in the budget where we are adding new employees to make sure that when the rules were passed that they could be enforced.'",
        "'speaker_1': 'You know, I really respect the requests of Bash on Island because in fact, that's what we all would want exactly what the request is. But I would say that all the county should be given that same opportunity within limits.'",
        "'speaker_1': 'And we set those limits. We said there had to be a minimum acreage requirement so that they would not proliferate. We were very clear on what ours needed to close and. We made sure that it was at least in line and even stricter than the noise ordinance when we heard things about the parking problems.'",
        "'speaker_1': 'We started out with saying, hey, look, let's just not get into that because it's a complicated formula. Let's leave it at one car for every 50 square feet of commercial area. And then it went to 150 feet for one parking slot.'",
        "'speaker_1': 'And now this new one says 300 square feet. We do need to pass something, but it needs to be something that is balanced. What we have before us today is really to say wipe it all out and it doesn't need to exist.'",
        "'speaker_1': 'And I would guess that on any weekend there will be so many thousands of people or hundreds of people driving to, say, Michele's Saint Columbia, to Jill's new place to theaters anziani all within the same block as and including in 22 acres at the end of the street that is going to be there.'",
        "'speaker_1': 'This could be a very vibrant place that we could be symbiotic to and complement. As opposed to saying that we want this to be an empty, deserted place. Well, going into wouldn't there. So I hope that as we go forward in the next couple of weeks, we will balance that, in fact.'",
        "'speaker_1': 'Wine tasting is a rural use and a rural thing that people like to do, including urban people who come to visit. So it needs to have balance. And I'm willing to work with whoever it like to to make some changes on the underlying bill, not the one that's before us today, because I believe that completely wipes out'",
        "'speaker_1': 'the industry. But let's work for something that makes sense to everybody.'",
        "'speaker_0': 'The two speak. If we're speaking to legislation and putting issues out before us. I'd like to also speak to the fact on an amendment that I have drafted and as Councilmember Balducci and Ms.. Osnes have alluded to, this comes from the entire ordinance before us, comes from a study that was done in the Sammamish Valley because of'",
        "'speaker_0': 'issues that had been identified in that community, and the ordinance attempts to address some of those issues. At the same time, those issues don't exist on baseline. It is a small number of existing such businesses and those are the issues that are being addressed in this mama's valley.'",
        "'speaker_0': 'Don't exist on the island. The. Amendment that I bring would allow would apply only to existing wineries, distilleries and breweries on Bastion Island. Would not. Would not change land. Ongoing land use code for the island would. It would apply to existing businesses.'",
        "'speaker_0': 'Any new businesses seeking to open undersigned would have to apply with whatever code we adopted and existing businesses, should they do a significant expansion would also need to comply with the new code as we adopt not a free for all or an exemption for VAT on.'",
        "'speaker_0': 'And so I want to I'm sure that as I've advocated with my colleagues over the last week intensely with the amendment and in conversation over the last several months as we've talked about the ordinance itself with that seen no one else would comment council member von Reich Bauer.'",
        "'speaker_3': 'Thank you. I just urge my colleagues and anybody in the audience if they have a chance to read the Bible first. Timothy 523.'"
    ]
}