{
    "AN ORDINANCE clarifying Title 6 of the King County Code, establishing a gender neutral code and making technical corrections; and amending Ordinance 1888, Article I, Section 2, as amended, and K.C.C. 6.01.010, Ordinance 1888, Article I, Section 4, and K.C.C. 6.01.030, Ordinance 1888, Article II, Section 4, and K.C.C. 6.01.080, Ordinance 1888, Article III, Section 1, and K.C.C. 6.01.110, Ordinance 1888, Article III, Section 5, as amended, and K.C.C. 6.01.150, Ordinance 2287, Section 6, and K.C.C. 6.04.060, Resolution 12714, Section 1, as amended, and K.C.C. 6.04.170, Resolution 12714, Section 4, as amended, and K.C.C. 6.04.200, Ordinance 7216, Section 6, as amended, and K.C.C. 6.08.042, Ordinance 4270, Section 4, as amended, and K.C.C. 6.08.090, Ordinance 4206, Section 4, as amended, and K.C.C. 6.08.100, Ordinance 13548, Section 4, and K.C.C. 6.09.030, Ordinance 13548, Section 13, and K.C.C. 6.09.120, Ordinance 13548, Section 15, and K.C.C. 6.09.140, Ordinance 13548, Section 17, and K.C.C. 6.09.160, Ordinance 1294, Section 2, as amended, and K.C.C. 6.12.020, Ordinance 1294, Section 3,": [
        "'speaker_0': 'All right. Well, hold off on approving the minutes and move on to proposed ordinance number 2018 0148. As we have discussed a number of times in this committee and at the full council, the voters of King County previously approved a charter amendment making our county charter gender neutral.'",
        "'speaker_0': 'And then, since early last year, we've been working to complete that same body of work for the entirety of the King County Code, which has been quite an effort. We've had a number of different updates to the code.'",
        "'speaker_0': 'This is our fourth and final ordinance before the committee. It would be really cool to complete this work during Women's History Month. That'll be a that would be aggressive. But let's try and and I just want to say, before we even start this one, that staff have just done an incredible amount of work.'",
        "'speaker_0': 'This has been detailed, very, very large body of work and combed through literally hundreds of pages of code to make this update. So I want to thank Erin Osnes, who's here today. Sam Porter Bruce Ritson, I don't know if he's here.'",
        "'speaker_0': 'And Russell Peifer, who's just been there. Hello? No, you're waving it. You're waving in somebody else. Not at me. That's not Russell. Okay, Albers, but welcome to you. Anyway, now we'll move on to a briefing by Sam Porter.'",
        "'speaker_2': 'Welcome. Thank you, Madam Chair. Sam Porter, Council Central Staff. The documents for this item are found on page nine of your packet. Proposed ordinance 2018 one for eight as the last, as you mentioned, in a series of four ordinances that would make changes to the King County code, removing gendered pronouns and historically gendered terms wherever possible.'",
        "'speaker_2': 'The proposed ordinance only includes changes to Title six that pertain to business licenses and regulations. No substantive legal or policy changes are proposed to be made through this process, but other drafting corrections are have been incorporated as proposed by the code advisor.'",
        "'speaker_2': 'As you know, motion 14680 was passed in July of 2016, directing the Clerk of the Council to develop options for how to apply gender neutral references throughout the King County Code. The same day related ordinance 18316 passed, which placed an item on the November 2016 ballot to amend the King County Charter, as you mentioned, to make the'",
        "'speaker_2': 'language of the charter also gender neutral. This charter amendment was passed by a majority of the voters in November of that year. This proposed ordinance is consistent with Washington state law that rendered the state law gender neutral over a period of six years.'",
        "'speaker_2': 'Throughout the code, the series of four ordinances replaced gendered pronouns such as he, him, she or her with the title of the actor in impacted sentences. Table one on page ten of your packet contains a sample of other proposed changes to historically gendered terms in the proposed ordinance before you today.'",
        "'speaker_2': 'As with the previous ordinances, executive staff have been consulted regarding the proposed changes and their feedback has been incorporated into the proposed ordinance. And that concludes my remarks.'",
        "'speaker_0': 'All right. Thank you very much. Is there any discussion, comments, questions? It seems that we do have a quorum at this time, so.'",
        "'speaker_2': 'Councilmember Colwell Thank you, Madam Chair. I'd also like to thank the staff for your work and for councilmember founded Ship to lead in bringing this forward. It's really interesting. I I'm very observant of gender, language and the need for respecting the rights for women and conversely, to be able to be identified in a way that reflects the'",
        "'speaker_2': 'other gender. And I do notice that people occasionally on Facebook or whatever get upset about this. And I have one constituent who continually makes remarks whenever this topic comes up. And he, you know, he by golly, he is going to use man and he to reflect women and girls all the time and no one's going to stop'",
        "'speaker_2': 'him. Well, I bring this up only because I think it's important that people understand that in our passing this legislation and it's going into our code throughout it, we're not in any way directing people to speak a certain way or to write a certain way.'",
        "'speaker_2': 'They can still do whatever they want. This is just reflected in our codes and people. Sometimes you don't get that. But we're not out there as the speaking. Right. You know, the the politically correct way to speak for people.'",
        "'speaker_2': 'We're here reflecting a need that had arisen in our own code. So I just want to make sure that people understand that.'",
        "'speaker_0': 'MANCHIN Thank you, Councilmember Carlos, and thank you also for pushing us to do the entire code because we probably would have stopped us with the charter. I mean, this is it's good to get it done. Councilmember Lambert has a question.'",
        "'speaker_2': 'Thank you. Could you tell me why ears was not an appropriate term? The base of air comes from here. Oh, you got to be kidding me. I'm not kidding you. I wouldn't kid you.'",
        "'speaker_0': 'And I will say, just as a person who once upon a time studied and practiced just enough a state law to be sound like I know what I'm talking about when I don't. But beneficiaries is a broader, more inclusive legal term as well.'",
        "'speaker_0': 'It's not errors. I think people think you're just inheriting money beneficiaries or people who might be receiving other kinds of benefits besides just property. So I think it's probably an improvement. Gender. Wiser? No, I'm guessing.'",
        "'speaker_2': 'So I didn't have the benefit of knowing that nuance. So thank you for saying that. But you could have an error. Is this correct? An error? Who is not necessarily a beneficiary?'",
        "'speaker_0': 'I don't think so. Beneficiaries a broad term. I mean, somebody, one who benefits from. And you certainly benefit if you inherit somebody's property. But an error, I think, is commonly understood to be somebody who inherits property. Interesting. Well, my other lawyer friends want to dove into this debate.'",
        "'speaker_0': 'I know your discretion. That's very smart.'",
        "'speaker_2': 'So I could actually have an error. Say I had a say. I had a child that I chose not.'",
        "'speaker_0': 'To have.'",
        "'speaker_2': 'In my will. They would be an error, but they wouldn't be a beneficiary.'",
        "'speaker_0': 'I don't think that's correct. That's correct. No, but. Right. But it's a it's a decent question, legal counsel, to.'",
        "'speaker_2': 'Look at this. But we will run this one.'",
        "'speaker_0': 'Both times and again and be sure.'",
        "'speaker_2': 'Counsel. Yeah. I'm sorry I missed hearing what the response was to Councilmember. Legal Counsel did review this ordinance, but we will run this question by the minute. I mean, why error? Oh, it was just them. Okay. Thank you.'",
        "'speaker_0': 'Okay. I would appreciate a motion to move this out of committee today since there's only minor question. And even if we made a change, it would be easily done at full council. Councilmember Lambert, would you like to do that?'",
        "'speaker_2': 'Should I be happy to? Do you want to with with that recommendation? I don't care. Either way.'",
        "'speaker_0': 'I think with a recommendation would be good. You know, we can make one last amendment if we need. Okay.'",
        "'speaker_2': 'Manager I'd like to move ordinance citizen 18 0148 with a duplex recommendation. Okay.'",
        "'speaker_0': 'This motion is before us. Any final comments or questions? I will just add on to what Councilmember Caldwell says. You know, it's you don't get a lot of those kind of at least I don't get a lot of those kinds of comments from people who object to us making our language more inclusive and respectful.'",
        "'speaker_0': 'But I like to tell the story of walking down the hallway upstairs where there's pictures of historical pictures of the council over time. And there have always been women council members. And the fact that our codes don't recognize the half of the gender that has sat up here, it's I think if we're not recognized in the code'",
        "'speaker_0': ', then how are we doing with the public at large? I think it's just a matter of respect and inclusion, and we're not telling anybody how to live their lives or how to use their own language. I think it's a very positive change and I've supported it all along and I thank you, my colleagues, for supporting it as'",
        "'speaker_0': 'well. All right. With that, all those and. Oh, sorry, a no amendments. Would you please call the roll?'",
        "'speaker_2': 'Thank you, Madam Chair. Council Member. Demovsky Council Member. Dunn Council Member. Gazette Council Member. Cornwall Council Member Lambert I Council Member McDermott.'",
        "'speaker_1': 'High.'",
        "'speaker_0': 'Council Member of the Grove.'",
        "'speaker_2': 'Council Member one right there. Madam Chair, I Madam Chair, voters. Six ayes.'",
        "'speaker_3': 'No, nos. Three.'",
        "'speaker_0': 'Excuse two. Thank you. The item will move forward. I'd like to expedite that.'",
        "'speaker_2': 'No, no. It requires special noticing because there's the regulations.'",
        "'speaker_0': 'All right, we want expedited. There's legislations that require public notice. So we have to do we have to take a regular path. All right. We'll do our best to try to get it done before the end of the month.'",
        "'speaker_0': 'But can we go back and approve the minutes of the March 7th meeting? Councilmember Lambert.'"
    ],
    "AN ORDINANCE approving the King County Regional E-911 Strategic plan and establishing the King County regional E-911 advisory governance board.": [
        "'speaker_0': 'We'll take a look at that. Thank you. Okay. Anything else? All right, Jeff, thank you very much for covering. And we will take this up again at our next meeting. We'll move on to item seven, which is an item to approve the enhanced 911 systems strategic plan.'",
        "'speaker_0': 'The enhanced 911 system is a really large and complicated system, and it's a very critical system. It's what people rely on when they call for emergency help. It's comprised of 13 public safety answering points or piece ups, as we have all learned.'",
        "'speaker_0': 'And they all they're necessary there behind the scenes, but they're necessary to answer 911 calls and dispatch the appropriate help. This plan has been in motion since this committee and the Regional Policy Committee established the work program in 2015.'",
        "'speaker_0': 'So today we come to the culmination of a great deal of work over a long period of time. The Regional Policy Committee approved this item at its March 7th meeting and it is now before us for approval. I will say when we started this work, I know it was very contentious.'",
        "'speaker_0': 'It happened before I came on the council. But one of the very first things I was invited to after being elected was a meeting of some of the 911 folks on the east side. And they told me at that time we were really worried.'",
        "'speaker_0': 'This was really terrible, but it's going a little better now and it just went better and better. And we've really all come together. It's been it's been great to see how hard work and patience and working through issues can really pay off.'",
        "'speaker_0': 'And that owes a lot to the folks sitting in front of me right now. I'll introduce in a moment. So there's been a tremendous amount of work and we're now ready to move forward and tackle the issues of the E911 system together with all of the piece ups.'",
        "'speaker_0': 'So with that, I'm going to call on Lisa Kay to brief the committee and then introduce the panelists who are here to walk us through this decision point today. Thank you. Thank you, Madam Chair.'",
        "'speaker_2': 'Lisa K Council Staff. Today, I am honored to be joined by the co-chairs of the planning group that led the staff work on the proposed plan. Kathy Lombardo, who's the interim manager for the E911 Man program, is to my left.'",
        "'speaker_2': 'To her left is Laura Ueland, who is the executive director for Valley Communications, one of the public safety answering points where I'm going to be calling them piece ups. And then Tom Connie, who is the deputy director for the Department of Executive Services.'",
        "'speaker_2': 'He was also co-chair of the Finance Task Force for this work. As you mentioned, Madam Chair, proposed ordinance 2018 0069 would approve the King County Regional E911 strategic plan, and it would establish the King County Regional E911 Advisory Governing Board.'",
        "'speaker_2': 'My staff report begins on page 113 of your packet, and the plan itself begins on page 127. The substitute version of the ordinance before this committee today was approved by the Regional Policy Committee, as Councilmember Belden, you mentioned.'",
        "'speaker_2': 'It adds a requirement for an annual report to the Regional Policy Committee on implementation of the plan's recommendations, and it also corrects a typographical error. Council members Baldacci, Dunn and Lambert served on the 15 member leadership group for this planning process, which also included elected officials and staff from Sound Cities, the city of Seattle, the county executive'",
        "'speaker_2': ', the sheriff, a fire commissioner, and two of the piece ups. You'll find the complete list of the leadership group, the planning group and task force members on page 365 of your packet, which I think is the last page of your packet.'",
        "'speaker_2': 'Actually, it's not the last page of your packet, said the Regional Policy Committee. There's more. With the chair's permission, I'll keep the briefing at a fairly high level, given that this committee has had past briefings. If you want more detail, just feel free to interrupt me or you can ask at the end.'",
        "'speaker_2': 'Okay, I'll start with a short introduction to E911 recap the genesis of the plan that's before you today, and then summarize its major elements. So a911 call that's placed within King County today touches at least five major telecommunication systems from the time the call is placed to when eight is dispatched.'",
        "'speaker_2': 'You can see a general illustration of the system in FIG. one on page 271 of your packet. So, for example, a person in King County uses a private telephone service provider to make a911 call on what's called the public switched telephone telephone network.'",
        "'speaker_2': 'The private service provider routes the 911 call to the State Emergency Services Network, which is called the S9+. The state then routes the call to the regional E911 system, which is managed by King County's in an on one program office.'",
        "'speaker_2': 'The program office then facilitates the call delivery to the correct peace up staff at the Peace Up, then answer the call and dispatch appropriate search resources. And keep in mind that call, answering and call dispatch are two separate functions within a piece up.'",
        "'speaker_2': 'That'll come up a little bit later in this briefing. Knowing those five steps is important because the strategic plan before you today applies to just a subset of that complete system, just the county's program office and the call taking functions of the piece ups.'",
        "'speaker_2': 'So two of those five steps are addressed in this in the system plan. Those two functions. Are funded by a 70 cent monthly excise tax assessed per telephone line. The call dispatch functions are separately funded by the local agencies served by the World Peace APS and King County, which are listed on page 114 of the staff report'",
        "'speaker_2': '. There is a 13th piece app, which is the test piece app, which is used to do trial runs of new technology before it goes live. It's pretty important to get it right before you incorporate it into the system.'",
        "'speaker_2': 'So the system was relatively straightforward when we all had the same kind of analog telephones, but that's been changing, as you know. And the federal government launched an initiative some time ago called Next Generation 911, which I'll be calling New 911 to modernize existing landline based technologies and upgrade systems to support wireless and other emerging technologies such'",
        "'speaker_2': 'as text, photo and video transmission, so that they can be used with the 911 systems. Today, Washington State is in the midst of upgrading its emergency services network to support these additional energy 911 functions that upgrades called sign up to.'",
        "'speaker_2': 'And it drives some very significant local changes. Basically, if the county and the peace apps want to fully implement the new 911, I'm getting into too much detail. Mr. DEMBOSKY Here, you're like.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'You know, it's an important item. Don't, don't don't be self-conscious about the level of detail. Just keep going until until instructed otherwise.'",
        "'speaker_5': 'Variances in the work you're doing and how we can accelerate the enhanced 911 deployment because it's so vital to get responses to folks. Frankly, oftentimes in DV situations, in crisis, where you can't get on the phone. And so we've had an interest in the.'",
        "'speaker_5': 'So I think I'm paying close attention. I didn't mean to.'",
        "'speaker_2': 'So I wasn't sure how to interpret your concentration.'",
        "'speaker_1': 'All good.'",
        "'speaker_2': 'In any case, if the county in the piece helps want to fully implement what the changes that the state are going to make available with their I net two, then the program office and the piece ups have to implement and support compatible systems.'",
        "'speaker_2': 'That local implementation, as you know, has been a challenge both in terms of how to best keep up with that technology, which is just changing so rapidly and how to pay for the new systems because it will be more expensive than what we're doing now.'",
        "'speaker_2': 'Unfortunately, neither the federal nor the state government has provided any local funding for that new 911 initiative, and King County's forecasts for some time have shown that projected system expenditures are going to outstrip revenues, leading to a significant deficit.'",
        "'speaker_2': 'And I'll get to that a little bit later, too, in this context. Then the County Council, in collaboration with the Regional Policy Committee, approved an ordinance in October 2015 that resulted in the strategic plan that was before you today.'",
        "'speaker_2': 'The plan was unanimously approved last November by the Multijurisdictional Leadership Group for recommendation to the County Council. It addresses three major areas governance, technology and finance. And I'll go over those briefly for you. I'll start with governance. The plan recommends and the ordinance establishes a new regional advisory governing board with specific roles and responsibilities and a decision'",
        "'speaker_2': 'making and appeal process. You can see the details for that on page 116 and 117. In your packet, the governing board would be advisory to the nine month run program office, would have 12 voting positions, one for each piece up and operate by consensus as much as possible.'",
        "'speaker_2': 'In the event that a vote was needed, a positive vote has to meet two thresholds approval from 40% of those present and from piece ups representing 60% of current call volume. The plan also provides a detailed process for decisions and appeals in the event that the Program Office and or the executive don't agree with a recommendation from'",
        "'speaker_2': 'the advisory governing board, you'll see a diagram for that on page 146. And if you want to see a verbal explanation of that, that's on page 117. And I can walk you through that if you have questions about that.'",
        "'speaker_2': 'Moving on then to the technology recommendations. The technical technology plan identifies extensive performance measures and targets associated with strategic objectives and actions. But most critically, the plan identifies a path forward for an energy 911 based on a process to implement a new single platform system architecture while monitoring the assumptions that support that preferred option.'",
        "'speaker_2': 'This moves the core elements of the 911 system infrastructure from each individual piece up to a single host platform that will have three or four nodes. The task force found that compared to directly connecting each of the 12 piece ups to the state's I net using the single platform architecture but provide increased security.'",
        "'speaker_2': 'Be more fair and equitable with increased capacity to manage call volume surges would make more capabilities available, provide greater interoperability and provide for common management solutions. The major drawback is that single platform architectural will likely incur new networking costs of about $700,000.'",
        "'speaker_2': 'Per year to connect the platform nodes to each of the piece ups. That cost wouldn't exist if the USA network was directly connected to each of the 12 piece ups. Assuming that the state didn't change its current funding commitments because several of these assumptions, as I just mentioned, the technology and that is the changing and the costs'",
        "'speaker_2': 'are a little bit in flux in terms of what the state is going to pay for. The leadership group put a very strong caveat in the plan that any additional information that emerges during the RFP process for the single platform provider could modify the preferred course of action so that there are some steps in here that would'",
        "'speaker_2': 'be that would raise red flags if this decision needed to be revisited. Turning next then to the finance recommendations, the consultant in the Finance Task Force developed a first time ever financial model of the regional E911 systems revenue and expenditures, with a lot of help from the piece ups in the program office.'",
        "'speaker_2': 'The new model provides a financial baseline for the system and projects, and the bad news is it projects a negative fund balance starting in 2023, which is a few years later than had been estimated previously. However, using the model, the consultant was able to develop and quantify estimated impacts of changes to revenue and expenditures that could be'",
        "'speaker_2': 'implemented to eliminate the forecasted deficit. Those are listed on a page on page 119. So as you can tell, there are some pretty big decisions that are still remaining to be done. This plan provides a framework to make some of those decisions, and it has a high level implementation timeline for specific governance, technology and finance actions.'",
        "'speaker_2': 'So you'll see that there are key milestones for formation of the Regional Advisory Governing Board. The target was first quarter of this year to complete new contracts between King County and the peace ups. By the end of this year.'",
        "'speaker_2': 'To connect the state air, sign up to to King County by the first quarter of 2019 to execute a new contract, to develop that single new platform, new single platform system architecture by the third quarter of 2020 with a project with a system in place by the first quarter of 2022.'",
        "'speaker_2': 'And then also, very importantly, to identify any potential expenditure reductions and implementation of any new revenue sources by the end of 2021. The new the new Advisory Governing Board will have significant involvement in working with the program office to meet these milestones.'",
        "'speaker_2': 'Council's primary involvement will be through the budget process and also approval of the contracts that the executive will negotiate between the county and the peace ups. That completes my report. Madam Chair and I and my cohorts at the table here would be happy to answer any questions.'",
        "'speaker_0': 'Thank you. Councilmember Lambert has a question.'",
        "'speaker_2': 'Thank you. I don't remember on page 121, I don't remember that we had talked about the egis to connection to King County taking. Was that five or six quarters and then the contract for King County? Is that what we had agreed to, that it would take that long?'",
        "'speaker_2': 'I'll ask Cathy Lambert. I'm sorry. For part of the other. Yeah, the other capital.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_4': 'Sorry. By the way, Cathy Lombardo, program manager for 911.'",
        "'speaker_2': 'Could you repeat the question? I'm sure I'm just looking at the implementation timeline and looking at how long it is between areas. Yes, I know that two connection to King County in the contract for the system architecture executed.'",
        "'speaker_2': 'So it goes from the first quarter of 2019 to the third quarter in 2020.'",
        "'speaker_4': 'Well, those aren't dependent. Well, they are dependent on one another. But the actual contract for the platform has to we have to go through an RFP process. We have to actually design the system first and then develop an RFP to actually implement the project.'",
        "'speaker_4': 'So those two, while the LSI Net two is required for the platform, they're not. I think you're thinking about them differently than maybe you need to be thinking about them in terms of the implementation for the platform versus Eastside.'",
        "'speaker_4': 'The two are.'",
        "'speaker_2': 'Separate. They are separate. Okay. Okay. Great. Thank you. I got that right.'",
        "'speaker_0': 'And the other questions, what would you like to say? A few words, how you've come to the end of a long process. Surely somebody would like to say something.'",
        "'speaker_2': 'You want to start?'",
        "'speaker_0': 'It's not required.'",
        "'speaker_1': 'But I was Tom County, deputy director of the Department of Executive Services. I just want to remind you of a couple of quick points. One, before we forget about it, I've got to say, Lisa, thank Lisa for a contributions to the process.'",
        "'speaker_1': 'She was steadfast, insightful and impactful through all the time we were going through this. So thanks again from all of us in the group and as. As a reminder, we have moved the E911 man program office. The council did that to case Haiti over the past year because increasingly it really is a technology platform delivery service that'",
        "'speaker_1': 'is kind of the regional function. And this is this is a case where the process we've gone through, it's been long and a bit arduous, but the process is as important as the strategic planning product you see in front of you.'",
        "'speaker_1': 'This the process and the plan give us it has put the program in a position to adapt it to what is clearly an evolving kind of technology world. So you're saying that to the specific kind of definitions of what, next year 911 means there's still a lot of things that are not completely defined that we're in position'",
        "'speaker_1': 'now to more flexibly and transparently kind of meet the challenges in front of the system. So I appreciate all the efforts.'",
        "'speaker_2': 'Laura mullins, executive director of Communications Center. And I would echo everything that's been said so far. This has been a long, arduous process, but it has been role defining. It is it is a new reality in King County for the peace efforts.'",
        "'speaker_2': 'This process has elevated the attention to the King County Council and beyond. So we have attention and your support has been tremendous. So thank you for that. This is a technology, world and environment and the peace efforts support did support the movement to create.'",
        "'speaker_2': 'But this is also a people job and this is a people world. People called 911. They want to hear a voice. They want to know that something's happening. So the peace efforts, while we support that, we are also very cognizant of the relationship that is required to deliver.'",
        "'speaker_0': 'The nine on.'",
        "'speaker_2': 'One service. And we have a fantastic foundation through this process of strong relationships. So if nothing else, I'm thankful for that. I'm thankful for all of it. But this has redefined the relationship among the county peace efforts and it's fantastic.'",
        "'speaker_2': 'Great. Thank you. We've come a long way, baby.'",
        "'speaker_4': 'And I'm going to just use the phrase creative chaos, and I'll tell you why in a second. But with when you have creative chaos on my mind, you come up with a much better solution than you would have ever had when you started separately.'",
        "'speaker_4': 'So recently we've been talking about some things internally and with several other piece of directors, and we have this constant debate about people and and technology not versus technology. And we actually have, I think, competing, sort of chaotic roles.'",
        "'speaker_4': 'The county is responsible for a technological solution. The piece that directors are responsible for people, but so are we. But at our base and at our core as King County, our responsibility is that technological system that enhances the ability of the peace of directors and their their folks to actually contact or connect with people in the community'",
        "'speaker_4': 'when they're at their worst days ever. And so from that vantage point, that creative chaos is going to continue. But we have a framework now, I think, for working through that. And we yeah, we've come a long way, baby.'",
        "'speaker_4': 'I guess I'll close the same way I started.'",
        "'speaker_0': 'So it has taken a really focused and flexible approach from all the folks at the table. There was a lot of expertize around that table, but also a lot of history, and that can be some of the hardest thing to overcome.'",
        "'speaker_0': 'And I'm just really impressed with how you all did it. So congratulations to you and thank you very much for the hard work. I just have two quick one comment and one question and then maybe we can move to action.'",
        "'speaker_0': 'My comment is to Lisa. I just want to thank you so much for the very clear and simple description of the appeals process. You may recall I was concerned about how complicated it was for quite a while, and I get it now.'",
        "'speaker_0': 'And that's largely due to I know how hard you work to to be able to explain it in a way that an average human being could track. So thank you so much for that. And the second question is about the ten year financial plan.'",
        "'speaker_0': 'It's good news that the the date at which our projected fund balance will go negative has been pushed out by quite a few years from where we were, but we still need to work on it. How will that process come back here?'",
        "'speaker_0': 'Will that come during a budget cycle? Will that be a report? Is there a particular plan for that to come to council?'",
        "'speaker_2': 'So I'll give you a preliminary answer and then I'll probably turn to Tom as the finance chair or if Laura wants. Anyhow, I think it's going to come to you by way of the budget. And you may see some some initial numbers in the upcoming biennial budget proposal as some of the groundwork is laid.'",
        "'speaker_2': 'You'll also probably see some of it. You may see some of it depending on what the content is that's going to be in the contracts that are negotiated with the piece ups. But Tom, did you have any other thoughts.'",
        "'speaker_1': 'Out of the one thing to add in the Regional Policy Committee if there was an addition of an annual report back to that committee? So as part of that report, they'll be a touch back to see like, okay, so what is the financial position of the fund right now?'",
        "'speaker_1': 'Great.'",
        "'speaker_0': 'Okay. Thank you all. We'll look forward to following along with that. And I would that I want to ask Vice Chair Lambert to move this put this item before us for a vote.'",
        "'speaker_2': 'Thank you, Madam Chair. I'd like to propose ordinance 2018 0069.2 of the Dew Point recommendation.'",
        "'speaker_0': 'Okay. Final comments. Questions. Council Member Tomasky.'",
        "'speaker_5': 'Bingaman Chair I just want to add my words of appreciation and respect for folks coming together. It's a different presentation than we had when. This first started. And I think it's a it's a credit to the peace gaps in your leadership, but also to the county and its willingness to listen and respond as a kind of regional'",
        "'speaker_5': 'government and a convening entity, as well as a service provider. And I think we can take some lessons from this experience. It's very impressive that you've worked together to come up with a governing structure, and that will help solve the problems that will come up and the challenges that will come up on a on a going forward'",
        "'speaker_5': 'basis so that things don't bubble over. Right. And that's just really impressive. I know that probably took a lot of work and and discussions and compromise. So I just wanted to commend commend you all at the county and out in the field that do this work.'",
        "'speaker_5': 'Nicely done. And to you, too, Lisa.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. Did you say something, Councilman Leonard?'",
        "'speaker_2': 'So thank you for having served on the committee. I got the privilege of seeing all those balls in the air, and they actually didn't fall on anybody's head, which was a good thing. And it's largely because of all of you at the table being willing to jump in to creative chaos.'",
        "'speaker_2': 'I love that term and being able to be really clear about the the different issues that we were dealing with. And there were many of them, for instance, what the state was doing and all the different variables that we not rush because we didn't know what was ahead and making a decision before we knew some of the'",
        "'speaker_2': 'variables. Coordinating with all those piece ups. And they had very different opinions about almost everything, including whether they really want to talk to each other. It was interesting to watch the body language. The first couple meetings, it looked like the Hatfields and McCoys coming together.'",
        "'speaker_2': 'But by then, you would have thought it was a family reunion of people who loved each other deeply and dearly. So that didn't happen by accident. And so I really appreciate the work that you did to make that happen.'",
        "'speaker_2': 'Dealing with the revenue deficits and what year that was going to be and inconsistencies across the county where certain groups want to do certain things further and faster because of enhanced 911 and and all these things that were shiny but not capable and trying to hold back the shiny, fun, exciting stuff to the realities of getting the'",
        "'speaker_2': 'basics done. So there was a lot that went on and I really appreciate all the work where we are now, the committees, the governance structure. And this was not that easy, left over three years. And I'm sure both of you actually, I'll take your word, are tired.'",
        "'speaker_2': 'But you have really made a huge service to this county and to the protection of everybody. I had to call 911 this morning on my way to work because somebody was smart enough to cover their loads. And there was actually a a lawn mower spreader in the middle of the lane, which is strong enough to do some'",
        "'speaker_2': 'really bad damage to somebody. So I thought about what privilege it is that we have in 911 and the work that you have done. So I just want to say thank you. And to Lisa, you didn't pull out your hair.'",
        "'speaker_2': 'You had to staff each one of us. And in the beginning, this was even more complicated because we hadn't landed any place. And so thank you for being able to continue that they were making.'",
        "'speaker_0': 'Yeah. And I also have I have the list of thank you here as well that I will I will say as part of the getting there, there were some really big decisions around governance, finance and policy that were around technology that were all not clear at the beginning.'",
        "'speaker_0': 'And they all had to be worked through in great detail. So I just want to call out the co-chairs of those. The Governance Task Force was co-chaired by Diane Carson Carlson of King County and Stacey Ellick. The Finance Task Force was co-chaired by our own Tom Koni and Marilyn Beard from Kirkland.'",
        "'speaker_0': 'And the Technology Task Force was co-chaired by Sheila Picard from Bellevue and Bill Kehoe, our former I.T. director. And they all really had a big ship to steer in to bring this all together. And then I finally want to say to Kathy Lombardo, you came out of retirement to help us and that you didn't have to do'",
        "'speaker_0': 'this. You could have been on a beach somewhere. And I understand you're going back into retirement now once this is once this is put to bed. So thank you so much for bringing all of your energy and smarts and patience to this process.'",
        "'speaker_0': 'You did a fantastic job. Thank you so much. I will also again thank Lisa K.R. Council staff because having three council members with varying degrees of engagement and understanding and knowledge and interest is always a challenge. And you were our bird dog on this and you really watched it very closely, made sure that the council's needs and'",
        "'speaker_0': 'interests were met so that when it came to this point, we can have, as you see, a very strong level of support for the final product. And that doesn't happen by a. That happens with a lot of hard work.'",
        "'speaker_0': 'So thank you. Okay. Did you want to say something?'",
        "'speaker_2': 'They did. I just wanted to thank my own staff. And you might want to think your own personal staff. April Sanders, who worked really hard on this and was on one of the subcommittees. And I also want to know if we can put a tracking device on Cathy Lombardo so they can find her.'",
        "'speaker_2': 'And I think the next time you need to.'",
        "'speaker_0': 'Check out the nearest Alfa Romeo dealership. You'll find her there eventually. Yes. No, I will. Thank my own staff. Krista Commons. And who put a tunnel to my chief of staff who put a ton of work into this and was very, very instrumental on the task force that she served on, but also kept an eye on equity'",
        "'speaker_0': 'and how we were making sure that we were including people who we might not be thinking about in our customer base. So thank you for that. All right. With all the thanks and the Academy being thanked, maybe we're ready to move to a vote.'",
        "'speaker_0': 'Would you please call the roll?'",
        "'speaker_2': 'Thank you, Madam Chair. Councilmember Dombrowski.'",
        "'speaker_0': 'Councilmember Dunn.'",
        "'speaker_2': 'Councilmember Garzon, Councilmember Commonwealth I. Council Member Lambert I. Council member McDermott.'",
        "'speaker_1': 'Oh.'",
        "'speaker_2': 'Council member of the Grove. Council member upon return. Madam Chair. Madam Chair, the vote is six eyes, no no's, three excuse.'",
        "'speaker_0': 'All right. If it is acceptable, let's expedite it and put this on consent. That way it can be approved before Cathy leaves. And you can take that with you can take a copy of the final ordinance with you.'",
        "'speaker_0': 'All right. Thank you all very much. Great job. All right. Our final item today is a briefing from the county executive on the executive's office on the employment program called Investing in You. As we all have discussed before, the executive has placed a focus on the county as an employer and investing.'"
    ]
}