{
    "A MOTION making an appointment to fill a judicial vacancy in the southwest district judge position number four of the King County district court.": [
        "'speaker_0': 'Wonderful. And colleagues. That takes us to our next in our final item on today's agenda. And we'll make an appointment to fill a judicial vacancy in the Southwest District Court of King County District Court, a process governed by King County Code.'",
        "'speaker_0': 'Today's appointment will be the first in at least two. The committee will make this year. Applications are currently being accepted for a second position in the West District of King County District Court. I'm going to expect the committee to take up that appointment in February for the appointment before us today in the Southwest District.'",
        "'speaker_0': 'Members will recall that the Council advertised the vacancy last year and accepted applications until December 7th, 2020. We received three eligible candidates during the application period and will be interviewing two candidates today. The third candidate we withdrew their name from consideration.'",
        "'speaker_0': 'While the councilors sometimes used a subcommittee process to interview candidates prior to the committee meeting in order to narrow the applicant applicant pool. We did not do that this time, given the number of eligible applicants. So before we proceed further, I want to provide members of the attendees with an overview of how this process will work, given'",
        "'speaker_0': 'that we've not filled the judicial vacancy remotely before. Let me begin by pointing out that the application materials for both applicants and suggestion questions were emailed to members, most recently at 944 this morning by Terry Rose in. So I would call your attention to that email.'",
        "'speaker_0': 'They have those materials before us within the packet of application materials. The first applicants materials begin on page one of that packet and the second applications materials continue in that same pdf beginning on page 48 of the packet.'",
        "'speaker_0': 'Members should. We'll begin today's proceedings with a brief staff report on the proposed motion from Sound Order of Council staff. And then after the staff report, the committee will interview each applicant one at a time. During the interview, the candidate will not being interviewed, will be placed in a zoom waiting room so as to not get an'",
        "'speaker_0': 'advance review of the interview questions or the other candidates responses. Once both candidates have been interviewed, if there is interest among the council members, the committee will go into executive session to evaluate the qualifications of the candidates. We would we would then rejoin the Zoom meeting to take up the legislation before us and make any decisions.'",
        "'speaker_0': 'Are there any questions on how this will work from either members or candidates before we proceed with the staff briefing and the process? With that. I miss Porter. The line is yours.'",
        "'speaker_1': 'Thank you, Mr. Chair. Sam Porter, Council Central Policy Staff. The materials for this item begin on page nine of your packet. Proposed motion 2020 10006 that would make an appointment to fill the judicial vacancy and position. Member for the Southwest District of King County District Court.'",
        "'speaker_1': 'Left by Judge Mark Ayade upon his retirement under state law, the King County Council as the County Legislative Party is directed to fill district court vacancies by appointment. The King County Code provides a merit selection process for filling such vacancies.'",
        "'speaker_1': 'In accordance with state law. The judge appointed appointed through this process will fill the remainder of Judge Ed's term, which will end in January 2023. District Court is the county's court of limited jurisdiction and has responsibility for traffic infractions, small claims and misdemeanor criminal offenses in counties.'",
        "'speaker_1': 'Unincorporated areas. Cities that do not have municipal court courts and contract with the court to provide those services and for the adjudication of state offenses, which are violations of state statute within the county, or when the arresting agency is the Washington State Patrol or another state law enforcement agency.'",
        "'speaker_1': 'The court handles approximately 250,000 filings annually. In accordance with the merit selection process outlined in King County Code by the application deadline, eligible candidates must submit a current rating of at minimum qualified for a district court judicial physician and the King County Bar Association and at least one other eligible Bar Association operating in King County.'",
        "'speaker_1': 'A Letter of Interest and Resum. A copy of the completed responses to questionnaires submitted to the King County Bar Association to obtain its rating and any supporting information the applicant would like the Council to consider. As the Chair mentioned, three individuals submitted application.'",
        "'speaker_1': 'Candidate Michael Franz withdrew his application as of January 18, and the remaining candidates are from Illinois Masonic I and Brian Todd. In its current form, a proposed motion 2020 10006 has a blank for the name of the person being appointed, and a line amendment will be needed to insert the name of the selected appointee.'",
        "'speaker_1': 'These line amendments appear on pages 18 and 19 of your packet, and that concludes my remarks. I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you. Questions from his partner. Thank you very much. I expect that each interview will take roughly 20 minutes, and I'll ask each candidate and each candidate to provide an opening and closing remarks, each to be limited to 2 minutes.'",
        "'speaker_0': 'A member should have received the prepared suggested interview questions by email yesterday and again this morning at 944 a. In accordance with past practice members to volunteer to read the interview questions. And before the meeting, we randomly assigned the order of interviews.'",
        "'speaker_0': 'And we'll begin with Mr. Mason. Mr. Pisani and then followed by Mr. Todd investor. Any questions I'll now ask the clerk to please to please please Mr.. Time the zoom waiting room now and as a reminder to members and staff, please let the clerks and people from the waiting room avoid the temptation to click on the admin'",
        "'speaker_0': 'button yourself. I know it's tempting. And that is done, I believe. Yes. Mr. Mazzoni, I thank you very much for your interest in the judicial appointment and welcome to the committee of the whole of this morning. I might invite you to begin by offering your opening remarks and ask you to please limit them to 2 minutes.'",
        "'speaker_0': 'You were unmuted and just re muted.'",
        "'speaker_1': 'Give us just a moment, Mr. Chair, please. I'll ask Angelika to make him a call up and also train his body on their excellent.'",
        "'speaker_0': 'There we go. Welcome. We can't hear you quite yet. Give us a moment.'",
        "'speaker_1': 'You should have the capability to unmute himself.'",
        "'speaker_0': 'You were unmuted. When? What? I said you. We couldn't hear you. And then your microphone is now muted according to the zoom screen. There we go. Your immediate. But we can't hear you. Not yet. We'll be patient. You should have seen us in March when we didn't know we were doing it.'",
        "'speaker_0': 'We were all new to this.'",
        "'speaker_1': 'It looks like he's unmuted, Mr. Chair, and his video should be on I.'",
        "'speaker_0': 'We have his. We have your video, sir. I'm. Perhaps if you go to the microphone icon and use the up arrow is there, select the microphone choice. To make sure you've selected your head said this is dangerous when I'm playing tech support.'",
        "'speaker_0': 'The lower left hand corner of the zoom screen should be a microphone icon in the upper right hand corner. It should be an up arrow current. If you click on that, the menu might appear. That includes select a microphone.'",
        "'speaker_0': 'Meanwhile, you are muted again. Maybe it is for a moment. They expect to reconnect. Enjoying this clock if you can be on the lookout to readmit him.'",
        "'speaker_1': 'Thank you, Mr. Chair. We will.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'How are you, Mr. Chair?'",
        "'speaker_0': 'Doing well.'",
        "'speaker_3': 'The good and.'",
        "'speaker_0': 'Well. Good. I spent my weekend pulling my desk away from the wall and getting wires that had been running across the room, actually behind the desk and plugged into the outlet that the desk blocks so well. You can't tell any difference.'",
        "'speaker_0': 'The organization here in my home office looks a whole lot better today than it did last week.'",
        "'speaker_4': 'I can see it. The background looks nicer.'",
        "'speaker_3': 'You have a.'",
        "'speaker_0': 'Vacuum to.'",
        "'speaker_1': 'Nice and you change your on your shirt to.'",
        "'speaker_3': 'Dress up for.'",
        "'speaker_0': 'The occasion today.'",
        "'speaker_1': 'Yes, you did. Yes. That was very impressive.'",
        "'speaker_0': 'You were the one who pointed out the other day that I'm usually in collegiate wear and was out of uniform.'",
        "'speaker_1': 'That's true. That's true. We have to spark things up sometimes, right?'",
        "'speaker_4': 'Have you read all those books back there or are they for show?'",
        "'speaker_0': 'They're all intended to be read if they haven't already been read. The shelf, I like to point out, is the shelf of blue binding, blue bound books that are all together. They're my I'm I'm Childhood Hardy Boys collection.'",
        "'speaker_0': 'Nice. But I couldn't interest my nephews in reading when they hit grade school and started reading. And so they still sit on my bookshelf waiting to go somewhere some day.'",
        "'speaker_1': 'You may have to wait for their children, but come back again.'",
        "'speaker_0': 'I don't think anybody will ever read those editions of Hardy Boys again. They're so out of date. They never text. They use a landline.'",
        "'speaker_1': 'It's good for them to hear ancient history in their.'",
        "'speaker_0': 'Facial recognition software.'",
        "'speaker_2': 'Hello? Can you hear me now? Yes. I am so sorry. I apologize. No.'",
        "'speaker_0': 'Nearly no apology necessary. We were all learning how to do this remotely and completely understand. As I said, you should have heard all of our mistakes and learning curves as we got used to this, and we've just had some practice doing it together to make it all work.'",
        "'speaker_2': 'I was stunned. I was so mystified by Mr. Daly's presentation that, you know, I didn't check to see if the audio was working properly. So that's my fault and I apologize. Happy New Year to everybody here. Thank you, Mr. Chair.'",
        "'speaker_2': 'Mr. McDermott, for allowing me to come. Thank you, council members. It is great to see all of you here. Happy New Year to each and every one of you. My name is Farmer William Sonii, and I was born in San Francisco, California.'",
        "'speaker_2': 'I was raised to the south of market. I moved here to our white center in 1984, where I attended Evergreen High School. I played football there. I played different sports. I was involved in all kinds of activities. I graduated with honors in 1987 and would bestowed the title of Male Student of the Year.'",
        "'speaker_2': 'Later that year, I attended Washington State University. I attended. I worked on the football team and played for coach Mike Price. I graduated in 1992 with a B.A. in Criminal Justice and Minors in sociology and political science. After that, I entered the workforce.'",
        "'speaker_2': 'I went to Alaska to work on a fishing trawler without from Dutch Harbor out to the Bering Sea, out to the coast of Russia. I came back and I was a bouncer for several clubs around the Puget Sound area.'",
        "'speaker_2': 'I eventually worked airport security, and then I started working as a golf course maintenance employee at the City of Tech. Well, as far as the Greens. That led me to volunteer at the Tukwila Municipal Court in 1994, where I worked my way up and became the in court clerk serving judges Jerry Jay Miller and Peter Luke Novick'",
        "'speaker_2': ', and both of those judges that requested me to go to law school. I just asked so many questions. You're like, You got to go to law school. I applied to Seattle University, but due to financial restrictions, I was not able to go to Seattle University.'",
        "'speaker_2': 'So the Honorable Scott Stewart approached me in and we started doing the Washington State Bar Association's Rule six program. It's a four year program. It's a tough program to get through. I graduated in 2003, became took the bar and passed the bar in 2004, worked as a public defender for the cities of of Sammamish, North Bend and'",
        "'speaker_2': 'Kenmore, Sea-Tac in Kent, Lakewood and Milton. And 2006 I left and went to American Samoa and I took up a position with the American Samoan government at the assistant training as an assistant attorney general. I was assigned to the felony prosecutor level to handle domestic violence, child abuse and rape cases and white collar crime and the juvenile'",
        "'speaker_2': 'matters. In 2009, I was federally appointed by the federal government to be the independent prosecutor, and my office played an investigation into a. A very large human trafficking scheme involving public officials from America's some one government. We had many convictions and charges then, and we were able to effectuate the change there.'",
        "'speaker_2': 'In 2012, I relocated my family here to Washington State, and I practiced in the federal bankruptcy court and I entered Chapter Sevens 11 12/13. I represented individuals and banking institutions and the federal and state level for litigation. And I very happily was involved in the Washington state mediation programs here in Washington State.'",
        "'speaker_2': '2014, I began my pro tem career, the City of Issaquah. In 2015, I was assigned as the Pro-Tem Commissioner for the King County Superior Court Juvenile Division under the Honorable Wesley St Clair. And I served that appointment for one year.'",
        "'speaker_2': 'I also started protesting in cities of Seattle, in Des Moines and Renton and SeaTac and Puyallup. And I also been protesting in the King County District Court level at the Mealing Regional Justice Center for the retired March 18 Judges of Amato and Horn and Green.'",
        "'speaker_2': 'And here I am now, applying for this position. I am a father of three. I'm happily married. I've been married for 13 years. Just me and my wife works for the Asian Counseling Referral Services. My children attend school at the school district where my son is a six year old Herschel Walker, and my daughters.'",
        "'speaker_2': 'Two of my daughters attend elementary school at Temple Elementary, and I serve on different committees throughout the Puget Sound area, the Asia Pacific Community Culture Center down in Tacoma. As the president of these Samoan Cultural Week program and I work with the Asia Pacific Organization here on Beacon Hill in Seattle, and we run food drives.'",
        "'speaker_2': 'And I do a lot of pro-bono work and helping people and direct them to the right attorneys to help them with their legal issues.'",
        "'speaker_0': 'If I can ask you to wrap up.'",
        "'speaker_2': 'Yes, that's why I'll wrap up there. I'll stop there.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'And we have several questions various council members will step up and ask. I'll begin with the first one. What is it about your particular skills and interests that would make you a good fit for King County District Court?'",
        "'speaker_2': 'The King County District Court is it's a people's court and it changes as the people change. Growing up on the West Side and seeing all the different changes and the gentrification and start areas that used to be very poor, it's changing the clientele of the individuals who are there.'",
        "'speaker_2': 'And so I think the law has to adapt and has to change along with them at the other. And with that change, you have to be adaptive. And I think that's one of those my strengths is to be adaptive.'",
        "'speaker_2': 'Every time I was told no, I found a way around it. When I didn't get a scholarship to play football, I walked on when I wasn't able to pay for my law school. I did the robotics program every time I tried to do something.'",
        "'speaker_2': 'You have to be a doctor. You have to work together with individuals who are around you to make positive and effective change and not just be selfish and try to do things on your own. Growing up on the West Side and seeing all the different changes that are coming to that area, I think we would have to'",
        "'speaker_2': 'be adapted. There's a large homeless population that lives in Burian. There's also a large Hispanic community and there's a lot of Pacific Islanders and Asians that live on that side and they're not being heard, they're not being represented and they seem lost and confused and there's no voice for them.'",
        "'speaker_2': 'There's no way for them to express themselves. And so I've been a happy mediator between that and helping them get legal help. And if I was assigned to this position, I would try to educate and I would try to teach and I would try to be a voice in the inner circles of the judicial realm to try'",
        "'speaker_2': 'to effectuate change in a positive way, not just for the Asian people or Pacific Islanders, but for everybody across the Social Now report.'",
        "'speaker_0': 'Thank you. Council member Col Wells.'",
        "'speaker_1': 'Thank you. Thank you, Mr. Chair. I. My question is whether in line with what you just answered, but what your superiors in your last position say was your greatest strength?'",
        "'speaker_2': 'Thank you for the question, Councilmember. What? I think I'm personal. I'm a people person. I'm able to get along with different people. I use humor. I use education. I try to use everything as a teaching tool. When people don't understand, when people come into court, they're afraid.'",
        "'speaker_2': 'They don't understand what's happening. They don't understand the charges. They don't understand the process. I take a great deal of time as a public defender to try to explain to them what's going on, why they're being charged with this, what we can do and what their options are.'",
        "'speaker_2': 'Most of the time, they want things that we can grant to them, but at the same time, we are able to identify issues that they have in their lives, whether it's mental health, alcohol, drug addiction, anger management issues.'",
        "'speaker_2': 'And we try to help them get into a position where they're able to receive the help and get the case resolved in a way that won't affect them later on in the future. What we're seeing now is we started seeing a lot of people who are coming back on deferred sentences to some individuals who've been charged and'",
        "'speaker_2': 'receive, stipulated or two continuances that have immigration issues. And those have been and are now affecting them in a negative way where before it looked like it was a really positive way to proceed. And so trying to educate them and try to explain to them that the decision that you make right here, right now is going to'",
        "'speaker_2': 'affect your life for the rest of your life. It may stop you from going into law school or getting a medical degree and how, you know, this one little tiny theft case may stop you from living your dreams.'",
        "'speaker_2': 'And that's not fair. And so I think my superiors would say that I take a great deal of time educating and help guiding them in the right way so that the mistake that they won't come back to haunt them later on in the future.'",
        "'speaker_1': 'Thank you, Mr. Chairman. I follow up on that. Thank you. Conversely, for that answer, what would your superiors in your last position say? What is your greatest weakness?'",
        "'speaker_2': 'I talk too much. I talk. I take it I take so much time with one individual to make sure that they're settled, that I'm not fast enough to talk to everybody else. And so they would have to take over at that point in time.'",
        "'speaker_2': 'But I want to make sure that everybody understands. And so I give everybody the adequate time I want them. And when I'm on the bench, I want them to feel that this is their day in court. It was sitting in court for two or 3 hours waiting for that two or 3 minutes that they appear in front'",
        "'speaker_2': 'of me. I want to make sure that they are heard. So when they leave there, even if I rule against them, they go, You know what? I had my day in court and I don't accept it and I don't agree with it.'",
        "'speaker_2': 'But you know what? I had my day and I try to make sure that everybody feels that way when I'm protesting. And I definitely make sure that everybody feels that way when I when I'm handling their case.'",
        "'speaker_1': 'Thank you. It's kind of like turning a lemon into lemonade, right?'",
        "'speaker_2': 'Yes, ma'am.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Our next question. Councilmember Banducci.'",
        "'speaker_1': 'Thank you, Mr. Chair. It's been very nice to to meet you, and thank you for your application. It's a very detailed application. I don't know what the public knows how much material you've submitted. And I want you to know that we've looked at all of it.'",
        "'speaker_1': 'And I think this is the first time we've ever had a Rule six person who got admitted to the bar that way. And you you said it is a major accomplishment that that is the long road around. So congratulations to you and on all your accomplishments since then.'",
        "'speaker_1': 'Thank you. My question is simple, but so please describe a day we all have had them, especially in the law where things just went really wrong. It didn't go your way. And how do you handle that? How do you how do you how do you react, bounce back, deal with things when they just everything goes wrong?'",
        "'speaker_2': 'Thank you very much for the question. And thank you for the kind words councilmember about about I. The first thing that comes to mind is I had a young lady appear in front of me at the Mealing Regional Justice Center on a DUI case.'",
        "'speaker_2': 'And the case was ten years old. And the one of the retired judges had issued a warrant for $25,000 for her arrest. And she's appearing in front of me to quash the warrant. And I'm looking through the docket and I'm like, okay, she didn't meet her probation.'",
        "'speaker_2': 'She didn't do this. And I'm looking at all the negative things. And her defense attorney came forward and he was arguing that we should quash the warrant. And he presented several things that were really positive and really good and progressive.'",
        "'speaker_2': 'And as I continue to look through the docket, I'm like, well, this judge really wants your 25,000. So my training and everything is telling me how to take her into custody. So I called for the marshal. I said, I'm gonna have to take you into custody.'",
        "'speaker_2': 'And as she said over on the side, and she's getting ready to be processed, and my court clerk is giving me the eye. And if you've ever sat a courtroom and you have a quarter given you, the eyes are pretty sure that the young ladies they work with you are giving you the eyes every once in a'",
        "'speaker_2': 'while. I just in my heart is that, you know what? Bring her back and ask the marshal. Marshal, would it be okay if we can reassess this matter, please? And can we can I talk to one more time?'",
        "'speaker_2': 'And I brought her back before me and I said, You know what? I'm going to do something I normally don't do. I'm going to go back on my ruling. And I've looked at all the things and yeah, this case is ten years old.'",
        "'speaker_2': 'You stayed for five of them. You came in and then your case was continue for two years and then you finally pled guilty and you've been sentenced. And yeah, we don't have this and this, but we have the other four things that are required.'",
        "'speaker_2': 'I'm going to quash the warrant. I'm going to let you go. I'm going to give you another court date to come back. It it's amazing, counsel, remember about it. You want a little bit of patience and compassion can do for that young lady.'",
        "'speaker_2': 'And she stood up and she's appeared for every court date. I checked, she's appeared. She's provided proof of her treatment. She's doing really well. And we're hoping that the end of 2021, her case will be closed finally. And so, yeah, we we all make mistakes.'",
        "'speaker_2': 'We're human. You know, the people that I represent and the people that come before me, I understand that. You know, I remember where I came from. I came from a very poor neighborhood. I moved to White Center, which I thought was pretty cool at the time because, you know, it was it had I had a yard and'",
        "'speaker_2': 'I could climb a tree and and I could do things I couldn't do in San Francisco. And it was great. It was is everybody has a bad day. But there's the mistakes that we learn from the most, not not our successes.'",
        "'speaker_2': 'And so I'm looking forward to if you ask my wife, I make mistakes all the time, you know, but and so but I try to learn from them and I try not to repeat them, especially when I'm on the bench.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I guess. Next question. Councilmember Lambert.'",
        "'speaker_1': 'Thank you. I'd like to welcome you also and thank you. Say that in the era of oral sex was quite the accomplishment. So thank you for not giving up on your dreams.'",
        "'speaker_2': 'Because I think about.'",
        "'speaker_1': 'My I question what is you do you see as the most significant challenge currently facing the district court and how do you think it ought to be addressed?'",
        "'speaker_2': 'Thank you very much for the question, Councilmember Lambert, and happy New Year to you. And thank you for the kind words as well. The significant challenge we have going forward is that first we have this pandemic. We're not able to have jury trials and we're not able to get people to come into the courtroom like we used'",
        "'speaker_2': 'to. I, as a public defender and I practice everywhere throughout the Puget Sound area, I'd walk into a calendar of 60 people and then I'd have to rifle through them and make sure that we're able to get them in the right direction.'",
        "'speaker_2': 'Now, with the pandemic and the spread of COVID, how easy it is, we have to make sure that everybody's health is taken care of. And not just physical health, but mental health. One of the biggest issues I think that we suffer from is that we don't the criminal justice system doesn't treat mental health the right way.'",
        "'speaker_2': 'I think that there should be programs in place, and there probably are, especially if we get some federal funding. As I was listening to Mr. Daley talk, that not only can we put people instead of an issue where somebody suffers their mental health and putting them in jail, we should probably get them more into counseling.'",
        "'speaker_2': 'And not just them, but their family. My sister suffers from schizophrenia and I try to educate my parents and all my brothers sisters about. She's not a martyr. She's not. She shouldn't be ostracized. We shouldn't treat her any differently.'",
        "'speaker_2': 'We should try to understand where she's coming from. Make her feel comfortable. Make her feel like, okay, I'm love. And in that way, when she does have, we can recognize what triggers her and we can try to mitigate those triggers and make sure that she's taking her medication and make sure she's receiving her counseling.'",
        "'speaker_2': 'And counseling could be not just from training, as if it should be with family members and love in the community. And I really accept that as part of the community court and as a public defender, we try to help everybody.'",
        "'speaker_2': 'We could understand where they're coming from through the different programs that we made available. We did the REACH program, we did the lead program. We tried to get them into counseling Asian through my wife's resources, were able to get SARS, come down and offer alcohol and drug treatment.'",
        "'speaker_2': 'It's just a some individuals are not ready for it. They didn't want to make that change because they didn't trust the system. I think the biggest issue that we have in the King County system is getting the trust of the public to make sure that we're doing everything right and that we're there to help them.'",
        "'speaker_2': 'I really think probation should be changed into more of a court support services instead of being the hammer that tells the court that, hey, they're doing something wrong. One of the biggest things I think a judge should be is a great listener.'",
        "'speaker_2': 'But I also think a judge should be a cheerleader. And when people are succeeding, we should be in court and we should saying, hey, this person right here succeeded, and this person right here is an example to everybody else.'",
        "'speaker_2': 'You can do it, too. If they can do it, you can do it. You know, and and I really believe that. And I really am excited to work in the community courts there. And I pro tem the community court in Seattle when they used to run it when it was in operation.'",
        "'speaker_2': 'And it was a fantastic feeling to give people that self-worth and that make them feel good about themselves. And a lot of these individuals, they feel down about themselves all the time and there's no trust there. So you have to build up the trust with the public.'",
        "'speaker_2': 'We have to educate them and we have to make sure that we're there for them. Now, there are those individuals who are going to fail and there are those individuals who won't care. And that's what the court needs to be the executioner as well.'",
        "'speaker_2': 'But do it with compassion and do it by giving them some respect. And I think that we need to have more of a connection with the public. So many times in my career, I've seen judges gotten so old that they weren't connected to the public anymore.'",
        "'speaker_2': 'They didn't understand what was happening in the community. I grew up on the West Side. West Side is my home. Tom. I want to I.'",
        "'speaker_0': 'Want to help the.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_0': 'Thank you. Gentlemen, Brazil. Hello.'",
        "'speaker_4': 'Thank you so much for those words and for being here today, Anthony, and I really appreciate that. We're in a global pandemic that makes congregate and confined settings like courts and jails very dangerous. And so I just wanted to hear a little bit from you how our current crisis impacts your decision making.'",
        "'speaker_2': 'Well, we always lean on when individuals have gone to jail to make sure that we give them the least restrictive means possible. If we're able to use home monitoring or tattoo bracelet or smart start on cases involving alcohol, we make sure that we try to get those people out.'",
        "'speaker_2': 'I think treatment is better than being incarcerated for people who are mentally ill. We try to make sure that we're plugging into different programs, making sure they're taking their medication. I know that from speaking to my sister, some of the medications they take are terrible.'",
        "'speaker_2': 'But if we do least restrictive means, I think that's very important. The other issue that we are having is, you know, we're having so many court these words trying to get processed and trying to get information and everybody's trying to learn how to work on Zoom.'",
        "'speaker_2': 'The good news is that we're able to communicate a lot better with our clients. We're able to have Zoom meetings with them. The bad news is that we have a lot of continuances. So I think what we need to do is we need to make sure that we're able to get plugged in right away with the individuals'",
        "'speaker_2': ', make sure that they are set up in a way that's fair, that they're going to be successful, that they feel comfortable in operating in a zoom system. That's the biggest issue we've been having so far, and we haven't been able to do any trials.'",
        "'speaker_2': 'You know, jury trials are expensive and I love jury trial. Let me do it. I love them. I've done over 100 jury trials on the federal, state, district court and municipal court levels. But trials are expensive. And when I first started as a court clerk, we used to have bench trials all of the time.'",
        "'speaker_2': 'We can have a bench trial with limited people in the courtroom instead of bringing in individuals from the community. And that way we can alleviate them from being exposed to the pandemic. But individuals who are in jail, we got to find ways to get them out.'",
        "'speaker_2': 'The jail is just a petri dish filled with COVID that is going to get everybody sick. We can have a lot more video hearings that we have things that are not, you know, continuances or setting matters to trial or exchanges of discovery.'",
        "'speaker_2': 'Those can be handled by video so that we can try to alleviate the amount of people coming to court. But I think that if we're going to have a jury trial, we're going to have to do it in a way that is conducive to this point, that I'm hoping that this vaccine helps everybody and everybody is able'",
        "'speaker_2': 'to get vaccinated so that eventually we can approach some type of level of normalcy. But I don't think we're ever going to get there again. I think our new level of normalcy is going to include a lot of Zoom hearings in the future.'",
        "'speaker_2': 'I hope that answers your question and happy New Year and thank you for the question. Council members are really.'",
        "'speaker_4': 'Happy New Year to you, too, sir. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Colleagues further questions. The company, I invite you to share with us a closing statement and would ask you to aim for 2 minutes.'",
        "'speaker_2': 'Yes, sir. I will try to stay under 2 minutes.'",
        "'speaker_3': 'Oh.'",
        "'speaker_2': 'Yeah. I like I said, I grew up on the west side. I've watched that area change over the almost near 40 years that I've been there. I've watched my friends places in the park like homes and the other places of low income be rooted out and built new buildings.'",
        "'speaker_2': 'I've seen businesses closed. I've seen just the face of of the West. I change over a period of time, and the law has been very slow to react to that. I think that if we. I think that if I am given this position, I would love to educate a lot more people.'",
        "'speaker_2': 'I would love to go into the schools without violating my judicial independence and try to educate the kids at the school if we can get them young and early and try to educate them. I think we can make an effective change that we wouldn't see a large number of individuals being arrested in the future from on May'",
        "'speaker_2': '9th, 1992. I'm going to shift gears here. My dad and I were taking pictures on the stage of Beasley Coliseum when I graduated from Washington State. And he turned to me and he said, You look like a judge in that roadster.'",
        "'speaker_2': 'From that day to this day. My entire career has been built to this. So I ask that you give me the opportunity to serve the people of the West, and I thank you for your time.'",
        "'speaker_0': 'Thank you very much for sharing your experience and your perspectives and interest in serving on the District Court with us. We're better for it. Thank you, Madam Clerk. If I can ask you to admit Mr. Matheny to the waiting room and invite back Mr. Todd.'",
        "'speaker_1': 'Thank you, Mr. Chair. If you'll just give us a moment.'",
        "'speaker_0': 'Of course. Mr. Todd, I believe you're getting admitted and connecting to the Zoom room itself. Welcome.'",
        "'speaker_2': 'And good morning, Councilman. Thank you.'",
        "'speaker_0': 'Good morning and welcome. I want to thank you warmly for your interest in the judicial position before us today and for taking time to join us here at the Committee of the Whole. I invite you to begin with opening remarks, introduce yourself into perhaps shoot for 2 minutes.'",
        "'speaker_2': 'Very well. Thank you, Councilman, to all the council members. Thank you very much for your time today. I came before you four years ago seeking a position in the same court, and my opening statement began with saying that the Southwest or the district court in general is the People's Court, and it truly is.'",
        "'speaker_2': 'And that has only been encouraged and supported by the work that I have been doing as a pro-tem in the lower jurisdiction municipal courts that I've been working in recently. I have only improved from when I was in front of me four years ago to the point that the minority bars have found me exceptionally well qualified.'",
        "'speaker_2': 'I do continue to feel as though I'd be an incredible asset to the King County District Court and would represent you, the Council, with pride in doing this and in accepting the appointment if you were to choose to appoint me.'",
        "'speaker_2': 'I've always been committed to diversity. I've continued to work with immigrant communities, with their legal issues. As a pro tem, I'm always mindful of the biases that I have. And additionally, as a pro tem, I've conducted hearings in Spanish for clients and for defendants and litigants that come in front of me in Spanish.'",
        "'speaker_2': 'And I think that that just opens the doors to access to justice. And I be committed to access to justice throughout my entire legal career, but especially in being a pro tem sitting on the bench and ensuring that everybody has the access that they have.'",
        "'speaker_2': 'And so I do feel as though I'd be a really good fit for Southwest District Court and I would ask for your appointment. And with that I am open to questions.'",
        "'speaker_0': 'Thank you so much. I'll begin with the first question. And what is it about your particular skills and interests that would make you a good fit for King County District Court?'",
        "'speaker_2': 'I think my particular skills are that I have a diverse background. I come from the gay community. I come from a rural community. And I come from a community that knows immigrant issues and able to work toward those and resolve those.'",
        "'speaker_2': 'Additionally, my unique skills that I have, as I said, I am bilingual and I have conducted hearings for litigants in Spanish. They come in front of me. I recently did a hearing and I believe is in federal way, that the litigant was just so happy that the judge actually spoke his language, spoke Spanish.'",
        "'speaker_2': 'Then he commented, Oh, I hope I can meet you someday. I hope I can meet you. And what I had to tell him in Spanish was that, you know, if we see each other on the street, we can certainly greet each other.'",
        "'speaker_2': 'And it would be a pleasure to know you as well. So I do come from a unique background, a diverse background, and I do have those unique skills in order to allow litigants to come in and have that access that they have to the courts.'",
        "'speaker_0': 'Thank you. I need to be on my mute button. Councilmember Caldwell's.'",
        "'speaker_1': 'Yes. Thank you, Mr. Chair. And thank you, Mr. Todd, for your wanting to serve further and the judiciary, the court system. I have a two part question. What would your superiors in your last position say? Which is your greatest weakness, but also your greatest strength?'",
        "'speaker_2': 'I've always been a strong practitioner, so I don't necessarily have a supervisor, but I will look towards, for example, the court administrators that I work in, in the municipal courts. I think they would say that probably my greatest weakness is that I care possibly too much.'",
        "'speaker_2': 'I want to make sure that everybody is treated fairly, that everybody is received the same decision, regardless of where they come from, regardless of their background, regardless of what they look like. And so I have been careful and slow and deliberative at times in making my decisions to ensure that I'm providing that exact same result for everybody'",
        "'speaker_2': 'else and providing a fair and just result. As far as my greatest skill. I think that it would be being able to relate to people, being able to connect with people and being able to make decisions and tough decisions at that.'",
        "'speaker_2': 'I presided over a criminal criminal suppression motion in Lake Forest Park, and I wrote an opinion for that on my findings of fact and conclusions of law. And Judge Portnoy actually commented that that was exceptionally well written. And so I think, you know, strengths would be the way that I'm able to connect with people, the way that'",
        "'speaker_2': 'I am able to make decisions and the way that I'm able to write and speak and present myself in court.'",
        "'speaker_0': 'Thank you. Councilmember Balducci.'",
        "'speaker_1': 'Look, Mr. Chairman and Mr. Todd, it's good to see you again. Thank you for applying for your interest, for your work. I do like to say at least one thing to each candidate. And the thing that jumped out at me from your application packet was your mediation, training and experience.'",
        "'speaker_1': 'I think that that is extremely valuable to members of the bench to have that experience, to be able to listen for interest through the sort of what may be presenting on the surface of, you know, anger and emotions that that you get in court.'",
        "'speaker_1': 'So I'm very that's that's really stands out to me. My question is, so every, you know, everyone has a really bad day and in court that can turn into a really bad day in court that has, you know, ramifications that go on into the future.'",
        "'speaker_1': 'So if you could describe to us a time when you had just a really bad day and how did you react to that or what did you learn from it?'",
        "'speaker_2': 'We all do have our ups and downs, good days and bad days. And I think over the past year has particularly been trying for all of us to have those good days and to have those bad days. And, you know, there are times I can bring instances where I can think of when, you know, I might have'",
        "'speaker_2': 'been anxious about starting the day and then I'm presiding over cases and I have people coming in front of me that are dealing with similar issues. And I just have to remember, you know, they're probably dealing with issues as well.'",
        "'speaker_2': 'They may be having a bad day as well. And so the way that I deal with it is, you know, first of all, while I'm on the bench, I compartmentalize it, set it aside just to set it aside.'",
        "'speaker_2': 'And because I have to provide justice for people, that's fair, equitable and and and that appears fair regardless of what I'm going through that day, you know. And so I'll set it aside while I'm on the bench. And then when I get off the bench, I will find a good ear to listen to me.'",
        "'speaker_2': 'I will find a good shoulder to cry on, which has happened several times when I've been having a bad day and just checking in with somebody to bring me back to reality, to make sure that that I'm doing what I need to do in the way that I need to do it.'",
        "'speaker_2': 'And so, you know, just number one, realizing that other people go through the same things that we do. Number two, making sure that I'm there, I'm present, I'm doing the job that I need to do. And number three, dealing with my own health and well-being afterwards in between sessions or over lunch or whenever it is, but just'",
        "'speaker_2': 'making sure that I'm healthy as well.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Council member, Lambert.'",
        "'speaker_1': 'Mr. Chair, there are many issues before the district courts at this point. What would you say is the most significant issue and how would you help solve it?'",
        "'speaker_2': 'So I think probably right now the most significant issue before so many of our courts is just the backlog of cases that are set to go to trial. And I'm ready to step in and I'm ready to do that.'",
        "'speaker_2': 'Even the eve of COVID, with social distancing and with all the precautions I recently actually presided over to jury trials in people up in the age of COVID. It was I believe it's November 5th and November six, two separate days, two separate trials that I presided over.'",
        "'speaker_2': 'And it actually worked out very well. We kept the jury separate or kept them apart, kept them distance. Anyway, we made sure that everything was was clean and secure. And so I think right now, at that point, that's the greatest problem that the district court district and lower jurisdiction courts, municipal court and quite frankly, superior courts are'",
        "'speaker_2': 'facing as well as just the backlog of those trials. Because obviously our customer remember, you know, when people are charged with a crime, they have a right to have their trial. But recently it has been getting pushback and back and some people have not been getting their day in court as I'm ready to step in and help'",
        "'speaker_2': 'with that backlog. I also think that, you know, stepping in there with the compassion, with the understanding and with the ability to run a courtroom and a trial efficiently, which I am able to do, would be one of the things that I would step into district court and be ready to go.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Council members are holding.'",
        "'speaker_4': 'Thank you, Mr. Chair. Thank you, Judge Todd, for being here today. We're in a global pandemic that makes confined and congregate settings like jails and courts dangerous. I was wondering how that impacts your decision making.'",
        "'speaker_2': 'It certainly does impact it a lot. And just as one anecdote, the moment that I realized that I was a judge was when I had to make that first bail decision. And you are deciding whether or not somebody is going to be in custody or somebody is going to be out of custody while their case is pending'",
        "'speaker_2': '. And so there are obviously problems with the bail system that we have and whether or not we should be detaining or releasing somebody already. We already know that there are systemic racism that goes through the bail system and making bail determinations.'",
        "'speaker_2': 'People are disadvantaged from not having a stable residence or disadvantage from having problems going around their home. And obviously, we know that there have been recent movements to try to reform the bail system, go to a different type of system.'",
        "'speaker_2': 'For example, in Spokane, I know they were trying to go to a risk needs assessment at one point. But part of the problem with going to a risk needs assessment is that a lot of the data on which that risk needs assessment is based is already racially biased.'",
        "'speaker_2': 'And so it's trying to reform that and trying to come up with a better way to take care of that. And so, you know, in any case, any bail decision that we make as judges, whether a defendant is in custody while in cases pending or a defendant is free while the case is pending, you know, it has'",
        "'speaker_2': 'to be guided by some of those considerations as well. But, Councilman, as you pointed out, in this age and in this pandemic can only exacerbate the particular problem because it puts people, more people at risk of getting COVID, of suffering the complications from that, and and dealing with the implications of keeping somebody into custody.'",
        "'speaker_2': 'And so those are certainly all are considerations that I have to look at in addition to obviously the criminal role. 3.2 looking at whether or not they're likely to appear for court, whether or not they're likely to commit a violent offense, looking at their criminal history and just taking those considerations.'",
        "'speaker_2': 'And so as judges, we have to be mindful of following the rules that we have set when setting bail, as well as looking at the the system, the problems and the individual person that's in front of us. And I'm certainly mindful of that.'",
        "'speaker_2': 'And I do take that into consideration every time somebody is in front of me.'",
        "'speaker_0': 'Thank you. I believe that wraps up my questions from members in my mistaken. Thank you, Mr. Todd. I'd invite you to share a closing statement, closing thoughts with us, and ask you to aim for about 2 minutes.'",
        "'speaker_2': 'But you. Customers. I am extremely humbled to be in front of you here again, and I know that I would take my over 20 years of experience in law and family law, criminal law and courts of law, jurisdiction in the district court and in superior courts, and be a great asset to the bench.'",
        "'speaker_2': 'The time that I've been serving as a pro tem has been absolutely incredible and I would take that energy and I would take that ability into the super excuse me, into the district court. And you look forward to using my skills there as counsel.'",
        "'speaker_2': 'Councilmember Bell Duty said. I do have that mediation training and that really has been a way that I've been able to reframe my mind, look at issues and just allow somebody to be heard. That's really the biggest thing, and that's part of what district court can do.'",
        "'speaker_2': 'District court gives the opportunity for somebody to be heard, somebody to be acknowledged. Have those issues acknowledged as well as have their motions acknowledge? And so that's why I feel as though I would be a really good fit in here.'",
        "'speaker_2': 'I am committed to diversity. I've been committed to diversity. My practice. I mean, what I do in the clients that I work with and the way that I work with them. I'm glad that my I am bilingual. I am able to conduct hearings in Spanish and it just opens up so many doors and is such a pleasure'",
        "'speaker_2': 'and such an incredible opportunity that I have. And I would look forward to the pleasure and the opportunity of serving on the District Court. And if he were to appoint me, I would gladly accept your appointment. Thank you so much for your time.'",
        "'speaker_0': 'Mr.. Mr.. TODD, thank you for joining us today, for your interest in this record and for sharing your perspectives and thoughts. And we're better for it today. We appreciate that.'",
        "'speaker_2': 'Thank you, Councilmember.'",
        "'speaker_0': 'Now, if we meet and readmit Mr. Mohseni, I. No inspections and not admitting myself. We've concluded her interviews, and I'm assuming colleagues would like a few minutes an executive session to discuss the qualifications of the candidates under RTW 4231 ten each.'",
        "'speaker_0': 'The committee is going to go into executive session to evaluate the qualifications of a candidate for appointment to elective office. The committee will be in executive session for approximately 10 minutes until approximately 1147. The committee will be off zoom for this executive session.'",
        "'speaker_0': 'Committee members we.'",
        "'speaker_2': 'Have in our.'",
        "'speaker_0': 'Calendars a Skype meeting to join to conduct our executive session so staff and candidates others can certainly remain here in the Zoom room. Members, please step out and join us in the executive session conversation without we're an executive session.'",
        "'speaker_1': 'Or. The terrorists asked me to notify the listening public that the executive session will be extended. An Egyptian on 7 minutes.'",
        "'speaker_3': 'And. Can I.'",
        "'speaker_2': 'Confirm? My audio is working.'",
        "'speaker_0': 'But we can't hear. You can't number up the growth.'",
        "'speaker_2': 'Now you're messing with me?'",
        "'speaker_3': 'Yep. You know.'",
        "'speaker_0': 'Point. Just another move to begin.'",
        "'speaker_1': 'This question.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'So whatever we do now will go to the council on Tuesday of next week or two weeks.'",
        "'speaker_0': 'If we expedite, it would be next Tuesday.'",
        "'speaker_1': 'That's all I want to know. Thank you.'",
        "'speaker_0': 'So. Eight. All right. And quick. Is he ready?'",
        "'speaker_1': 'Yes, Mr. Chairman. We're ready.'",
        "'speaker_3': 'Just a moment. Okay.'",
        "'speaker_0': 'We back out of executive session in the regular session and I'd entertain a motion.'",
        "'speaker_4': 'Mr. Chairman.'",
        "'speaker_2': 'Thank you. Make sure I get everything right. I would move at this time.'",
        "'speaker_0': 'Motion approval.'",
        "'speaker_2': 'Of motion.'",
        "'speaker_4': '2021.06.'",
        "'speaker_0': 'Counts Number done has moved. Adoption of motion 2020 10006, which would make an appointment to the vacancy in the Southwest District Courts seat for King County District Court. An amendment would be in order.'",
        "'speaker_2': 'Very well, Mr. Chair, as vice chair of the committee, my pleasure.'",
        "'speaker_4': 'And to offer Amendment.'",
        "'speaker_2': 'One be listed on page.'",
        "'speaker_3': '18.'",
        "'speaker_2': 'Which inserts.'",
        "'speaker_4': 'Mr. McKinney.'",
        "'speaker_2': 'Into the position for approval.'",
        "'speaker_0': 'Now comes. Councilmember Dunn has moved the motion in and the amendment won't be adding Mr. Mason. His name comes from a line right there.'",
        "'speaker_2': 'I like to second that motion on behalf of my constituent from Federal.'",
        "'speaker_0': 'We have before us the the motion and the amendment discussion.'",
        "'speaker_2': 'Mr. Chair.'",
        "'speaker_0': 'Council Member Vaughan Wright Power.'",
        "'speaker_2': 'I think we've been very fortunate with the nominees that we've had before us.'",
        "'speaker_4': 'Today, and both were articulate.'",
        "'speaker_2': 'And they represent, I think, the best of folks applying for this.'",
        "'speaker_3': 'Position.'",
        "'speaker_2': 'I support the recommendation of our first nominee. I felt his background, his experience is a very diverse background. She spoke so loudly to the needs of voices in South Kent County, and I don't think I was looking at the faces of my colleagues on the county council.'",
        "'speaker_2': 'As you as he spoke and there was an incredible. You want to bring people together. You were you. I wish you I hope you were able to see the faces of my colleagues as you spoke about your work experience, your life experience, your skills that you bring to the position.'",
        "'speaker_2': 'And I would like to join my colleagues in strongly recommending your confirmation.'",
        "'speaker_0': 'Thank you for the discussion. Councilmember Belushi.'",
        "'speaker_1': 'I just want to add that this process is unfortunately awkward, all being remote. We've been through this a number of times, and it's always easier to have these discussions when you're in the same room with somebody and you can look them directly into their eyes.'",
        "'speaker_1': 'I strongly support the motion and the amendment. I think that Mr. Masonite brings an outstanding level of experience and talent. Talent and skill. His his ratings and his references all reflect that. But there was also, for me, just a very impressive level of humanity being able to sort of hear and feel and reflect the experiences of the'",
        "'speaker_1': 'people that will be appearing before him in his courtroom and tried to do justice in the sense of having people feel heard and supported and helped to succeed, if possible, from those difficult situations. I also wanted to speak, though, to say that in my going into my seventh year on the Council, it's hard to believe I've been'",
        "'speaker_1': 'through with you all, my colleagues, quite a number of appointments now. And we have had applicants who were nowhere near as qualified as either one of these two applicants. And so I want to just say to Mr. Todd that I want to encourage you to continue to pursue this appointment because you are also exceptionally well qualified and'",
        "'speaker_1': 'would make a great judge. We can only pick one here today, but if there were two positions, I would also gladly support you for one of them. So I want to encourage you to continue seeking this job. I think you'll do a good job at it someday and you'll get there.'",
        "'speaker_1': 'Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Member Council member LAMBERT Thank you.'",
        "'speaker_1': 'I too was probably one of the faces council member on I was talking about. I could feel the compassion, the heart and the warmth of our future judge here. And if I were in need of a courtroom and somebody was going to be changing my life, I would want the judge to have the kind of wisdom and'",
        "'speaker_1': 'heart that I saw in his answers. And I also was very impressed when I looked at his varied experience with broad, different kinds of case and the different places where he's worked. It's given him a very broad idea of people's needs.'",
        "'speaker_1': 'And then, of course, the dedication that's been shown over his life over and over. Not the least of which was that he is a lawyer by Rule six, which shows great dedication and the fact that several judges told him when he was younger that he should go to law school because of his inquisitive mind.'",
        "'speaker_1': 'And I think that having an inquisitive mind obscured no more. I care more about others, and so I hardly endorse him.'",
        "'speaker_0': 'See no further discussion. All those in favor of amendment one. B.'",
        "'speaker_3': 'One. I. I.'",
        "'speaker_2': 'I. I. I.'",
        "'speaker_0': 'And those opposed. The ayes have it one vs adopted. We have motion 21 six as amended before us into a further discussion. I will ask the clerk to please call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember WG i. Councilmember Dombrowski.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Dunn.'",
        "'speaker_3': 'Hi, Councilmember Cole.'",
        "'speaker_1': 'Councilmember Lambert. I council member of the grove.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council member upon return. I council members only. All right, Mr. Chair.'",
        "'speaker_0': 'Right.'",
        "'speaker_1': 'Mr. Chair. The vote is 99 zero now.'",
        "'speaker_0': 'Thank you. By your vote, we have given a do pass recommendation to motion 2021 six and we will expedite that to full council for consideration at the full council meeting this coming Tuesday afternoon. Thank you very much.'",
        "'speaker_2': 'Thank you very much. Thank you so much. Thank you. My person, village.'",
        "'speaker_0': 'Council member of Direct Power.'",
        "'speaker_2': 'Just a one question of our our judge elect. You will. Is your father still with us? Yes. Yes. Oh, I want that. I would be honored to meet him sometime in federal way. Yes, sir. Absolutely. Good.'",
        "'speaker_0': 'Thank you. And Madam Clerk, I don't believe we've missed any. Any members missed any votes?'",
        "'speaker_1': 'That's correct, Mr. Chair.'",
        "'speaker_0': 'Thank you. Then, knowing of no other business to come before us and having completed our agenda on the committee, the hall is adjourned. Thank you and good afternoon.'"
    ]
}