{
    "A MOTION confirming the executive's appointment of A.C. Petersen, who resides in council district six, to the King County cultural development authority (4Culture), as an executive at-large representative.": [
        "'speaker_0': 'Thank you. Is there anyone else who would like to offer public testimony today? Anyone else? See, no one will close the public hearing. And that takes us to our first item on business item in today's agenda. We have a motion confirming the executive's appointment of A.S. Peterson to the Council District six seat for the For Culture Board'",
        "'speaker_0': ', actually, who resides in Council District six to the full culture board as an executive At-Large member for the remaining remaining three years of a unexpired term that would end at the end of 2022. Miss Peterson is an active community member and has a background in the arts meeting the criteria for board members established in the charter and'",
        "'speaker_0': 'to open the presentation council. Staphylococcal zoghbi. Ms.. Crackers IP.'",
        "'speaker_2': 'Thank you. Good afternoon. Council Members Amelia Crackles IP Council staff materials for this item began on page seven of your staff report. As the chair stated, this motion would confirm the appointment of A.C. Peterson to the board culture board of directors.'",
        "'speaker_2': 'And just a quick briefing, a quick recap of the board culture board. It's board culture is King County's Cultural Public Development Authority. It was created in 2002 to administer King County's arts and heritage programs, and it's governed by a 15 member board of directors.'",
        "'speaker_2': 'Directors are to have a demonstrated commitment to and knowledge of cultural resources, the active and experienced community and civic and in community and civic issues and concerns, and have an ability to evaluate the needs of cultural constituencies in the region as a whole.'",
        "'speaker_2': 'And directors are to represent a range of talents, experience, backgrounds and viewpoints. Directors must be residents of King County and are chosen to reflect the geographic and cultural diversity of the county. And directors are appointed by either King County Council members or the executive and confirmed by the King County Council.'",
        "'speaker_2': 'So Miss Peterson, who sits beside me, lives in Kirkland, and she's a resident of Council District Six. She was appointed to fill a vacancy for the remainder of this term for Position 13, and she was appointed by executive Dow Constantine.'",
        "'speaker_2': 'She has a Bachelor of Arts degree in architecture and recently recently retired as the communications officers for UW Libraries. She's produced numerous works of dance and choreographed both locally and nationally, and the proposed motion would confirm her appointment to the board culture board for the remainder of this three year term, expiring December 31st, 2022.'",
        "'speaker_2': 'And her appointment is consistent with the criteria established in the Fort Culture Charter or called for park board members. That concludes my Stack Report.'",
        "'speaker_0': 'Thank you. Senior Questions. Leia, Welcome. And on. There you go. Hello.'",
        "'speaker_2': 'Hello. Good afternoon. Thank you. Just to piggyback onto my introduction. Numerous day jobs have been in arts administration at Northwest Asian-American Theater and on the boards contemporary performance presenter Before I most recently went to UTEP Libraries as a communications officer.'",
        "'speaker_2': 'My volunteer work also includes narrating at the talking book and Braille library, where I specialize in pronouncing Japanese words and names. So they select books for me for that. I guess I welcome any questions.'",
        "'speaker_0': 'Are you already participating in the Forum Culture Board? What interests and passions have you found before the board already?'",
        "'speaker_2': 'I've served on the Arts Advisory Committee for six years and what I'm really most passionate about is inclusion for people and artists and administrators of differing abilities. And that is already part of the mission and has evolved as part of the mission most recently and representing geographic diversity as well.'",
        "'speaker_2': 'I grew up in Seattle, but I've been living in Kirkland since 2003, so I'm getting a different view of the county. Also, as an arts, a reviewer for sustained support, I've traveled really all over from federal way to to Duvall to Snoqualmie, to review, to observe arts performances and review them.'"
    ],
    "A MOTION accepting the report on gun violence amongst youth and young adults in compliance with Motion 15234.": [
        "'speaker_0': 'And that takes us to item eight on today's agenda. That is Motion 20 2005, which would accept a report on gun violence among youth and young adults submitted to council pursuant to motion 15234. Which is a fancy way of saying that in summer of 2018, the Council adopted several pieces of legislation that constituted the Gun Safety Action'",
        "'speaker_0': 'Plan, one of which was a study on youth and young adult gun violence. And this is the report that the council asked for that will be presented today. Ms..'",
        "'speaker_2': 'Porter Thank you, Mr. Chair. Sam Porter Council Central Policy Staff. You are correct. This would accept the motion requested, except the report requested by that motion. The motion described the procedure for development and contents of the report, which included engaging and collaborating with King County children and young adults and their families, in particular those who are at'",
        "'speaker_2': 'risk or have experience with the issue of gun violence. To participate in the development of the report that at the minimum should include the following a comprehensive inventory of existing programs that focus on youth violence prevention and intervention, and other community based efforts in the county, such as best starts for kids, community corrections, juvenile Justice Data and'",
        "'speaker_2': 'the Family Intervention and Restorative Services Program known as Firs Gang Violence Intervention and Prevention Initiatives and the Gun Violence Prevention Initiative. The report should also include methods and findings from the interviews and focus groups with youth, young adults and their families and providers who work with youth and their families on issues related to gun violence.'",
        "'speaker_2': 'The report should inform recommendations and strategies to prevent youth and young adult gun violence, and it should be presented to specific groups, including youth and their families who participated in the focus groups. The King County Gun Violence Prevention and Intervention Committee that includes representatives of law enforcement, civic groups and the King County Prosecuting Attorney's Office.'",
        "'speaker_2': 'Existing King County programs that focused on youth violence prevention and intervention. And other community based efforts in the county that impact youth and young adults such as best starts for kids and youth detention. The Juvenile Justice Equity Steering Committee and the and other county committees or task forces charged with issues on this subject.'",
        "'speaker_2': 'The executive was requested to develop the recommendations on how the county can support and strengthen community based organizations. Efforts to curb gun violence and expenditure restriction. About $180,000 was included in the public outdoor public health appropriation during the 2019 second Supplemental Budget to support the development of this report.'",
        "'speaker_2': 'The report includes the five main components as requested, and we have two representatives from public health today, Marguerite Row and Vanessa Quince, and there are two providers in the in the field and then one individual who participated in the focus groups that are here.'",
        "'speaker_2': 'Come on up.'",
        "'speaker_0': 'Thank you. And invite Ms.. Ro, Dr. Quince and team forward, please. Welcome. I don't know who wants to lead off and make introductions and understand. One of you has has to leave perhaps before the presentation is done. So who wants to go first and I leave it all in your capable hands.'",
        "'speaker_2': 'Thank you. Thank you. I'm Marguerite Rowe. I'm your chief of assessment, policy development and Evaluation and director of Chronic Disease and Injury Prevention at Public Health. And I just want to say thank you for the opportunity. As many of you know, we continue to do work on gun violence through collection of data and the lock it up'",
        "'speaker_2': 'effort that we have through public health in our we do a lot of work on quantitative data, but it was very important for us to work with you all on filling in the gaps. And this is really hearing from the voices, particularly of those who are directly and most impacted, and that is the youth and young adults'",
        "'speaker_2': 'themselves. We we're also really fortunate today to hear from our service providers as well and others who have been working in our community to address this issue. So with that, let me turn it over to Dr. Kritz and then we'll go from there.'",
        "'speaker_2': 'Okay. So hi.'",
        "'speaker_5': 'My name is Vanessa Quince. Thank you all for having me here. Thank you for your continued work to gun violence. I also want to thank the three panelists, Beverly, Raquel and Mardy for coming here to share your experiences within the community with us.'",
        "'speaker_5': 'So I just want to be open about the fact that we do have a panelist that needs to leave early today. So I'm going to cut the presentation short because I want to be respectful of the time of the panelist.'",
        "'speaker_5': 'And if there's more information that needs to happen afterwards, we can have that discussion, but we want to make sure that we hear from the panelists. So my name is Vanessa Quince. I am a social research scientist in EPD, which is in public health.'",
        "'speaker_5': 'So I have experience working in or volunteering at juvenile detention facilities in my home state, New York. And I also teach at Monroe Correctional Facility within Washington State. So the issue of gun violence is important to me, both professionally as well as personally.'",
        "'speaker_5': 'In this presentation, I will present the findings of the Youth and Young Adult Gun Violence Report, and then we will go to the panelists and then we will open up to Q&A once again, due to time constraints, I'm not only cutting the already short reports short, but once again, we can go in depth if there is a'",
        "'speaker_5': 'need to go further. So I will get started. And once again, thank you for your time. So this project was in response to a council motion which asks the executive to gather the perspectives of youth, young adults, family members, as well as service providers on the protective and risk factors related to gun violence, and then gather their'",
        "'speaker_5': 'perspectives as well as develop some recommendations from the community as well. So basically before going into the findings, we take a step back and thinking about why should we care about youth and young adult gun violence? So firearm violence affects and impacts King County youth and young adults through both homicide and suicide.'",
        "'speaker_5': 'So what we have here is the number of firearm related deaths and forms of homicide and suicide from 1999 to 2017. In King County, youth and young adult suicide occurs in all places among all races. Basically saying that suicide among youth and young adults is not concentrated, whereas fire homicide rates tend to be concentrated in communities of'",
        "'speaker_5': 'color. So who we spoke with between June and August 2019, the research team and I, it was me, two other social research scientists and then a practitioner conducted 14 listening sessions with youth, young adults and families for a total of 80 youth and young adults participants.'",
        "'speaker_5': 'And then we also had 26 family member family members participate as well. In addition to the youth and young adults, we talked to ten different service providers. So they were either King County staff, different community providers as well as researchers.'",
        "'speaker_5': 'We kept the identities of all the participants. Confidential confidentiality was the main thing that was important to us throughout this research project. In addition to conducting the focus groups, we conducted a demographic questionnaire at the beginning of each listening session just to get an idea of who who we spoke to in terms of age, race, gender and'",
        "'speaker_5': 'other types of demographic information. We also asked participants to check all that apply, to look at youth proximity to gun violence. So participants were asked to check whether or not they, knowing someone that owns a gun, knowing someone who has been shot by or injured, witnessed a shooting, been shot or shot at, carried a gun or been'",
        "'speaker_5': 'part of a violent group. So that explains the chart that you see on the side. So this graph summarizes our key findings, which I will go into further detail later on, but I'm going to open up to the panelist right after I discuss this.'",
        "'speaker_5': 'So basically used described everyday circumstances and their environments as strongly influencing their decisions to engage in gun violence. And we categorize these findings into the macro, local and micro context. So in this report, we talk about the different contexts is which youth are engaging in, which then influences their decisions to engage in gun violence.'",
        "'speaker_5': 'So first we have violent imagery and societal norms. This speaks to social media, mainstream media and news messaging about gun violence. Then we talk about community conditions. Through our report, we find out several different community conditions that either mitigate or contribute to the likelihood of youth engaging in gun violence.'",
        "'speaker_5': 'Next, we have mental health, brain development and masculinity. So how these different things interact with the violent imagery as well as community condition conditions ultimately shapes individual decision making. And then while all these different contexts matter and affect the decisions of youth to engage in gun violence.'",
        "'speaker_5': 'D is easy access to guns regardless of who we talk to. Socio economic group demographics youth describe being easily able to access guns and that contributing to their decisions to engage in gun violence. So I'm going to open it up to the panelist and we asked them to prepare answers for three questions.'",
        "'speaker_5': 'So first, I would like you to provide your name and give us a brief introduction of yourselves. Second, why is the issue of gun violence important to you? And then the third, talking about the recommendations, what are some of the recommendations from this report that resonated with you the most?'",
        "'speaker_5': 'So I'm going to start with or your own recommendations as well. So I'm going to start off with Beverly and then work our way down. Thank you again for coming.'",
        "'speaker_2': 'Thank you very much. I start off with a thread. I talk. My name is Beverly Fletcher Roberson. I'm a come to this work through two organizations, one, Grandmothers Against Gun Violence, where I'm on the board and have been on the board there for four years.'",
        "'speaker_2': 'And now with Grandmothers Against Gun Violence Foundation, which supports research in the area of gun violence. The other organization which I come to this work through is community passageways. I'm also on the board of that organization of helping them work through various infrastructure opportunities to improve.'",
        "'speaker_2': 'My background in general is I'm a retired corporate executive from Weyerhaeuser Company. I lived on the East Side for 40 years. I'm originally from Ohio, and the issue that I had to come to grips with was I was a survivor and am a survivor of gun related domestic violence.'",
        "'speaker_2': 'And and the conditions under which that occurred were the conditions which I believe many individuals find themselves dealing with it today. And that is in a home where there's lots of trauma, historical trauma. My husband was a Vietnam vet, came from a broken family and a number of other issues which instigated several domestic violence related incidents.'",
        "'speaker_2': 'And in addition to that, I adopted a newborn infant at the age of 42 as a single mom, young, African-American, male, and even living on the east side, there was this issue of trust and fear. And that's really why this issue of gun violence is important.'",
        "'speaker_2': 'One of the things that I believe is that and one of the things that came up is the importance of having a trusted adult in one's life. And the reason why that is, I believe, is many of our young people of color don't feel safe and they don't feel safe in their homes.'",
        "'speaker_2': 'They don't feel safe in their schools. They don't feel safe walking down the street. And they don't believe that they can depend on our community service organizations excuse me, our community safety organizations, to provide them with a safe environment.'",
        "'speaker_2': 'And so one of the things that I resonate with community passageways in particular, is the fact that they provide a safe adult, a trusted adult to work with kids and young adults coming through the justice system. And they walk with them one on one throughout the process, allowing them to make mistakes and come back from it, even'",
        "'speaker_2': 'though these individuals aren't family members. Family is really important. So one of the things that I realized, the issue of broken families contributes to gun violence. Okay. And the issue of broken families in trauma. Okay. Having other family members that have been killed, incarcerated.'",
        "'speaker_2': 'Divorce, abuse is a key issue as to why why these individuals are unable to. Many times self-regulate. Yeah. So one of the recommendations that I believe was here was to be able to provide. Mental health services to these youth.'",
        "'speaker_2': 'And the type of mental health service that's really important is healing their trauma. Trauma healing. Everything else is a temporary Band-Aid. So I highly recommend that we have mental health for the entire family, a treatment for the entire family, but not just the traditional mental health, but something that allows these individuals to heal their trauma and self-regulate'",
        "'speaker_2': '. The second area that I would recommend on your support and your recommendations is really having community places where these kids can go to. I identify them as safe places. Well, one of the key issues also is these kids don't feel safe in their homes.'",
        "'speaker_2': 'So when there's domestic violence between a parent and a child in the home, which often occurs, the kids get kicked out and they don't have a place to go. And I've had that experience of having brought in a young man of Ethiopian descent into my home who was adopted by Caucasian parents.'",
        "'speaker_2': 'And there was just tension and there was no place for this child to go to care. And he was highly traumatized from his home country. So we need to have safe places for these kids to go, not just for recreation, but also for the fact that they need temporary shelter.'",
        "'speaker_2': 'There is no youth shelter in South Seattle. For these kids to go to. And so a lot of them are kicked out in the street and they find their their tribe in the street among street gangs, people who they believe are can be trusted.'",
        "'speaker_2': 'Okay. And so I'm going to end there. Other than to say that our police officers play a key role in this resolving gun violence in our community. We get up in arms about the 1%. I come to grandmothers against gun violence because they were in.'",
        "'speaker_2': 'They were involved in mass shootings and interest in mass shootings. I call that the 1% of this movement. Okay. And so I tried to bring into the organization understanding that 80% of the gun related homicides occur among men of color.'",
        "'speaker_2': 'Okay. And in particular, because they don't depend they can't depend on the police officers to keep them safe or to resolve the issues in the community. So there has to be an increase in police trust as well, which does not exist in our community.'",
        "'speaker_2': 'So I will end there. There are other things that I certainly can't say, but I want to give my other panelists an opportunity to just be.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'So Beverly is leaving. So we have 3 minutes left with her here. If there's any questions for Beverly before we take it to the next panelist, that would be welcome.'",
        "'speaker_0': 'I think we're struck by the specific recommendations you lay out, the needs you articulate from both your work in the community and your personal experience. Thank you.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Council Councilmember Caldwell's.'",
        "'speaker_2': 'Thank you, Mr. Chair. And Beverly, thank you for being here. I wish you didn't have to leave already. What you brought out is really compelling in many ways, and I appreciate the recommendations that you have put forth. What if you could boil everything down to one thing that you would like to communicate to us as being the'",
        "'speaker_2': 'most essential and elemental? What would that be? I believe. The most important thing that we have to do is really heal the trauma and to walk alongside of these young people, not just temporarily, and throw money at programs six months, eight months, but have a program that allows them to understand how to self-regulate and help the family'",
        "'speaker_2': 'heal the trauma over several years. Hey, continual economic support for being able to address the trauma that eventually leads to gun violence. Yeah. Thank you very much. I appreciate it. More than welcome to come back. But you probably already see Dominic enough.'",
        "'speaker_2': 'One more question.'",
        "'speaker_1': 'Yes, sure. If you have to leave, no problem. I can ask.'",
        "'speaker_2': 'Please.'",
        "'speaker_1': 'Please. Thank you so much. I wanted to ask you because your report was so amazing and touching and thank you for your work. Thank everybody on this panel for your work, especially because asking the people who are most likely to be impacted by gun violence, what their solutions are is the most effective way to get things done'",
        "'speaker_1': '. And in my opinion, and I'm sure you feel this way as well, can you all confirm that these recommendations laid out in this report come from the youth and young adults who you interviewed? Is this from them or was it screened and changed in any kind of way?'",
        "'speaker_5': 'So I can answer that question, yes. So first, these recommendations reflect like if you three young adults said that they wanted more of something, that is something that is reflected here. We also had a specific question in the room, in the listening sessions, what are some of your recommendations to curb gun violence?'",
        "'speaker_5': 'That is also reflected here. And I think one of the last ones very much is the development community supports and government alignments. That's less from the youth and young adults and more from the service providers and how they articulated one of the ways to address the issues.'",
        "'speaker_5': 'So I would say there are three different ways how we generated these supports. We also did the motion required that we do community report backs. So I went back to community, went back to stakeholders, went back to groups that participated in the report to present the findings.'",
        "'speaker_5': 'And generally they're like, Yup, that's exactly what we said. So I think they're consistent. Yeah.'",
        "'speaker_1': 'So a couple of weeks ago I went to a listening session at New Holly Gathering Hall that the community had called to address gun violence. And they had these focus groups sitting in circles. And one of the focus groups was just youth and young adults.'",
        "'speaker_1': 'And I sat there for most of the time and listened to what those young people had to say. And it struck me that they said the same things that are listed here, and none of them said they wanted more police or more courts or more jails as a response to gun violence.'",
        "'speaker_1': 'And if you really think about that, that's powerful, because the people who should be most afraid that they are going to be shot and killed are not saying they want more policing resources. And that's not to say that effective policing doesn't have a role, but it speaks to what you're talking about, Miss Beverley, which is lack of'",
        "'speaker_1': 'trust that's going on. So any time these shootings are happening and there's a spike, our first reaction is to deploy more policing resources to a group of people who don't have that kind of trust with them. So could you speak on that a little bit?'",
        "'speaker_1': 'What is it going to take to gain more trust? And is are we responding the right way currently?'",
        "'speaker_2': 'Somebody else. Would you like me to answer that? Okay. All right. It's it's interesting you should answer that question, because I've been in contact with the chief that Diaz, Assistant Chief Diaz and Chief Best specifically on the subject of increasing police trust in the community.'",
        "'speaker_2': 'And the key thing is to really, like anything else, have people that are in the community on a regular basis that aren't seen as enforcers. Okay. To to really develop a rapport. We talk about putting a community service office in Pioneer Square, where the businesses are as a result of the last shooting down there.'",
        "'speaker_2': 'Why don't we do something similar in South Seattle or in the other areas where these officers officers are sitting there to be of help, of service, of support, that there is you know, and they are people who look like them.'",
        "'speaker_2': 'We all work best, unfortunately, with people who look and think like us. Yeah, that's just the way the world runs. Okay. It's not the way that it should be. But in, in, in. And I'm really emotional about this because I think we're just missing an opportunity to create community.'",
        "'speaker_2': 'Okay. And that's what we're really wanting to do. These kids, youth, they have been displaced either from their home country. And so they have no community. They've been displaced from the South Seattle area due to gentrification. Okay. They have no sense of community.'",
        "'speaker_2': 'Many of their parents have been incarcerated, killed. They don't have the generational support and report. And that goes back to my first thing, having trusted adults. And so, no, I don't believe that putting more police with driving up and down the street hunting for someone to do that.'",
        "'speaker_2': 'It's more important, really, to have them there, to look for the good and to help people, young people, figure out how to do good. Okay. I'm. I'm verbose. Apologize.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'Thank you. Thank you so much.'",
        "'speaker_0': 'Thank you very much for sharing your time with us not only today, but in developing the report.'",
        "'speaker_2': 'Great again. And well, come back anytime. I appreciate your having me. Thank you. You're welcome.'",
        "'speaker_6': 'I recall the yield to Marty. You go first.'",
        "'speaker_3': 'Hi. My name is Marty Jackson, and I have a number of hats that I wear today and every day. I'm a practitioner with the Boys and Girls Clubs of King County, so that specifically the Southeast Network Safety Net program.'",
        "'speaker_3': 'And I'm also a core team member on the Raider Beach, a beautiful, safe place for youth. I'm a community member from the Rainier Valley area and from Skyway. And so there are a number of I'm also a mother of four young people and one grandchild.'",
        "'speaker_3': 'So I'm a mother and a grand mother as well is another hat that I wear, not just personally, but also as a practitioner. Wise woman once told me, You bring who you are to what you do. And so I find it impossible to not be a mother, a grandmother, a sister, a daughter of two public servants who'",
        "'speaker_3': 'served here in King County for over 30 years. And so this is work that I grew up in, but also came back to work in. And so when I am speaking about gun violence, I was just actually speaking to a colleague of mine.'",
        "'speaker_3': 'There have been a number of these conversations happening pretty much weekly, and I'd be remiss if I didn't say it's all starting to run in together now. And so today, in speaking about gun violence, really, as I was listening to Ms..'",
        "'speaker_3': 'Beverley speak, I have to take it first, not from a practitioner because I have the fortunate, it fortunate for me that that I have an advantage to talk with young people every day and young adults that I work with who are the most marginalized and vulnerable people within our city, the city of Seattle, but also in King'",
        "'speaker_3': 'County. And so every day, instead of there being a focus group for me, every day I have a focus group. Every day I come into contact with young adults who have been harmed by the system, who have been disenfranchized by our school systems and public institutions, and who are hurting and needing assistance.'",
        "'speaker_3': 'And unfortunately, at a point in their life due to the circumstances, not just in their environment and in their neighborhoods, but also because of the disconnect also from law enforcement and some of that historical harm which has caused us to have to create healing circles for our young people.'",
        "'speaker_3': 'About two years ago, my daughter was a victim of gun violence. And so this is very personal for me. My son has been getting involved at the age of 16 to the age of 20 and is now currently incarcerated.'",
        "'speaker_3': 'And so this work goes beyond me as a practitioner. I have unfortunately had to experience the unfortunate harm. Of the systems that I work in and the systems that I trust. And so when I think about gun violence on a personal level, and I think about when my daughter was a victim and when she was not the'",
        "'speaker_3': 'intended target, but an innocent bystander. I think about what didn't happen as a follow up to that incident. And so in speaking about the disconnect, law enforcement as a parent, that was that incident was never resolved. Even though I'm a practitioner, I've worked in this community for over 20 years now.'",
        "'speaker_3': 'And I've worked specifically with gang involved youth working on gang violence prevention. Violence intervention. And I've been doing this for a number of years. And so it is unfortunate for me to have to come from that, but that is what's most pressing for me right now, is the fact that when I had conversations with law enforcement, that'",
        "'speaker_3': 'disconnect. And almost spilling accused. Rather than being a. Citizen and a resident of the neighborhood of whom I've dedicated over 20 years of my life to work with the very young people who may have been at the hand of my daughter shooting.'",
        "'speaker_3': 'It's been very traumatizing for me and my family. But what it has done, it's allowed for me to experience it on a personal level. But I never thought that I would experience before so that I can help the young people that I serve daily.'",
        "'speaker_3': 'And so instead of this becoming a barrier for me, it's become a mission for me. It's become I've redirected that because it's so important for our young people who are disconnected. Gun violence is just a symptom. It is a symptom to what is very deeply rooted in our young people as it relates to trauma, not just individual'",
        "'speaker_3': 'trauma, but historical trauma of our communities, of our families as it relates to our interaction in our relationship with systems. And so, unfortunately, I had to I had an opportunity to experience firsthand the system failing me and my daughter and my family.'",
        "'speaker_3': 'And it was very disheartening. And so how do you come back from that? How do you continue to work as a practitioner and get back to the neighborhood of neighborhood where you're a young person? My daughter was only 15 years old when she was shot.'",
        "'speaker_3': 'And so in looking at some of these. Questions around what the resolution is. Again, I've been in it for a while. It was a part of the Seattle Youth Violence Prevention Initiative in Seattle. And when that started, our organization was very, very critical partner and stakeholder over at the Raynor Vista Boys and Girls Club because of the'",
        "'speaker_3': 'history that we have with marginalized families and communities of color. And so. What recommendations resonate with me? I think on a larger scale, I do believe that young people do not feel safe. I do believe that if I as a practitioner and someone who is connected as I am to the community.'",
        "'speaker_3': 'Parent who are public servants and also was a public official. But if I was able I experienced what I experience with law enforcement as it relates to the incident that happened with my young person. I can only imagine what's happened with other families.'",
        "'speaker_3': 'And so I have to ask myself, why do young people feel unsafe? Yes, there is the environment and the conditions of our community. Poverty. Yes. All of that economic. Economically. I understand that those are also factors. But if our young people do not feel safe.'",
        "'speaker_3': 'As it relates to law enforcement. And I think our a lot of our young people are taking matters into their own hands. And some of their family members as well. And I have to say that prior to the incident that I experienced personally, I didn't quite fully understand.'",
        "'speaker_3': 'Why young people don't feel safe and why they feel the need to carry a gun. After post the situation. I get it. I get it because I have two young people who are both have PTSD. I get it because to a certain degree I have PTSD.'",
        "'speaker_3': 'And so I get it. If law enforcement and analysts and all our law enforcement, there are other systems also that I think contribute. But if our young people are. Running around all I don't want to say running around the community, but in their communities traveling and they don't feel safe because they don't feel like something is going'",
        "'speaker_3': 'to happen as a result of them talking to law enforcement. Then I understand why we have. Well, while we still have this issue. Another thing that I am going to speak on more as a practitioner from young people, I'm hearing mentorship.'",
        "'speaker_3': 'From young people I am hearing. We need to keep the programs in place that are working. And and we need to hit the reset button. This is not just this is an issue that has been an uptick and on the rise, but growing up in the community have grown up.'",
        "'speaker_3': 'Unfortunately, historically, we've experienced gun violence for some time now. And so I am amazed and I am hearing from community members and from youth why when it happened downtown. Is it now a problem for our city and our county?'",
        "'speaker_3': 'Why? Because it happened downtown. And I'm hearing kids say, as Marty. We've been experiencing this all our lives. Gun violence has been prevalent in our neighborhood for years. I grew up in that. Kids are immune to it now.'",
        "'speaker_3': 'Right. And so the question is why now? I mean, these are questions I have to I have to have I have to provide an answer to to my young people. Right. And then the other part is in developing and increasing the alignment between government and community supports.'",
        "'speaker_3': 'We tend to continue with research and with reporting around certain research, but we aren't looking at what historically has worked in the past so that we can kind of continue to add to that. Even though our community has suffered as a collective.'",
        "'speaker_3': 'What I will say is this. There's a tremendous amount of genius in our young people and in our community. There's a tremendous amount of resource, human resource. There's a tremendous amount of resilience, which is what combats trauma. Right.'",
        "'speaker_3': 'And so the answers lie within our communities. So how can we align our systems better so that these resources are funneled in a more holistic way rather than piecemeal, so that our kids get something instead of nothing when our babies deserve a lot more time at.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'It's my turn. Right. Good afternoon, counsel. My name is Raquel Jones, and I'm a targeted program director for Southeast Network, working out of Boys and Girls Clubs of King County. My vantage point, I feel very fortunate in that we recognize that your traditional community centers and our Boys and girls clubs, all those types of things do not'",
        "'speaker_6': 'lend the safe space needed for our young people. And so I've had the pleasure of working on the contract with the City of Seattle for Seattle Youth Violence Prevention Initiative. About myself, I am a victim of gun violence.'",
        "'speaker_6': 'I am a community member in southeast Seattle. So gun violence is going on around me on a regular basis in terms of why this issue is important to me. It's important to me because. It's important to me because I've had to bury my kids.'",
        "'speaker_6': 'I have been. In this work for 20 years. And there's nothing like watching counsel make decisions and all of these millions of dollars being thrown out there and all of these answers, if you will, and standing at the foot of a kid's casket.'",
        "'speaker_6': 'Something about that feels a little bit different. You stop asking yourself about what works. You start asking yourself about what does not work. I'm here to tell you about what does not work. I will tell you that as why V.P. has been effective in leveraging resources from different community organizations to ensure that young people receive mental health'",
        "'speaker_6': 'help, that they receive mentorship, that they can get an internship if they're too young to get a job, that they're able to get employment, that there are mentors that are available and accessible to them, that as community hubs, our organization being one of those hubs, that they would have an established space that we then recreate the program'",
        "'speaker_6': 'so that it fits the kids and not in the reverse. Right. Most of our community organizations are guilty of, hey, this is the space and whatever kids fit into it, they come in, right. We were charged with re reforming that space.'",
        "'speaker_6': 'We have been successful in that. We have not been successful in providing a safe space in the event that gun violence is coming. One of our young people's way and I have to go home at the end of the night what has to happen for this young person?'",
        "'speaker_6': 'And so rather than sit here and rattle off a bunch of recommendations that I feel are just also wonderful, right? I don't feel that I have the answers. I well, I can tell you the things that I've seen work.'",
        "'speaker_6': 'Instead, I'll tell you about Mohammed and Josh. If you ever have an opportunity, please Google him. He's very important to me. He also was the individual that was going to rewrite Lebanon. I was going to be a part of this work going forward.'",
        "'speaker_6': 'This is a young man who has been a Boys and Girls Club member since age ten. Statistics have shown that if a young person is engaging in an after school program on a regular basis, that there are chances of being involved in gun violence are are decreased dramatically.'",
        "'speaker_6': 'Right. He comes to the club every week. He sits down with me. And if I'm not there, he sits down with Marty. And if both of us are busy, he comes back, right. And you sit and you talk about things that are completely on work related.'",
        "'speaker_6': 'Right. And you talk about the things that he needs and what his dreams are. And he talks about some of the troubles that he's experienced in the industry. Well, this particular day, Marty was having a meeting. He comes in, he says, whereas Ms..'",
        "'speaker_6': 'Marty Schneier does not talk to you for a second. I said, Yeah, he calls me out. We go into the wellness center, sit down, and he tells me, I need you to help my brother, my sister. I said, okay, what do you mean?'",
        "'speaker_6': 'Well, I'm not going to be here. I'm confused. What do you mean? Artie. I got into it with some people and they're going to get me on the first one. I think you. You protect yourself. You. I mean, the idea is we're going to encourage them to get a lock box and they're not going to have access'",
        "'speaker_6': 'to parents weapons. I am here to tell you, I don't know that that's the answer. What happens if you're on the street in the dark and it's just you and they have a gun and you don't? What does a lock box do for my day?'",
        "'speaker_6': 'You protect yourself, nephew. You're going to be okay. And two weeks later, we're at the Cedar Brook Lodge in a retreat, having a great time. And they call us to tell us they decided. I should have took them home.'",
        "'speaker_6': 'I don't know where I could have taken them. I should have.'",
        "'speaker_1': 'Actually done something.'",
        "'speaker_6': 'But there is nowhere that I can send him. The county, the city. No one is paying for safe space when a young person is in that situation. How do we fix that? Right. Law enforcement. Yeah, great. I do believe that it is a separate issue.'",
        "'speaker_6': 'It is a separate issue at the end of the day. Our young people have literally stood there at work for eight years, talking kids off of the ledge. I know for a fact there are people who are still breathing because I said.'",
        "'speaker_2': 'Don't do it.'",
        "'speaker_6': 'Proving to him that you're not a punk has to be that. Not as important as how you feel about you. You write your own narrative. I know that young people need those people. But being that person that day, I had nothing for him, nowhere to send him.'",
        "'speaker_6': 'That's why it's important to me. That's how it impacts me. Our organizations connection. I feel like I've made that very clear in terms of the recommendations. I agree that it's important that you align these systems because there is no one organization that can carry the entire torch the folks, the community passageways that are providing legal advocacy.'",
        "'speaker_6': 'I've never heard of that before. That was a whole. And help our kids when they fall into trouble. How do we help them to to navigate those systems? Because we know that statistics show that once they're engaged in those systems, it's very difficult to get them out of it.'",
        "'speaker_6': 'Right. We recognize that as Boys Girls Clubs of King County, we can provide mentorship. We can leverage the resources to ensure that as a as a hub, we can send young people the resources that they need for housing, for internships, for anything that they may need.'",
        "'speaker_6': 'Right. Wraparound services. But, man, if we don't have a safe house. Man if we don't have a safe house. The conversations that are had with young people and their mentors are beyond anything that I can begin to write for you.'",
        "'speaker_6': 'They need that. They need a safe place to go to our community centers. God bless everybody's heart. We're failing. I sat back working on a contract with a brand beach, a beautiful, safe place for youth. And a lot of what we do is I mean, yeah, we break up physical altercations in the rain or beach complex, but'",
        "'speaker_6': 'a lot of what we do is sitting down with adults and helping them to understand how their institutional construct is not creating safe space for our young people. Advocacy. A great deal of the work that I do was outside of my job because those systems that we are all agreeing we can we need a community center is'",
        "'speaker_6': 'not the same as it was before. It is not a safe place for our young people. I will say that in our work with Raynor Beach, a beautiful, safe place for you, it is key that you do have a team like Safe Passage deployed into an area like a rainier beach complex where you have a concentration of'",
        "'speaker_6': 'crime to ensure that you have folks that can mitigate that kind of have established relationship. We're hiring individuals that are indigenous to that community and often gang involved because they can tell you what the issues are better than we can.'",
        "'speaker_6': 'Right? I do think that it's important that, yeah, that law enforcement has to be involved, but it also has to be on a non arrest approach. Right. Like the sweeping way to reach a beautiful, safe place for. That's one thing that they have in common that I sit in agreement with.'",
        "'speaker_6': 'At the end of the day, I'm very intelligent. I'm hilarious. If anybody ever has any time, come see me right. Gab laugh. I know I could work anywhere else. I do what I do because I care about my kids.'",
        "'speaker_6': 'I do what I do because I truly believe in the work that is happening. And I think that it needs to be built upon. Thank you.'",
        "'speaker_0': 'Thank you. Thank you for both of you, for what you've shared about the investments you have in the work that you take on every day, well beyond a report and recommendations. But the personal investment you have.'",
        "'speaker_2': 'Thank you. So I think at this point, we're actually going to turn it back to you, Councilmember McDermott, and the rest of you to, I think what it feels for me right, to acknowledge what we've heard and also to give you an opportunity to ask questions or just further reflections.'",
        "'speaker_2': 'And then we're happy to answer any questions you have about the report.'",
        "'speaker_0': 'Thank you. I have heard loud and clear that the need for safe space, for a safe space, for youth, when they know it, they need it and they can identify it and call it out and how lacking that is in our communities.'",
        "'speaker_0': 'We covered a little bit more directly on Thursday in the Board of Health, but it's on the site now. Some of the things that might begin to point in that direction. But Ms.. Jones, you've also made very clear that.'",
        "'speaker_0': 'It still falls short of that safe space you're speaking of community centers, mental health services, skills training. I'll have value. And today I've heard the clear call for safe space. Council members are. Hello.'",
        "'speaker_1': 'Thank you, Mr. Chair. I just want to thank you all again for your work. Marty, it's good to see you again. I've also lost two close friends, people that I grew up with this year. And it's only February due to gun violence.'",
        "'speaker_1': 'And I know how hard it is to come over here and talk about it. And the way you funnel that emotion into a powerful, clear statement is something that's very inspiring for me. So thank you for that. Thank.'",
        "'speaker_1': 'I've been working with people like Dominique Davis this year and others to see what is missing in our responses. And he'll tell me things like, I know two young people right now who are very at risk for either being shot or shooting.'",
        "'speaker_1': 'And if I just had the resources right now to handle it, we could bring down our gun violence in Washington state by 10% for this year, just by handling two people and responding in a in a very clear way.'",
        "'speaker_1': 'But it doesn't seem like we have the infrastructure in place for that yet. It feels like if we have a natural disaster in our county or Washington state, we have very quickly deployable resources in response to that. But as I'm working with somebody like Dominic Davis and I'm running around where where can we take this young person'",
        "'speaker_1': 'out of this like hot area right now? And just until things cool down, how can we quickly pay you and the outreach coordinators to do their work because they don't have enough resources to to do their jobs right now.'",
        "'speaker_1': 'It doesn't feel like that kind of quickly deployable resource machinery exists for gun violence like it would for a natural disaster. But gun violence is a disaster. Yeah, we don't need to wait until set points in some appropriation period in the budget to respond to an emergency.'",
        "'speaker_1': 'And so that's something that I think us as a council should work on. We should work on that. And with the Executive and Office of Gun Violence Prevention, where we see something spike up and we can act quickly to support those outreach people who are doing their jobs.'",
        "'speaker_1': 'If we have other places in the county where we can take people into a safe space while gang activity or whatever it might be cools down, do you think that would be a good effective idea?'",
        "'speaker_6': 'I think that is an extremely effective idea. And I think that even if it doesn't fix it 100%, it's more than what we have now, which is nothing.'",
        "'speaker_1': 'Can you speak? Do you have any resources that are that come from our local government that you could tap into to quickly give you the resources you need to respond to gun violence?'",
        "'speaker_6': 'No. I can honestly say that I can have a conversation with you prior to I can ensure support, service, support services and wraparound services over there so that you have more more at stake. Right. But whether or not you.'",
        "'speaker_2': 'Choose to respond.'",
        "'speaker_6': 'To someone else's threatening behavior or not in that moment, being able to help them with that split moment decision making. Right. My hope is that the information that I've given you, you will use as a resource. But when things get terrible and they get terrible, right.'",
        "'speaker_6': 'Because I can say it to a thousand kids, if two of them don't catch it, that that those are two kids that are going to shoot someone or someone is getting shot. What is my recourse then? No, nothing.'",
        "'speaker_1': 'That's something we have to work on. Yeah.'",
        "'speaker_0': 'Councilmember Lambert.'",
        "'speaker_2': 'Thank you. Well, thank you for your powerful testimony. And I would like to meet with you later. Absolutely. So we had a meeting on this very topic this morning and the Community Health and Housing Services Committee on how we're going to do exactly what you just talked about.'",
        "'speaker_2': 'Okay. So that's why I'd like to talk to you more about it. We actually do have a place. It's not a popular place, but it has kept kids alive for several years. Okay. And that is in the King County Youth Detention Center.'",
        "'speaker_2': 'We do have beds in there for kids that would not be alive if they were not in there. So when you see the numbers of misdemeanors that are in there, some of those are in there because if they weren't, they wouldn't be here.'",
        "'speaker_2': 'So that's not the best place. But it is a safe place. And so I just wanted you to know that maybe we can work on some systems right away for some of those beds. But we are going to be going on a tour in a couple of weeks, looking at some other options to say, I want to'",
        "'speaker_2': 'talk to you about that. Okay. Thank you.'",
        "'speaker_0': 'Councilmember Bill Dutchie.'",
        "'speaker_2': 'Thank you, Mr. Chair. Just kind of taking this and it's really impactful what you're saying. And it's as you say, we sit here a lot and we hear problems and we come up with solutions and we have this kind of logical thought process we go through.'",
        "'speaker_2': 'It's hard to do that with this one. It's hard to just take it in and think real logically. But I want to offer just a thought that I had while listening to this discussion after hearing what you all had to say.'",
        "'speaker_2': 'The county did pilot an approach to preventing homelessness. Among it started with victims of domestic violence, and it's called the Youth and Family Homelessness Prevention Initiative. I think everybody here is probably familiar with it. And what was new about that program?'",
        "'speaker_2': 'Different issue, of course, but what was new about it was typically grant money comes from the government to an organization for a purpose, and then it's limited. You can only spend it on that purpose. And the initiative said, What if you could use it for whatever you need it?'",
        "'speaker_2': 'What if a person comes in and says, Yes, I'm a I'm a I'm a domestic violence survivor, but my car broke down and I need a few bucks to fix my car. And if I could just fix my car, I'm not going to lose my job.'",
        "'speaker_2': 'I don't lose my job. I might be able to move out and get my own housing and and stabilize. And so they could just hear fix your car like it was it just flexible funds is the term right?'",
        "'speaker_2': 'And so when I hear this discussion, I think, do we need a whole new bureaucracy which is going to come with all its own? Like where was ban $100,000 on the people just to to staff it? Or do we need to think about maybe a flexible funding mechanism where we can find people like Mr. Davis in the'",
        "'speaker_2': 'in the community who are doing this work and say, what do you need? You need something. Here's the fund for you, whatever it is for that kid in that moment. And so I wonder if that's the sort of discussion we might want to have.'",
        "'speaker_2': 'And I just offer that as my first thought that I had sitting here today. But I really appreciate you reliving the things that you've lived through. I looked up Muhammad while you were talking and just looked like a really wonderful young man.'",
        "'speaker_2': 'I know a lot of people are hurt having lost him, and so I thank you for really that for us, so that we can feel it, so that we can think about ways to stop it from happening in the future.'",
        "'speaker_2': 'Appreciate your time. Thank you.'",
        "'speaker_0': 'Councilmember Coles.'",
        "'speaker_2': 'Thank you, Mr. Chair. I'm glad that council member council chair Bell did she blurt out about our Youth Family Homelessness Initiative? But I'm curious about something. And this is in no way to deny all that you're saying. I happen to agree with it.'",
        "'speaker_2': 'Do you? Have you received notices of birth starts for kids funding opportunities? Because much of that starts for kids as put forward to the council by council by our executive Doug Constantine, a number of years ago and which the voters approved, is to get at issues and situations that you've described to prevent them from happening and to'",
        "'speaker_2': 'work with kids, to be able to get them into other opportunities and also to have safe conditions for them. I mean, do you get those notices of funding? If not, we should make sure that.'",
        "'speaker_3': 'We do get the notices of funding. But typically those kinds of incidents that come up aren't typically around as far as funding allocation, whether or not that it's flexible in that way to use it for certain things. I don't know that that's the case.'",
        "'speaker_3': 'And so I think this is an issue with all funding streams, kind of that flexible spending around certain incidents that are occurring, software at the same space. It might be, you know, something as simple as and that's a start, a starting point, a hotel, you know, somewhere offsite.'",
        "'speaker_3': 'And these are all temporary fixes. And so I think what we're called bringing up this issue comes up a lot with us and other service providers. So it's not just I think what we're thinking is it's typically your highest risk kids.'",
        "'speaker_3': 'It's not always the highest risk kids who are in these predicaments. Sometimes it's assaulted. Sometimes it's their kids who are not necessarily have never been arrested or have a background at all. And so these instances come up periodically, more often than not, for service providers in general.'",
        "'speaker_3': 'We're working with a vulnerable population, and the funds don't don't necessarily allow for much of that kind of spending, if that answers your to appreciate that.'",
        "'speaker_2': 'And that's important for us to hear. And certainly nothing in bad starts for kids is a panacea for what you're describing. Everybody's just curious about you. Thank you.'",
        "'speaker_3': 'You're welcome.'",
        "'speaker_0': 'Councilmember up the Grove.'",
        "'speaker_1': 'Thank you, Mr. Chair. And I think some of this is a discussion among us as much as a response to your comments and feel. And Dolores, my I guess my comment or question was kind of along her line, the lines there, if we all sit as we hear these as elected official.'",
        "'speaker_1': 'Okay, what, what do we need to change? What leverage do we have that we can pull and which policies, which budget items? And I think back to how we drive out funding now, we're really lucky. The progressive voters, this county voted for that property tax increase.'",
        "'speaker_1': 'So we as a county government, it's like almost unheard of, are putting like $70 million a year into youth and early childhood stuff. And counties don't normally do a lot of that. So and 35% of that is for kind of youth and young adults, it's about 25 million a year.'",
        "'speaker_1': 'Then we went out. We. I can't take credit either. Our agency went out and did a bazillion community sessions with different cultural groups, different geographic areas to figure out what are the best strategies to invest that money in, and then took what they learned and put together a kind of a citizens led expert panel that helped develop'",
        "'speaker_1': 'the strategies. And then we put those out in organizations apply. What it sounds like is we have gaps in those strategies that there too, there's concern about duty said maybe too specific and too constrained. And we are going to be updating circle wells, maybe know that that levee is going to be up for renewal.'",
        "'speaker_1': 'And when we do that, I think we're doing a systems evaluation and then an updated plan. And I think it's going to be important to have your voices there to figure out. Why? Why are we missing the mark here and kind of fleshing out some of these ideas so that we have strategies that are effective?'",
        "'speaker_1': 'And so it's it may not be just an issue of needing new money. It may be. I mean, we can always use new resources, obviously, but also a question of we've set up this elaborate mechanism under this tax levy and something is not connecting.'",
        "'speaker_1': 'Still, I'm hearings that worries me some and I'm excited to work with you and my colleagues on how we how we get that aligned. That's more of a comment and discussion here. But I wanted to at least express my willingness to engage with others up here and find out how we how we make that work.'",
        "'speaker_5': 'So I can talk to that a little bit. So one of the recommend the executive recommendations or what county can do is like help community based organizations obtain funding to support existing programs. So that becomes like it's not necessarily trying to continue the cycle of government funding these different organizations, but kind of trying to expand the different'",
        "'speaker_5': 'funding streams that community based organizations have. So they have that flexibility on their own, right? So it's not just something that becomes top down and prescriptive, it's something that's bottoms up where they're able to use that money and those resources in the ways that they see fit as well.'",
        "'speaker_2': 'Mm hmm. Thank you, Councilman, for your your comment.'",
        "'speaker_6': 'I wanted to say we welcome an opportunity to sit down and talk with you at any moment. Right. I do think that the point that Beverly referenced is key in terms of being an organization, a community based organization that's providing this work and has been in this work for eight years.'",
        "'speaker_6': 'It is frustrating to watch us gain momentum and then, oh, it's RFP time, right? And so how do we best utilize our historical data to support what systems are have already been in place that have worked? Where are the holes?'",
        "'speaker_6': 'Right. I can say that that data is is is out there. The city has done it. We have done the research with Rainbow Beach, beautiful, say a place with George Mason University. The research has happened with the city in terms of SYP API.'",
        "'speaker_6': 'And I can tell you right now what I know works for our young people. Right. I also can say where the holes are. So I welcome an opportunity to be able to work out the kinks, so to speak.'",
        "'speaker_3': 'And I just want to add, there are a number of evidence based models that we've used, and I'm almost evidence, evidence based, modeled out, place based. And so, again, I've been in this for a long time. And I think what I'm hearing, I mean, because the challenges this right, these efforts work, certain parts of it works.'",
        "'speaker_3': 'And then there are parts that don't work. And then we tend to throw the baby out with the bathwater and then we hit the reset and start all over again. And then you have folks who have been in it, depending on how long you've been doing this, you sit back and you eat your popcorn and think, Well'",
        "'speaker_3': ', we did that one already. I wonder when they're going to find out. Like the flaws in that particular model ceasefire has been used before as it relates to Chicago and other cities. I've been getting symposiums all across the country and it is what was really, really surprising to me is that everyone at a point in time this'",
        "'speaker_3': 'was back in 2013 was trying to get to the model we were at. And I think it has to do with that authentic collaboration. I think we have done some great equity work around inclusion for grassroot organizations. But the answer again, recall that no one organization can handle or do all of this work.'",
        "'speaker_3': 'And so it is going to take a collaborative effort. And I would say one thing that was helpful, even though I didn't care for it at the time through Seattle Youth Violence Prevention Initiative and the current contractual obligations made us work together.'",
        "'speaker_3': 'We all will say I can pretty much better. All 1314 organizations would say it sucked at first. However, when it came down to it and were not being forced to work together and then eventually liking to work together and then eventually saying, Wait a minute, we're getting a lot more bang for our buck together.'",
        "'speaker_3': 'Like this kid is better off when we're all surrounding this kid. Right. And the family and giving them the supports that they need and again, not smelling it, but really giving them all of what they need holistically and seeing the outcomes of that.'",
        "'speaker_3': 'It's been phenomenal. And so I would I feel pretty confident in speaking for a lot of organizations and saying that we're definitely better together. But it is going to take this partnership with the county, with the city, with government in order to put these infrastructures back in place.'",
        "'speaker_3': 'Because since they have been dismantled, if we look at crime data, that's when it started to increase. That's where you see the upticks. But from the years from 2008, when those first five young people in Seattle were killed between the ages of 12 and 1817, there were not any more homicides following that until there was the dismantling'",
        "'speaker_3': 'of a system that was created, which was in 2015. And I've been following this data every year, and I would challenge you all to take a look at it, because we'll see, not just in Seattle. Seattle usually is where we kind of lose the usually at the forefront of it.'",
        "'speaker_3': 'But then you'll see in out King County and other areas, it actually started to increase crime among 25, 18 to 25, which is what that resource didn't cover. And so I say that to say I didn't create the initiative, so I'm not like the spokesperson of it.'",
        "'speaker_3': 'I can only tell you by operating in it what worked and what didn't. We didn't have mental health services, and that was a huge need. And the only thing I'll say about mental health, we've got to do it differently with kids of color, with communities of color.'",
        "'speaker_3': 'We've got to work, destigmatize them, because I'm a big proponent of mental health, but it's got to look different. It can't look the same because I don't believe it'll work.'",
        "'speaker_0': 'Councilmember Dombroski.'",
        "'speaker_1': 'Thank you very much, Mr. Chair, and thank you to each of the panel members for a very compelling and informative presentation. Just to add to the discussion here, I really what resonated with me was that the reset button.'",
        "'speaker_1': 'You try and then it's RFP time. Here we go again. That is a good reminder. A few years ago, the council adopted, after a big community process, our County Youth Action Plan, which is kind of a guiding overall document for youth and young adult policy here at the county.'",
        "'speaker_1': 'Now, you know, maybe getting a little stale, I don't know. But one of the key recommendations in there, which was recommended by Janice Avery, the former recently retired Treehouse executive director, was to county should adopt and we did a fundamental principle of ending the youth to prison pipeline or I think as I like to refer to it'",
        "'speaker_1': 'better creating the youth to opportunity pipeline. A more positive deal. And I bring that up because then what followed was the significant best starts for kids program where we added to that funding stream, which was initially going to be for Little Tots only.'",
        "'speaker_1': 'But we added that that 5 to 24 bucket of funding that councilmember up the grove mentioned to what we called then sustain the gain right make those early investments in young people and then stick with them as they grow through young adulthood.'",
        "'speaker_1': 'I just said all that. I mentioned all that because I think there is some general framework between the Youth Action Plan, the funding streams, which then gets into the at grant time. What are the strategies and programs to implement those strategies that we want to fund?'",
        "'speaker_1': 'I think in our framework, which I think is always open to update from community suggestion, but I think within our general broad framework outline there there's room and should be room to make the kind of investments that you have brought forward today that would be helpful.'",
        "'speaker_1': 'So I think there's I pointed out from folks interested in working on this that I think we are partway there. In fact, the table may be set to be there. And councilmember up the gross remark about getting ready for the renewal of best starts for kids provides an opportunity to check those strategies and programs and make sure'",
        "'speaker_1': 'we have enough funding in the proposal to to fund them. So I would be supportive of working with you all on those things and want to just extend my personal appreciation for the courage you've had today in sharing your personal stories and for the work you've done.'",
        "'speaker_1': 'I love the Boys and Girls Clubs of King County. You're on the front lines. And, you know, he said a lot of lies. You've made a lot of lives better. So thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I want to thank you for coming in and offering your personal insights and your perspective to the value based work that you've engaged in on this topic. And I want to thank Dr. Cranston as well for the report on the structure that brought about this conversation.'",
        "'speaker_0': 'As you've been able to hear from the questions, the conversation you've spread among my colleagues and I. We've had real conversation about what we're doing and what we're not doing and how we can better step in and make sure that the needs are being met.'",
        "'speaker_0': 'And that's exactly what we asked, what we wanted to be able to do from asking for the report. I couldn't be more grateful. Thank you. If anything, the close Marguerite Doctorow quote said.'",
        "'speaker_2': 'What I would say is thank you very much for the the the thoughtful discussion that you all have had and the ideas. I do want to note a couple of things. One is that the board of the next Board of Health meeting, I believe that Patty, our director, Patty Hays, as well as Derek Wheeler Smith, who is'",
        "'speaker_2': 'leading the zero youth detention work, will be coming back to report about what they have been doing and what they are planning and how this may also intersect with this work around. You've been young adult gun violence issues and then just for the record, wanting to be very transparent that I am the King County executive's representative on'",
        "'speaker_2': 'the Communities of Opportunity Governing Group, which is also funded by Best Search for Kids, as is Marty Jackson, who is also one of our governing group members on communities of Opportunity. It it is we need to do more.'",
        "'speaker_2': 'It's clear that we need to do more and that we still have many gaps to fill. So thank you.'",
        "'speaker_1': 'Mr. Chairman. Sorry, I forgot this, but Dr. Rowe reminded me when I first came here on the council, I served on the Mental Illness and Drug Dependency Advisory Committee, the Mid Advisory Committee, and we were coming out of the recession that's a 10th of a penny sales tax.'",
        "'speaker_1': 'So the dollars were down. There again were a number of adopted strategies. And what I recall from that time, and I think my successors on it May, was you mentioned mental health services for young people. The strategies that were not funded out of the mid because of limited funds were those for youth and young adults.'",
        "'speaker_1': 'They did not. Get funded. I have a request for information. How often have we rectified that? As the fund has been enhanced with sales tax receipts, are those mental health services for youth still in the mid program? And how are we doing given the testimony today?'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. And we the presentation actually today is in support of a motion adopting the report. I ask my colleague, council member Cole Wells, who helped who introduced the gun safety action plan with me to make the motion.'",
        "'speaker_2': 'Thank you, Mr. Chair. I move that a proposed motion number 2020 0005 be approved. Council member will do pass recommendation.'",
        "'speaker_0': 'Council member Caldwell's has moved that we give a do pass recommendation the motion 20 2005 16 No discussion. Madam Clerk, would you please call the roll?'",
        "'speaker_2': 'Thank you, Mr. Chair. Councilmember NOGUCHI.'",
        "'speaker_4': 'Hi, Councilman. Didn't back down from the gun. Well, I can remember. I can't remember anything. Right.'",
        "'speaker_2': 'Mr. Chair. Mr. Chair, the vote is seven days zero nos and Council Dunn and Van Rensburg excused.'",
        "'speaker_0': 'Thank you. That do pass recommendation and move to full council. And unless there's objection, we'll place that on the consent agenda as well. With that. I know of no nothing else to come before the committee this afternoon. We are a.'"
    ]
}