{
    "AN ORDINANCE relating to facial recognition, prohibiting the acquisition and use of facial recognition technology by County administrative offices and executive departments, including the department of public safety; and adding a new chapter in K.C.C. Title 2.": [
        "'speaker_0': 'All right, then we will move to item nine. The final item on today's agenda is an ordinance that would prohibit county administrative offices and executive departments from using using facial recognition technology. And we've had two briefings on this legislation previously.'",
        "'speaker_0': 'And you should have I received an email from Nick Bowman of council staff Monday afternoon, which contained follow answers to follow up questions from the last meeting necessary to answer any additional questions you might have. Does anybody have any questions of Nick?'",
        "'speaker_0': 'Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. I will propose to ordinance 2020 1009 will be given a pass recommendation.'",
        "'speaker_0': 'Council member calls has move that we give a to recommendation on to ordinance 2020 191. Gentlemen, brick walls.'",
        "'speaker_1': 'Thank you, Mr. Chair. If you will grant me a few minutes to just give an overview of all of this. And again, it's been very complicated. And even though we have discussed to have briefings a couple of times, I do think it's important for me anyway to go over some of the salient points.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'So as you know, this ordinance before us would ban the use of facial recognition technology in code for King County, and among that would be for King County Sheriff's Office and other agencies. And again, it's very important to remember this is only for our King County government, our agencies.'",
        "'speaker_1': 'It does not do anything for the private sector use, and it does not prohibit usage of facial recognition technology for any other governments. In King County, the county administrative offices and executive departments would also be prohibited from issuing any permit or entering into any agreement, which is a third party, to use facial recognition technology.'",
        "'speaker_1': 'And I think for simplicity, I'm just going to say f, r, t for the time being, and it would be unlawful to obtain facial recognition information on behalf of the county. Now, as we have heard repeatedly, the rapid advancement and sophistication of our party in the last several years has raised concerns over issues such as those that'",
        "'speaker_1': 'primarily focus on the accuracy of the technology, the demographics of biases and encroachment on civil liberties, racial biases in particular are prevalent within this technology. A 2018 study testing three commercial facial analysis services found that the data sets were overwhelmingly composed of lighter skinned subjects.'",
        "'speaker_1': 'Black women in particular are mis identified and significantly higher rates nearly 38% compared to those of other lighter skinned individuals. And with white men having misidentification at a very low point 8%. This technology is simple and less reliable when identifying transgender individuals and entirely inaccurate when used are not non-binary people.'",
        "'speaker_1': 'But apparently it also is more inaccurate or less accurate when used with children or with older people. And multiple studies have demonstrated that it is actually 100 times more likely to identify black or Asian faces compared with white faces.'",
        "'speaker_1': 'Now, when we look at this more demographically, it's really interesting and this is included in the staff report. In Asian countries, the technology is more likely to misidentify non-Asian individuals. In more European countries, it's more likely to misidentify.'",
        "'speaker_1': 'Asians are darker skinned individuals and corporations. Now we've heard the harrowing stories. Some of them I think there are many we don't know about, about a few individuals who were misidentified based on facial recognition therapy technology. Rather, Robert and Bart Chuck Williams went to jail for 30 hours after the Detroit police arrested him in front of his'",
        "'speaker_1': 'wife and children did share. Parks, was jailed in New Jersey for ten days and spent over $5,000 in legal fees to defend himself. Michael Oliver lost his job and car while being held in a Detroit jail for three days on a felony larceny charge.'",
        "'speaker_1': 'These three black men were wrongfully arrested due to false facial recognition technology that had been used for crimes that they did not commit. BARBER Jillian Burch, Hank Williams is now suing for damages. So government agencies using this are to really place our civil liberties.'",
        "'speaker_1': 'Much more harm in jeopardy than should be the case. We know that they can that can particularly be the case when surveillance is used, when there are protests, even riots, but when there are peaceful protests with people being able to use their right to participate, to protest something that they believe that's wrong, they can be surveilled, picked'",
        "'speaker_1': 'out of a crowd. There are facial features used and data that is being that are being kept and I don't know how they would be used. Again, we know from evidence that has come out in research that individuals in minority communities, underrepresented, marginalized communities, people who have a bipoc.'",
        "'speaker_1': 'Demographics are much more likely to be over surveilled and overpoliced anyway. Even without years of effort, this legislation reflects the consensus of M.I.T. Computer science researchers implies that technology companies, scholars and even corporate shareholders and for me, facial recognition mission technology is not a good idea for use by government governments.'",
        "'speaker_1': 'Now we know that even here in Washington State and Puget Sound, there are law enforcement agencies using such technology, including the U.S., Immigrations and Customs Enforcement, the FBI and even the Seattle Police Department. Government entities such as the Port of Seattle have worked with the US Customs and Border Protection to implement facial recognition tech.'",
        "'speaker_1': 'International Airport. And this is worth something that's anecdotal that I've heard. It's not hard data, but that the plans are for our airlines to use facial recognition technology for identifying passengers as they're boarding flights. Now, is that needed?'",
        "'speaker_1': 'I don't think so. And the question for me is, what is used with that data? Later on, we know that some private retailers, such as Rite Aid, have also installed facial recognition technology across the country, larger, apparently in lower income and nonwhite neighborhoods.'",
        "'speaker_1': 'But last year, and I give Riley credit for this, said that it was discontinuing its use of such technology, and this was according to Reuters, from an investigation. Use of facial recognition technology can fuel police power and can increase the possibility of monitoring of marginalized communities, even if the technology is perfect and its use is increasing.'",
        "'speaker_1': 'But. Apparently also its reliability. But even if it were perfect, this is something that we would want. Do we want to be monitored at this level? And what if corporations and governments were housing the data with our facial expressions, our hacked?'",
        "'speaker_1': 'And I mentioned this at the last briefing. I have been notified by my credit card companies that their data have been hacked from something, an event that I attended. Well, what if it's are facial features, not our credit card number or Social Security number?'",
        "'speaker_1': 'What how is that used? Proponents of facial recognition technology have argued and argued today with a couple of people that it is needed to track down missing children. I take that concern very seriously, and this is something I worked on as a public policy maker for a long, long time.'",
        "'speaker_1': 'But as such, we have included language in this proposed ordinance to ensure that our government, our share, is not prohibited to comply with the National Child Search Assistance Act. And keep in mind, according to our executive, No King County agencies, which will be affected by this legislation if it were to pass, use this effort.'",
        "'speaker_1': 'This includes the King County Sheriff's Office. So it would appear that the sheriff's office did not use any of the tools listed that people have cited. Furthermore, the biennial budget included an expenditure restriction which prohibited the use of any King County Sheriff Office appropriations for our party.'",
        "'speaker_1': 'So we've already, in effect, banned this by the sheriff's office, albeit for only two years. But the hard truth is that security and tech companies around the world stand to profit greatly from the development and use and purchase of this product.'",
        "'speaker_1': 'And that's why some oppose the ordinance, and that is why all of us on the council have been receiving contacts from one of these large corporations in our area opposing this legislation. But I believe that we as a county government have a policy to lead with racial justice and equity as the driving force for how we develop'",
        "'speaker_1': 'laws and policies. This is an ordinance that puts equity into action. This is a technology that I believe is fraught with potential risk and the harm to all of our population, and especially to our most vulnerable and already marginalized communities that suffer already disproportionately from its application.'",
        "'speaker_1': 'I ask for your support and keep in mind we can always make a change through legislation. Thank you, Mr. Chair.'",
        "'speaker_0': 'Q Further discussion? Seeing none. Councilmember Caldwell's. Anything to close.'",
        "'speaker_1': 'Mr. Chair?'",
        "'speaker_0': 'I'm sorry. Councilmember Balducci.'",
        "'speaker_1': 'Yeah, I was. I was expecting that there might be others who had thoughts, but I'll share some. I've listened to and read a lot of a lot of things about this proposal. I listened to Councilmember Caldwell speak quite eloquently on a number of occasions.'",
        "'speaker_1': 'Now I have heard from the public and advocates and read a lot of a lot of email, including email from constituents. And I've learned a lot about this technology. I know that it's not something that I had spent a lot of time studying prior to this proposal being made.'",
        "'speaker_1': 'And I think it's very timely and important topic to be giving our time and attention to as a council. And so as I as I listen to the arguments, I think I said this last time, I it's it makes sense to me, too, to pursue a protective principle here, which is that rather to not use or go'",
        "'speaker_1': 'slow in using something until you figure out how to do it well and safely and get the benefit of the beneficial uses while eliminating the risk of.'",
        "'speaker_0': 'Harmful.'",
        "'speaker_1': 'Uses then to just kind of let the horse out of the barn, if you will, because it's very, very difficult for law to catch up to technology in the market. And it would be very hard to try to catch up and control something that's being misused once it's once it's out there, especially something that that depends on'",
        "'speaker_1': 'large accumulations of data and databases like this process does. However, I do want to say, just for the record here today, that I always a little red flag always goes up for me whenever I hear arguments on any topic that are 100% one sided.'",
        "'speaker_1': 'And a mentor of mine once told me there are very few angels or devils in this world and and that probably applies to technology as well as people. There are pros and cons to almost any proposition. And so I listen for those and I try to compare them and I try to think one of the ways to'",
        "'speaker_1': 'navigate the pros and cons. There. We heard today a fairly lonely voice, but a passionately lonely voice in support of some beneficial uses that this technology could be put to. And there certainly are beneficial uses for almost any technology, just as there are harmful uses for almost any technology.'",
        "'speaker_1': 'And so I think this step makes sense. It makes sense for us to go slow. It makes sense for us to be cautious. I echo Councilmember Caldwell's when she reminds people because it's often when we when we change a policy for our own government, we call it an ordinance.'",
        "'speaker_1': 'It is it is a law. And so it's very common. And I've already seen reporting on this ordinance that doesn't make it clear that we are not banning facial recognition technology for everybody, for all uses in all of King County, we don't have that power.'",
        "'speaker_1': 'What we're doing is we're adopting an ordinance that sets policy for King County operations ourselves, saying what we will not do. And I think it's very important to just remind people that that's what this does and doesn't do.'",
        "'speaker_1': 'I could wish for a more nuanced approach, but I also feel that this is the right order, a protective first figuring out beneficial uses allow beneficial uses later. But I think there are beneficial uses. And I think I just wanted to be somebody who said that any technology can be used for good or for ill.'",
        "'speaker_1': 'It's how we use it that matters. And I hope that we don't just passed an ordinance like this and have that be the end of the story forever. I really think that there's a path forward to get the benefit of technological advances while protecting against.'",
        "'speaker_0': 'Risk in.'",
        "'speaker_1': 'Moving forward. So thank you for coming along to share my.'",
        "'speaker_0': 'Fairly wooly thoughts. Thank you.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Council Member Coles.'",
        "'speaker_1': 'And it looks like we have another council member who wishes to speak. But I do need to remind you that we do have a technical stroke in amendment to address.'",
        "'speaker_0': 'Councilmember de Maskey. Thank you, Mr. Chair. I wanted to kind of align myself with the remarks of Councilmember Bellevue. Gee, I'm an original co-sponsor of this legislation, and I view it as kind of a pause and first approach, and it is an internal approach to our government.'",
        "'speaker_0': 'We did something similar on the last APHIS automated fingerprint identification system where they renewal regarding biometric technology, which is a broader phrase for any kind of technology used to identify kind of human characteristics, fingerprint being kind of the the early one.'",
        "'speaker_0': 'But the technology's out there. Facial recognition technology is another. But we're also looking at how people move, you know, their body movements. And there's a it's a growing science area. It isn't perfect, as we've heard. It's got some problems.'",
        "'speaker_0': 'And I kind of have come down on the side of let's let's let's not do it here at the government until we have an opportunity to work through a lesson, until we have an opportunity to work through the concerns, legitimate concerns that have been raised.'",
        "'speaker_0': 'I do think that there could be some valuable and appropriate purposes to put this technology to use at some point if we can work through the issues around it. I have a secondary concern and that is kind of the the government collection of and retention of personally identifying information and all of the risks that kind of go'",
        "'speaker_0': 'with that. And I've had that concern for some time. I raised it when we were looking to build even a customer service database which would span the government. So if you entered for service over in the Health Department, the folks over in permitting might also have, you know, information.'",
        "'speaker_0': 'I just have. I think we need to be careful watchdogs on how much data and information the government collects on folks in the community because it can sometimes intentionally or unintentionally lead to a bad outcome. So I think Councilmember Coles has advanced at this stage and at this time an appropriate policy for our internal government and that'",
        "'speaker_0': 'is we're not going to use this. It doesn't mean we won't explore whether there are other opportunities to bring it forward in a way at some point in the future with appropriate protections and where there's a consensus around its use.'",
        "'speaker_0': 'So that's where I'm at today, and I appreciate everybody that's reached out to me on all sides of the issue, and I've given that careful consideration and to independent research and reading as well. That has led me to being a continued supporter of the legislation.'",
        "'speaker_0': 'So thank you, Mr. Chairman, trying to share those thoughts. Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. I would appreciate the comments that have been provided, and I would like to remind individuals that nothing in this proposal would prevent any organization from continuing to work on helping locate missing children or King County Sheriff's Office does engage and that they do not oppose this legislation.'",
        "'speaker_1': 'And we want to make sure that we, of course, comply with all the federal requirements, none of which require any governmental entity to use facial recognition technology. And with that, I unless there's anybody else who would like to comment, I would like to move our striking amendment S1, which makes technical corrections to the body of the ordinance'",
        "'speaker_1': 'and could explain.'",
        "'speaker_0': 'This is before us. So there are questions regarding this one. Would we like a briefing from Mr. Bowman? Mr. Bowman, if you could outline the effects of the strike in the moment. Oh, absolutely. So the strike simply makes structural and language changes as recommended by the code revised.'",
        "'speaker_0': 'It is purely technical. Seeing no questions of Mr. Bowman. All those in favor of striking Amendment one please signify by saying I am opposed. Nay. The ayes have it. The striking amendment S1 is adopted. Further discussion on ordinance 2020 191 as amended.'",
        "'speaker_0': 'To close Councilmember Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. I think that's all been said again. The last thing just to reinforce that if there were any time in the future where it seemed like it would be beneficial to our government now to to amend this law, given that it would pass, then we can do that.'",
        "'speaker_0': 'Madam Clerk, would you please call the roll?'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Taguchi, Councilmember DEMBOSKY. Councilmember Dunn, Councilmember Coles. Councilmember Lambert, High Council member of the Grove. Councilmember Underground. Councilmember Yvonne regular. I are council members online.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Mr. Chair, the vote is ADA. Is Jonas Councilmember from excused?'",
        "'speaker_0': 'Thank you. By your vote, we have given a do pass recommendation to ordinance 2020 191. We will send that to full council on the regular course and on regular agenda. Council member at the Grove. Are you with us?'"
    ]
}