{
    "A MOTION confirming the executive's appointment of Jacob Taylor-Mosquera, who resides in council district four, to the King County immigrant and refugee commission.": [
        "'speaker_0': 'Is there anyone here to offer testimony on the Immigrant Refugee Commission appointments? I'm seeing none in so meetings and Walgreens. I'm going to move to item six, seven and eight on today's agenda. These are proposed motions, 2021, 171, 172 and 173, which would confirm the executive appointments of Jenny Yang and Juan Cole LaHaye and Jacob Taylor, Mosquera'",
        "'speaker_0': 'to the Immigration and Refugee Commission. Application materials were sent out yesterday in a separate email to council members and Brenda Luskin and from the council staff will provide a brief staff report. Then I'll invite each of the appointees to introduce themselves and share some introductory comments.'",
        "'speaker_0': 'There's going on.'",
        "'speaker_1': 'Thank you. Good morning, Mr. Chair. Good morning. Members of the Committee for the Record, Randle, Eskom and Council Central Staff. The materials for these three items begin on page nine of your meeting packet for today. Just very briefly, these proposed motions, as noted by the chair, would confirm the executive's appointment of the following persons to the King'",
        "'speaker_1': 'County Immigrant and Refugee Commission, Jenny Yang, who resides in Council District eight for a partial term expiring September 30th of 2021. Khawaja or while Ray, who resides in council just before for a partial term expiring September 30th of 2022, and Jacob Taylor Mosquera, who resides in Council District four for a first term expiring September 30th of 2022'",
        "'speaker_1': '. Just as a brief bit of background, in 2018, the King County Immigrant and Refugee Commission was established by Ordinance 18653, which is also codified in King County Code in Chapter 278 to serve as a central point of contact, communication and coordination, to encourage coordination and efficient intersection of the work of stakeholders serving and engaging immigrant and refugee'",
        "'speaker_1': 'residents to achieve greater impact. Of note, the Commission also focuses on understanding and addressing challenges faced by immigrant and refugee communities living in suburban cities and unincorporated areas of the county. A non-exhaustive list of the Commission's duties are provided in county code.'",
        "'speaker_1': 'Of Note, the Commission is comprised of 13 members. A list of membership requirements for the Commission are provided in your of materials and thus are listed on page ten. Per county code appointments to the Commission are subject to Council confirmation and such approval of the proposed motions before you today will fulfill their requirements.'",
        "'speaker_1': 'In sum, the appointments appear to be consistent with the requirements of county code. I'll wrap up by noting that we are joined today by all three appointees of Nunes, Mr. Chair, and fourth committee. I believe that a verbal amendment will be needed for the first item, a proposed motion 0171 to reflect the correct spelling of Ms..'",
        "'speaker_1': 'Yang's first name, which is J. E and A rather than J. E. And with that, that concludes my remarks. Mr. Chair.'",
        "'speaker_0': 'Thank you very much. I'm seeing no questions of the staff reports. I would ask Ms.. Yang to share some opening comments.'",
        "'speaker_1': 'You're welcome. Hello. Hi. Thank you for having me here. Can everybody hear me? Okay, great. I first want to start saying my name's actually pronounced Dina. You know? Yeah. And so. And I'm. I'm really glad to be here.'",
        "'speaker_1': 'I'm meeting everyone through Zoom. Hopefully, we can see each other in person someday. I appreciate you having me here today. I came just just to let you know, my little background, my hometown is actually Anchorage, Alaska. And I came to Seattle for college and I stayed here ever since.'",
        "'speaker_1': 'And during my time here in Seattle, I worked with a lot of communities, including my own community, kind and AAPI community. But I've worked many years with immigrants and refugees, and for me, being part of this commission made sense.'",
        "'speaker_1': 'And my friend Muhammad, who I worked closely with during my time working for Senator Maria Cantwell, she suggests that I should try to be part of this commission. And so, you know, last year was I turn in my application and I really, really enjoyed being part of the meeting so far, and hopefully I can be more involved'",
        "'speaker_1': 'in the future.'",
        "'speaker_0': 'Thank you so much. I will ask Mr. Railway to introduce himself. We'll follow follow through with everyone making introductory statements. Then we'll open it up to a conversation. Yeah.'",
        "'speaker_2': 'Thank you very much. My name once again is called You're a Worry. And I'm really happy to be appointed to the commission. My background. So I'm originally from Ghana and have been in Seattle for a number of years and actively involved in the African immigrant community.'",
        "'speaker_2': 'So specifically, I've served as the President of the Washington State Coalition of African Community Leaders and currently serves on the board. So I currently serve on the Council of Coalition, so we actively engage all of the African community leaders through which we reach out to our African community members here in Washington State and specifically King County, where'",
        "'speaker_2': 'we have majority of of African immigrant community living in making life so and actively in the last 3 to 4 years, helping the community and achieve the needed resources and as well, the pathway to make make life enjoyable here in King County.'",
        "'speaker_2': 'I've also been working with Soca Without Borders Seattle, which focuses on youth programs for immigrant communities here in the Seattle area. I've been working as a coach and mentor for newcomers to Seattle and King County area and helping them integrate well into into the city, to school the whole system to make sure that the training well.'",
        "'speaker_2': 'Most of the reason being that I speak different languages as well Portuguese, Spanish, English and I've been able to labor on the world and that helps me connect well with the immigrant community. So I feel very excited and I know I'm going to add value to the commission too to engage everyone and help address the needs of'",
        "'speaker_2': 'our immigrant community here in King County, which is really growing. So it looks like the population today is probably around 22 to 25% of the total population of King County. And out of that, the African immigrant community is roughly around 8%, which is growing in King County here.'",
        "'speaker_2': 'So I'm very happy with some of the council members. So give my and councilman up to grow up to grow up as well from from King's area and and others that I've met in person. And I look forward to working with with all of you to help the immigrant community here in King County.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you and welcome. And now, Mr. Taylor Mascara.'",
        "'speaker_2': 'But are they as everyone expects them being? Hope you all are doing well named Jacob telling Mosquera I'm up here in Northgate area, sending you all warm wishes for your families. Hope you're all staying safe. I am a Colombian adoptee here in Seattle, standing in firm representation of the Colombian community, as well as Colombian adoptee community.'",
        "'speaker_2': 'I'm excited to be a part of this commission and really, really, really enthusiastic about everything that's on the horizon for this county. I think we're headed in the right direction. Also, a little bit of my background. I have studied in multiple places, most recently here in Seattle at Seattle University, doing public administration right now.'",
        "'speaker_2': 'Very much looking forward to transitioning from teaching in middle school conjugating verbs with seventh graders into doing all the much more tangible work that you all are doing. So looking forward to collaborating with all of you in multiple ways.'",
        "'speaker_2': 'And yeah, I'll be I'll be brief with that. Just to say that Colombians are going through a really tough week this week. So if you have a chance to check out the news, please just reach out to any of your Colombian neighbors or friends.'",
        "'speaker_2': 'We're experiencing supreme state violence against civilians across the country down there, and especially in my hometown of Cali. With that, I'll come back to you, Mr. Chair, and good morning to everyone. And again, please stay safe out there.'",
        "'speaker_0': 'Thank you. My husband was reaching out to some colleagues he's worked with yesterday. Colleagues questions of our nominees or appointees before us today. Councilmember Balducci.'",
        "'speaker_1': 'Thank you, Mr. Chair. Yes. My condolences for the terrible violence and situation that we're seeing. I've read some terrible stories this morning about people finding out that their loved ones have been killed. And I'm just so sorry to hear.'",
        "'speaker_1': 'Thank you, all three of you, for your willingness to give your personal time to this to this work. It does help us to be a better government, and you do it on your own time. So we really appreciate you for bringing your experiences and your knowledge.'",
        "'speaker_1': 'I guess I would just ask a question to any of you who have an answer. If you could name one thing about county government that that we could think about improving our services to immigrants and refugees. Like what?'",
        "'speaker_1': 'What do you bring to the table as you arrive any any guidance that you think we should be talking about, thinking about in terms of improving our service to those members of our county community.'",
        "'speaker_2': 'I think I can start and I mean when I think about the government serves the community today what we are all going through the pandemic access to vaccination you know via language access so where my community that I'm engaged we've been actively engaging little community clinics to.'",
        "'speaker_0': 'Really.'",
        "'speaker_2': 'Ensure that our communities get access to the vaccine and also helping provide language and language access to to ensure that they understand what it what it is in for them. Because there's a lot of head to head to hesitancy within my community when it comes to access to the vaccine.'",
        "'speaker_2': 'And so it would be very helpful, you know, going forward, engagement of everyone. You know, most of our community members live in in Cairns and so, you know, council members within that area can start King County to be actively engage and help address that the fear and help community organizations that are actively engaged in this work to'",
        "'speaker_2': 'support them and make sure that you reach out. Not everyone can go to all these mass vaccination sites. You know, not everyone has this access to to cross, to drive or you've been to the bus to all these mass vaccination sites.'",
        "'speaker_2': 'So I'm really in favor of having, you know, community organized vaccination clinic to ensure that majority of our immigrant communities are vaccinated as quickly as possible to ensure that there's equity on that front. Thank you.'",
        "'speaker_1': 'Thank you. Very good. I think for me, my current role, I currently serve with Congressman Adam Smith as a casework director. And one thing I have noticed, especially as I work with immigrants and refugees directly, is that a lot of times I have to explain policies to them.'",
        "'speaker_1': 'And a common language is something simple for that for them to understand. And I think that's something that I would like to bring it up to the council by having some of the policies, in a word, in a language that everybody can understand.'",
        "'speaker_1': 'Even for me, someone who is fluent in English, when I read something, I have to look it up or have to double check because there's there's something there's a language there that I can mean, I think, many different things.'",
        "'speaker_1': 'Right. And so I think if we can make it more access, more access to our communities, I think that will be really helpful. And if there's any way that I could assist with, please let me know. But other than that, that's what I want to bring it up today.'",
        "'speaker_2': 'Thank you, everyone. Customer Thanks for the question. I think as a teacher in the community, I teach in the small private school and also in Seattle Central College. I would say a robust consideration can sustain consideration for more outreach in the education sector.'",
        "'speaker_2': 'Right. A lot of my students, both in the high school and middle school as well as community college, have an idea that a commission like this even exists. Right. And so so I think in around running right away with yeah.'",
        "'speaker_2': 'More concentrated outreach and education spaces would be really, really, really beneficial. And that's that's my piece. Thank you again for the question.'",
        "'speaker_1': 'Very good. Thank you all for your answers and again, for your willingness to serve. Really? It really means a lot to us.'",
        "'speaker_0': 'I'm curious if any of you have had the opportunity to already join some meetings of the Commission and if so, any impressions you have of the current work and where it might be going?'",
        "'speaker_2': 'I couldn't talk to that. I was at the last meeting, actually, Councilmember Barghouti, you were there. And I think my first impression was how concise and organized everything seemed, which was a pleasant surprise in my classes. And tell you right now we're talking about it a lot about the the constant struggles with bureaucracy.'",
        "'speaker_2': 'And it was just refreshing to see how, how, how time everything worked and the direction. The focus of that conversation was justifiably centered around COVID and vaccine vaccinations. And so I just I was happy to be just a fly on the wall, very much looking forward to more conversations about about issues affecting our community as far as'",
        "'speaker_2': 'the direction that it's going. My impression was very positive, and I say that because, again, it was it was just obvious that people came prepared. People were passionate. And that's that's something fantastic to step into.'",
        "'speaker_0': 'Further questions. Herein? None. I would entertain a motion to approve to give a do pass recommendation in motion. 2021 171. So move. Mr. Chair, we have motion 2021 171 to appoint Gina to the Immigrant Refugee Commission. May I ask for a verbal amendment to correct the spelling of misused first name?'",
        "'speaker_0': 'To correct it to one and.'",
        "'speaker_2': 'Some of.'",
        "'speaker_0': 'Mr. Chair. All those in favor, please say I apologize. The ayes have it. The correction is made. Further. Any further discussion on this motion? Madame Curie, I'd ask you. Please call them all.'",
        "'speaker_1': 'Thank you, Mr. Chair. Council member II. Council member. Kim asking i council member Dunn I. Council Member. Cornwall's High Council Member Lambert I. Council Member Abdullah II. Council Member one My car.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council members online.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 99 zero on us.'",
        "'speaker_0': 'Thank you. By your vote, we have given a do pass recommendation to motion 2021 171 and we will put that on consent at full council. I would entertain a motion to approve both because there are no amendments to approve both motions 20, 21, one, 72 and 173.'",
        "'speaker_1': 'So moved.'",
        "'speaker_0': 'From. It's been moved that we give it to pass recommendation to motions 2021, 172 and 173 went in Mr. Away and Mr. Taylor must go to the Immigrant Refugee Commission. See no discussion of those. Madam Couric, if you'd please call the roll.'",
        "'speaker_1': 'Thank you, Mr. Chair. Councilmember Belushi. I. Councilmember Demovsky.'",
        "'speaker_3': 'Hi. I am.'",
        "'speaker_1': 'Councilmember dan.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Coles I. Councilmember Lambert I. Councilmember autograph i. Councilmember Vaughn right there.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Council members online.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. Chair. The vote is 990 nos.'",
        "'speaker_0': 'Thank you. By your vote, we've given a do pass recommendation to the appointments of Mr. While Ray and Mr. Taylor must go to the Immigrant and Refugee Commission. And we will put those on the consent agenda for council as well.'",
        "'speaker_0': 'I want to thank everyone for their indulgence in taking items out of our usual order, and we will move back up the agenda to public comment. And Madam Clerk, I do believe we have people on the line for public comment.'"
    ],
    "AN ORDINANCE relating to facial recognition, prohibiting the acquisition and use of facial recognition technology by County administrative offices and executive departments, including the department of public safety; and adding a new chapter in K.C.C. Title 2.": [
        "'speaker_0': 'Tell your father good luck with the Father's Day present. I think we'll give it up. Okay. And that brings us to item nine in today's Agenda Ordinance 2020 191 that would ban an ordinance that would prohibit county administrative offices and executive departments from using facial recognition technology.'",
        "'speaker_0': 'We had an initial briefing and discussion on this in our last meeting. I mean, we have Nick Bowman from policy staff to re-orientate us on the proposed ordinance. Mr. Bowman. Bowman, the line is yours.'",
        "'speaker_2': 'Thank you, Mr. Chair. Good morning, council members. For the record, Nick Bowman, Council Central Staff Materials for Agenda Item nine begin on page 23 of your packet. I think they're missing. This is the second presentation of the proposed ordinance.'",
        "'speaker_2': 'So I plan to provide an abbreviated staff report that skips over some of the lengthy, lengthy background on facial recognition technology and focuses more on the proposed ordinance itself. Proposed Ordinance 2020 10091 would ban the acquisition and use of facial recognition technology or f r t by county administrative offices and executive departments.'",
        "'speaker_2': 'The proposed ordinance would also prohibit our administrative offices and executive departments from issuing any permits or entering into any agreement which authorizes a third party to use FRC or obtain or access facial recognition information on behalf of the county.'",
        "'speaker_2': 'However, evidence relating to the investigation of a specific crime that may have come from FRC may be used by county administrative office or executive departments so long as the evidence was not generated by or at the request of a county officer.'",
        "'speaker_2': 'Department for the Community Benefit County Administrative Offices and executive departments include all county agencies except for the Prosecuting Attorney's Office and the courts. The proposed ordinance defines facial recognition technology as any computer software or application, which assists in identifying or verifying the identity of an individual based on the physical characteristics of the person's face and does not'",
        "'speaker_2': 'include the analysis of facial features to grant access to electronic devices or to use or using redacting software to protect the privacy of an individual depicted in the recording, which is intended for release or disclosure, so long as the process does not generate or result in the retention of any facial recognition information.'",
        "'speaker_2': 'Facial recognition information is also defined as any data or information obtained or derived from. The proposed ordinance would establish a process for county personnel who inadvertently or unintentionally use or access facial recognition information. This process would require county personnel to notify their direct supervisor that they have received, used or gain access to the information and that they'",
        "'speaker_2': 'immediately delete the information subject to applicable laws. Any facial recognition information collected or derived in violation of the established ban would be considered unlawful. To obtain violations of the established ban would constitute an injury to which a person subject to the violation may seek relief in court.'",
        "'speaker_2': 'Furthermore, a prevailing plaintiff in any such court proceedings would be entitled to the award of costs and reasonable terms. In response to some of the questions raised in a previous meeting. I included a table that begins on the bottom of page 28 of your packet that compares the recently adopted state law regarding FRC and the proposed ordinance'",
        "'speaker_2': '. As you will see, the primary difference is, is that the state law would allow for the use of FRC, provided any state or local agency adheres to certain provisions regarding transparency, testing and training, whereas the county would outright prohibit the use of FRC.'",
        "'speaker_2': 'That concludes my report, except to say that there is an amendment. Amendment S1 makes a series of technical and formatting corrections to the body of the ordinance as recommended by the compromise. With that, I'm happy to answer any questions.'",
        "'speaker_0': 'Questions of Mr. Bowman.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Council Member Coles.'",
        "'speaker_1': 'Thank you, Mr. Chair. As you mentioned and others have, we do have a matching national child search law. And would you explain a little bit more about the effect of this legislation on the ability for King County, for example, insurance companies to be able to use tools to be able to help search for missing children.'",
        "'speaker_2': 'In search of the National Child Search Assistance Act requires local, state and federal law enforcement agencies to enter information about abducted children into the National Crime Information Database within 2 hours of receiving reports. So the proposed ordinance would not obstruct or prohibit any compliance with that act.'",
        "'speaker_2': 'As I mentioned in prior briefing efforts, these systems have been and are currently used by law enforcement agencies to assist in the search of missing or abducted persons and victims of human trafficking. However, it is not one of those agencies, according to Ccso, and is not currently used by the Department for any purpose.'",
        "'speaker_2': 'Furthermore, in the 2122 Biennial Butler Council last year, the budget included an expenditure restriction which prohibited Kessler from spending any money on FRC for any purpose. Therefore, while the proposed ordinance would prevent CSO from using a property in the future for the missing persons, it would not currently disrupt any consistent practices or operations.'",
        "'speaker_1': 'Absolute. A question. Mr.. I think you're calling on me. I'm going to just go ahead and start talking base. Yeah. Nick, I want to just follow up on on that last Q&A because I got a little lost. So this ordinance would ban any use by our law enforcement.'",
        "'speaker_1': 'Except if they were complying with this one federal law. Could you explain that a little better for me?'",
        "'speaker_2': 'So it does not require case you so has been, as far as I know, has been complying with the National Sales Assistant Act as long as it's been in existence since 1990 and that party is not required to comply with that act.'",
        "'speaker_2': 'I ask yourself, does not currently use FRC? The proposed ordinance specifically provides an exemption. That means that whatever made changes may come to the National Sales and Services Act cases, so it would be allowed or any other department would be allowed to comply with that act.'",
        "'speaker_2': 'But in using the ordinance itself would prohibit the use of FRC for any purpose or any other county office or executive department.'",
        "'speaker_1': 'And that's what does make me feel that need to go backwards, because I am now familiar with that federal law. Could you explain a little bit what that act does require?'",
        "'speaker_2': 'So it requires that any local law enforce state or federal local law enforcement agency to enter a a report about abducted or missing children to a national crime information data database within 2 hours of receiving a report.'",
        "'speaker_1': 'I see. I see. Okay. But we would. But but our office but our our offices would not be allowed to use any facial recognition software of their own or anybody else's or any data produced by facial recognition software by anybody in order to locate missing children.'",
        "'speaker_1': 'That would not be allowed.'",
        "'speaker_2': 'So long as that agency did not request or offer a contract to obtain that information. If someone were to provide that information to counsel on their own, then that would be allowed to be entered or used to locate this missing person.'",
        "'speaker_1': 'So they can use facial recognition as long as somebody else provides it to them without us asking.'",
        "'speaker_2': 'That's correct. Okay.'",
        "'speaker_1': 'I find that really confusing. Like, I'm not sure I understand the implementation aspect of this ban. If it's it's not really a ban, right? Then if they can use it so long as they don't collect it themselves.'",
        "'speaker_2': 'Or request it. I mean, it prevents the any agency from using their own FRC or contracting with somebody for facial recognition information. If so, what are the reports? It includes the data that were given to KCA, so that would be allowable.'",
        "'speaker_2': 'So that wouldn't be a prohibition in helping investigate this missing person.'",
        "'speaker_1': 'Does mutual aid, the mutual aid agreements count as contracts?'",
        "'speaker_2': 'That would be a question I would have to follow up on.'",
        "'speaker_1': 'Because that's really how I mean, in reality, that's how police agencies work. They don't enter into specific contracts like you will provide me this service in an exchange, I will pay you. What they do is they enter into these very broad mutual aid agreements that we're going to support each other.'",
        "'speaker_1': 'We will respond when you need us. You will respond when we need you. And they're pretty they're pretty open ended intentionally, like they're there. They're intended to work without a lot of management, a lot of accounting and paying off each other back and forth.'",
        "'speaker_1': 'And so, you know, I'm always surprised when, you know, like Bellevue police officers end up in situations in Seattle. And then I remember mutual aid. So. Okay.'",
        "'speaker_2': 'Thank you. The language is written that they're not specifically. They're not it would be prohibited from contacting specifically for access or use of facial recognition technology or information. But I wouldn't want to get too down into the weeds of specific agreements without first conferring with counsel.'",
        "'speaker_1': 'Okay. Thank you, Mr. Chair. If I could offer maybe an example, it would make more sense. So I'm just going to throw one out and let's see what you can say about your case. So we're to receive a report from the, say, Thurston County Sheriff's Office or Bakersfield, California, or Atlanta, Georgia.'",
        "'speaker_1': 'So some report went out around the country, around the state pertaining to a missing child, and it included facial recognition technology in some form. In my correct to say that King County Sheriff's Office used that report to help locate, if possible, that missing child.'",
        "'speaker_2': 'That's correct. They would be able to use that information in furtherance of their investigation.'",
        "'speaker_1': 'But we can use facial technology to locate a missing child. We couldn't actively do that. We were.'",
        "'speaker_2': 'Just. That's correct.'",
        "'speaker_1': 'We would be tying our hands to not ever do that. Well, if I could, Mr. Chairman, we have a it's a factual question. I'm not trying to get to the debate yet. Well, I'm not either. And I'm just trying to clarify for myself, too.'",
        "'speaker_1': 'But what does that mean? Again, if the skin condition samples received a report of a missing child that may be in this area, they could look at it and help them to find this missing child. Or is that is that prohibited.'",
        "'speaker_2': 'As long as they didn't specifically requested and it would be allowed if there's an I don't I don't want to get too much in to the how the the sheriff's office. But if they said if they requested information that included facial recognition information, that would be prohibited.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'As a member of our. You're muted on our end. I know. I've received a text from Council member Van Dike, though, that he wishes to ask a question. No. You're unmuted now.'",
        "'speaker_2': 'Thank you, Mr. Chair. And first of all, I want to thank Councilmember Giancarlo Wells for introducing this topic. Because whether you're a libertarian or ACLU member, this technology that concerns many people, the only thing that concerns me more than the technology is the potential making a mistake with good intentions.'",
        "'speaker_2': 'It appears that the Act only requires the provision of written information within a given time frame. I'm concerned that the ordinance or proposed ordinance would prevent the county from using the technology for looking after the National Child Search Assistance Act.'",
        "'speaker_2': 'I could speak to that. There is a specific exemption in the ordinance which says that nothing in the ordinance would prohibit any county administrative office towards every department, which includes case council from complying with the National Child Search Assistance Act.'",
        "'speaker_2': 'That act does not require the use of that article. Nick. Yes, Nick. I appreciate the word complaint. The complaint does not require the use of technology constrained. Not. That is correct. Thank you, Mr. Chair. I appreciate again the.'",
        "'speaker_2': 'The mission, the audience. But I'm concerned about its application, and I think it needs a lot more review before we take action.'",
        "'speaker_0': 'Thank you. Mr. Sheriff and Councilmember Lambert.'",
        "'speaker_1': 'I have a question on page 28, and I'll just read it to you. Let's see this process where we require county personnel to notify their direct supervisor that they received, used or gained access to facial recognition information that they immediately delete the information subject to applicable laws.'",
        "'speaker_1': 'So so the applicable law would be the public disclosure, which doesn't allow you to immediately delete this? I don't think so. I ask legal staff and legal staff. So where you would have the I guess I should say legal subset, basically.'",
        "'speaker_1': 'There's a question here. Let's just say that there's a question here that I think needs to be better, better worked out, because we have two laws that may be conflicting and we need to look at that. So I point that on page 28.'",
        "'speaker_1': 'Mr. Chairman.'",
        "'speaker_0': 'Council Member Coles.'",
        "'speaker_1': 'Thank you, Mr. Chairman. Then the question of just for clarification and I know some of this is a little confusing. When we look at other jurisdictions that the net, as far as I understand, the national child missing child law does not require use of facial recognition therapy.'",
        "'speaker_1': 'I mean, the technology, is that correct?'",
        "'speaker_2': 'That's correct. It just requires that they enter information they received about a missing child within 2 hours with national governments.'",
        "'speaker_1': 'And if the national law were to change to an act of Congress and signed by the president to require facial recognition technology, that we have to comply with that.'",
        "'speaker_2': 'That's a legal question. But I would I would presumably think that the I actually I'll stop there presumably is a bad word to say. So I'd have to specifically follow up with legal counsel on the customer.'",
        "'speaker_1': 'Thank you. I would appreciate that. And if that's the case, then that's the case. And I'd like just to mention again, any ordinance that we pass can always be amended later if need be. Thank you.'",
        "'speaker_0': 'Mr. Bowman. And from our last briefing. I have the impression that the county would be allowed to use facial recognition technology in addressing human trafficking and child exploitation. What I'm coming to understand in this conversation is the county could use, including the sheriff's department in particular, but the county in general, as this legislation would direct, could use'",
        "'speaker_0': 'data received, if unsolicited, they could not use the technology itself to locate. A victim of human trafficking or child exploitation.'",
        "'speaker_2': 'That? That's correct. I guess the the the technology cannot be used by any county administrative office or executive department, which includes CSTO for any purpose other than they could use information derived from that. As you mentioned, as long as it is not soliciting.'",
        "'speaker_0': 'But under no circumstance could we use it, even in those cases that are identified as us. And what I understood to be exemptions last time.'",
        "'speaker_2': 'Okay. Yeah. Yes. If there is not a specific exemption for investigating of human trafficking or missing persons for the.'",
        "'speaker_0': 'So the county could therefore the county use the use the technology in any way, shape or form?'",
        "'speaker_2': 'That's correct. But I would just like to re-emphasize that they do not currently use it now. So current practices would not be disruptive.'",
        "'speaker_1': 'Mr. Chair.'",
        "'speaker_0': 'Council Member Lambert.'",
        "'speaker_1': 'Thank you. So our line 97. Page 37. It says that. That is Baqouba. Barbara, I'm sorry. It's 94 violations of this ordinance by any county personnel may include retraining, suspension terminations subject to due process requirements and provisions of collective bargaining agreement.'",
        "'speaker_1': 'So if we were to pass this, it wouldn't take effect until after it went through collective bargaining, which, depending upon when that could come up, our implementation plan could be years out. And so I looked back on the state law that was just passed this year, but I don't think it takes effect until like July or August'",
        "'speaker_1': '. So we don't even have any data yet on the state law. So I'm I'm interested in in exactly when the state law takes effect. I think it's not until July. And and then we also have an issue with our effective effect date.'",
        "'speaker_1': 'If it's the bargaining issue.'",
        "'speaker_2': 'So and I would just to clarify, that's that is only for regarding the rules regarding violations with those couldn't be established until that collective bargaining if required workplace.'",
        "'speaker_1': 'But this would also change your working conditions. It would be a change if we were to implement. I guess it wouldn't be a change if we don't do it at all. But if there are getting some of it now, then it would be a change in working condition.'",
        "'speaker_1': 'So it might apply to more than that under our existing labor law. Right.'",
        "'speaker_2': 'Again, that's getting in the legal weeds, which I would have to confirm with legal counsel.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Zala. Councilmember Zavala Thank you, Mr. Chair. We've heard about the kinds of uses that people might find valuable from facial facial recognition technology, like missing children and organizations that do that fight against human trafficking. Has anybody on here heard directly from those organizations about what they think of this law?'",
        "'speaker_2': 'Because the only people I've heard from our industry professionals and I understand that there is often a conflict of interest with with those organizations. But how about the intended beneficiaries of facial recognition technology that we've been talking about?'",
        "'speaker_2': 'Has anybody heard from them, from people who advocate for missing children or people who want to fight against human trafficking? I just want to see if those voices had been heard from. Customer is directed to staff or to your colleagues?'",
        "'speaker_2': 'I think anybody who has knowledge on it. No, no one has reached out to staff like that. Thank you.'",
        "'speaker_0': 'And to member Caldwell's.'",
        "'speaker_1': 'Thank you, Mr. Chair. Council members, are they. We all received an email late last month from Jennifer Lee from the American Civil Liberties Union, and she included Sunnis experts on those who support this legislation, some of which abortion and sanctions do work on.'",
        "'speaker_1': 'Anti Chuck Schumer Bills. Reading API. China. Black Lives Matter. Seattle. King County Care. Washington Church. Council of Greater Seattle. El Centro de la Raza. Invisible Eastside Legal Voice. La Resistencia One America, Puget Sound Stage, Real Change and so forth.'",
        "'speaker_1': 'It's a very lengthy list and supporters of this.'",
        "'speaker_2': 'Thank you, Councilmember. Once again.'",
        "'speaker_1': 'Mr. Chair, I want to respond to the issue. Yeah, I want to respond to that question as well. The King County Council is a pretty low profile outfit. People don't generally know what we're up to unless it gets a lot of coverage.'",
        "'speaker_1': 'Right. I mean, we've all seen this at the virtual the virtual room is filled with folks who are tracking us because they are tracking us. Right. Because we're doing something that they are keenly involved in because they're advocating for whatever.'",
        "'speaker_1': 'I think it's really fair to ask whether organizations that are concerned about human trafficking know about this. And and they may they may very well support it. And truthfully, I mean, I started with questions. I didn't start with the statement of my values because I was being a little bit literal about the process here.'",
        "'speaker_1': 'I am very.'",
        "'speaker_2': 'Intrigued.'",
        "'speaker_1': 'By this proposal because, you know, when you take surveillance technology out of you know, when you take that cat out of the bag, there's no putting it back in. And so a cautious approach to rolling things like this out where we don't do it until we're sure that it's manageable and that it's not God like that's attractive'",
        "'speaker_1': 'to me. However, I think I feel myself sort of gravitating to those who are like, Could we take a minute and learn a little bit more and maybe do some outreach to folks who may not even know what we're up to here before we take a vote?'",
        "'speaker_1': 'Because I think I would like to ask those questions. I'd like to ask that two groups of human trafficking. I'd like to I heard a lot in the public testimony about the state of the technology and how. Good or bad, it is at identifying people, especially from various racial groups, and that's a real concern.'",
        "'speaker_1': 'So, I mean, this is just like this is also me being a little bit like playing to my stereotype here, which is I just always want to take a little more time than most other people do. And so I would be happy to to do that outreach exactly that you are asking about.'",
        "'speaker_1': 'If I if I had a little more time to do it. Thank you, Mr. Chair. Mr. Chair?'",
        "'speaker_0': 'Council Member Councils.'",
        "'speaker_1': 'Thank you, Mr. Chair, and I appreciate council member foundations concerns and I tend to think along those same lines as well. But just to too, as we have already been hearing from organizations that work against human trafficking, and I mentioned to some of them API, China certainly has been in the lead on that front since I started'",
        "'speaker_1': 'working on human trafficking in the legislature, and that was many, many years ago. That's a really important central theme that us and others that look at this very lengthy list. You did get it by email last night, and I don't know if any other offices have been the same as what we've experienced and we do for office'",
        "'speaker_1': '. But we've received at least 1000 emails already supporting this legislation from organizations and from individuals all over. I think there's a great deal of support and to me, well, I'll save my remarks from closing. Thank you.'",
        "'speaker_2': 'Dombrowski with a quick question.'",
        "'speaker_0': 'Councilmember Demovsky.'",
        "'speaker_2': 'Thanks, Roger. And Nick, I.'",
        "'speaker_3': 'Think in kind of went by quickly, but did you mention that in our adopted budget, the current 2122 adopted budget that we have in the sheriff's office, an expenditure restriction prohibiting the use of facial recognition restriction technology for any purpose?'",
        "'speaker_2': 'That's correct. I see. That will not apply to.'",
        "'speaker_3': 'Trafficking or any of these other potential.'",
        "'speaker_2': 'Uses. Yes. All right. Thank you.'",
        "'speaker_0': 'Colleagues further discussing.'",
        "'speaker_2': 'Because. Chair Shura.'",
        "'speaker_0': 'Council member Dunn.'",
        "'speaker_2': 'Nick my wife has got me painting this bathroom because she doesn't like the color. I don't know what what she means up above this pink. But my question is not about the color of this bathroom. It is about the following statement made by the industry industry representative that I saw about the the issue of just using the'",
        "'speaker_2': 'facial recognition for something like turning on a computer or, you know, home security, maybe entering your house through a locked recognition system or something like that. Do we have any protections in place? Because obviously that stuff is not in my mind a problem or in fact, it's a benefit.'",
        "'speaker_2': 'But but more broadly, of course, the facial recognition stuff does concern me. What do we have a mechanism now, today or through for council to allow, for example, our local software companies to be able to engineer those type of simple functions that don't seem to have a liberty interest detriment except for personal security.'",
        "'speaker_2': 'So the the definition of facial recognition technology does not include analysis of facial features to grant access or deny access to an electronic device like a phone or a laptop, because that is a common feature or the use of our teeth for the use of a semi automatic or automated process for redacting.'",
        "'speaker_2': 'So you could use redacting software and it also doesn't include those for social media. So there are there are allowances for the use of analyzing a facial feature to grant access to certain things, although it would not the way it's currently written would not allow access to a built.'",
        "'speaker_2': 'Okay. So, so to turn on your computer or laptop and grant you access to your own device, that is okay under this law and your interpretation. Okay. Okay. We're establishing that legislative record. And then for, for example, granting access to a building or for a suite of offices or something that hasn't been contemplated under the law or'",
        "'speaker_2': 'is it prohibited under the law, would you say, in your judgment, it would be it would be currently prohibited. Okay. So I want to remain open between now and for counsel to working with industry leaders on maybe some kind of a narrowly tailored amendment for some of this sort of gray area stuff that might be in the'",
        "'speaker_2': 'public's benefit or to a few individuals benefit for things like personal security measures. Okay. I think I just want to clarify on that point. I just quickly, this only applies to cap to a government entity. So it does it doesn't have any impact on the private sector.'",
        "'speaker_2': 'Great. And also, what do you think of the color effect? I like things thinks it thinks that.'",
        "'speaker_1': 'Mr. Chair and member Lambert. So I had a conversation a couple of days ago with some wonderful, very intelligent advocates who I've known one of them for a very long time, and one that was a new friend. And I got a very different answer on the reduction issue.'",
        "'speaker_1': 'So I think we need a little more clarity that the reduction software could be used, especially for our body worn cameras. And then could you help me know the idea about your ring doorbells that if you have information on your ring doorbell, could you give that to the police?'",
        "'speaker_1': 'And what what are the requirements on our ring doorbells?'",
        "'speaker_2': 'So the first question regarding redacting so that the ordinance would allow redacting the use of editing software so long as it does not generate specific facial characteristics, data that falls under facial recognition information. As I'm going to preface this by saying that I am not an expert, but my understanding of most software is that it plays like'",
        "'speaker_2': 'a video of redacting software. It plays like a video feed where it has an interface which allows the individual to click on individual faces or geographic location, such as an address and either blurt out or put a black bar over it.'",
        "'speaker_2': 'There are various measures of automation, but that goes into specific uses. But this would allow the use of broadcasting software so long as it does not create the facial recognition information, which, as I mentioned, does exist.'",
        "'speaker_1': 'So clarify on that. So I get it can do it manually, but that's too time consuming and why we haven't done this for years on the redaction because it's too expensive and too costly in time. So there is a program where you can say the space take out the whole way and then you don't have to do'",
        "'speaker_1': 'it manually. Would that be prohibited under this rule?'",
        "'speaker_2': 'So as long as it is, the purpose of the software is just to identify a human, not the specific characteristics of an individual. Yes.'",
        "'speaker_1': 'Okay. And then the the ring issue, the ring camera.'",
        "'speaker_2': 'So those again, just as that's private, but if a private individual had a crime and wanted to provide that information itself, then they would be able to do so and cases that would be able to use that in furtherance of their investigation.'",
        "'speaker_1': 'Great. Thank you. As a teacher.'",
        "'speaker_0': 'And a member of Carlos.'",
        "'speaker_1': 'Thank you. Has to challenge the question of neck and neck. You may not know this, but have you heard from the King County Sheriff's Office about any request to use such facial recognition technology or any questions they've had on this legislation?'",
        "'speaker_1': 'We have not.'",
        "'speaker_2': 'Not on this. So in both during the budget process, when the expenditure restriction was being considered and during this audience, I reached out to Castle. And no, their answer was, we do not currently use this. And I have not seen any request from the Sheriff's Office to obtain.'",
        "'speaker_1': 'And we have not heard that they've opposed this legislation either.'",
        "'speaker_2': 'I have not.'",
        "'speaker_1': 'No, no. Okay. Thank you.'",
        "'speaker_0': 'Further questions. I think I'm hearing some questions and some follow up members might like to do. Before taking up the legislation. I want to check and see if that's an accurate reflection of. The conversation what were what I'm hearing today or was another intention action counts member number of on power.'",
        "'speaker_2': 'The committee of the whole is where we come together to work on legislation before we go forward. There have been a lot of questions. Again, this legislation's mission is something I agree with. I'm just concerned that the path that we're taking to it may lead to more problems.'",
        "'speaker_2': 'Along the way to get accomplished the mission. So I'm hoping that we can use the committee to hold to work on this legislation. And that's why I'm hoping that you can hold it in committee.'",
        "'speaker_1': 'Mr. Chair?'",
        "'speaker_0': 'Councilmember Banducci.'",
        "'speaker_1': 'I would add that the fact that there's this budget, a prohibition on spending any money to implement facial recognition makes me feel a little calmer about taking a little more time because nothing's going to happen, like it's not going to suddenly be implemented while we while we work out any concerns.'",
        "'speaker_1': 'And so I, I'm personally comfortable with taking one more one more committee meeting if if others are.'",
        "'speaker_0': 'Jack Council member.'",
        "'speaker_3': 'Lambert.'",
        "'speaker_1': 'I would agree. I think that, um, you know, I've been in China and been very surprised with how much they knew about where I was and when they did, um, what cities I've been to. And I don't want that to be in my community.'",
        "'speaker_1': 'It was very uncomfortable for me to see. Not that I had anything to hide, but I was just surprised. So but I think the wording matters and I think there's a couple of areas where the wording isn't quite cemented in everybody's mind.'",
        "'speaker_1': 'And I think that also the fact that the state law hasn't even begun yet and nobody said whether that was accurate or not on the July date, which I still don't know if that's correct, but I think it is.'",
        "'speaker_1': 'So I think we have time to really look at this. And it's important this is very important legislation that we should take the time to start really looking at the language and beefing it up a little bit.'",
        "'speaker_0': 'Then Councilmember calls.'",
        "'speaker_1': 'Thank you, Mr. Chair. While I would prefer that we want to take this up today and understand that people have concerns about it, so that's fine with me, the way we will place prominence or maybe the whole agenda.'",
        "'speaker_1': 'And I can be working with my colleagues and staff to staff as well. I would I would not like because if two weeks went by and no one had done anything and we were just back in the same position.'",
        "'speaker_1': 'Well, if you wouldn't mind if I took a minute or two to just clarify a couple of things that I think are important, and then I will agree with whatever decision you recommend. You're welcome.'",
        "'speaker_0': 'You're welcome to your council member.'",
        "'speaker_1': 'Thank you. I just would again like to reiterate, this legislation pertains only to King County government. It does not have anything to do with the private sector. It does not cover colleges, universities, schools, nonprofits, local jurisdictions such as since the unincorporated area of King County for the residents and businesses.'",
        "'speaker_1': 'And it also has to do, though, with mainly this King County Sheriff's Office is where we would anticipate there would be any engagement with such technology. And we've heard no request by the the no opposition to, say, the King County Sheriff's Office on this legislation in my office has been checking on that and nothing has been forthcoming'",
        "'speaker_1': '. Privacy is critical to all of this. And also, I think an important factor for us all to think about is how many times have we been notified by your credit card company that unfortunately there's been hacking taking place?'",
        "'speaker_1': 'Maybe you were in silent auction or auction and some of them were. You paid for items by credit card. And then you found out later that the whole system was hacked. And I've heard that on a number of occasions where I've had to change my credit card number.'",
        "'speaker_1': 'It's a hassle. But when we're talking about facial recognition, which we could be in a crowd somewhere and there could be surveillance occurring following our just being in a crowd of people. And I think our privacy and our civil liberties are critical, let alone that we no hard evidence exists that there is a great amount of racial'",
        "'speaker_1': 'and gender biases going on here. When we talked about that before, with regard to women of color having a 30%, 30, nearly 30% of the Mr. ID rate compared to 2.3% by white men. There's a lot more I can say about it.'",
        "'speaker_1': 'I'll stop there. And I look forward to working with my colleagues and our staff, working with staff during the next two months. Thank you, Mr. Chairman.'",
        "'speaker_0': 'Thank you, Councilmember Caldwell's. And you have my commitment that this legislation will be on the next agenda for the committee to hold and encourage, as you did, encourage members to engage in work on amendments or proposals to the questions that have been raised in this conversation today and at our next meeting and be ready to take the'",
        "'speaker_0': 'legislation up. Thank you. Thank you, everyone, for a very good discussion. We'll look forward to discussion and debate and action that are on this legislation at our next meeting. Madam Clerk, I am not aware of any reconsideration of votes that missed votes that is needed.'",
        "'speaker_0': 'Are you?'",
        "'speaker_1': 'That's correct, Mr. Chair. There were no missed votes.'",
        "'speaker_0': 'Great. Then with Council member Lambert.'"
    ]
}