{
    "A MOTION confirming the appointment of Patti Cole-Tindall as the chief officer of the department of public safety.": [
        "'speaker_0': 'Thank you so much for being with us today. And we will be in touch and look forward to our next meeting. With that, we will now move to something that is urgent. Number seven on that large and as proposed motion 20 20191, which is to confirm the executive's appointment of Paddy Cole Tindal as county sheriff.'",
        "'speaker_0': 'And the staff report begins on page 25 with Bowman will be briefing us. We do have with us again Director Debrief and PSP and Arena Hashimi from Director who's director Council Relations from Executive Office. We also have Melody Garcia, Public Safety Advisory Committee member, and Katie Cole Tindal, who is the appointee and is currently serving the interim'",
        "'speaker_0': 'share. Director Di Bain has requested that she be able to introduce the interim sheriff. And so we will follow the same process. Go right ahead, Dwight.'",
        "'speaker_3': 'Thank you, Councilmember. So it is a great privilege for me to have the opportunity to introduce Executive Konstantinos, a nominee for King County Sheriff Patty Cole Tindal. I've been here at the county for a little over 12 years, and I worked with Patty that entire time.'",
        "'speaker_3': 'She worked when I started the director of the Office of Labor Relations. Many of you know that she later also took on the role of the director of the Office of Law Enforcement Oversight. She subsequently then went to work as one of the senior staff in the sheriff's office.'",
        "'speaker_3': 'Most recently was the undersheriff and then has been the acting sheriff while we went through a national search. I had the privilege of participating in that national search, and we had some very strong candidates. And at the end of the day, council member executive Constantine felt that Patty's somewhat unique approach to the work, her very diverse background'",
        "'speaker_3': 'and her experience in the sheriff's office meant that she was the best candidate. And I have to say personally, I agree just a little bit about her professional background. She has a bachelor's degree from Central Washington University, a master's degree from Troy State, has worked in a variety of law enforcement related positions throughout her career before she'",
        "'speaker_3': 'came into the Office of Labor Relations. Perry has a very strong familiarity with the sheriff's office. I think you'll find in the pack a strong support from many of the employees in their bargaining units in the sheriff's office.'",
        "'speaker_3': 'Also, we had extensive involvement of our contract cities and other contract partners. And you should have some information in the packet about their support for her nomination. So I have to say it's been a great experience for me personally, working with Patty throughout her career since I've been here in the county.'",
        "'speaker_3': 'I will also add that my observation in, you know, roughly four and a half months that she has been the interim sheriff is she has moved forward some very thoughtful and perhaps long overdue initiatives that are the kind of thing that I think all of us expect from our sheriff's office.'",
        "'speaker_3': 'So with no further ado, I would put in front of you the nomination of Patty Tindall as King County sheriff.'",
        "'speaker_0': 'Thank you very much. I really appreciate the introduction and I'd like to welcome the sheriff called Tendo. We are going to go ahead with the staff report before we turn to you for your remarks and Q and I just wanted to welcome you and congratulate you on the nomination for confirmation.'",
        "'speaker_0': 'So with that, we will turn to Nick Bowman from our central staff to provide the briefing on this item. And we will also hear from Melody Garcia from the Public Safety Advisory Committee. Go right ahead, Nick.'",
        "'speaker_2': 'Good morning, Councilmembers. For the record, Nick Bowman, Council Central Staff Proposed Motion 2020 2019. That one would conform to confirm the executive's appointment of Patti Tindal as the Chief Officer of the Department of Public Safety. Also known as County Sheriff.'",
        "'speaker_2': 'The King County Sheriff's Office provides law enforcement services for unincorporated King County and several governmental agencies, including full service policing to 12 contracted cities. In addition to providing patrol services. KSO delivers numerous specialty law enforcement services, including an air support unit, Marine Unit, SWAT, major crimes investigations, bomb disposal, major accident response and arson investigations.'",
        "'speaker_2': 'KSO also performs other functions such as emergency 911 call receiving and dispatching service and court orders related to civil court filings, issuing concealed weapons permits and sex offender registration. The Sheriff's Office 2021 2022 biennial budget is approximately 409 million, with 1177 fees, including 782 commissioned officers and 395 professional staff.'",
        "'speaker_2': 'For a bit of background, from 1852 to 1969, the King County sheriff was an elected position that operated more or less independently. In 1969, the voter approved home rule charter went into effect, which made many elected officials, including the sheriff, appointed positions subordinate to the executive as an appointed position.'",
        "'speaker_2': 'The sheriff became subject to the selection process set out in Section 340 of the charter. In 1996, the King County Council adopted proposed Ordinance 9575 five, which submitted to the voters a charter amendment to establish the county sheriff as a nonpartisan elected official with a four year term.'",
        "'speaker_2': 'In November of 1996, the voters approved this charter amendment, returning the sheriff to an elected position. Fast forward about 25 years. In July 2020, the King County Council adopted Ordinance 19139. We submitted to the voters a charter amendment reestablishing the sheriff as an appointed position.'",
        "'speaker_2': 'And in November of 2020, the voters approved Charter Amendment 25, returning the county sheriff to an appointed position with a requirement for the consideration of community stakeholder input during the selection, appointment and confirmation process, which was to be prescribed by ordinance to fulfill the Charter's obligation for community stakeholder input in the selection, appointment and confirmation of a'",
        "'speaker_2': 'new sheriff. The Council adopted ordinance 19249 and established the Public Safety Advisory Committee, otherwise known as Peace Act. The Peace Act consists of 13 individuals from various stakeholder communities representing the geographic, ethnic and economic diversity of Ccso service area and those with expertize in law enforcement reform.'",
        "'speaker_2': 'The committee was charged with two distinct bodies of work first to engage with and receive input from stakeholder communities to provide guidance to the Council and the Executive in this selection, appointment and confirmation process for appointing a new sheriff.'",
        "'speaker_2': 'And second, to solicit input on the value stakeholder community's hold for how law enforcement services should be provided and the way the county can improve the delivery of those services. The ordinance further required the Peace Act to deliver a report to the Executive and Council detailing the Committee's efforts to fulfill its responsibilities to interview candidates for sheriff'",
        "'speaker_2': 'identified by the Executive, and to attend a meeting of the Committee of the whole to provide its input on the sheriff appointee selected by the Executive. The SEC met a total of 21 times from March 2021 until its delivery of its final report on September 30th, 2021.'",
        "'speaker_2': 'The report provided recommendations for the qualities and expertize the new sheriff should possess, including a law enforcement background and track record of making decisions with community as a focus. Strong leadership and commitment to lasting change and have a history of collaboration and partnerships.'",
        "'speaker_2': 'A record of success with elected officials, other jurisdictions and unions. And knowledge of bipoc and LGBTQ plus issues. On April 13th 13th, 2022, after a nationwide search for qualified candidates, members of the Peace Corps met with three finalists chosen by the Executive for the Position of Sheriff for impression interviews.'",
        "'speaker_2': 'Each finalist candidate was given approximately 45 minutes to answer the panel's questions and talk about their vision for Casey herself. The feedback representatives delivered their impressions of the sheriff's candidate to the executive on April 20th, 2022. Michael Tindall, who has been serving as acting sheriff since January of this year, was then announced as the executive's appointee for'",
        "'speaker_2': 'sheriff on May 3rd, 2022. Acting Sheriff Colton Doyle has over 30 years of experience in public service for law enforcement, the labor relations and human resources. Acting Sheriff Court Tuttle started her career in law, first in law enforcement in 1991 as a special agent for the Washington State Gambling Commission, a position for which she completed the state's'",
        "'speaker_2': 'Basic Law Enforcement Academy or earlier chief in working for King County government in 1998 as an investigator in the Department of Adult and Juvenile Detention and later as assistant director in the Department's Community Corrections Division. In 2010, Acting Sheriff Cultural became the county's director of Labor Relations, as she also served as interim director of the county's Office'",
        "'speaker_2': 'of Law Enforcement Oversight in 2014. In 2015, the acting sheriff serves as the Chief of Technical Service Division for the Sheriff's Office, where she worked for almost five years before becoming undersheriff in 2020. She was then appointed acting sheriff in November 2021 and has served in that role since January 2022.'",
        "'speaker_2': 'Her full resum is included in the confirmation packet under attachment five. While Acting Sheriff Cole Tindall was at one time a certified peace officer. That certification has since lapsed. According to the executive, upon confirmation by the council, acting sheriff Coach End will complete Boyer to be recertified as a commissioned officer within one year for appointment.'",
        "'speaker_2': 'The Academy is currently 19 weeks long and she will attend at no later than January 2023 to meet the certification requirement. While at the Academy, an acting sheriff from Ccso leadership team will be appointed now in accordance with King County Code 216 110.'",
        "'speaker_2': 'The executive has requested confirmation of Patti Call Tindall as the Chief Officer of the Department of Public Safety, who may also be referred to as the county sheriff. Staff has not identified any issues with the proposed appointment. And furthermore, once the Peace Act members in attendance today deliver their impressions of the appointee, the process for which the'",
        "'speaker_2': 'acting sheriff general was elected and appointed will be in compliance with King County Charter Section 350, 2040 and Ordinance 19 249. That concludes my staff report. However, there are some amendments which I can brief now or wait until later to discuss.'",
        "'speaker_0': 'Please go write prescribing.'",
        "'speaker_2': 'Amendment one on page 32 of your packet would align the appointment motion with the language in charter section 340. The appointment provisions of the Charter as well as Charter Section 350 2040, making the sheriff position an appointed one and the Chief Executive Officer of the Department of Public Safety.'",
        "'speaker_2': 'And then there is a title amendment which would simply align the title with the changes made by Amendment one. And that concludes my support.'",
        "'speaker_0': 'Thank you very much. Now, before we go on to hear from apparently three Peace Committee members who are with us, are there any questions of Nick? Cenac You did such a great job. No, I think. Reporter No questions.'",
        "'speaker_2': 'That's always the hope.'",
        "'speaker_0': 'Okay. We, as I mentioned, we do have three members from the Public Safety Advisory Committee. Those are Melody Garcia from Giddings and Livio de la Cruz. I hope I did not mispronounce today, but we very much like to hear from you.'",
        "'speaker_0': 'Just one reminder. It's 11 I seven. The committee is due to be adjourned at 1130, but we can go a little bit longer. So who would like to speak first? I think I can go. This is Melody Garcia pointed to his work as Melody.'",
        "'speaker_0': 'Garcia, good to see everyone. No, I'm going to I'm going to let Livio and Frank do most of the talking. But I just wanted to say, I am I'm really excited to have sheriff got involved and especially as a woman of color myself.'",
        "'speaker_0': 'Really excited for the partnership and the opportunity to work with yourself. Thank you so much. Thank. Play with one or the other two. Like to go hurt. I see. Livia.'",
        "'speaker_2': 'I can go next.'",
        "'speaker_0': 'Please just.'",
        "'speaker_2': 'Say so. I'm going to divide my thoughts into two things. First, you talk about shared content of a candidacy, why it's so compelling. Then my second bucket of thoughts are kind of bigger picture like How did this process go?'",
        "'speaker_2': 'I figured the council would like to hear our thoughts because this is kind of a unique approach.'",
        "'speaker_0': 'So first, introduce yourself. The director.'",
        "'speaker_2': 'Oh, yes. I'm Olivia Dela Cruz. I'm one of the members of the Public Safety Advisory Committee. And specifically, I was one of the members appointed due to my experience with activism and police policy and all that stuff. And so the you kind of I feel like you all know the pitch of why behind Catena's candidacy.'",
        "'speaker_2': 'Like it's a pretty compelling pitch, like the unorthodox background, the mix of public service, and that's outside of the sheriff's office and also inside the sheriff's office. And on top of that, there's just a lot of like strong core, fundamental leadership skills.'",
        "'speaker_2': 'It's like promoting steady direction, refreshing vision, strong communication skills, strong relationship building like this, the core stuff that you really need to be in any leadership position. And but the, the, the, the, the background is particularly compelling because at one point the piece I did consider the question of what if we had a sheriff who was not'",
        "'speaker_2': 'a cop, basically, like what if they did not come from that background? And after weighing like the pluses of that would be, well, we could potentially get a more refreshing leadership approach and more willingness to question practices that have led to tension between police and community before.'",
        "'speaker_2': 'But on the other hand, it would undermine their ability to lead the department effectively to build the kind of reputation and credibility within the department. And so Cortinas kind of this almost appears to be like the best of both worlds, in my opinion.'",
        "'speaker_2': 'And yeah, and Cotillard was also at most of the meetings. And so while many of our recommendations in our report are kind of simplified, like she she actually understands it and much more, which is exciting for us. And just to remind the committee members that the one of our core representation recommendations was the idea that the sheriff's'",
        "'speaker_2': 'office cannot and should not be the end all, be all for public safety. It's really a larger responsibility shared by all of the departments, all of the pieces of government. And for that reason, whenever anything goes down, any big concerns about safety come up.'",
        "'speaker_2': 'We need to all collectively learn not to reflexively bang on the door of the sheriff for all of them. We need to kind of all come together and evaluate the issue holistically. And that means funding it holistically as well.'",
        "'speaker_2': 'And so Sheriff Cotillo and that vision and is on board, it's pretty helpful for us. So the next set of thoughts I have is about the process. And you already heard an overview of the process that was followed.'",
        "'speaker_2': 'One of the biggest recommendations, the piece I made was that we have community involvement as early as possible in the recruiting process. And in this case, we were able to get a community rep in the first round interviews, which is remarkable.'",
        "'speaker_2': 'I'm I'm honestly, I want to I want someone to fact check, like, is this the first time this region that something like that has happened for the first round of bids for a law enforcement agency later? I'm curious about that.'",
        "'speaker_2': 'But it's very big. And one of the main concerns historically has been like, well, it needs to be confidential because you need to maintain a confidentiality of these candidates who are not quite announced to everyone that they are applying for a new job.'",
        "'speaker_2': 'And we were able to do that. We got a confidentiality agreement. We did that. So the piece that actually selected me to be that rep on those first round interviews, it's my understanding that there are two hiring panels, two individual panels of people, and I was on one of the panels and I recommend that it improve them'",
        "'speaker_2': 'for reasons that I'll explain upcoming. I do think it would have been strong if there was community rep in both home panels. So another. Then the next step. After the first round interview, the finalists were selected and a piece of work had an opportunity to meet with the three finalists and have what we call impression interviews in'",
        "'speaker_2': 'which informed the they were opinions of it. And I tried my best of the one person who actually met all the candidates already to not interview. The with everyone's formation of opinions during these interviews and to it was kind of it was interesting to see that most of our opinions aligned anyway.'",
        "'speaker_2': 'So then so that that that's pretty good pretty successful. I don't have much insight into how the public forms feedback fed into the internal process for evaluating the final point. But I just have a few more thoughts. Which is it really?'",
        "'speaker_2': 'I was really amazed by the quality of the candidates that were attracted by this process. It is a sign that the process was working successfully, that we attracted so many good quality candidates particularly, and I have to disclose that the SEC ultimately did recommend in favor of though, and also in favor of Mr. Kimball a bit.'",
        "'speaker_2': 'And Mr. Kim was kind of the top choice by the piece. However, the fact that Kim was someone like Kim on made it that far in the process is is positive. It's what we'd expect. I also have to disclose that the third finalist or the piece, I felt like they did not meet the requirements and should have'",
        "'speaker_2': 'probably been filtered out earlier in the process. And so that is a bit of a weakness in the process. And how did this happen? Maybe there probably and this is just my opinion, not the piece, because I met all the other candidates.'",
        "'speaker_2': 'I do feel like there are multiple other candidates are more qualified than the one here. Yes. And that's the end of my piece, actually. Thank you.'",
        "'speaker_0': 'Thank you very much for your perspective as one member of the Public Service Advisory Committee. I do have thank goodness you're with us as well. If you would like to make remarks. Here. Apparently it's not here.'",
        "'speaker_2': 'She was here, but I think he had to leave.'",
        "'speaker_0': 'Oh, that's too bad. Okay. Thank you very much for speaking with us, both of you. Melody Garcia and Olivia de la Cruz. We will now turn to our sheriff, interim sheriff, coal tingle. And first of all, I'd like to find out how you would like to be spoken to.'",
        "'speaker_0': 'Identified. You're married? Yeah. My first name is fine. Okay. Thank you, Patty. And to give you the opportunity now to speak to us, to tell us about your printer and what you bring to the position, although, of course, we know you've got a tremendous background and did a great job of providing that to us.'",
        "'speaker_0': 'But we may have some questions for you, but I'd like to give you this opportunity to tell us more about yourself and. Go right ahead. Thank you very much. I appreciate being able to speak before you council. And I just want to say I am very honored and privileged to have been the nominee, the executive's nominee for'",
        "'speaker_0': 'the permanent appointed sheriff. As Livio described, there was an extensive process that I went through and the other candidates, and I'm just thrilled that I was chosen. Let me talk a little bit about myself and my philosophy and what the work we've been doing here at the sheriff's office.'",
        "'speaker_0': 'So Nick explained my career, so I'm not going to go over that again. But I will say that I am a nontraditional law enforcement executive. We all know I've had some time in law enforcement, but then time outside.'",
        "'speaker_0': 'And I think that's what gives me a unique perspective and a different lens. I'm able to translate from inside the agency to outside and from outside to the agency. And also that my working with the Office of Law Enforcement Oversight, the fact that I oversaw that office, which is oversight into this very agency.'",
        "'speaker_0': 'So giving me also a unique perspective into the sheriff's office, how it operates, the issues that it faces. So in my almost six and a half years here at the sheriff's office in various leadership capacities, has also, I think, uniquely prepared me to be the leader of this agency going forward.'",
        "'speaker_0': 'I am excited to kind of do some different things that we started in the beginning of the year. One is our engagement with community in a way that I think the Sheriff's Office has not done previously. So we are just starting that work.'",
        "'speaker_0': 'But I see this as a wonderful opportunity to engage with the community so that they can help us create the co-creation of the law enforcement agency that they want for King County and with the specific communities, because their needs are different.'",
        "'speaker_0': 'As we know, we have contract cities. We also police in urban unincorporated areas. So we have to transit contracts. We police for the Michael Shoot tribe as well as the King County International Airport. So our you know, we have 2300 square miles that we are responsible for.'",
        "'speaker_0': 'And so I just feel like this is a great time at this space and time to lead this agency and move things forward. The other thing I want to say is I have been working diligently, along with my leadership team, to create a workplace that our current employees want to be part of going forward because they are'",
        "'speaker_0': 'the key to our recruitment issues is retention. While we are working to staff up, we need to retain our good and qualified well-experienced officers that we have. So any opportunity that I can work with you council in addition to the executive on how we can create incentives potentially for those that are almost at retirement age to stay'",
        "'speaker_0': 'while we staff up will be appreciated. So we do have a large number of vacancies, I will say that. But we are working hard, like I said, to create a positive workplace that people want to be part of going forward.'",
        "'speaker_0': 'I'll kind of end it there because I know time is short and I don't want to and I know there will be questions. Thank you very much for speaking with us. And I think there will be some questions.'",
        "'speaker_0': 'I don't want to shortchange your time. Our previous agenda item went a little bit longer, but I hope that most of us, all of us can stay here for a few minutes beyond the 1130 timeframe because we do plan on taking action today.'",
        "'speaker_0': 'Okay. With that, are there any questions? Council member Perry. Thank you. I think I don't know if it's a secret that I'm such a big fan, but one of the reasons I am a great fan of interview currently interim, the sheriff called Jindal's eye right until until the vote.'",
        "'speaker_0': 'Is that the correct title? Yes. Yes. Okay. Interim sheriff called, though. One of the reasons I am such a big fan is that she's a Girl Scout, once a Girl Scout, always a Girl Scout and has worked on women's leadership from very early ages.'",
        "'speaker_0': 'And I have such a great respect for engaging women in leadership, engaging our girls and junior girls, junior Girl Scouts in leadership. And and just a shining example, because it does take a great deal more to be a leader in your position, in this position, than it takes someone who identifies as male or someone who identifies or'",
        "'speaker_0': 'who is wise. And. And I really appreciate that the just the the all things being equal, your your incredible leadership in this space and you being brought to this position visually, as well as the amazing leadership that you bring to the table.'",
        "'speaker_0': 'So I'm very excited about this. Thank you very much. I appreciate those kind words. Thank you. Are there any questions from any of my colleagues? Councilmember Sarai.'",
        "'speaker_2': 'Thank you. Charcoal Wells. Thank you so much for being here. Interim sheriff called Tindall. Could you speak a little bit to your vision for alternative crisis response mental health responders? You know, there's a large movement right now to make sure that our response systems create more good and are more tailored to people who are in behavioral health'",
        "'speaker_2': 'crisis. I know part of our movement for making the sheriff an appointed position and creating Charter Amendment six as well was just to integrate the sheriff's services more closely with our public health systems. And now you will sit on a board, leadership board with the executive, Constantine's other department heads, where you will be more in close touch'",
        "'speaker_2': 'with DHS and Public Health and all of our other public health systems. Can you speak a little bit to your vision for how we respond to people who are in need from a mental health perspective, from an addiction perspective?'",
        "'speaker_2': 'What is the future of public safety look like in your in your view.'",
        "'speaker_0': 'Your council members? I mean, so the way that I view that in my philosophy is we need to make sure that we are bringing the proper resource to whatever the issue is. And we all know that sometimes we don't need somebody with a gun and a badge to address what is not a crime.'",
        "'speaker_0': 'So I'm proud to say the King County Sheriff's Office has already started to engage in that work. We already have a program called Radar, where we have a mental health professional riding with a law enforcement officer so that when they get that call, the right person is there that can provide immediate service to the person in crisis'",
        "'speaker_0': '. So if it is somebody who is experiencing homelessness or a mental health issue, we've got that person right there and we can tap them into the appropriate resource. So I do think I believe that law enforcement needs to have a seat at the table with community, with social service agencies, with our partners in King County government to'",
        "'speaker_0': 'create and address issues systems where we can help those who need it and bring them out, connect them with the resources that they need so that they can get their basic needs met. And I believe that will then allow us and law enforcement to respond to the calls that we should be responding to.'",
        "'speaker_0': 'But more importantly, folks are getting the help that they need. But I see this as a societal issues. So it's not just law enforcement, but we need to be key in Interpol, because what happens is the 911 calls call comes in and then we get dispatch.'",
        "'speaker_0': 'So, you know, we need to find out what is the source. Why did somebody maybe if they stole something to eat, it's because they were hungry. You know, they were trying to provide for their family. We also have other programs where we have a lead, which is law enforcement assisted diversion, where low level crimes deputies have the'",
        "'speaker_0': 'ability to divert people to resources rather than have them enter the criminal justice system. So we already are engaged in some of these activities, but I see us in the beginning stages and there's so much more work ahead.'",
        "'speaker_0': 'And so I am ready to lead this agency to work with community, work with the council, other department excuse me, executive branch agencies to really address this issue holistically here in King County.'",
        "'speaker_2': 'Thank you so much.'",
        "'speaker_0': 'Thank you, both of you. Are there any other questions from colleagues? Councilmember Dombroski?'",
        "'speaker_1': 'Thank you. Chair Wells and Sheriff Tyndall, congratulations on your well-deserved and well earned nomination. I look forward to voting yes. Following on from personalized comments, I do think it's a big opportunity and a big challenge that's coming with the rollout of, I think, nine, eight, eight, the new non-police number, which our state legislature has set up.'",
        "'speaker_1': 'And now they've made the vision. But you're going to have to implement to some degree. And how do we choose that through our our call centers and that and I, I know that the practice with our navigator, it will be helpful to build on that.'",
        "'speaker_1': 'Just by way of opening remarks, I want to reflect that there was a big question about whether we would ever be here today when the Council put a charter amendment before the voters and the voters did something quite unusual on that is they gave up power that they held and they entrusted us, the executive and council, with'",
        "'speaker_1': 'this decision who should be the sheriff of the county. And I'm very, very pleased to say that I think the executive, our public safety advisory committee and hopefully this council are taking that trust that's been granted to us and performing and delivering with a tremendous person.'",
        "'speaker_1': 'And that's you and me. I think it's worth reminding folks that when you were appointed interim sheriff, you said you would not pursue the job and you didn't pursue it until you were asked to pursue it by a number of folks here at the council, I think, including myself, that also in your front line, your your deputies'",
        "'speaker_1': 'and people within the department and in the community, I need you to know that our deputies stop me when I'm coming into the courthouse and are supportive of what you're doing and appreciative of what you're doing and are grateful for the way you have come in and are leading this department by caring for them, by having meetings'",
        "'speaker_1': 'with them, by communicating with them, by supporting them. And we see that here at the council and your leadership and your engagement and your commitment is making a difference. I think we want to see you and your department succeed.'",
        "'speaker_1': 'Frankly, we we have a never obligation to the voters entrusted us with that. And so I'm excited for your leadership. I am inspired by you. I've now got to work along side you in different capacities here in nine years.'",
        "'speaker_1': 'And I want to share just two things with folks about why I'll be voting. Yes, probably. And there's a lot of reasons, but one is your independence, you know, in different capacities. I think back to your work as the Labor Relations Director and you present to council and sometimes I'd have a tough question to for you a'",
        "'speaker_1': 'little dialog and you did not hesitate to stand up and push back and say, this is why we're doing this and this is where we're at and disagree with somebody in power. And I think that that is essential in this role as the chief of our law enforcement department, our sheriff, that you have that trait, have that'",
        "'speaker_1': 'ability and will use it.'",
        "'speaker_3': 'And I.'",
        "'speaker_1': 'Respect that. And the second thing was a recent observation. Our law enforcement officers are charged to run toward danger and put themselves at risk. And some may wonder, well, sure, Tyndall hasn't been a patrol officer. She has some law enforcement background.'",
        "'speaker_1': 'But what are her instincts in that regard?'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'At a recent press conference here in the courthouse, it was interrupted by somebody who was angry, who came charging in, who disrupted the event and was threatening and angry. There were a number of electeds there and you were there.'",
        "'speaker_1': 'He then left the room and you went after him. You went into the danger. I observed that, and I also observed that you went alone. That said All I need to know about your instincts for this role. In addition to everything I've seen from you here in my time with the Council, I'm very proud that you're willing'",
        "'speaker_1': 'to serve in this capacity, and I hope you'll let us know what we can do to support you as you undertake this important role. Thank you so much for your willingness to do it.'",
        "'speaker_0': 'Thank you very much. Thank you both. Councilmember Bowdich, followed by Councilmember Penny. You're muted. Council member. Council member. Terry had her hand up before me. I saw your hand. No, no, no. You are going to hear. I want to try to chair the meeting.'",
        "'speaker_0': 'Thank you. But so I just want to again state my support and for this this appointment. And a lot of the reasons why you're you're the right person with the right experience have been said already. I think what I'll say your content is that.'",
        "'speaker_0': 'The challenge that you are accepting here is to build an approach to public safety that creates trust between the communities that we serve and law enforcement professionals, and builds a more robust and nuanced.'",
        "'speaker_2': 'Response.'",
        "'speaker_0': 'To crises. We have for a very long time, maybe going back to deinstitutionalization and in the seventies relied increasingly on people, as you say, with a gun and a badge to respond to all kinds of crises. And, you know, as somebody who has worked alongside folks in uniform for a number of years myself, they know that they're'",
        "'speaker_0': 'not always the right answer and they're put in a very difficult position. In addition, we have to still yet address the the racial component and disparities in public safety and how we approach public safety and how different communities feel either.'",
        "'speaker_0': 'Either protected, you know, or persecuted. And and we are building that mutual support among all of the professions that it takes and the public. That's really the challenge, because nobody we cannot succeed at what we want to do.'",
        "'speaker_0': 'We cannot have a safe, welcoming, equitable county if people don't feel supported by their law enforcement and if law enforcement isn't supported by their community. And so building that bridge, I think, is really where your challenge sits. And I also think that you are the perfect person to be on that bridge, helping to build it.'",
        "'speaker_0': 'So congratulations. And we will, of course, have lots more opportunity to work through these challenges together. And I look forward to doing that. Thank you. Thank you both. Councilmember Perry. Thank you. One thing that I am really encouraged by is experiencing interim share of call Tindal.'",
        "'speaker_0': 'Your willingness to work on behavioral health issues which are very, very close to my heart. So and it's a national crisis and a statewide crisis and we absolutely can do better. And so in the efforts of that, we're working on in District three to bring the police chiefs together, the fire chiefs together, and the sheriffs together.'",
        "'speaker_0': 'You representing? I am very encouraged by our recent meeting to look at radar as a co responder model, mobile integrated health model, looking at no wrong door in response as well, so that everybody can participate in ways that are meaningful to them.'",
        "'speaker_0': 'And while we figure out the lanes of fire and police and we figure out the gaps and the overlaps, and we identify the statistics and identify what's needed with all of these incredible efforts going on throughout these ten cities and unincorporated area.'",
        "'speaker_0': 'So and I'm very excited about Major Pingree and his promotion and working together with him as a representative for the unincorporated areas. So I just want to recognize that you were right on board right away in an area that is sometimes King County and cities can be a little middle school.'",
        "'speaker_0': 'You're not the boss army. And sometimes police and fire can do that. You're not the boss of me thing. So you just really stepped up in that terrific leadership and everybody willing to work together for the betterment of our family, our loved ones, our friends, our community members that really need to stay in each of our communities'",
        "'speaker_0': '. So thank you for your leadership on that. And I feel very excited about the hands that we're in going forward. Thank you. Thank you. Thank you. I do have a question and I am the sponsor of the motion, so I am very supportive.'",
        "'speaker_0': 'But as we all know, you're in a very, very tough position. And assuming that either claimant is confirmed, I think there will be continued attention on a lot of the high profile, very high profile officer involved shootings that have occurred within the King County Sheriff's Office.'",
        "'speaker_0': 'And now we're getting an inquest. Back after a long pause to hear about your thoughts on the inquest process and also how you will handle officer involved shooting investigations going forward if there are many more. Thank you. Question button.'",
        "'speaker_0': 'Yes, well, the first one on inquest, I'm supportive. I actually believe I mean, it is the public's opportunity to learn the facts related to an incident where officers used force in somebody's life, then did so. I think that's key.'",
        "'speaker_0': 'Right. We need to be able to provide that information to the public so the inquest process is happening and I support that. Now, to your question about officer involved shootings, where and how we would investigate? I think you're all aware of the state law reforms which now prohibit law enforcement agencies from doing their own investigations.'",
        "'speaker_0': 'So we are subject to state law, which means an independent investigative team would conduct any officer involved shooting. So we had a recent shooting the day after I was named as deputies nominee. The next day, our SWAT team during the execution of a mission.'",
        "'speaker_0': 'A step was dead. So the Valley Independent investigative team was at the South End. It depends on where the event happens, depends on who investigates. So in this case, that team investigated, which means by state law, I don't have any control over the investigation.'",
        "'speaker_0': 'Or as of January one of this year, I don't even get a briefing by that investigative team because they the rule makers, the lawmakers wanted a true independent investigation. I have minimal information. So I do think that's important for me to come out as the sheriff, as I did in this one, to say, you know, we had'",
        "'speaker_0': 'this event. This is what my people were doing. The subject is dead. None of our people were injured. But they're this other investigative team is doing the criminal investigation because any time somebody loses their life in resort, it's considered a homicide.'",
        "'speaker_0': 'I mean, even if it was in the execution of official duties. So it is investigated. So what I can do is what's called an administrative review, which is an administrative review into the events. But that is not something that we we have to keep that separate from the criminal so we cannot like contaminate because otherwise, if there'",
        "'speaker_0': 'were an issue of any conclusions by the independent team that charges should be filed, that we have interfered, then it could, you know, impact. So I don't really get to do much with with those types of shootings. So except to cooperate and stay in my lane.'",
        "'speaker_0': 'Thank you very much for your response. Are there any other questions? And I'm sure of culture. I'd like to now move on to take action. So I am a big gun supporter.'",
        "'speaker_2': 'Sorry. Thanks. The inner circle turned out great to see you. Thanks. I appreciate there's been a lot of the dialog back and forth on important issues. I look forward to supporting your your nomination appointment. My question is, you know, there's been a surging crime problem with gun violence here in the community.'",
        "'speaker_2': 'More than 460 shootings last year and the murder rate is way, way up. What is your sort of. Two or three things that you are sort of planning on doing to to really take on that issue and try and reduce crime.'",
        "'speaker_2': 'Sort of the center, I think, centerpiece and arguably the.'",
        "'speaker_3': 'Most important part.'",
        "'speaker_2': 'Of your job, I would say. What is your basic strategy on that?'",
        "'speaker_0': 'So thank you for that question because you are right. That is that's the bread and butter of what we do is reduce crime and the fear of crime. And so Key is partnering with other law enforcement agencies for insurance.'",
        "'speaker_0': 'And we have our I already do that working with the other chiefs around the area. But I think also something that's important is working with community because often they are aware and know where the issues are in their communities.'",
        "'speaker_0': 'And so we need to work with them to help identify what those are and what are potential solutions to those issues. The third thing is we need to use data right where these things happening. What are the indicators around what is happening?'",
        "'speaker_0': 'So I think all of those things that's kind of simplistic, short answer, but there's so much more and I know there are supports being created, which I think is very great, that that's an opportunity for our best and brightest to get together, to try to figure out how to do it.'",
        "'speaker_0': 'But this is really a societal issue, and I appreciate that. It's it's not just on law enforcement, right? There's a lot of different components to it, a lot of different players. But we need to be front and center and involved.'",
        "'speaker_0': 'And that does also speak to officer presence. And with a 113 Commission vacancies, it's a little more difficult to have the type of presence and the patrolling in the communities which could deter potential crime. So we are working hard to staff up, but those are some of the things I will be working on with my leadership team'",
        "'speaker_0': 'and in the community and with with you, the Council on the Executive as well.'",
        "'speaker_2': 'Thank you for that response. I appreciate that. And, you know, my my job is to help you succeed at yours. And whatever I can do, perhaps this council can do to get those hundred and 13 individuals hired in the office staffed up with you, come up with creative ways or thoughtful approaches to try and do that, perhaps'",
        "'speaker_2': 'best practices being used across the country right now. So we've got a good, robust, highly functioning sheriff's office. Thank you very much.'",
        "'speaker_0': 'I thank you, Councilmember Dunn. And I believe we will now go on to take action on the proposed motion. 2020 20191 I'd like to hear more from our interim share, but we are way past adjournment. Time for the meeting.'",
        "'speaker_0': 'So with that, Councilmember Dunn, would you please move this action? Because I am the sponsor of the motion.'",
        "'speaker_3': 'Very well.'",
        "'speaker_2': 'I would move to approve Protocol Tindal as our sheriff and director of the department, as has been briefed and provide present to the council.'",
        "'speaker_0': 'Thank you very much. Councilmember Dunn and Nick Bellman, would you please just remind us very briefly about Amendment one?'",
        "'speaker_2': 'Yes. Amendment One would outline the language of the proposed motion with that charter, section 340, as well as charter section 350, 2040. We just because we haven't done this appointment in a long time, we wanted to make sure we got the language exactly right.'",
        "'speaker_0': 'Thank you very much. Are there any questions about amendment number one? Okay. Consider it done.'",
        "'speaker_1': 'Google Amendment one.'",
        "'speaker_0': 'Amendment has been moved. Any comments? All in favor indicate by saying i.'",
        "'speaker_1': 'I, i i in.'",
        "'speaker_0': 'Person of the amendment has been adopted. We now have the title amendment counselor. We can.'",
        "'speaker_2': 'Move to 1.'",
        "'speaker_0': 'To 1. A title amendment one has to move to any comments. Questions on paper indicate by saying I, I, I say no to the amendment has been adopted. Is there any further discussion on proposed motion 2020 20191 as amended?'",
        "'speaker_0': 'Come back and ask.'",
        "'speaker_1': 'If it's okay with you. I'd like to have my name added as a co-sponsor to the motion and encourage my colleagues to join in the show of unanimity by doing the same if they're so inclined.'",
        "'speaker_2': 'Okay. Now add me.'",
        "'speaker_0': 'At me to. Damond City Council member. But did she? I think Councilmember Perry and Councilmember Cycle. I also feel like things that irk Councilmember Van right there as well. Okay. Very good. Thank you. And I will just say I am enthusiastically supporting the confirmation of the nomination of sheriff.'",
        "'speaker_0': 'And I'm sure Cole turned out to be unacceptable, sheriff. And since the time is right, we will go ahead and have a group called The Roll. Thank you, Madam Chair. Councilmember by the Chin by Councilmember DEMBOSKY.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'As a member done by Councilmember McDermott. Councilmember Perry. I don't remember up to the councilmember, but by about one. I council member starline. I. Madam Chair, on the borders. I know North and West Council member MacDermid. Excuse me.'",
        "'speaker_0': 'Okay. Thank you all with a vote. We have approved proposed motion 2020 20191 as amended. And if there are no concerns with placing this on the consent calendar, we will expedite this motion with the due course recommendation for the consent agenda to the May 24th Council meeting.'",
        "'speaker_0': 'That's next Tuesday because there is some urgency here. We want to have our confirmed sheriff in place. Any comments? Okay. Very good. That concludes the agenda items on our agenda. I apologize for going past our usual time, but we did accomplish quite a bit.'"
    ]
}