{
    "AN ORDINANCE related to the operation and maintenance of the Harborview Medical Center, authorizing the King County executive and the president of the Harborview Medical Center board of trustees to execute a hospital services agreement with the regents of the University of Washington and adopting the mission statement and admission policy for the Harborview Medical Center.": [
        "'speaker_0': 'Excellent. Thank you so much. Congratulations. I look forward to working with you for the next 30 years. Yes. Let's put that on the consent calendar and there's no objection we can expedite it's and she's already working. So now takes us to our next agenda item proposed ordinance 2016 0094.'",
        "'speaker_0': 'And as you can see on our agendas, we have not only the page numbers but approximately the time that we have allocated, and we will have the time allocations on each of our items this year so that you know how much time we've allocated.'",
        "'speaker_0': 'So this is an ordinance related to operation maintenance of the Harborview Medical Center and the King County executive, and the President of Harborview Medical Center Board of Trustees executed a hospital service agreement with the Regents of the University of Washington and a mission statement and admission policy for Harborview Medical Center.'",
        "'speaker_0': 'This was a lot of work by a lot of people, and we are very pleased that we are here today with a proposal. So who should we bring up first? Okay. Would you like to come on up first and introduce yourself to us?'",
        "'speaker_0': 'Here are. Yes. Grant Lewis.'",
        "'speaker_3': 'Good morning. I'm Clayton Lewis, and I'm president of the Harbor View Board of Trustees. And I'm here today representing the trustees, the men, the women that you've appointed to represent both you and, of course, the citizens of King County.'",
        "'speaker_3': 'As trustees, we are both honored and humbled by our responsibility to Shepherd Harbor view on its journey. And what I want to do today is share with you a couple of comments. In the first day we are here recommending enthusiastically that you adopt the contract before you.'",
        "'speaker_3': 'For the past 20 years we've been operating under this contract and if you see it, it's 14 pages long. It was found signed by then King County executive Gary Locke, and it looks like it might have been produced on a mimeograph machine.'",
        "'speaker_3': 'But a contract has served us extraordinarily well in terms of the relationship between King County and the University of Washington. As you appreciate, Harborview is really the crown jewel of the medical system of King County, and the residents of King County are extremely fortunate in a number of fronts.'",
        "'speaker_3': 'First were the adult and pediatric trauma center for a four state region. So if you're in King County, you have immediate access to Harborview. But because the services, the quality of care are so impressive, residents from the states of Alaska, Montana, Idaho are flown here if they need that level of care.'",
        "'speaker_3': 'Second, as a result of that, we have specialty areas that people choose for elective surgery in orthopedics, neurosciences, Optum ology, vascular surgery IV because of the both quantity of care that take place at that facility. In addition, Harbor View and the trustees take very seriously our responsibility for disaster planning and management for King County.'",
        "'speaker_3': 'In the case of an emergency. And finally, if you go to Harborview and if you talk to the employees there, each one will tell you how passionate they are about serving individuals from all walks of life, regardless of their ability to pay.'",
        "'speaker_3': 'Serving the mission population. So as trustees, as we entered this process of looking at a new contract. We were focused on four areas. First, how could we improve service to the mission population? And as we looked at that, we looked at the quality of care.'",
        "'speaker_3': 'We looked at how can we be more efficient, especially in partnership with King County Public Health. How could we make sure that we're providing a continuum of care so that individuals in the mission population are being served at every step along their health care journey?'",
        "'speaker_3': 'And finally, looking at accessing new funding sources. The second thing we were focused on is how could we strengthen the partnership between U dub King County and Harbor View to make sure that we're serving individuals from all walks of life?'",
        "'speaker_3': 'As you know, when we started this contract 20 years ago, the University of Washington had one medical center and then the relationship advantage in Harborview. Today, the university medical system is expanded dramatically with Valley, with Northwest, with other clinics.'",
        "'speaker_3': 'And what that allows from a system perspective is to make sure we're providing care to the mission population throughout King County. Next thing we wanted to do in this contract and we believe we've successfully done, is provide greater clarity of the responsibilities of King County, the responsibilities of the university, and the responsibilities of the trustees.'",
        "'speaker_3': 'And then finally, and this is probably the most complex was how can we create a contract that actually can operate and provide the right framework, the right structure for ten years to start and potentially 210 year extensions? It's impossible to imagine what health care is going to look like in 30 years, but we wanted to provide a'",
        "'speaker_3': 'contract that gave us the right framework as we're building out this partnership. Now, we started this journey in September of 2014, and like any long journey, you start with, you get to know the people you travel with very well.'",
        "'speaker_3': 'And I just wanted to call out a couple individuals and say thank you very much. First to Patrick. I believe you'll hear from Patrick and Sung and I literally would meet sometimes three times a week over the course of the past year in terms of putting together this agreement.'",
        "'speaker_3': 'And Patrick did an extraordinary job of representing the interest of King County, the interest of the council, and was really a very strategic and thoughtful negotiator. Michel also was a key member of the team, as was John Gerberding.'",
        "'speaker_3': 'And then I'd like to call out Councilmember Dombrowski, who's been on the committee from the start and really guided us thoughtfully in terms of strategic decisions and some important considerations. And then most recently, we've been joined by Councilmember ARP to grow up and gossip.'",
        "'speaker_3': 'So here today in summary to passionately, we had a unanimous recommend.'",
        "'speaker_2': 'Clayton, let me help you out and councilmember Cole was.'",
        "'speaker_3': 'Oh, thank you thank you did not know you run the committee all said I appreciated you being at the event but thank you. And so here in summary to say the trustees unanimously, enthusiastically are recommending this contract for your approval and consideration.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Well, we are very excited and that we have come to this great contract. And for the superior work that you do, it is to help me with this effort. The only level one trauma center west of the Mississippi River is that right.'",
        "'speaker_3': 'Now what we do actually is we're the trauma one center for a four state region. And what's unique about that and really so important is that you may go to some cities where they may have two or even three trauma one centers.'",
        "'speaker_3': 'And what the studies indicate about that is that when you split the trauma, serving the trauma patients, it becomes somewhat inefficient because literally at Harborview, we have specialist on staff 24 hours a day. So we literally serve Montana, Alaska, Idaho in the state of Washington.'",
        "'speaker_3': 'So we serve the largest region of the country, largest geographic region, as the only trauma one center.'",
        "'speaker_0': 'Indeed, you need telemedicine when you're talking about people from Montana. Is that how you help in trauma?'",
        "'speaker_3': 'So we do do tell about we have both telemetry programs and then telemedicine programs throughout the four state region.'",
        "'speaker_0': 'It's great. I have been able to go to a dinner party where you were talking about the opening of your burn center many years ago and looking at the difference between the old methodology and the synthetic skin methodology.'",
        "'speaker_0': 'And I almost made it through the dinner without crying, but not quite. It was really profound to see the differences and the people talking about the trauma that they've been through in their bodies, such as severely burned, was really a profound experience.'",
        "'speaker_0': 'I'll never forget that. So I'm very thankful that you had that capability and such amazing different kinds of expertize, no matter. Where you go. We had a meeting last year, I think it was Mr. Up the Grove had a meeting up at your facilities and it was wonderful to have the opportunity to, to walk through and not'",
        "'speaker_0': 'worry about being a patient, but to just be able to walk through and look around and see all the different things you had available. So thank you very much and thank you for the hard work. This was not easy.'",
        "'speaker_0': 'We have calculated how long it will be until Mr. Hamacher can retire after the next 30 year contract is done. So. So. Thank you so much. Of course. And tell the board thank you for their hard work and we're glad things have come together so nicely.'",
        "'speaker_3': 'Appreciate that. And I just stress also, even in the Berne example, that speaks to the power of the partnership with the University of Washington. As you know, the University of Washington receives more grants than any other university from a public level and especially within the trauma center and all the care.'",
        "'speaker_3': 'A lot of the research that takes place, the teaching that takes place is a foundational to the quality of care we're able to provide.'",
        "'speaker_0': 'Thank you. I have a sibling who was trained at your hospital. Oh, excellent. Yes.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'I'm sure we're going to. Is Clayton going to leave us or is he going to stay when?'",
        "'speaker_0': 'I think he's probably going to stay because we may have questions from him, too. Mr. Hamacher, welcome on board.'",
        "'speaker_3': 'So. Good morning, council members. Patrick Hamacher I'm going to now go over the staff report that's in your packet. It begins on page 13. As Clayton indicated, Rochelle was a big drafter of this as well. But I'm going to go through the staff report and any of the hard questions.'",
        "'speaker_3': 'I'll have her answer at the bottom of page 13, Harborview Medical Center. Many of you know, this started as an eight bed hospital in South Seattle in 1877.'",
        "'speaker_0': 'I wasn't here then as I wasn't here. You know, that came.'",
        "'speaker_3': 'In in 1931. It moved to its current place on First Hill, and it's now a 413 bed inpatient facility that serves just under 65,000 emergency room admits and about a quarter of a million clinic visits per year. So it is a major provider of health care.'",
        "'speaker_3': 'It was originally owned and operated by King County. It still is owned by King County. But in 1967, the operation of the hospital switched to the University of Washington and has remained that way, too, till today. As Clayton noted in his remarks, the original contract was heavily rewritten in the early nineties, but actually a lot of the'",
        "'speaker_3': 'terms are very similar to what they would have been in the late sixties. So coming into this project, it was a very dated document that needed a good amount of worked from a modernization perspective. Moving to page 14 of your packets, the staff are going to highlight the changes to this agreement from the prior one, particularly those'",
        "'speaker_3': 'that have a major policy impact. And the first is what's known as the concept of support for the hospital's mission population. This the mission population itself is identified on the bottom of page 14. But how this provision of the contract will work is there is a commitment by the parties to work together to find a way to'",
        "'speaker_3': 'better serve the mission population in a way that makes it easier for King County to avoid some of the inefficient costs we're currently incurring. And this is a partnership whereby the parties will agree to find ways to make about $5 million a year in efficiency improvements that will result in lower costs for the county.'",
        "'speaker_3': 'That can be, as many people have said, that can be in cash or trade. Hopefully the goal is to have that be in trade so that the services are provided the more efficient manner. But that's one of the key provisions of the contract.'",
        "'speaker_3': 'The second key provision towards the bottom of page 14 is a refreshing and modernizing of the way in which the mission statement mission population was written. There were some dated terms hadn't been looked at in many years, so this contract would update the mission population for the hospital.'",
        "'speaker_3': 'There are quite a few changes in the contract related to governance. I have now moved to the top of page 15. The one of the key things for the county's leadership team in the negotiations was that Harborview maintained its identity independent of both the county and the University of Washington.'",
        "'speaker_3': 'And so this contract requires that it puts the board in the position of approving any change to the logo, signage or branding of the hospital, and lays out stipulations for how and where the logo and u dub and King County signage and branding shall be used to appropriately match the board's role in maintaining the hospital independently.'",
        "'speaker_3': 'The county's role as the owner of the hospital and the university in the role of the operator of the hospital. The next one pertains to retention of services on the campus. All of the services provided at the medical facility have been broken into core or non-core services and core are the big ones like the trauma center, the'",
        "'speaker_3': 'burn unit and many of the clinics. The board approval is required for changes to the locations of any core service and consultation is required for any changes to non-core services. That in fact has been the practice over the years but was never written down or a requirement of any of the relationships.'",
        "'speaker_3': 'So that's been formalized. The board also under this contract has the authority to hire and retain their own staff if it's necessary to do that to perform their oversight roles. Right now, all of the staffing for the board is provided by the university.'",
        "'speaker_3': 'It does not require that they hire their own staff. It just merely gives them the option to hire the staff for the board, provided that it's included in the medical center budget. The one of the other changes that I think will be good for the council's review of Harborview is the timelines for the Harborview Capital budget are'",
        "'speaker_3': 'being adjusted in this. Contract to match and give the county time to actually review it prior to taking effect. Right now, because the hospitals on the state fiscal year because of YouTube is the operator, you don't see their capital budget sometimes until 3 to 6 months after it's taken effect, which gives your rule, which very heavily limits'",
        "'speaker_3': 'your role in an oversight capacity. So the contract binds the parties to a new process. Earlier in the year, it will be transmitted to the Executive and into the Council for a year review and approval prior to it taking effect July 1st.'",
        "'speaker_3': 'The in terms of also increase to governance, as you're aware that Harborview has a board while Yudof Medicine also has a board, and this contract requires you to the University of Washington to appoint two members of the Harborview Board to also sit as full members of the UW Medicine Board.'",
        "'speaker_3': 'The there are a number of provisions in the contract pertaining to the executive director of the hospital. The most important two concepts, I believe, are that the executive order. It's clarified that the executive director reports jointly as even though they're a Yudof employee, jointly to the to the board and to the University of Washington, and makes it'",
        "'speaker_3': 'clear that at the board's direction, the executive director will be removed by the university. And then one of the other issues that arose. Now I'm turning to page 16. There are a couple more related to governance. The county does own the hospital and has a vested interest in that hospital being maintained properly.'",
        "'speaker_3': 'So the contract requires the university to maintain the hospital with best practices for a medical facility and to staff the hospital accordingly in order to assure that that occurs along the same lines of matching the interests with the operations.'",
        "'speaker_3': 'It does shift the responsibility for commercial leasing on the campus from our facilities division to the similar division at the University of Washington. So the university will be in charge of negotiating the leases for the space on the on the campus, the commercial leases, the coffee shops, the subways, the banks that are on the campus.'",
        "'speaker_3': 'Those will still have to be executed by the county, but the negotiation process will be done by the university. And the hope there is that it is done more quickly and more in line with the university campus needs or with the medical center campus needs and currently occurs.'",
        "'speaker_3': 'The other related issue related to capital is right now projects under $1 million in capital cost are managed by the university, and anything over 1 million on the campus is managed jointly by the university and the Facilities Management Division.'",
        "'speaker_3': 'That is a number that was picked in the early nineties and has never been changed and as a result it leads to way more projects and was originally intended being managed by jointly instead of just by the university as the operator.'",
        "'speaker_3': 'So this contract increases that amount from 1 million to 5 million, the contract. Now moving to issues related to labor. This is on the bottom of page 16. The contract notes that the one of the key assets at the hospital is the relationship with the employees that work, that there's over 4000 employees that work on the campus'",
        "'speaker_3': 'and for the first time expectations of the operator of the campus in terms of the labor, labor management practices are included in the contract. These are not binding. I would describe many of them as aspirational. In other words, what the county would expect of its operator to occur.'",
        "'speaker_3': 'But the university is responsible for its particularly its collective bargaining and its labor management. And this contract keep respects those appropriate lines there. I've just directly copied a couple of the key provisions from that section of the contract into your staff report.'",
        "'speaker_3': 'Section 3.122 says that the university shall seek to maintain a positive employee and Labor relations with their employees at the campus. Section 2.3 directs the university to have a process in place for continual improvement for employee and labor relations on the facility.'",
        "'speaker_3': 'And two Section 3.1 to 5 requires training for employees at the university, at least as high as what they would receive at University of Washington Medical Center. So it's a baseline set at their other academic medical facility that they have to at least achieve, if not better.'",
        "'speaker_3': 'So there, I think, key provisions on labor moving to the bottom of page, middle of page 17. There are another several other key general conditions. The first you heard Clayton mention the term, the term of the agreement is a ten year agreement with two automatic rollovers.'",
        "'speaker_3': 'So a total of 30 years unless one of the parties. Out at the at the tip each of the ten year window renewals. The current agreement includes no dispute resolution provisions except for termination, which is rather dramatic if it was a relatively minor dispute.'",
        "'speaker_3': 'So this new contract includes a labor dispute process that the parties will follow, protects everybody's rights to still go to court or to terminate. But it includes a process that should be filed short of that.'",
        "'speaker_0': 'Could you elaborate on that just a little bit? What would the process entail?'",
        "'speaker_3': 'Sure. So the process is what I would describe as very standard mediation arbitration provisions that were, quite frankly, just missing from the prior agreement. And we've included consistent with what would be in other county contracts of this nature.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'And it was that section itself was relatively straightforward because, of course, the university has similar language as boilerplate in their languages as well.'",
        "'speaker_0': 'Can I get a copy of that later?'",
        "'speaker_3': 'Sure. The entire agreement actually was included as an attachment. The staff report.'",
        "'speaker_4': 'Madam Chair, it's actually on page 72 and 73.'",
        "'speaker_1': 'Section 13 of the contract.'",
        "'speaker_0': 'Excellent. Thank you very much.'",
        "'speaker_3': 'The the other thing that I think was is important but was missing from the current contract is there was no language in there on the conducting or supervising of research at the facility. As you're aware, it's a major research facility as well.'",
        "'speaker_3': 'So the contract we worked with our outside attorneys and our consultants on this to include standard language for the conducting of research on the facility as well. So I think those are all important changes to the agreement. The only other item I would note for your consideration as part of this is as part of the agreement.'",
        "'speaker_3': 'A number of code changes will be necessary to implement the agreement. One of the two of the substantive ones we covered ahead of time the university being our agent for negotiating at the campus, and also the changed from the capital operations from 1 million to 5 million.'",
        "'speaker_3': 'Additionally, the timelines for the new capital process need to be incorporated into the code as well. Staff are working on that and we'll be able to bring that forward to full council. We're working with legal counsel right now.'",
        "'speaker_3': 'It will be a very straightforward ordinance and we'll be able to bring that forward whenever this agreement goes to full council to implement. With that, I'd be happy to take any questions, Madam Chair, and that concludes most everybody.'",
        "'speaker_0': 'That was a very comprehensive report and a lot of work. And I can see why you were meeting for so many times each each week for that period of time. One thing I did want to say is that, listen, population order what each population's requirements are about on page 14.'",
        "'speaker_0': 'I was concerned that the order wasn't was in exactly the order I would have put it in. And so I was told that they're all important, so they're all first. And so I want to just point that out for the record that there offers is not in the order in which they appear and it's supposed to be'",
        "'speaker_0': 'in alphabetical order, which took me a while to see because it all starts with persons. So that was a little interesting. But anyway, I just thought that was important that all of those are of equal weight and people that will be served.'",
        "'speaker_0': 'And so that was that was great. Any questions anybody has about this contract? Well, obviously you've done a really good job either in the pre briefings or in the work or all together. And so I'd like to thank our attorney, John Gerberding, that's sitting in the back is upright, which is a good thing after working on this'",
        "'speaker_0': 'contract and also and Kim Gilmore and singing and then a special shout out. I know that everybody contributed at the end, but there were some people that were on from the very beginning and spent years. Councilmember Debusk, I believe you were there from the beginning as well as Council Member Haig.'",
        "'speaker_0': 'So I think all the members and Council member Philips. That's right. So that three of you who started from the beginning deserve a shout out for all the good work that we got to this place. And I'm glad we have more people now that will be working on this.'",
        "'speaker_0': 'And I think the beauty of it is it is now modernized. It is much more comprehensive. It makes better sense. And we're all really familiar with it now. So 30 years from now, we will be ready for the next briefing.'",
        "'speaker_0': 'So it will be great. So, Councilmember Dombroski, just something.'",
        "'speaker_2': 'I would just like to make a couple of remarks of my colleagues would indulge me. And I want to start by thanking in particular Clayton Lewis, who has been how long have you served on the board? Clayton ten years, ten years, a decade of service.'",
        "'speaker_2': 'This is not compensated service. Clayton is a busy guy in the private sector who does this for the betterment of the community. And it is hard to find the kind of qualified people that to serve on the board that Clayton represents.'",
        "'speaker_2': 'I think he's customer McDermott's nominee, if I've got a correct good judgment there, Councilmember McDermott. But I mean, I got a chance to see him in action and the time you mentioned, but the time that he invested personally in this was above and beyond the extraordinary amount of time that our Harvey trustees invest in that work and'",
        "'speaker_2': 'the ordinary course. But for two years, Mr. Lewis has worked on this and has brought his expertize from the private sector to bear on this project. And it is an incredibly good result as a result of his personal commitment to it.'",
        "'speaker_2': 'I will tell you this, you had essentially three parties here. The county confirms the contract. Technically, I don't know if were were a party, John could address that. But the trustees, the University of Washington and the county are particular objectives weren't always aligned.'",
        "'speaker_2': 'And I would say we turned to kind of an interest based bargaining, if you will. What were our shared interests that we could identify and get to? Yes, and it took a little longer than than we anticipated because the bargaining was tough and the stakes were high.'",
        "'speaker_2': 'But Mr. Lewis and along with the county executive office through Sung Yang and our staff Rochelle Celebration, Ian and Pat Hamacher were really instrumental as a team and coming together, I think, to advance the shared interests of serving the mission population and the agreement before you colleagues I think really does that.'",
        "'speaker_2': 'And there's some exciting things in here that if we make them work and I think we will, there's tremendous commitment on the behalf, on behalf of all parties here and some very, very exciting things in in here in terms of synergies, opportunities for efficiencies, opportunities to deliver care in a better way, opportunities to serve the mission population'",
        "'speaker_2': 'in its new locations where historically, you know, in 1970, that mission population was centered in the city of Seattle. Today it's not I mean, it's here, but it's much more suburbanization consistent with the suburbanization of poverty phenomenon that we know and have studied so much here.'",
        "'speaker_2': 'And so to be able to find synergies in cooperation with our public health clinics, which are more spread out with other functions at the K engages in public health at j o health. We don't specify in here where those opportunities must be, but we and that's good.'",
        "'speaker_2': 'There's, there's an opportunity to work together to find the best places for them. We are giving up some stuff with respect to example leases, but that's an informed and knowledgeable decision. I think it's a good idea. It's more procedure than substance.'",
        "'speaker_2': 'Who negotiates those? It's a good thing. The capital number from 1000000 to 5 million, that's a give, but it's in the interest of efficiently operating the hospital. What I will tell you is that I think this agreement conforms with the seven or so objectives that were laid out in the motion that this council adopted in July of'",
        "'speaker_2': '2014. At the beginning of this process, they were call that we had a process that put forth the overall objectives and the contract, I think, reflects those. And so I really commend it to you. But I want to take a few moments to thank the negotiating team who spent a lot of time on it, and in particular'",
        "'speaker_2': ', Mr. Lewis, because he didn't have to. He didn't have to. And we really appreciate it. Clayton Thank you. One more. Thank you. As we got down to the final difficult open issues and there were a couple of them.'",
        "'speaker_2': 'President Ana marie Cao said the University of Washington made a personal investment and sent Randi Hodgins as her representative to help get the deal done, if you will. And I think that her personal interest and commitment to this project was instrumental in getting us here today.'",
        "'speaker_2': 'So thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. And thank you for all the work that went into that. And please think the entire board for their work and dedication. And it's always a pleasure to see their innovation and dedication to you. So thank you for all your hard work.'",
        "'speaker_0': 'Appreciate that. Okay. With that.'",
        "'speaker_2': 'Emotion.'",
        "'speaker_0': 'Yes, please. I'd like to have a motion.'",
        "'speaker_2': 'Okay. Thank you, Madam Chair. Let's see. Is this an ordinance? Where are we.'",
        "'speaker_3': 'Going?'",
        "'speaker_0': 'To turn it.'",
        "'speaker_3': 'Over to zero nine.'",
        "'speaker_2': 'For I would move adoption of proposed ordinance to a60794.'",
        "'speaker_0': 'And then.'",
        "'speaker_2': 'Request expedited expedition to Monday's council meeting. If that works on the time frame.'",
        "'speaker_0': 'Yes, because the UW Board of Regents will be voting on February 13. So this having been expedited will be helpful to that. So that would be great. So, clerk, would you please call for the vote?'",
        "'speaker_4': 'Thank you, Madam Chair. Councilmember Bell, Dutchie. Councilmember DEMBOSKY, Councilmember Member.'",
        "'speaker_3': 'All right.'",
        "'speaker_4': 'Council member Gossett. Council member Caldwell. Council McDermott. All Oh. Council member of the. Council member Boatright Bower. Mr.. Madam Chair. I am sure the vote is seven eight no nos and council members.'",
        "'speaker_0': 'Gossett and Von right there. Excuse. Excellent. Thank you so much, everybody, for your good work. Mr. Hamacher.'",
        "'speaker_3': 'I just would point out one more thing, Madam Chair. I know that during the staff report, that amendment to effectuate some of the code changes needs to be done as well. We will, as soon as that's ready and reviewed by legal counsel, will distribute all of that to you with a summary.'",
        "'speaker_3': 'But you should expect that to catch up with this as well for next week. So we'll get that distributed as we're frankly seen as it's written, but it's almost done.'",
        "'speaker_0': 'So that'll be separate, even though this is on the expedited calendar that will be taken up.'",
        "'speaker_3': 'We've been advised we should do it at the same time. So we'll take it up with suspend the rules on on Monday to adopt this at the same time as the contract. But I want to get that out to you as soon as it's done so you can see it ahead of time.'",
        "'speaker_3': 'So you're not surprised.'",
        "'speaker_0': 'Excellent. We'll look forward to that. Thank you for letting us know. Thank you so much. This takes us up to our last order of business. And I just wanted to make one announcement. We have I have received those of you that sent in ideas on what you'd like the current committee to do this year.'"
    ]
}