{
    "AN ORDINANCE clarifying Title 1, Title 2, Title 3, Title 4 and Title 4A of the King County Code, establishing a gender neutral code and making technical corrections; and amending Ordinance 1371, Section 1, and K.C.C. 1.02.010, Ordinance 11348, Section 2, and K.C.C. 1.05.020, Ordinance 11348, Section 4, as amended, and K.C.C. 1.05.040, Ordinance 13320, Section 2, as amended, and K.C.C. 1.07.020, Ordinance 13320, Section 3, as amended, and K.C.C. 1.07.030, Ordinance 13320, Section 4, and K.C.C. 1.07.040, Ordinance 13320, Section 5, as amended, and K.C.C. 1.07.050, Ordinance 13320, Section 7, and K.C.C. 1.07.070, Ordinance 13320, Section 8, and K.C.C. 1.07.080, Ordinance 13320, Section 10, and K.C.C. 1.07.100, Ordinance 13320, Section 12, and K.C.C. 1.07.120, Ordinance 13320, Section 14, as amended, and K.C.C. 1.07.140, Ordinance 13320, Section 15, as amended, and K.C.C. 1.07.150, Ordinance 159, Section 2, as amended, and K.C.C. 1.16.020, Ordinance 159, Section 8, as amended, and K.C.C. 1.16.080, Ordinance 159, Section 9, and K.C.C. 1.16.090, Ordinance 11683, Section 9, as amended, and ": [
        "'speaker_0': 'The next thing on the item anyway, we'll go to number five and hold off on roll call and approval of the minutes until we have a few more folks. Thanks. Welcome. So number five, I recall that in 2016, the council put a charter amendment on the ballot to make our charter gender neutral, and it passed by 65%'",
        "'speaker_0': ', which was very nice. That was motivated by the, I believe in part by the election of two new female council members who found ourselves surprised that our orientation day to be referred to as council man. I'm sorry, Heidi, we didn't go far as your item.'",
        "'speaker_0': 'And I'm just kind of juggling the balls here this morning after that charter amendment passed with our staff to review and update the county's code to make a general gender neutral. This is a much larger body of work, a significant body of work, and we're going to take it in stages.'",
        "'speaker_0': 'Today's ordinance is the first of what will be several ordinances to eliminate gender specific terms from the county code. And we are lucky to have Sam Porter and Aaron Osnes here to brief us today. Thank you for your work on this.'",
        "'speaker_0': 'Thank you. Please go ahead.'",
        "'speaker_1': 'Sam Porter, Council Central Staff. The materials for this item begin on page seven of your packet. Proposed Ordinance 2017 0489 is the first in a series of four ordinances that would make changes to the King County Code to remove gendered pronouns and historically gendered terms wherever possible.'",
        "'speaker_1': 'This ordinance pertains, as the chair mentioned, to titles one through four of King County Code. No substantive legal or policy changes are proposed to be made in this ordinance, but other drafting corrections are proposed by the Code Advisor.'",
        "'speaker_1': 'This proposed ordinance is consistent with Washington state law and county code bars to be written in gender neutral terms. In the proposed ordinance, gendered pronouns such as he, him, she or her are replaced with the title of the actor and impacted sentences, for example, in sections that refer to the director as he or she.'",
        "'speaker_1': 'The revision changes the gendered pronoun to the director, naming the title of the actor and disregarding gender. Table A on page two contains a sample of other proposed changes to historically gendered terms. A comprehensive list of the gendered terms addressed in the ordinance is available in attachment two of the staff report on page 213.'",
        "'speaker_1': 'In your packet, executive staff and the King County Ombud have been consulted regarding the proposed changes. Their feedback has been addressed and incorporated into the proposed ordinance in attachment three. On page to 21 of your packet is the timeline for future ordinances, and the plan is for three additional ordinances to be presented to this committee completing the'",
        "'speaker_1': 'review of remaining titles of the King County Code. This work should be completed by May of 2018. This concludes my report. I would like to recognize Russell Patel from the clerk's office and the Council Coder Advisor Bruce Bruce Ritson for their extensive work during this process.'",
        "'speaker_1': 'Aaron and I can answer any questions at this time.'",
        "'speaker_0': 'ABRAMS Thank you very much. So I hope that, colleagues, you've had a chance to take a look at this. It seems fairly non substantive and non-controversial. I think the only thing that stood out to me certainly was the change from ombudsman to ombudsman.'",
        "'speaker_0': 'A quick search through the Internet suggests that that is a movement that is happening. Lots of other places have changed. Their ombudsman office to ombudsman is going to take a little getting used to. But are there any questions, concerns?'",
        "'speaker_0': 'Councilmember Caldwell.'",
        "'speaker_3': 'Thank you, Madam Chair. Just on that issue, on ombudsman, as compared the ombudsman, we wrestled with that at the state legislature as well, and the code revised its office and it was changed to ombudsman there. But I expect we may run into some more issues that will come up as we go along, because some are terms of'",
        "'speaker_3': 'art, some are terms that are recognized by the federal government in terms of occupation. So there's a lot more in to involved with this than I initially thought. It took the legislature six years to complete this project and I had thought it was going to be pretty straightforward at the onset.'",
        "'speaker_3': 'So thank you for your work rustles and as well.'",
        "'speaker_0': 'Thank you. Is there any other discussion or questions? Are we prepared to move this out today and take this first bite and let the staff move on to the next one? I'd entertain a motion I can't remember.'",
        "'speaker_1': 'Lambert Thank you. The Post Ordinance 2017 0489 with a do pass recommendation.'",
        "'speaker_0': 'Okay, it is. The motion is before us. Any comments? All those. There's no amendments, so I suppose we're prepared for.'",
        "'speaker_1': 'A roll call. Marcus Thank you, Madam Chair. Councilmember Dombrowski.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Councilmember Dunn All right. Councilmember Gossett Council Councilmember Commonwealth.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Council Member Lambert I'm Councilmember McDermott. Right, Councilmember of the Grove. Councilmember One right there. Madam Chair, I Madam Chair, the vote is 18 is no nos. Councilmember of the Grove excuse.'",
        "'speaker_0': 'Okay, by your vote you have passed this ordinance number 2017 zero 49 of the do pass recommendation. I'm going to suggest we send it. We're going that we expedited just because December 11th is starting to get to be a very packed meeting.'",
        "'speaker_0': 'And I understand the chair has asked that we take up as many things December 4th as possible. Okay. That's what says here on my notes. Anyway, somebody wrote that for some reason it's on and I would suggest that we put it on consent.'",
        "'speaker_0': 'It doesn't seem like it needs to be. Yeah. All right. Thank you very much. Can we go back and do the roll call at this time?'"
    ],
    "AN ORDINANCE relating to paid sick leave; amending Ordinance 12014, Section 5, as amended, and K.C.C. 3.12.010, Ordinance 12014, Section 7, as amended, and K.C.C. 3.12.040, Ordinance 12077, Section 3, as amended, and K.C.C. 3.12.125, Ordinance 12014, Section 36, as amended, and K.C.C. 3.12.188, Ordinance 12014, Section 19, as amended, and K.C.C. 3.12.190, Ordinance 12077, Section 4, as amended, and K.C.C. 3.12.200, Ordinance 4324, Section 27, as amended, and K.C.C. 3.12.210, Ordinance 12014, Section 20, as amended, and K.C.C. 3.12.215, Ordinance 18408, Section 2, and K.C.C. 3.12.219, Ordinance 12014, Section 21, as amended, and K.C.C. 3.12.220, Ordinance 12014, Section 22, as amended, and K.C.C. 3.12.223, Ordinance 13743, Section 1, as amended, and K.C.C. 3.12.224, Ordinance 7956, Section 6, as amended, and K.C.C. 3.12.225, Ordinance 12014, Section 23, as amended, and K.C.C. 3.12.230, Ordinance 12077, Section 5, as amended, and K.C.C. 3.12.240, Ordinance 12014, Section 25, as amended, and K.C.C. 3.12.250, Ordinance 12014, Section 26, as amended, and K.C.C. 3.12.260 and Ordinance 9967": [
        "'speaker_0': 'Thank you, colleagues, for a good discussion. And to the members of the public who came out in support of this this proposal, it's very helpful to have your input. Our final agenda item today is proposed ordinance number 2017 0490, which would make changes to the county's sick leave and other human resource related policies.'",
        "'speaker_0': 'These changes are being proposed to bring county code into line with the statewide initiative 1433 that passed last year and guaranteed all workers in Washington state paid sick leave. We do have an amendment today for technical changes and there may be a need for additional amendments.'",
        "'speaker_0': 'We have staff member Heidi Petrarch here to brief the committee. Thank you for running down when we prematurely announced this item and then waiting. And we appreciate.'",
        "'speaker_1': 'You being here. No problem. Thank you. Exercise. I thank you, Madam Chair. Heidi. Poppycock. Council staff. The staff report begins on page 229 of your packet. Proposed Ordinance 2017 0490 would amend the King County Code to incorporate the new state law requirements relating to paid sick leave.'",
        "'speaker_1': 'To provide some background in November 2016, Washington State Voters Approved Initiative Measure 14 three or EI 1433, which authorized a number of changes pertaining to paid sick leave me minimum wage, automatic service charges and employer retaliation. These changes have been codified and.'",
        "'speaker_1': 'After 4946 of the revised Code of Washington. Under the new state law, employers are required to provide basically to most employees. Beginning January 1st, 2018, the required changes relating to sick leave accrual and sick leave usage are described on page 230 of your packet.'",
        "'speaker_1': 'There are four new sick sick leave accrual laws that employer employers must adhere to. First, most employees, including part time and seasonal workers, must accrue paid sick leave at a minimum rate of one hour for every 40 hours.'",
        "'speaker_1': 'Worked to pay sick leave must be paid to employees at their normal hourly rate. Three employees are entitled to use accrual accrued pay sick leave beginning on the ninth calendar, day after the start of their employment and for unused paid sick leave of 40 hours or less must be carried over the following year.'",
        "'speaker_1': 'The new state law does allow employers to provide more generous accrual and carryover policies moving on to sick leave usage under the new state law. Employees are authorized to use sick leave for the following reasons to care for themselves or their family members, including for medical diagnosis and preventative care.'",
        "'speaker_1': 'When the employees place the business has been closed by order of a public official for any health related reason, or when an employee's child's school or place or care, a place of care has been closed for such a reason, and also for absences that qualify under four leave under the Washington State Domestic Violence Leave Act.'",
        "'speaker_1': 'The new state law does allow employers to provide more generous paid sick leave policies or authorizing paid sick leave usage for additional purposes. If there are no questions regarding the four primary changes for I 1433, I will go ahead and proceed to the executive's proposed changes.'",
        "'speaker_0': 'Any questions, Councilmember Garcia.'",
        "'speaker_5': 'Thank you, Madam Chair. Heidi, how are you doing this morning?'",
        "'speaker_1': 'I am doing well, thank you. All right.'",
        "'speaker_5': 'Who is it that would make the decision as to whether or not given these new areas where employers and paid sick leave, who would make the decision that Susie says her child's school are closed on Tuesdays she needs Wednesday Thursday and Friday are to find a new.'",
        "'speaker_5': 'And that what if our employers said no because we need you right now is that those kind of authority they are there or do you automatically have to give people sick leave in these new four categories.'",
        "'speaker_1': 'According to state law? Yes, the two have based on those requirements for the use of sick leave. Those are authorized uses when eight. And this is how it has to be by order of a public health official. So if that place of business is closed so.'",
        "'speaker_5': 'That public health would have to say you couldn't offer it. And has public health said that that business closed for poor health conditions or something like that?'",
        "'speaker_1': 'You know, I will defer to the Human Resources Division representative to interpret that.'",
        "'speaker_5': 'Okay. All I'm saying, Madam Chair, is that I just want to get clear that the same flexibility that employers have now continues, despite the fact that we're adding these four new categories that they can use and legitimate, legitimate, they give paid sick leave.'",
        "'speaker_0': 'It seems like our executive staff who is here may have a comment on this topic. And why don't we invite you up and please welcome. Thank you for being here. Please introduce yourself for the record and thanks for answering the question.'",
        "'speaker_1': 'Thank you. Denise Pruitt, in your opinion, you're.'",
        "'speaker_5': 'Closer to you.'",
        "'speaker_1': 'Sorry. Denise Pruitt, senior policy adviser from the Human Resources Division. So in that in the specific instances that are laid out in the new minimum wage act, yes, there isn't discretion for the employer. So but but that instance that you're speaking of is very specific.'",
        "'speaker_1': 'So it's, you know, in an instance where so this actually happened at my son's high school once where during the bird flu, the CDC, there was an outbreak in his school and they closed the school down to clean the school and make sure it didn't spread.'",
        "'speaker_1': 'Yeah. And so it's it's a pretty specific instance. It won't be for things like snow days or, you know. Like an earthquake or anything like that. It's really specific to health related reasons, and it's has to be closed by a public official.'",
        "'speaker_1': 'So it can't just be my kids schools closed today, so I'm taking a sick day. Is that.'",
        "'speaker_5': 'Okay?'",
        "'speaker_1': 'Answer your question. Yeah.'",
        "'speaker_5': 'And employers would know this. How at the public health department.'",
        "'speaker_1': 'I, I don't know that for certain, but I would think that we would be able to confirm, to verify that, because it would be kind of a big deal, I would think, of a if a whole school or, you know, things were closed like that that would be to verify.'",
        "'speaker_5': 'Thank you and thank you, Madam Chair.'",
        "'speaker_0': 'Thank you. I have one question, and I don't know if you're going to cover this. So if it is, we can just wait until the time comes. But does the new accrual rate change the accrual rate that we currently use for represented or non represented employees?'",
        "'speaker_1': 'So no, it does not change and we'll get to that. How the new state law applies to King County and what King County currently provides. And so we'll get to that very well.'",
        "'speaker_0': 'Why don't I let you continue with your presentation then?'",
        "'speaker_1': 'Okay. Oh, no problem. So if I may draw your attention to page 232, and that's to table two. And that shows essentially as a crosswalk of the proposed changes. It shows that what the county currently provides and the proposed change in the executive's rationale.'",
        "'speaker_1': 'And so the first one discusses currently that short term temporary employees and administrative interns do not qualify for any leave benefits. And under the proposed ordinance, it would add language that states that short term and temporary employees would an administrator in terms would not receive comprehensive benefits.'",
        "'speaker_1': 'This new state law allows short term temporary employees interns to recruit sick leave benefits only. However, they're not eligible for comprehensive leave benefits, which would include like vacation leave and paid parental leave, those types of leaves. The second one, currently the count.'",
        "'speaker_1': 'The county does not reduce its part time or temporary employees compensation in lieu of benefits by the value of sick leave. The proposed ordinance would require temporary employees and part time employees to receive compensation in lieu of benefits.'",
        "'speaker_1': 'But their compensation would be reduced by the value of their sick leave benefits. And so and this is just according to the executive to offset the sick leave benefits, that short term, temporary, poised and administrative interns will receive.'",
        "'speaker_1': 'Number three.'",
        "'speaker_0': 'Different kind of stop. You actually understand that. One, what would what does it mean to reduce compensation in lieu of leave benefits? What does it mean to do that? What would that look like if we did it?'",
        "'speaker_1': 'Hello. Thank you. So right now in the code, we have a provision that if our temporary employees exceed a certain number of hours, so essentially they exceed half time. You may recall this that we got we do what we call referred to as back benefit pay and they get a payout of compensation in lieu of the benefits'",
        "'speaker_1': 'that they didn't receive. And as it stands, now, that they don't get any benefits. So we're just adjusting that benefit calculation to offset for the fact that they will now be receiving sick leave.'",
        "'speaker_0': 'Understood. I, I don't recall that because we used to just not use part time employees or temporary employees over the maximum amount.'",
        "'speaker_1': 'Because this happened.'",
        "'speaker_0': 'It was such a hassle if you went over the maximum amount. So we just managed so that we didn't do that. Okay. Thank you for the explanation. Please go ahead.'",
        "'speaker_1': 'Okay. So on number three, so currently the short term temporary employees and administrative interest are not accrued sick leave. And under the proposed ordinance and based on the new state law, short term temporary employees, administrative interns would receive accrued would accrue sick leave at a rate of 0.0 to 5 for each hour and pay status.'",
        "'speaker_1': 'And that's based on the new state law for number four. King County currently provides 1.8 4 hours of sick leave for every 40 hours worked. And currently the county does not allow sick leave accrual for overtime hours. The proposed ordinance would add language stating that if an hourly employee works over 74 hours in one week, the employee'",
        "'speaker_1': 'would accrue a sick leave rate of 0.02 5 hours for each hour over the 74 hours and the. The logic behind that is with the minimum state are with the state new state law, one hour of sick leave earned for every 40 hours.'",
        "'speaker_1': 'The county offers 1.8 4 hours per every for every 40 hours. Worked or not for every for an hour, for 40 hours worked. So that is more generous than what the state is offering. And so if an employee works in a rare occurrence, 80 hours in one week, the county would provide 2 hours of sick leave for'",
        "'speaker_1': 'those 80 hours. And so currently with the county county already providing 1.8 4 hours, the can, we just have to make up that difference to get to the 2 hours. Okay. Okay. And so moving on to number five, currently short term temporary employees and initially interns did not accrue sick leave.'",
        "'speaker_1': 'The proposed ordinance was language that excludes employees from a critically. If you are short term temporary employees employed in social service programs designed to help youth gain basic work skills. And according to the executive, these employees are exempt from the new state law.'",
        "'speaker_1': 'Number six Currently short term temporary employees and administrative interns do not accrue sick leave for employees who are eligible for comprehensive leave benefits accrued sick leave is canceled upon separation or termination except by reason of retirement or layoff or separation for medical reasons.'",
        "'speaker_1': 'The proposed ordinance would allow sick leave accrued by short term temporary employees and administrative interns, and that will be canceled by separation, retirement or termination of county employment. And the rationale for that is that the county is not required to cash out unused basically to in to an employee.'",
        "'speaker_1': 'Number seven, currently, if an employee resigns in good standing or is separated for medical reasons or is laid off and returns within two years, the employee sick leave would be restored except for former employment in a term limited position.'",
        "'speaker_1': 'The proposed ordinance would remove this language, and the rationale for that is that if an employee returns to county employment within two years, accrued sick leave would be restored. That's the county's policy and also the new state law allow sick leave restored within 12 months of any employee.'",
        "'speaker_1': 'So the county is more generous than that. Number eight. Currently, the code describes two specific scenarios that are eligible for sick leave use. For example, sick leave may be used for employee exposure to contagious diseases and resulting in quarantine.'",
        "'speaker_1': 'Then the proposed ordinance would add language that authorizes sick, sick leave that mirrors the new state law. So an employee's family member, mental or physical illness, injury or health condition. And so you can see in the proposed changes column those different reasons that will be allowed for sick leave.'",
        "'speaker_1': 'Number nine, the current that the code states that verification from a health health care provider may be required to substantiate the health condition of the employee or family member or leave request. The proposed ordinance would remove this current language and and language that states that the county may require the employer to provide reasonable notice of an absence'",
        "'speaker_1': 'from work as long as the notice does not interfere with the employee's lawful use of sick leave. This essentially mirrors the state law.'",
        "'speaker_0': 'Passed request from Councilmember Lambert.'",
        "'speaker_1': 'So as to how an employee employer would do. If you have an employee that's decided they're sick and they're taking all this leave and you don't really think they are sick. What is your ability as an employer to deal with that?'",
        "'speaker_1': 'Unfortunately, the way the new law is written, it's going to hamstring us a little bit in terms of its impact. So we're working right now to review all the departmental policies and practices. We're no longer permitted under the new law to discipline employees for their use of sick leave, and that includes like patterned behavior.'",
        "'speaker_1': 'And you also can't factored in to things like performance evaluations and merit increases. So we're the rules. The regs just came out a couple of weeks ago. So we're still trying to wrap our head around the ins and outs of what we will be permitted to do and won't be permitted to do, but it will actually be'",
        "'speaker_1': 'able to do less than what we've been doing. So having had some past experience in dealing with this issue that is disruptive to the work of the government or the work of any business. So you said the regs I see here that you have an RTW is is what you just said.'",
        "'speaker_1': 'Is it in the RTW itself or in the regs referring to the RTW? It's in there. It's vaguely in the RTW, in the Minimum Wage Act. It's more specifically in the wax. Okay. So I think we need to petition that the WACC be reviewed and to make that clear, because that is not good government policy or business'",
        "'speaker_1': 'policy. So I know that there is a lot of the whole because this applies to every employer in the state. So as you can imagine, there's a lot of and and the fact that, you know, they they pushed the rules out so late in the year and it takes effect January 1st.'",
        "'speaker_1': 'You know, everybody's scrambling to try to figure. Out one, how to implement the changes and then to how to how to deal with the new regulations. So I think that there will be a lot of employers making those comments.'",
        "'speaker_1': 'So I was once on day work, you know, if you, A.J., like it. But it's the group that oversees how the work it's interpreted to the CW. And let's just say there's a lot of creativeness in how that happens sometimes.'",
        "'speaker_1': 'So I think if we could go back and look at that, but I think we need to really press on this. This is not an acceptable change and can be very disruptive to businesses and government and say, okay.'",
        "'speaker_0': 'Thank you. Please go ahead. Okay.'",
        "'speaker_1': 'So moving on on to number ten on page 235 of your packet. Currently, if a county employee fails to return to work by the expiration date of the leave of absence, it may cause for removal or termination. And under the proposed ordinance, it would remove this language.'",
        "'speaker_1': 'And the rationale for that is that this is no longer permissible under the new state law. Number 11 currently the code states that verification from a health care provider may be required to serve substantially of health condition or of the employee or family member for leave requests.'",
        "'speaker_1': 'The proposed ordinance remove this language as we just discussed, and would add language that states that verification of an employee's sick leave is for an authorized purpose, may be required for absences in excess of three days. Also, verification may not result in an unreasonable burden or expense on the employee and may not exceed privacy or verification requirements'",
        "'speaker_1': 'otherwise established by law. And this new language mirrors the new state law. Moving on to number 12 on page 236 of the packet. Currently, county employees accrued sick leave on the first day of employment. The proposed ordinance would remove this language and this is the rationale for this is that is not current, not the current practice at'",
        "'speaker_1': 'the county and it's not permissible under the new state law. Number 13 Currently the county employees are not allowed to use vacation leave during the first six months of employment. The proposed ordinance would remove this language and allow an employee to utilize vacation leave during the first six months.'",
        "'speaker_1': 'This will be reflected in the master labor agreement for representative employees that will be forthcoming to the Council and the Executive will recommend the same policy for non reporter for not represented employees. The remaining changes are technical, so I won't get into those.'",
        "'speaker_1': 'The 2018 costs for implementing I 1433 is approximately 607,000, which of which 221,000 will be charged to the general fund? That concludes my staff report. And Madam Chair, there is a striking amendment to the proposed ordinance that would define two terms and make technical changes.'",
        "'speaker_0': 'Okay. Thank you both very much for walking us through. This is a technical exercise. This is a pretty major change for us. I guess I want to preface this by saying that the the concept is, of course, something that this county strongly supports and endorses the idea that people should be able to take time off when they're'",
        "'speaker_0': 'sick. You may hear a little bit of raspy ness in my voice today. I blame one of my colleagues who didn't stay home when he was sick. Sorry, it's not fair, but I do. I blame him. And so I want people to stay home when they're sick for selfish reasons, but also because we owe it to our'",
        "'speaker_0': 'employees and the people who work here to be able to get well to be with their family members when they need sick time. This statute, in my view, is addressing employers that have long not valued that sick leave benefit the way this employer has.'",
        "'speaker_0': 'And so I support the concept behind it completely that that should be the standard that people should be able to take sick leave when they need it. The challenge is that when you run a especially a large, complicated operation with a lot of different employees, with a lot of moving parts, with operations that are required to go'",
        "'speaker_0': '24, seven hour wastewater treatment plan has to run 24, seven. Our jails have to run 24, seven hour police have to be out 24, seven. It does become more and more difficult to staff those functions, not at a reasonable cost at all, to have people in place to do the things we need them to do.'",
        "'speaker_0': 'If we don't have the ability to manage attendance in some way at the same time that we are balancing the employees need. And so I share the concerns that were articulated by Councilmember Lambert. And I look to item 11 about employment verification.'",
        "'speaker_0': 'And I'll just say there is a practical reality here. There are not too many doctors that won't sign a note for their patients for whatever reason, whenever. And I just don't know that we're going to be able to practically manage attendance with these kind of rules.'",
        "'speaker_0': 'So I, I share the concern that in trying to do the right thing, we not kind of overcorrect to the point where we actually can't run our. Operations for the benefit of the observer taxpaying and the public we represent.'",
        "'speaker_0': 'That said, it is a law and we have to follow it. And so I don't see much option other than to pass this ordinance and continue to work through our legislative advocacy to make sure that in doing the right thing, we're not unduly hampering and hampering hamper rating.'",
        "'speaker_0': 'I mean, in a word, hampering employers who who need to provide services. So with that, I would ask Council Member McDermott to put this item in front of us. And as a reminder, it is proposed ordinance number 2017 0490.'",
        "'speaker_4': 'Madam Chair, I would move the committee the whole of the to pass recommendation to ordinance 2017 490.'",
        "'speaker_0': 'Thank you, Mr. McDermott. And would you also move striker s.'",
        "'speaker_4': 'William Sherry move adoption of Striking Amendment One.'",
        "'speaker_0': 'Thank you. Would you care to speak to it?'",
        "'speaker_4': 'I think it's an excellent, striking amendment.'",
        "'speaker_0': 'Thank you, sir. Very good. Any further comments from this council member? Kolawole. Sorry. Yes.'",
        "'speaker_1': 'If I may. Yeah. Madam Chair, there is also an amendment to the striking amendment sponsored by Council Member Cole Wells. And if the Council member wishes, the amendment will be distributed. And I can say.'",
        "'speaker_3': 'Thank you very much. I was looking for it. Thanks.'",
        "'speaker_0': 'Please. Councilmember Wells, that's being passed out. Would you like to speak to it?'",
        "'speaker_3': 'I'm speaking without saying it. It's right here. However, thank you. So this amendment, it's it's mentioned in the effect statement would allow county employees to utilize sick leave to increase their safety if they or family member have been a victim of trafficking.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'And if I may speak on that, I'm sort.'",
        "'speaker_0': 'Of considering I consider it. Have you moved it? Put it before us. Please speak to it. Yes.'",
        "'speaker_3': 'This is similar to a law that just passed in New York City. And we know that there are issues relating to human trafficking here in King County. We recently had a report that was accepted by the full council that came from a consultant that deals with labor trafficking in King County.'",
        "'speaker_3': 'We've already done quite a work on sex trafficking. So victims of trafficking, domestic violence and sexual abuse, as well as their family members will, if this amendment is adopted, would all be able to have time off from work to plan their next steps, especially being able to focus on safety without fear of loss of income.'",
        "'speaker_3': 'We know that individuals at times have to go to court because of having been victimized by these terrible scourges, and many are fearful of their safety, especially if they've been brought into the country for purposes, for illicit purposes.'",
        "'speaker_3': 'And I think we should follow the example of New York and adopt this amendment. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Gossett.'",
        "'speaker_5': 'Thank you, Madam Chair. How many additional days can a person take off from work if they indicate the hours that they think their daughter is, you know, being turned down on the block or something like that? Traffic.'",
        "'speaker_3': 'Well, I'm assuming that this does not give any additional time off from work. It just would allow these individuals to be able to, you know, to utilize what's available for all other to.'",
        "'speaker_1': 'Utilize sick leave for that.'",
        "'speaker_5': 'Purpose. But they wouldn't get extra simply.'",
        "'speaker_1': 'Correct? Correct. Or not in addition to it's whatever the sick leave accrued by the employee.'",
        "'speaker_5': 'I'm going. What is the definition of traffic like? Like like for example, I is like getting a young lady that's in your household to work for them or or.'",
        "'speaker_0': 'Not answering her calls because.'",
        "'speaker_3': 'You're under a state law as well as federal law. And I'm just remembering this and I'm not looking at the definition that trafficking involves force, fraud or coercion. And as such, it's very difficult for people to get out of that and actually be able to come forward.'",
        "'speaker_3': 'I don't think this would be utilized by many people, but it does exist. We know it exists. And so I'm expanding the availability of sick leave for those individuals for purposes of safety and security.'",
        "'speaker_0': 'Can one of you remind me what our current practice is and policy about sort of safe leave if people are going to court or fleeing domestic violence or I believe we have a policy that says you can use sick leave for those kinds of purposes.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_1': 'State allows it.'",
        "'speaker_0': 'So this would kind of expand that concept just to include people who are fleeing or exiting trafficking and or have been trafficked for their safety. It's really consistent in my mind with the whole idea of the sick leave expansion that's happened some time ago now for for domestic violence victims.'",
        "'speaker_0': 'And I think it makes good sense. I'm happy to support this amendment. Council Member.'",
        "'speaker_3': 'Thank you, Madam Chair. I just would like to clarify here we are talking about providing options to individuals or because of their family member has been.'",
        "'speaker_0': 'Understood.'",
        "'speaker_3': 'Without fear of repercussion at their job. Yeah.'",
        "'speaker_4': 'Councilmember Dombroski about chair great amendment. Thank you. Councilman Caldwell's for bring it forward and it looks great. I think in concept I have a technical question and it applies to this, but all of this and that is do these changes have to be negotiated with our labor partners?'",
        "'speaker_4': 'And if they do, have they and if they all have to be negotiated, have we consulted with them for feedback?'",
        "'speaker_1': 'Yes, to all of the above. So we are so they can't waive it. So the so we have to bargain the effects, right. So the the unions will still have to comply with the laws. So we will have to make some changes to some of our CBAs and Office of Labor Relations is currently going through the contracts'",
        "'speaker_1': 'to determine which contracts will need to be changed. For the most part, I think the the labor unions will be fine with most of the changes because most of the changes are actually beneficial to two employees. There is a weird thing about what's the word I want to use incentive programs that we'll have to eliminate.'",
        "'speaker_1': 'Like some of our contracts have incentive programs, and you may be aware of a council member from DHS that encourages employees not to use their sick leave, that they're then if they don't use sick leave for the year, they're able to convert a certain number of days to vacation leave.'",
        "'speaker_1': 'We will no longer be allowed to do that under the new law because there it's discouraging people from using sick leave. So we're working on those things right now. And like I said, labor relations hasn't is I know there is a meeting on Monday, I believe, to talk with the labor unions to notify them that we will'",
        "'speaker_1': 'be working on that with them.'",
        "'speaker_4': 'So on Councilmember Caldwell's amendment to allow the use of sick time to increase the safety of the employee or family member when the employer founder has been a victim of trafficking inspired state law, would that have to be negotiated?'",
        "'speaker_4': 'I mean, there's some terms in there. You know, you could see questions with a family member. Maybe that's the fine. I don't know. But is that something that would have to be negotiated? Can we and I really like the idea.'",
        "'speaker_4': 'Can we just add it on here and or how does that work?'",
        "'speaker_1': 'I don't think so.'",
        "'speaker_4': 'I'm going back to my paid leave.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_4': 'Yeah. You know you will because it was a we were adding on a benefit, but. Right. You had to negotiate it.'",
        "'speaker_1': 'And some of the other ones, like the domestic violence, one is is in the law. So there has to be compliance with that. In theory, yes, they could push back on this, I think, and I can see from a practice I also agree with this amendment.'",
        "'speaker_1': 'But from a practitioner standpoint, I can already hear some of the departments saying, how do we confirm that that's that's what it's being used for.'",
        "'speaker_4': 'Was there as their language in the underlying ordinance that calls for negotiation. Of these terms. I mean, all of them.'",
        "'speaker_1': 'No, it doesn't need to be in the order. I mean, we have to do it regardless. So. Yeah.'",
        "'speaker_4': 'So I it seems to me we should adopt this and move it forward in that there are technical, legal or labor issues between now counsel will figure out how to address.'",
        "'speaker_1': 'Well, as you know, the ordinance, I mean, applies to our non-representative employees regardless. And then yeah. So that if it'll apply to anybody that doesn't have something different in their contract.'",
        "'speaker_3': 'Madam Chair. Yes. Member. Yeah, I appreciate the support that I'm hearing. I think it would be helpful. Before we go to the full council with a vote there is that we got a copy of the state law that I think W is applicable here.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'All right. I think we're prepared now to vote on Amendment One to s one. All those in favor please signify by saying i, i any.'",
        "'speaker_1': 'Opposed.'",
        "'speaker_0': 'Amendment one is adopted. That brings us to Amendment S1. Any further comments or questions on the striking amendment? Seeing none. All those in favor of S1 please signify by saying i. I any opposed S1 carries. And now we are back to.'",
        "'speaker_1': 'The.'",
        "'speaker_0': 'Proposed ordinance itself. 2017 0490. The only thing I would say before final passage here is this cost of $600,000 is for one year. It's in the 20 1718 biennium, but it's being implemented on January one. So this means this implementation of this new law is going to cost us a King County $1.2 million every biennium.'",
        "'speaker_0': 'Just it's understanding it's the right thing to do to have robust sick and sick leave programs. But we we just need to remember that there's a balance. We also have to provide services effectively and efficiently to the public.'",
        "'speaker_0': 'But this is being driven by a state law change that I believe we have no no ability but to implement. And it's got some really good things in it, along with some things that seem challenging. So I will support it, but look forward to working to perfect the whole concept of attendance management as we go forward.'",
        "'speaker_0': 'All right. Any other comments? Well, the court, please call the roll.'",
        "'speaker_1': 'Thank you, Madam Chair. Councilmember Dombrowski, Councilmember Dunn, Councilmember Garcia.'",
        "'speaker_5': 'Hi.'",
        "'speaker_1': 'Councilmember Cornwall I Councilmember Lambert. Councilmember McDermott. Hi, Councilmember of the Grove. Councilmember Yvonne right there. Madam Chair. Hi, Madam Chair. The vote is six eyes no nos. Council members Dunn, Lambert and Van Dyck. They were excused.'",
        "'speaker_0': 'Okay. By your vote, will you have approved proposed ordinance number 2017 0490 be advanced to the full council with a do pass recommendation? Is there any need to expedite this? It doesn't seem like it.'",
        "'speaker_1': 'If you would like to get there on December 4th and not have, you know, full council packed on December 11, though, that will be just.'",
        "'speaker_0': 'It can seem like there's any objection. And without objection, I'll also ask for it to be on the consent agenda so we don't have to go through this again. Oh, amendments.'",
        "'speaker_1': 'Yes. Just one potential technical amendment.'",
        "'speaker_0': 'Well, then we'll put it on the consent end. So sorry. All right. This brings us to the end of our agenda today. Our next and final meeting of 2017 will be next Wednesday, December 6th, when we will anticipate discussing the elimination of unnecessary reports.'",
        "'speaker_0': 'I'm super excited about getting an update on the East Side rail corridor, reviewing a report on the county's plans for addressing technology related emergencies and receiving the last briefing of the year on the county's human resources programs, including diversity and hiring.'",
        "'speaker_0': 'And I look forward to seeing you all. Then we are adjourned.'"
    ]
}