{
    "A MOTION confirming the King County department of transportation director's appointment of Robert Gannon as the general manager of the transit division of the King County department of transportation.": [
        "'speaker_0': 'Please say I, I, those opposed. Nay, the minutes are approved as written. All right, that's great. So we finish in strange order, but. No, no, no problem. Thank you. So now let's go on to number seven. And this is proposed motion 2016 0530.'",
        "'speaker_0': 'And this is the appointment of our Department of Transportation director Rob Gannon as general manager. Rob is no stranger to us and we are so pleased to have you here. And Mr. Wagner, do you want to begin?'",
        "'speaker_2': 'Thank you, Madam Chair. Nick Wagner, council staff. And as you well know, to my immediate right is Rob Gannon, the general manager, designee of Metro Transit, and to his right is Rhonda Berry, who is deputy executive for operations.'",
        "'speaker_2': 'The staff report on this motion begins on page 101 of your materials. Last year, Metro delivered 121.8 million passenger trips, which constituted more than 75% of all transit boardings in King County. Metro's operating budget for the 2017 2018 biennium is $1.58 billion, with almost 4600 FTE.'",
        "'speaker_2': 'Additional information about Metro services are provided on the first page of the staff report and in Attachment five, which is it? Pages 117 to 123. As Metro General Manager, Mr. Gannon will be responsible for Metro's operations, planning and budgeting.'",
        "'speaker_2': 'He's been serving as interim general manager since March 19th of this year. During that time, according to the executive's transmittal letter, quote, Mr. Gannon ably demonstrated that he will be a leader in reaching our shared goals of increasing mobility in the region, improving outcomes for residents and employees by increasing opportunity and equity, addressing climate change and instituting'",
        "'speaker_2': 'meaningful reforms that improve the effectiveness and efficiency of King County governance. Before becoming interim general manager. Mr. Gannon served for about three years as Metro Deputy General Manager and for about two years as human resources director for the entire Department of Transportation.'",
        "'speaker_2': 'His other work experience is listed on page one or two of your materials. Mr. Gannon's appointment is supported by letters of recommendation from the director of the city of Bellevue Transportation Department, the executive director of the Puget Sound Regional Council.'",
        "'speaker_2': 'The Director of the Seattle Department of Transportation.'",
        "'speaker_1': 'The executive director.'",
        "'speaker_2': 'Of the Transportation Choices Coalition and the Chief Executive Officer of Sound Transit. Copies of those letters are in your materials at pages 125 to 129. Mr. Gannon has a Bachelor of Arts degree and a master of public administration degree from the University of Montana.'",
        "'speaker_2': 'That concludes my staff report on was there any questions?'",
        "'speaker_0': 'He went to another little, little school besides the University of Montana.'",
        "'speaker_2': 'He did attend a program at the Harvard Executive Education Program.'",
        "'speaker_0': 'Yes. And the Naval Academy in Annapolis. So that's pretty impressive, too. Thank you. Great. That's a great recommendation. And, you know, it's exciting to me when employees come in to briefing on various subjects and they say things like, we love our new manager.'",
        "'speaker_0': 'He is wonderful. He comes around and talks to all of us. He cares about what the employees are thinking. He listens to us. And it's really exciting to hear employees talking about their manager and that way. So I want you to know that the people who work for you are just saying wonderful things and that's really, really'",
        "'speaker_0': 'exciting. So thank you. You're welcome. That's very welcome. It's nice to have you with us. And would you like to comment?'",
        "'speaker_5': 'Thank you. Thank you, Madam Chair. Council members. I appreciate the opportunity this morning to offer a few comments on behalf of Executive Constantine as you consider the confirmation of the appointment of Rob Gannon as the next general manager of Metro Transit.'",
        "'speaker_5': 'Every day, Metro carries about 400,000 riders to destinations throughout the region. That number includes about two thirds of all commuters to downtown Seattle. Our region continues to grow, and as our region grows, so does the demand for transit.'",
        "'speaker_5': 'In order to meet these needs. Executive Constantine has stated that he wants to give riders more more service, more choices, more ways to make the writer experience even better. King County Metro's long range plan fulfills this vision by creating 26 rabbit ride lines around the region, by growing our network of express busses, running every 15 to 30'",
        "'speaker_5': 'minutes all day, and by creating more local service that meets community needs. We will also make investments such as bus only lanes that will create fast, efficient and reliable transit throughout the system. There's a lot of work to be done and to make all this happen.'",
        "'speaker_5': 'Metro needs strong leadership as the executive set out to find the next rental general manager. He used some pretty straightforward criteria. He wanted someone who knew transit and appreciated its vital role in building strong communities. He wanted someone who could listen and lead, someone who could forge partnerships and bring people along to fulfill common goals.'",
        "'speaker_5': 'Someone who respected our employees and whose wisdom and judgment would engender the respect of others. In short, he wanted someone who could take the best transit system in the nation and make it even better. Based on those criteria, executive Constantine selected Rob Gannon to serve as Metro General Manager.'",
        "'speaker_5': 'Rob has the experience and vision to ensure Metro meets our transit needs now and into the future. When the general manager position became vacant. Transportation Director Hill Taniguchi and Dao talked a lot about what should be included in the job description as they listened to stakeholders and began to pull together goals and requirements.'",
        "'speaker_5': 'It became increasingly clear that Rob was the leader we were looking for. His knowledge of Metro operations and the needs of the organization helped inform Metro's budget, including capital investments, service hours, technology projects and staff development. Rob's work with our nationally recognized partnership to achieve Comprehensive Equity or PACE sought to improve communications among employees and create a'",
        "'speaker_5': 'workplace that respects and embraces diversity. Rob helped bring together law enforcement, youth advocates and judicial leaders to address youth fare enforcement. He is committed to driver safety, as evidenced by his advocacy for video cameras to be installed on our busses.'",
        "'speaker_5': 'And he has visited neighborhoods to talk to customers about bus shelters and other metro issues. And I had the pleasure of being with Rob and Harold in my own neighborhood as they talked about those things that my neighbors still asked me about have every other day.'",
        "'speaker_5': 'Rob's past included experience at Amazon and dovetails with our focus on improving the customer experience by improving internal systems. So in closing, I'll just say that whether it's integrating Metro Transit Service with sound transit and other partners or making sure bus shelters are clean and welcoming, Rob will lead the effort to ensure Metro is known for customer'",
        "'speaker_5': 'service second to none. You have in your package letters of support for Mr. Gannon, and I look forward to council confirmation of his appointment. I also look forward to working with him to forge the future of Metro Transit.'",
        "'speaker_5': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you. That is a huge undertaking, but I think we have broad shoulders here to do it with about 4600 employees to help. And so, Mr. Gannon, would you like to share your vision for your priorities?'",
        "'speaker_1': 'I would. Thank you, Madam Chair. Members of the committee. Good morning. Thank you for inviting me here today and for considering me for this important position. I want to start my brief remarks by saying thank you to all of you for your support extended to me during my time as interim general manager.'",
        "'speaker_1': 'All of you were patient, but you were also made clear. You also made clear the demands our customers place on the agency. I look forward to working with the Council to ensure we always keep our customers needs at the forefront of our planning and our implementation.'",
        "'speaker_1': 'My thanks certainly go as well to executive constantly. It is a great honor to lead Metro Transit, but it is an equal honor to be part of the extended leadership team at King County. I'm committed to meeting the executive's high standards and expectations and reaching them as best possible to deputy executive Rhonda Berry into our department director'",
        "'speaker_1': ', Harold Taniguchi. Thank you both for your leadership. You've always been generous with your time. Your encouragement and your thoughtful counsel. I have successfully navigated many a narrow and potentially hazardous path by way of your timely advice. I will continue to rely on your mentoring, and I want to say a special thanks to my many friends and close'",
        "'speaker_1': 'colleagues who have run King County, especially within Metro. The people of the agency have helped me understand where our challenges lie and what it takes for us to overcome them and be successful. In all honesty, I'm not here today in front of the council without all of them and the tremendous work they do each and every day'",
        "'speaker_1': 'to make Metro a vibrant part of our community. So I want to say just a few words about what being the general manager means to me. As I stated earlier, it is truly a great honor to lead such a fine transit agency and I hope that hard work the patience to listen first before taking action, remembering always'",
        "'speaker_1': 'that we are a service organization made strong by more than 4600 people, and that relationships and partnerships do in fact matter, that those things will continue to guide my path as a leader. Our power to do more for our community lies in our commitment to service.'",
        "'speaker_1': 'And that, in just a few words, is my grand vision for Metro. We are fortunate to have many wayfinding points that guide our efforts and set our direction. Our business plan for the biennium helped shape the budget you recently passed and my deep gratitude for that and that business plan sets a course for our near term.'",
        "'speaker_1': 'Our six year capital plan provides the early milestones of our journey, and Metro connects the truly visionary document created by the contributions of many stakeholders, jurisdictions, dedicated staff, and all of you show us where we should be heading.'",
        "'speaker_1': 'And in addition to those core planning documents, we are flanked by the guidance of the Strategic Climate Action Plan and the Equity and Social Justice Plan that you just heard about. Altogether, this framework will position us to increase transit service by more than 70% over the long term, removing as many as 300,000 vehicles from the roadway, and'",
        "'speaker_1': 'ensuring that an even greater portion of our low income and minority populations have access to frequent service at Metro. We are an organization with a clear and compelling vision through the leadership of both the Executive and the Council.'",
        "'speaker_1': 'We know where we are headed and my task as the leader then our imperative as an agency in truth is pragmatic, effective, coordinated execution. So from day one. And each day thereafter, my charge as the leader is this to keep our system safe and make it even safer for our employees and our customers.'",
        "'speaker_1': 'Deliver great service today while also working relentlessly to improve reliability and extend our capacity for tomorrow and to make Metro a great place to work. During my five years with King County, I have interacted with many people at all levels operators and mechanics, service workers and shelter cleaners, electrician and linemen, supervisors, chiefs, planners and senior managers.'",
        "'speaker_1': 'I say in all candor and from my heart, they all share a devotion to making Metro a great transit agency. And I see my job as helping make that possible, which is to say my role as a leader in this organization of dedicated professionals is to work with them to provide the best service possible to the public'",
        "'speaker_1': '. Under my leadership, we will be dedicated to becoming an industry leading safety organization so that our customers can feel safe no matter the time or location they choose to engage the services Metro offers. We will work to improve our on time, performance and the overall reliability of our network, whether through corridor improvements, working with our partners at'",
        "'speaker_1': 'our start, expanding service to the new areas, working with surrounding jurisdictions, or even more effective integration with our colleagues at Sound Transit. We will optimize our current service while we build while we build the capacity to do even more for our region.'",
        "'speaker_1': 'I believe today Metro is a great place to work and I now want to ensure that all of my colleagues feel the same and that each and every one feels safe and respected. We need to devote more resources to training, more for our operators and mechanics, more for our up and coming managers and supervisors.'",
        "'speaker_1': 'We have outstanding talent that we can develop, and we need to continue to attract the region's best and brightest. More than any other concept, I believe that our path to service excellence lies in the trust that we build with our workforce.'",
        "'speaker_1': 'And that is the same trust that we must build with. Our customers are routinely challenged by colleagues to remember. Always, we serve our neighbors and our families. We transport our friends and we help them get to where they need to be.'",
        "'speaker_1': 'Yes, we provide mobility for the region, but Metro is an essential part of the community that connects people to opportunity and knits together our growing cities. In our expanding region, we help sustain the connections. People. A place and place to people that make us more than just roots and stops on a map.'",
        "'speaker_1': 'Metro transit must itself continue to be a community 4700 people strong serving the larger community that is King County. So again, my sincere my sincere thanks to all of you for inviting me here today and for considering me for this position.'",
        "'speaker_1': 'I am both overwhelmed and invigorated by the support I have received. I am confident that our agency, our community of people dedicated to providing outstanding service to customers is equal to the challenges that lie ahead. I look forward to working with you as a partner and a colleague and serving as your general manager.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Well, that was wonderful. And I just want to make a couple of comments. Your Metro Connect's report is fabulous and you're people are energized about it. And the idea that so many people have bought into that vision is really important so that we're all going in literally the same direction.'",
        "'speaker_0': 'So that's really wonderful and I really appreciate that. I appreciate how that report has diversity of modes, where they were going to be in a van or we're going to be in a bus or we're going to be in an alternative minivan, whatever.'",
        "'speaker_0': 'I think that it helps to have the entire county covered with different ways of getting around. I think it's very helpful for us that we've gotten to know you over the last couple of months better than even before.'",
        "'speaker_0': 'And your comment about leading by serving is truly been noted and appreciated by so many. So I really appreciate that. Most people don't realize that we are the 10th largest transit company and the nation, and that's a huge undertaking.'",
        "'speaker_0': 'And so we know that you'll be an excellent leader. The only thing I don't get on my bus in the morning is my latte, which I have to stop on the way to to get so that I will be fine for my rides.'",
        "'speaker_0': 'The one thing I want to say, and I don't know how to do this, but when I grew up in San Francisco, if there was a person in those days, I think anybody over 50 was old. I don't think that anymore.'",
        "'speaker_0': 'But in those days, if somebody was over 50 and I was like nine, I was taught that you get up and left, that let the older person have the seat. And I see, you know, especially on really crowded routes, that there are people in their 80 standing and there are teenagers sitting.'",
        "'speaker_0': 'And I'm wondering what happened that we don't see that same kind of thing of somebody knowing, you know, I'm 15 and that lady over there is 92. Maybe I should get up. And I'm wondering if we need to do a little campaign about the fact that it's a nice gesture to let people who are older have the'",
        "'speaker_0': 'seat, especially when it's a crowded. So anyway, that's just one thing that I was thinking about the other day as I gave up my seat to make sure somebody older than 50, way older than 50 had the seat.'",
        "'speaker_0': 'Anybody have any comments like to make Councilmember Balducci?'",
        "'speaker_5': 'Thank you, Madam Chair. I'm very, very pleased to support the appointment of Mr. Gannon to this position. I've known him for a number of years, first from the executive side. And I have to say, I feeling a little bit of sympathy for your position at this point as being a non jailor who got to run the jail'",
        "'speaker_5': 'system for a while. You were a non or a formerly non transit person, but not not a transit person by birth who is who is now going to bring. And I think that one of the benefits of that and I don't say this to pat myself on the back, is that you have to understand that in any'",
        "'speaker_5': 'activity, the substance of the activity kind of is what it is, right? Jailing people, you run the jail or running the transit system, you drive people around. But what makes it work is how well you serve people and how well you work with the people that you work with.'",
        "'speaker_5': 'It's all about the people. All of our jobs would be much, much easier if it wasn't for all the people. So we need. All right. And a bus system certainly would be a lot easier. Just be lines on a map and some busses to maintain and fill with gas or hook up to the electrical system.'",
        "'speaker_5': 'But and I think that the one of Rob's really outstanding characteristics that anybody who's met him for any amount of time knows is that he he is fundamentally respectful, humane leader, that he works with people. He truly values the people that he works with.'",
        "'speaker_5': 'He truly works hard to help those folks have have a work environment where they can do their best and that serves the public best. And so I think that that is going to really serve you well in this challenging position that you have somehow been talked into accepting the job.'",
        "'speaker_5': 'I do want to say that, you know, as as RTC Chair, we've already seen Rob at work at the Regional Transit Committee and how he is, you know, innovating in how the agency will work with. Communities to implement the long range plan to implement new bus service.'",
        "'speaker_5': 'We are in a fortunate period where we are adding bus service and that's a whole lot nicer than removing bus service, but it's a similar challenge. How do you do it? Well, especially the things that people rely on every single day when they walk out the door, like those of us who ride the bus rely on the'",
        "'speaker_5': 'busses. Any change is is challenging. And so being able to walk people through the emotional reactions to change, even if you're adding more service, if things move around, it's hard for folks which we saw with the adjustment to the new light rail lines, which are a wonderful thing but require people to change how they interacted with the'",
        "'speaker_5': 'transit system. Communications will be critical, absolutely critical. How we explain what we're doing, how we involve the community, how we here, as you said, listen and lead, not just lead and how we speak and explain what it is that we're doing as experts in the field who need to explain it to the people that we serve who'",
        "'speaker_5': 'are not experts in the field. I know that you will do a wonderful job at all of those critical tasks, and I'm very, very excited that you're willing to be here. All joking aside, you are going to be a wonderful addition in this role.'",
        "'speaker_5': 'And I am I'm happy to work with you.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_4': 'Council Member Thank you, Madam Chair. And thank you, Mr. Gannon, for being willing to take on this job. I am pleased to co-sponsor the motion for your confirmation here today, and I want to note that this is an historic piece of legislation.'",
        "'speaker_4': 'It's the first time that the County Council has confirmed a director of the Metro Transit Division since Metro Transit was merged into the county in 1994. And that's because of work this council did to require confirmation. I think we're seeing the benefit of that now to get to have some dialog with Mr. Gannon, who is a tremendous'",
        "'speaker_4': 'candidate for the position. I wanted to echo Councilmember Belushi's remarks as they centered around two things. First, your demonstrated, humane and compassionate leadership style, which I saw firsthand when attended the press conference over at the South Base here on Rob Rome.'",
        "'speaker_4': 'Our many, many dozens and dozens, if not hundreds of your employees turned out from the folks who I think are mechanics to drivers to just clean up the base. It was still your top leadership. It was really you could feel the warmth and affection for you that you've garnered.'",
        "'speaker_4': 'And that doesn't come without investing the time and work and having the right approach. So I think customer, although she was right on the second angle with respect to people, I think it is important to remember the history of Metro.'",
        "'speaker_4': 'The voters created Metro in 1972 and approved its funding with a 3/10 of a penny sales tax. And the voters again approved its merger in the King County government in 1992. And I think that we owe the voters of the region and our riders kind of the utmost deference and respect.'",
        "'speaker_4': 'And I think your reputation as a listening leader will play very well and serve this community very well, who has a 40 plus year connection to this transit agency and without whose continued support, we wouldn't be able to deliver 125 million boardings a year and continue to grow and expand it.'",
        "'speaker_4': 'And I have confidence that you will have, as a guide star, the voters and the taxpayers of the region as you manage this very complex system. I could say more, but I want to just give you a little positive feedback.'",
        "'speaker_4': 'A couple of weeks ago, my older son was goes to Roosevelt decided he wanted well he has a temporary worker card has a regular income we won his youth worker card and I thought, well, what does that take?'",
        "'speaker_4': 'So I called up here, line off the website. So now I get it. Youth worker card and very helpful customer service rep said, just bring down his student I.D. or birth certificate, come down to King Street and they just set up instant answer.'",
        "'speaker_4': 'No way, it was great. Went down to King Street, was ready for a long line, was ready for a lot of dialog, literally within 3 minutes. Terrific. A front desk person there behind the window, got the card, answered all questions.'",
        "'speaker_4': 'And I just thought it was a very good experience from a kind of other users perspective with respect to, again, people. And I thought those were great examples of people. I hope as we continue to go forward and restructure this system as light rail expands throughout the region, that we will pay particular attention to the riders input'",
        "'speaker_4': '. And I'm as you know, I've got a piece of legislation that we've been working on here about public process, which is important to me. Governor Baldacci described the restructures as wonderful, and I think probably from a strategic systems perspective.'",
        "'speaker_5': 'To be fair, I described the light rail as wonderful.'",
        "'speaker_4': 'Rail. I thought you were saying the restructuring. Are some of my constituents who've gone through those big restructuring are these might not agree with wonderful but I, I think event because it's very it's painful it's disruptive to people, as you know who get accustomed to terrific bus service kind of.'",
        "'speaker_4': 'But it is the future. And I. Hope that we can build on Metro's strong public outreach process and input process to see if we can strengthen that further and make sure that folks, as we continue to implement Metro connects or when we when we start to implement Metro connects, that folks feel that they've had an opportunity to'",
        "'speaker_4': 'participate in that process because it's so personal to them. Transit for many people, it's their everyday experience. And then and I think that cements and build support for our system when we do that. I just have confidence that you'll do that based on your reputation as a leader.'",
        "'speaker_4': 'And I want to thank you for serving.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'So I. I hope that this hasn't been painful. When we had the process and we changed the rule. Many people said it was going to be a painful process to directors. So I hope it wasn't painful and that I used to have a draw of all the nice things my students said about me and the days when'",
        "'speaker_0': 'they didn't have their homework done and they weren't being nice. I pull that draw out and read my nice notes to remember, so I hope you never have to look at your nice notes that every day will be a pleasure and that you know that we appreciate the good work your being you're doing.'",
        "'speaker_0': 'Councilmember. Councilman, did you want to make a comment? Okay. Councilmember Gossett And then. Q Oh, okay. Councilmember Gossett Followed by Dan, and then I'm going to ask Katie about if she'd like to put this before us since she's a transportation.'",
        "'speaker_0': 'Are your transportation okay? Would you put this before us then? And you're also the co-sponsor. Great. Okay. Councilmember it.'",
        "'speaker_3': 'Thank you, Madam Chair. Yeah. The question I get asked frequently about Metro is about rising cost and working lives. And if we can afford we reimburse, I mean, not putting a no amount of money and for their arca less car each month, it's easier for them just to pay the dollar quarter and hope they have the money'",
        "'speaker_3': 'that Amy. Is there anything they were going to do in the future to be able to drive down the cars for very low income riders? Last week for the transit union, we were able to lower the bus ticket cost to agencies that helped them by cutting the cost and how.'",
        "'speaker_3': 'But we were not able to increase the number of bus tickets available to those agencies. What's your thought on this issue?'",
        "'speaker_1': 'Councilmember Garcia, thank you for that question. I think in broad terms, any agent of the government, especially perhaps a leader of a transit agency, has to keep an eye on costs. We have to be efficient with the way we deploy our dollars, our service and our resources.'",
        "'speaker_1': 'But we also have to be mindful that our transit dependent population cares less about agency cost and much more about their personal costs. I think that the forklift was an important step in a very good direction to improve access to transit, especially for those in the low income category.'",
        "'speaker_1': 'I think there is more that we can do and can continue to explore how to extend that resource, whether it is looking to see what is the right level for our Human Services ticketing program or exploring another version of a low income fare.'",
        "'speaker_1': 'It's also making access to those fair media even more accessible, if that makes sense. So I think in the coming weeks we are going to launch a mobile ticketing pilot, which will make it easier to travel without an orca card.'",
        "'speaker_1': 'And I think that's another important step that we will able to be we will be able to engage. I think in the end, what it takes, however, is a wide range of choices for our customers so that they can figure out what works best for them.'",
        "'speaker_1': 'And that as a government, as an agency, as a transit leader, we're always mindful of what is the impact of our fare structure on some of our most vulnerable users. So I'm committed to continuing to keep that front of mind as we look at how our revenues are being deployed, how our service structure is extending to the'",
        "'speaker_1': 'various areas of the region and really to some of the earlier comments from council members do always keep in mind what an individual rider faces when he or she boards our transit system. Thank you.'",
        "'speaker_0': 'Councilmember Dunham.'",
        "'speaker_1': 'Mr. Gannon, thanks so much for being here. And, you know, I've.'",
        "'speaker_2': 'Had the privilege of chairing the Regional Transit Committee for seven years, working very closely with.'",
        "'speaker_1': 'Kevin Desmond and Victor Basso and all the transit leaders. And it's a very well-run organization and one of the best agencies, in my judgment, in King County government.'",
        "'speaker_2': 'And the public sees that, too, if we do survey.'",
        "'speaker_1': 'Work around the community. Metro rates very high, but you do come in to fill big shoes. Kevin Desmond is one of my favorite managers here in the county. But what I'm seeing with your outreach to the community and what I've seen so far with your work on the Regional Transfer Committee, which I serve now, helping out.'",
        "'speaker_2': 'Baldacci is.'",
        "'speaker_1': 'Really a great approach to engage in the community, what you're talking about with Mr. Gossett. So no tough questions for me to day. Look forward to supporting your confirmation and we'll say this is the first time we've done it.'",
        "'speaker_1': 'But I do I grant the executive great deference in this process and think I think unless there was some substantial problem.'",
        "'speaker_2': 'I would never overrule the.'",
        "'speaker_1': 'Executive's judgment on this. And it's not even close here. You're you're going to be great. And I'm really glad to be able to support your work, your nomination. Thank you very much.'",
        "'speaker_0': 'Well, thank you, Madam Chair. I also like to bring out the accolades here, reinforce them. I'm very pleased to be supporting in favor. I would like to also mention that with regard to the issue of transit for low income riders, I believe we did include a budget proviso in our budget that we approved two weeks ago to'",
        "'speaker_0': 'have King County that should conduct a study on that. So that's something that I think most all of us care about. So let's see what is forthcoming.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_0': 'Thank you very much. With that councilmember Tabasco, I should like to.'",
        "'speaker_4': 'Make the motion to share any problem to expedite this till this afternoon to this afternoon's council meeting.'",
        "'speaker_0': 'That's good by me. Let's see what legal stuff says. Can we? We can. Okay. I don't believe we can, but we can expedite it to the next meeting and.'",
        "'speaker_1': 'Do not take action this.'",
        "'speaker_2': 'Morning and review the threat.'",
        "'speaker_0': 'Okay, but we can have it at the next meeting and we can even put it on consent and get it.'",
        "'speaker_4': 'Done this month or I mean, in December. Yeah. Okay. Yeah. You met Chair happy to move adoption with a do pass recommendation of pardon me, a proposed motion number 2000 60530, which would confirm the Department of Transportation Director's appointment of Mr. Gavin as the general manager for Metro Transit.'",
        "'speaker_0': 'Excellent. Thank you. With that, the clerk, please call for the vote. Thank you, Madam Chair.'",
        "'speaker_6': 'Council member. About the. Councilmember Dombrowski both councilmember done.'",
        "'speaker_5': 'By.'",
        "'speaker_6': 'The members opposite by Councilmember.'",
        "'speaker_0': 'Colwell i.'",
        "'speaker_6': 'Councilmember mcdermott, councilmember of the grove councilmember Vaughn right there.'",
        "'speaker_0': 'I have chair I.'",
        "'speaker_6': 'Know knows councilmembers McDermott and out of the grove excuse.'",
        "'speaker_0': 'Well Mr. Cohen and that was a real squeaker. But I'm glad that you pulled it out and we're very excited about working with you. And we wish you decades of good success in your new job. So with that, we will put it on the expedited for next week.'",
        "'speaker_0': 'And I'm thinking since we already talked about it, that we might just because of the timeline, but I can see that. Is that okay or do people want to have another opportunity to talk about it now?'",
        "'speaker_4': 'What's going on?'",
        "'speaker_0': 'Okay. Well, let's put in our consent to start with and then that way your ears won't have to ring next week, we'll just vote on it. And so we'll start with that and somebody wants to talk about it, then we can pull it off.'",
        "'speaker_0': 'All right. Thank you so much and have a great day.'",
        "'speaker_2': 'Thank you.'"
    ],
    "AN ORDINANCE authorizing the use of an interlocal agreement template for municipalities within King County seeking to contract with the King County department of transportation to provide road services.": [
        "'speaker_0': 'Okay. Now we're going up to item number six. And I'm glad you brought your fan club. It's a good thing. And I'm sure there's 4500 other people back at work. 4600 willing to congratulate you, too. Number six is the 2000 60391 roads in a local agreement template for city contracts.'",
        "'speaker_0': 'And I'm sorry we've had to keep you waiting this long, but the agenda today just got moved around. Welcome. Thank you.'",
        "'speaker_5': 'Thank you, Madam Chair. I'm Lisa Kay on council staff. This item proposed ordinance 2016 0391 is before you today. The staff report is on page 61 of your packet. I'm joined with join by Road Services Division Director Brenda Bauer to my left.'",
        "'speaker_5': 'This legislation would allow the executive to use the contract template on page 81 of your packet for road maintenance agreements with any City and King County Council currently approves those contracts individually. Rhodes has existing contracts with 29 cities for a variety of services.'",
        "'speaker_5': 'The list of cities is included on pages 93 to 95 of your packet. The existing contracts in the new template provide for forecast recovery to the county for cities are currently seeking new contracts with King County. That would be Bellevue, the city of Medina, Normandy Park and Euro Point.'",
        "'speaker_5': 'After executing those contracts, words would expect to transition contracts with the existing cities over time. They adopted Strategic Plan for road services that you updated in 2014, directs roads to ensure that contract services do not materially reduce the capacity of the division to provide services to the county's network.'",
        "'speaker_5': 'According to executive staff, Rhodes has moved away from providing generic services to agencies that have capacity to do that work in-house. They adopted biannual budget, for example, anticipates $3.7 million in revenue each year from the contract cities, which is a reduction from historical levels which have averaged about $5.8 million between 2012 and 2015.'",
        "'speaker_5': 'You can see those figures on.'",
        "'speaker_0': 'Table one on page.'",
        "'speaker_5': '64 of your packet. Staff have prepared the technical amendment on page 79 of your packet, as recommended by Council's legal counsel. The amendment revises wording about Council's authorization of the use of the template. That completes my report, Madam Chair.'",
        "'speaker_0': 'Great. Thank you very much, Mr. Brower. Welcome. Do you like to talk about this work?'",
        "'speaker_5': 'Yes. Brenda Barrow, Road Services Division Director. Thank you for considering this change. It would provide a standardized template that is consistent with the work of the office and the Council's attorney to identify a template that would be a smart template that we could offer all cities and would expedite the work there, would reduce the amount of time'",
        "'speaker_5': 'we spend negotiating individual agreements with agencies, and that would create a lot of efficiency for us. It would also create a lot of certainty for us to have consistent terms for all the different cities we have moved away from.'",
        "'speaker_5': 'Providing, as Lisa said, generic services to most of the cities with a reduced workforce. We didn't want to provide services that would be in conflict with work on county roads. So very generic services are we've moved away from and we're focusing our staff on county roads so that that is not an issue for us.'"
    ]
}