{
    "A MOTION relating to identifying the future allocation of Puget Sound Taxpayers Accountability Account proceeds to priority educational areas and requesting the executive to develop plans to allocate proceeds within the priority educational areas.": [
        "'speaker_0': 'Thank you. Anyone else? All right, then we'll close the public hearing. And that takes us to item six, which is the framework motion that I've introduced. Motion 2019 to 45 making allocations for the Puget Sound Taxpayer Accountability Act funds coming to King County.'",
        "'speaker_0': 'We've put a lot of work into the decisions and framework about how we're going to proceed and where the investments should go. And in doing so, we've heard a lot about and important ways the kids are and are not being supported.'",
        "'speaker_0': 'I'm hearing King County and how that has a real impact on their ability to succeed in school and life beyond. I want to offer my appreciation to the people across the county who've put such work into informing our work on the past of funds through public testimony, letters and emails, small group conversations, the community engagement meetings that'",
        "'speaker_0': 'we have sponsored and participated in helped to organize in a lot of ways. This won't be the council's masterplan plan. It will be the community's positive plan. Mr. Mom to do plan. Did you have a staff report or information to work through or are you just making yourself ready for questions and.'",
        "'speaker_3': 'Ready for.'",
        "'speaker_0': 'Questions? That's what I assumed I was going to check, though. We the there is not a striker ready to come forward today. And so this is another opportunity for for the committee, for the full council to have a conversation among yourselves about what are our priorities, how we might see the money split up, what strategies in particular'",
        "'speaker_0': 'are important to individual council members so that we can hear that and make sure it's reflected in the strategy that I would intend to bring to full council, to the full committee on July 15th and to set the stage, I will offer some of my own thoughts, and then I would invite my colleagues to follow suit.'",
        "'speaker_0': 'What I'm looking for out of this work is investments that will have a long term positive impact on individuals and communities. Priority setting that reflects the things that people have told us are important things like resources for youth to support their out of school lives.'",
        "'speaker_0': 'We heard some particular testimony about that today so they can focus and be successful and in school itself to focus on outcomes as a measure of success, including resources for evaluation and opportunities to allow for innovation. Also recognizing that we should evaluate the program as it proceeds over its 15 years and have ample opportunity to adjust our'",
        "'speaker_0': 'invest particular investments to make sure that the programs we're investing in are having the intended effect in outcome. And we've heard and testimony and public comment and our own work and a value from for mine going forward would be to honor that consistent thread of equity and social justice driven decision making in organizations.'",
        "'speaker_0': 'The funds were awarded to and particularly the youth and students that the funds would serve. There's a lot of attention to the three buckets and how much of the funds might go into early learning K-12 and post-secondary. And I understand that emphasis.'",
        "'speaker_0': 'But also, I think it's important to remember that the goal is long term success for all four students, particularly those we have identified as vulnerable, vulnerable populations throughout that entire spectrum. And want to be able to underscore the county's work in our Youth Action Plan that starts for kids and zero youth detention.'",
        "'speaker_0': 'The policy statements we've already adopted for how we want to interact and support youth in students in our communities. I think this is another opportunity to complement and support those goals as well. With that, I'd welcome conversation questions and dialog with within the committee councilmember up the growth.'",
        "'speaker_3': 'Thank you, Mr. Chairman. Some of this may be repetitive from last week, but I thought I'd reflect on some of what I've heard and what some of my thinking was and some of my interests. As I think through this one, as was noted before, there is some uncertainty.'",
        "'speaker_3': 'This is time limited funding that needs to be appropriated regularly by the legislature. And there's a risk that we don't get it all because of that. One time funding is more attractive than setting up and starting programs for which we don't know that the funding will be able to continue.'",
        "'speaker_3': 'Capital funding is attractive to me because of that. I'm interested in us making some decisions in this legislation. I would like to see us do more than just pick three categories and defer to the executive branch. I feel like the legislative branch has had a very, very rigorous process.'",
        "'speaker_3': 'We've led in terms of hiring a consultant and having community outreach, that we shouldn't be afraid to identify specific strategies with dollar amounts in this legislation. If we can reach agreement on that, that's one interest. Second interest is in making sure that the funds are effectively hitting the target groups called out in the legislation.'",
        "'speaker_3': 'And certainly that we have rhetorically talked about and I'm nervous a little bit about about that. I've been very interested in early childhood capital funding, but I want to see a specific commitment to ensure that those dollars are going to serve the target population to a large degree.'",
        "'speaker_3': 'I'll just give you an example. If half the kids and these aren't these are sort of just made up numbers for illustrative purposes. If we were to give half that illustrative purposes here, if half of the funds, 50% of the funding were to go to early childhood facilities and half the kids served were low income or kids'",
        "'speaker_3': 'of color. That means 25% of our funds are going, in essence, to support kids that aren't part of the targeted population. So I would like to see some firm commitments in the legislation not worked out later by stakeholders, but what our expectations are about the population serve so that we're focusing in, as we heard today, on dual'",
        "'speaker_3': 'language. So we're focusing it on traditionally marginalized communities, kids in foster care, students with disabilities and particularly low income population. Does that be 100%? But we ought to be able to put have an understanding. I think the same goes with each age group, the formerly known as the King County Promise.'",
        "'speaker_3': 'I know it's meant to target those margins, those kids who are most struggling, but making sure that the language in our appropriations ensures that a couple other small interests I had I'd like to see admin costs no more than 5%.'",
        "'speaker_3': 'I'd like to see 1% set aside for technical assistance for smaller organizations with less experience to assistance in applying and navigating the system. I'd like to see us have a specific carve out for our own facilities in King County.'",
        "'speaker_3': 'We we have incarcerated young adults, and I'd like to make sure that we provide support, even though there are people under 18 at the RJC, get students up to age 21, are eligible for education support. So I'd like to see those young people that are in King County's custody get a direct allocation in some way, shape or'",
        "'speaker_3': 'form. I've met with the Sound Alliance folks a couple of times, and the equity in making sure of equitable access to physical education across all of the age ranges is a it's appealing. Figure out how we weave that in is something of interest.'",
        "'speaker_3': 'And I think those were some of my areas of interest and I think there should be a meaningful contribution to all all ages along the continuum. And that's my $0.02.'",
        "'speaker_0': 'Thank you. I appreciate all of that and particularly would be interested in working with you on the idea you surfaced. You did, in fact, surfaced last time the committee met about making sure that investments, particularly in your example, early learning that those facilities are supporting the vulnerable populations we've identified in the language in how do we find'",
        "'speaker_0': 'a way to do that? Look, I would like to work with you if you have any thoughts to share them. Now, we're on or between now and the next meeting about how we can best do that. Please.'",
        "'speaker_3': 'I forgot something. Thank you. I look forward to work with everyone on that. As part of that, I you know, we have a lot of immigrant and refugee families in low income families in South King County and probably throughout the county who receive child care through home based programs.'",
        "'speaker_3': 'And I'd like to make sure that we have some mechanism to provide support for those providers, whether it's through a grant program or something like that. I think in terms of our neediest kids and where we get the most bang for the buck, there ought to be some way to reflect that so that there's some opportunities there'",
        "'speaker_3': '. Another idea to kick around.'",
        "'speaker_0': 'Thank you, Councilmember Balducci.'",
        "'speaker_1': 'Thank you, Mr. Chair. I really appreciate this opportunity. And thank you for giving us this opportunity to have this open conversation with the public here and with all nine of us here. One of the things I think this may have seemed like an extremely slow and deliberate in some ways process.'",
        "'speaker_1': 'But I think that one of the things I've liked about it is the fact that we've sort of brought people along and everybody's been able to engage and have have their their voice heard, which I think will make the ultimate recommendation, the ultimate decision, more understandable and more justifiable.'",
        "'speaker_1': 'So thank you for taking this time. I agree with a lot of what's been said. I'm just going to emphasize the things that are most important to me. To add to the collective conversation you've had with Mr. Chair, with the idea of having a long term positive impact.'",
        "'speaker_1': 'I think one of the key principles that we have put out in every one of the the conversations and motions that we have had. And it's just so exciting, actually, to see people come lobbyist with their own words.'",
        "'speaker_1': 'That's super cool. I recognize those signs is that we wanted to make sure with this it's short term money. It's not it's not an insignificant amount of money, but it also could disappear very, very easily. It's an amount of money that if we spread it out in small chunks to lots and lots and lots of different types'",
        "'speaker_1': 'of things could easily disappear and not have the kind of impact we want to have. So I continue to be very, very supportive of the idea. As difficult as it is to narrow our focus on strategies within the three eight levels of education that have the deepest possible impact.'",
        "'speaker_1': 'We've put a lot of time and effort, as has been said, into studying what types of strategies have the greatest long term educational outcomes positive and serve the most young people. And I think that we should see that study reflected in our proposal when when it comes.'",
        "'speaker_1': 'I think that we should go where the information leads us, including listening to what the public has said and we have our community input summary. We've heard a lot from people about what works for them. We need to take that into account and that needs to be demonstrated as well.'",
        "'speaker_1': 'I agree completely with councilmember of the group and with what we heard here and at the last meeting in in one of the motions, I think it might be in the second motion for some reason, the target priority populations that have been called out from the beginning in the legislation from Olympia only showed up in one of'",
        "'speaker_1': 'the three educational categories. It didn't show up in K through five. It showed up and it didn't show up in pre-K. It showed up in K through 12 and it didn't show up in post-secondary. I don't think we intended that.'",
        "'speaker_1': 'Certainly, I think it's important that the priority populations be the focus of every level of education. And so to the extent that was a mistake, I guess I will just say it was a mistake. And I think what we intended to do was to focus this money as much as possible on the places where it is needed'",
        "'speaker_1': 'most, because that's where we can have the most impact. What else? It's important that we set an evaluation period. It's important that whatever we do, this is 15 years worth of funding, that we set a time as if it's a levy, that we're going to evaluate the programs we're investing in between now and the end of that'",
        "'speaker_1': 'time period. And then we take it up as a county again and see whether we're having the impact we want to have and adjust accordingly. We do that with all of our funding levies for best starts for kids and vets and human services.'",
        "'speaker_1': 'And I think we should do that with this as well. I think I've covered what I wanted to say. Oh, I will say this. I'm going to turn to the public and say this. You all are making incredibly compelling cases for all the needs that you are speaking to.'",
        "'speaker_1': 'And we hear you. And as a mom of of a young man who's 13 now, I guess I can't call him a little kid anymore. I we want to do for all of it. But when you have a group of people asking for 60% of the money and another one asking for 40% of the money, and a'",
        "'speaker_1': 'third group, somebody is going to be disappointed. So I just we we have to figure out a way, I think, to give a strong rationale for why we're investing, where we're investing. But I don't know that all everybody is going to be happy with the percentage.'",
        "'speaker_1': 'Number. So I hope that you will bear with us and work with us and help us to figure out a way where we can make a fair level investment that has the best outcome for the most young people from pre-K all the way through post-secondary.'",
        "'speaker_1': 'So thank you for just kind of asking for your indulgence a little bit as we work through this and thanking you in advance for that.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Thank you. Councilmember Lambert.'",
        "'speaker_1': 'Thank you, Mr. Chair. Well, I agree with what we heard from the last speaker completely, but I'd like to add a couple of things. First of all, I agree with what Councilmember Avakov said about us being the policy branch and that we have spent a lot of time and a lot of hours read, a lot of reports'",
        "'speaker_1': '. And so I think we should be the ones making the decision on how the money is distributed to go out. 15, 25, 25, 25 is peanut butter. And I think it's more important to me that we do something meaningful transformation, transformational, powerful, ongoing changes.'",
        "'speaker_1': 'And one of the things that I was talked about about earlier was that we might have a little evaluation money in here and that might be something we can do. There are many buckets of money and we need to be sure not just this bucket, but all of our bank and others to be sure that the needy'",
        "'speaker_1': 'all across the county are being served because there are pockets where there's really high needs and there's pockets where there is not quite so many in need. But every district has people that are in needs. So I think it's important for me that we be really aware of Aces and making sure that we get to the children'",
        "'speaker_1': 'as early in life as possible so that they're on the right track as early as possible. And that the Women's Advisory Board has done a lot of work on this over the last couple of years. I met with several people and one of the people told me that the data we've been looking at was on subsidized youth'",
        "'speaker_1': 'only, that the data was only for that category as they had read it. Originally, I was thinking it was all eligible youth across the county, and so even the numbers that we're using are a smaller section of the pie than all of the need.'",
        "'speaker_1': 'And so I asked the Women's Advisory Board to go back and give me some more information. And basically what they said was, even if we did a whole lot of money. Again, this is a hypothetical. Even if we went as high as 85% going to facilities for small children, it would only cover 73% of the subsidized eligible'",
        "'speaker_1': 'youth. So even if we went that far, we're still not getting the whole pie, but we're getting a very large percentage. And so I think as we look at each of the percentages, we need to look at what percentage of the problem are we solving and try to get the problem solved.'",
        "'speaker_1': 'The last thing I want to say is that, you know, there are two things left over from my days in the legislature that I still have have pain about, and neither one of them are solved. And it's been 18 years.'",
        "'speaker_1': 'So it's it's hard for me when those two topics come up because back then I was very concerned that they won't be done right. And it turns out they still haven't been done right and we're still dealing with them.'",
        "'speaker_1': 'And one of those is foster care. The Brame decision, or Brom, depending on how you pronounce it, was settled two years ago by the court, and that is for foster care kids. And one of the rules around foster care kids and so two years ago after gosh, I guess it was like 18 years of negotiating and saying'",
        "'speaker_1': ', do this, pretty please do this. You're still not doing it right. Was the mess for over 18 years and even two years after the final negotiations. They are still not clients with the new agreement two years ago. So the foster kids in this state are still not being treated with the care and concern that I believe they'",
        "'speaker_1': 'deserve. These are people who have nobody but us. And I know with my own children, it doesn't matter whether they're 18 or 21 or 25 or 30 or even 40. There are times when they come back to mom and say, Can you help me with X, Y or Z?'",
        "'speaker_1': 'And for us to have expectations that a child at 21 or 25 is not going to need anybody to turn to is something that's very painful. So I think we really need to do something with our foster care kids and to make them a huge priority.'",
        "'speaker_1': 'So those are my priorities. Thank you.'",
        "'speaker_0': 'Thank you, colleagues. Councilmember Gossett.'",
        "'speaker_3': 'Thank you, Mr. Chair. I generally concur with a lot of the points that my colleagues have made. I thought the government about the issue was particularly perceptive when she noticed that we didn't have direct criteria for K 0 to 5 and post-secondary.'",
        "'speaker_3': 'And actually some of the people that testified said we want we want this money to go to all the children that want to go to college or we want it for all the child care centers. I think it's absolutely imperative that we have targeted criteria for money that's at 0 to 5 K-12 and post-secondary if we end'",
        "'speaker_3': 'up having funds in all three, and that it has to explicitly say what's in the state legislature, legislation that went to sound transit, and that is that their beneficiaries be low income youth, youth of color, child welfare system recipients, foster care kids and those involved in the criminal justice system.'",
        "'speaker_3': 'All those are disproportionately African-Americans and other youth of color and poor people in general. They are married. When he first took over as mayor, I don't know, five or six years ago, he said he was shocked when he found that in Seattle, Washington, that 55% of all black kids, 18 and under, live in households that are below'",
        "'speaker_3': 'the poverty and the corresponding figure for white youngsters is 5%. He said, I just didn't know, Councilman Gossett, that the inequality was that great. And, you know, it's a it's a major challenge. So I think and I think if you look at what happened the last three weeks, the overwhelming majority of the population of folks that provided'",
        "'speaker_3': 'input to us here clearly were saying when they came up in big groups that they want k 12. Yes, it's true that they want various aspects of K 12 from it, but I just don't think that that's political criteria that's coming from residents that say that the focus has to be on 0 to 5 or both secondary'",
        "'speaker_3': 'and the most critical need is in K 12, because no matter what we've done over the years, the categories that we're focusing on low income youth, youth of color, child welfare and foster care kids are consistently doing extremely poor.'",
        "'speaker_3': 'We can't solve all of it with $300 million, but we can target a few programs like Dr. Juneau, who's the superintendent of schools now, told the Breakfast Group, which is a black man's social group, that I'm a part of, that she was shocked to find out that 64% of all black third graders in the Seattle Public School'",
        "'speaker_3': 'still today, despite whatever existed in the past, are are reading at below many far below third grade level, third and fourth grade level. So we can target third or fourth grade or we can talk target cultural enrichment for our high schoolers, or we can target curriculum change for teachers that we test and evaluate to see if it'",
        "'speaker_3': 'makes a difference for our public schools. I know we can't run everything, but I think that in each of the three categories we have to target. I agree with Councilmember of the girl. We need to be the ones to be more prescriptive than the County Council usually is by coming up with the criteria and pushing and encouraging'",
        "'speaker_3': 'the executive staff to go along with it. And then we put a little bit in there for evaluation. But we have targeted focus areas of K-12, post-secondary and zero to try and 0 to 5. My problem with going forward in 50% and three out of five per capita is that the examples that I have to draw from'",
        "'speaker_3': ', from the County Council, when we've made money available just for capital in the past, we have not done very well. Even when we say, Oh, we want our fair share of it to go to the poor because the poor are not able to put together proposals to say, well, we got to put 10% of the money into'",
        "'speaker_3': 'the project, or 15%. An account only has to put in 70% was no real for growth. Given the statistics I gave you all the earlier that our ten 15% extra point for capital moneys are based on the incentives and incentives are going to have to be non-financial.'",
        "'speaker_3': 'We're going to have to put this criteria in there and we're going to be vigilant and looking at it. I just think in closing, Mr. Chair, that we have to just choose targeted program areas in each of those three categories, but particularly K-12, that we focus the money.'",
        "'speaker_3': 'I agree with members who say, Well, we just read it all over. We're not going to have anything resolved. We got to be proscriptive about what it is we find, how we're going to evaluate it, and why it is that we think by putting money in these categories, that's going to make a big difference for low income'",
        "'speaker_3': 'kids, kids of color, those on child welfare, those in foster care, and those that are involved that are involved in the juvenile justice system. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you. Council Member Wells.'",
        "'speaker_1': 'Thank you, Mr. Chair. I have a question of jobs and then I would like to make a couple of comments. Jeff, and in my incorrect here, am I correct that in our motion that we approved two years ago and in the motion that's before us now, we do not differentiate between any of the three buckets early learning'",
        "'speaker_1': ', K-12 post-secondary in terms of only one having the priorities to reach children and youth of color, those in low income families, children of youth who are homeless and the foster care system or in the child welfare system, or involved or potentially involved in the juvenile justice through criminal justice system.'",
        "'speaker_1': 'I thought those those were for all three groups.'",
        "'speaker_3': 'In the motion before you. There's there's sort of two sections. And in section A, it's sort of shorthand for the different educational areas. But then in section B, it calls that it says for all of this, for everything you do, focus on these kids.'",
        "'speaker_3': 'And then when and then in section see it asks the executive to come up with an implementation plan, and part of that is to make sure that it hits those priorities that are in Section B. So that's it.'",
        "'speaker_3': 'It's certainly could be more clear in Section eight, but the mechanics of what's before us, honestly, I have to go back and look at the the last meeting and I haven't and it's not top of mind right now.'",
        "'speaker_1': 'But my understanding is it's not that these targeted efforts go on solely in K-12. It's across all three areas. That's correct. Okay. What's unclear, I find, is when criteria are mentioned for the executive to come back, it's relating to the process of allocating the funds.'",
        "'speaker_1': 'But still, all of these mentioned targeting will go on in all three, as we've called them buckets.'",
        "'speaker_3': 'Yeah, I think that's how the, the, the report is structured.'",
        "'speaker_1': 'So. Mr. Chair, I have a lot of mixed thoughts here and we've all commented on this before. It's so compelling to hear from the people who've engaged in public comment, who've emailed us, who've called us, have spoken out at the many listening, listening sessions around the county that were held by the consultant.'",
        "'speaker_1': 'And I mean, my heart goes to this one and that one and the third one, because they're all so compelling. And one thing that is really important to me is that or a couple of things that are really important to me is that we look at this holistically.'",
        "'speaker_1': 'Children, young, very young children, school aged children, youth who are going often to some type of post-secondary program or potentially would, you know, are real people. They're not just like segmented that they're people when they're only in your early learning and that's when they should get all their attention are in K-12 or in post-secondary opportunities.'",
        "'speaker_1': 'And for me, it's looking at that whole person and what's going to be best to work out for them regardless of the age span in which they are. And in fact, I see that all three of these age areas have overlap.'",
        "'speaker_1': 'I mean, there's certainly a lot of overlap between early learning and K-12. It's essential to get kids engaged with education. Passion and opportunities and love of learning and so forth when they're really young. And we do not have a sufficient number of child care centers throughout the county, let alone ones that parents can afford to have their'",
        "'speaker_1': 'children there. This is a fabulous opportunity to expand what we have in some communities with Headstart and eke out, but we're just not able to keep up with it all. But there is that overlap with the K-12 program, and the more we can do in early learning, there's a better opportunity for individual kids to be able to'",
        "'speaker_1': 'have a meaningful education while in the K-12 systems, and especially when we're talking about the the at the ethnographic and demographic areas since we've included. But there's also obviously a huge overlap between K-12. Keeping kids in school, keeping them engaged and not dropping out of school, not getting involved in the juvenile justice system, especially for kids who'",
        "'speaker_1': 'are in the foster care system or the child welfare system and so forth. So to me, I look through about as I look at all of this holistically, I see some appeal to looking at those linkages too, and not having three discrete systems that we're dealing with.'",
        "'speaker_1': 'And with that, I would like to remind everybody, I'm sure you all know it, but in the last legislative session session when we had the clarifying legislation come through, that we can use the funds for Capital One time expenditures.'",
        "'speaker_1': 'We also were informed that we cannot bond the funds that we receive, but we can use the funds to create endowments in all three of these buckets, so to speak. And I'd like to suggest to my colleagues that we really look at having some some percentage of what we do go into creating endowments, which we could then'",
        "'speaker_1': 'have longer term effects than otherwise. So I haven't decided where I am here on which percentage for each group, but those are some of my thoughts. Mr. Chair, thank you.'",
        "'speaker_0': 'Thank you. I want to share your interest in breaking down some of the barriers between those buckets, if you will, and recognizing, particularly in some of the work that we're hearing about and in pondering in K-12 and post-secondary, that if you're going to help students succeed and Kate, in 9 to 12 in high school, that is going'",
        "'speaker_0': 'to project them into some sort of post-high school work in most cases, and sort of not see that as a graduation, as a D marker, as a hard deadline, an endpoint in start point. And then also recognizing that a lot of the work we hear about the Promise program, if I could, and sort of from a scholarship'",
        "'speaker_0': ', perhaps it starts before you're in school, starts with the application and the financial applications and such that again starts before high school graduation. And so recognizing that lines between buckets may blur and we may need to be explicit about that or wherever that is, we we make funding decisions.'",
        "'speaker_0': 'With that, I want to acknowledge and thank my colleagues. It is unusual for us to have a discussion among ourselves on TV with an audience. But it is the way we can have such a discussion with all nine of us.'",
        "'speaker_0': 'Being part of it is to do it in public as a as a full committee. So I want to thank you for sitting through our conversation. And more importantly, I want to thank my colleagues for having a conversation that is somewhat unusual to not be debating the fine points of legislation and offering motions and amendments, but talking'",
        "'speaker_0': 'about our interests. That will then help inform the striker that I expect you will be in committee. You will see before, but will be in committee on Monday, July 15th, when we take this issue up again. And with that, we are adjourned.'"
    ]
}