{
    "AN ORDINANCE authorizing the conveyance of the surplus property located at 906 Pine Street, Seattle, Washington, in council district four.": [
        "'speaker_0': 'I when the opposed approval unanimously. All right. That brings us to item number five for discussion today. This is the proposed sale of Metro Transit's Convention Police Station to the Washington State Convention Center Authority that we've all just been talking about to construct an expansion of the convention center.'",
        "'speaker_0': 'This item was extensively, extensively briefed in the budget and Fiscal Management Committee is now before the committee of the whole to work on some technical and other issues. There is a striking amendment and process. It's not before us today, but it will be before us very shortly.'",
        "'speaker_0': 'And but we I want to thank councilmembers Dombrowski and Caldwell's for working with me to try to bring this to a place where we can have an up or down vote in a timely manner. Because I think that we hear the urgency and we hear the interests, and we're trying to balance those and make sure that we'",
        "'speaker_0': 'do our due diligence as as one of the speakers stated. So, okay. With that, I will ask our staff, Pat Hamacher, to give us a status update and maybe lay out some of the issues that we're working on.'",
        "'speaker_2': 'Sure. Thank you, Madam Chair. And Council members, for the record, Patrick Hamacher, Counsel Staff. I'm going to turn your attention to page 20 in your packets. And almost all of the staff report is verbatim the same as what was in the Budget Committee.'",
        "'speaker_2': 'But, Madam Chair, you asked us to highlight one issue that was in the staff report but didn't get a lot of attention. And then we'll flip to the end, which is the update, as you hinted, as you said in your introduction about where we are with the status.'",
        "'speaker_2': 'So the item that I want to cover is the bottom of page 20 and end of the page 21. It's areas of the sale, particularly revenues of the sale or expenses associated with the sale that are of interest to council members to make sure that the county actually retains the proceeds from sale, from the sale of the'",
        "'speaker_2': 'of the convention place station. And the two big areas of risk that I want to touch on are covered in this section. And they are the temporary work that this is essentially the ramp that would allow the transit busses to continue in and out of the site during the work the convention center is doing, but hasn't yet'",
        "'speaker_2': 'when their work is being done, but hasn't yet displaced the transit functions into the CPS station, and that is currently projected to be up to $4 million. The scope and timing of that have yet to be worked out between the convention center and transit.'",
        "'speaker_2': 'So there is some risk there. The additional piece is the what we call the the TPS, which is the transit power substation work, that is equipment that is owned by transit and communications and power transmission and other utility equipment that is jointly owned.'",
        "'speaker_2': 'And the total of the equipment is owned between King County and Sound Transit. And that relocate that equipment needs to be relocated as part of the construction and is currently projected to be in the $17 million range. But once again, the final scope and schedule and what the budget actually will look like hasn't been negotiated yet.'",
        "'speaker_2': 'So those really are two areas of risk on the expense side for transit that are still up in the air, not not for any lack of intention to have it clear, just that the negotiations haven't been done yet between transit and the convention center authority.'",
        "'speaker_2': 'So that's what I wanted to highlight there. And I'm sure.'",
        "'speaker_0': 'That what I really asked for, I mean, we've highlighted these issues and. And frame them and you just highlighted and framed them is there's a big difference between we know what we're building and there might be a change in the cost of materials and that can be significant.'",
        "'speaker_0': 'But, you know, it's a percentage here, a percentage there versus we don't know exactly what we're building. And this could mean this number could be way off. And that's what I'm really asking, is what's the range of possible swing in those actual costs?'",
        "'speaker_0': 'Do we have any clue the no.'",
        "'speaker_2': 'We have a lot more certainty around the ramp because that is a much more narrow number. I've seen between six and $8 million as the current projected one. The fact that you have sound transit and Metro Transit and the Convention Center all negotiating over the TPS agreement, what needs to be done?'",
        "'speaker_2': 'Ultimately, we know what works there, but how and when it is done is what can drive the cost and the risk. There is potentially millions of dollars in difference. Okay.'",
        "'speaker_0': 'Well, that's something that's of concern to me. I just wanted to highlight that because it's of concern to me that we set a sales price and then that's the benefit of the bargain can get significantly degraded by the fact that our cost to close the deal and do what we said we were going to do could go'",
        "'speaker_0': 'way up. And we don't know that at this time. And I think we need to get a little more certainty around that one way or another. I mean, there's different ways to do it. Yeah. So. Okay, thank you.'",
        "'speaker_0': 'Please continue.'",
        "'speaker_2': 'That's an excellent segue to page 30, which is the very bottom of page 30. This is a status update on the items. And I'm sure that you and your colleagues asked us to highlight essentially the areas you're still working on.'",
        "'speaker_2': 'And the very first item there is price certainty around the two agreements that we were just discussing. So that's one of the items that's still under discussion. The agreement as transmitted by the executive, gave the buyer the option of building affordable housing on site or providing a payment to King County.'",
        "'speaker_2': 'Same value. But whether they built it or whether they paid the county for it, the notice essentially notification and a verification opportunity for the county around the stress test associated with issuance of bonds for the project. The next item is how to address concerns with the decommissioning of the public art on the site.'",
        "'speaker_2': 'And then finally the amount of time or the date at which transit will be required to vacate the site. So those are kind of the big picture items that are still in progress. And at that point, I'll stop and I'm happy to answer any questions.'",
        "'speaker_2': 'Madam Chair.'",
        "'speaker_0': 'Thanks, Mr. Hamacher. Councilmember Lambert. Thank you, Manager. I am concerned about the affordable housing piece and I would rather have it in my mind in the facility so that it gets done simultaneously. And having had to deal with the city of Seattle on a building permit that the county is trying to get, I think that it would'",
        "'speaker_0': 'be better for us to have it inside. So at what point could we decide which way that's to go? Can we do an amendment here to decide that so.'",
        "'speaker_2': 'That the agreement that came over from the executive, it's the buyer's option. They can, at closing, make a payment to the county or commit to building affordable housing on site. The part of your question where you said right away, though, that's the real issue because any housing that's built on site would not be constructed until at least'",
        "'speaker_2': '2021, which is when the rest. So they're going to build the convention center addition. They're going to build the footings for the two new towers. And at that point, housing could be built. And currently they're projecting an office building and an apartment or condo building.'",
        "'speaker_2': 'So it would not be until at least that time that any housing would be done in 2021.'",
        "'speaker_0': 'Sounds fine to me. I'm just worried about a be 2015 or 29. So in order to not be 2090 and I have some concerns about some other history we've had where they were going to build offsite housing and I'm not aware that ever got done.'",
        "'speaker_0': 'So it is part of this and conditional that you don't open your office building until the affordable housing is done, then I know it'll get done. And so I want that to be tied a little more closely. Okay.'",
        "'speaker_0': 'Thank you, Councilmember Garcia.'",
        "'speaker_3': 'Thank you, Madam Chair. My concerns are very similar to Councilmember Lambert. I was kind of surprised by the lack of, you know, labor or work or solidarity that was expressed this morning. We have people testifying that were with your name here.'",
        "'speaker_3': 'But let's talk about it at the end of the process, after the decisions have been made and other people are saying, well, they weren't there at the beginning when the hard work to its effort was. Therefore they don't have any legitimacy.'",
        "'speaker_3': 'So I don't understand why we can't make a commitment for low income housing up front even though the housing not be going to be spent. I pad indicate into 2000 22,021. We as a government have been okay on too many big projects for a commitment to housing and that not take place.'",
        "'speaker_3': 'And it is the condition that the executive worked out is very minimal. You hear just saying and I think it's a moral and good idea that if you're going to be on how they make some of it affordable for the people who work in hotels, which are mostly refugees, immigrants, African-Americans and other low income workers that are'",
        "'speaker_3': 'serving as maids, butlers, cooks. So I don't understand why we would bypass making that kind of commitment upfront.'",
        "'speaker_0': 'Or.'",
        "'speaker_3': 'Not just affordable for some low income housing and whatever. Is the bailout as ideal that one union's ideas are superior to the other and the other because they represent low income workers? Got to wait later after we get our jobs.'",
        "'speaker_3': 'I don't see that as solidarity. Thank you, Manager.'",
        "'speaker_0': 'Thank you, Mr. Garcia. Councilmember Lambert, another question. Thank you. Yes, I just wanted to ask about the permitting for the building construction. So having been for the last three years, every Wednesday morning dealing with a building permit from the city of Seattle and Purgatory, be a nice word for how that is.'",
        "'speaker_0': 'Are there any things in here where we need to put any protections that any delays that are caused by the cities? I can't use the word ability, but I should use the word ability. Ability to to get permitting out in a timely manner.'",
        "'speaker_0': 'Would there be any impact to us? Is there any protections we need to build in that? If it's not done by a certain time and there's a cost allocation escalation that there's no impacts on us?'",
        "'speaker_2': 'Most of the answer to that question is no, because this is a land sale. We're selling the piece of property. The area where I would say the answer is yes is as transmitted. The date for when Transit asked to vacate the station is September 30th of 2018.'",
        "'speaker_2': 'Unless there is substantial delay on the project. And as we've noted previously throughout the staff report that what that substantial delay is isn't defined. So I think the the only real place where a city delay would impact the county would be in that if they delay permitting, theoretically transit could stay in the station longer.'",
        "'speaker_2': 'And there's up to a year there. That's really that's really not clear. But we're anticipating sound transit would like the county to be out of the tunnel September 30th of 2019. So there's quite a difference there between September of 2018 and 2019.'",
        "'speaker_2': 'So that's the one area where I think the city permitting delays could impact our role in the transaction.'",
        "'speaker_0': 'So anything we can do, they say you can't be paranoid if it's already happened to you. So the fact that we've had to deal with this for our own building, building, if they'll do it through the county, then it could happen to other people too.'",
        "'speaker_0': 'So I think we need to just show that up so that there's some kind of way that we are completely protected. Thank you. Thank you very much. Any other comments or questions on this topic? Well, just in closing, as I said, we are closing in on an amendment.'",
        "'speaker_0': 'I heard some comments from council members this morning that suggest that you might be thinking about other amendments as well. And I our plan is to take that up after at the special meeting where we're going to do the appointment to the legislative vacancy in the.'",
        "'speaker_0': 'This is the 3040 646. Thank you. Thank you. Councilmember Douglas.'",
        "'speaker_4': 'Despite rampant rumors, I am not making calls for one of the candidates.'",
        "'speaker_0': 'Excellent.'",
        "'speaker_3': 'I thank you.'",
        "'speaker_0': 'And that is so. But there's going to be represent.'",
        "'speaker_4': 'Part of it.'",
        "'speaker_0': 'Councilmember Garcia, I think we'll be able to use half of that special meeting to keep this moving because we get into summertime and we have some breaks in our schedule and it gets a little bit difficult to keep things going.'",
        "'speaker_0': 'So I want to keep the momentum going.'",
        "'speaker_4': 'Madam Chair.'",
        "'speaker_0': 'Accounts from.'",
        "'speaker_4': 'Damascus. I apologize. Say this. I haven't done it yet, but I did have one question that I wondered if Pat might be able to answer. This is, I don't think senior staff report, but with respect to the party, the DSD, the downtown sale transit tunnel early and turning that over to exclusive sound transit operations is their existing'",
        "'speaker_4': 'debt service that the county is paying today on the tunnel. And if any of that we do that, are we relieved from that debt service? And we have an idea of what those savings are to the county that soundtrack that understands hundreds of up.'",
        "'speaker_2': 'The first part is, yes, there is existing debt and if we give up up joint operations early, we would be absolved of that. I think it's about a year and I think it's about 3 million. But don't quote me on the number, I will confirm that to you.'",
        "'speaker_2': 'There is a debt service payment and we would probably avoid at least one year of that. But I just need to find out what the number is.'",
        "'speaker_4': 'Appreciate it. Thank you, Madam Chair.'",
        "'speaker_0': 'Okay. Thank you, Councilmember Gossett.'",
        "'speaker_3': 'Thank you, Madam Chair. I'm referencing your earlier comment about amendments. When would an additional amendment have to be ready to be discussed?'",
        "'speaker_0': 'Well, the final date would be when we take this up at the full council, but the earliest date would be as of next Monday morning.'",
        "'speaker_3': 'And next Monday. Okay. Because I want to look at an amendment. We have a government wide commitment to equity is also just as in my mind, that means considering what impact our major policy decisions have on other poor minorities and other disadvantaged folks who want to put it together.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Gossett, Oscar Castro, the best known.'",
        "'speaker_4': 'What sense would it be? Helpful. You and I and Councilman Carlos have been working diligently with staff on this and on the affordable housing piece. It seemed to me there was a growing consensus, at least among the three of us, that it might be worth sharing and correct me either of you if I get this wrong.'",
        "'speaker_4': 'But with respect to the $5 million payment for affordable housing in the county, I have heard a couple of preferences among us, and that is one that we pursue the cash at closing option. And I think the thinking behind that is twofold.'",
        "'speaker_4': 'One, it occurs sooner and allows us to deploy the money faster to build affordable housing sooner so we don't lose through 2021 inflation. The value of the $5 million, right? If it were to be built into the project years later too, it allows some little bit more control at the county to direct those proceeds, perhaps for workforce'",
        "'speaker_4': 'type housing or transit oriented development housing where we'd have the flexibility to locate those on projects that are ready to go or high need or that suit our policy objectives. And I know Councilmember Garza has been a leader on ensuring we get down to the real affordable housing.'",
        "'speaker_4': '30% am I 50% in mind that would allow us to target those dollars that way? So we've had this discussion today. I thought it was fair and appropriate, so everyone was on the same page to share some of the thinking in the room.'",
        "'speaker_4': 'As I recall it.'",
        "'speaker_0': 'Just as a process matter, there will for sure be a chair striking amendment. There may be a joint strike imminent, there may be a separate striking amendment, then there may be standalone amendments. But we're going to try to get as much of what we all agree to into one as possible, just so that we're able to take'",
        "'speaker_0': 'things up in an orderly fashion. And I think we're I mean, I think we're getting there. I guess that's what else I think we're getting there. And I appreciate hearing the issues that have been brought up this morning.'",
        "'speaker_3': 'Councilmember Costa, I just wanted to thank you, Madam Chair, said Councilwoman Dombroski there it is nice that, you know, the three leaders of this issue have discussed this, but I would like to have the opportunity to meet with you all and try to make a case for more concrete commitment to low income housing because.'",
        "'speaker_3': 'Always that big is off the hook by saying, Y'all give us some money and we'll find somewhere to build low income housing. And we hit our tendency of building all the low income housing and already low income neighborhoods.'",
        "'speaker_3': 'I don't see why we can't commit to building that in the neighborhoods that were being expanded. And we're going to allow the developer to invest in building, you know, hotel, motel or apartments. We should do something for the lower income workers.'",
        "'speaker_3': 'Not exclusively, but something. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Mr. Dawson. Councilmember Colwell. Thank you, Madam Chair. Packed question. I concur completely with the motivation, the desire expressed by Councilmember Garcia, but I wonder about what the history is in recently of the council dictating to a developer or a business what they do, how they spend their funds and how they design.'",
        "'speaker_0': 'So, I mean, can we require that they.'",
        "'speaker_2': 'Oh, I think I think certainly you could. I think I think the the desires expressed by the developer or through the executive's proposal are just that you're making a contractual agreement with the developer for what is built on land that you currently own and are being asked to sell.'",
        "'speaker_2': 'So you certainly could obligate that. And in fact, we have obligated developers to build housing on site in the past. To Councilmember Lambert's point, there have been quite a few hurdles in actually getting it built. But certainly you you have the authority to require that to be built.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'For much.'",
        "'speaker_4': 'That's great.'",
        "'speaker_0': 'That's what I is for so that we can surface issues and hopefully do something with them.'",
        "'speaker_4': 'Thank you, Madam Chair. And this is in the event I don't connect with the three of you, so we might as well pass thoughts along. Now on that. I am I mentioned this before in the Budget Committee and I'd repeated again, I'm very supportive of the Councilmember Dombroski suggestion that we take Castro closing part because the geographic'",
        "'speaker_4': 'flexibility in addition to the the real dollar, the real protecting the value of those dollars to the extent we can legally and I don't know to what degree we can legally.'",
        "'speaker_2': 'The ability to target.'",
        "'speaker_4': 'Additional housing units to a workforce that's going to be generated in Seattle as a result of this project and the increased need there. And I don't know how, you know, our attorneys have looked at this, but in essence, can we find ways that units become available for the lower wage workers who are in that industry?'",
        "'speaker_4': 'And I don't know if Pat, if you recall the conversation with legal to agree we do that or is it simply doing housing in that price range and marketing it to them versus restricting?'",
        "'speaker_2': 'We have done some analysis of that and the initial conclusion conclusions ironically were actually that it's very hard to target the industries in Seattle with their new rules because of the first. So I would not give that as a as a legal opinion or a final answer.'",
        "'speaker_2': 'The the councilmembers that we've been working on this have have wanted to target based on images the lower the lower end of that spectrum. And that's fairly common to do. I think it may be difficult to do a industry specific target in Seattle, but I don't see any reason why it couldn't be done with the $5 million'",
        "'speaker_2': 'as a whole as it went out into other programs and and actually funding affordable housing projects. What you end up with is a project with a whole bunch of funders and with a whole bunch of different restrictions. This part has that and it goes into a pot and there's a really complicated process they go through to try'",
        "'speaker_2': 'to allocate it in this case as quickly as possible because of the need out there. But I think that's workable. Ironically, it might be difficult to target that and then back into the city where the where the jobs are being generated.'",
        "'speaker_0': 'So Councilmember Lambert's.'",
        "'speaker_4': 'A noble a noble a noble goal that it might be a question of if you can't legally set aside units, we at least maybe want to set a goal of good communication and targeting of marketing in our clients to that segment of workers.'",
        "'speaker_4': 'Thank you both here.'",
        "'speaker_0': 'Thank you, Councilmember Lambert. Or maybe even some agreement, if it were going to be in that area that we buy it. We've made it so that over cost in all of our contracts it'd be really nice weather and whenever we are expecting housing to be built that we have some follow up dates that you know, five years'",
        "'speaker_0': 'from the date it's supposed to be down to three years. And if it isn't that there's a fine levied with that because I don't think that the follow up has been as good in the past on some of them to make sure we got all the units we thought we were going to get.'",
        "'speaker_0': 'So that's my concern. Okay. Thank you for that good discussion. And I just want responded Councilmember Gossett, and I appreciate your acknowledging those of us who have been working on this issue. But as always, the decision will be the bodies, what happens.'",
        "'speaker_0': 'And I hope that we can engage with your proposals and and do something in that regard. Thank you. All right. I think we're ready to move on to item number six. Are we? Very good. And that is a solid waste overview.'",
        "'speaker_0': 'So we're going to have a briefing now regarding King County Solid Waste System and the development and approval process for the Comprehensive Solid Waste Management Plan, which is the overarching plan that looks to the future and talks about how we're going to continue to perform this critical function.'"
    ]
}