{
    "A MOTION requesting the executive establish an equitable development initiative and prepare an implementation plan.": [
        "'speaker_0': 'Okay. Thank you. I write with that to our last item on the agenda is what we but we already mentioned and that is the FDI legislation. A motion introduced by Councilmember Dombroski, along with council members and me requesting the executive to establish a town wide, equitable development initiative with a priority on unincorporated area communities.'",
        "'speaker_0': 'And we've already been briefed on this twice the last two meetings. And we do have a new striking amendment that she was sent last night. And we have a central step, and I'm not sure that's an honest answer, Wendy, who we're going to turn to or Andy, but we will have a short briefing on this item, as'",
        "'speaker_0': 'well as the striking amendment before us and several line amendments. So with that, whoever our staff has been briefed is pleased. Please read it. And we do have Karen, Gil and I believe Kelly Rider with us as well from the executive branch.'",
        "'speaker_0': 'All right. Good morning. And all the council staff, Wendy Sue, who is also here to correct me if I get anything wrong. Sorry for the second string staff today. Jenny is out sick, so we're going to do our best.'",
        "'speaker_0': 'But we might have to refer to our notes a little bit more than she would have to. And I do also apologize. There are some errors in the document that were sent out as well as pointed out to you and as we'll become clear in a little bit.'",
        "'speaker_0': 'So the staff report is in the main packet. I'm not going to go through it. If there's questions, I probably can't answer them. But I will go through that packet which you were emailed by said at 612 7617, something like that.'",
        "'speaker_0': 'There is a striking amendment S-4 in the packet as mentioned in the packet, the amendment packet on page ten, there's a comparison matrix that compares the underlying motion to S-4 and the differences are shown with a highlight on that language and summary.'",
        "'speaker_0': 'And before you go on, I'm not sure if everybody is familiar with how it got to us. This is the S-4. We had S-1 that was presented to us earlier, and then as two and as three, I believe were being worked on by council members dombroski and up the group.'",
        "'speaker_0': 'But as for this represents a collaborative work and agreement. Is that correct? Anyway, I just wanted to point that out. Go right ahead. So escort would refine the scope of the initiative. Previously, the motion stated that the initiative is county wide in scope but should prioritize.'",
        "'speaker_0': 'Unincorporated area communities under arrest for the initiate would still be county wide in scope, but the planning group would make recommendations on how to prioritize unincorporated area communities. As for also the appointments to the planning workgroup, whereas the underlying motion is silent on appointments.'",
        "'speaker_0': 'Appointments are to be done by the executive in consultation with the Council through an open application process and consideration should be given to individuals with experience or expertize. Next S4 would include language stating that any new focus and framework principles of the motion would not apply to the Best Start's capital grants program.'",
        "'speaker_0': 'The Work Group and Executive are requested to recommend how the initiative, if adopted and implemented, would be informed and made collaborative with the Capital Grants Program. Escort would revise the requirement five, which is regarding identification of new and existing funding sources that could support anti displacement efforts, including community driven play space or cultural investments.'",
        "'speaker_0': 'Esper would revise the requirement to say that the. Executives should identify potential funding options for the initiate. A score would also revise a plan requirement to propose strategies to coordinate across county agencies and programs by removing language from the underlying to remove the specific references to BSA and the zero program score would revise the language regarding recommendations'",
        "'speaker_0': 'for a permanent advisory board. The underlying language specified determining policy and funding decisions as well as membership of Bipoc leadership. Do you have a graphic representation including unincorporated Kane County? Or would revise the requirement to state of the board, which should be a compromise of 13 representatives for select by the Executive and one by each council member'",
        "'speaker_0': 'or each council district. The escort also says that the appointment should emphasize emphasize bipoc community and those impacted by displacement pressure. And finally, as for revises the deadline for phase one, the phase one report from June 30th to August 31st of 2022.'",
        "'speaker_0': 'Let me I can go into we can answer questions now on the striker maybe, or I can go to the line amendments. Yes. Please let us sit there and questions from our council members. Apparently not. So go right ahead.'",
        "'speaker_0': 'I'm the one and only.'",
        "'speaker_1': 'I'm sorry, Madam Chair.'",
        "'speaker_0': 'Oh, I'm sorry again, Sue. I'm not sure who raised her.'",
        "'speaker_1': 'McDermott.'",
        "'speaker_0': 'Okay. No, I mean, earlier, Councilmember Perry also has a question about her council member, McDermott.'",
        "'speaker_1': 'Thank you. I'm just not too quick on the draw because I'm catching up to here for this morning. And was calling up the doc once when we were already. And so I'm playing catch up. Speak to me review for me again the the advisory committee make up in from the original language instructor for.'",
        "'speaker_0': 'Let me pull it up. But maybe one of the sponsors wants to speak to the attorney. We have a councilmember Dombroski.'",
        "'speaker_3': 'I can try on that, Madam Chair. Customer McDermott Thank you. Recall that there are kind of two groups envisioned by the motion. The first is the planning work group, and this Stryker for amendment accepts recommendations from a number of council members with the goal of getting that group formed so it can make recommendations fairly expeditiously.'",
        "'speaker_3': 'There's an interest in the community to, you know, get this program launched perhaps in time for some work later this year in the budget. So with respect to the work group, this I'm getting some feedback and maybe on your sharing that's okay.'",
        "'speaker_3': 'Maybe or maybe not there. But the work group would be appointed by the executive in consultation with the Council. There would be a lived experience and expertize requirements and it would be an open application process. Councilmember Perry So there's that.'",
        "'speaker_3': 'And again, the goal there is to have experience, have an open process and get it up and running relatively quickly in consultation with members on the permanent work group. It is recommended in the Stryker that we have a 13 member group for by the executive, nine selected by the Council, one each member.'",
        "'speaker_3': 'The appointment should emphasize Black, Indigenous and people of color and those most impacted by displacement pressures. There would be a compensation for their work. So we've gone, we've looked at a whole bunch of different models. My personal view is there isn't necessarily a white answer, just is that where members want to be on that, that's what the'",
        "'speaker_3': 'striking amendment recommends. I think the rationale for that comes from McDermott, if I can. It wasn't the prime promoter of this country. We're up the if he wants to speak to but the nature is of the of the legislation is that it's county wide in scope.'",
        "'speaker_3': 'But there are certain folks we want to make sure who are doing our work. And those are the folks with experience and impact from the bill that we're trying to address. So that proposed structure tries to to it to achieve a panel ultimately that that responds to those goals.'",
        "'speaker_3': 'My proposal earlier on in a prior striking amendment, I've lost track of which number it was, was to let the workgroup come to us with a recommendation on how the permanent group should look. Consistent with the philosophy of co-creation and empowering the community.'",
        "'speaker_3': 'You've been in this business a long time. Legislation is a is a compromise exercise. And so this is a compromise, Stryker, that puts together recommendations from a number of folks. That's how we got here. There are some thoughts on I hope that's helpful.'",
        "'speaker_1': 'Councilmember Tomasky It is, if I may ask, though. When? We talk about consulting with community and and involving community in the in the appointments to the advisory board has community had a chance to review this and what are their what are their thoughts and comments?'",
        "'speaker_1': 'I didn't hear testimony about Streicher for at all.'",
        "'speaker_3': 'I wouldn't speak on behalf of community. I although I think it's fair to say they probably would prefer to have a stronger voice in proposing to us. What the permanent panel would look like is my sense, to quote our chair, and this isn't even an ordinance.'",
        "'speaker_1': 'But those things. What do you think?'",
        "'speaker_0': 'Like anything we break with an ordinance we can fix with an ordinance, right?'",
        "'speaker_1': 'So I would say this is today's proposal. We're a long way from a permanent one.'",
        "'speaker_3': 'And there's always, as we just did with our I keep in mind, our public defense advisory board, you know, we set that up a few years ago. We've had some experience with it. We recently changed how we appoint members to that same on the Public Safety Advisory Committee.'",
        "'speaker_3': 'So I don't know that that's my long qualified answer to your direct question comes from McDermott.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'And just to respond to that as well, this is the third time we've met this measure. And there have been a lot of there's been a lot of work in between the three movements. And I commend Councilmember Dombroski and Councilmember Up the Grove in particular, because they had them the most disagreement.'",
        "'speaker_0': 'I believe when we started off this process. And so we've had a lot of meetings and working with staff and trying to refine the proposal as we've gone along. My intention is to have this on tape is to have action taken on this measure today.'",
        "'speaker_0': 'We can either do it with recommendation or without a recommendation to the Council, but that's where I am right now and I think we've come up with a good place. There are some amendments to the striking amendment and of course there would be opportunity for further ones at the council meeting.'",
        "'speaker_0': 'Councilmember Giovanni thisCountry would like to know to Councilmember McDermott's question and then we'll go to council member parents. Question.'",
        "'speaker_1': 'Thank you, Madam Chair. No, I think it's important to note we have two different work groups, and as Councilor Dombrowski noted, one of them remains the same with executive appointees so that it can be done quicker. The other one is a mix of executive appointees and council member appointees.'",
        "'speaker_1': 'And in both cases, they're encouraged to work with the community and follow many of the same guidelines. So it fundamentally is a difference in whether it's the executive or the council that appoints certain positions. And because there's more time to set up that advisory committee, I thought it was appropriate.'",
        "'speaker_1': 'And I actually felt strongly that if we're going to get to a point where we find new money and we're going to delegate the authority to appropriate significant funds to some appointees, then we ought to those of us who are the budgetary branch of government, I think it makes sense to have a direct say in helping select'",
        "'speaker_1': 'the community members, you know, using our judgment and trying to support the criteria established in here. I think we end up with something that is more directly accountable to the community and sort of it comes around the definition of community.'",
        "'speaker_1': 'You know, I really view my role as representing everyone in the community center, my work and communities of color and immigrant and refugee communities, and certainly intend to should this pass. And as a councilmember, get to have a direct say in suggesting someone tend to follow the criteria spelled out in here.'",
        "'speaker_1': 'But I think folks in the community have to go through a very formal process to select nine people to be their voice and vote. And I think if we're going to delegate that, I think it makes sense for us to play a role in that.'",
        "'speaker_1': 'Otherwise, we risk our constituents and our community broadly defined, not having as directly a voice in the policymaking. So that was previous work. That was kind of my thinking on why I brought some different ideas forward.'",
        "'speaker_0': 'I think the council member of the government, just as a reminder, this is a two step process and we have a working group, an advisory working group or I'm sorry, planning work group that will take part in making recommendations to the executive and to the Council for determining the comp, determining who will serve on the advisory board'",
        "'speaker_0': ', which would be the permanent. Group. Community group. Okay with that, Councilmember Perry. You're still muted. So. There. Oh, we still can't hear you. And you hear me now? Yes. Well, that's interesting. Okay. So I just had a couple of questions before talking about the amendments.'",
        "'speaker_0': 'I feel very strongly about the power of community and the respect of giving the power to the community in these situations. We got here because we haven't done that as well as we could. And so this is an attempt to do that outside of the controls in our hands, so, so overtly.'",
        "'speaker_0': 'I'm wondering if this prioritizes unincorporated Phil or no. Aaron. I didn't understand from the striker.'",
        "'speaker_1': 'Can I.'",
        "'speaker_0': 'Wonder if I answer.'",
        "'speaker_3': 'That? I'm sure.'",
        "'speaker_0': 'Yes. And this has been a continuing issue. And there are some of that is at least a couple of amendments that they are concerned about this.'",
        "'speaker_3': 'This is kind of one of the ultimate parody. Thanks so much for the question. I think it's a good one because one of the key issues we've been trying to work through and there's a lot of different views on this.'",
        "'speaker_3': 'You will recall that the original motion as introduced and a language I would call it fairly strong language that would prioritize our unincorporated area communities, even though the initiative is county wide in scope. This striker. The language that I have suggested here is that get in line two on the comparison.'",
        "'speaker_3': 'I'm using the chart a line to but it's paragraph a three in this shall be countywide in scope. And that's because to a large degree, the challenges we're trying to address here are countywide, but they are more concentrated in certain areas.'",
        "'speaker_3': 'And I think this tries to strike that balance in addition to acknowledging and standing up our obligation as a government with local responsibility to the unincorporated. So the language here says the planning worker was requested to make recommendations to the executive council regarding how to prioritize the initiatives work in unincorporated area communities, particularly historically marginalized communities consistent'",
        "'speaker_3': 'with King James responsibility as an unincorporated local government accountable. Rizal I was trying to honor by keeping that word in there something I think that you cared about the prioritization of unincorporated communities. And I, I that's that's that's is that's where we are on it trying to hold that notion that we are the local government.'",
        "'speaker_3': 'We do have responsibilities. Ask our workgroup in the spirit of co-creation, to talk to us about how we should prioritize. I think there may be amendments on this language. I can't recall to to modify that. But Councilmember, as all I was is an original sponsor, that was an important part of his work.'",
        "'speaker_3': 'He can speak for himself, but I hope that I'll get a shared reminder. And so I was trying to be true to and honor that for him as a co-sponsor. And it's a little softening. It's a little broadening from the original language.'",
        "'speaker_3': 'But that's that's that's where this Stryker.'",
        "'speaker_0': 'Thank you, counsel, and maybe even more of a response. Councilmember Perry. I would. Right now we're we're asking questions of staff or other council members, and then we'll go on to know about that. The other question I have was whether the permanent group also had an open application process.'",
        "'speaker_0': 'That wasn't clear to me if that was removed or not or added. It's not in the language in S4. Thank you. This could be included in the recommendations. Okay. Are there any other questions now of staff or of our sponsors, council members online?'",
        "'speaker_2': 'Thank you. Chair Caldwell. The unincorporated priority. So maybe it's just the understanding question. But when we say we're asking the advisory committee or or is the planning group trying to remember which one it was? Plan planning the plan of what?'",
        "'speaker_2': 'We ask the planning group to determine how to how to prioritize unincorporated King County. When I read that, that sounds like we are not directing them to prioritize on an Inc. King County. It almost sounds like it's asking whether to prioritize unincorporated King County.'",
        "'speaker_2': 'But maybe it's just a semantics question. When we say how to prioritize unincorporated King County, are we saying, yes, it is a principle of this motion to prioritize unincorporated King County. Now tell us how to do it. Or is it saying.'",
        "'speaker_2': 'Whether to prioritize at all. I think I'm just not understanding the the reading of it public.'",
        "'speaker_3': 'Councilmember. Madam Chair, may I respond to that.'",
        "'speaker_1': 'As.'",
        "'speaker_3': 'The word I chose? Councilmembers on Hawaii is the phrase I chose is how to prioritize, not whether and to do it consistent with our responsibility as a local government in the unincorporated area. I think whether to to to prioritize has an entirely different meaning.'",
        "'speaker_3': 'How presumes that we want to and we're asking them how to do it.'",
        "'speaker_2': 'Okay. So that's I think that's the point that I'm trying to clarify. Councilmember DEMBOSKY, when you say how to prioritize, does that already presume that we want them to prioritize? I guess it's just the English language question for me.'",
        "'speaker_2': 'I don't know.'",
        "'speaker_3': 'The answer is yes.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. Are there any other questions as for a staff or other council members? Okay. And would you please go ahead now and brief us on the line amendments. Sure the line amendments in the packet. Certainly looking at the PDF files Amendment ten by Councilmember Perry would revise the Planning Workgroup and Permanent Advisory Board composition to have'",
        "'speaker_0': 'equal geographic representation and adds consideration for individuals with lived experiences and expertize relevant to the initiative. Are there any questions there?'",
        "'speaker_3': 'Dombrowski.'",
        "'speaker_0': 'Huntsman of Denver in the starting line.'",
        "'speaker_3': 'So could you just help us understand what the process would be and how it would be different under this amendment if adopted versus the structure for.'",
        "'speaker_0': 'The Hummingbird Group under the Stryker is appointed by the executive in consultation with the Council of that remains. I'm sorry. On the previous question in S4, it does say there's an open application process for the planning worker. Correct.'",
        "'speaker_0': 'But the S4 says. It should be. The planning group is comprised of community membership emphasizing bipoc leadership and broad geographic representation and the. The Amendment Ten says that the executive strives to appoint an individual from each council district who is from the Bipoc community and has lived experience expertize relevant to the initiative or issues leading to displacement'",
        "'speaker_3': '. So this amendment only pertains to the first group, the planning workgroup?'",
        "'speaker_0': 'Yes. Okay. Right? Yes. Yeah.'",
        "'speaker_3': 'But does it include consultation with the council? Yes.'",
        "'speaker_1': 'Yes, it does. Okay.'",
        "'speaker_2': 'But I just want to clarify. Madam Chairman.'",
        "'speaker_0': 'Yes, go ahead.'",
        "'speaker_2': 'Thank you. So the summary says, yeah, the summary of the amendment says revises the planning workgroup and the permanent advisory board composition. So I think it's it's related to both. Is that right?'",
        "'speaker_0': 'The language doesn't actually change the permanent advisory board.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'That is a that's amendment five.'",
        "'speaker_2': 'Oh, okay. Yeah.'",
        "'speaker_0': 'Okay. Skipping number line amendment 24. I mean, I'm sorry, Councilmember McDermott. And on something.'",
        "'speaker_1': 'Thank you, Madam Chair. The. I'm sorry. Maybe I was reading the wrong one. I was reading the summary, and then I go find the page itself and I'm not seeing the same thing.'",
        "'speaker_0': 'The summary is wrong. So the text is right. The summary is wrong.'",
        "'speaker_1': 'The summary order. Thank you. Summary on the amendment tracker or the summary on the page.'",
        "'speaker_0': 'Who's fighting, by the way?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'Sorry, the tracker was wrong. The summary on the tracker is wrong. Don't look at the tracker.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'And count towards the top on Amendment ten, where it says Planning Workgroup and Advisory Group. If the actual language only applies an amendment to the Planning Work Group as the effect statement that accurately says.'",
        "'speaker_0': 'And then.'",
        "'speaker_1': 'I'm sorry, I'm not sure what I'm trying to ask a question about. Amendment 20 oh 20 oh oh. I'm sorry.'",
        "'speaker_0': 'We've been taken.'",
        "'speaker_1': 'I'm sorry. You're right. We're I'm ten.'",
        "'speaker_0': 'We're doing great. So the information, the summary on page one out of just six pages is incorrect. On amendment number ten, in that it includes the composite composition of the permanent advisory board and that is not included in the actual amendment.'",
        "'speaker_0': 'You might look at the summary that is on page 14, the effect statement, and that pertains to what is an amendment number ten.'",
        "'speaker_1': 'I'm reading the actual text of the amendment on page ten now, not the effect statement.'",
        "'speaker_0': 'And then amendment number ten is on page 14.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'So with this in front of me, please remind me how many members are part of the planning work group.'",
        "'speaker_3': 'As remote. Under the striking amendment, the size of the planning workgroup is not set forth. Amendment ten, as I read it, would have the executive strive to appoint an individual from each council district. So that gives you some.'",
        "'speaker_3': 'It doesn't require it, but there's a striving. Got the right customer. Very. So I think.'",
        "'speaker_0': 'That's going to be a big challenge. May I speak to the Madam Chair? Me chair calls me to speak to them. Of course. So it's intention. Thank you. Circle Wells. The intention of this is to recognize that this is a county wide focus as opposed to Seattle.'",
        "'speaker_0': 'This intends to be EDA for King County. So the intention is that there is representation from the Bipoc community, lived experience expertize in these areas from each of the nine districts, and that that would be done in consultation with the count, with the Council, with that exact and and that that part holds the intention of the community'",
        "'speaker_0': 'itself representing the full breadth of the county for decisions that the workgroup is making about the toward the permanent group. So in the inception of this together that we have as many representatives from a representative from each district.'",
        "'speaker_0': 'But in the initial setup of this feels that it is in keeping with the. Intention of of of keeping the power in the work group and that the voice is throughout the county. And then the emphasis is whatever that workgroup determines to be the best emphasis given their priorities.'",
        "'speaker_0': 'Having vague language. Vaguer language runs the risk of defaulting to what we've always done. Frankly, Councilmember Karen. Councilmember McDermott, did you have anything else? Thank you. Councilmembers thoroughly.'",
        "'speaker_2': 'Thank you. Charcoal wells. Can somebody remind me how this amendment compares to what's originally in the motion around the Planning Workgroup Planning Workgroup originally has the executive appointing everyone in the planning workgroup. Is that right? And this one says the executive has to appoint one person from each district.'",
        "'speaker_0': 'Strike two.'",
        "'speaker_2': 'Yes. Strikes to.'",
        "'speaker_0': 'The. But the underlying and as for talk about having geographic representation, including unincorporated in Canada. So this just strengthens that language to strive to make it specific.'",
        "'speaker_2': 'And yeah, I'm going to be a no on this amendment just because I don't think it needs to be that strict around one for one for each council district think there's a way to get geographic representation and making sure that we're having equitable representation in areas from areas that are at high displacement risk.'",
        "'speaker_2': 'And I just don't think it needs to be that coordinated for 1 to 1 representation from each council district.'",
        "'speaker_0': 'Thank you. Thank you, Councilmember Belgium. Thank you. I think I answered my own question. I was having a hard time, along with others, tracking what each amendment actually did. And I think it's I think I'm just I'm repeating something you already talked about, which is that the summaries in the chart don't seem to match the actual, but'",
        "'speaker_0': 'the summaries on the individual amendments seem correct.'",
        "'speaker_2': 'Yeah. It's not as you sort of.'",
        "'speaker_0': 'Thank you. That's why I suggested you look at page 14 for Amendment number ten. Okay. Are there any other questions to staff or new in a House? An amendment number ten. And we will, of course, have time for the sponsors of the amendments, including the striking amendment to to give back comments.'",
        "'speaker_0': 'But this is more just questions on what the amendments entail. Okay. Let's because. It has to do with the advisory board. And let's skip to amendment number 25. Okay. Amendment 25 the links on page 16 of the PDF Packet.'",
        "'speaker_0': 'It revises the plan requirement regarding recommendations for the Permanent Advisory Board. To include the recommendation would include for compensation, duties and responsibilities, job application process, appointee selection process compensation and other considerations, and should account for the county wide scope of the initiative that considers appointing representation from bipoc communities with experience or expertize.'",
        "'speaker_0': 'And as far as I can tell, Aaron, there's no discrepancy between what is in the effects on page 16 and what is in the list of the amendments on page one. Excellent. One last thing. I have to apologize, but that's okay.'",
        "'speaker_0': 'Are there any questions of Aaron on this amendment? DEMBOSKY Councilmember DEMBOSKY, thank you.'",
        "'speaker_3': 'I'll set this up with a quasi statement. As I understand the effect of this. It would take out the ability of each council member to make one of the nine council district appointments and achieve that goal with them with a deferring to the planning workgroup to tell us how to do that.'",
        "'speaker_3': 'Right.'",
        "'speaker_0': 'And in group, yeah, they would give the planning group more power in.'",
        "'speaker_1': 'There.'",
        "'speaker_0': 'Recommending how the permanent advisory board should be staff.'",
        "'speaker_1': 'Members that should have it.'",
        "'speaker_3': 'Would it still require that their recommendation include a way to have representation from each council district, as I'm kind of reading on lines eight nine.'",
        "'speaker_0': 'Yes, occupation should account for the county wide scope, including representation from each council district, from bipoc communities without experience or expertize. And these are recommendations that would be made. That's true. And that's the case for Oscar as well.'",
        "'speaker_0': 'Okay. Any other questions. So staff. Council member, Perry. Thank you chair call. Well, so this this is was there an open application process for the permanent work group or does this establish that? That's correct. This. Your limit what is correct during the process?'",
        "'speaker_0': 'Yes. Your your amendment adds the open application process, which is not called out in the in the striker. For the.'",
        "'speaker_1': 'Advisory group.'",
        "'speaker_0': 'Thank you. Thank you. Are there any other questions customers want?'",
        "'speaker_2': 'Aaron. First of all, sorry to keep putting you in the hot seat with all your questions, but can you remind me in the original legislation, I know we had included overall priority for unincorporated King County, but in terms of the planning groups and the permanent advisory board, were there.'",
        "'speaker_2': 'Was there anything spelled out in there with respect to unincorporated King County?'",
        "'speaker_0': 'The underlying motion references geographic representation, including unincorporated King County. And look at these 13 of the pdf, you can see the Aboriginal language.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'It's line 18.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_2': 'Okay. And so the this amendment no longer references unincorporated King County. Is that right?'",
        "'speaker_0': 'That is correct.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So this amendment. Councilmember Perry. Charcoal. Well, all right. Thank you, Taco Bell. Thank you. It was intending to so very that that didn't happen. I thought that it was already referencing unincorporated King County and that this was tightening other areas.'",
        "'speaker_0': 'But the assumption was that it would that unincorporated King County was already referenced in the permanent work group. But that is not the case of that area. That's right. Well, that's unfortunate. From.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Councilmember Dombroski.'",
        "'speaker_3': 'I was just going to say, there's there's always time for refinement between today and two weeks from today or three weeks plus.'",
        "'speaker_0': 'But. Are there any other questions? None of. Okay. And again, we're holding our comments and efforts and persuasions until after we go through just the staff briefing and what is actually in the amendment. So not let's now go to amendment number 20, which I have sponsored.'",
        "'speaker_0': 'Okay. Amendment 20, which is on page 15 of the media. This is from Councilor Wells. And it would mark what's about the scope of the initiative and require that the planning group, it changes it from how to prioritize the initiatives work in the unincorporated area communities to setting a rules on the extent to which the initiatives work'",
        "'speaker_0': 'will focus on these two. Thank you. And are there any questions to bear on this amendment? Councilmember Salam.'",
        "'speaker_2': 'Thank you. Charcoal Wells. I don't think I understood what the amendment does. You can repeat that there may be charcoal wells. If you could speak to the intent to maybe that would hurt.'",
        "'speaker_0': 'And I would put a to and if I don't have the wording quite radically. And we can of course suggest that. But first of all, this amendment recognizes something you brought up councilmember satellite earlier, and that is semantics.'",
        "'speaker_0': 'And in each of the previous two meetings of the committee, we discussed this issue of what does priorities mean, what does prioritization mean? And we best KIRN and Kelly about this. But to me that's been a confusing term.'",
        "'speaker_0': 'And so this amendment keeping in line with what you referenced so it's a how to not of whether or not there is any special consideration for unincorporated areas of the county. But this amendment, instead of saying how to prioritize the initiative is work and unincorporated and you know these would ask the working group, the planning and work'",
        "'speaker_0': 'group to come back with recommendations on the setting of goals and the extent to which the initiatives work will focus on these communities. So instead of saying prioritize it, saying to what extent will this focus on unincorporated income, I think that makes a lot more sense.'",
        "'speaker_0': 'It's still a recommendation to the executive and to the council, but I think gives more leeway to the planning workgroup to come back with a statement, a recommendation. So what should we do in terms of making sure that unincorporated King County has the focus?'",
        "'speaker_0': 'And it's a little looser language, but I think prioritizing is a term that just is not clear at all. So it's semantics.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'You're welcome. Are there any other questions of staff and this amendment? And again, it's found on page 15. Councilmember Sally.'",
        "'speaker_2': 'Turquoise. Will we be able to ask about prior amendments or are you only looking for Amendment 20 questions right now?'",
        "'speaker_0': 'Oh, well, this right now is for amendment number two, certainly. But first, let's see if there are any other questions on amendment number one. Okay. Councilman Masala, you have a question on another amendment.'",
        "'speaker_2': 'Yup. Thank you. Going back to Striker S-4, there is a portion that says the unincorporated focus and framework principles of the motion would not apply to the best starts for Kids Capital Grants Program. I'm fully on board with the unincorporated focus, not applying to the BSC, and I'm actually going to propose likely a verbal amendment later on'",
        "'speaker_2': 'that would just have a simple amendment that says the unincorporated focus will not apply to the BSC Capital Grants Program. But I had a question about that. And here it says Unincorporated focus and framework principles of the motion would not apply to the BSA councilmembers.'",
        "'speaker_0': 'I'm sorry to interrupt, but which page are you looking at?'",
        "'speaker_2': 'Oh, sorry. I'm just looking at the. The striker. Sorry. The amendment summary list no less, which I think I was told not to look at your.'",
        "'speaker_0': 'Guidance on page one.'",
        "'speaker_2': 'Yeah, it was on on page one.'",
        "'speaker_0': 'If you look at age 11, you can see the language there at the top of the page as well.'",
        "'speaker_2': 'Perfect. Okay. So. Page 11. In focus or framework. Principles adopted by this motion shall not apply to best starts for Kids Capital Grants Program. So again, I'm on board with the unincorporated focus not dictating how BSC is distributed.'",
        "'speaker_2': 'But can somebody speak to any new focus or framework principles? I'm assuming that concept is not related to just unincorporated, but I'm reading it as saying none of the frameworks or principles in this entire motion will go on to determine how the scale is dispersed.'",
        "'speaker_2': 'Is that an accurate reading?'",
        "'speaker_0': 'To be.'",
        "'speaker_3': 'Able to help on.'",
        "'speaker_0': 'This. Yeah.'",
        "'speaker_1': 'All right, then.'",
        "'speaker_3': 'And give me just a minute here. In the best starts for kids Levy, we included a capital grants program. The capital grants program is delineated what its goals are, how it will be distributed is delineated in the best outcomes for kids implementation plan.'",
        "'speaker_3': 'And it's actually quite specific, customizable in terms of its goals and the types of projects that are prioritized are all set forth there. And of course that went through the Regional Policy Committee and of course the levy was approved by the voters.'",
        "'speaker_3': 'So at the very end of the work of the Best Arts for Kids Implementation Plan section there, it says if the county adoption EDI, it may inform and collaborate. Those are kind of the two words with this capital grants program.'",
        "'speaker_3': 'So in this motion, which is not adopting an idea, it asks the executive to propose one. This motion does include some framework principles to be consistent with the language that is in the Best Start's for Kids Capital Grant Implementation Plan.'",
        "'speaker_3': 'It went through the whole council process, Regional Policy Committee process. What the language and score does is say, Hey, you can't use this motion. And the framework principles enumerated here to guide the best decade capital grants program is over there.'",
        "'speaker_3': 'In that implantation plan, we said it has to be an EDI, not a preliminary motion, but we asked the work group to look at that language over there in the best capital grants and tell us how this initiative, if adopted, would inform number one.'",
        "'speaker_3': 'That's the language again we're picking up and how it would collaborate with those two things. So we are trying to in this language, I am trying to not add new layers or new requirements to the be a state capital grants program, but be true to the signal it sent.'",
        "'speaker_3': 'If we do and EDI to do the two things, inform and collaborate. This language is carefully crafted to do those things importantly. They became capital grants program. I think the language is, if you look at it, those moneys will be distributed through escape capital.'",
        "'speaker_3': 'It is not a funding mechanism for the for this new FDI initiative. They they are envisioned to work together in in information, in informing and collaborating. But one main thrust or thrust of this idea initiative is to get permanent, sustainable, adequate funding for it.'",
        "'speaker_3': 'And we asked them to do that. So that's a it's a complicated area. It's taken a lot of work to kind of basically look at the language and to to get to this position here. And that's kind of the best I can explain it.'",
        "'speaker_2': 'Thank you. I guess going back to a semantics question again, which is how can best capital grants program be informed by and made collaboratively with a county EBI program while simultaneously rejecting any new framework or framework principles that come from that TBI program?'",
        "'speaker_3': 'Good question. And I didn't explain it. Well, clearly, this language says any new focus or framework principles adopted by this motion, and this motion doesn't establish any program. So there are some framework principles up in the motion. What we're saying is, hey, don't, don't apply these over to be okay.'",
        "'speaker_3': 'But if we go proceed and adopt the E.D. program, it may have some principles, it may have some frameworks. And those should, quote, inform the break up of that program, because that's what we asked that it do over in the back half of that program.'",
        "'speaker_2': 'Gotcha. So once the executive. Branch does what we're asking them to do, which is implement an EDI program, then that EDI, I would go on to inform and be made collaboratively with the BSC funds. But you're saying at this preliminary stage as just a motion asking the executive branch to create one?'",
        "'speaker_2': 'At this stage, any principles or frameworks that we're implementing at this stage should not. Fine. The best. Is that right?'",
        "'speaker_3': 'That is correct. With the slight modification that it may require council approval to ultimately establish the idea. But the timing is exactly right, Councilmember Sala.'",
        "'speaker_0': 'Are there any other questions? And the amendments. I would like to point out one thing and look at page one, which is the tracker chart. And for us for the second part or a dash of them, it's incorrect.'",
        "'speaker_0': 'And it's actually the running, which is actually my reflex, my amendment amendment number 20. So that just write that up. Cancel it out doing that. That's. Is that correct? Yes, it is. Yes. Okay. Don't use the tracker. Right.'",
        "'speaker_0': 'Okay. Are there any other questions? Aaron. I would like to hear from either or both Con Gil or Charlie Ryder and start having questions when I see that Mr. Hashimi is on with us as well. If anybody has some questions of them and then we'll give the opportunity if they were want to ask questions and comments.'",
        "'speaker_0': 'Any of our council members or committee members have questions of them.'",
        "'speaker_3': 'Councilmember Thomas councilor was all. I had his hand up first. I'll follow.'",
        "'speaker_0': 'Him. Oh, I'm sorry. I went to the next.'",
        "'speaker_3': 'House on the screen.'",
        "'speaker_2': 'It's all good. Rod, please feel free if you want to.'",
        "'speaker_1': 'Now you.'",
        "'speaker_3': 'Jump in.'",
        "'speaker_1': 'I to me.'",
        "'speaker_2': 'All right. But I have kind of a complicated question for Karen Baena, but hopefully not putting you too much on the spot. But one of the big concerns that I have with an FBI motion that removes an explicit priority for unincorporated King County, is that an edict without an explicit priority for unincorporated King County?'",
        "'speaker_2': 'Or maybe a soft and one could disrupt all of the great work our executive branch has been doing lately in unincorporated King County. You know, it feels like there's been a lot of momentum in the past couple of years to actually do the great work we need to do around and tie displacement measures in the neighborhoods where'",
        "'speaker_2': 'we have land use and zoning power in neighborhoods that have been disinvested from for a long time. And so we have sub area plans going in places like White Center and Skyway. We have this suite of anti displacement initiatives coming from DHS at the moment.'",
        "'speaker_2': 'We have made some investments in the past couple of years, so feels like there is really a lot of momentum around keeping these neighborhoods, these communities intact in the places where we have land use and zoning authority in areas that have been disinvested from for a long time.'",
        "'speaker_2': 'Do you think current that if we put forward a motion and any motion that softens or removes unincorporated priorities, does that threaten any of the work and investments that we've been doing around unincorporated areas, anti displacement efforts?'",
        "'speaker_1': 'Thanks. Thanks. Councilmember Gringo from the Executive Office. I don't believe so. Councilmember Kelly, I don't know if you want to add anything on that from.'",
        "'speaker_2': 'The amputation side, but I don't believe so.'",
        "'speaker_0': 'Sure. Thank you. Kelly Rider, government relations manager for the Department of Community and Human Services. It certainly would not threaten our goals of implementing our commitments to stay way west on our line. I think the one tension that the department will continue to face is that this equitable development initiative effort is being stood up prior to funding'",
        "'speaker_0': 'for the program, which means that our staff does not have a dedicated team that can be committed to implementing this authentic community engagement work, as well as the work to develop and devise a program and funding model. And so the tensions of our staff's timelines and commitments is the one piece that we will be tracking closely and'",
        "'speaker_0': 'how to make sure that we are meeting the Department's many commitments to many different priorities. We'll continue to be a challenge that we want to talk with community and council about to be able to achieve all of the things that we have set out to do, including commitments to unincorporated Canyon.'",
        "'speaker_2': 'Thank you both.'",
        "'speaker_0': 'And 2 minutes, I'm sure this minute her anything she would like to add. No. Nothing else for me. Thank you. Okay. Thank you. Who just spoke?'",
        "'speaker_3': 'Dombrowski.'",
        "'speaker_0': 'Councilmember Dombrowski.'",
        "'speaker_3': 'Thank you. In the form of a colloquy to make a legislative record with respect to intent in response to council members. On the last question, Councilman Brazile, I view this as additive to the overall word and and offering additional support to the unincorporated communities.'",
        "'speaker_3': 'Frankly, it's why I've kind of held on to that prioritized word. I knew it was important to you. And even if that doesn't stay in, if Councilmember Cole Wells's amendment were to be moved in, adopted. I still think, given the language regarding our responsibility as a local government, that this will continue to be additive no matter the'",
        "'speaker_3': 'form it comes out of here. And so, Kelly, thank you for those comments. I think that was a gentle way of saying our $50,000 that our office requested in the budget for a consultant to help do this work with community may need a little juicing.'",
        "'speaker_3': 'And we can we can work on on that in the event that that this proceeds.'",
        "'speaker_0': 'Very much as a member here in Boston, i would like to echo that. I totally agree with what Councilmember Dombroski about the language being added to the whole purpose of this. One of the main purpose of the evening is to have funds and go to the unincorporated parts of the county.'",
        "'speaker_0': 'And that is why I saw Guyana's response to the shelter, to the motion, and also our foot in this amendment, number ten. I think it will just give us a little more clarity, but it's all within the lines of having having focus on the unincorporated parts of the county.'",
        "'speaker_0': 'Is there anything else, Councilmember Perry? Go to her. Can you hear me? Yes. Okay. Thank you. Jericho. Well, they appreciate that regard to the funding of it again, 60, 62. Can you help me understand, is it the intention that this EDA be funded through previously designated or previously designated funds within the King County budget, or that these'",
        "'speaker_0': 'funds come from outside of King County private, public, private partnership? Or where do we see these funds potentially coming from? And would you like to respond to that? Or should we have Councilmember Dombroski as the lead sponsor do that?'",
        "'speaker_0': 'I think the motion calls for the executive to make recommendations on the funding.'",
        "'speaker_3': 'You know, line 14 from the chart. We've simplified the language in Stryker for to say, identified potential funding options for the initiative that could be county money passed through money from the feds or state level money or public private partnership money.'",
        "'speaker_3': 'My goal there was to take the handcuffs off, explore all options.'",
        "'speaker_0': 'Very good. Thank you very much. Are there any other questions of anybody I can or minor or Kelly, do you want to make comments about what we are discussing now in the way of S-4 and the amendments? Can I see your immediate?'",
        "'speaker_1': 'Sure. Thank you, Madam Chair.'",
        "'speaker_2': 'Colonel Gill, again from the exact office. Are this all.'",
        "'speaker_1': 'Workable from an implementation perspective? The only.'",
        "'speaker_2': 'Thing we'd add is that we'll be.'",
        "'speaker_1': 'Well in the March final.'",
        "'speaker_2': 'Passage, so the current August 31st.'",
        "'speaker_1': 'Timeline is likely going to be extremely challenging. So we'll just keep communicating with counsel as.'",
        "'speaker_2': 'We get closer to that date.'",
        "'speaker_1': 'And may need to request an extension and make sure.'",
        "'speaker_2': 'We get this important work with community done right. So I just wanted to throw that plug in there.'",
        "'speaker_0': 'Thank you. Thank you. Do you see anything problematic outside of that date and then ask for and or the amendment line amendments.'",
        "'speaker_1': 'Not from an implementation for effective councilmember? No.'",
        "'speaker_0': 'Okay. I'm telling you, you're going to need to come up with that. Is there any other question? And then we'll get into comments. I would appreciate having a motion made to move Cuoco's motion 2020 10467 consolidate the basket.'",
        "'speaker_3': 'And move adoption with a do pass recommendation of 20 1046702.'",
        "'speaker_0': 'Thank you. And would you like to make a motion to move striking amendment?'",
        "'speaker_3': 'Yes or yes, ma'am. Move S-4.'",
        "'speaker_0': 'Yes, ma'am.'",
        "'speaker_1': 'I just feels like I better say that at this.'",
        "'speaker_0': 'Point in my life that I.'",
        "'speaker_1': 'Not I'm not to get busted.'",
        "'speaker_0': 'Okay. Thank you. And we would well, I guess we'll go right to the line amendments unless you want to have been stolen.'",
        "'speaker_3': 'Let me just set a few mugs out, Madam Chair, start by saying how much kind of fun this is. Frankly, from a legislator's perspective, to see all of our colleagues engaged with seriousness and sobriety, reflection and deep, you know, focus on the words here in this legislation and the goals that we're trying to achieve.'",
        "'speaker_3': 'And and kind of the importance of this. Let me start big picture, the First Amendment to the United States Constitution, the First Amendment, the Bill of Rights talks about a fundamental right being the right to petition the government for the redress of grievances, the right to petition our government for the redress of grievances.'",
        "'speaker_3': 'This legislation got started because community members came forward to petition the government to say, Hey, King County, we've got a grievance. For a long time, folks without power, without money, haven't been at the table adequately. And some stuff going on in our community and we fear more things are coming with respect to displacement, limited opportunities and lack'",
        "'speaker_3': 'of affordable housing that we're very concerned about as this region grows in wealth and grows in population. And we've seen it happen in other communities and we'd like some tools from the county to help combat it. I thought that in public testimony, Maria Guadalupe Biggs from the Boulevard Park neighborhood said it pretty well.'",
        "'speaker_3': 'Councilor McDermott, I think one of your constituents when she said we've looked at our community from the developer's perspective and we don't like what we see coming, that they have their own ideas about what they want to see in our community, in international law.'",
        "'speaker_3': 'Councilmember Cole Wells And you're a somewhat of an expert on international and human rights law. There is the principle of self-determination. This legislation to me at its core is about King County partnering with community that has come forward to empower them.'",
        "'speaker_3': 'To make in their own way with self-determination principles, a map and a vision for what they want their community to be, to how they want it to grow. And so one of the principles is co-creation here. And you heard another presenter in the testimony talking about doing things a little a little differently and granting power to community'",
        "'speaker_3': '. And that's the big picture thrust of this. We've seen some examples at our Seattle partners where they have a done this work and are standing it up with some good results, early results with folks being able to buy buildings and keep community organizations in place.'",
        "'speaker_3': 'We heard from Ceasar Garcia, who runs the Lake City Collective up in my district about what it meant for them as a very small Latino community group representing a growing and diverse Lake City population, to have a little help from the city of Seattle to get a space.'",
        "'speaker_3': 'And I've been there multiple times and seen the power of that space to collect and gather people and to be a center for conversation and visioning, for improving a little ballpark, for hosting vaccine events or getting books out to little kids so they can read to distributing masks and the growing economic opportunity.'",
        "'speaker_3': 'This legislation is brought forward in that spirit to partner with, but more importantly, to empower community. With self-determination principles and some money to achieve that vision, hopefully. How do we get there? Well, these are serious conversations. And if you have a serious program, it takes some time and some work.'",
        "'speaker_3': 'One of things I learned when we were working on establishing the Immigrant and Refugee Commission from my chief of staff, Christina Logsdon, who's worked really hard on this, was I don't always get to decide. I don't always get to do what I want to do.'",
        "'speaker_3': 'I said, why can't we just establish the commission so that.'",
        "'speaker_1': 'That's how it works?'",
        "'speaker_3': 'Ask the committee to tell you what to ask the community, to tell you what they want in a commission. And we did a two step process there. We had a workgroup. The workgroup came forward with recommendations. Today, we have a very strong King County Immigrant Refugee Commission that's helping us work through policy areas there.'",
        "'speaker_3': 'This legislation follows a similar process. The community has come to us with a need. We're trying to respond in our response. We're asking them to help us build a system and build a structure and build an initiative that is responsive to their needs.'",
        "'speaker_3': 'So we have this workgroup. We want to get it going. We want to have a broad participation. We want to have equal opportunity for folks to apply. We want to have them have experience and expertize. I think this legislation in its current form, or maybe even as modified, gets there, we give them some money.'",
        "'speaker_3': 'It's already in our budget. We may need a little more. Kelly, thanks for letting us know about that. But there's some money for consulting to do that. And we ask them to come back with some recommendations on what a permanent, equitable development initiative might look like, what its principles would be, how it would be funded, and where'",
        "'speaker_3': 'it would do its work. I really, really like seeing everybody participating here to get them to bring forward their ideas and bring forward their suggestions. One of the reasons this has taken some time is because there is a lot of interest and there's a lot of different perspectives.'",
        "'speaker_3': 'And I think on the whole, that's good. And so I thank you all. I hope we can advance this. I don't think there's necessarily right or wrong answers to a lot of the questions. But I think the big picture to keep in mind is that this is an important obligation that I think King County putting on our'",
        "'speaker_3': 'equity and social justice lens here to this work. We have an obligation, I feel, to be responsive when we've been petitioned for a redress of grievances from redlining to institutional racism to structural racism, to frankly, you know, just a lot of power differentials that have that have accumulated with some adverse results.'",
        "'speaker_3': 'This is not a solution or a tonic to all of that, but it is a piece of the response. It is a piece of the response. And I'm optimistic and hopeful that we'll be able to advance it in one form or another and some good work will come out of it.'",
        "'speaker_3': 'So I think the folks who came to us, they've worked very hard with great intention and I thank my colleagues for their hard work on it. Councilman Raquel Wells As Chair of this committee, I thank you for doing what you always do so well, bringing us all together, making us me, making this work through the issues in'",
        "'speaker_3': 'the legislative process and seeing if we can advance it. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Dombroski. So the motion has been made to move the striking amendment. And we heard Councilmember Dombroski is, I think, willing extending comments about what was the mother's intent behind this suspension and what it can accomplish.'",
        "'speaker_0': 'We do have three amendments to this striking amendment. Councilmember Cleary, would you like to move your amendment number ten? Thank you. I love Amendment number ten. Thank you. Councilmember Perry, would you like to speak to it? Thank you, Chair Colwell and committee members and all participants.'",
        "'speaker_0': 'I am interested in doing whatever is possible in our end to the extent that we have that opportunity to build the community voice collectively. And to that extent, I would encourage everybody to consider the opportunity to have an open process where everybody participates in each district throughout King County, not just a wide geographic.'",
        "'speaker_0': 'If we are left to their own devices, we are not as apt to find a current course that is comfortable for us. And so having an opportunity to have being spelled out as councilmember. So I mentioned really emphasizing unincorporated can have an effect in how we think and emphasizing somebody from each district, from our bipoc and communities'",
        "'speaker_0': 'have lived experience or expertize in this area that there is a really strong advantage to that collective powerful conversation in this conversation, in this work group. And so to have the opportunity for everybody to feel like they are their voices is will be considered as part of this workgroup and that they have the same opportunity as all'",
        "'speaker_0': 'districts. And then together they form the priority of where they are looking. The emphasis is not intended to to distribute the focus, but to consolidate the community power of this. By having broad representation defined as representatives from each of our districts.'",
        "'speaker_0': 'I hope that that will be something that will be considered by by the folks here today. And and that it is in keeping with building that strong, powerful community throughout King County and starting this work group together toward the permanent work group.'",
        "'speaker_0': 'Thank you very much. Councilmember Pare, are there any comments concerning this amendment? Now I'm all in favor of amendment number ten, please. So I. I suppose so. Learn it.'",
        "'speaker_1': 'You may.'",
        "'speaker_0': 'The amendment has not been adopted. Want to? I'd like to have a motion to move. Amendment number 25. Councilmember up the growth.'",
        "'speaker_1': 'I'm sorry. I'm not seeing amendment. I see Amendment 25 as Perry.'",
        "'speaker_0': 'Okay. You're right. I skipped that.'",
        "'speaker_1': 'One.'",
        "'speaker_0': 'Maybe less, and it would.'",
        "'speaker_1': 'Be happy to move that as a courtesy for you, Madam Chair, I move adoption of Amendment 22.'",
        "'speaker_0': 'Council member up to go, and I am offering this amendment in the spirit of making sure that there are efforts among the planning worker to communicate to the Executive and to the Council and importance of ensuring that the unincorporated area is included in terms of the goals of the initiative.'",
        "'speaker_0': 'So this is a matter of semantics. And as I mentioned earlier, I think the term priority means prioritization is an not one. It is for me and everyone I've spoken with said the same thing. How is that translated?'",
        "'speaker_0': 'How is that implemented? This still gives the opportunity for the planning and work group to provide the input, setting goals and also the extent of which the initiatives work will focus on unincorporated areas of the country. I am a sponsor of the legislation that is the decree in support of it.'",
        "'speaker_0': 'So this is really is so a minor way to try to perfect the language. So with that, are there any other comments on this amendment? Consumer attention. It's a question, not a comment. There's been a lot of really good discussion here today.'",
        "'speaker_0': 'And I just want to be clear that I am focused on this point in this moment when we're about to vote. So could staff remind us what the current version of lines 63 through 67 saying that has been replaced by this language.'",
        "'speaker_0': 'I just don't have my documents up to like where I can quickly go to this case, which is that there is a strengthening script from the striker, from the striker or from the underlying. What we would adopt if we didn't adopt this amendment.'",
        "'speaker_0': 'So the striker striker presumably presuming the striker is going to be adopted. But yeah, let's start there. The striker says that the planning group is requested to make recommendations executive and council regarding how to prioritize the initiative's work in unincorporated area community.'",
        "'speaker_0': 'I got it. Thank you. That's super helpful. Thank you, Manager. And. Are there any other questions or comments? Customers are like.'",
        "'speaker_2': 'Thank you, charcoal wells. I really appreciate the desire for more clarity. I'm going to be a no on this amendment just because personally I feel like prioritized is a little bit stronger than the extent to which we focus on an area.'",
        "'speaker_2': 'I do agree that there is room for interpretation on the word prioritize and hopefully the planning group will come back and let us know what that means or how they want to implement it. But just because of the word prioritized, in my view, feels stronger than extent to which we focus.'",
        "'speaker_2': 'I'm going to be a no at this time.'",
        "'speaker_0': 'And to actually cut some of this. Hello. Are there any other questions or comments about the Grove councilmember to go?'",
        "'speaker_1': 'Thank you, Madam Chair. Well, there's I know these are all very similar amendments. I think I'm more comfortable with this one. And ideally for the same reason my friend is doesn't like it probably. And that I've always thought one of the concerns with the word prioritize is that by definition it's one over the other.'",
        "'speaker_1': 'And so it sort of can be read as prioritizing other areas and setting goals for achieving our responsibilities in unincorporated areas through this initiative strikes me as a way that is more positive without being negative towards the others, if that makes sense.'",
        "'speaker_1': 'And so I also, you know, and I'll be candid, I've been upfront, my preference is the whole thing be targeted based on need, not geography. But I think this is an elegant attempt at trying to find a path forward.'",
        "'speaker_1': 'And so I thank you for the time it took to bring it forward and I support it.'",
        "'speaker_0': 'Thank you, Councilmember. Any other comments? With that all in favor of amendment number 20 and so on. All right. Any oppose? Say my name. I'm not certain.'",
        "'speaker_1': 'Division.'",
        "'speaker_0': 'We'll have a division. Madam Chair. Madam Kirk, would you please call the roll for this amendment? Yes, Madam Chair. Doesn't anybody know? Councilmember DEMBOSKY. Oh, no. Councilmember Dunn.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilman McDermott.'",
        "'speaker_1': 'Now.'",
        "'speaker_0': 'Councilmember Perry No. You can sum up the growth. I can't remember Brundibar.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Councilmember Sala.'",
        "'speaker_1': 'I know.'",
        "'speaker_0': 'I'm sure you have final three i's price and you has failed. I would like to ask now for council member third to move amendment number 25. Back to move on amendment number 25. Thank you, Chair. Cobra, certainly the amendment has been very good to get to speak to it.'",
        "'speaker_0': 'Thank you, Chair. This amendment is important to me because I want to encourage in this conversation as much. Power for the group is possible. So again, all of King County represented means the opportunity in the permanent work group to have somebody from each of our districts in the conversation and that it be an open process.'",
        "'speaker_0': 'Right now we do not have an open application process in the permanent workgroup, and that is very important. And in terms of funding as well. I have been elected as 30 years as an executive and fundraiser, raising $50 million.'",
        "'speaker_0': 'And I am aware of opportunities and how some of these come forward. And in this case, if you have people from each district that are from our bipoc communities are impacted communities bringing this powerful conversation together across King County, there's more opportunity for investment in the private public partnership, and there's more opportunity to consider supporting these initiatives'",
        "'speaker_0': 'from people that are within this district. Even though the focus may be a different area than that particular district. They're supporting the folks that are involved in that conversation, in that initiative. And I think it raises that awareness.'",
        "'speaker_0': 'It raises the opportunity for more people who want to support this great work. And there are many who do to feel invested from different areas that they may not be directly. You know, if they are more removed from from areas, they may not be as committed if they don't have folks in their own district involved in that'",
        "'speaker_0': 'as well. So for that reason and others, I encourage our good folks here today to vote for this amendment. Thank you, Councilmember Perry. Per other comments, Councilmember Girls.'",
        "'speaker_1': 'Thank you, Madam Chair. And it's never fun to speak against a friend's idea. The fundamental difference I see between this and the underlying striker is whether the executive will select the appointees or whether it's a mix of executive and council member appointees.'",
        "'speaker_1': 'And I think. Every step we take to. You know, let me rephrase that in the positive. I think, number one, if we're going to delegates and I'm going along here with delegating to appointees, potentially our budget authority, I think it ought to be us, not the executive who.'",
        "'speaker_1': 'Decides who we're going to delegate that to. And the reason being is. I think any time you have appointees versus elected officials, it is less democratic and less accountable. And you shut out members of the community. I think by having council members rather than the executive make some of the appointments, we make sure that we don't have'",
        "'speaker_1': 'a group that thinks alike, looks like, and instead we can truly reflect the diversity of ideas and thinking. And I think most importantly, it can build confidence in that process for us to do what I think we're all interested in doing, which is further empowering a diverse group of people, of different people, you know, coming up with'",
        "'speaker_1': 'a different group of people to make those funding decisions. So at the end of the day, I think I don't know about each of you, but when I have an opening where I have a responsibility to nominate or appoint someone, I often do public promotion in my district.'",
        "'speaker_1': 'There's nothing that keeps any of us from having an open and transparent process to solicit nominees. I know I'll work my butt off to find the the try to find that perfect person who brings that right mix of experience and background.'",
        "'speaker_1': 'And and I, I guess I trust us. I trust myself. I trust others. Not I don't trust Dallas, I don't trust our county executive. But I think we get a a truly more diverse group that's more reflective of all the community when we when we allow ourselves rather than the executive to make some of the appointments to'",
        "'speaker_1': 'the board. So I encourage a no vote.'",
        "'speaker_0': 'McDermott Council member, I think. McDermott And then I saw that earlier and then Belgian government had come to agreement.'",
        "'speaker_1': 'Thank you, Madam Chair. I have a question from his audience, if I may. In and that is. Coming from the remarks we just heard is it does would this either in the advisory group or in the permanent ongoing work group?'",
        "'speaker_1': 'I may have my totals wrong. Cede the Council's appropriation authority to another group or with decisions, always come back to the Council for us to adopt, appropriate or enact.'",
        "'speaker_0': 'Well, as you know, this is a motion. So it doesn't have the it doesn't have any legal force and certainly does not delegate any authority to foreign corporations which still are required to be done through appropriation ordinances.'",
        "'speaker_1': 'Thank you. I just need to emphasize that we aren't ceding our budgetary authority, our operational authority to another entity that continues to reside here in the council and to urge members not to understand. That's what's before us today.'",
        "'speaker_0': 'And you may have to make some of those decisions when I'm back here. Council members done a lot.'",
        "'speaker_2': 'Thank you to our callers in terms of just broader context for full transparency. Councilmember DEMBOSKY has convinced me on every element of S-4 from unincorporated priority to the BSA framework, all of it except my one hang up is on how much power or how we empower these the community members to form what the planning group and the'",
        "'speaker_2': 'advisory group. That's my one hang up. So I'm looking to see if this amendment does that give more power to the community groups to make decisions? How is it relatively to the striker? Which one provides more power for that for those groups?'",
        "'speaker_2': 'So I guess that's is that a clear enough question? I'm trying to just compare what the Stryker says to what this new amendment from Councilmember Perry does with the lens toward are we empowering impacted groups to make decisions like board composition and other recommendations?'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_3': 'Would you want me to respond that? I'm sure.'",
        "'speaker_0': 'I think that's fine. And I guess we were.'",
        "'speaker_3': 'All like, thank you. I think the answer is maybe next. The developed we. I, I took a substantial portion of Councilmember Perry's requested and suggested language with respect to kind of the qualifications of of the of the board in terms of emphasizing black indigenous people of color and those most impacted by displacement pressures.'",
        "'speaker_3': 'I think that was your language because. Well, Gary, really good and appreciated and that's in there. I certainly if we needed to add a open process, you know, that I would be supportive of.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'It's the legislation is a compromise certain members feel very strongly customer is actually about having a council voice and I understand that in terms of standing this up and I actually think it will build more institutional support for the initiative and robust funding for it to then let it let empower the community to go do its work'",
        "'speaker_3': '. It's somewhat counterintuitive by having, in my view, some voice from our council here established at this stage and making sure that the panel has the voice of the legislative branch and the executive branch. So as the striking member, this is now before us, the executive would have four members council would have nine one per district for a'",
        "'speaker_3': 'total of 13 council member. Perry's amendment is less specific and does not ensure council members power, if you will, to appoint a person to understand it. It just says that there's let me let me get it correct here, that the workgroup is asked to recommend how to form it, including representation from each district.'",
        "'speaker_3': 'So two, in one way council members I like this amendment at the early stages empowers the community to self-determine and make a recommendation to us about what they want the permanent group to look like. It gives them that agency, if you will.'",
        "'speaker_3': 'The striking amendment makes the decision. And says we're going to have a 13 member permanent panel with a four. We could end up at the same place if Councilmember Berry's amendments adopted and the workgroup comes back and says, yes, set it up that way.'",
        "'speaker_3': 'One way or another, I think we are going to have to decide one way or another. We as a council will legislatively decide what the permanent panel looks like. And move this forward with broad support? Or do we defer it?'",
        "'speaker_3': 'This was a compromise. From my perspective, I had I had earlier thought we should ask the worker to make a recommendation, but I see that this has some merit as well.'",
        "'speaker_0': 'And I would like to remind everybody that, again, we have two groups. We know that. But the first is the planning work work. And the second one, the permanent one is the advisory board where we've all been using different terms.'",
        "'speaker_0': 'So I just want to make sure we're all on the same page.'",
        "'speaker_3': 'And this and this amendment addresses the permanent or not the title.'",
        "'speaker_0': 'Exactly.'",
        "'speaker_3': 'I'm sorry if I'm stuck on that, but.'",
        "'speaker_0': 'Okay. Council Member I'm not sure who is next though. We've had, I think councilmember about due to what's next and then we'll go to Councilmember McDermott. Thank you. Thank you, Chair. So I've been pretty quiet, but I've been listening closely to the public comment and all of this discussion.'",
        "'speaker_0': 'And as I said at the previous meetings, part of the reason that I'm sort of taking a listening role here is that I don't have any expectation that this effort will immediately appear in my district. And so I'm intentionally letting those who have more of a stake take the lead, which I think is kind of a model'",
        "'speaker_0': 'for what the community is talking about they want. They're asking us to let those who have more of a stake and have ideas about how to, you know, advocate for their state, take the lead. But I think that if I will say I'm hearing everybody trying to seize this opportunity to build investment and power in areas of'",
        "'speaker_0': 'our county that are underinvested in, that have been challenged by economic forces, especially this placement. It is something that's come up in our affordable housing.'",
        "'speaker_1': 'Mark over and over again.'",
        "'speaker_0': 'Around issues of displacement. This has been a successful model in other governments. I have no doubt that it will be a successful model here and I'm happy to launch it. I think that when this ultimately stands up and when it is ultimately a success, I hope it provides a template that will show up in my district at'",
        "'speaker_0': 'some point in the future, and I know that there's hope with that. And so I'm very happy to support it. I generally think that when we're starting new programs like this, flexibility is a watchword. So to be as as as light of a touch in terms of directing what the outcome of the advice and recommendations of these'",
        "'speaker_0': 'bodies are would be, I think, good. And so balancing these two these two principles that I brought into this one is I really want to respect the folks who have taken the laboring or the closest to it. And so I'm going to support the Stryker.'",
        "'speaker_0': 'I hope that we will say, if not require that if the advisory group that's doing the planning, the first group has any recommendations for something they think they would like to see changed. After adoption. I hope they will feel free to tell us those things.'",
        "'speaker_0': 'I don't think we have to tell them to tell us. I think they can just tell us. They can say, you know, you said 30 members. We think that's too small, too big, you know. And so I just want to lay on the record that I think we should verbally, if not legislatively, empower the advisory group to'",
        "'speaker_0': 'come back with any recommendations they think will make this a success. And so I support the compromise position that was worked out and a lot of labor, as I understand, by the sponsor co-sponsors. And so I'm going to support that.'",
        "'speaker_0': 'I'm not going to support this. But that's not to say I think that ultimately the permanent body could look different. It could. So I just felt like it was important to say something rather than sit here quietly, the whole thing.'",
        "'speaker_0': 'Thank you, Madam Chair. And Council member about ditching Council Member McDermott. Nothing. Nothing. Okay. Is there any other. I think the chair.'",
        "'speaker_1': 'Of the group.'",
        "'speaker_0': 'Some member of the gallery here.'",
        "'speaker_1': 'Thank you, Madam Chair. I wanted to clarify for our budget chair. I, i my intent was not to imply that we were delegating something here. The point I was making is that I think we're going to get to a point where we may want to, if we find money somewhere appropriate, some money to this entity.'",
        "'speaker_1': 'And I think at that point, my point I was making was having some good, broad based confidence in the entity that's doing that. So I didn't want you to think that I was implying that this motion delegates into appropriation at all.'",
        "'speaker_1': 'I think you're absolutely correct in your assessment. And I was clumsy in how I how I made my argument there. My thought was that when the time comes, I have a hunch this body will want to appropriate to this purpose.'",
        "'speaker_1': 'And so how once that appropriation is made, how the moneys divide divided up, what that process looks like, who is at the table, I think becomes important. So that was I just wanted to clarify the point I was making there.'",
        "'speaker_0': 'Thank you. Any response, Councilmember McDermott? Okay. Is there anyone else who would like to make a comment on amendment number 25? All in favor of the amendment. Amendment and the based on. I. And others in opposition say, no, no, the amendment is not adopted.'",
        "'speaker_0': 'With that we have before us striking amendment S-4 and before we have a roll call vote, is there anybody who would like to make any comment?'",
        "'speaker_1': 'Madam.'",
        "'speaker_0': 'Councilmember McDermott.'",
        "'speaker_1': 'Thank you, Madam Chair. You heard me at the beginning of the meeting, remarked that, you know, be flustered for a minute, need to find my place because I didn't realize there wasn't a striking amendment for until after the meeting had started.'",
        "'speaker_1': 'But because we've had a thorough conversation through it, I've been able to follow the changes in four that we have before us now as amended with comparison to as three. As two. And the underlying legislation itself. And I have to say that I would have preferred as to and it's because of the question I asked earlier in'",
        "'speaker_1': 'our discussion of ask for the striking amendment now before us about the voice of community and how we've heard from the community. I prefer the stronger involvement of the community as I see in announced for I'm sorry in as to that is not before us.'",
        "'speaker_1': 'I had anticipated supporting not today but in this vote for striking amendment. As for as amended, I will be a no vote because I want to uphold the value of hearing from community directly and that voice. Thank you.'",
        "'speaker_0': 'Thank you. And Council Member McDermott, there was an email sent out with Striking Amendment four and the amendments last evening that I had sent. I think Wendy had sent out an email earlier with my recommendation that we could.'",
        "'speaker_0': 'My determination that people could still send in amendments. That was earlier in the afternoon. I think we had given until 3 p.m. yesterday.'",
        "'speaker_1': 'Madam Chair, I don't. I received the email after six last night. I'm not questioning that. It was senator that I had it. I personally just didn't have a chance to review it. And in fact, I wasn't aware of of having received it until the meeting.'",
        "'speaker_1': 'But but I did receive it last night. Yes. I just didn't have a chance to review it or wasn't even aware of it.'",
        "'speaker_0': 'I can relate to that as in other circumstances. Council members. Hello.'",
        "'speaker_2': 'Thank you, Chair. Well, first of all, I just want to thank your new chair, Cole Wells, Councilmember Dombroski and Up the Grove for coming together and finding a compromise striker. I'm pretty astounded that you all were able to land where you did in terms of all coming because people were really far apart.'",
        "'speaker_2': 'And I also especially want to thank Councilmember Dombrowski, because you articulated a lot of these really complex and nuanced differences very clearly, clearly enough for me to understand and for the most part, support. Like I mentioned before, I got there with you on the unincorporated piece, I got there with you on the Vsco piece.'",
        "'speaker_2': 'The only hang up that I have, as I mentioned before, is taking power away from the community groups and the planning group to make decisions around a future advisory board composition and around some other decisions. I completely appreciate Councilmember Up the road's philosophical position about, you know, where the elected officials we shouldn't actually.'",
        "'speaker_2': 'Let me not mischaracterize your position Councilmember of the Grove. But I get where you're coming from. At the same time, I think in some limited, controlled environments, it is okay and beneficial for us to cede power. You know, we have going on right now the participatory budgeting group, and that group fully gets to make decisions around a'",
        "'speaker_2': 'specific, discrete pot of money that will go and fund really important capital projects in our unincorporated areas. And I think that's important because these types of. But. When we're able to cede power like that, we can cede power to groups of people who don't have power, who are far this removed or furthest removed from power, who who'",
        "'speaker_2': 'understand the issues that they are going through, who understand their communities intimately, and who should be able to, you know, be empowered to make those decisions. And so for that reason, I'm going to vote no on this striking amendment, because I think it.'",
        "'speaker_2': 'Takes power away from these planning groups, from these community groups of people who represent communities most at risk for displacement. And I would be willing, though, in the interim, if the striker were to fail, which it's not seeming like it will, if it does, to support everything else in the striker and then work through something that reverts'",
        "'speaker_2': 'that power back to those planning groups. Thank you.'",
        "'speaker_0': 'Thank you. Councilmembers. Who are anybody else who would like to make a comment? Councilmember Pare. Thank you. Well, I think I'm particularly sensitive to this right now because I I'm hoping that I can keep my staff because we're working very, very hard.'",
        "'speaker_0': 'Everything's very busy right now, and I'm aware of it. And so I'm thinking of an initial conversation that happened when I first came in to the the council where we were giving our staff just a procedural comment, giving our staff time, you know, that we would have amendments end by Thursday of the week before, so they'd have'",
        "'speaker_0': 'time. And in this particular thing, because of all of the activity, we have had an incredibly undue impact on the collective staff schedule because of how we have chosen to handle this in this time frame. So I'm just checking on what we agreed to do with the intention of that and then what's actually happened in this space'",
        "'speaker_0': '. That coupled with not really understanding how much notice public needs, when we do have a final striker like this, is it okay that it goes out the day before? Is there an intention that you have more time to have more breathing space for consideration, for full consideration and comments from the community?'",
        "'speaker_0': 'I just that's just a comment. I'm not sure about the procedural about the processes here. And it feels like we were trying to do one thing. And then we've gotten into a space where we've actually had an undue impact on staff.'",
        "'speaker_0': 'And it's been a pretty remarkable way these last couple of days. And and then also not being able because of that to provide timing. But I don't know what the standard of timing is that we are striving for in this.'",
        "'speaker_0': 'So I just want to make that statement. Thank you. That's the reason I get that is a very important question. And it's, I think, been awkward for me as chair under our council rules that we adopted a couple of months ago, I believe.'",
        "'speaker_0': 'And last month, we had set the various established timeframes to get directions to staff for preparation and then couldn't striking amendments, but with an exception for the chair of the given committee to change that time frame. And as much as I do not like to do that, I thought it was necessary.'",
        "'speaker_0': 'On the one hand, we have this time frame, as Gil reminded us of, for when the work should be completed by the executive. But the requirements of this motion, on the other hand, there's been a lot of controversy and issues with this particular proposed motion.'",
        "'speaker_0': 'I sent out an email last Friday giving a more latitude because I did not want to lose the efforts that were underway by the sponsors and especially Councilmember Grove, who had a different view. And for me, it's better to try to come up with a consensus that that means a more striking amendment.'",
        "'speaker_0': 'But under the rules of the Council, we couldn't do that. So with the authority I have as chair, I sent out an email Friday to relax those time requirements, to give them more time to work on this. And then, as it turns out, the efforts were really making progress underway.'",
        "'speaker_0': 'And that's why staff on my behalf sent out the email yesterday afternoon saying there would still be time opportunity for members to submit amendments. But I think it was 3:00 yesterday. Council Chair Bell did she did the super brief.'",
        "'speaker_0': 'I don't want to expand this meeting any more than I have to. I think this is a discussion well worth having in a different forum when we're not like having, you know, a vote right in front of us.'",
        "'speaker_0': 'But it's been an evolution from not having really much structure to having probably too much structure where we really ran into some very serious conundrums over the last year or so and to now this new flexibility that's been granted to chairs.'",
        "'speaker_0': 'This is, I think, the first time we've really used it, but it's just it's just a moment for us to sort of think about how and when do we use it. And there's a little bit of just councilmember to councilmember discipline, like setting our own deadlines and and sticking to them that we need to commit to.'",
        "'speaker_0': 'But thank you. Thank you for bringing it up and thank you for this conversation. And Councilmember Coles, thank you, as always, for being the pioneer. Seems wherever you go, you get the big the big workload. So thank you.'",
        "'speaker_0': 'All right. Well, again, it's been an interesting one, but I think it's been very fruitful and productive. And I'm so. Been on your staff? Councilmember Perry I think it's happened with many of our staffs as well. But we have a time crunch and we also have the process going forward.'",
        "'speaker_0': 'And I did announce that my intention was to take action on this today. This would go if we approve the strike and then going to do recommendation to the proposed motion as a as amended would go to the full council, I believe, on February, March 16.'",
        "'speaker_0': 'Is that correct? March 15, Council meeting. Yes, March 15. With that, are there any other comments.'",
        "'speaker_3': 'In Dombrowski.'",
        "'speaker_0': 'Very enthusiastic about this proposed motion that I signed on as a co-sponsor. I would have liked to have gotten totally there by today, but I would like to go ahead with the vote. Councilmember Dombroski. Unless someone else has wished just to make closing remarks, I oral vote on the striking amendment.'",
        "'speaker_3': 'Well, I want to check in here given what I've heard and see where we're at. I, with respect to Councilman McDermott and Czar Allies remarks is as was noted by Charles McDermott, I had announced too, which really gave more authority to the recommend, you know, to the planning workgroup on the final structure.'",
        "'speaker_3': 'But I will say I'm not ready to proceed today in support of this. If on the final vote as amended councilmembers online McDermott are not supportive and I would table right now so I heard them addressing the Stryker.'",
        "'speaker_3': 'And I'm a little confused because Councilmember Perry had an amendment that would have undone the the nine plus four, which. Wasn't supported by my two colleagues there. It would have been part of the group. So I'm I want to understand where my colleagues are if, say, the striker is if they're willing to share adopted.'",
        "'speaker_3': 'Are they interested in proceeding here? I you know the starter and have everything I like in it isn't isn't what I wrote that was more pretend to ask too but in the effort to kind of move this forward.'",
        "'speaker_3': 'Compromises are there and I get that my colleagues don't like a couple of those compromise. They want to vote no. But big picture, I'm interested. Does this thing more work here? Should we be done with this? Are we going to move it forward?'",
        "'speaker_3': 'Help me understand where people are. Big picture, if you're willing.'",
        "'speaker_0': 'A legitimate question whether either council member Zara McDermott or both like to comment. It looks like council members are voting.'",
        "'speaker_2': 'I would be supportive of working between now and full council to propose something that looks like conceptually what I want to see in terms of giving the planning group more authority.'",
        "'speaker_0': 'And to Councilmember McDermott.'",
        "'speaker_1': 'Without committing my vote at full council, I would. If S4 were adopted, I believe I would be a no vote today to encourage the work that to move closer to S2 as I spoke to earlier. So I believe I will be a vote of no one asked for.'",
        "'speaker_1': 'I believe I will also be an know. I'm final passage in committee today, hoping that between now in full council we would do that work. If it helps my. Concern. And now I'm going to mix up which amendment I'm in.'",
        "'speaker_1': 'Seating people, own committees. Whether. I want to make sure we have a broad complement of skills and abilities in voices that. I don't believe we always get it when nine council members make appointments because then I look for the best person to bring the voice I'm interested in.'",
        "'speaker_1': 'We each do that and we don't have an eye to the overall set of talents, voices and perspectives then come to the table. And so that's why today and in many occasions I might balk at. It counts member making appointments, if that's helpful.'",
        "'speaker_1': 'And if not, have just further muddied the waters.'",
        "'speaker_0': 'To go ahead companies. And I would like to remind people it's 1212.'",
        "'speaker_2': 'Just to clarify my position, I would be a no on us for a yes on final passage and then work on an amendment before full council that gives more authority to the planning group.'",
        "'speaker_1': 'And.'",
        "'speaker_0': 'To council members who are and council members. I'm going to turn to Europe because we could have changed this amended to the final passage to without recommendation. It's another option. You are the lead sponsor and I'm looking to you as to what you prefer.'",
        "'speaker_3': 'Well, that's helpful. And based on customers, it's expression of support for moving it forward today with a dubious recommendation, with the understanding you may or other to bring forward some fine tuning, which again, just for the record, that's kind of where I was.'",
        "'speaker_3': 'But it's we're making some legislation and sausage here. I felt that those issues were important, should not rise to the level of stifling and stopping this important work. And and and to me, I see a number of models that work with respect to, you know, panels and boards.'",
        "'speaker_3': 'And I don't think there is one right answer. So I think, you know, we can have a reasonable disagreement on that. But I I'm heartened to hear that that that their support to move this forward today, even if there's some, you know, disagreement on the specific make up.'",
        "'speaker_3': 'So, Madam Chair, I'll rest on my opening remarks on this floor about the right to petition your government guaranteed by the United States Constitution, our First Amendment, the human rights principle of self-determination. And I think on the whole, this legislation is a local exemplification of of those principles of empowerment and redress through our to our system of'",
        "'speaker_3': 'government. And I hope members will support it today and move the initiative forward.'",
        "'speaker_0': 'Thank you, Councilmember Maskey. And there are a number of members who have not weighed in on this at all. But at this point, unless there are any other comments anybody wishes to make. We have a striking amendment as support for us all in favor indicate by saying I.'",
        "'speaker_0': 'Any pros say.'",
        "'speaker_1': 'No? No.'",
        "'speaker_0': 'It appears that the striking amendment has been adopted. With that, madam, could you please call the roll and proposed motion 2020 10467 as amended. Thank you, Madam Chair. A I council member.'",
        "'speaker_3': 'DEMBOSKY, I.'",
        "'speaker_0': 'As a member. Done?'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'Anthony McDermott.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'Councilmember Barry. Councilmember Barry. All right now. I'm sorry. I can't hear that phone. No. Did you hear that? Yes. Thank you. Yes, thank you. Sorry about that. Councilmember at the ranch. I don't remember. Van de Boer.'",
        "'speaker_1': 'No.'",
        "'speaker_0': 'Councilmember SA. Hello. I. Madam Chair, I avoided five eyes or not in my shoes. Thank you. With the vote we have has given a cast recommendation to proposed motion 2020 10467. And we'll send this motion to the March 15, 2022 council meeting, where we likely will have amendments offered, and that includes the action items on our agenda'",
        "'speaker_0': '. And Madam Chair, I believe there were all members voted. This was the only vote. So that is correct, Madam Chair. That's right. So with that, there is no further action on our agenda. There is no other item on our agenda.'"
    ]
}