{
    "Recommendation to request City Manager to work with the Financial Management Department to recognize businesses that are majority owned by people who identify as LGBTQ+, veterans, and people with disabilities in the City's procurement and purchasing process;   Furthermore, request City Manager to return to City Council in the next 180 days with a report showing how many LGBTBEs, DOBEs, and VOBEs have signed up on the City's PlanetBids database, information about outreach to these businesses, and how many of these businesses apply to and are awarded projects over this time-period.": [
        "'speaker_0': 'Let's take the procurement LGBTQ procurement item from Councilwoman Gonzales.'",
        "'speaker_1': 'Communication from Councilwoman Gonzales. Councilmember Pierce. Councilmember Suber now recommendation to request city manager to work with the Financial Management Department to recognize businesses that are majority owned by people who identify as LGBTQ plus veterans and people with disabilities in the city's procurement and purchasing process.'",
        "'speaker_0': 'Thank you. Let me first turn this over to Councilwoman Gonzalez.'",
        "'speaker_1': 'Yes. So I first want to thank Joe Mendez, president of the LGBT chamber. Esteban Gomez, vice president of the chamber. Eduardo Lara, a member of the chamber as well, Porter Gilbert, Jonathan Levitz from the National LGBT Chamber. And Mary's in the House as well from the The WHO wrote a letter of support.'",
        "'speaker_1': 'I am very excited to bring this item forward and ask for the Council's support. This has been a few months in the making and I want to thank every single person for being here. As we know, Long Beach is one of the most diverse cities in the country.'",
        "'speaker_1': 'That's no secret. We're proud of our inclusivity and our efforts to work with small business owners, especially through the everyone in conversation citywide, led by my colleague and friend of Councilmember Rex Richardson. We're in equals inclusion. We've done a lot to engage small business owners, disadvantaged businesses, and my own minority and women owned businesses in the city's'",
        "'speaker_1': 'procurement and purchasing process. We actually have a small business certification program, a disadvantaged business enterprise program, and a Long Beach Business First initiative, all designed to provide our local businesses with an opportunity to work with the city. But we also know that Long Beach has a thriving LGBTQ plus community veteran and differently abled communities.'",
        "'speaker_1': 'And there are a growing number of businesses owned by these community members. And we know that nationwide, specifically with the LGBT owned businesses, they contribute over $1.7 trillion to the economy. And locally, we have amazing business owners that we should be able to recognize.'",
        "'speaker_1': 'So through this item, the intention was to increase outreach and make our city's procurement process inclusive for these businesses. We've been working with the local chamber and the National Chamber, as well as other organizations like the National Veteran Business Development Council and Disability.'",
        "'speaker_1': 'In offering third party certifications to verify that businesses are majority owned by people who identify as LGBTQ plus veterans and business owners with disabilities. So we'd like to just expand the options here in the city. I look forward to hearing more council discussion and I single one of you for your efforts and keeping this on our radar'",
        "'speaker_1': 'to make sure that we do the best here thing here for Long Beach, especially our local businesses. Thank you. And I think we have a few other councilman.'",
        "'speaker_0': 'Thank you. Yeah. I mean, let me go ahead and take their their comments first. I can actually get you to take a seat just as we finish the the agenda and I will call public comment and have you guys come up.'",
        "'speaker_0': 'Councilmember Super now.'",
        "'speaker_6': 'Thank you. And thank you to Councilwoman Gonzales for inviting me to sign on. It's my pleasure to do so, and congratulations for making it here. And I'd like to speak specifically about Joe Mendez, who's the board president. Joe's been working on this item for so long, and I don't know how long it's been, Joe, but I remember'",
        "'speaker_6': 'us having a discussion about it at a Christmas party in 2017. So that's that's been a while you've been at it. And also.'",
        "'speaker_10': 'What people may not.'",
        "'speaker_6': 'Know is Joe has been such a valuable asset to the organization, generally speaking. So he's done a great job. So thank you for all your hard work, Joe. And also just for the Gay and Lesbian Chamber of Commerce have one of the great mottos or if you call it a mission statement, I'm not sure, but it's joined'",
        "'speaker_6': 'for the business, stay for the community. And that's exactly what you epitomize. Thank you.'",
        "'speaker_0': 'Excellent Council, Pearce.'",
        "'speaker_3': 'Yes. I want to thank my colleague for inviting me to sign on to this item and for bringing it forward. I think this is a fantastic item. Obviously, in District two, I think we have a large percentage of businesses that are owned by members of our LGBT community, from tax services to food and restaurants.'",
        "'speaker_3': 'So I definitely love to see this come forward and fully supportive of it. I wanted to ask a question of staff just on the disadvantage program that we already have. Can you enlighten me? Does that program include previously incarcerated?'",
        "'speaker_8': 'I believe it does now.'",
        "'speaker_3': 'Would you be opposed to including previously incarcerated and just along with veterans as well?'",
        "'speaker_1': 'Sure I would.'",
        "'speaker_3': 'Like whether it fits here or whether it fits in the we can bring it back to a discussion. But I think being that we have the the disadvantage when already I was under the idea that had already included incarcerated previously incarcerated folks.'",
        "'speaker_3': 'So if you could just let me know, get back to us and we can reevaluate it being included under that one. Fully supportive of this. Fully supportive of making sure that we have a procurement process that includes these communities that have been identified.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Gottesman Richardson Thank you, Mr. Mayor. Councilwoman Gonzalez, thank you so much for lifting up this important constituency. And so we're having a broad conversation about economic inclusion in the city and inclusion means everyone, right? And so our LGBTQ community has, you know, thriving business corridors, a number of thriving businesses.'",
        "'speaker_6': 'So it's important to make sure that they're called out and lifted up as we review all of our procurement strategies. I mean, Councilwoman Pierce, so there's a there's a large conversation taking place now is not fully cooked yet, but the conversation is really taking place across the region about setting, you know, reforming the procurement process and in'",
        "'speaker_6': 'setting some aggressive goals. L.A. County, for example, has a new supplier supplier to diversity program where they set a 25% goal. They specifically call out, you know, veterans, disabled individuals. And so I think, you know, as we continue this, everyone in conversation, there's certainly an opportunity to look at pre-leasing incarcerated because we really we should be thinking'",
        "'speaker_6': 'about inclusion from a standpoint as we bake it into what we do, not sprinkle it on top like not sprinkling on this groups frequently. We should really bacon inclusion and rated throughout all of our systems. The conversation now is really, you know, financial management.'",
        "'speaker_6': 'You know, it's a it's a big conversation about a really big overhaul. And what I think will be great is if they fall from here, from the full council very soon, that this is really incredibly important to really get the procurement conversation right.'",
        "'speaker_6': 'Councilwoman Gonzales, you have my full support here. Thank you so much for for lifting this up. And I also want to raise up the disabled piece. I think that's incredibly important. If if we have the biggest thing we can do to make sure people are included in our local economy is the way we spend our money.'",
        "'speaker_6': 'And so that is something we have direct control over. So we should take our time, think about it comprehensively. But thank you so much. You know, and obviously I'm supportive this item.'",
        "'speaker_0': 'Thank you, Councilmember Ringa.'",
        "'speaker_11': 'Thank you, Mary. And I, too, want to thank Councilwoman Gonzales for bringing this forward. I think that bringing these sectors of our business community into the forefront and into the procurement process is long overdue. And I'm strongly supportive.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_1': 'I also wanted to recognize John Newell, who is here as well, past president of the AIDS food store. And thank you so much for being here to.'",
        "'speaker_0': 'Thank you, Councilmember Orson.'",
        "'speaker_5': 'Yes. I'd like to just obviously lend my support to this. I think this is a great and great item. I want to thank my colleagues for bringing it forward. Certainly, we want to include everyone into our our our fabric and into opportunities in our great city as we celebrate our diversity.'",
        "'speaker_5': 'I did have a question for staff in terms of just intent. Can you can someone tell the city manager in terms of what this item adds to already that we we already do in terms of providing recognition to minority owned businesses and protected classes?'",
        "'speaker_5': 'What does this add to from.'",
        "'speaker_8': 'From what I understand, we already do that for minority businesses, women owned businesses, and we'll be reaching out to guarantee that the businesses we're talking about tonight get more representation and planet bids, that we reach out to the more local community groups so that they're more familiar with what we're what the city is bidding for, what we're'",
        "'speaker_8': 'procuring. So everyone has a better opportunity to apply for these bids knowing they're coming. And a lot of it is going to be communication, working with the right groups, having the the disadvantaged communities and everyone understand planet bids and get help on planet bids so everyone can be fair and bid on everything that we have.'",
        "'speaker_8': 'So everything's out there. So I think believe that would be the primary thing that we're looking at right now.'",
        "'speaker_5': 'Okay. Thank you. I just wanted to get clarification for those who may not have heard the whole item or may not understand what we're doing here. So thank you. You have my full support.'",
        "'speaker_0': 'Give me your.'",
        "'speaker_7': 'Address. I wanna also thank Councilwoman Gonzalez for bringing this to the forefront, because I think this is what makes language. You know, look, the way you look when we look at small business and let them know that this is the way our city should always look and thank you, guys.'",
        "'speaker_7': 'And I'm truly supportive of this idea.'",
        "'speaker_0': 'Thank you. There's a there's a motion and a second. I'm going to comment and call for public comment. I just want to just think, Councilman Gonzales, but also Councilmember Pierson, Councilmember Superman, this is an excellent item. I know.'",
        "'speaker_0': 'I know. Councilwoman, you've done a lot of work on procurement issues in your time here. And I think this is another great example of ensuring that we are inclusive and continue our, I think, really strong record of LGBTQ inclusion.'",
        "'speaker_0': 'And I think this is another really important opportunity and in a way for the city to do even more to ensure that this population within our community continues to grow and also be aware that there is still in this country a lot of discrimination against LGBTQ business owners, businesses and LGBTQ entrepreneurs.'",
        "'speaker_0': 'And so it is critical that these types of programs are in place to ensure that those business owners and community members have access to the same types of opportunities that everyone else does. And so I'm very supportive and you've all done a great job and the Chamber has done a great job of advocating for this.'",
        "'speaker_0': 'And so with that, please, if that public comment and.'",
        "'speaker_10': 'Great. Thank you so much. I just wanted to just right off the bat. Thank you, Linda Gonzalez, councilman, for bringing this to the city council and to the other supporters of this this measure or this policy. As I mentioned, my name is Joe Mendez.'",
        "'speaker_10': 'I'm the president of the Long Beach Gay and Lesbian Chamber of Commerce. And we are also the affiliate chamber to the. The Chamber of Commerce as an organization. We have been in Long Beach since 1992, formerly known as the Long Beach Community Business Network.'",
        "'speaker_10': 'And once again, we are in the process of changing our name to the Long Beach Community, LGBT Chamber of Commerce, to be more inclusive in our diverse community across the USA, not just in Long Beach. Our organization has been in the diversity and inclusion space many years.'",
        "'speaker_10': 'Our corporate members like Southern California, Edison Socalgas, California Water, Southwest Gas out of Las Vegas, Comerica Bank all have diversity initiatives. So I know that adding LGBTQ businesses, veterans and members of the disabled community to Long Beach list of vendors and suppliers will only increase opportunity.'",
        "'speaker_10': 'Moving forward with this policy will be will be good for Long Beach City contractors as well as for the many entrepreneurs in our city, many of which are ready to do business with the city of Long Beach. Our chamber currently broke the 200 mark and we have about 24 to 30 businesses are certified through the NGOs.'",
        "'speaker_10': 'You see Jonathan Jonathan Lovett from the NGOs has provided you with with a letter which speaks to the what certification has done to LGBT businesses across the nation. Opportunity is what policy is, what this policy will bring. Equality in business is good business.'",
        "'speaker_10': 'Long Beach will make history tonight by being the first city government in California to add LGBTQ businesses, veterans and people with disabilities to the list of vendors and suppliers. It will increase the city's supply list. It will encourage greater innovation and competition.'",
        "'speaker_10': 'This is why all of these other corporations come to us because they want our help to increase their supplier and vendor and vendors and suppliers. It is time for Long Beach to be a respected leader in the business community.'",
        "'speaker_10': 'Diversity and opportunity to take its place as one of the most inclusive cities in for minority business owned in America. We are excited. Soon to for Long Beach. Among those who believe the power of inclusion not just as the right to do, but also has an economic imperative that benefits every citizen in our state.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Any other speakers?'",
        "'speaker_2': 'Hello, everybody. My name is Estevan Gomez and the vice president of the Long Beach Gay and Lesbian Chamber of Commerce. I'm also the co-founder of Keen Social, a certified LGBT. So first, I would like to thank Lena Gonzalez and her staff, Corey Tyler.'",
        "'speaker_2': 'Jennifer and your staff has been amazing. So I really thank you guys all. I also would like to thank Darryl Zupan and Denise Pierce for sponsoring us. So I want to tell you a little story of a person that I once knew.'",
        "'speaker_2': 'When I was in college, I was pretty depressed. Add to options. One was to commit suicide. The other was to live a fake life. The third option of me being up here was not bankable. And luckily I have a supportive family.'",
        "'speaker_2': 'Who have inspired and encouraged me to become an entrepreneur. But there are so many others that aren't so lucky. They ended thinking. That it doesn't exist. So today, if you prove this, yes, you're providing opportunities for others, but you're doing a lot more.'",
        "'speaker_2': 'You're providing light. And Hope. That somebody you can become an entrepreneur, a leader, an employer. So I'm proud to live in Long Beach, and I'm proud to own my own business. I also want to tell you a story of one of our members.'",
        "'speaker_2': 'Her name is Chris Christie and she owns Chris Industries. Unfortunately, she cannot be here today because battling cancer. So my thoughts and prayers go out to her. But she is a certified LGBT and with the private sector. Last year she received half a million contract with Turner Construction and then Sony.'",
        "'speaker_2': 'So whenever a small business lands, you know, a nice piece of business, they can keep going and plan another piece of business and another piece of business. So if you're approved today, you can pave the way for other businesses like Grace Industries to bid on contracts they wouldn't have done before.'",
        "'speaker_2': 'The City of Long Beach can make this can really make that business. So today, I hope you lead our nation in becoming the first city in California to recognize LGBT BS, but also certified veterans and certified people with disabilities.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_8': 'Good evening, council members. Good evening, Mr. Mayor.'",
        "'speaker_10': 'Good to see you. My name is John Newell.'",
        "'speaker_8': 'I am as well as the past president of AIDS Foodstore, a member of the LGBTQ center. I am on their board of directors, honored to be there and wanted to.'",
        "'speaker_10': 'Kind of represent.'",
        "'speaker_8': 'The center and let you know what what we're thinking about the agenda item.'",
        "'speaker_10': 'The center strongly supports this agenda item to recognize LGBTQ majority owned businesses in Long Beach.'",
        "'speaker_8': 'As part of the city's procurement and processing. The agenda item utilizes the existing certification through the.'",
        "'speaker_10': 'National LGBTQ.'",
        "'speaker_8': 'Chamber of Commerce to increase the equity.'",
        "'speaker_2': 'Of LGBTQ owned.'",
        "'speaker_8': 'Contracts through the city's existing.'",
        "'speaker_10': 'Contract and bidding process. The Center is incredibly grateful to Council Councilwoman.'",
        "'speaker_8': 'Lena Gonzales for her continued leadership in increasing.'",
        "'speaker_2': 'Equity with.'",
        "'speaker_10': 'LGBTQ residents and business owners for our city. And furthermore, we'd like to applaud the Council Women's Initiative.'",
        "'speaker_2': 'And also seek.'",
        "'speaker_10': 'Increasing economic opportunities for veterans people with disabilities through this agenda item. The Center would also like to thank all the council people who have supported this agenda item, and we thank you so much for your continued support.'",
        "'speaker_2': 'Of the LGBTQ community.'",
        "'speaker_0': 'Thank you, Mr. Laura. And then we're going to go to a vote.'",
        "'speaker_10': 'Good evening, Mayor Garcia and members of the City Council. My name is Eduardo. Lara and I live in the second district. I also serve as a board of director.'",
        "'speaker_8': 'For the LGBTQ center and a faculty member in the.'",
        "'speaker_10': 'Sociology department at Cal State Long Beach.'",
        "'speaker_8': 'I'm also here to strong support this proposed agenda.'",
        "'speaker_10': 'Item in recognition that LGBTQ majority owned businesses in Long Beach as part of the city's procurement and.'",
        "'speaker_8': 'Purchasing processes, as well as veterans, and in particular those with disabilities. Or as one of my visually impaired students, this semester has gladly shared with me those that have diverse abilities. The best moment that.'",
        "'speaker_10': 'I can share with all of you in terms of highlighting the importance and importance of initiatives like this, really goes back to a short little vignette.'",
        "'speaker_8': 'That I want to espouse to all of.'",
        "'speaker_10': 'You. About two.'",
        "'speaker_8': 'Or three weeks ago, our dryer broke.'",
        "'speaker_10': 'And.'",
        "'speaker_8': 'We had to call someone to come in to take a look at the dryer. And it was quite obvious to us that the person who checked out the dryer was very homophobic.'",
        "'speaker_10': 'Not even 30 seconds into going into the home. It was very visually apparent.'",
        "'speaker_8': 'To us with his mannerisms and lack of communication and really his observance of me and.'",
        "'speaker_10': 'My husband's pictures all around of.'",
        "'speaker_8': 'Us, that it made him quite.'",
        "'speaker_10': 'Uncomfortable. And so.'",
        "'speaker_8': 'In that moment was a sobering.'",
        "'speaker_10': 'Reminder of how rampant.'",
        "'speaker_8': 'Homophobia, unfortunately, still.'",
        "'speaker_10': 'Continues to.'",
        "'speaker_8': 'Permeate through our society. So that is just one of many countless examples. Also, as I go to some of my colleagues.'",
        "'speaker_10': 'Here of how important it is to create.'",
        "'speaker_8': 'Policies that move the needle forward when it comes to representation for historically marginalized groups. And if I can also take a moment.'",
        "'speaker_10': 'To echo the importance of also including those that been imprisoned, but then have also made their way out of prison in order to create opportunities for those highly vulnerable populations. I like to also.'",
        "'speaker_8': 'Put my sentiment forward here in supporting initiatives like that that try to, as someone previously said, create a braided approach towards.'",
        "'speaker_10': 'Equity within the city. So I applaud this effort and I commend the city of Long Beach in terms of leading the charge forward to creating a more.'",
        "'speaker_8': 'Diverse and inclusive.'",
        "'speaker_10': 'City.'",
        "'speaker_8': 'And I look forward to the vote. So thank you very much.'",
        "'speaker_0': 'Well, thank you very much, Mr. Lora, and thank you to all the speakers. We have a motion in a second on the recommendation. Please cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive and file the Factfinding Report issued by the Factfinding Panel as part of the impasse process; and   Adopt resolution pursuant to California Government Code Section 3505.4, authorizing the implementation of the terms of the City's Last, Best and Final Offer, described in the October 24, 2018 correspondence to the International Association of Machinists and Aerospace Workers (lAM), detailing the Scope of Service on the Airport Security Division and Long Beach Police Department Integration.  (Citywide)": [
        "'speaker_0': 'We're going to move on to the so-so item here, which is next on the agenda. So if I can have the clerk, please read the.'",
        "'speaker_1': 'Perfect Report from Human Resources.'",
        "'speaker_3': 'Recommendation received file of fact finding report issued by the Fact Finding.'",
        "'speaker_1': 'Panel and adopt a resolution authorizing the implementation of the terms of the city's last, best and final offer.'",
        "'speaker_4': 'Described in the October.'",
        "'speaker_1': '24th, 2018 correspondence to the IAM detailing the scope of service on the Airport Security Division and the Long Beach Police Department and integration citywide.'",
        "'speaker_0': 'Thank you. Thank you very much. We are going to be opening up the next item, which is our 29. Appreciate that. I want to also just I know we're going to go into the item there. There are two parts of this item.'",
        "'speaker_0': 'So I just want to make sure that we're clear and it will require two separate votes as presented by the staff. The first part of the vote is to receive and file the fact finding report, which we will hear in a minute from staff as part of the this process.'",
        "'speaker_0': 'The second part, obviously, is actually adopting a resolution that would actual implement the terms of the city's last, best and final offer. It's there there has been a lot of discussion on this item, a lot of interest, rightly so, on an item that is important for us as a community.'",
        "'speaker_0': 'And so my recommendation is going to be that we hear the report as presented by staff. Then we allow the Council to ask all of its questions, which I think are important. There are a lot of questions that we also allow the public to comment so that the public is able to give their perspective on the report'",
        "'speaker_0': 'and their input, and so that the public the public process is out in the open. And then we receive and file the report as presented by staff. The second part of the motion, which is actually to implement the last, best and final offer, I'm going to recommend that we postpone the second part and to to a later'",
        "'speaker_0': 'date in May, a set by the city manager so that there could be some additional consideration by the council and some possible discussion. And so that is what will be my recommendation. Obviously, the Council will have an opportunity to to to look at that as we move forward.'",
        "'speaker_0': 'But I want to begin then the first part of this, which is the receive and file of the fact finding report. And and we'll go from there. So with that, Mr. West.'",
        "'speaker_8': 'Thank you, Mr. Mayor. Council members. So our goal tonight, the action before you tonight will place our well, the action before you tonight. We'll place our police department in a supervisory capacity over all of our law enforcement officers at our Long Beach Airport.'",
        "'speaker_8': 'Currently, our 27 airport special security officers, all who carry firearms, are supervised by the airport director who has no public safety supervisory experience, not the police department. This is simply an organizational shift. All SOS will continue to carry weapons.'",
        "'speaker_8': 'All Eso's will continue to be. I am members. All Eso's will continue to work their regular duties at the airport. All Eso's will continue to maintain their classifications and salaries. This organization shift simply puts our eso's at the airport under police department supervision.'",
        "'speaker_8': 'There is precedent for this. In 2004, we had 30 Marine patrol officers. All of those officers carried weapons. They all reported to the Marine bureau manager who had no public safety experience. In 2004, we shifted our Marine patrol officers to the police department where they are supervised now by the police department.'",
        "'speaker_8': 'These Marine bureau patrol folk continue to carry firearms. They continue to be. I am members. They continue to be Marine patrol officers. They're simply now supervised by the police department as opposed to the Marine bureau manager who had no public safety experience.'",
        "'speaker_8': 'Just recently we removed we moved our park rangers from Parks and Recreation to the police department instead of being supervised by the Parks and Recreation director, again, who has no public safety supervisory experience. These park rangers are now supervised by the police department.'",
        "'speaker_8': 'They continue to carry firearms. They continue to be. I am members. They continue to be park rangers. So with that, I'm going to turn it over to our H.R. director and one of our managers. So Alex Vasquez and Dana Anderson will give the report.'",
        "'speaker_4': 'Good evening, mayor and council members. I want to introduce Dana Anderson. She's the bureau manager for labor relations and also Elmer Rodriguez Moosa, who's our outside counsel there, was involved in our negotiations on this.'",
        "'speaker_3': 'Particular item that went to a fact finding. So I'm going to turn over to Dana first and then we're happy to answer any questions.'",
        "'speaker_12': 'So that evening, Mayor and city council over the past year, representatives from city management and to enter in the International Association of Machinists and Aerospace Workers, also known as I am, have held a number of meet and confer sessions regarding the impacts of the integration of the Airport Security Division and the airport police detail into one section'",
        "'speaker_12': 'which would fall under the command and control of the Long Beach Police Department. The decision to integrate is to provide efficiencies through a better coordination of effort and one structural chain of command, both resources and personnel, including supervision, training and and deployment of staff to achieve consistency of public safety and maximize airport security efforts.'",
        "'speaker_12': 'The airport security division has been providing security and safety services for decades, and in response to increased security concerns following the terrorist attacks on September 11th, 2001, the police department assigned an airport detail to augment the airport security division.'",
        "'speaker_12': 'In 2002, the city noticed the item in January 2015 of its intent to integrate the airport security division special services officers, also known as SOS and the Airport Police Division into one division to align their respective responsibilities, which was scheduled to move forward on April 1st, 2015, but was delayed.'",
        "'speaker_12': 'The purpose here is to have police in a supervisory capacity over law enforcement officers. At the airport on January 26, 2018, the city decided to proceed with the integration and again noticed I am of its intent to integrate the airport security division personnel and the airport police detail into the newly created airport police section.'",
        "'speaker_12': 'The reorganization was adopted by City Council for f y 19, contingent upon the completion of the ME to confer process with applicable unions. The reorganization does not impact employee salaries and would not result in additional police officer or CSO positions, and the requested action is not expected to require additional staff hours beyond the norm.'",
        "'speaker_12': 'The normal budget is scope of duties. After several months of negotiations and exchanges of proposals, the city declared impasse and provided written notification to. I am on October 24th, 2018 that we included the terms of the city's last, best and final offer, detailing the scope of service and items discussed as part of the public sector.'",
        "'speaker_12': 'Negotiation process. Once impasse has been declared, unions have the option to request a fact finding before an agency can impose their last, best and final offer. I am requested fact finding on November 21st, 2018, and the fact finding hearing was held on February 8th, 2019.'",
        "'speaker_12': 'The panel's report being issued on March 5th, 2019, which is attached to the council letter. The fact finding panel's report is advisory and provided the recommendation that the city implement its last, best and final offer for reasons stated in the fact finding panel's report.'",
        "'speaker_12': 'The city concurred with the recommendations of the fact finding panel and requests city's authorization to implement the terms of the city's last, best and final offer. This concludes the presentation and we are open to answer any questions.'",
        "'speaker_0': 'Great. I know we do have questions from council. I think there's been requests to do public comment and hear from the public first. So if you have public comment on this item, remember there's only one motion on the table right now which is to receive and file the report.'",
        "'speaker_0': 'So, please, any public comment, please come forward. The second part when we vote on the second part of the motion, which would be to to postpone the staff recommendation to implement that there would be public comment on that item as well, I believe.'",
        "'speaker_0': 'Right. Mr. City Attorney.'",
        "'speaker_10': 'Okay.'",
        "'speaker_0': 'Okay. So there's no I see no public comment on the receiving file of fact finding report. So let me go ahead and begin with Councilwoman Munger.'",
        "'speaker_4': 'Thank you. I have. Empathy for the police officers. Many of you know that I am a peace officer in the state of California, and so I empathize with the concerns of our USO's having lost some of their status.'",
        "'speaker_4': 'And it's my understanding that they have up to three years to join a general law enforcement agency. So one of the things that I think might be helpful is finding a way to get there. I don't think that that really happens in this process.'",
        "'speaker_4': 'And so with that, I'm open to hearing from my colleagues.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_3': 'And thank you. STAFF So I just wanted to to clarify a couple of things. You mentioned that. The officers would stay eso's.'",
        "'speaker_8': 'Yes. Correct.'",
        "'speaker_3': 'And that there would be no effect to their salaries. Correct. Is that indefinitely, or is there a time in the future that that could change?'",
        "'speaker_8': 'Would only change if there through a city council action there. Suppose we need them to be at the airport and we have no intention of changing their status at all.'",
        "'speaker_3': 'So the changes that they would be supervised by PD.'",
        "'speaker_8': 'It just who supervises them? Police department or the airport director.'",
        "'speaker_3': 'Or the airport director? Okay. Second question is and I know that there's some questions that we you know, just if you can answer this question, that'd be great. How many hours of training do officers do so officers currently have and how many would they be receiving if the supervision changed?'",
        "'speaker_8': 'I don't know how many they currently have. Perhaps someone else can answer that. I do know that by going to the police department with the training bureau, they'll have the opportunity. I think Post is going to offer, you know, 38 more training opportunities than they have today.'",
        "'speaker_8': 'So we expect the opportunity for much more training.'",
        "'speaker_3': 'I think we have the chief there. Chief, are you able to answer that question?'",
        "'speaker_10': 'Yes, ma'am. I'll do my best to try to answer that. So, Mayor. Members of the City Council. Any training moving forward would be proportional to the security officers duties. I believe under what we're proposing, the actual training would increase as we move forward as we have with.'",
        "'speaker_10': 'Please note that we have over 120 security officers that work for the police department now. Mr. West indicated some of the positions there and in all cases, when people were brought in under the brought to or under the umbrella of the police department, the training actually increased.'",
        "'speaker_10': 'That is obviously our field, whether we're talking about general law enforcement or security. And we're able to go out and look for the appropriate training classes so that all of our employees, whether sworn, civilian or otherwise, can participate in the best training to provide the best service to our community.'",
        "'speaker_3': 'Okay. Moving forward, I would love to to know some solid numbers moving forward, but for tonight, I'm okay. Um, I also wanted a point of clarification. I thought there was 27, as I said. Is that are airport.'",
        "'speaker_10': 'That's correct. There are currently 27 budgeted positions for security officers at the airport. And just to go back to your the previous question about training so we can complete that tonight, we are proposing that as we move the security officers from the airport under our family to Long Beach Police Department, that they're going to be attending a'",
        "'speaker_10': '30 hour Long Beach Police Department specific course designated to assimilate them into our organization and working environment. Beyond that, our department provides advanced officers training that we do provide to some of our security officers every year, and they would fall under that as well, which they do not currently receive in their current airport climate.'",
        "'speaker_3': 'Okay. And one other point of clarification. There's 27 budgeted positions. How many positions are actually filled right now?'",
        "'speaker_10': 'I believe it's 15.'",
        "'speaker_3': '15. I think there's 15 actually less than. Is there a reason why those positions aren't filled up to the full 27.'",
        "'speaker_10': 'Primarily because of a lot of what's going on here tonight. We've been going back and forth, would meet, confer and so on and so forth. And I think we in order to move forward and in order to fill those positions, we need to make sure that new employees coming in know exactly what they're going to be, what'",
        "'speaker_10': 'duties are going to be performing.'",
        "'speaker_3': 'Great. Thank you. I want to, you know, recognize that I asked some of these questions previously of you and of staff. And, you know, this is one of those areas that there's there's a lot of information that's available.'",
        "'speaker_3': 'And as a councilmember really trying to make the best decision and really trying to have all the facts in front of us so that we understand, obviously, an airport, you know, having 80% of the port in my district, safety is an utmost concern for me.'",
        "'speaker_3': 'And thinking about our airport the same. And so the question that I had asked before was, have there been issues, have there been situations outside of fact finding that we can do this? Have there been situations that cause concern for yourself or for our city manager on making this shift?'",
        "'speaker_10': 'I will do my best to answer that as well as your police chief. I have put this proposal to integrate forward as part of a team with the city manager under the direction of the city manager and in conjunction with the Human Resource Department and the City Attorney's Office.'",
        "'speaker_10': 'I would not be putting my name to anything that I didn't think was going to be advantageous to our entire community as far as safety goes. We're talking about the Long Beach Airport. The Long Beach Airport is ours and it is our intent to keep that safe.'",
        "'speaker_10': '24 seven. I know there's been a lot of comments made recently in the media, which I think are absolutely ridiculous that we're not going to be keeping an eye on our airport 24 seven which does cause citizens to call in and say, What the heck is going on?'",
        "'speaker_10': 'I'm not in the business of scaring people. I'm in the business of protecting people. And I assure our community that we are going to this plan will make our airport safer. So to continue with that, if you look at and again, the security officers that we have at the airport, great people, every single one of them.'",
        "'speaker_10': 'I can't wait if all of you approve to have them as part of our organizational family. But we've got to think about liability. And as we move forward in this current security and law enforcement environment, there has never been a time when law enforcement or security is being questioned more about what we do on an everyday basis'",
        "'speaker_10': '. Everybody we stop. Everybody that we deal with constantly questions our policies. They question the level of accountability that we have. So when we're talking about use of force, foot pursuits, vehicle pursuits, all those things, those are things that we considered as we looked at the current policies that either exist or don't exist to make sure that we'",
        "'speaker_10': 'were going to, one, make this airport and community safer and allow this body to be as free of of risk or liability as we possibly could. So at the end of the day, that's why I'm recommending to you that recommending to you as a chief of police, that I'm I get held accountable, putting my name on the'",
        "'speaker_10': 'bottom of the paper when I am reviewing a use of force or something, God forbid, something more significant that your chief of police should be handling. And I think this community expects their chief of police to handle those type of challenges.'",
        "'speaker_8': 'Councilor, I'd like to point out, too, that a lot of this is coming from me as your city manager. Basically, it's just a personal promise that I have that I personally don't have law enforcement supervisor experience, so I shouldn't be supervising department that carries weapons, carries firearms, carrying lethal weapons.'",
        "'speaker_8': 'Additionally, our airport director, interim director Claudia Lewis, currently right now, she is the supervisor of 27 people at the airport that that carry weapons. And and clearly, Claudia doesn't have that supervisory experience either. So we just feel, as we did with the Marine bureau, as you do with the park rangers, if you're carrying lethal weapons, you should'",
        "'speaker_8': 'be under the police department's purview and not the not a department head.'",
        "'speaker_3': 'So I appreciate the response. And I think for all the reasons, Chief, that you laid out is probably why we have some community concerns coming up. And I just want to be honest, because I know that we've had lots of these conversations.'",
        "'speaker_3': 'And and so that's why it's taken me a step back today to be able to. Making the right decision. And if we haven't had those situations yet, that we really are thoughtful about this next step. So I want to hear from my colleagues.'",
        "'speaker_3': 'You know, I appreciate the 30 extra hour offer. I don't know what they currently got. And want to just clarify that there's 1527 currently there. But I look forward to hearing from my colleagues. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Vice Mayor Andrews.'",
        "'speaker_7': 'Yes, thank you, Mayor. Before I get started here and some of my questions I will be asking can be done with the yes or no. Before I get started, I just want to state that the Long Beach, you know, has a great police department and a great airport, which has a great group of security officers who have'",
        "'speaker_7': 'the primary responsibility for securing the safety of the airport. I understand the efficiency that can occur by placing so under the police department control. However, I want to fully understand the potential impact to safety and security as well as working conditions of Esso.'",
        "'speaker_7': 'My questions are and they can be done with the yes or no with the number of positions sold at the airport be maintained.'",
        "'speaker_8': 'Yes.'",
        "'speaker_7': 'Well, the hours of deployment be maintained 24, seven and through and 65 days a year.'",
        "'speaker_8': 'Yes.'",
        "'speaker_7': 'What is the status of the so?'",
        "'speaker_8': 'Chief.'",
        "'speaker_10': 'I'm sorry, Councilman. Can you please or. I'm sorry, Vice Mayor, can you please repeat the question?'",
        "'speaker_7': 'What is the status of an as? Oh, would that be maintained or if not, well. Well, if it not maintaining with the SS. Oh. Have the equivalent of training. You are posturing. Yes.'",
        "'speaker_10': 'I'm sorry, sir. The status will remain the same.'",
        "'speaker_7': 'Okay. And will it be maintained? You're saying? Yes. Or if not will to maintain be the CSO have the equivalent of the training that the others have.'",
        "'speaker_12': 'I'm sorry. Are you asking about that? The post training?'",
        "'speaker_7': 'Yes. What is the status of that for the ASOS?'",
        "'speaker_10': 'Okay. I'm sorry, sir. I didn't understand you. That was my fault. On the first one regarding the post training. Post is a state organization and initially there were several officers who attained post certificates. And when Post went back to review the information, they found that they incorrectly issued those certificates.'",
        "'speaker_10': 'And so that is a state of California post issue that does not have anything to do with the city of Long Beach.'",
        "'speaker_7': 'Okay. Thank you. Okay. So, uh, another question. Will this move affect any representation by the I am training status in a direction that people are under?'",
        "'speaker_8': 'No.'",
        "'speaker_7': 'I think because of that, I really think this is kind of confusion and I don't think we should have really ever gotten to this point. But I'm going be willing to listen to my other colleagues and I'll move on from there.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Andrews, Councilmember Richardson.'",
        "'speaker_6': 'Thank you, Mr. Mayor. So my colleagues have asked some good questions, and so I won't try to dove into the weeds here. So. Mr. City Manager so we've been in negotiation for a period of time. It's come to a point where a fact finding was requested.'",
        "'speaker_6': 'That fact finding report we received today, that fact finding report summed up, essentially said that that the chief has the authority to make this make this change. Correct.'",
        "'speaker_8': 'The city manager has the authority.'",
        "'speaker_6': 'Okay. And so the city manager certainly now, I guess there's a sentiment in the community that there if the council voted to if we had voted to do that, there's an unintended consequence of somehow the security circumstances that at the airport would somehow be diminished.'",
        "'speaker_6': 'And there's also a concern about not being federally compliant or not having a federal law enforcement official on site 24 hours. So my question is, can you, Mr. Chief, can you just speak to whether there's. I know that there's a perception, but is there anything to this?'",
        "'speaker_6': 'And and have you have you done any thinking about this this federal issue? Have you heard about this issue of this federal standard of a law enforcement official needing to be on site 24 hours?'",
        "'speaker_8': 'Councilmember Before we answer the first part, let's get to the second one. I'm going to turn it over to Gary perhaps to have that discussion. Actually, Marion, councilmembers are going to have outside counsel Irma.'",
        "'speaker_10': 'Rodriguez addressed the federal issue that you just raised about. Sure. The quality of it.'",
        "'speaker_4': 'Good evening, Mayor, and members of the council. This issue, with respect to the legality of the proposal under the homeland security regulations was first raised at the Fact-Finding Panel stage by IAM. I have carefully reviewed the cited regulations and I'm here to opine that the proposal with respect to the integration complies with those regulations.'",
        "'speaker_4': 'And I'll explain why the regulations generally set forth that the city or the operate in which the airport operates has a discretion to determine for itself the appropriate security program. And what it is required to do is to have an appropriate number and manner of security program that is adequate to support our security at an airport here'",
        "'speaker_4': '. The city has is not changing the program. It is changing the reporting of where the ESOS currently report. There is no plan to change the number of individuals, change the number of hours and in fact has been previously testified.'",
        "'speaker_4': 'The program is intended to enhance security by allowing the CISOs to focus on security duties at the airport as opposed to on near the airport premises. Second, the regulations also require that those individuals who are providing these security services have to meet certain minimum qualifications and have certain training programs as to the minimum qualification they have to'",
        "'speaker_4': 'have the authority to arrest. Nothing in this proposal changes that authority. They will continue to meet the minimum qualification of having the authority to arrest. With respect to the training program, what the regulations provide is, again, discretion to the local agency to provide a training program that it believes satisfies its security program detail.'",
        "'speaker_4': 'And it says, quite frankly, that it can either be state regulations or guidelines or local agency or guidelines. The reason it is my opinion that the state regulations are satisfied is that the state agency post has determined that the CISOs do not need to be a post certified to in order to do their position.'",
        "'speaker_4': 'Second, our local agency, our police department, has developed a training program that they believe is best tailored to provide the training that the security officers need to provide the security services. So that is my assessment of the legal homeland security regulations.'",
        "'speaker_6': 'Thank you. And then the second part, someone will respond to me.'",
        "'speaker_8': 'I'm sorry. Could you repeat the first question? Sure.'",
        "'speaker_6': 'So he so much for that that explanation on. So I see some diligence have been done to that that issue. The second piece is that there's a perception that there's an unintended consequence to making this change, that somehow there is the airport is less safe.'",
        "'speaker_6': 'And if there is and my interest is simply if we take the bargaining process to the side, you know, and separate that because that has its own processes and it appears that's being followed, if there's an unintended consequence, consequence for safety, then I'd just like to sort of narrow the conversation and see if there's a gap.'",
        "'speaker_6': 'How do we just fill the gap and ensure that that the presence of safety is still there? So I guess the question is, is there a lack of service? Is there going to be a period of time where there will be no, you know, no security at the airport?'",
        "'speaker_6': 'Any gaps in service whatsoever?'",
        "'speaker_10': 'Councilman Richardson? No, the simple answer to that is no.'",
        "'speaker_6': 'Okay.'",
        "'speaker_10': 'As we move forward, the plan, the proposed integration plan that we put together utilizes the expertize of the airport security officers that we have. The airport police officers that we have, puts them under one chain of command under a police lieutenant, which was an out there before.'",
        "'speaker_10': 'Improves communication and coordination. Maintains regulatory compliance. And at the end of the day, when we're talking about safety, it's not only community safety but officer safety. And so we're mitigating liability. At the same time, we believe that our organizational values, our training programs, our equipment, our resources and our discipline will improve safety for everybody involved out there'",
        "'speaker_10': 'and make it much better than what it has been.'",
        "'speaker_6': 'Thank you. Love to hear from the public. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember. Councilor appears.'",
        "'speaker_3': 'I had first the question were at 12 or 15 oiseaux at the airport. We also have new flights coming and going. So I'm assume that we're going to have more people coming and going. And so can we get a timeline on when we expect all 27 positions to be filled regardless of this process or not?'",
        "'speaker_8': 'We'll be able to get you something right away, perhaps in a day or two.'",
        "'speaker_3': 'Okay. And then my next one is more of a comment and not a question because we're kind of dancing around it. The question of airport security for me is, one, the number of hours of training. And I appreciate the number of hours that our police chief has told us.'",
        "'speaker_3': 'I look forward to hearing from IAM on how many hours of training they provide. And two is just the reality that some folks, people of color, Latinos, friends just don't feel comfortable around. PD So the question for me is, are these officers going to be in security clothes?'",
        "'speaker_3': 'Are they going to be in PD clothes if they were to switch over?'",
        "'speaker_10': 'I absolutely respect the fact about the people of color, which I am one of. About the way they feel about police. That's the way I grew up in regards to uniforms. And just going back to the training. In the last several years, our police officers have received many hours in training with implicit bias, procedural justice.'",
        "'speaker_10': 'And I could go on and on.'",
        "'speaker_3': 'You know, I know you have that.'",
        "'speaker_10': 'We've had in regards to the uniform that the airport security officers will be wearing, the uniform itself will not change.'",
        "'speaker_3': 'Thank you. Look forward to public comment.'",
        "'speaker_0': 'Councilwoman Mungo.'",
        "'speaker_4': 'I just want to ask another question. Is our airport safe? Currently are we meeting the standards and is our airport safe? Because I'm it's just really frustrating and irresponsible to lead the public to believe otherwise, unless it is factually.'",
        "'speaker_8': 'I'm going to answer that first. I'll leave it I'll leave it to the chief in a moment. And I'm looking to our interim director, Claudia Lewis. If we do not have a safe airport, we will not have an airport.'",
        "'speaker_8': 'Our airport would be shut down so fast if we didn't have a if we didn't have an ability to provide safety with our fire department. There are police department there working with TSA and FFA. So I just want to assure you that there is no such thing as a as an unsafe airport.'",
        "'speaker_8': 'If you have an unsafe airport, the airport's gone. You don't have an airport.'",
        "'speaker_4': 'I appreciate that. I think that it's really important to just be clear that it is still safe to travel out of Long Beach Airport. No flights have been added since 2000 and maybe 16. When we added the nine slots, we're still at 50 slots a day in and out of the airport.'",
        "'speaker_4': 'And so the passenger ratio and the flights and all of that has been maintained. Many of you know what the airport is in my district. Many of you also know that I am a PC a32 certified. I'm a PC eight 30.2 certified peace officer in the state of California.'",
        "'speaker_4': 'I'm very familiar with the training requirements. I've had extensive discussions about these changes and I had a wish we wouldn't be where we are right now. But I. I hope that in listening to the public, we can hear from them potential solutions to to make sure that we can find a way to get through this tonight.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_1': 'Yes. Thank you so much. And I'm of the same mindset. I think we're all here for the similar purpose, consistency and safety. First, of course. Just a couple clarifying questions, I think, to Councilman Richardson's point. You know, we did receive a letter from our Congressmember Alan Lowenthal, and I just wanted to make sure I was getting clear'",
        "'speaker_1': 'as to what is currently. Who currently has the authority now to arrest on in the airport. I'm just get I need to get that clear in my head as to if there's any changes once if this were to move forward what type of training.'",
        "'speaker_1': 'I know we've gone over it, but I need to just get that super crystal clear as to where we're at now and what this would.'",
        "'speaker_8': 'There would be no changes to arrests or how it operates.'",
        "'speaker_1': 'None whatsoever.'",
        "'speaker_8': 'None whatsoever. They're just BS. You would still be supervised by the police department instead of Miss Louis, so they would basically be exactly the same, except you've got someone to you differently and there will be other training opportunities.'",
        "'speaker_1': 'So there's no difference in authority versus PD or ESSOS right now.'",
        "'speaker_8': 'Well, the authority the authority would go through the police department instead of Ms.. Lewis.'",
        "'speaker_1': 'Right. Okay. Okay. Second question.'",
        "'speaker_0': 'Maybe, councilman, to stand to partly answer that question, maybe you were alluding to this. And I mean, I'm not sure if everyone is aware. So currently as it exists right now, Palm Beach PD operates out of the airport.'",
        "'speaker_0': 'And so currently we both have both Eso's and we have also the Long Beach Police Department. And they actually work together concurrently on airport security, along with other federal agencies, airport staff and a variety of of security measures.'",
        "'speaker_0': 'Of course, that's necessary with both the federal level and the local level to make security happen. And so just also want to clarify that I think there's a misconception about PD being there or not being there. And Lombard PD is on site as of course, are the the S.O. team.'",
        "'speaker_8': 'Aps-C trackers, 15 police officers assigned to the airport. There's 27 eso's assigned to the airport.'",
        "'speaker_12': 'There's.'",
        "'speaker_1': 'I think that's why I'm mentioning this, because I think there is a lot of confusion around that. And you're seeing we're seeing it out in the press as well. So I just want to make sure we're I know it's difficult, but, you know, just to make sure we're super clear on that, because I don't think everyone understands'",
        "'speaker_1': 'that necessarily. And then the second question is. Also the proposed I mean, there's a proposed schedule that would include gaps, you know, between 10 p.m. and 5 a.m.. So we're saying there would not be any gaps. Again, I'm just want to make sure we're clear because it is out there.'",
        "'speaker_1': 'And I know, Chief, you've mentioned that that is not the case. So if you can just can continue responding to that.'",
        "'speaker_10': 'Councilwoman again, Councilwoman Gonzalez, thank you for that question. And it's something that keeps on coming up. Again, there were misstatements made in the press rhetoric. They're not factual. Our airport is covered 24 hours a day, seven days a week.'",
        "'speaker_10': 'And for our citizens or anyone that intends to travel through the Long Beach Airport or Long Beach Airport is absolutely safe. Are we always looking for ways to improve? Absolutely we are. But for anybody who either read or heard on the radio that we don't have any coverage between 10 p.m., 11 p.m. and 5 p.m..'",
        "'speaker_10': 'If anybody out there is listening to me, watching me on television, you try to commit a crime at the Long Beach Airport. During those hours, you're going to get arrested. There's going to be consequences. That airport is safe.'",
        "'speaker_10': 'It's covered. It has been and it will be.'",
        "'speaker_1': 'Thank you. And I think, again, I'm we're going to capture that and put it somewhere, because I think everyone needs to understand that that's very important. So with that, I would just say thank you for this. I'm looking forward to hearing more as well.'",
        "'speaker_1': 'I needed to clarify a few things on my end because it did get a little bit hazy on on my end in understanding where we're currently at. And then what brought this forward even after, you know, we've had a lot of catastrophes in the past and now it's, you know, some time later and we want to make'",
        "'speaker_1': 'sure we're keeping the airport as safe as possible here in Long Beach. Those are my questions and we will move forward.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman Councilman Austin.'",
        "'speaker_5': 'Thank you. I'll be brief. This is a while. It seems like it's more complicated than it needs to be, in my opinion. I think I did have a couple of questions just to kind of summarize how we got here.'",
        "'speaker_5': 'The meeting confirmed process, whenever there is a change in policy or duties or wages and benefits, there's there's an obligation to meet and confer. Is that correct?'",
        "'speaker_12': 'Yes.'",
        "'speaker_5': 'Can you explain to the public and those listening what the meeting confer actually consist of?'",
        "'speaker_12': 'Sure. So the meeting of our process basically consist of the well, actually in this particular instance, this was a managerial decision whenever the city has the authority to make management decisions. But whenever we do so, we have to me to confer over the impacts of that actual decision.'",
        "'speaker_12': 'So in this particular instance that the media confer comprised of the impact of the changes as a result of PD taking oversight of the airport security officers.'",
        "'speaker_5': 'Okay. So during the meeting for process, obviously you met and confer with the bargaining representatives. I am.'",
        "'speaker_12': 'Correct. That is correct. Both I am in.'",
        "'speaker_2': 'And.'",
        "'speaker_5': 'How many meetings that you have in over or over what period of time?'",
        "'speaker_12': 'There were ten meetings, approximately eight and a half months.'",
        "'speaker_5': 'How long did each meeting last?'",
        "'speaker_12': 'Approximately about an hour and a half.'",
        "'speaker_5': 'Okay. And where? A proposal was exchanged.'",
        "'speaker_12': 'The city presented a, I believe, a total of seven. And we received one from I am.'",
        "'speaker_5': 'I wanted to to also discuss the existing chain of command at the airport with as a source. We've heard that they report to the airport director. But in terms of strategic security protocols and things of that nature, who do they report to now?'",
        "'speaker_5': 'What is the chain of command for?'",
        "'speaker_12': 'So currently the chain of command at the airport. The CEOs report directly to the deputy director, Mr. Juan Rios Lopez.'",
        "'speaker_5': 'Mr. Lopez. Well, welcome. Okay. And does he have any sort of security?'",
        "'speaker_12': 'No, he does not. He does not have. No, he does not have any security background or specialty or certifications.'",
        "'speaker_5': 'Okay. So that brings me to my next point. In terms of training existing, what type of existing training like for the skills today? What type of training do they receive to do their job and to keep our air ports safe?'",
        "'speaker_12': 'So currently there was a policy established in 2016 which afforded the opposed to go to post post training.'",
        "'speaker_5': 'Up until when it started?'",
        "'speaker_12': 'Well, I think they have been doing it prior to, but I believe there were varying levels between Poles wanting to. But as of 2016, they established an actual policy stating.'",
        "'speaker_5': 'So let me go back to the is there a supervisor, is there a a.'",
        "'speaker_10': 'A.'",
        "'speaker_5': 'Like a lieutenant? Is there a chain of command for the officials existing?'",
        "'speaker_12': 'Currently there's the SS. So low levels they have three and then they have for which the fourth act as supervisors. But they report directly to Mr. Lopez Rios.'",
        "'speaker_5': 'It's a supervisor position, not a lead position.'",
        "'speaker_2': 'Correct.'",
        "'speaker_5': 'Okay. And so the existing training you said is it was was Porte Post or is post.'",
        "'speaker_12': 'Correct. Currently, because we haven't we haven't moved forward in the integration. So currently it is post.'",
        "'speaker_5': 'And it was since 2015, there's been no training.'",
        "'speaker_12': 'So there haven't been any new souls to be sent to training.'",
        "'speaker_5': 'Okay. And if they were to go under the direction of the Long Beach PD and the chief of police, I heard the chief say that there would be more training opportunities. And that kind of concerns me a little bit because to me there it doesn't sound like there has been a whole lot of emphasis on training and'",
        "'speaker_5': 'perhaps the chief could answer this question should this this integration happen? What type of training would you be able to provide these employees to keep our airports safe beyond what they have already received and what they're receiving now?'",
        "'speaker_4': 'So one thing I'd like to clarify. So one of the things that will happen with this integration is that.'",
        "'speaker_2': 'Or.'",
        "'speaker_3': 'As we were going through the mean confer process.'",
        "'speaker_4': 'We also recognized that it was necessary to evaluate what type of training is appropriate for the duties that the CISOs perform. And I think that's one of the.'",
        "'speaker_3': 'Key things that came out.'",
        "'speaker_4': 'Of this process is just identifying what level of training is appropriate, and then also identifying other post certified training that could be made available to the employees. And that's what we outlined in the report. But I'll go ahead.'",
        "'speaker_2': 'To the chief. Sorry. You don't have to get.'",
        "'speaker_10': 'Councilman Austin and try and answer your questions. So in regards to the opportunities for post training, there are at least I mean, look at my notes. I don't want to get the number incorrect. There are 36 courses in the post catalog that are hopefully new employees will have an opportunity to go to in the future.'",
        "'speaker_10': 'And they they range from and there's a lot of really cool training. So just like our employees do, they, they, they can go into a catalog for post and look at what's proportionate to their duties and then through a supervisor approving it, we can go there.'",
        "'speaker_10': 'And I do want to clarify, you asked a very good question earlier and it was in regards to post training, to give you an example. A Long Beach police officer, like the ones you see sitting behind you, they get about 3000 hours of training, which is divided from a six month academy to a six month fill training'",
        "'speaker_10': 'officer certified program through post and then another six months of a probationary period. We do have individuals. I'd have to look at the entire background as to how it happened. I don't know how we got there, but individuals were allowed to go to post certified training.'",
        "'speaker_10': 'And then what ends up happening is in order to be classified by post as a peace officer, you have to enter a department that does general law enforcement to be certified with that FTO program and that probationary period.'",
        "'speaker_10': 'Unfortunately for our airport security officers, that's not available because they weren't part of a general law enforcement police department. So in a sense and I can fill I think I could fill with that. They're saying, man, I feel like I got cheated here.'",
        "'speaker_10': 'But coming if this integration gets approved, what we're going to be able to do is not only train them in perishable skills training that we afford our own employees, but we're able to identify other courses through post because they are now part of the Long Beach Police Department where their training will be enhanced.'",
        "'speaker_5': 'So would their in-service training be enhanced because they are part of Long Beach PD?'",
        "'speaker_10': 'Their training is absolutely going to improve from what they have now.'",
        "'speaker_5': 'Okay. And then the the other piece is the post training. Who pays for that?'",
        "'speaker_10': 'What we do as a police department. So that will be a I'm sorry I cut you off.'",
        "'speaker_5': 'That will be afforded to to these fellows as well, should they choose to, to go to various post training that may be afforded to them, that may be within the the scope of their duties.'",
        "'speaker_10': 'Every employee will get a piece of the pie.'",
        "'speaker_5': 'Okay. I have no further questions. Thank you for the clarification. And, Mr. Mayor, I'm a I'm okay with with what? Postponing the other vote. But I do think that hopefully there is some some opportunity between now and when this comes back for the I am the employee group as well as our union.'",
        "'speaker_5': 'I want to talk about hopefully some some amicable solutions that we can move this forward on this. This is obviously safety and airport and consistency is number one. And to the to the employees, I'll just tell you, I've taken this issue very seriously.'",
        "'speaker_5': 'I've talked to your leaders. Sal Vasquez is, you know, one of my favorites. I appreciate always the conversations with you. I've read your email, you section six, a memo. You is very clear. And and I do understand that that we're where the city is trying to go in terms of streamlining the operation.'",
        "'speaker_5': 'And so hopefully we can come to some sort of agreement.'",
        "'speaker_0': 'Thank you, Councilman. Councilmember Ringa.'",
        "'speaker_11': 'Thank you. For purposes of transparency, I did have meetings with the IAM, with the city manager, with the chief of police to talk about and H.R. to talk about this very issue. And I think during all those conversations, there was no question about the integrity and the dedication that our souls have to the airport and what value'",
        "'speaker_11': 'they have in the security. But is it safe? But and Councilmember Austin brought up something about the meeting code, a process which also included in the remaining code for process is a change in working conditions. And I think this is what this is.'",
        "'speaker_11': 'Basically, it's a whole issue about working conditions, changing basically the authority or the oversight of vessels in the airport from the airport director to the chief of police. I see that as a basic premise here in terms of what the issues are.'",
        "'speaker_11': 'We went through fact finding because of the fact that that wasn't able to be resolved in terms of what that transition or that change would bring to the systems in the airport and the integration, if you will, of police officers into also incorporating the airport as part of their responsibilities as well.'",
        "'speaker_11': 'So the overall overlying issue that I see here is not so much that there's going to be a loss of pay or change of hours or a change in in in responsibilities and most importantly, a a decline or a lessening of safety for the public at our airports.'",
        "'speaker_11': 'I don't see that at all. This is a management problem. The management issue, it's it's one that management has a right to manage. I can understand that. I think all three of the four of the bodies that i talked to in terms of the iam and h.r.'",
        "'speaker_11': 'Police and city manager, we all they all understand that we all we all know that. However, it's the transition and the integration integration of PD and s so into the into one that is the issue here and that has not been resolved.'",
        "'speaker_11': 'So I would support going, receiving and filing this report as we have it now. As Mayor said, however, on the second motion, I think that we I also would support that as well. Give it some time. I think that the all of the by all the all the authorities concerned here need to work that out.'",
        "'speaker_11': 'You need to get into a point of. Yes. Where we can all get together and agree. And at one point there's going to be an agree to disagree. But I feel more comfortable knowing that you all had have have had that very focused discussion about the actual integration and what it really means in regards to the CIOs'",
        "'speaker_11': 'and their change in working conditions, because that's what it comes down to as far as as I see it. So just one question. What does the receiver of file motion do right now for this integration plan and follow that up with the the motion to to put it up for to sometime in May.'",
        "'speaker_8': 'By taking a bow tonight just to receive in follow.'",
        "'speaker_10': 'You're just accepting the fact that you had the final report from the venue panel and you're receiving it. You're accepting it. You're taking no further action other than that.'",
        "'speaker_11': 'Okay.'",
        "'speaker_10': 'The second vote will come later tonight. If you wish to postpone, I'm taking some formal action.'",
        "'speaker_11': 'Okay. I'm good.'",
        "'speaker_0': 'And customer super anon.'",
        "'speaker_6': 'Thank you. I'd also like to hear public comment. But I just had one thought on when Councilman Gonzales was asking, like, can we memorialize the fact that we have security there? I just look to the year 2017 when JetBlue violated our late night noise ordinance 676 times.'",
        "'speaker_6': 'So that's on average, 1.85 operations per night. Guess what? Not only was there security, there we were. The airport was open by all practical purposes.'",
        "'speaker_10': 'So that to airport.'",
        "'speaker_6': 'Impacted council districts like like I represent that. That was very unnerving to hear that the airport had no security. So I'm glad to put that myth to rest. And the other question I have, and this is related to the noise ordinance.'",
        "'speaker_10': 'When we looked.'",
        "'speaker_6': 'At reworking that.'",
        "'speaker_10': 'We look to.'",
        "'speaker_6': 'Other best practices and other airports. And did the fact finding group ever do that? You know, what scenario is that Orange County or other airports? Was that part of the study?'",
        "'speaker_0': 'The noise.'",
        "'speaker_12': 'Ordinance. Can you repeat the question, please?'",
        "'speaker_6': 'I brought up the noise ordinance because we don't want to revisit 2017 and staff and our city attorney is looking at different systems to improve our to reduce the number of late night violations. They looked at other airports and practices at other airports regarding noise violations or rules.'",
        "'speaker_6': 'Did the fact finding group look at best case scenarios at other airports on the security issue and whatnot or was not not part of the study?'",
        "'speaker_12': 'So the fact finding panel didn't look at particularly noise ordinance, but they did look at other security initiatives.'",
        "'speaker_6': 'I'm sorry. I guess I misspoke. Okay. I brought up the noise ordinance because it's an analogy of how.'",
        "'speaker_10': 'We tackle one problem.'",
        "'speaker_6': 'We looked at other airports, okay, now we have a security issue or a security force issue. Did we look at other airports, how they operate, what they do? Thank you.'",
        "'speaker_12': 'So, yes, as part of this process, we did look at other agencies as part of the fact finding process and the media confer. And there.'",
        "'speaker_4': 'Are.'",
        "'speaker_12': 'I believe there was a total of 11 other agencies that have police over security of the airport.'",
        "'speaker_6': 'Okay. And would you happen to know if you know what.'",
        "'speaker_10': 'Airports are what.'",
        "'speaker_6': 'Are the practices in airports similar to our size, our our community and whatnot?'",
        "'speaker_12': 'So the airports that we that were reviewed were Burbank, San Jose International City of L.A. International. Oakland International. John Wayne Irvine. San Diego International. So on here. I only brought five with me. Oh, I'm sorry. So Oakland, Ontario, Palm Springs International.'",
        "'speaker_12': 'Sacramento International, Santa Barbara and San Jose International.'",
        "'speaker_6': 'Okay. And the findings there are are what exactly?'",
        "'speaker_12': 'So the findings that all of those airports operate under the same manner in which we're proposing in which the police department have or has oversight.'",
        "'speaker_6': 'Okay. Thank you for that. I'm going to go ahead and support the motion to postpone the decision and move on to a date. Not certain, but possibly in May.'",
        "'speaker_8': 'Mayor, I just one clarification, please. When I said there would be one change of physical for the service, would not be allowed to make traffic stops as we go forward. They continue to be allowed to make arrests, but not traffic stops.'",
        "'speaker_8': 'Okay.'",
        "'speaker_0': 'Well, let's we have a motion in a second to receive and file the the report. So there is a motion in a second to do that. We've taken public comment on that item already, so please cast your votes.'",
        "'speaker_10': 'Motion carries.'",
        "'speaker_0': 'We have a second we have a second item here, which is to the recommended motion is that I'm making is to postpone the staff recommendation to a date in May as set by the city manager. And so there is a motion any second on that.'",
        "'speaker_0': 'Is there a public comment on that motion?'",
        "'speaker_10': 'Very good. You certainly support. Any safety measures that will ensure the safety of our airport.'",
        "'speaker_8': 'But I think one of the most inane.'",
        "'speaker_10': 'Facts. We were presented here today.'",
        "'speaker_2': 'Oh, it.'",
        "'speaker_10': 'Is. We have an.'",
        "'speaker_8': 'Individual whose.'",
        "'speaker_10': 'Will be voting on this, the security issue, who the public records indicate. Almost every week demonstrates manifest. Mental instability in addition to mental instability certified. In the Long Beach police records relative to the individual arrest and have a person like that.'",
        "'speaker_8': 'Weighing in.'",
        "'speaker_10': 'On any aspect of.'",
        "'speaker_8': 'Safety at an airport. Is simply.'",
        "'speaker_2': 'Inane.'",
        "'speaker_10': 'And needs to be addressed by this council. Either tonight or in the future. Thank you.'",
        "'speaker_0': 'Speaker, please.'",
        "'speaker_10': 'Good evening, mayors, members of the council. I had some prepared remarks, but I must admit I'm somewhat confused and shocked by some of the allegations that were made here this this evening. Let's set some facts straight. The reports in the media as of late only addressed the situation if this proposal went through.'",
        "'speaker_10': 'If this proposal went through, the police department's proposal is to not have L-A. Excuse me. Long Beach police officers assigned to the airport between the hours, approximately, of 11 p.m. and 7 a.m.. That's what was stated in the media, and that is what is stated in the proposal.'",
        "'speaker_10': 'It's somewhat confusing if they believe that proper security isn't available during business hours, if you will. Those would be hours between 7 a.m. and 10:59 p.m.. But after 11:00, I suppose that if somebody called 911a police unit that's traveling the the the area of the airport would respond.'",
        "'speaker_10': 'So that's what was stated in the media. Someone suggested that the reason that we're not up to 27 is because of this meet and confer that has been taking place for about a year. I've been here six years and we have never been north of 15 PSOs for the past six years.'",
        "'speaker_10': 'So it hasn't been the past few months that we have been in a meeting confer. Mr. West has an issue apparently with management not having a law enforcement background.'",
        "'speaker_0': 'Well, the fact is that for 35.'",
        "'speaker_10': 'Years there hasn't been a law enforcement overseer of the Long Beach Eso's at the airport. This has been quite well. And the reason we're here today is not because the union negotiated post training for the eso's. This was as a direct result of management.'",
        "'speaker_10': 'The city manager at that time, the city attorney at that time, and the person in charge of the airport over a quarter century ago coming to the union through a meet and confer process and asking us if it would be okay to send these folks to post training.'",
        "'speaker_10': 'Now let's talk about training. I believe that statements were made to the council that somehow training is going to be between 30 and 60 hours. This is a deficiency of the current training. The current post one training is a minimum of 660 hours.'",
        "'speaker_10': 'This is a training that was imposed by this city for these tests. Taking that away. Taking the authority away is an injustice. And that, we believe, will be a weakness of security. I am speaking going forward. I am not speaking currently.'",
        "'speaker_10': 'I also believe that the airport is safe today. I don't believe that the L4 will be safe if you reduce training from 660 hours to 30 to 60 hours. They also want to take away arrest powers, even though it was just said that they will continue arrest powers.'",
        "'speaker_10': 'No, they will continue arrest powers if they call 911. And if they call the police person, the red and the red lights will be transferred to amber lights. So there's a significant amount of information that's being withheld from this council, and I think it needs to be explored.'",
        "'speaker_10': 'I urge and recommend that an independent study of this proposal be made so that we can make an intelligent decision. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'And I can fe six districts stand here in support of my union brothers and sisters. I don't believe that the chain of command to be streamlined into more centralized power with the language police department. This the last time we've seen something sizable to this level was when chief of police in L.A., Mr. Bratton and then Mayor James'",
        "'speaker_8': 'Hahn were trying to do the same thing with the World LAX International Airport, which is not it's autonomous. It's an autonomous division. It's not under the LAPD. In regards to the current handling of our airport here. I think this issue is unfavorably speaking against the great job that the current CSO officers are doing in securing our airport'",
        "'speaker_8': ', and it's undermining public morale, which is unnecessary because we have had no issues. And I'm just here to support. I, as a member of the community, am a bit suspicious of any centralization of safety in regards to our police department going under our police department.'",
        "'speaker_8': 'And also wary of what could be a very sizable contract in the future. You know, because I like to believe that the numbers alone we should report will be a huge one in the next 10 to 20 years.'",
        "'speaker_8': 'So in the short term, I think a lot of the implications of what this fact finding report is, is not speaking on is what will this look like? You know, 20 years from now, where we're talking about 12, 12 jobs.'",
        "'speaker_8': 'Right now, we're actually 27. We're talking about maybe, you know, in ten years, you know, Alex, they employ over 600 people. So what if one day that's going to be 600, you know, 324 officers there? What about in 20 years, 20, 30 years from now, when it's not just JetBlue who's the hub here, it's five other hubs'",
        "'speaker_8': 'that are here. And then we're talking about at that time, you know, obligations towards the city budget and being thrice full to accommodate police officers on the campus of the airport. So against the city, along with the police department taking over this.'",
        "'speaker_8': 'And I'm here in support of our current. So brothers and sisters. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, these are the last two speakers. And then we're we've closed the speakers list.'",
        "'speaker_10': 'Hi. My name is Dan Gonzales. I'm president of Local Large 1930 representing the Special Services peace officers at the Long Beach Airport as well. My address is on file. I'm a city employee, been here almost 24 years. Currently, I'm serving as an associate with the Port of Long Beach Harbor Patrol, and my assignments are swing ship patrol'",
        "'speaker_10': 'as well as field training for my department. First of all, I'm going to deviate from my my thing here. I'm a little concerned about the the city manager saying that you have to be a peace officer, law enforcement, to supervise law enforcement.'",
        "'speaker_10': 'Isn't he the boss of the chief? But is it? It's just confusing to me. All right. Honorable Mayor Garcia and city council members. First of all, I want to express my appreciation for the complicated, complicated task you and the council have with this issue.'",
        "'speaker_10': 'I also want to mention my appreciation for Chief Luna and the task he has to help keep this city safe. With that said, it is my belief that the direction to lessen the training standards and duties of the so peace officers assigned to the airport is misguided.'",
        "'speaker_10': 'These decisions will add to city liability and require more Long Beach police officers and ultimately cost the taxpayers more. I've been part of the meet and confer process and I am deeply disturbed by what I've seen. I've seen the Long Beach PD use its influence to convince Poste to revoke certifications from our members.'",
        "'speaker_10': 'It wasn't an audit. They didn't just decide to audit what they were doing, and it only affected our members, not the folks that passed their FTO process and went on to other agencies. Somehow that magically didn't happen. So it has only only affected I am members.'",
        "'speaker_10': 'I thought that the you know, all this was done to further the political goal of the police department. I thought the police were supposed to do what's right, not what's easy. I've seen the police department use the argument that.'",
        "'speaker_10': 'Less training for my members will increase safety. As an instructor, I tell you. Officers do not rise to the occasion. They default to the level of their training. This is why. Your organization, Long Beach PD, has a SWAT team training weekly and not hoping that they'll just figure it out and rise to the occasion.'",
        "'speaker_10': 'My first eight years with the city, I proudly worked for the Long Beach Police Department as an S.O. not and I've had lots of I still have a lot of friends there. I'm really concerned about their management and the direction towards mediocrity.'",
        "'speaker_10': 'They're looking for the bare minimum and not not exceeding and not going higher and better. I asked the council not to approve the emotion, instead direct the management team to head in a logical, ethical and safe direction. That makes sense for everyone, including the community, we all think.'",
        "'speaker_0': 'Thank you very much. Thank you. Final speaker.'",
        "'speaker_7': 'Good evening, Mayor and city council members. My name is James Sweitzer. I am a third district resident and a proud member of the Democratic Socialists of America Long Beach chapter. So I'm also here and proud to stand in solidarity with the hardworking city employees with I Am 1930.'",
        "'speaker_7': 'So I am speaking tonight in opposition to this item. And the you know, we've heard it called multiple things, you know, labor dispute, management issue. But I want to make some observations today and call it what it is, which is a takeover, and that this is an orchestrated takeover of the airport by the Long Beach Police Department'",
        "'speaker_7': '. And it's no secret that this has been an effort that has been going on for years and is the you know, I can't help but also wonder that we're talking about the excesses of the airport tonight. And I'm wondering about the CISOs here at City Hall.'",
        "'speaker_7': 'I'm also wondering about the Eso's, just as is mentioned at the harbor department or at the Port of Long Beach as well, and wondering what comes next. But I also believe that the track records of the airport and police department should speak for themselves.'",
        "'speaker_7': 'And the past two years, the city of Long Beach has actually done an amazing job at touting the airport's accolades and honors. And I feel like every month I'm opening up a new article in a city newsletter or in the local media about how it's the best airport.'",
        "'speaker_7': 'It's the safest airport. And I think that's something to celebrate that our Long Beach airport is a community asset and it's a source of pride for the city. But meanwhile, within the first seven months of receiving the Metro policing contract, for instance, and as somebody who regularly uses the blue line to travel to L.A., the Long Beach'",
        "'speaker_7': 'Police Department had already killed Cesar Rodriguez within those first seven months. And by 13 months into the contract, as the Long Beach Post reported, the Long Beach Police Department was responsible for more than half of all of the arrests in the metro system, despite only policing four miles of a 98 mile system.'",
        "'speaker_7': 'So I want to let that sink in, because I think that speaks for itself. And knowing all of this, I can't help but wonder why we are risking the reputation of our community asset and giving more authority to the city's biggest liability.'",
        "'speaker_7': 'So I want to put that out there as a question, and I urge you all to I appreciate postponing this, but I ultimately want to urge you to not allow this integration to happen. Thank you.'",
        "'speaker_0': 'Thank you. We have a we have a motion in a second. I want to as we as we take the vote, I just want to say something which I think is important, is that I want to reiterate something I think everyone agrees agrees on, and that is that the Long Beach Airport is a wonderful, safe place that'",
        "'speaker_0': 'people love to travel to. And it's because of the team that is currently in place. And I personally want to thank the Palm Beach police officers that are there working every day, work really hard to keep our airport safe.'",
        "'speaker_0': 'And I want to thank them, Chief, the entire team, the Sasso team that is there, that work in coordination with our Long Beach Police Department and that have been doing great work. I see our CSO officers when I'm traveling in and out of the Long Beach Airport and we appreciate their work and they work alongside the TSA'",
        "'speaker_0': ', the FBI that is doing work at the airport on a regular basis, and a lot of other agencies to make sure that we have a world class airport. And so to the entire team that is there. I just want to thank them for making the Long Beach Airport a really great, safe place to fly.'",
        "'speaker_0': 'And I will add that I appreciate whenever I go seeing our Long Beach police officers are so officers, to be very honest, always friendly, always working with folks and I think providing excellent service to the community. So thank you for the work that's been that has been happening.'",
        "'speaker_0': 'And and I want to thank everyone for for their interest, of course, in this issue. So please. Councilmembers Castro votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Great. Thank you very much. We're going to be moving on now to our next item here. On second.'",
        "'speaker_2': 'What's. Just. Yeah. Yeah.'"
    ],
    "Recommendation to declare ordinance amending Ordinance No. ORD-10-0012, modifying the assessments to be levied within the East Anaheim Street Parking and Business Improvement Area, read and adopted as read.  (Districts 3,4)": [
        "'speaker_0': 'Let me let me just real briefly, if I can have. Hearing one. I know it's very quick. We can do that really quick so we get that out of the way.'",
        "'speaker_10': 'Item one as a report from Economic Development recommendation to receive supporting documentation and to the record conclude the public hearing and declare ordinance approving the change to the East. Anaheim Street Parking and Business Improvement Area Methodology and assessment for the first time and later over to the next regular meeting for final reading districts three and four.'",
        "'speaker_0': 'Great. There is a there's a motion and a second. Mr. City Manager.'",
        "'speaker_10': 'Yes, this.'",
        "'speaker_7': 'We need to administer an oath.'",
        "'speaker_10': 'To the clerk.'",
        "'speaker_7': 'To administer the oath on this one.'",
        "'speaker_10': 'You or anyone watching to give testimony, please stand. You and each of you. Do you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_2': 'Intuitive presentation, right?'",
        "'speaker_7': 'So the staff presentation.'",
        "'speaker_10': 'Today will be done by Eric Romero Economic Development. Good evening, Mayor and Honorable Members of the City Council, the Zakaria Business Association Board of Directors, which serves as the advisory board to the City Council on matters related to the East Anaheim Street Parking and Business Improvement Area made a formal request to the City Council to add new'",
        "'speaker_10': 'business classifications to the East Anaheim Street Parking and Business Improvement Area method of assessment. The proposed business classifications include financial institutions, which are banks, insurance companies and nonprofit organizations. Approximately 14 businesses nonprofits would be impacted by the change.'",
        "'speaker_10': 'It is estimated that the changes to the method of assessment would bring in roughly 2500 annually in additional revenue. And the ZAFIRA, a business association, is proposing to add the additional revenue to the organization's marketing budget.'",
        "'speaker_7': 'At its April nine, 2019 meeting.'",
        "'speaker_10': 'The City Council adopted a resolution that declared the intention of the City Council to add.'",
        "'speaker_7': 'New business type, new business classifications, and that today, as a public hearing date.'",
        "'speaker_10': 'A copy of the resolution and public hearing notice were mailed to all businesses that pay into the Business.'",
        "'speaker_7': 'Improvement District and were also published in local media as required. The recommended action for this item would amend.'",
        "'speaker_10': 'Ordinance ten 0012, which established the East Anaheim Street Parking Business Improvement Area by adding the new business classifications to the method of assessment. State law provides that the City Council should hear and consider all protest.'",
        "'speaker_7': 'Against the proposed changes to the method of assessment.'",
        "'speaker_10': 'If written protest are received from area.'",
        "'speaker_7': 'Business owners representing 50% or more of the proposed assessments, the City Council shall not.'",
        "'speaker_10': 'Approve the change to the ordinance. This concludes my report. Thank you.'",
        "'speaker_7': 'Good idea. When very public comment on idea. No. But these guys went from an idea. Guys, it's like speaking to Mr. Soprano.'",
        "'speaker_6': 'Stand in support. Thank you.'",
        "'speaker_7': 'Mr. Conspiracy.'",
        "'speaker_5': 'No, my second.'",
        "'speaker_7': 'One. Would you please cast your vote?'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to approve naming the new chambers at the Civic Center the \"Bob Foster Civic Chambers.": [
        "'speaker_7': 'Now we're going to move to item 26.'",
        "'speaker_1': 'Communication from Vice Mayor Andrews, Chair of Housing and Neighborhoods Committee recommendation to approve naming the new chamber at the Civic Center to the Bob Foster Civic Chambers.'",
        "'speaker_7': 'Thank you, Vice Mayor. Yes. In March, the housing in our neighborhood committee voted to name the new Civic Center chambers after Bob Foster, the 27th mayor of Long Beach. Can anyone think of a better candidate for this honor?'",
        "'speaker_7': 'Bob, is the reason why we're having our new civic center being constructed next door. He led the city in Long Beach through the darkest days of the Great Recession. There's been a friend of mine, a mentor and my mirror.'",
        "'speaker_7': 'In short, Bob was a space in my heart and in my esteem. I strongly urge my colleagues to join me in recognizing the leadership and accomplishment of Mayor Bob Foster by naming a new chamber in His Honor. Do have any public comment on this item?'",
        "'speaker_8': 'Larry. Good to work.'",
        "'speaker_10': 'As the U.S., I thoroughly support this. It's a he's an he was an absolutely great mayor.'",
        "'speaker_8': 'It's unfortunate our current mayor.'",
        "'speaker_10': 'Is so far below him in terms of character and all honesty. But yes, I certainly support.'",
        "'speaker_8': 'This and I think it will have the full support.'",
        "'speaker_10': 'Of this entire community. Thank you.'",
        "'speaker_0': 'Thank you. See no other public comment. Please, members, go ahead and cast your vote. It just went through, I believe, Councilman, both the harbor end committee as well as the committee. Great. Thank you. And I look forward to to the Bob Foster Chambers opening up when the city when Civic Center opens up.'"
    ],
    "Recommendation to receive and file a presentation on the status of the Long Beach Community Choice Aggregation Feasibility Study.  (Citywide)": [
        "'speaker_0': 'I'm sure that Nancy is is watching and a great honor I think for for for a great a great mayor. With that, we're moving up to item. 27.'",
        "'speaker_1': 'Report from Energy Resources Recommendation Receive and file a presentation on the status of the Long Beach Community Choice Aggregation Feasibility Study Citywide.'",
        "'speaker_8': 'Mr. Mayor, council members. This is a report for the. It will be provided by our energy resources director, Bob Dole, and also manager Tony Foster.'",
        "'speaker_10': 'Yes. Thank you, Pat. I'll turn it over to Tony Foster. He is our business operations manager for the department. Good evening. Mayor and Council Members. On October 23rd, 2019.'",
        "'speaker_7': 'Council authorized commencement of.'",
        "'speaker_5': 'A feasibility study for the establishment of Community Choice Aggregation, also known as K in the city of Long Beach.'",
        "'speaker_7': 'On that date. Council also requested.'",
        "'speaker_10': 'That we return to present a status report.'",
        "'speaker_5': 'On the study's progress, which is the purposes of our presentation this evening. This feasibility study is to evaluate the.'",
        "'speaker_10': 'Economic and technical.'",
        "'speaker_5': 'Components of cooperation to assist Council in making an informed decision of whether to proceed in the formation of K in Long Beach. To undertake this feasibility study, we have engaged three.'",
        "'speaker_10': 'Highly experienced consultancies and three.'",
        "'speaker_7': 'Subcontracted consultancies.'",
        "'speaker_5': 'Each specializing.'",
        "'speaker_7': 'In critical.'",
        "'speaker_5': 'Aspects of analysis. We have with us this evening Mr. Mark Fulmer, principal of M RW and Associates, the lead consultancy overseeing the methodology and integration of the analysis in our study. Mr. Former's expertize lies in a deep understanding of.'",
        "'speaker_10': 'Wholesale power markets.'",
        "'speaker_7': 'In California rate making at the California.'",
        "'speaker_10': 'Public.'",
        "'speaker_5': 'Utilities Commission and CCR formations. Mark and his teammates have completed feasibility studies for Alameda and Contra Costa counties. They have.'",
        "'speaker_10': 'Performed peer review and risk assessments for numerous counties.'",
        "'speaker_5': 'Cities.'",
        "'speaker_7': 'And towns as they consider CA formation.'",
        "'speaker_5': 'These include the City of San Diego. Santa Barbara County. San Mateo.'",
        "'speaker_7': 'County. Santa Cruz. County. Sonoma County. And numerous cities and towns considering.'",
        "'speaker_5': 'Joint joining marine clean energy. Furthermore, numerous active cases in the state.'",
        "'speaker_7': 'Including Marin Clean Energy. Sonoma, Clean.'",
        "'speaker_10': 'Power.'",
        "'speaker_5': 'Lancaster Energy Choice, Clean Power, S.F. and Redwood Coast Energy Authority, as well as the statewide K trade group Kalka, have been MWD clients and continue to rely on MMW for regulatory advice and insight.'",
        "'speaker_10': 'I present Mr. Mark former.'",
        "'speaker_8': 'There. Thank you, Tony. What I'm going to do tonight is quickly walk through the status of the report that we've been working on and some of the issues that we faced and how we're addressing them. First, a quick background on the Community Choice Aggregation program.'",
        "'speaker_8': 'It allows cities or other cities, counties or other jurisdictions to effectively buy power on behalf of all of the citizens in their jurisdiction. There are various motivations for doing this, including having a greener portfolio, working towards meeting climate action plans, as well as providing lower rates than they would with their host utility.'",
        "'speaker_8': 'To be clear on what exactly the Kia services are is shown here at the far left is the standard what we would call an investor owned utility would be Southern California Edison. They purchased and procure the power or generate it using some of their own power plants.'",
        "'speaker_8': 'They moved the power through their own distribution network. They own the wires and all those types of equipment and provide the basic customer service, which is often metering and billing and interface with the customer as they move and have other types of issues.'",
        "'speaker_8': 'A CCAR takes that takes over only that first part. They would purchase and procure the power from their chosen sources. Southern California Edison would remain the owner and the operator of the distribution and transmission systems, and they would provide the metering and billing.'",
        "'speaker_8': 'At the far end of the spectrum would be something like you have it, your neighbor to the north of Los Angeles, where the municipal agency does all of those services. So we're looking at that middle option. The primary goal of the study is to forecast the costs and identify up.'",
        "'speaker_8': 'Thank you. I turn my own page, but not yours to look at the costs and benefits and risks with forming a K program here in the city of Long Beach. So far there was a number of data type issues that are key to the modeling that we worked to overcome.'",
        "'speaker_8': 'And moving forward will be looking at some of the other key pieces that you all would be interested in. From the general macroeconomic benefits to how it may impact some of your key large customers. The bottom line is that we will be presenting the financial benefits and risks of CCR formation so that you, as the decision makers'",
        "'speaker_8': ', can lead your community forward in whatever direction you feel is appropriate. A quick overview of our team. M RW As the prime contractor, we will be doing the financial modeling. We'll be getting input from the others here, including specialists in the wholesale power markets and predicting pricing at that level.'",
        "'speaker_8': 'Another group that's working with crunching the data that they can get from large customer. There are loads are a group that's looking at biggest that is looking at geographically what the city looks like for renewable energy options as well as a group that specializes in doing macroeconomic analyzes, in particular understanding what the impacts of public investment projects'",
        "'speaker_8': 'are on the local economy. Some of the big challenges that we're facing are here. The first couple are really addressing the low data. In order to know how much this thing may cost, you have to know what you're providing, the number of kilowatt hours and when those are used.'",
        "'speaker_8': 'And that can be a challenge. Southern California Edison provides some amount of data, but not enough to get a a precise idea of what is being served. There are ways it or working around that that I'll talk about later.'",
        "'speaker_8': 'There are the it's a complex process. There are lots of moving parts. The key changing both as more and more cities do it, that causes other regulatory changes. And we're effectively in a moving river here. So that adds a level of challenge to us in the analysis.'",
        "'speaker_8': 'The things that we've been working on over the last few months are particularly a deal dealing with the data issues as will going to a little bit more data a little bit more. In a moment, we have what they call the smart meter gap, though the there's lots of great information on how people use their electricity due'",
        "'speaker_8': 'to improved meters, but that doesn't flow down to us. So working around that, again, data integrated into a to a system where everything is considered consistently and works and as well as tracking what the many changes are to make sure that we're completely up to date on the kind of regulations and requirements that would be facing when'",
        "'speaker_8': 'it began in the next couple of years. As. The next the near-term activities after that is actually getting the financial models completely populated and run and to start quantitative the risks. Now, what can go wrong and how does that actually impact the bottom line?'",
        "'speaker_8': 'In addressing the data there are we have a couple helpful things that have happened. First of all, I've been in communication with the. Clean Power Alliance, which is the K Group in Los Angeles and the rest of Los Angeles County and Ventura County.'",
        "'speaker_8': 'And they kindly provided some high level, aggregated, low data. That's better than we could receive from Southern California Edison for the large accounts. This is particularly important here. Effectively, 1/10 of 1% of the customers consume nearly half of the load.'",
        "'speaker_8': 'So there's very few. There's a small number of very large customers. And knowing what they are interested in, what they want and how they use their electricity is critical in assessing the okay for Long Beach in particular. Other cities don't have this challenge.'",
        "'speaker_8': 'They're more balanced in their load. But here in Long Beach, we have that challenge and we were working to work around that. We're doing that by reaching out to these customers, talking with them, having them provide some of their.'",
        "'speaker_8': 'So that we can better incorporate their preferences and their loads into our analysis. Beyond that. Once we have a good eye, once we know what load is being served, we have to think about how that's going to change over time, in particular as more people put solar on their rooftops.'",
        "'speaker_8': 'That changes what has to be provided. From that, you have to figure out what type of electrical resources they will need to be buying, what type of car with, what type of resources. And then you have to add up those costs along with the cost of operations and compare that to what the service would cost if the'",
        "'speaker_8': 'customers remain with Southern California Edison. And that's the bottom line of the financial analysis, is that comparison. Now, in addition to that, we will undoubtedly have great uncertainty in a number of key factors, and we need to explore that to see how robust, whatever our results are and then where the risks in sensitivity analysis are.'",
        "'speaker_8': 'And then lastly, once we have a preferred scenario, we can provide that to the macroeconomic team to see what type of implications for economic development for the city that might mean. This just summarizes what we're doing. I will leave it to you to look at the individual boxes and not burden you now.'",
        "'speaker_8': 'But there's a lot of pieces going on and you can see. A team that had very specific expertize to be able to pull this off. So this is just a little preview of some of the load analysis. Is the load on a typical summer day?'",
        "'speaker_8': 'You can see along the bottom we have from our one two hour, 24, 24 hours in a day and the total amount of kilowatts that the city would be using with the different customer classes. And there's it's more this is more just to give you an idea of the kind of analysis we need.'",
        "'speaker_8': 'We have we will need to be doing these kind of charts for literally every hour of the year to understand what type of power we would need to be buying. A big piece that can impact the financial analysis, but very much impacts the risks.'",
        "'speaker_8': 'And some of the more or less quantifiable elements are some of the regulatory changes and the market changes, in particular. The first bullet there, the legislature and the other regulatory agencies, the California Public Utilities Commission and the California Energy Commission.'",
        "'speaker_8': 'Are changing the regulations and rules as we sit in as we go forward. Recent changes are to a particular fee that all customers have to pay. That's being reformed and is a subject of great analysis at the Public Utilities Commission.'",
        "'speaker_8': 'There's also requirements for kids to do some very specific type of planning and purchasing. And while that is helpful for the state and for the planning, it also puts a fair amount of constraints on the CCI as they think about how how the resources are going to be acquired and what type of resources.'",
        "'speaker_8': 'There's also various other things going on. While, for instance, the Pacific Gas, the PGE bankruptcy doesn't necessarily directly affect what's going on in Southern California, there could be precedents that are set in the bankruptcy court that could ripple through here that we have to be cognizant, cognizant of as we move forward on this.'",
        "'speaker_8': 'Some of the risks that we're that we're studying and we'll have to flesh out are listed here. In particular, we will we will undoubtedly not be able to precisely predict what the power markets are going to be in 2032.'",
        "'speaker_8': 'So we have to take that into account and run scenarios with different pricing to see how the costs change versus what the costs for Southern California Edison would change under those same scenarios. You have to have a certain amount of money to start up.'",
        "'speaker_8': 'That is, you have to make investments before you start providing any power. And before you start getting any revenue from any of the customers. For the most part, those moneys are generally provided by the agencies that are supporting the CCI.'",
        "'speaker_8': 'They are a short term loan that gets immediately repaid once revenues start coming in. So it's a risk to the organizations that are supporting the CCI, and it's not a not necessarily a trivial one. Can I point out that there was one group, the Desert Community Choice, which covers the Coachella Valley and Palm Springs.'",
        "'speaker_8': 'Were to the point where there were within weeks of launching and beginning to serve. When they chose to delay for 18 months. So effectively that loan that was made to get them up and going now has a pay gets paid back 18 months later, assuming that they do indeed move forward.'",
        "'speaker_8': 'So. It's it's something that can get glossed over. But there's a number of these things that are that that haven't really necessarily been a problem for a lot of kids, but can potentially be. And you have to keep that in mind.'",
        "'speaker_8': 'Another quick one that I want to highlight, Humoresque. That is, customers join and start taking service and then three years later leave for a normal car. That's probably not too big of a deal. But for here, because you have such a concentration of load among a small number of customers, that could be a significant risk.'",
        "'speaker_8': 'Again, 1/10 of 1% of the customers account for nearly half of the load. On the plus side, there are a lot of kids and they're getting smarter and working together. They're understanding what they need to do to manage the risk of energy procurement.'",
        "'speaker_8': 'They're doing a lot of innovative things that can be learned that we can learn from. And were you all to pursue this? You all would be able to learn from a lot of collaborate, a lot of collaborations between the keys and the utilities.'",
        "'speaker_8': 'They are not at all adversarial and can be can work hand in hand very well. An interesting point to also consider is. The fact that you're considering it now in the middle or early part of 2019 with implementation in the early 2020s is different than the large rush who formed KAS.'",
        "'speaker_8': 'And we're considering it five years ago and, you know, 2013, 2016 timeframe. There's a lot of changes. The one that I'll highlight is the second bullet, which is Senate Bill 100. Effectively, a lot of communities were excited about CCI because they had very aggressive climate action plan goals and said, this is a great way where we as'",
        "'speaker_8': 'a city can reduce our carbon output well beyond what the state is saying. Well, the state's noticing that people can do it and they are accelerating the whole the state's electricity GHG emissions mandates such that with the goal of being carbon free by 2045 and interim goals that are also very aggressive.'",
        "'speaker_8': 'Thus, if your goal was to reduce greenhouse gas via the formation of the K, you'll still do that. But it'll be four fewer years and the amount of savings is going to be reduced simply because the baselines moved.'",
        "'speaker_8': 'The other guys are going to be doing it well also. So things are things have changed. And when you're thinking and talking with people who were in cars that formed a couple of years ago, the landscape can be a bit different.'",
        "'speaker_8': 'Lastly here, this is a simplified chart showing the tasks that we're working on as well as the ones that we've completed. The first few tasks are generally data analysis and gathering, particularly the load data. You can see 1.2 is for getting the data from the large customers.'",
        "'speaker_8': 'That took a while to get underway, but we're now underway and getting good data. And then over the next few months, a lot of it will be the detailed financial modeling and with the final part being the macroeconomic analysis and the reporting, with respect to the reporting, I would envision that being an iterative process with the city'",
        "'speaker_8': 'staff as to make sure that we're providing the information that you all need to make a good decision for the city. At this point. I'm going to turn it back over to Tony for any questions.'",
        "'speaker_10': 'All right. Thank you, Mark, for the thorough presentation. This point, this concludes our status report and we're available for any questions.'",
        "'speaker_5': 'Great. Thank you for the great report, Councilmember Pearce.'",
        "'speaker_3': 'Thank you. I also want to thank you for the great report. I know that this was just a step to what you outline is coming back in August. I did have a question on the timeline. If if the city did decide to move forward with the car option, what is the timeline to do that for 2021?'",
        "'speaker_10': 'We would probably still be in line with that. If council did make the decision to move forward with this, the next step would be to conduct a business modeling effort because we still need to understand would it be more advantageous to develop our own form of JPA, join one of the existing ones?'",
        "'speaker_10': 'Or, you know, there's another handful of options. So the business model aspect would follow suit with that. It typically doesn't take as long as the feasibility study. So that would put you some time into early 2020. But that wouldn't preclude us if we made the decision to go forward with filing the initial implementation plan data with the'",
        "'speaker_10': 'CPC pending. You don't have to disclose at that time whether you're going to go forward with joining want or whatever. So it would still be feasible.'",
        "'speaker_3': 'Great. That's a pretty short process, as I understand it. I had a question just and I don't want to get into a lot of questions because we can do that at a later time. But I did have a question about the our users and understanding at San Diego seems like a similar city to me when I think'",
        "'speaker_3': 'about they have a port, an airport, things like that. Are we comparing usage to other large cities like that? Because it seems like they would have the same issues.'",
        "'speaker_8': 'Each city has a unique profile. I've done so. I did the work for the City of San Diego in reviewing their feasibility study and their while, they also have a number of large users. The situation is a bit different in that they are already taking power from someone other than their host utility.'",
        "'speaker_8': 'San Diego Gas and Electric and wouldn't be considered part of the CAA work to form so that risk of volume. Loss isn't an issue for San Diego because it's not there to begin with. Looked at also the city of San Jose.'",
        "'speaker_8': 'And again, they do not have. They've got some amount of industry, but not nearly what we see here in Long Beach. It's unique from the cities that I've examined and looked at.'",
        "'speaker_10': 'And if I if I could add really quick to that, too, the single largest consumer typically of electricity is the movement of water. We've got our esteemed colleague over here, Mr. Gardner, in his department. But I will tell you that the operations offshore move a lot more water than he does, and that is the single largest customer'",
        "'speaker_10': 'of Southern California Edison CRC. So we have two big users of moving water, which are the largest consumers of electricity. So that is really one of the unique features. And we also have the port. The port is moving to an all electric port and that load has to be built into this and and be part of the'",
        "'speaker_10': 'comprehensive study. And so there's there's three big consumers right there that most cities do not have.'",
        "'speaker_3': 'Right. Right. And I had assumed and I thank you for sending me the list. I mean, I know I've had conversations with the port as well. And, you know, I recognize that we're in the very early stages of this and there's going to be a lot of data that we can kind of pull over and look at'",
        "'speaker_3': '. But I appreciate being able to compare our city to other cities and understanding what have they what have they done with those larger users? How can we, you know, exclude or make sure that we include them? And is there a timeline that we can do that in?'",
        "'speaker_3': 'And so I know you guys are doing all the work. I appreciate the report. I appreciate, you know, there's a goal of 2021 that I kind of have a mental cap on and that we're making those steps forward.'",
        "'speaker_3': 'So I appreciate this today. Thanks.'",
        "'speaker_5': 'Thank you. I was going to reserve my comments and allow Council Member Richardson to queue up. No, he had a couple of questions.'",
        "'speaker_6': 'Thanks, Councilman Austin. I think that was a way to tell Stacie to go back to her seat. You're not slick, so, you know, great presentation. Thank you so much. A lot of information will take some time to process.'",
        "'speaker_6': 'I guess my general sentiment is I support this generally. I need to have a clear understanding of when our decision point will be. And and and simply there was a lot of conversation about whether or not there were there are risks.'",
        "'speaker_6': 'And we're not at that point at that point yet. So at what point will we have a clear understanding of when we will have a risk? We will understand those risks.'",
        "'speaker_10': 'Yeah. Our hope is that when we make the final presentation to council that it would include a discussion of those risks, potentially what they could incur. I think it needs to be understood that forming a CSA is a long term financial obligation for a city.'",
        "'speaker_10': 'This is this is very serious because these contracts are 20 to 30 years out many times, and billions of dollars are involved. So those need to be understood because they are long term decisions. And I think that will be fleshed out with the pros and cons of of all that presented.'",
        "'speaker_10': 'And that will be enough, I believe, for you to make your decision.'",
        "'speaker_6': 'And when you bring that back, we'll have a recommendation.'",
        "'speaker_10': 'It is our intention to have a recommendation.'",
        "'speaker_6': 'Okay. And and what was the timeline one more time.'",
        "'speaker_10': 'When we get the report in late August? I would think there would take some time, probably a month to to formulate some things. And then I think what we need to do is have a discussion is should there be public outreach on this?'",
        "'speaker_10': 'We're making decisions that the taxpayers are on the hook for for the remainder of these contracts, but we really haven't involved them in the process. So I think that should be part of it as well, that we get out in front of them many times.'",
        "'speaker_10': 'They're not as informed about this. They they if you form associate they by default they go into it. But I think there probably needs to be some kind of communications effort. And so that would take probably a month if we scheduled those two.'",
        "'speaker_10': 'So now you're looking into the October-November timeframe, which still should give us enough time that should we make that decision to go forward, you would be able to we would make a decision whether we file the implementation plan to move forward from.'",
        "'speaker_6': 'Just, say, a month of public outreach. So I think all the rest of departments can learn from you if you can get that done.'",
        "'speaker_10': 'Well, that's a very aggressive. But if we start scheduling them in early August and getting them set, we might be able to do that. But I don't know. It may take longer. You're the best way to how we get in front of your constituents to present the data so that they are informed about what a case is'",
        "'speaker_10': ', what it means to them, should we go forward with one and the ramifications for generations to come?'",
        "'speaker_6': 'Sure. So the last thing, two things I would say I would want to understand the other case that that was established, what level of public engagement those agencies did. And then secondly, you know, the big opportunity for me separately from being able to select and determine the level of clean energy your community utilizes is really the economic'",
        "'speaker_6': 'opportunity I'd like to see when this comes back, you know, some some real information on tangible examples of creating some economic inclusion opportunities by utilizing this. I know that some CCAS are looking at this, but I'm you know, I'm thinking about what San Francisco is doing around their utilities in general.'",
        "'speaker_6': 'They have a whole community benefits plan built out around their their water, their gas, their utility program. And so there's an opportunity here, given we have some of our own utilities. But separately, if we're going to begin this conversation about SCCA, really the driver should be how to create more economic opportunities here locally for the people who'",
        "'speaker_6': 'live here. But thanks a lot. Thank you for the report and thanks. Go. Tony Foster.'",
        "'speaker_0': 'Councilman Gonzalez.'",
        "'speaker_1': 'Yeah, Bob. Tony, and thank you to our consultant as well. I really appreciate this because I was given a briefing two weeks ago and this is a very thorough report, although it's we're still waiting for the full feasibility study.'",
        "'speaker_1': 'It's nice to get this update in the meantime. And specifically, I like, you know, obviously that we included everything in this, specifically the regulatory changes and state mandates because we know that, you know, they're hammering down hard on an it's apologies to get it together and create ambitious goals for greenhouse gas emission reductions.'",
        "'speaker_1': 'So I just wanted to say thank you for this. I know there will be a lot of questions. This is a very thoughtful report, and I know we have a lot more to come and I'm looking forward to more community input when we get to that point.'",
        "'speaker_1': 'If we get to that point. And also just continually speaking with each of you about any other updates that we have in the interim. So thank you again and thanks to our friends at IBEW and all of our community partners for being here.'",
        "'speaker_1': 'They've been a part of this process and we thank them as well and Jeanine Pearce for bringing this forward.'",
        "'speaker_0': 'You got it.'",
        "'speaker_4': 'Thank you. I just wanted to say I appreciate your information related to community outreach. It's really important to the neighbors of my district, and I would not feel comfortable going forward until community outreach was deployed because our neighborhoods have so much at stake.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_5': 'Councilmember Pearce. Okay. Well, thank you. I just wanted to thank the staff for the great presentation. It's so really encouraging and gives us a lot of confidence knowing that we have a great consultant on the honor on the job here, an experienced consultant that has actually studied these and implemented these cases in other municipalities throughout the state'",
        "'speaker_5': '. I'm looking forward to understanding the options in front of us. One of my questions is how is your Long Beach unique from from the other cities? And I think you guys have answered that. And I do recognize that that our uniqueness may, may present some challenges, but also some opportunities.'",
        "'speaker_5': 'I want to just point out that the city is committed to exploring CCAS. And, you know, the last several months and the staff resources that have come and gone into doing so is evident of that and this report as well.'",
        "'speaker_5': 'Just the question, Mr. West, what are we committing toward the feasibility study?'",
        "'speaker_2': 'What was the question?'",
        "'speaker_5': 'Well, in terms of financial resources, what is committed toward this feasibility study?'",
        "'speaker_8': 'Mr. Dow.'",
        "'speaker_10': 'Yeah. We had a slide that it showed that council authorized us a $300,000 amount with a $50,000 contingency. But our projections are at this point in time, that will come in at approximately $285,000.'",
        "'speaker_5': 'Okay. And just just really quickly understanding that that the cars are really a changing dynamic in terms of utilities in California. How are the the investor owned utilities adjusting and responding to to this change in dynamic in any way?'",
        "'speaker_10': 'Well, there's a couple of things. The big the big concern for them is the sharing of the cost. So you saw the power charge and indifference adjustment, the charge the commission has provided so that the financial impact for the fewer customers that remain on the IOUs don't get burdened with those longer term contracts.'",
        "'speaker_10': 'Those costs get pushed over to the case. So their concern is really on that side of it. They're kind of net neutral. There is a law also where they they have to hold back on any opposition. They really don't state opposition one way or the other from the IOUs.'",
        "'speaker_10': 'So you won't get any comments from them regarding that as well. Sempra down in San Diego did form a separate little unit that's funded entirely with shareholder moneys, no ratepayer monies. So they have a little campaign. But as you might know, both the county and city of San Diego made their decision to go to the next level'",
        "'speaker_10': 'with their case, and they have moved ahead with that. So the up in the PGA planning area, it remains to be seen. They're undertaking a lot of change right now. I will tell you that Edison, the service territory where we reside in with SoCal Edison is our provider, is very different than the other two.'",
        "'speaker_10': 'Edison has been more consumer friendly in that sense that their rates are tougher to beat. I believe the county's program, when they went through their difference in rates, was somewhere in the neighborhood of 1 to 1 and a quarter percent lower than what you could get from Edison.'",
        "'speaker_10': 'So they weren't as aggressive as some of the ones, the early ones, it all started up in PG territory because of the rate structure that was evident up there. So there are a lot of challenges, but most of the times the utilities are just taking a neutral position on this and it's really hard to read them one'",
        "'speaker_10': 'way or the other.'",
        "'speaker_5': 'So are they buying or pursuing different sorts of energy, different types of energy sources?'",
        "'speaker_10': 'They still have the same mandates that the state has put out there. And depending on how you describe the types of power that they get, there are well, they have to meet the established dates that have been set forth in the state laws.'",
        "'speaker_5': 'Okay. And then my last comment would be just I agree with my colleague's point that regarding the community outreach, I think that is going to be an essential part of this this process. Probably the most important part of this process, because I would venture to guess that most of our residents are are clueless about the the benefits'",
        "'speaker_5': 'or any relationships to AIDS. And so I think there's going to have to be an education process, but also a robust community outreach process. And so hopefully, you know, your budget savings can go toward toward that. All right.'",
        "'speaker_5': 'Thank you. Councilmember Pearce, you get the last word.'",
        "'speaker_3': 'Thank you. I just wanted to comment on the community outreach. I know before I agenda was this, that there was some community outreach done just by community organizations that were talking about what is a K. And so I know you're here and you don't plan on speaking tonight, but as much as we can before the feasibility comes'",
        "'speaker_3': 'out, just educating just on that basic what is a K and then whenever it gets here that staff can really make sure that we spend a month, maybe two, God forbid, a year, please know, just going out there and educating on the feasibility study itself and doing some workshops around that I think would be really fantastic.'",
        "'speaker_3': 'So one is educating just basic what is a K? And I think from the conversations I've had with with Edison, they've been good conversations, you know, and that they've said to me, look, we just deliver it, you know, and I don't expect to have any behind the scenes pushback.'",
        "'speaker_3': 'I know that that happens sometimes, but I want to apply done the work to get us to this place and think for your work. And thank you, counsel, as well. So appreciate it.'",
        "'speaker_5': 'So is there any public comment on this?'",
        "'speaker_10': 'Yeah. I'm sorry if you guys weren't wanting public comment, but at Children's Day USA this year we're launching an a comprehensive green energy initiative. One of our partners of the initiative is Greg Stewart. They've developed a a what is a geothermal energy system that as a second benefit, decontaminate water.'",
        "'speaker_10': 'We're actually proposing in the PGA territories and the recent fire damage is to help restore some of those cities. If you come to Children's Day, I would love to be able to has the engineer, the scientist that actually developed the Stirling engine will be actually I can have him be at Children's Day to talk to your people'",
        "'speaker_10': 'if you'd like to. Thank you.'",
        "'speaker_0': 'Please, can we have two more for public comment to close the speakers list? So we'll have our next two speakers. Then the speakers list is closed.'",
        "'speaker_3': 'Good evening, mayors, city council members and city staff. I'm Alan Stephens, resident of District four and a member of the Climate Action Group Long Beach 350. Thank you very much for tonight's presentation. We Long Beach 350 strongly believe in community choice aggregation because it allows for local control on energy issues.'",
        "'speaker_3': 'That means we as a community can have a say in energy priorities, such as building a portfolio of clean, renewable energy sources to reach net zero carbon emissions quickly. That has huge long term benefits. Renewable energy projects can provide good green and union jobs, allowing folks to live and work in their community, which is our city, and'",
        "'speaker_3': 'while strengthening our local green economy when implemented to serve our community rather than private investors, a CCE can address, assist and empower the vulnerable sectors of our city in which poor air quality is a fact of life for way too many residents when it shouldn't have to be.'",
        "'speaker_3': 'During this time when the city is working on its climate action and adaptation plan, I hope you'll consider implementing Community Choice Energy as a necessary part of the solution to reduce our carbon footprint on a grand and fully possible scale while providing local jobs and securing our city's economy well into the future.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Next week.'",
        "'speaker_1': 'Hi. Good evening. My name is So Connie. I am one of the co-founders of Long Beach Environmental Alliance and one of our alliance partners is Long Beach 350. So thank you for inviting me to be here. Unfortunately, I don't have any jokes to tell tonight, so I know, I know.'",
        "'speaker_1': 'I'm just so pooped. So I just want to say that we support Kay. I think it will help achieve our sustainability goals. It will help improve jobs and financial benefits for our local economy and have us to use clean energy resources.'",
        "'speaker_1': 'Okay, we'll invest it. Well, if we invest it, it can provide local jobs programs and economic development and also improve the resiliency of the grid within our city. It is your job to improve our quality of life, so help us make the right decision by supporting CC.'",
        "'speaker_1': 'Thank you so much.'",
        "'speaker_0': 'Thank you. With that, we have a motion and a second. Please cast your votes.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt resolution amending the Master Fee and Charges Schedule.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Hearing to.'",
        "'speaker_1': 'Report from Financial Management Recommendation to receive supporting documentation under the record, conclude the public hearing and adopt a resolution amending the master fee and charges schedule citywide.'",
        "'speaker_0': 'There's a motion in a second. Mr. West.'",
        "'speaker_10': 'Thank you, Mr. Mayor.'",
        "'speaker_7': 'Grace Yoon, Budget Manager, Financial Management will conduct a presentation today.'",
        "'speaker_1': 'Good evening, Mayor, and members of the City Council. So the City Council's approval is being requested for mid-year changes to the master fee, fee and charges schedule for departments. I propose a total of 12 fee changes to the schedule.'",
        "'speaker_1': 'This includes the addition of eight new fees. The master fee in charge schedule is updated at least twice a year to allow departments to meet City Council stated policy on user fees, which.'",
        "'speaker_3': 'Calls for a full cost recovery whenever appropriate. City Council last.'",
        "'speaker_1': 'Approved an amended the master fee.'",
        "'speaker_3': 'And charges schedule on September 5th.'",
        "'speaker_1': '2018 as a part of the Fy19 budget process. Some examples of midyear fee changes in this report include a lower new fee for a site plan review of facade remodels to encourage additional applications for facade remodels and to distinguish the level of effort to review these remodels compared to new building constructions.'",
        "'speaker_1': 'A new annual registration fee to ensure charitable food operators are complying with health and safety code. A new fee for the operation of onsite catering companies or mobile.'",
        "'speaker_3': 'Food operators at at host.'",
        "'speaker_1': 'Facilities and new fees for the Catalina parking lot, which the city has assumed operations in line with the city's policy on cost recovery. The proposed fee changes are set at full cost recovery. The full list of fee changes and deletions are available in attachment A to the Council letter.'",
        "'speaker_1': 'This concludes my staff report and department representatives are also here to answer any specific questions you may have on the proposed fee changes.'",
        "'speaker_0': 'Thank you. There's a motion. There's a motion. Okay. There's a motion and a second Councilman Bong go.'",
        "'speaker_4': 'So I just wanted to add a potential.'",
        "'speaker_0': 'Option to limit first. Is there any public comment on this hearing? Okay. See none. Councilman Mango.'",
        "'speaker_4': 'So one of the things that we've talked about at length is accepting credit cards at Eldorado Park. This last Sunday was, again, a large scale event at Eldorado Park, which is Easter, where people want to enjoy it and we still aren't able to accept credit cards.'",
        "'speaker_4': 'So I'd like to add one additional fee item to the schedule in case there's some kind of cost recovery necessary to implement this, that it would be the current fee plus the cost recovery amount. So if our current rate to get into the park is $7 and it cost us a dollar 50 transaction fee, then I'd like'",
        "'speaker_4': 'there to be an added line item for credit card processing or whatever it needs to be to be $9 or $8. But I just want to give a general update and you can bring that back in a two from four.'",
        "'speaker_0': 'And I just want to add, Mr. West, I've been talking about this for four years. Why can't we get a credit card reader at Eldorado Park? I take credit cards. I don't understand why we can't do that as part of this.'",
        "'speaker_0': 'So I know it's not part of the fee schedule, but she just brought it up and it just, you know, it's it's getting there. So, Councilman Bango, is that is that part of the fee schedule? What what Councilman Mangum mentioned?'",
        "'speaker_8': 'We cannot add a fee tonight. We have to do a study.'",
        "'speaker_11': 'And you have to come back to add a fee to the fee schedule tonight.'",
        "'speaker_8': 'So if it's direction to.'",
        "'speaker_4': 'We can't modify a fee.'",
        "'speaker_8': 'You cannot increase the fee without your study. You can recommend or tell them to do that. You could eliminate a fee tonight.'",
        "'speaker_2': 'You could. Could we lower a fee tonight? You can't raise a fee and.'",
        "'speaker_4': 'They're eliminating fees. That's my favorite thing to do. So I'm going to just direct that. It comes back with the October fee schedule adjustment. I know that there's an independent park fee schedule study, blah, blah, blah. This has been going on for way too long.'",
        "'speaker_4': 'We have the ability to do this through labs. We have the ability to do it through some technology that's available in public works. I'd like to have it on board something, even if we use the current fees this summer because backing up the 605 Freeway to the Alamo is just not acceptable.'",
        "'speaker_0': 'That's every weekend, by the way, Councilman Austin.'",
        "'speaker_5': 'I second the motion and I like the idea of lowering fees. But this this fee schedule report is pretty voluminous and it would take some some serious time to do that. But the one one question I did have for for staff in terms of fees, can you speak to the hardships that that that, you know, our residents'",
        "'speaker_5': 'may face and how they're dealt with in terms of fee collections?'",
        "'speaker_8': 'Councilor, let me take the first shot at that, then I'll get back to Grace. We've already implemented and we'll probably we probably owe you a two from for on that, especially in the homeless arena. Whenever we whether we tote a car, whether we've sited cars, and if paying those fees or getting their car back puts the onus'",
        "'speaker_8': 'of someone going into homelessness or losing their their vehicle or not making it to a job and losing their job and losing their income. We have a policy between Fleet and the city manager's office to waive those fees, at least for the first time, and get that vehicle right back as soon as we can.'",
        "'speaker_8': 'In addition to that, we're very in fact, we're going through a situation right now where Broadway opened just recently and we advertised it street sweeper in time again to get tickets. But a whole bunch of people get tickets and are complaining that should we have gotten should we have got a little bit more notice?'",
        "'speaker_8': 'So those are things that we're certainly looking at, those kinds of things that just pop up. But other than that. Grace, do you have anything?'",
        "'speaker_1': 'I know. I'd just add that. Yet, depending on the fee, there.'",
        "'speaker_3': 'Are various.'",
        "'speaker_1': 'Programs that are set up, such as? Like the ambulance fees, there are waivers, programs that people can apply to, as well as the financing plans and things like that. So those are evaluated and looked at by department on a case by case basis.'",
        "'speaker_5': 'I think it was a question I had and I appreciate the answer and appreciate that our staff in city is being compassionate and understanding, sensitive to the challenges that are that are our residents face.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Is Dennis done here? I know. I can recite is Karyn public comment? And Larry Goodhue for the comment.'"
    ],
    "Recommendation to receive and file a presentation in honor of the 25th Anniversary of the Children's Day USA Festival.": [
        "'speaker_0': 'Thank you. And that concludes public comment. I'm going to item T. Three.'",
        "'speaker_1': 'Communication from Council Member Your UNGA recommendation to receive and file a presentation in honor of the.'",
        "'speaker_4': '25th anniversary of.'",
        "'speaker_1': 'The Children's Day USA.'",
        "'speaker_3': 'Festival.'",
        "'speaker_0': 'Johnson. Ringo.'",
        "'speaker_11': 'Thank you, Mayor. I think we could use a little levity at this point. It's been a long meeting. Well, I like to bring up summer hats. And if you can, I'd like to congratulate her on her 25 years of putting together the Children's Day.'",
        "'speaker_11': 'For 25 years, the Children's Day has provided a safe and positive environment for kids to grow and play. Children's Day reminds adults that our future generations rely on us to be good stewards of the earth and of nature.'",
        "'speaker_11': 'The goal of Children's Day is to do something wonderful, to make our world a better place. And the motto of Children's Day is Be community friendly summer. You have been the embodiment of that motto. This year's Children Day Festival will take place on Sunday, April 28th at the Eldorado Park, Downtown Duck Pond.'",
        "'speaker_11': 'The event will include multicultural shows, children's choirs, dancers, singers, drummers and lots of wonderful young folks. I hope to see you there. I am proud to have partnered with Summer on many children's day events and I look forward to working with her on in future events.'",
        "'speaker_11': 'Summer, thank you so much. For 25 years of putting Children's Day together and for everything you do in the community and I have a certificate of recognition here that I would like to to give to you and and congratulate you again.'",
        "'speaker_11': '25 years.'",
        "'speaker_3': 'What? Well. Thank you. And and I want to thank all of you. Who were on or who were elected people. My goodness. You guys are great. It seems like it's getting better and better. I mean, even the stuff that's on television of your well shows wouldn't be the right word.'",
        "'speaker_3': 'But it's really interesting. And you guys work very hard and. I think we're all learning and we have such a great community. I know. I keep saying that. It's so true. Anyway. Oh, and the motto for Children's Day.'",
        "'speaker_3': 'I mean, you you got it, you know, is do something wonderful to make our world a better place. You'll know what your project is because you feel it in your heart. Oh, my gosh. You know, there are so many good things that are happening.'",
        "'speaker_3': 'And what is that new motto that's on the website for the city? What is it? It's like, let's all pledge. What? Please help me with that. How does that go? Let's make all the pledge to do take care of the environment.'",
        "'speaker_3': 'That's and we. Well, we got to do that anyway. And Rex Richardson. Oh, my goodness. The kickoff for Children's Day was at Shearer Park, and it was fabulous.'",
        "'speaker_5': 'And right around the corner from my house.'",
        "'speaker_3': 'Right. I mean, it was great. And I loved that idea about that, about the, you know, the poetry and everything. So let's just keep all those good ideas coming. Share them with one another. Encourage everyone to have projects that are in their heart.'",
        "'speaker_3': 'Tell one another. That's the custom. That's a custom. That's the thing that that is really worth supporting. And for generations to come, just think of all the good things that are showing up when everybody does that.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Okay. You know, there's so many people who helped.'",
        "'speaker_2': 'Yes.'",
        "'speaker_10': 'We have certificates for that.'",
        "'speaker_3': 'This is great fun. What's your last name? Thumb. Thumb Burg. Oh, my gosh. She's she's a she's going to get the Nobel Peace Prize almost for sure. And she is affecting children and young people all around the world.'",
        "'speaker_3': 'And we're talking about it at the thing that was at Cher Park. You know, we all talked about what everyone was doing. I mean, you know, all the good things that are happening and the promise. I mean, we all know about the promise.'",
        "'speaker_3': 'The Long Beach Unified School District, the best school district in the world as far as most of all of us are concerned. And look at these wonderful kids. Oh, my gosh. I mean, you know, they were on Democracy Now!'",
        "'speaker_3': 'Saying, let's get we got to get the green deal. Right. The big green deal all over the world they committed. The kids are really taken in.'",
        "'speaker_5': 'And if you.'",
        "'speaker_3': 'Want to serious, they care about their future. And we know that all of you do.'",
        "'speaker_5': 'So thank you so much for this beautiful presentation and all you do. Councilmember Mongeau, did you want to say a couple words?'",
        "'speaker_4': 'Just thankful for the opportunity to have this in our city. Thanks so much.'",
        "'speaker_5': 'Yes. And I'll just add while you're taking a picture. Sure. Park is right in the middle, in the heart of the eighth District. And I could hear the festivities from my backyard as I was embroiled in a big project over the weekend.'",
        "'speaker_5': 'Summer, you've always been about love and the kids, and we appreciate you. And I have a story about Summer Hanson back in the day. Right. If you were in any of the night establishments in Long Beach, she was always the person bringing love because she would always bring nice red roses for you to buy for your loved'",
        "'speaker_5': 'one to to purchase. And I purchased many of them over the years. So thank you for that, for your for your great contributions to my love life in the past.'",
        "'speaker_3': 'And to DH Andrews who when when he was first getting ready. Thank you. I first getting ready to be you know, to run for office. One of his ideas was to make a wonderful. You know, fathers are helping fathers to be better.'",
        "'speaker_3': 'We movement.'",
        "'speaker_5': 'We look forward to 25 more.'",
        "'speaker_3': 'He did so great.'",
        "'speaker_5': 'Children's Day happening here in the city of Long Beach. Thank you very.'",
        "'speaker_3': 'It's going to be up to the rest of you. Yes.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_3': 'All right.'",
        "'speaker_5': 'I know we have to move on.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'Thank you. So next up is item number 24.'",
        "'speaker_2': 'We need a public comment.'",
        "'speaker_5': 'Any public comment on Children's Day? I think we just had it.'",
        "'speaker_10': 'I think so. All right. Members of Long Beach City Council, my name is Jim Oberst. I am with an organization being developed called the Creative The Climate Change Creative Committee of Children say we're made up of a series of of energy and issues of of renewable energy companies of we at your park, we formed a relationship with'",
        "'speaker_10': 'Miss Cherry of the Boy Scouts of America, which will be launched in 30 different schools of kids, basically helping to develop energy projects, renewable projects of various sizes from rooftops to geothermal projects. That will be that that'll be shown at Children's Day this year.'",
        "'speaker_10': 'Children will be given scholarship funds for participating in the program, but most importantly, they will be applying their knowledge that they're learning in schools to actually implementing these projects, which grades K through 12 to learn basic math and how that goes into sizing systems.'",
        "'speaker_10': 'English for persuasive arguments, music to celebrate the coming of the green economy. But most importantly, Sun Projects is a company that is licensed in about eight different states. They want to take this program as we are developing the pilot project in these 30 schools to be replicated within the scope of of some project.'",
        "'speaker_10': 'And as I have said in a previous statement, Greg Stewart, who is a local resident of Long Beach, who runs a company called Noble Therm but is a geothermal energy company. We are participating in a project in in restorations of different cities that were damaged and destroyed in fires in Northern California and turning and having them rise'",
        "'speaker_10': 'like phenixes to be completely green and sustainable. What we would love to be, what we would love to be able to do is engineer who developed the Stirling engine that is both doing the geothermal power as well as the water filtration cleanup at paradise that we're proposing in Paradise, California.'",
        "'speaker_10': 'We would love to be able to introduce that here as well and raise money for our scholarship initiative and our homeless housing programs. Thank you. You'll notice that actually in the flier that I gave you, which is right here.'",
        "'speaker_5': 'Thank you for the reinforcement. Appreciate your comments. Any other public comment? Harry Nunn members, please cast your vote.'"
    ],
    "Recommendation to suspend Council rule contained in Long Beach Municipal Code Section 2.03.020 (B) relating to the meeting schedule of the City Council to cancel the meeting of August 6, 2019 due to National Night Out.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_5': 'Okay. Moving on to item number 24.'",
        "'speaker_1': 'Communication from Councilmember Jago, Councilwoman Price.'",
        "'speaker_3': 'Councilwoman Mongeau.'",
        "'speaker_1': 'Recommendation to cancel the City Council meeting of August six, 2019 due to National Night.'",
        "'speaker_2': 'Out.'",
        "'speaker_5': 'Councilmember. You want to.'",
        "'speaker_11': 'Seems like every year we never have an opportunity to join our neighbors out in National Night Out. So I think this time we will try to make it happen this time. And I hope that I could get the support of many of my colleagues.'",
        "'speaker_5': 'Councilmember Mongo.'",
        "'speaker_4': 'I would just like the city staff to take note that this is a big event in the city and that there's lots of neighborhood association and block events that we should be attending and perhaps some planning the 2020 calendar to take notice that we've been attempting to every single year make the same item to make sure that'",
        "'speaker_4': 'we can be out in the community with our residents. So I look forward to seeing the residents of the fifth District, but I also hope that we can plan better, that the council officers don't have to make this every year.'",
        "'speaker_5': 'I'm looking forward to doing it as well. See no other council comment, any public comment on this? CNN. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to adopt resolution amending the Water Salary Resolution establishing the salary for the Electrical and Instrumentation Supervisor classification and adjusting the salary range for the Water Utility Supervisor I-II; and": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_5': 'Item number 30 Please.'",
        "'speaker_1': 'Report from Human Resources Recommendation to adopt resolution amending the water salary resolution and adopt a resolution amending the city salary resolution citywide.'",
        "'speaker_5': 'Okay. It's been moved and seconded. Can we get a brief staff report on this?'",
        "'speaker_8': 'Dana Anderson.'",
        "'speaker_12': 'Good evening, Mayor and City Council. The salary resolution creates certain offices in positions of employment in the city and fixes the amount of compensation by incorporating the city's personnel ordinance, civil service rules and regulations and applicable labor abuse.'",
        "'speaker_12': 'As a result of the completion of the media cover confer process with the Long Beach Supervisors Employees Association regarding the creation and changes to classifications, staff requests that the Council adopt the attached salary resolution amendments which reflect the following changes establish the salary range for the new Electrical and Instrumentation Supervisor classification in the Water Supply Resolution, which'",
        "'speaker_12': 'will provide direct oversight to the new Electrical and Instrumentation Technician Classification. Increase the salary range of the water utility supervisor one in the salary in the water salary resolution from range 582 640 and level two from range 622 660 to align the salary commensurate with adjustments authorized for subordinate job classifications in the water department.'",
        "'speaker_12': 'In addition, increase the salary range of the gas maintenance supervisor one from range 580 to 564 and level two from 6 to 622 630 in the city salary resolution also to align the salary commensurate with adjustments authorized for subordinate job classification in the Energy Resources Department.'",
        "'speaker_12': 'The City and Long Beach Supervisors Employees Association have reached a tentative agreement to the new classification and salary range adjustments and it is staff's request that Council adopt both the city and water salary resolution amendments. I am available to answer any questions you may have.'",
        "'speaker_5': 'Okay. Thank you for that staff report or any questions from council here and not any public comment. Great. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ]
}