{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt resolution accepting Mitigated Negative Declaration (IS/MND04-18);": [
        "'speaker_3': 'Okay. We have two hearings, so we're going to get through those first. And so hearing item number one.'",
        "'speaker_2': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution accepting the mitigated negative declaration. Adopt a resolution approving a general plan amendment. Declare ordinances, amending a zoning code amendment relating to the high rise overlay district and approve a zoning change.'",
        "'speaker_2': 'Read the first time lead over to the next regular meeting of the City Council for a final reading and approve a tentative parcel map to consolidate ten existing lots and then northerly 24 feet of the vacated alley into a single fit lot and approve a site plan review to allow construction of a four storey 102,840 square foot'",
        "'speaker_2': 'office building up to 74 feet in height in the high rise overlay district, including a three story parking structure within the CC and district at 3443 Long Beach Boulevard and 210 East 35th Street District seven.'",
        "'speaker_3': 'Thank you. We are now going to begin by opening up the the the item. I'm going introduce Mr. Modica. I don't believe an oath is required, Madam Clerk. And so, Mr. Murdoch, I'll do the presentation.'",
        "'speaker_10': 'Thank you, Mr. Mayor. We will hear first from Linda Tatum, our development services director, and she has an introduction and an announcement for us.'",
        "'speaker_8': 'Good evening, Mayor. Members of the City Council, I'm really pleased to present to you the staff that will make this presentation tonight. That's Alexis Oropesa. And I'd like to also announce that as of last week, Alexis has been promoted to the position of current planning officer.'",
        "'speaker_8': 'So we're really pleased to have her. She brings a lot of talent to the team and she's worked really hard. And if you don't recall.'",
        "'speaker_4': 'She replaces Carrie Tai.'",
        "'speaker_8': 'Who left to go to the port. So with that, I'd like to introduce you to Alexis.'",
        "'speaker_1': 'Thank you, Linda. Good evening, Honorable Mayor Garcia and city council members. For you tonight is the Laser Fish Office Project. Before getting into the project details, a brief project, a brief background of the project will be provided. In January of this year.'",
        "'speaker_1': 'The Planning Commission held a public hearing, considered public testimony both in support and in opposition to the project. The Planning Commission made a general plan conformity finding for the proposed alley vacation and took action, recommending the city council approve the project, which includes a site plan review, tentative parcel map mitigated negative declaration as well as general plan'",
        "'speaker_1': 'amendment zone change and zone text amendment. Following the Commission's action, an appeal was filed and then subsequently withdrawn. The applicant indicated that they had worked with the developer to ensure their concerns regarding emissions reductions had been addressed. So for tonight, we will focus on the entitlements rather than the appeal.'",
        "'speaker_1': 'The project is located at the north of the four or five freeway in the neighborhood of Bixby North. The project is located at the north end of the block, bound by Long Beach Boulevard to the east, 35th Street to the north and Locust Street to the west.'",
        "'speaker_1': 'The freeway onramp is located at the southwest corner of the block and Wardlow Road is located to the south. The project site consists of ten existing lots that are shaded in blue and separated by an existing alley that is identified by the black and white diagonal striping.'",
        "'speaker_1': 'For context, the project site is surrounded by a mix of uses which include residential to the west and south, a parking lot and office building to the north across 35th Street and a restaurant and oil derricks to the to the east across Long Beach Boulevard, as well as a gas station immediately to the south.'",
        "'speaker_1': 'The western portion of the site is currently zoned single family residential, and the eastern half is located within the community automobile oriented district and also has an existing high res overlay on it. The site photos depict the existing conditions of the site, which is vacant of any buildings today.'",
        "'speaker_1': 'The middle photo shows the North North-South Alley, which runs between 35th Street and Wardlow Road to the South. The majority of this alley is in an unproved, unimproved condition as depicted in that middle photograph. Previously, the site was developed with a range of uses, including a single family residence.'",
        "'speaker_1': 'Oil wells on the western half of the site and on the eastern half was previously developed with an office bar, billboard and additional oil wells. The applicant seeks approval of a tentative parcel map to consolidate the ten existing lots into a single 2.02 acre site that is to be developed with the four storey 102,848 square foot office'",
        "'speaker_1': 'building with a maximum height of 74 feet. The office building is identified, shaded in red in the exhibit, and a separate three story parking structure containing 343 parking spaces is proposed as well. The area showed it show a shaded in yellow identifies the bike parking area that is to be located within the parking structure.'",
        "'speaker_1': 'Vehicle access to the parking structure is low, located towards the middle of the street and identified by the dual red arrows on the screen. The perimeter of the site is designed with ample landscaping to soften the building's appearance and serve as a transition between the sidewalks and the residential uses to the south and the West.'",
        "'speaker_1': 'The proposed project will assemble the existing lots into a sizable area for significant development. That includes area improvements, which will include a new Signalized intersection at 35th and Long Beach Boulevard. A second left turn land will be turn lane will be incorporated into the northbound Long Beach Boulevard intersection.'",
        "'speaker_1': 'And then in addition, there will be improvements to sidewalks, parkway treatments and an approved alley. The architecture of the building makes use of clean lines, generous floor to ceiling heights and large ample areas, window areas that is reminiscent of mid-century architecture and compatible with the area.'",
        "'speaker_1': 'The eastern half of the site is located within the high rise overlay, which establishes the four storey height limit but allows for the actual building height to be defined through the site plan review process. The Planning Commission found the building height appropriate based on the proposed building form, as well as buildings of similar height along that corridor'",
        "'speaker_1': 'and the building relationship to the surrounding uses. The building has also been configured to locate the taller elements towards the center of the site along the alley that is to be vacated. The Commission found the project configuration and the design thoughtfully composed and advances the objectives of the purpose of the zoning code as well as the general'",
        "'speaker_1': 'plan. However, in order to facilitate the project, a general planning and zoning change and zoning code amendment will be necessary. The General Plan Amendment is proposed on the western half of the project site and I identified on the left part of your screen by the diagonal lines.'",
        "'speaker_1': 'And this would be changing the land use designation from single family residential to allowed eight commercial. The eight commercial corridor designation is characterized as being appropriate along major corridors. Since this area is contiguous with the new designation to the east and is proposed to be merged into a single lot fronting on Long Beach Boulevard, it is found'",
        "'speaker_1': 'to be consistent with the general plan, especially in conjunction with the development that is proposed. The Planning Commission found the amendment promotes the orderly development of the city, but is also a benefit to the public interest by supporting the investment of an existing business within the city.'",
        "'speaker_1': 'As a. Commission. As.'",
        "'speaker_5': 'Oops.'",
        "'speaker_1': 'A zone change is also proposed for both halves of the site to the CC and designation. The K and CN districts of both fall within the broader community commercial class districts, and this is represented on the right side of your screen.'",
        "'speaker_1': 'The community commercial class of districts are intended to provide medium scale users that may require buffering to ensure compatibility with adjacent neighborhood uses. These zoning districts are located on both major and minor arterials, located on and located on larger lots adjoining larger scale residential neighborhoods, which is fitting in this location.'",
        "'speaker_1': 'The proposed change. Is contiguous with the K district that is within the broader community commercial district. The high rise overlay district composes less than 1% of the city's 51 square miles. The project site is within the high rise overlay, which straddles both sides of Long Beach Boulevard, and there is no proposed change to the location of that'",
        "'speaker_1': 'zoning district. However, the high rise overlay what is proposed is a zoning code amendment to the high rise overlay yard requirement. This zoning code amendment would allow for the averaging of setbacks through the site plan review process. This averaging of setback and discretionary review would provoke promote greater design diversity by providing flexibility in cases where it was'",
        "'speaker_1': 'found appropriate. In accordance with the California Environmental Quality Act. A mitigated negative declaration was prepared and circulated for public review from December 17 through January 17th. The remedy found that all impacts can be reduced to less than significant through the adherence to the mitigation measures, which range from the inclusion of a second left turn lane of the'",
        "'speaker_1': 'Language Boulevard to a biological survey. Public noticing was distributed in accordance with the Long Beach Municipal Code. Staff has received one letter expressing support for the project in response to the council notices. The recommendation to the city council tonight is to enact the Planning Commission recommendation with one modification.'",
        "'speaker_1': 'In that we are requesting that the City Council accept the mitigated negative declaration by action and not by a resolution as indicated in the staff report. With that, that concludes staff's presentation and we welcome any questions you may have.'",
        "'speaker_1': 'The developer is in the audience, as is our consultant.'",
        "'speaker_3': 'Thank you very much. Thanks for the staff presentation. We do have a motion in a second. I'm going to ask for any public comment on this item. Now is the time. Getting no public comment on this item. I'm going to go ahead and go back to Mr. Come, Ringo.'",
        "'speaker_10': 'Thank you, Mayor. Before I make any other comments or questions, I would like to, first of all, thank staff for their work on this project. It's been one long in coming and I also want to especially thank our developers of a laser fish, Mr. Chris Wacker, who has been very accommodating in listening to the reviews and looking'",
        "'speaker_10': 'at the appeals and implementing a lot of the recommendations that came forward and being able to be a person to work with and a project to work with that that is going to be great for the Long Beach area, especially when we're looking at a major employer here in Long Beach and and a business that it has'",
        "'speaker_10': 'been very, very strong with Long Beach. And we're glad to have your headquarters here in Long Beach. So we really appreciated over that had to work. If there's any one question ahead had the alley that's in the back, it's a it's an alley that is very tore up, I guess, for lack of a better word.'",
        "'speaker_10': 'It's not all that a pit and it's just a horrible area. Are there any plans to address that, that alley in the back?'",
        "'speaker_3': 'Let me have someone answer either at the mike or staff concept developed up after that, please.'",
        "'speaker_1': 'Excuse me. There are plans with Ali vacation for the entire length of the alley to be improved.'",
        "'speaker_10': 'What? That's great. That's all I have to say for his project. It's a good project, and I hope that I could get the support of my my colleagues to vote yes.'",
        "'speaker_3': 'Thank you, Councilman Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And I want to just add a few comments and say congratulations, Councilman Urunga and the laser fish team. It's a beautiful project and you've done a great job in making sure that the entire city understands this investment that you're making and the commitment you're making in Long Beach.'",
        "'speaker_7': 'And so I do want to want to recognize this. And, you know, the last thing I'll say that, you know, you know, districts seven, eight, nine, the uptown community is great to see someone place their their headquarters in the uptown community.'",
        "'speaker_7': 'I think that that's a feather in feather in all our caps we're really, really proud of, but proud about that and I think is going to do a lot for the neighborhood. So congratulations to all of you. And I'm going to be supporting this.'",
        "'speaker_3': 'Thank you. Councilman Pearce.'",
        "'speaker_1': 'I yes I too am one of the things staff for this. I had the pleasure of getting to take a tour of the existing facility and see the size of the lot next to it. And it's kind of cool to have like our Long Beach Google like business here and that you guys are opening up a second'",
        "'speaker_1': 'facility. It's just great to know that we have Long Beach jobs that are staying local and want to applaud everybody for the efforts that you guys did to get us here today. So thank you, everyone.'",
        "'speaker_3': 'Thank you, Councilman.'",
        "'speaker_6': 'Well, I'm only slightly disappointed that the final project didn't end up in the fifth District. I will say that the the documentation provided by your team is the most extensive and best project I've seen in my five years at the council.'",
        "'speaker_6': 'So I thought that for a layperson to be able to look through it, I didn't have to ask the same kind of questions that I've asked and had to learn through things in the last five years. So I really appreciate that.'",
        "'speaker_6': 'I think it's really approachable and easy to explain to residents because of the way that you put the packet together. So thank very much. Thank you very much.'",
        "'speaker_3': 'Thank you, Councilman.'",
        "'speaker_9': 'Thank you. And I want to take this opportunity to congratulate my and my good friend, Councilmember Urunga, but the entire big business community and the city for being able to to have laser fisher as a partner, continued partner and expanding their their footprint here in in our community, I've had the opportunity to know Chris Wacker for for'",
        "'speaker_9': 'some time now. We were here over a decade ago on the YMCA board in Fairfield, and they have always been great community partners, aside from a great business model for our city. And so I'm enthusiastically in support of this.'",
        "'speaker_9': 'And this four storey building, I think is, is why, you know, when we went through our land use element few few months ago, it wasn't just about housing. It was about also creating good businesses with great jobs in our city as well.'",
        "'speaker_9': 'So congratulations.'",
        "'speaker_3': 'Thank you. Vice Mayor Andrews.'",
        "'speaker_0': 'Yes, thank you, Mayor. I first I want to thank our Councilman Durango for, you know, having this wonderful project in his district. But I think all the districts are disappointed because you can't get in one in all of our districts.'",
        "'speaker_0': 'So we're just going to buy that time until that happens. But but this is a great project for the city of Long Beach. And it's you know, when I look at it, all I see is jobs because I think it's a wonderful, wonderful project here.'",
        "'speaker_0': 'And of course, I thank you. And your wife has created a world class company in the city of Long Beach. And for that, the city is grateful to you. And we support and applaud your efforts to expand your companies here and in Long Beach.'",
        "'speaker_0': 'And I wholeheartedly support this project. And thank you again.'",
        "'speaker_3': 'Thank you so much, Councilwoman Gonzales.'",
        "'speaker_8': 'Yes. I want to just add on to everything that my colleague said. Chris, thanks so much for being a great partner. We were just singing your praises in Vancouver last week, talking about tech and bringing tech to Long Beach and specifically called out laser fish for being a great partner.'",
        "'speaker_8': 'So thank you so much. We're really glad to to see this expand and we look forward to seeing you succeed. Thanks so much. Continue to succeed.'",
        "'speaker_3': 'Thank you. We have a motion in a second. Let me just, of course, add, as you all know, I've been very supportive of Laser Fisher's expansion. I think this is a great project, very excited about the work the staff has done with the community and with Councilmember Ranga in particular.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Table 41-1C of Chapter 21.41, relating to Alcoholic Beverage Manufacturing, read and adopted as read.  (Citywide)": [
        "'speaker_3': 'So Councilman, thank you for for helping guide this project. Please cast your votes.'",
        "'speaker_2': 'Councilman. The motion carries.'",
        "'speaker_3': 'Thank you. And I know we have a second hearing. That's a short one as well. So. Madam Clerk.'",
        "'speaker_2': 'Report from Development Services recommendation to receive supporting documentation into the record to conclude the public hearing and accept categorical exemptions and statutory exemption. Declared ordinances amending the Long Beach Municipal Code relating to alcoholic beverage manufacturing definitions and accessory dwelling units.'",
        "'speaker_2': 'Read the first time and lead over the next regular meeting of the City Council for Final Reading and adopt a resolution directing the Director of Development Services to submit the ordinance amendment to the California Coastal Commission citywide.'",
        "'speaker_10': 'Mr. Modica presentation will be given by Linda Tatum and Christopher Koontz.'",
        "'speaker_8': 'Okay, actually I'm going to introduce Alexis again, who will do the honors of making this presentation.'",
        "'speaker_1': 'Good evening again. The item before you tonight consists of a handful of zone text amendments resulting from the California Coastal Commission's review of several ordinances adopted over the last couple of years and were submitted to the Coastal Commission as part of a local Coastal Program Amendment.'",
        "'speaker_1': 'The ordinances that were included were the Alcohol Beverage Manufacturing Ordinance Zone tax changes to reflect changes in the building code, as well as state water efficiency regulations and the accessory dwelling unit ordinance. The California Coastal Commission considered these changes at their October meeting of last year and certified the LCP amendments with changes in the following slides.'",
        "'speaker_1': 'I will briefly recap those changes and which must be adopted and recertified and resubmitted to the Coastal Commission for Certification. The first of these changes relates to the Alcohol Beverage Manufacturing Ordinance, which was reviewed in 2016 and adopted changes.'",
        "'speaker_1': 'The Coastal Commission's action on this item simply provides clarification for parking related to office areas that are equal to 25% of the gross floor area. In response to the triennial building code update and state water efficiency standards, a number of zoning changes were made to create consistency between zoning, building code and state law.'",
        "'speaker_1': 'The California Coastal Commission, in their review, made a number of modifications to clarify code and eliminate references to code sections outside of Title 21. In the case of the definition of rebuild and demolish and a unique definition for within the coastal zone was adopted here.'",
        "'speaker_1': 'Staff is recommending that a single definition of rebuild and remodel be used throughout the city. The purpose of this is to create clarity for developers, contractors and homeowners. In 2016, the state legislature made sweeping changes to address the state's housing crisis, which effectively reduced the city's abilities to regulate accessory dwelling units in an effort to tailor some'",
        "'speaker_1': 'local standards. An ordinance was adopted in December of 2017, providing minimum lot size, basic design standards and parking for 80 to use. At that time, the city council requested an update a year following the adoption of the ordinance, and then this slide briefly will provide a snapshot of where we are today.'",
        "'speaker_1': 'Since January of 2017, 146 building permits for 80 use have been issued. We have currently approximately 9982 planned trucks in various stages of review. The majority of those that have been permitted are resulting from conversions of existing structures, and we have seen the legalization of approximately 10% of unpermitted structures through these 80 permits.'",
        "'speaker_1': 'The Coastal Commission. Reviewed the accessory dwelling unit ordinance and made changes, specifically changing the minimum lot size to 4800 square feet to reflect the state law. In addition, they revised the parking standard so that parking is exempt. All Excuse me, so that once parking spaces is required, except when the location meets the exemption criteria prescribed in state'",
        "'speaker_1': 'law. The amendments made by the California Coastal Commission to the minimum size and parking standard for ADAS were made to be consistent with the state law for the purpose of creating parity of standards between lots where 80 use can be constructed.'",
        "'speaker_1': 'A modification mirroring the state's change is proposed throughout the city by staff. Having the same minimum lot size and parking standards will help to reduce uncertainty in the standards for architects, contractors and homeowners as they negotiate the code.'",
        "'speaker_1': 'With regards to the parking. State law prohibits cities from requiring parking when an ADU is in. Any of the following is any of five locations, including when it's within a half mile of a public transit. As the City Council may recall, nearly the entire city falls within this category.'",
        "'speaker_1': 'So parking would effectively be eliminated in this case. But it is. These changes are consistent with the state law, which is why the Coastal Commission made the action. Public noticing. Public notices were published in the Press Telegram on February 15th, and additional notices were sent to persons who had submitted written communication on the draft edu ordinance.'",
        "'speaker_1': 'No comments have been received to date in accordance with the California Environmental Quality Act. These changes are all either categorically or statutorily statutorily exempt. Staff recommends that the City Council adopt the zoning code amendments as presented and direct staff to submit the changes to the California Post.'",
        "'speaker_3': 'Thank you very much. Is there any public comment on this item? Please come forward. You just want I'm going to close public to the public speaker's list for answer.'",
        "'speaker_7': 'Thank you. My name is Brian Wolf. I live at 5015 East Third Street in Long Beach. I'm speaking as a private citizen. Homeowner. Appreciate the opportunity to provide comment for the accessory dwelling unit ordinance amendment. Just briefly, ensuring quality and affordable housing in our diverse populations.'",
        "'speaker_7': 'Important goal for the city in the general plan. A well-crafted 80 U ordinance utilizing form based practices will contribute strongly to the school while maintaining neighborhood character. Further, the scale of it's kind of a grassroots level as opposed to larger affordable housing opportunities and encouraging individual owners occupants to invest in their communities.'",
        "'speaker_7': 'For me, I've been a proud homeowner in the Belmont Heights neighborhood for over 15 years. My wife and I love our neighborhood. It's zoned r one and along with a lot of area in the city and where we're moving into retirement, we very much want to be able to stay in the neighborhood and constructing a native view'",
        "'speaker_7': 'on our property will allow us to age in place, supplement our fixed income, and provide additional affordable housing in a great location. We really love it. Others, you know. You know, it's a great form of additional density for us, you know, able to provide housing for surviving elderly parents, students, mixed family, extended family accommodation.'",
        "'speaker_7': 'And, you know, we broadly have an aging demographics. So making those provisions for people to stay in their homes and downsize is really important. As a practicing architect here in the city, I've looked closely at the requirements and believe the current ordinance as well.'",
        "'speaker_7': 'Well-considered with a couple of following exceptions, I was very happy to see the amendment for reduced lot size to be broadly applied to the city beyond the coastal zone. So that was great to see. I would argue, you know, the established form based controls and what I mean by that height limits, setbacks, lot coverage, open space for'",
        "'speaker_7': 'area ratio and unit size range are fairly extensive in the ordinance and the lot size limitation I would argue, should be removed entirely because it's not necessary and discourages innovation. I definitely reverting to the 4800 square foot size recommended by staff for all areas in the city is a move in the right direction and I would support'",
        "'speaker_7': 'that strongly. Parking I I've a little district in agreement we really ought to keep the.'",
        "'speaker_3': 'Thank you some. Thank you so much, sir. Oh, time's up. Sorry about.'",
        "'speaker_7': 'That. Really? 3 minutes.'",
        "'speaker_3': 'I thought it was 2 minutes.'",
        "'speaker_7': 'Okay.'",
        "'speaker_3': 'Thank you. Thank you very much, sir.'",
        "'speaker_7': 'Good. Could I have just 15 seconds?'",
        "'speaker_3': 'Sir, we have to keep the time. But if you want to conclude your thought, go ahead.'",
        "'speaker_7': 'I would just add the parking. We have a mobility plan strategy in the city. And and keeping the. The parking, as stated currently in the ordinance would be better. Thank you. Supportive to those strategies.'",
        "'speaker_3': 'Thank you very much, sir. Let me go ahead and go to Captain Richardson.'",
        "'speaker_7': 'Support.'",
        "'speaker_3': 'Councilor Pearce.'",
        "'speaker_1': 'I want to thank staff for their hard work on this. I support the recommendation, the changes that you guys have outlined in this. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_6': 'So my residents were the ones who were big advocates for the 5000 square foot lot. And I appreciate that staff are looking for consistency across the city. Would you be able to remind us on what date we we adopted the initial.'",
        "'speaker_6': 'Requirements.'",
        "'speaker_8': 'When to say it was? I want to say it was in November of 2017.'",
        "'speaker_6': 'And have there been many individuals who are somewhere between 40 805,000 square feet where they were eliminated because of the ordinance, the way it was written with community input?'",
        "'speaker_9': 'So there have been a handful of cases. I don't remember any of them being in your district council member, but certainly we've received calls from folks living in council districts two, three and four that are in that situation.'",
        "'speaker_9': 'There's approximately 5000 impacted properties in that range, between 4850, 200.'",
        "'speaker_6': 'You see the number of properties again, I'm sorry, there's a lot of numbers and.'",
        "'speaker_9': 'There's approximately 5000 across the entire city. So if there is a 1% chance of an EDU being constructed in a ten year period, we're talking about, you know, in the 50 to 100 additional ideas.'",
        "'speaker_6': 'So I guess my concern is this ordinance hasn't even been in place for a year yet, and we're already coming back to the table with a note.'",
        "'speaker_9': 'Respectfully, that was 2017 that this ordinance of November 2017. And we we've seen fewer than anticipated 80 years constructed in that time.'",
        "'speaker_1': 'And Councilwoman, I would also.'",
        "'speaker_8': 'Indicate that the initial recommendation that we're coming to city council tonight was based upon the the feedback from the Coastal Commission.'",
        "'speaker_6': 'There. Their feedback for the coastal zone is one thing, but you're asking us to apply it to the whole city.'",
        "'speaker_1': 'That's correct.'",
        "'speaker_4': 'Because we are as as Alexis stated, the idea is.'",
        "'speaker_1': 'That.'",
        "'speaker_8': 'We would have two different standards in the city and in the interest of parity and lack of confusion. Staff's suggestion is that we think that it makes more sense to have one standard rather than a couple of different standards.'",
        "'speaker_6': 'Would. I'd be open to this ordinance if we could just maintain the original 5000 for the rest of the city. I just feel as though there was so much community input and residents in the fifth District felt so strongly of a number significantly higher than 5000 that to make such a change.'",
        "'speaker_6': 'On an item that really appeared to be around some other types of municipal changes, I think was just a little. I could have done a better job informing the community had I known and understood that this was the breadth of it.'",
        "'speaker_6': 'So, Councilmember Richardson, would you be open to a friendly to maintain the 5000 for the rest of the city?'",
        "'speaker_7': 'So I don't feel strongly one way or the other on this. I'll be clear, but I do want to hear from staff the intent of doing this with a streamline it in the middle consistent with other well with other codes.'",
        "'speaker_7': 'So can can we hear from the city attorney or whoever is working on this was the implication?'",
        "'speaker_10': 'I just want to add that for clarity, the number is actually 5200 square feet, not 5000.'",
        "'speaker_1': 'Right.'",
        "'speaker_10': 'So Alexis explained it very well. The Coastal Commission made this suggestion because they're interested in promoting a to use as a means in the coastal zone to have more people have the ability to be in that area. City wants to do it to keep it consistent citywide.'",
        "'speaker_10': 'You couldn't keep it. There's no legal requirement that you reduce it to 4800 citywide. But I think stats made clear that they feel that that's the better course.'",
        "'speaker_6': 'And so of those 50, how many units, how many parcels did you mention, Mr. Cook?'",
        "'speaker_9': 'There's approximately 5000 impacted parcels.'",
        "'speaker_6': 'And how many of those parcels are in District five?'",
        "'speaker_9': 'I don't have that information at my fingertips.'",
        "'speaker_6': 'I would be confident that it's a large share of those. I can name 1400 of them that were all built by SNF properties that are almost all on properties that are 5064 feet or 5000 to 5100 feet. So that is a huge impact of a particular group.'",
        "'speaker_6': 'I don't see that they're very aggressively looking to put it to you then, but I think that some outreach or some information to those neighborhoods I would have done a better job of had I recognized that that component of the recommendation was coming.'",
        "'speaker_6': 'And so I appreciate that we had ten days on this, but this is a huge implication in potential items.'",
        "'speaker_9': 'So it is a policy decision for the council to make. We did notify everyone that participated in the process the first time around on the ADA ordinance and whatever decision the council makes tonight. If you could just orally explain the basis of that decision.'",
        "'speaker_9': 'Every time we touch the ADA ordinance, we have to send it to the state, to HPD, and to the degree that we place restrictions on ADA use, those restrictions need to be based in sometimes some compelling citywide goal and not meant to deter the construction of needed housing.'",
        "'speaker_9': 'So it is a policy decision for the Council to make, and you can go either way. If you could just we'll have to have that discussion with our friends in Sacramento. So anything you can give us to help defend that decision, we appreciate that.'",
        "'speaker_6': 'I appreciate that. I would have to go back and watch the meeting. When you talk about informing anyone who participated the first time, does that include people who came to public comment or emailed in public comment to the city?'",
        "'speaker_9': 'If they had emailed, we have their emails. When folks come to the dais at a council meeting, we don't have speaker cards, so we don't necessarily have contact information for them. So it's the folks that we do have contact information for.'",
        "'speaker_7': 'So again, it sounds like we need a compelling reason. I'm comfortable making staff's recommendation. I didn't anticipate jumping into a policy discussion. If you want to sub me out, that's fine, but I think I'm going to stand on.'",
        "'speaker_7': 'My intent was to support the staff recommendations.'",
        "'speaker_6': 'Is there a a compelling reason why there's a timeliness to approving this tonight? No. No. Would we be open to continuing this item until.'",
        "'speaker_7': 'I'm open to that. Absolutely.'",
        "'speaker_6': 'I would be really more comfortable and I'm happy to reach out to the neighborhood associations because I really want to know and understand what their point was. They actually had asked me for a much higher number. We settled on 5200.'",
        "'speaker_6': 'But I would like to go back to that research and look at it and talk about it and maybe even have one. I mean.'",
        "'speaker_7': 'I think that's fair. So a month.'",
        "'speaker_6': '30 days would be great.'",
        "'speaker_9': 'Lay it over 30 days. So if we can hear that item in April, we do need to provide an update to the Coastal Commission within six months, which will be at the end of April.'",
        "'speaker_7': 'So if we continue with.'",
        "'speaker_1': 'The.'",
        "'speaker_6': 'First week of April would be.'",
        "'speaker_1': 'That.'",
        "'speaker_9': 'Any time during the month of April will be acceptable. Great.'",
        "'speaker_6': 'I'll leave that to the city manager. Thank you.'",
        "'speaker_3': 'Kay, there's a motion to extend that. Is that is that the council which is new change that. Okay. That's that's an that's an emotion. There's a motion and a second on that. We will take a vote when you do public comment again on that on that piece.'",
        "'speaker_3': 'Mr. Mays. No. Okay. So, members, please cast your votes on an extended.'",
        "'speaker_6': 'Thank you.'"
    ],
    "Recommendation to receive and file a presentation from The Centennial Circle of Women on the 2020 Women's Vote Centennial Initiative commemorating the Suffrage Centennial. Direct City Manager to create a fund that would support 100 events citywide to increase civic engagement and to raise awareness about the history of Women's Right to Vote.": [
        "'speaker_2': 'The motion carries.'",
        "'speaker_0': 'Thank you. Now we're going to move to item 38 with the clock. Please read the item.'",
        "'speaker_2': 'Communication from Councilmember Pearce, Councilwoman Gonzalez, Councilwoman Price, Councilmember Super Na recommendation receive and file a presentation from the Centennial Circle of Women on the 2020 Women's Vote Centennial Initiative commemorating the Suffrage Centennial and direct city manager to create a fund that would support 100 events citywide, to increase civic engagement and to raise awareness about the history of'",
        "'speaker_2': 'women's right to vote.'",
        "'speaker_0': 'Thank you. I'd like to turn it over to Councilman. Okay.'",
        "'speaker_1': 'Thank you. So this, as the clerk read as a receiving file, a presentation on the 2020 Women's Vote Centennial Initiative commemorating the suffrage centennial and directed city manager to create a fund that would support 100 events citywide, agrees to increase civic engagement and to raise awareness about the history of women's rights to vote.'",
        "'speaker_1': 'And we did this item to make sure that we kick off Women's History Month talking about women and the contributions that they have made not only to Long Beach, to California, but to the nation. And so I know that we're going to have a small presentation from our Human Relations Commission and our women's historian, Zoe Nichols.'",
        "'speaker_1': 'So I hope that we can hear that presentation and then just have a conversation about what some easy next steps might be for us and between now and August. So come on down, ladies.'",
        "'speaker_4': 'Thank you so.'",
        "'speaker_5': 'Much.'",
        "'speaker_4': 'Um, Mayor Garcia, members of the city council and city staff, of course. Thank you for allowing us some time to share with you. I'm assuming somebody will hand us a little clicker at some point if we need it.'",
        "'speaker_4': 'Um, we're here to discuss the upcoming suffrage centennial, which happens in August of 2020. Thank you very much, sir. Um, and what we can do in here in Long Beach to celebrate and educate around this heroic day? This is not just about what happened 100 years ago, but is a great way to continue conversations about voter turnout'",
        "'speaker_4': ', suppression, the census and historical local women. First, Zoe Nicholson. We'll talk about suffrage and how it is being celebrated nationally and locally. I will be back to talk about the advocates in the circle of women. I also want to make sure you understand we are here tonight as citizens of Long Beach.'",
        "'speaker_4': 'We have also put on your dais a letter from the HRC, of which I am the chair, who is also in support of this. But I'll be wearing my citizen hat this evening. Here you go.'",
        "'speaker_11': 'I brought your gifts. I tried to. Every year, every women's history month, happy Women's History Month. You all have a copy of the latest edition of the Suffrage Gazette. In 1904, in her senior year at Swarthmore, my favorite human being, Alice Paul, was advised by her biology teacher that it would be better for her first senior year'",
        "'speaker_11': 'to work actually in to go to New York and work in a settlement house with poor immigrants. This middle class Quaker girl, upon seeing what poverty looked like, changed everything for her, and she realized there would be no equity until women works were explicitly included in the United States Constitution.'",
        "'speaker_11': 'And she saw on the way to do that, they would have to earn the vote. So she joined the suffrage movement in 1912. It had been languishing for 64 years. And with one with her 10,000 militants, they practiced high risk arrestable militancy and the vote was earned eight years later.'",
        "'speaker_11': 'August 26th, 1920. America is on the brink of celebrating the 100th birthday of this. It's called the Susan B Anthony Amendment. In fact, the 19th Amendment granted women the right to vote. Not unrelated. We're also hoping that by the time that Centennial arrives, we will pass the Lucretia mott Amendment, known as the Equal Rights Amendment.'",
        "'speaker_11': 'State and city legislatures, the United States government, the Commission on the Status of Women in all 50 states. That's one of the things that's in front of you here a UW, A.W., N.W., PC. Every university in this country, every women's organization, every library is going to be lining up.'",
        "'speaker_11': 'As you can see here. And I have to tell you, as I was Googling different states and who's participating, I literally had to stop because there were hundreds. So I just picked some that I thought you might find interesting.'",
        "'speaker_11': 'I got a big kick out of Montana and and the commission, obviously, here in California is is already active. And so that's just a smattering of the states that are participating next week. So I want you to look here.'",
        "'speaker_11': 'This is Long Beach and something you may not know. I'm really happy to tell you. In 1911, women met here in Long Beach in the largest suffrage group collected was right here at the Virginia hotel. There were over 35,000 women represented, 125 clubs, and they set to work to earn suffrage for California women.'",
        "'speaker_11': 'And they did, in fact, nine years earlier than the federal amendment. And one thing I really hope you will remember tonight, that when that passed, California was the biggest democracy on the face of the earth, where women could vote, which I think is a really it's something to be proud of.'",
        "'speaker_11': 'We hope everybody will know that by the time the centennial arrives next spring. So I wanted to pick out just a few of the completely raucous things that are happening. One up in the center, they have gutted the prison where the suffragists were held and are creating a museum.'",
        "'speaker_11': 'On the upper left, you will see that we are on the path to mark every grave of every suffragist here in the United States. In fact, Cora Morgan's grave right here in Long Beach, your own suffragist is marked.'",
        "'speaker_11': 'Her grave will be marked. Below that is a patch. And the Girl Scouts of America are creating a patch across the bottom. You see statues. There are statues going up all over the country that women in Tennessee where the vote took place over there are women that are going to be standing as sentinels as they did.'",
        "'speaker_11': 'They're actually building an entire park up there. Just to the right of the center is a park that's being built in Virginia to commemorate what's going on there. And of course, I'd be well, she's got a street in in Chicago.'",
        "'speaker_11': 'I'm hoping maybe Sally Miller Gearhart will get mentioned at Harvey Milk Park. He never spoke without her. I'm hoping that we're going to take the time to maybe put up a Dolores Huerta Street, a Dolores Huerta Park. And I do have to commend Councilmember Richardson with the Michelle Obama library.'",
        "'speaker_11': 'That's something really to be proud of. And the reason I had that book down there, films, plays, movies, TV shows, unbelievable things that are happening. And this is a really wonderful book on suffrage. And it's being made into a six part television series by Steven Spielberg and Hillary Clinton.'",
        "'speaker_11': 'They're working on it right now. Lesson plans, library readings, publishers, swag games, TV shows, concerts, all women companies of dancers, orchestras and retailers. I was just up there looking at Peet's Coffee for a Women's History Month. You can buy that now.'",
        "'speaker_11': 'We hope to see all of Long Beach rise up and understand the fantastic history we have here in Long Beach. Of women who earned the vote nine years before the federal vote. So finally, I know you might wonder what difference it makes.'",
        "'speaker_11': 'And here's the difference it makes. Congress now has 23% women. The 116th has 23% women. That's more than we've ever had. And as you can see, they and you may remember the State of the Union, many of the women on the Democrat side were white.'",
        "'speaker_11': 'And you're going to see us popping up all over the city, maybe at the Corgi parade. Maybe we will be walking, I believe, in the Rose Bowl and all over this city to commemorate the suffrage.'",
        "'speaker_5': 'Thank you. Thank you.'",
        "'speaker_4': 'Thank you. So I'm going to talk a little bit about what we want to do here. And there's a group of women that have come together in the last two months to build the circle of women. It is over 20 women that are strong advocates for the community who want to share their free time to make this'",
        "'speaker_4': 'centennial special for our city. And our goal is to not only celebrate and and and really think about what this means to us, but really educate. I think it was amazing that we had a youngster from World Tonight talking here at council.'",
        "'speaker_4': 'I started speaking in front of council and school board at about the exact same age, and it's really important to allow them to understand what vote their vote means. And so that's what we can do through this year of events.'",
        "'speaker_4': 'That's what we're hoping for is to start commemorating this this year in August of 2019, and do a year of events that this group is putting together. It will also allow us an opportunity to think about the things that the city has been really working on access and equity, the issues of gender rights, voter rights and the'",
        "'speaker_4': 'the census are just a few topics that we can talk about through the conversation that we would have through the centennial. This is the circle of women as it as the founding members. These about 20 people have come together evenings and had great food brought to those meetings to talk about what we can do as a team'",
        "'speaker_4': 'to bring the Centennial Suffrage and these ideas out into the public. We have also, as my hat as the chair of the Human Relations Commission, I have been in touch with the L.A. County Human Relations Commission, as well as their joint commission joint committee that they have that is talking about the suffrage centennial from the county standpoint'",
        "'speaker_4': '. We just had another meeting with them today, another phone call, and we're going to work together with them to really be a part of the centennial celebration throughout the entire Southland. Right now we're seeing that Pasadena, Santa monica and Long Beach are the three kind of main cities doing work around this with West Hollywood and a couple'",
        "'speaker_4': 'other cities coming on board. But we're lucky enough to have this group of women coming together early to start the ideas of how we can build this. And we're hoping to look to you tonight to talk about the ways that you can support us through that those moments.'",
        "'speaker_4': 'These are just a few of the things that we want to think about during this year. Art, of course, as you know, is very important to me and to those people here in the city. And it's a great way to educate and leave a lasting mark about something that's happened in our city.'",
        "'speaker_4': 'It's also very important that we do this education and talk about voter turnout. These are ways that we can move the conversation from 100 years ago to today. One of those pieces is we're hoping to commemorate women's firsts.'",
        "'speaker_4': 'There's a lot of firsts that have happened in our city, and we want to honor each of those pieces at different events and different things. As you heard in the motion. This is to think about 100 events. Wouldn't it be great to see 100 ways that we commemorate the centennial throughout that year?'",
        "'speaker_4': 'And that doesn't mean it has to be 100 galas or 100 little pieces of ways that we can be a part of something. But those can be all different sizes and shapes and look in many different ways. I think the other piece of that is the women really brought a spectacle to what it was to bring the'",
        "'speaker_4': 'right to vote to the nation, and we want to do that here in the city. So we have a list of items that we would love to share, but we don't have time tonight to go through them all.'",
        "'speaker_4': 'What we are hoping is that this the city and. City Council will come together with the circle of women to build a lasting moment in the inner city about what is happening for women and do that through events, moments, art, all the kinds of things that we can do.'",
        "'speaker_4': 'And we are also hoping that it can be an integral part of how Long Beach has become a driving force in women's rights. So I was lucky enough to be in this picture just a few months ago. I am a commissioner in an amazing age of this town where 51% of us are women.'",
        "'speaker_4': 'As you saw those numbers that Zoe shared, 23% of the Senate are women. But we are really looking towards really bringing women together to build the city that we want. I also appreciate being in a city where strong women do great community work, and that's what we're hoping to do to lead this effort.'",
        "'speaker_4': 'But we can't do that without your help. So as I said before, I put on my commissioner hat for a second and say that we have gone to the Commission on Human Relations to ask them for their support in getting this this word out and being a part of this event.'",
        "'speaker_4': 'But we're coming to you tonight to ask you a couple of things, and I'll put back my citizen hat on for these that you would be an advocate for the Long Beach Suffrage 100. That's the goal of this.'",
        "'speaker_4': 'We already have a Facebook page, a website that's getting built. We have Instagram and those other things. We're hoping that you will ask each of your staff to work with the circle of women closely to help build these events or share events that might happen and be able to allow us to be a part of them, and'",
        "'speaker_4': 'also to possibly appropriate funds to make a lasting monument to the world that we're talking about and what we're doing today, but also and what happened 100 years ago. So I want to especially thank Councilmembers Pearce and Gonzalez and Price and Superdad for bringing this tonight to the to the council.'",
        "'speaker_4': 'I think it's an important month for this to happen as it's Women's History Month, and that's what we should be talking about. And I thank all of you for the support you give to the city in the time you take.'",
        "'speaker_4': 'You give. Thank you.'",
        "'speaker_3': 'Thank you so much. And we have a great last speaker. We're going to go back to the council. Councilmember Pearce, that.'",
        "'speaker_1': 'Was the presentation to say no thank you.'",
        "'speaker_3': 'Oh, so that public comment.'",
        "'speaker_1': 'We haven't had public comment yet.'",
        "'speaker_3': 'I'm sorry. Councilman Pearce.'",
        "'speaker_1': 'So we haven't had public comment, but I will just follow up and say I appreciate the thoughtful presentation and I would like, you know, not only that, we as council members partner with and I committed my staff to partner with the organization.'",
        "'speaker_1': 'But really for this to be a call for our city clerk or city prosecutor's office to find a creative way in between August 26th of this year and August 26 of next year to partner so that we can do some education.'",
        "'speaker_1': 'I know that there's a conversation around funds, and I think it makes sense for you guys since you've just started a form to come back and really just work with city staff, with our city manager's office to try to figure out what that looks like.'",
        "'speaker_1': 'And then for staff to come back to us with any requests that might need city council approval. So that's kind of where we're at today. And again, I really think thank you, guys, because there's long history that I don't know and I'm learning every single day.'",
        "'speaker_1': 'And as much as you can do that work in the next year with our help, I think we'll be better for it. So thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_8': 'Yes, I'd like to say thank you as well to Amy from the Human Relations Commission, as well as the circle of women, and particularly Zoe Nicholson. She doesn't just do this in the month of March. She does this every single day.'",
        "'speaker_8': 'It is living and breathing in her inherently. And I really appreciate your passion to this. I read her books on the movement of voting and access to voting, particularly, obviously, for women. And it just inspires me personally and I look forward to researching a bit more with our city departments.'",
        "'speaker_8': 'I also I'm going to put our city clerk out there. I know we have great efforts going on in terms of marketing with voting specifically, and we need to absolutely ramp that up. Women need to vote. They need to understand that not just women, adult women, but K-through-12, you know, students, young students, like the young girl that'",
        "'speaker_8': 'we saw here, give them that opportunity to understand why they need to vote. Long Beach, City College, Cal State, Long Beach students as well. And I know we've been thinking about that, but I really look forward to advocating on behalf of District One for you.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_3': 'Thank you so much, Councilwoman and Councilwoman Pryce.'",
        "'speaker_8': 'Q I too, want to thank you guys for the presentation. Both of you so eloquent and I was so pleased that we have two young girls in the audience today who got the chance to listen to you both speak, because both of you are just incredible speakers.'",
        "'speaker_8': 'And Zoe, when you speak, it really is almost like song. I mean, it's very the cadence of it. And when you speak, it's just it's you know, I haven't always liked every word that's come out of it, but I but I love the tone and I approach it from a place of deep respect.'",
        "'speaker_8': 'So I do want to say that I think it's important for us to have to thank and recognize the brave women who founded women's right to vote in America and fought to achieve that goal 100 years ago. For me, we cannot continue to make progress without looking to the past to see where we have come from and'",
        "'speaker_8': 'honor the incredible work to achieve the historic milestone in our American democracy. If we want to continue progress and encourage, encourage women's voices in our society and give women the strength to run for office and ensure girls know that they can be leaders in our community, we have to honor the work that has gotten us here, knowing'",
        "'speaker_8': 'that we can't take it for granted. Personally, I know that I have an increased responsibility to vote as a woman, but that responsibility is doubled by the fact that I am an elected official who has been given the duty to represent over 50,000 people.'",
        "'speaker_8': 'So my vote here at the Council is also something I take very seriously every Tuesday night and honor the legacy of women's suffrage, the movement, and what it stood for. Representing those voices is something I take very seriously.'",
        "'speaker_8': 'And I think it's really important as we talk about the history that we think about the women that have served in this city. I look to my left and my right and I see women who have work who work hard every single day to represent their residents.'",
        "'speaker_8': 'And I know that the female voice is important to the progress we see in our communities. And I there's one piece of Long Beach history that I didn't know, and that is the first elected city auditor who was elected 100 years ago today is yes.'",
        "'speaker_8': 'Myrtle Gonzales Laura Dowd has a conference conference room in her office dedicated to her, named after her. She was elected auditor 11 times, winning in the primary, each time receiving more votes than any other candidate running for office on the ballot.'",
        "'speaker_8': 'She was in office elected in 1919 and retired in 1951. 32 years of elected service. But for years before that she was the deputy city auditor. During her time in office. Oil was discovered in Signal Hill. Women in the U.S. won the right to vote.'",
        "'speaker_8': 'She was in office when women earned and won the right to vote.'",
        "'speaker_1': 'She lets.'",
        "'speaker_8': 'See. The Great Depression began and ended. World War Two began and ended. The naval base was established here. CSU, ILB and Long Beach City College were established here during her time in office. So as much as I like to think we're pioneers and we're creating, you know, amazing pathways, we are we are in some sense.'",
        "'speaker_8': 'But certainly there were many, many pioneers that came here before us. And so I, I hope to support this endeavor as much as I can in my council district. I started a leadership academy for young girls. And unfortunately, that's a very hard program to sustain without dedicated funding and staff to work on it.'",
        "'speaker_8': 'But we certainly have tried. We have speakers come and we would love to do more programs like that this year so that we can remind them. You know, one of the things my mom, single mom raised me, she always said, don't be afraid to go against the crowd, because at the end of the day, you have to'",
        "'speaker_8': 'do what you think is right. You have to be able to go to sleep at night and not have regrets about your values and going against your values. And that it's not always been uncomfortable, but that has served me well.'",
        "'speaker_8': 'So I think if we can teach our young girls to dream big dreams and to do what they think is right, even when it might be unpopular in that particular setting, that they should continue to do that. And so I'm glad there's two young girls here from Lowell watching this tonight.'",
        "'speaker_8': 'It was the perfect night for you to be here. And I thank our presenters and anything that my office can do. And I'm hopeful, as many important causes as we find, as many programs that we fund in this city, this is one that is very, very important to more than 50% of our population.'",
        "'speaker_8': 'And I hope it's one that we can honor through the dedication of some funds, because it really applies to, you know, all brackets regard regardless of what district you live in, regardless of your socioeconomic status, regardless of your educational status, it's it's about recognition of a big part of our history that's going to serve as a springboard'",
        "'speaker_8': 'for our future. So thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Mongeau.'",
        "'speaker_6': 'I think that almost all that could be said has been said. I really appreciate the email that came to inform us about the information related to this. I thought it was well written and descriptive and I appreciate the amount of research and knowledge that is among your group.'",
        "'speaker_6': 'So thank you for bringing that.'",
        "'speaker_3': 'Up, Councilman Richardson.'",
        "'speaker_7': 'Just wanted to chime in and say that I really enjoyed this this item. Thank you, Councilwoman Pearce. Everyone who signed on. Thank you to, you know, all the women on the council. Councilwoman Price, very eloquent, very thoughtful statement.'",
        "'speaker_7': 'I didn't know very much about that individual. I think I look I'll look that individual up. And, you know, I think there's been a recurrent theme these last few weeks about these unsung heroes. Lobbies posted a really interesting article on some unsung heroes during African-American History Month.'",
        "'speaker_7': 'And we learned today about, you know, the clerk. So really interesting stuff. So I wanted to just chime in and say, I look forward to this. Thank you for stepping forward a year in advance and giving us the opportunity to participate.'",
        "'speaker_7': 'Make sure that there's you know, that there's events across the city. Make sure that other community groups that may want to do something can be factored into that 100 100 event sprint in a city as large as ours.'",
        "'speaker_7': 'I think this is something we certainly can can pull off. So. So thank you I think is a good goal. Count on me in support and I look forward to talking. Thank you.'",
        "'speaker_3': 'Councilmember Ringo.'",
        "'speaker_10': 'Thank you, Mayor. And I want to certainly thank our council women, powerful, strong women who are here with very proud, too, to be in your service as well. I just found out right now that there's a street in West Long Beach named after.'",
        "'speaker_10': 'Surrogate, Francis Willard. It's a Willard Street in the in west Long Beach Outlet right right past Saturday right around right around where real high school is. So I think it's something that we need to celebrate. I mean, I just found out so we can hopefully be included.'",
        "'speaker_10': 'It's okay to recognize that that street as well here in Long Beach. So looking forward to whatever we we end up doing in the very near future. Thank you very much.'",
        "'speaker_3': 'Thank you, Councilmember Councilmember Supernanny.'",
        "'speaker_7': 'Thank you. I better chime in if that last comment. We have Willard Elementary School in the fourth District. So they would kill me if I didn't say that. Also, I'm very impressed that we got the right date on this because it was a very complicated process with lots of states ratifying it.'",
        "'speaker_7': 'Very often the wrong date is quoted, and the reason I've known that date all my life is because my mother was born on August 24th, 1920.'",
        "'speaker_10': 'So all my life I heard that.'",
        "'speaker_7': 'Yeah, once she was born, they knew they better pass that thing. So. Yeah, great. Mom, you're real special. Thank you.'",
        "'speaker_10': 'But she.'",
        "'speaker_7': 'She died one year ago at age 97. It was always fun to take her to the polls because everyone would say, well, she knows she can do absentee ballot. And I'd say, well, you know, she really likes to show up at the polls because she was born before women had the right to vote as great to see'",
        "'speaker_7': 'the young kids in there. They couldn't believe someone was still alive. But it.'",
        "'speaker_10': 'Just points out.'",
        "'speaker_7': 'This is recent history actually hundred years ago is still very recent. So thank you for allowing me to sign onto this. I am very proud to do so and thanks for bringing this forward.'",
        "'speaker_3': 'Thank you, Councilmember. Councilman Austin?'",
        "'speaker_9': 'Yes, I'll be brief. I do appreciate the presentation. I am excited about the the outcomes over the next year. You can count on my support. And yes, my majority team of women will be will be supporting this as well.'",
        "'speaker_9': 'I just take it about the suffrage movement and where we are today. It's just amazing how and what an impact women have had on government throughout from from every level at this point. And I am proud to serve with with the four women but many women throughout city hall who are involved in government here in the city'",
        "'speaker_9': 'of Long Beach. And so I look forward to working with you all over the next year.'",
        "'speaker_3': 'Thank you. And Vice.'",
        "'speaker_0': 'Mayor. Yes, fine. I just want to give you a shout out, because the fact that a father of four girls I know now I have to live watching this. I told them they must stay up and watch this tonight.'",
        "'speaker_0': 'And I know the suffrage women have gone through and they have to listen to Mrs. Price speech. I know they will run for any and everything that they need to. Thank you guys again. And kudos to every one of you.'",
        "'speaker_3': 'Thank you. And obviously, you know, I'm a huge supporter of this effort and I'm just really, obviously always proud. Any time that our Human Relations Commission but particularly, you know, Zoe, I think you are our leading voice on this topic, not just in the city, but certainly one of the leading voices across the country.'",
        "'speaker_3': 'And so thank you for your leadership. And we look forward to participating and supporting in any way that we can as your public comment on this item. Please come forward. Can't have one speaker. This will close the speaker's list after the speaker.'",
        "'speaker_1': 'Hello, everyone. My name is Karen Harper and I live in the third district. And I just wanted to say, this is what a radical feminist looks like. Radical means equality and justice for all. And I just want to mention a few spectacular women that all of you may not know about.'",
        "'speaker_1': 'The Historical Society in Long Beach Unified created these four books on women who made a difference. Every third grader is supposed to be exposed to them. Kimi Sugiyama. Lilian Robles. Mary Dell Butler. Olivia Herrera, who now has a school named after her.'",
        "'speaker_1': 'And I also wanted to mention my Mac, an African American woman who started the USO for African-Americans because of segregation during World War Two and before that because local African-Americans couldn't get loans. She started a credit union. So that's just a little window of all the wonderful people we're going to learn about.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. We're all pretty excited now. It's great history. Thank you so much. Please cast your vote.'"
    ],
    "Recommendation to request City Attorney to prepare an ordinance to designate a new historic district for 19 properties located on the 6000 block of Walnut Avenue, bounded by 61st Street to the north and 60th Street to the south, specifically addressed as 6001, 6002, 6012, 6017, 6018, 6023, 6024, 6029, 6030, 6037, 6038, 6043, 6044, 6049, 6050, 6055, 6056, 6067 and 6068 Walnut Avenue, as a Historical Landmark District.  (District 9)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Next, we'll move to item 31 with the clerk. Please read the item.'",
        "'speaker_2': 'Report from Development Services Recommendation to request City Attorney to prepare an ordinance to designate a new historic district for 19 properties located on the 6000 block of Walnut Avenue as a historical landmark. District. District nine.'",
        "'speaker_0': 'Yes. Is there any public comment in this item?'",
        "'speaker_7': 'Some council comment?'",
        "'speaker_0': 'Yes, Mr. Richardson.'",
        "'speaker_7': 'Thank you. I want to I want to acknowledge this this moment and share some context with the council. So this is you know, it's an important moment. This is an opportunity for us to expand the geographic diversity of our landmark districts around the city.'",
        "'speaker_7': 'It's the first landmark district in North Palm Beach, which makes up about 20% or a fifth of the city. Currently, there are historic districts. There are large historic districts in districts one, two, three and seven. There are some smaller districts in four, six and eight.'",
        "'speaker_7': 'There are no historic districts in districts five and nine. And so this action tonight actually does two things. It's a great step in working to address both postwar post-World War two history in our city and secondly, working class history.'",
        "'speaker_7': 'And and so this neighborhood tonight, within the Grant neighborhood, it's a part of a larger movement, really led by the residents, one here in the audience, Jeff Rowe. And I want to recognize the president of the Grant Neighborhood Association.'",
        "'speaker_7': 'And he's in he lives on Walton on Walnut Avenue. Really, this is a part of an effort for that to preserve the character of their independent, independent block. And I really applaud the work that they've done to really equitably explain and expand the city's historic preservation program, to include a broader range of geography, demographics and cultural history'",
        "'speaker_7': '. So the cohesive collection of properties on this block really represent a certain period, you know, around the 20th, when the automobile allowed us to leave from the city center and really expand to other areas of town. And so the houses have a certain character, their two bedroom, one bath.'",
        "'speaker_7': 'And those things are changing now that the demands of the neighborhood are changing. We still want to preserve some of that unique history of that block. And so that conversation has already begun, and that's the appropriate use for this designation process.'",
        "'speaker_7': 'And then there's a there are benefits that a lot of people don't really recognize with. There are obviously challenges, but there are benefits as well. And so, one, it creates a deeper sense of pride of ownership in communities where properties invest their time and energy into the community as a whole and create a positive ripple effect.'",
        "'speaker_7': 'Secondly, you know, hopefully this this this helps us to acknowledge that an entire area of town, largely districts 95, which all were built around the same time, this is this is the first of a whole effort to begin recognizing those histories, which were largely made up of not not affluent or wealthier neighborhoods, but really working class communities'",
        "'speaker_7': 'and their their history. And then the financial benefit is that being a historic district offers these homeowners the opportunity to apply for the Mills Act and receive a reduction in their property taxes, which they can use. They can use that retained income and invest in necessary improvements to their property that highlight that historic character and contribute to'",
        "'speaker_7': 'neighborhood beautification. So I know that we these things typically come and go on our council agenda, but I wanted to sort of lift this up that this is the beginning of a new wave of a major sector of our of our our city, getting into the process of recognizing historically landmarked districts.'",
        "'speaker_7': 'So so thank you. And I move to support it.'",
        "'speaker_0': 'Yes. Councilwoman Mongo. Okay. Fine. Could you please cast your vote? Yes. Have. I. I call pan coming in when like I speak on this item. Yes. Please come down to.'",
        "'speaker_10': 'Closer next time. Thanks for considering this. We actually started this about three years ago and we thought, well, we got a lot of old homes and Grant, they're all coming up 100 years old. Let's do all of Grant neighborhood.'",
        "'speaker_7': 'I wish Chris was here because.'",
        "'speaker_10': 'In money, many little nuggets of wisdom. He said, no, that's going to be a little bit too big to get your arms around. Why don't you focus on a smaller area? So that's what we did, which turned out to be a pretty wise decision.'",
        "'speaker_7': 'Because our neighbors didn't really know.'",
        "'speaker_10': 'What it meant to have an historic district. One of them, for example, thought, well, if it's historic.'",
        "'speaker_7': 'Does that mean that we have to maintain the interior of the house, sort of a museum quality? We said, no, no, no, you don't have to do that. You can leave all the laundry on the on the couch.'",
        "'speaker_10': 'But anyway, there was a benefit to this that we never saw coming. And that's that shortly after we started this. And in the process of doing it, we all got to know each other pretty well. But we also launched the disaster preparedness effort, and because we knew each other pretty well.'",
        "'speaker_7': 'We were able to get that all done in about four weeks. And I think we became then.'",
        "'speaker_10': 'The second street in Long Beach to finish that disaster preparedness.'",
        "'speaker_7': 'So anyway, thank you again, Rex and Chris isn't here, but thanks to him and to Gina, Casi removed. Thanks again for considering this.'",
        "'speaker_0': 'Thank you. Next week, you.'",
        "'speaker_1': 'Thank you. Thank you and thank you. I'm very supportive. I'm Jacqueline Case. I'm a realtor. I support the historical districts. I'm also a board member of Long Beach Heritage. And I've been working with Christopher Koontz and a lot of other folks from the city to educate my industry about historical districts and how important it is for them'",
        "'speaker_1': 'to have an understanding of why it is important that we know what we can do and not do in these districts to support them. Because you're right, they actually do bring so much more value to our community, and even my industry doesn't really understand that completely.'",
        "'speaker_1': 'So I'm grateful that I happen to be here. And you happened to be talking about this. And I support and I thank you for thinking of and continuing to open your ideas for more historical districts and also landmarks.'"
    ],
    "Recommendation to adopt Specifications No. RFP DV19-007 and award contracts to AECOM Technical Services Inc., of Los Angeles, CA; City Fabrick, of Long Beach, CA; Environmental Science Associates, of Los Angeles, CA; Gruen Associates, of Los Angeles, CA; HDR Engineering, Inc., of Long Beach, CA; Impact Sciences, Inc., of Los Angeles, CA; Kimley-Horn and Associates, Inc., of Orange, CA; Lisa Wise Consulting, Inc., of San Luis Obispo, CA; LSA Associates, Inc., of Irvine, CA; Meridian Consultants, LLC, of Westlake Village, CA; Michael Baker International, Inc., of Santa Ana, CA; PlaceWorks, of Santa Ana, CA; Prevention Institute, of Oakland, CA; Psomas, of Santa Ana, CA; Rincon Consultants, of Ventura, CA; RRM Design Group, of San Luis Obispo, CA; S. Groner Associates, Inc., of Long Beach, CA; Skidmore, Owings & Merrill, LLP, of Los Angeles, CA; Terry A. Hayes Associates, Inc., of Culver City, CA; Veronica Tam and Associates, of Pasadena, CA; and, Willdan Engineering, of Industry, CA, for on-call environmental, planning, affordable housing, and community engagement consultant services, ": [
        "'speaker_0': 'Thank you. Now. Could we please catch the votes?'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Now we move to item 32 with the cloak police without him.'",
        "'speaker_2': 'Report from development services. Recommendation to award 21 contracts for on call environmental planning, affordable housing and community engagement consultant services and an annual aggregate amount not to exceed 4 million for a period of two years citywide.'",
        "'speaker_0': 'Do any public comment on this item? Congressman Austin would like to begin.'",
        "'speaker_9': 'I'd like to get a brief staff report, please.'",
        "'speaker_0': 'We please have a staff report, please.'",
        "'speaker_10': 'Linda Tatum.'",
        "'speaker_8': 'Just in summary, every approximately every five years, the Development Services Department goes out and establishes an on call list for consultants. And the purpose of that is to make the development process more efficient so that we don't have to do individual contracts every time a development project comes through the process.'",
        "'speaker_8': 'And typically, that includes everything from the Historic Resources Survey, like what we just talked about. It also includes the preparation of environmental impact reports, consultants that assist the staff with community outreach. Just the whole range of the development projects that come through our process.'",
        "'speaker_8': 'Having the on call consultants list is very helpful to staff. It saves time and makes our development process a lot more efficient. And just so you're clear on the the costs of those contracts. Typically the vast majority of those contracts are paid for by the developer.'",
        "'speaker_8': 'So the amount that we're setting aside is primarily a pass through amount. So when the development project comes through, the developer pays for that in their application fees. And that's pretty much an overview of the process. We once you approved this tonight.'",
        "'speaker_8': 'These the city will enter into individual contracts with each of these firms and they are on the list. So when they do come to the city, we can get the projects through the process expeditiously.'",
        "'speaker_0': 'Thank you, Michael.'",
        "'speaker_9': 'Thank you. And I do notice that a number of these consulting contracts being proposed are local firms. And so I want to recognize and appreciate that. Thank you. I so move to support.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute any and all documents necessary, including a Standard Offer, Agreement, and Escrow Instructions for Purchase of Real Estate (Agreement) with Paul M. Stone, as Trustee of the Paul M. Stone Living Trust under declaration of Trust dated January 30, 2016 (Seller), for the purchase of certain real property located at 1718-1722 Hayes Avenue, Assessor Parcel Number 7429-028-034 (Subject Property), in an amount not to exceed $1,830,000;   Accept the Categorical Exemption CE 19-041; and  Increase appropriations in the General Fund (GF) in the Economic Development Department (ED) by $1,830,000, offset by the transfer of HEAP grant revenue from the Health Fund (SR 130).  (District 1)": [
        "'speaker_0': 'Thank you. Councilman Pierce. Okay. Fine. Would you please let your vote?'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Yes. Now we move to item 33 with the clock, please. With the audit.'",
        "'speaker_2': 'Report from Economic Development, Health and Human Services recommendation to execute all documents necessary with Paul M Stone for the purchase of certain real property located at 171821722 Hayes Avenue, and an amount not to exceed 1,830,000 District one zoning.'",
        "'speaker_0': 'Gregory said. Thank you for any public comment on this item. Okay. Councilman Gonzalez?'",
        "'speaker_8': 'Yes. I mean, we have a staff report, please. This is a pretty big item. Thank you.'",
        "'speaker_10': 'Sir. We've got a team back here with Kelly Collopy, Mary Torres and Sergio Romero. So I'll turn it over to Kelly to start.'",
        "'speaker_1': 'Good evening, council members. We're going to start the presentation by.'",
        "'speaker_8': 'Discussing.'",
        "'speaker_10': 'The property.'",
        "'speaker_1': 'And my charge will be leading.'",
        "'speaker_10': 'That conversation.'",
        "'speaker_1': 'And then we'll go and we'll go to the next piece.'",
        "'speaker_4': 'Thank you, Kelly. Honorable Mayor and city council. The item before you is for the acquisition of property located at 1718 through 1722 Hayes Avenue. As part of the state so far 19 budget. The city was granted one time funds for the Homeless Emergency.'",
        "'speaker_6': 'Aid Program, enabling local jurisdictions to provide emergency assistance to individuals experiencing homelessness. A portion of the city's.'",
        "'speaker_4': 'Allocation was designated for a location where personal belongings could be stored, while individuals experiencing homelessness could attend, work or.'",
        "'speaker_6': 'Utilize services at the Multi-Service Center. A search was conducted to identify properties located near the Multi-Service Center that could serve this program quickly and with minimal interior improvements. The property. At 1718 through 1722, Hays was identified.'",
        "'speaker_4': 'An offer to purchase a property at the listing price.'",
        "'speaker_6': 'Of 1,755,000 was made to the property owner and subsequently accepted.'",
        "'speaker_4': 'The property measures approximately 6520 square feet and is improved with the 5400 square foot building. An additional amount of $75,000 will be.'",
        "'speaker_6': 'Expended for due diligence and closing costs, and approximately $170,000 is anticipated for tenant improvements. I will turn this over to Kelley Kelley for further discussion of the operations.'",
        "'speaker_10': 'So the site will be utilized as a storage facility for.'",
        "'speaker_1': 'People experiencing.'",
        "'speaker_10': 'Homelessness. We expect that there will.'",
        "'speaker_8': 'Be.'",
        "'speaker_1': '100 storage bins for people and they would.'",
        "'speaker_10': 'Be.'",
        "'speaker_8': 'Utilized primarily by.'",
        "'speaker_1': 'Folks who would be coming in, engaging with the multi-service center or with other providers such as and and engage with the quality of life teams or the heart team. And so.'",
        "'speaker_10': 'As people, a lot of the.'",
        "'speaker_1': 'Times what we hear is that.'",
        "'speaker_10': 'People are.'",
        "'speaker_8': 'Concerned about coming in for services because they have their possessions.'",
        "'speaker_10': 'With them.'",
        "'speaker_1': 'And they don't have another place to store them.'",
        "'speaker_10': 'This allows that to be taken care of so that they can engage in other services. It would be open Monday through.'",
        "'speaker_8': 'Friday from 7 a.m. to 5 p.m., closed.'",
        "'speaker_10': 'Over the lunch.'",
        "'speaker_1': 'Hour and then on Saturday mornings.'",
        "'speaker_10': 'From 7 a.m. until noon. However, if someone is engaged with the quality of life or heart teams, they would have the.'",
        "'speaker_1': 'Opportunity.'",
        "'speaker_10': 'To access the facility at other times. We would have security and lighting and other things to make sure that the community.'",
        "'speaker_1': 'You know, and the businesses around are safe.'",
        "'speaker_10': 'And then if there if somebody leaves their possessions for.'",
        "'speaker_1': 'Longer than 30 days.'",
        "'speaker_10': 'And are not engaged in service, then at that time to terminate that space. And then we would open it open it for another.'",
        "'speaker_6': 'And with that, I.'",
        "'speaker_10': 'I can create my presentation. I'm open for questions.'",
        "'speaker_3': 'Councilman Gonzales. Your question, Sergio.'",
        "'speaker_8': 'I just wanted to say thank you so much for this, because I know that this is a citywide initiative, and I'm glad that we found a space that was amenable to all, but really is creating a really good solution for individuals experiencing homelessness.'",
        "'speaker_8': 'And we know that about takes about 17 or so plus interactions with our city staff in order to get people to the services that they need. And so this is one solution, but I think it's going to prove to be a very successful solution.'",
        "'speaker_8': 'So thanks to our city manager economic development and the health department and I know we have Andy Kerr here, who we really appreciate all of his work as well. And he's been a great voice in this. And I just thank you for being here as well.'",
        "'speaker_8': 'But I'm 100% on board. We've also I just want to say on the record, too, we have notified our West Side industrial groups who seem amenable and we've ensured that, you know, the businesses understand, you know, what is what is coming to the west side.'",
        "'speaker_8': 'So thank you very much for the.'",
        "'speaker_10': 'Work and councilmember. As the city manager, we just want to congratulate you and thank you the entire team. We know that placing these types of locations are difficult and you've just been 100% supportive. And we just can't say enough about your leadership in selecting and highlighting this facility here, which is going to hugely impact homelessness for us'",
        "'speaker_10': '. And it'll be a very good thing. So thank you so much.'",
        "'speaker_3': 'Make it. Councilwoman. Councilman Austin.'",
        "'speaker_9': 'Great job. My support.'",
        "'speaker_3': 'Thank you, Councilman. Councilman Pearce.'",
        "'speaker_1': 'I, too, just want to congratulate my staff and say thank you, Councilmember Gonzales. I know that homelessness is a citywide issue. We struggle with the impact sometimes in our downtown. And I know that you've been an advocate for ensuring that we all kind of share some of that responsibility.'",
        "'speaker_1': 'So thank you for that. And thank you staff for making this happen.'",
        "'speaker_3': 'Thank you. And I want to thank staff for this. This is an important part of our Everyone Home One Beach plan. And again, I'm just very, very proud of the whole city and every member of this body. Everyone's been stepping up and finding locations and solutions to our challenges around homelessness.'",
        "'speaker_3': 'And I just think it's great to see that everyone here is really embracing that. So thank you for that. Any public comment on this item? Please come forward.'",
        "'speaker_5': 'At.'",
        "'speaker_10': 'Good evening, honorable mayor and members of the council. I just wanted to. I'm sorry. Andy Kur, eighth district member of the Measure H Citizen Oversight Board and everyone at home long beach task force. Just wanted to voice my support for this today.'",
        "'speaker_10': 'This is just a really great toolbox, I think, for our city staff. Council woman Gonzalez, he mentioned the number of interactions it takes to have an impact with with someone experiencing chronic homelessness. And I think one of the reasons for that is because the lack of tools and a lack of creativity a lot of times our caseworkers'",
        "'speaker_10': 'have and this is a really big tool in the toolbox. And I just want to commend Kelly Collopy and her staff at Health. I think that this is going to be so much more than just a storage facility.'",
        "'speaker_10': 'It's another opportunity to interact with with people and to provide services that maybe they don't know about. To also engage them on a level that we haven't been able to do in the past. So. And and I just want to thank everyone in the city for continuing to advance the the goals that we set out and everyone'",
        "'speaker_10': 'at home. Long Beach Initiative. I think this is just another example of how we're going to have to keep moving the ball forward. And this is just a great step. Thank you.'",
        "'speaker_3': 'Thank you so much. That concludes for the comment. Members, please go ahead and cast your vote.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute contracts with Lowes Home Center, LLC, of Mooresville, NC, and Grainger W.W., Inc., of Lake Forest, IL, for furnishing and delivering hand tools, automotive tools, specialty tools, hardware, and miscellaneous items, on the same terms and conditions afforded to Region 4 Education Service Center, of Texas, through Omnia Partners, formerly National IPA, in an annual aggregate amount of $800,000, with a 15 percent contingency of $120,000, for total annual aggregate amount not to exceed $920,000, for a period of two years, with the option to renew for three additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_10': '23 going forward. Four.'",
        "'speaker_0': 'Now we move to item 34.'",
        "'speaker_2': 'Please report from Financial Management Recommendation to adopt resolution authorizing city manager to execute contracts for furnishings and delivering hand tools, automotive tools, specialty tools, hardware and miscellaneous items for total annual aggregate amount not to exceed 920,000 citywide.'",
        "'speaker_0': 'So any public comment on this item? I must especially like to speak on this. When I was Stephanie Moore.'",
        "'speaker_10': 'Essentially this is a great way to be able to buy tools and have the tools in the hands of the people that need them and will be able to buy them from Lowe's and from Granger as well. So we're very supportive of this.'",
        "'speaker_0': 'You okay? Fine. I'm doing fine. Would you please cast your vote?'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract with Haaker Equipment Company, of La Verne, CA, for the purchase of 11 CNG-powered street sweepers, with related equipment and accessories, on the same terms and conditions afforded to Sourcewell (formerly the National Joint Powers Alliance), of Staples, MN, in an amount not to exceed $4,377,361, inclusive of taxes and fees; and  Authorize City Manager, or designee, to execute a five-year lease-purchase agreement and related financing documents with Banc of America Public Capital Corp., of San Francisco, CA, for the financing of street sweepers, in an amount not to exceed $4,770,000, inclusive of capital purchase, interest, and fees.  (Citywide)": [
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_2': 'Councilmember Sabrina motion carries.'",
        "'speaker_0': 'An actual mold item 35 with the clerk please reliably.'",
        "'speaker_2': 'Report from Financial Management Recommendation to adopt resolution authorizing city manager to execute a contract with Hacker Equipment Company for the purchase of 11 CNG powered street sweepers in an amount not to exceed 4,377,361 and execute a five year lease purchase agreement with Bank of America Public Capital Corp. for the financing of street sweepers in an amount not'",
        "'speaker_2': 'to exceed 4,770,000 citywide.'",
        "'speaker_0': 'Thank you. Wrote a public comment on this item. Restrictions like speaking to customers.'",
        "'speaker_9': 'Please. I'd like to get back.'",
        "'speaker_0': 'To have a go ahead. Would you, please?'",
        "'speaker_10': 'Sure. Dan Burton Barker, fleet manager.'",
        "'speaker_0': 'Thanks for watching.'",
        "'speaker_10': 'Good evening. Members of Council Vice Mayor. Street sweepers are used throughout Long Beach to maintain city streets. Fleet Services is recommending 11 of those sweepers for replacement as they age, considerably causing a rise in maintenance and operational costs as well as increased downtime that affects sweeping operations.'",
        "'speaker_10': 'The Environmental Services Bureau has performed extensive testing to verify the best sweepers for use in the city and has placed several air sweepers into service for use in a city where they're most effective. The Bureau has determined that the remainder of the sweeper fleet should be a mechanical broom sweeper for best maneuverability and sweeping quality.'",
        "'speaker_10': 'These 11 sweepers are updated versions of those used by the city since 2003 and are proven to provide the best service on the harder to sweep roads within Long Beach. The sweepers are equipped with compressed natural gas. Engines are part of the FAA 16 to 18 vehicle replacement plans and as mentioned, will be financed through the city's'",
        "'speaker_10': 'master lease agreement with Bank of America. This purchase was researched extensively, both to ensure specifications, meet the needs of the department and also to ensure the city is getting a competitive price. Given the urgency of replacing these sweepers, the alternative procurement use of the National Joint Powers Alliance, a recognized government cooperative purchasing agreement, will greatly help to'",
        "'speaker_10': 'reduce procurement time. That concludes my presentation. I'm available to answer your questions.'",
        "'speaker_0': 'Perhaps we lost it.'",
        "'speaker_9': 'Just quick question. How are the existing fleet powered type of fuel? I see that there's this is CNG.'",
        "'speaker_10': 'LNG, actually.'",
        "'speaker_9': 'Okay. So this is a cleaner.'",
        "'speaker_10': 'This is cleaner and less expensive.'",
        "'speaker_9': 'Perfect. Thank you so much.'",
        "'speaker_0': 'Councilman Ewing.'",
        "'speaker_10': 'For this report. Glad to see that we continue our award winning efforts to maintain a clean fleet using alternative fuels. Thank you.'",
        "'speaker_0': 'Congresswoman Pryce.'",
        "'speaker_8': 'I am excited about this opportunity. I do have a question. Do you know if these vehicles have GPS capability?'",
        "'speaker_10': 'They will be equipped with a GPS capability. Yes.'",
        "'speaker_8': 'OC more to come later. But we have an agenda item that might involve.'",
        "'speaker_1': 'Street sweepers with.'",
        "'speaker_8': 'GPS signals, which is a good thing. But we can discuss that another day at least. I know we have the technological capability.'",
        "'speaker_10': 'We look forward to it. We embrace technology and fleet. So I would add.'",
        "'speaker_8': 'Awesome answer.'",
        "'speaker_10': 'Thank you. I would add, Councilmember, that all of our street sweepers have what we call a zone R, so we're able to see where they are and where they've been and how they've done those things. We had that on a number of our city fleet.'",
        "'speaker_8': 'That's great. Thank you. I really appreciate that.'",
        "'speaker_3': 'Thank you so much, Councilwoman Councilor Richardson.'",
        "'speaker_7': 'Thank you. I support this. I think it's time that we get a newer fleet on the edge of our city up in the Hamilton neighborhood. If the street sweeper breaks down, it never makes it to that side of the the neighborhood.'",
        "'speaker_7': 'So there's plenty of times people say they didn't show up well because, you know, a lot of times they broke down. So hopefully this makes our system a lot more consistent and reliable. So I'm glad and happy to support this.'",
        "'speaker_3': 'Thank you, Councilmember Councilwoman.'",
        "'speaker_6': 'I have the same issue as Councilmember Richardson, except for my issue is a thursday-friday break down issue. I think that also the number of times we've had the challenges, because they get full and different things and then have to go back more often than they usually do.'",
        "'speaker_6': 'I really appreciate the research that went into this and I really appreciate the staff report and discussion about these a few months ago as they were coming down the pipe, because I think it was very helpful to the residents who have in the past put their greens in the gutter and now know that the street sweepers can'",
        "'speaker_6': 'handle that. And that's not what they're intended for. So thank you very much. And if you haven't or don't know a lot about our street sweepers, please go on YouTube. And there's a video about what we've learned about our street sweepers.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7106 and award a contract to Klassic Engineering and Construction, Inc., of Orange, CA, for the Alamitos Beach Concession Building Project, in the amount of $5,681,000, with a 15 percent contingency in the amount of $852,150, for a total contract amount not to exceed $6,533,150; authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments; and  Accept Mitigated Negative Declaration ND-07-17.  (District 2)": [
        "'speaker_3': 'Thank you very much. Next. Actually, any public comment on this saying that please cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': '36.'",
        "'speaker_2': 'Please report from Public Works, Parks, Recreation and Marine.'",
        "'speaker_3': 'A very exciting item 36.'",
        "'speaker_2': 'Recommendation door to contract to classic engineering and construction for the Alamitos Beach Concession Building Project for a total contract amount not to exceed 6,533,150 District two.'",
        "'speaker_3': 'Okay. Councilmember Pearce. Did you want to do the staff report first? Yes, please. Okay, let's get the staff report.'",
        "'speaker_10': 'This is a very exciting project. And we're going to have a very exciting presentation from Craig back. Mm hmm. Thank you, Mayor. Members of the council, we are happy to be for you this evening to talk about.'",
        "'speaker_3': 'The continued renaissance of our beach front. This is.'",
        "'speaker_10': 'A new project.'",
        "'speaker_3': 'That we want to go.'",
        "'speaker_10': 'Through and provide a brief PowerPoint presentation and share some new images of the concession stand. Erik Lopez has been leading this effort for public works, so I'm going to ask him to make the presentation this evening. Thank you.'",
        "'speaker_10': 'After a comprehensive public outreach process, we are ready to proceed with construction of our new two storey 4240 square foot concession stand. That would include the following amenities a new playground, equipment, rental space, outdoor dining areas, a new pedestrian promenade and rebuild beach public restrooms.'",
        "'speaker_10': 'The total project cost is estimated at $9 million and it is entirely funded by Tidelands funds. We anticipate beginning construction in April 2019, just a couple of months away and completing prior to summer of 2020. This project continues our efforts to revitalize our waterfront and aid and increase the youth and popularity for locals and visitors alike.'",
        "'speaker_10': 'The project will also help improve the safety of the immediate area and increase the recreational opportunities available. We are partnering with the Department of Economic Development to help us with the outreach and and bringing on board of new vendors.'",
        "'speaker_10': 'There is currently a request for proposals out in the streets. Those proposals to operate not just the Alameda locations, but some of our other beach concessions that are due in May. We we anticipate returning to the council in summer to award one or more contracts.'",
        "'speaker_10': 'So this is really a two step process. Tonight, before you were asking approval to move forward with a construction contract so we can start physically building out the the structure itself and we'll be returning to council for a vendor contract, as Eric mentioned, to have a concession operator at this location and the other beach concessions as well'",
        "'speaker_10': '. That concludes our staff report and are available for questions.'",
        "'speaker_3': 'Thank you. Thank you. Just for clarification, I just would I'm clear the approval of construction is just for the element of beach project. Correct. Okay. Thank you, Councilor Pearce.'",
        "'speaker_1': 'Well, thank you, Staff. Thank you. Thank you. Thank you. I am so excited about this project. Before I was in office, we talked a lot about how do we get more people down on our beaches and how do we really activate it?'",
        "'speaker_1': 'And we had a lot of ideas around concession stands, and I did not at that time believe that we would get to a place with something that's spectacular. And so I'm really thankful for all of your guys hard work, the visioning that was done with community members, with the team that worked on designing this.'",
        "'speaker_1': 'You know, I know we said we liked what we had in Santa monica and kind of that same model of of being able to have food outside, inside and having the amenities to check out, you know, whether it's what sorts of can we roll the ball, you know, activities, bocce ball, you know, and lots of fun activities'",
        "'speaker_1': 'there. So I want to commend you on that. I also really want to say, you know, the Tidelands Fund is also often a conversation at the budget time. And I want to thank Councilmember Price. About a year ago, we started working together on our Tidelands funds instead of having separate meetings, and we agreed to prioritize not only'",
        "'speaker_1': 'this concession stand, but the other ones. And so I really want to thank her for her partnership, and thanks for getting us to a place where we could do that and get to here. And for those that might be listening or might be excited, the other part of this project, phase two with the RFP for operating, you'",
        "'speaker_1': 'know, currently we've had Alfredo's operate all of the concession stands and really we're a city that's diverse, that has many great restaurants here and many great ideas. And so I really pressed on staff and I want to thank them for separating out the RFP that I understand it might be one operator that operates more than one, but'",
        "'speaker_1': 'really, if we could have oysters at one, burgers out another, tacos out another, that way you've got a different reason to kind of hop along our different beaches. But it's a good day. I'm very excited. Thank you very much.'",
        "'speaker_3': 'Thank you. Councilmember Councilwoman Price.'",
        "'speaker_8': 'Thank you very much. And I echo every single comment that Council Councilmember Pierce just said. I mean, this is a really exciting project. It's going to activate the beach even more than it's currently activated. And in a way that's going to be really meaningful for people that want to spend a chunk of time on the beach because'",
        "'speaker_8': 'they'll have options and they won't have to leave the beach to go and get lunch or dinner. I agree with Councilmember Pearce. I think it would be really good for us to have different concessionaires or at least a concessionaire that's dedicated to having different feel or different vibe at each of the different concession stands just to have'",
        "'speaker_8': 'some variety. I would hate for us to have just kind of this cookie cutter thing at every single one you go to, you get your burger, you get your hotdogs, and that's it. It would be cool if they each had a theme or a vibe or that was different and unique because they're all going to look different'",
        "'speaker_8': '. Each one of these is going to look different, which is another thing I love about this project that's not going to be this cookie cutter look that we see in some other cities along the coast. Every every single one is going to have its own feel.'",
        "'speaker_8': 'So I agree. We've worked together on this and I'm so excited for Council District two and their residents for getting this project. But I'm really excited for all the people that are visiting the city. They're going to have this as a city asset to enjoy.'",
        "'speaker_8': 'I want to thank staff. You guys have been working on this for a long time and I know sometimes it's challenging because you have limited resources and a lot of project needs and desires and wishes by the council members.'",
        "'speaker_8': 'And I want you to know that we're working hard to realize that reality for you and trying to be mindful of the priorities that we have and the commitments that we've made, too. And this one is a clear example of, you know, a district asset that the entire city is going to benefit from.'",
        "'speaker_8': 'So thank you for the great work that you've done.'",
        "'speaker_3': 'Thank you, Councilwoman Councilmember Richardson.'",
        "'speaker_7': 'Thank you, Mayor. I got to say, this is this is pretty awesome. Now, my my you know, I have kids, four year old, two year old. We go to the playground. We go to the beach. This puts the playground on the beach.'",
        "'speaker_7': 'I mean, that's huge. I got things to talk about now. You know, in addition to that, when we go to the beach, it's a lot of logistics. You got to bring the snacks. You got to bring this, bring that.'",
        "'speaker_7': 'Now, I don't have to bring those things. So how long did this business get open?'",
        "'speaker_1': 'Summer We'll have a beach party.'",
        "'speaker_7': 'Summer next.'",
        "'speaker_10': 'Year. So this will break ground right after the Grand Prix. This will be open in summer 2020. But this is actually the smaller of the playgrounds that are being planned. And there's two other playgrounds that are larger. Two other areas along the beach.'",
        "'speaker_10': 'And those we are planning to be have open by this summer.'",
        "'speaker_7': 'That's awesome. I think we're just going to hold off on birthdays until summer 2020. Thanks a.'",
        "'speaker_8': 'Lot.'",
        "'speaker_5': 'It's more of a gathering.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_9': 'Yes. I would just like to congratulate Councilmember Pierson, Pryce and the entire city. This is an upgrade to our beach. I spend a lot of time down at the water and and I look forward to enjoying this. And so it has my full support.'",
        "'speaker_3': 'And I just want to add, I've been a huge supporter of this project ever since I first kind of heard where you guys are going with this staff. And so I just want to thank you guys. I totally agree with both council members, Pearce and Price.'",
        "'speaker_3': 'I know I had mentioned this a while back as well, but I think it's very important that each concession have its own experience and that sometimes is hard to do with with one concessionaire. And now, you know, look, of course, you have you have models like the airport, for example, where you have one master operator.'",
        "'speaker_3': 'But they they actually have different restaurants or different experiences within the airport, within that airport. And I would hope that if we're going to go with one major operator, that we look to the type of project that we have at the airport where these there still are different branded experiences.'",
        "'speaker_3': 'And if not, I also completely support that, just different operators having different experiences at these at these concessions. Let me just also say that this is one of the projects that is identified in our Olympic projects plan. So all three of the concession stands are and if you think about the visitors that come for the Olympics, they'",
        "'speaker_3': 'will be able to connect from one end of the beach over at the pier all the way over to downtown. And this is a great way to to stop and get, you know, get some oysters, get a beer, ride your bike and enjoy yourself.'",
        "'speaker_3': 'And so for fun, for the whole family. And so thank you for your hard work. This is really exciting project. One of the projects I'm probably most excited about, so I'm looking great.'",
        "'speaker_10': 'So Mayor, if I can comment on the concession stand, so and and absolutely we echo the comments and thank you for, for all the excitement and and you and the and the two council members that do Tidelands really have made this a priority.'",
        "'speaker_10': 'So this was not a priority before with kind of an idea that was happening. And when we did the reprioritization, this clearly rose to the top. And, and there's been a lot of commitment to get us to the point where we are.'",
        "'speaker_10': 'So I do want to say that this is the big project that is kind of the mothership of the concession stand, but there are those other concession stands down the road. So you heard Eric talk about them. They're all going to be designed.'",
        "'speaker_10': 'We do have designs where they look different. They're similar. So you know that they're all concession stands, but they have different feels. The idea behind the actual operators will be that we ask, we're asking for individuals, but we're also allowing one company to do them all.'",
        "'speaker_10': 'But as long as they're different, so we will not be accepting ones that all look exactly the same and have the same offering. So that is clearly not the plan. We're also looking and supporting Long Beach businesses. If there are Long Beach businesses that would like to come down similar to the airport and have that kind of'",
        "'speaker_10': 'model. And from the airport, we're adopting the the street pricing model so that you don't pay, you know, $15 for a hamburger that's really, you know, $8 value. So people feel very good. Just in the last second, I'd like to to talk about what's happening.'",
        "'speaker_10': 'You'll have this will be the big concession stand at Granada. You have a concession stand along with basketball courts and and a big play structure, a net play structure. And then as you go further down by Granada, you'll have a water play theme for for younger kids where they can play with water in the sand and have'",
        "'speaker_10': 'another concession stand there. And then there's Bayshore. So we'll really have some of the best concessions on on the beach in our mind, way better than Santa monica.'",
        "'speaker_5': 'And.'",
        "'speaker_3': 'Not even close to Santa monica. Santa Water Councilwoman Price.'",
        "'speaker_8': 'I just had one other suggestion and I know we. Want them all to be different and don't want him to look alike. But it would be nice if they had a similar colored color palette family so that it doesn't look like we're just, you know, dumping something there that's not connected or maybe same materials, but different colors'",
        "'speaker_8': ', something so that it looks connected. Because one of the things I've found and we're doing a better job of it, but even with our bathrooms and our parks and our fire, I know the fire stations have a color.'",
        "'speaker_8': 'And then we had our parks, rec and marine facilities had a color. The two colors did not go together at all. I mean, just in recent years, we've changed that. But we should try to coordinate a little bit so that at least the color palettes match.'",
        "'speaker_10': 'So we have thought of that, about that. We agree completely that you should know that that's a major Long Beach structure and that they're related, but they also should look a little different. So each one will have similar colors, there will be accents so that each one has like different art on the walls.'",
        "'speaker_10': 'As you get to the concession, they all have a lettering. You know, the one at at Bayshore will have a big be the one at Granato have a big G, so you'll be able to see a little difference.'",
        "'speaker_10': 'But there the eye will know that those are all belong together. So yes, we putting a lot of thought into that. And I would just.'",
        "'speaker_3': 'Add to Tom's response that we're using the same architectural firm.'",
        "'speaker_10': 'For.'",
        "'speaker_3': 'For the design work. So you're going to see some consistency through that effort. Thank you so much, Councilman Austin.'",
        "'speaker_9': 'And I didn't want to have the last word, but on that note of coordinating, I was thinking, since we don't have Tidelands funds up in Uptown, right, we could have like a map at every one of the concessions on how to get to Bixby Knolls or, you know, I mean, because we're gonna have a lot of tourists'",
        "'speaker_9': 'coming through, through to, to our beaches. I think we need to educate everybody about the rest of the city. Just something to think about.'",
        "'speaker_3': 'The next the next item is we're putting one of these in Highland Park. Actually.'",
        "'speaker_5': 'This could have a lot of circling back to Gonzales.'",
        "'speaker_1': 'Pierce, real quick, a phase two of this that we've talked a lot about to address, that is is really the history of Long Beach and making sure that these stands have a full tie in for the full city of Long Beach.'",
        "'speaker_1': 'And so that goes to your point. Councilmember Austin's that we will be talking about the entire city when you come down to our beaches beaches.'",
        "'speaker_8': 'But don't scoot down there because there's no scooters on that beach path.'",
        "'speaker_3': 'The beaches are everyone's everyone's. Yes. Okay. Any public comment on this? Please come forward.'",
        "'speaker_1': 'Hello, friends. My name's Ashley Summers. I live in District two. First of all, I just want to say I think it's awesome that this is happening for our beaches. I grew up along the coast, not the East Coast, the East Coast and a small beach town, very much like this one.'",
        "'speaker_1': 'So I have a lot of fond memories along the ocean, just, you know, with my friends and my family. And we didn't.'",
        "'speaker_4': 'Actually have.'",
        "'speaker_1': 'Anything like that in Florida. Of course, Florida doesn't have a lot of things that California has. So. But anyway, I do I just want to bring up two suggestions. I've done beach cleanups with the Long Beach Environmental Alliance, and it is.'",
        "'speaker_4': 'Ridiculous.'",
        "'speaker_1': 'How much trash gets on these beaches. And this project sounds awesome. And I don't I know I'm going to be a bit of a buzzkill, but I'm just a little concerned that if buying stuff is more convenient, then so is throwing trash on the ground.'",
        "'speaker_1': 'So I would absolutely urge if you guys have like any sort of, you know, control over this to see if we can get some zero waste like, you know, encouragement at these concession stands. Reusable cups encourage people to bring their own straws, have biodegradable products, make it so that people don't feel awkward bringing their own things, you'",
        "'speaker_1': 'know, like encourage it. And another thing I really need to stress as well is, you know, while a lot of these eateries are really fun and awesome for for us, you know, when we come and visit them, unfortunately they're not so awesome for the animals whose bodies are sold there.'",
        "'speaker_1': '56 billion animals, land animals die for food in the United States every year, and that number ratchets up to 3 billion a day when you include fish. So I think in a city as modern and progressive as this one, it would be quite amiss to not have plant based options at these these eateries, because, you know, many'",
        "'speaker_1': 'of us are making the compassionate choice not to eat animals. So I think making sure that that is also compassion is also convenient on the beach is also, you know, a really great way to show tourists what Long Beach is all about.'",
        "'speaker_1': 'So, yeah, if if you guys could help out with that, I'd really appreciate it. Thank you.'",
        "'speaker_3': 'Thank you. Our counts are actually we have one more public comment. Please come forward and then we're going to answer a pierce and then we'll go to a vote.'",
        "'speaker_10': 'My name is and I can say I'm in full support of the Alamitos Beach Concession Building Project. My comment is in relation to the the Contractor six Engineering and Construction Inc of Orange, California. Michael, my column is more an issue of, you know, a local hire.'",
        "'speaker_10': 'Just researching over the last couple of days that this company in particular, they have been sued multiple times for labor violations. Most recently, about three years ago, they were sued by the construction, construction Cement Mason Construction Labor Fund because they weren't paying their state.'",
        "'speaker_10': 'They weren't paying their state dues into the retirement board for the workers that they used. So $5 million seems like a lot of money to be spending to work with people who have unsavory business dealings, especially in relation to, you know, a city that has a very viable relation with unions.'",
        "'speaker_10': 'So just I would just be curious if staff was aware of the even though they have an ongoing lawsuit right now with the Credit Adjustment Bureau. So I just I just think this is an inappropriate company for us to be working with.'",
        "'speaker_10': 'And maybe we could find a a local one that doesn't have this kind of record and, you know, funneling some city funds into companies that are local and not based in trust. And this is all public record that I found this information for.'",
        "'speaker_10': 'So just curious. Thank you.'",
        "'speaker_3': 'Thank you very much. Next up is Councilmember Pearce.'",
        "'speaker_1': 'I wanted to ask about the waste products that was brought up and just wondering if there's any special language that you guys can. We don't need to hash it out right now, but as close to zero waste and environmental friendly practices as possible.'",
        "'speaker_1': 'I know the RFP is already out, but if we could take that into consideration.'",
        "'speaker_10': 'So we'll look at that through the evaluation process and we'll make sure that they're not allowed to use any Styrofoam products so that they'll be covered in the ban that's already in effect. So that'll be the number one.'",
        "'speaker_10': 'And then we'll look at some of the other like ways to reduce trash.'",
        "'speaker_1': 'So can I just say let's ban straws on the beach. So it's not the right time. We'll work on it. I understand. Thank you.'"
    ],
    "Recommendation to receive and file an update from the City Manager on the status of the restoration of Fire Engine 17 including funding, staffing, and equipment.": [
        "'speaker_3': 'Thank you very much. Price my readers and any public comment on this? Seeing none, please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you. Item 39.'",
        "'speaker_2': 'Communication from Councilwoman Price. Chair Public Safety Committee Recommendation Receive and file an update from the City Manager on the status of the restoration of Fire Engine 17.'",
        "'speaker_3': 'Thank you. Did you want me to go to the staff report first? Councilman. Okay, let's go and get the staff report. Mr. West.'",
        "'speaker_10': 'Mayor. Councilmembers. We were asked in this year's budget to try to find funding for fire station 17 and also six police officer positions. We promised that we come back this fiscal year with during the fiscal year and identify the structural funds necessary to bring those restorations into impact.'",
        "'speaker_10': 'We're very positive right now that we're what we're going to be bringing something shortly to the city council for some type of structural funding. We haven't identified it yet, but one of the most promising things that we're looking at right now is a safer grant.'",
        "'speaker_10': 'These are grants provided by the federal government. We'll be applying shortly in the next several weeks for a federal safer grant that, if successful, will provide structural dollars for the equipment and also a certain amount of the employees.'",
        "'speaker_10': 'And as we go forward with that, it'll last. It's not structural in the sense that it'll it'll last forever, but it'll certain carries forward for a year or two until we can help find other structural dollars for it.'",
        "'speaker_10': 'So that's what we're looking at. And in addition to that, we're looking at other avenues in the budget and where things are dealing with sales tax, property tax, other things where we could come to you with a structural plan to add this.'",
        "'speaker_3': 'Thank you. Next up is a customer supernova that the entire report was. Okay. Let me go to first concert supernova.'",
        "'speaker_7': 'Thank you. I'd just like to ask the city manager if if we have any dates in mind or anything you can share with us in terms of restoration dates.'",
        "'speaker_10': 'No, I don't. If we're lucky enough to get something from the safer ground. Like I said, we're applying this month. The deadline is this month. We should know. I would hope within a month or two, maybe 60 days, whether or not we've been successful in the ground.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_8': 'And I just wanted to give a little bit of background on this item. This came from the Public Safety Committee. Hopefully all of you received the summary of our Public Safety Committee meeting that we had. We're trying to, while we always give you guys the summary report afterwards so that you know what's going on at public safety'",
        "'speaker_8': '. But we are also recommending that certain actions, issues that we take up at public safety then be referred to the city council because we think they're of such import that they are relevant to the entire council. And this was one of them.'",
        "'speaker_8': 'Another item that you'll be seeing come back soon to the full council at the recommendation of the Public Safety Committee is the report on Tiger Connect and what the findings were and what some of the recommendations are moving forward.'",
        "'speaker_8': 'And so we will make recommendations out of Public Safety Committee and ask that you consider supporting our recommendations as further direction to staff. So this is one of those items. It's obviously very, very important to councilman super or not, and he's been consistent advocate for this restoration.'",
        "'speaker_8': 'And I think we could not support him more if we tried. So I'm glad that it's here and I look forward to seeing the staff's recommendation of how we can make this restoration a reality in the very near future.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you. Any public comment on this item? Seeing no public comment. Members, please cast your vote.'"
    ]
}