{
    "Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $1,000, offset by $500 from the Third Council District One-time District Priority Funds and $500 from the Fourth District One-time District Priority Fund transferred from the Citywide Activities Department to provide donations to Wilson High School Parent, Teacher, Student Association (PSTA) for the Sweatshirt Fund; and  Decrease appropriations in the General Fund Group in the Citywide Activities Department by $1,000 to offset a transfer to the City Manager Department.": [
        "'speaker_4': 'Thank you. We'll go on to do item nine.'",
        "'speaker_0': 'Communication from Councilman Price, Councilman super non recommendation to increase appropriations in the General Fund Group and the City Manager Department by 1000 to provide donations to Wilson High School Parent Teacher Student Association for the Sweatshirt Fund.'",
        "'speaker_4': 'Councilman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I'm going to make the motion on that.'",
        "'speaker_4': 'Okay. And I have a second by Councilmember Superman.'",
        "'speaker_1': 'Thank you. And I just want to thank Councilman Supernova for partnering with me on this. This is something we've been doing for several years now. And it's a program where we help Wilson students be able to purchase sweatshirts and bare gear that they might not otherwise be able to purchase, since they are pretty pricey.'",
        "'speaker_1': 'And we try to do our best to make sure that every student in the school has the bare wear and feels like they have a belonging and can have their their needs met through the support of their council members in the district, in the bordering district.'",
        "'speaker_1': 'So I thank my council colleagues for supporting us on this. And again, I think Councilman Suber, not for being my partner on this for a number of years.'",
        "'speaker_4': 'Thank you, counsel. Councilwoman. Councilman Supernatural. Any comments? I just like to add. Yeah, thanks to.'",
        "'speaker_3': 'Councilman Price on this and anyone within the sound of my voice, if you'd like to contribute to this very worthy cause, you can do so by contacting the Wilson PTA or the District three office or District four office.'",
        "'speaker_3': 'And just. You'd like to donate to the Sweatshirt Fund? Thank you.'",
        "'speaker_4': 'Excellent. Thank you very much, Councilmember. I don't see public comment on this, so why don't we go out and do our work out?'",
        "'speaker_0': 'District one. I'm district two.'",
        "'speaker_1': 'By.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_4': 'By.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'District six. I District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District nine. Our motion carries.'",
        "'speaker_4': 'Great. Thank you. And we are going to go ahead and now move on to our public comment. Before we go on to public comment. I want to just hopefully, folks note that our our behind everyone. Each councilmember there is a a nice image of of somewhere in their district representing their own their district.'",
        "'speaker_4': 'And so I want to make sure that we highlight that. And if the councilmembers at some point in the meeting want to share and they speak, I will kind of work out what's behind them. That would be great also for everyone to know.'",
        "'speaker_4': 'These are going to be our images that we have for the council meetings. And with that and I will start with with mine, which is I want each so in Councilman Price. So you get you get two images.'",
        "'speaker_4': 'I think.'",
        "'speaker_1': 'That's right. I was a little jealous of yours, but I love it. And mine is the Naples fountain.'",
        "'speaker_4': 'Absolutely. Absolutely. Beautiful. Beautiful. Why don't we have everyone go at. Sure. Sure. That's an announcement really quick. Everyone shared with us where they're at. We'll start with Councilwoman Van de House.'",
        "'speaker_1': 'Thank you. And my image is from our iconic Cesar Chavez Park in the first district.'",
        "'speaker_4': 'Love it. Councilman Allen?'",
        "'speaker_1': 'Yes. And my image is from the casino at Rose Park.'",
        "'speaker_4': 'Beautiful. Very nice. Let's go to counseling or supernova.'",
        "'speaker_3': 'Thank you. My image.'",
        "'speaker_4': 'Is or is of a park.'",
        "'speaker_3': 'At 14th and or Isabella, specifically the basketball court, which is right next to the skate park.'",
        "'speaker_4': 'Beautiful. Councilman manga.'",
        "'speaker_1': 'Good evening. My image is from Douglas Park. The home of thousands of high paying jobs.'",
        "'speaker_4': 'Okay. Here we can see. Can we see that? We will come back to that.'",
        "'speaker_1': 'Technical difficulty as it was working during closed session. But it's not working now. But I will get it working.'",
        "'speaker_4': 'No problem, Councilwoman Sorrell.'",
        "'speaker_1': 'Yeah. It's in my image as the historic Martin.'",
        "'speaker_6': 'Luther King.'",
        "'speaker_1': 'Jr. Monument at MLK Park.'",
        "'speaker_4': 'Beautiful and customary Ranga.'",
        "'speaker_2': 'This is a picture of a historic home in the California Heights. Historic district in my district.'",
        "'speaker_4': 'Beautiful. And Councilmember Austin.'",
        "'speaker_2': 'I am coming to you live from Rancho most cerritos where Long Beach are. We get an.'",
        "'speaker_4': 'Amazing amazing spot and council and Vice Mayor Richardson.'",
        "'speaker_3': 'Well, we are reporting in from the Huey Vietnam Veterans Memorial in our Veterans Plaza at Highland Park in the heart of the ninth District.'",
        "'speaker_4': 'Love it. Beautiful. Well, thank you all for sharing your spots. And with that, we'll go to Comic-Con.'"
    ],
    "Recommendation to receive and file a presentation in recognition of Persian New Year - Nowruz.": [
        "'speaker_4': 'Thank you very much. Now we're moving on to item number ten.'",
        "'speaker_0': 'More communication from Councilman Price recommendation to receive and file a presentation in recognition of the Persian New Year Nowruz.'",
        "'speaker_1': 'Mr. Mayor. With your permission.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Thank you. Well, I was trying to get myself in a position where I can show you guys. The Persian New Year have seen that I have that my mom helped cut for me, but it's very difficult for it to come through with the background.'",
        "'speaker_1': 'But I was hoping to share our family have seen with all of you tonight as we celebrate for the seventh year in a row Persian New Year. I know that we have a video tonight on Persian New Year.'",
        "'speaker_1': 'So I was hoping that we could start with that. And then I'd like to make a few comments.'",
        "'speaker_6': 'Nowruz is the celebration of the New Year. Celebrated by over 300 million people around the world on the day of the astronomical vernal equinox. It marks the beginning of spring and is a time of renewal, beauty and fertility in nature.'",
        "'speaker_6': 'Although the spelling and pronunciation of the word Nowruz varies from country to country and region to region, the word carries the same meaning. New Day. Who wins is an ancestral celebration dating back more than 3000 years. It is a reminder of the natural cycles of life and nature and promotes peace and reconciliation, fostering good neighborliness and strengthening'",
        "'speaker_6': 'family ties.'",
        "'speaker_1': 'They don't just show.'",
        "'speaker_7': 'No camel? No. No.'",
        "'speaker_6': 'Over the past several years, the Iranian-American community in Long Beach has brought the celebration of Nowruz into Long Beach City home. We have shared traditional sweet treats, tea and other cultural aspects of the Nowruz celebration, including the displays of the half sea, a symbolic table setting which includes a number of different items, each with their own meaning'",
        "'speaker_6': '. Some of these items include garlic symbolizing medicine. Apple's. Symbolizing health. Lotus tree fruit symbolizing love and affection. Vinegar representing patients. A sweet wheat pudding called salmon, representing the sweetness of life. And strength. Sprouts, usually wheat or lentil representing rebirth and growth.'",
        "'speaker_6': 'Hyacinth flowers symbolizing the beginning of spring. For those who celebrate Nowruz, the beginning of spring also symbolically marks the end of a harsh and hard winter. We hope this spring marks the beginning of the end of the difficulties and tragedies of the past year.'",
        "'speaker_6': 'May Nowruz bring peace, prosperity and health to all.'",
        "'speaker_1': 'Thank you very much for sharing that video to our tech team. I want to thank you both for putting that video together and helping us have that presentation tonight. And I'm just so honored that we are a city that embraces the diversity of our community.'",
        "'speaker_1': 'And I get very happy every year to get to talk about Nowruz. So to all of the Persian community who are tuning in tonight to watch this, and I know from our Iranian-American Persian Association in Long Beach, I want to thank them for participating.'",
        "'speaker_1': 'We started that organization approximately seven years ago when I took office, and it's led by Mori Mustapha, who is our president. And I want to thank them for their participation and putting tonight's event together. I think it's it's a beautiful thing for us to celebrate Nowruz every year because it's such a positive part of the year for'",
        "'speaker_1': 'Iranian families. But it's also a very positive time of year for everyone because it's the arrival of spring. This particular year has been very special for me and the Persian community because we were not able to hold any Nowruz celebration last year and this year we weren't able to hold many of our celebrations, but we were able'",
        "'speaker_1': 'to to bring this event to all of you tonight. This is a year that we all look forward to in terms of optimism for our community, optimism for our state, and optimism for our country, and celebrating our connection with nature.'",
        "'speaker_1': 'Every single day there are so many difficulties that we all face around the world, around the country, throughout the city. But there are so many reasons for positivity and optimism. And Nowruz is about putting aside the negativity of the past, the toxic events of the past, and embracing the new year with a sense of hope and optimism'",
        "'speaker_1': '. In fact, on the Tuesday night before the actual spring equinox, we have a celebration which if the fire chief is listening, please go ahead and cover your ears. But we gather and we jump over a fire, a bonfire.'",
        "'speaker_1': 'I'm not saying where in Long Beach that might happen, but I'm just saying I have heard about such events taking place. But it's a really big deal in the Persian community. And as we jump over the fire, we say a phrase which is, I give you the pale and sickly yellow that I have to the fire and'",
        "'speaker_1': 'I take from the fire the red energy, the positive energy that the fire gives, the red embers. And so it's really a sense of moving forward with optimism and hope and rebirth much, much like the spring season for for so many other religions and cultures.'",
        "'speaker_1': 'I want to share that. Since the outset of COVID 19, the Iranian Persian Association American Association has focused its efforts to help the Long Beach City College and CSU, all these students facing financial hardship. Our ongoing efforts have helped provide food, grocery cards and hygiene products to more than 710 students.'",
        "'speaker_1': 'We've also continued the educational meetings with the community on issues of voting rights, ballot propositions and immigration issues, which are very important to our community. And I'm very proud of our community for being involved in these efforts. I want to thank my council colleagues for allowing me to share this beautiful part of my background and culture with'",
        "'speaker_1': 'all of you. It really is a huge part of who I am and who my mother raised me to be, and I'm glad that I have the opportunity to share it with all of you and to our Iranian friends that are watching.'",
        "'speaker_1': 'Do Sana Aziz. No. Rose petals. Eggshell. Mama Barack. Thank you, everyone.'",
        "'speaker_4': 'Thank you very much, Councilwoman. And that also includes a motion to receive and filed. Our celebration. I have a second by Councilmember Ranga. On that count from Ranga. Did you have some comments?'",
        "'speaker_2': 'Yes. It's always an honor to celebrate Nowruz with Councilmember Price brings it up every year as we celebrate all our other cultures as well. Throughout the year in the city of all means, we are diverse and we certainly need to celebrate our diversity because that is our strength.'",
        "'speaker_2': 'So thank you, Councilmember, for bringing this forward every year. Those pictures were absolutely gorgeous. With this HD television that we have now in front of us, all the colors were so vibrant, but not the same as being there in life.'",
        "'speaker_2': 'So to you, to the Iranian community. Peace, prosperity and health.'",
        "'speaker_4': 'Thank you. Council member councilman's and day has.'",
        "'speaker_1': 'Thank you, Mayor. Thank you so much, Councilman Price, for this beautiful presentation. What a beautiful, beautiful meaning it has. And how fitting is it? Especially this year. So happy Nowruz to you and to all of the community. And May.'",
        "'speaker_1': 'May. Together we have a prosperous new year.'",
        "'speaker_4': 'Thank you, Councilwoman Zoro.'",
        "'speaker_1': 'Yes, I. I want to thank Councilmember Price for sharing. And happy New Year to you. Councilmember Price them our our party and community.'",
        "'speaker_6': 'That celebrates it.'",
        "'speaker_1': 'I'm so appreciative that you're sharing this with us in a time where it's been it continues to be a dark and challenging period. And and it's always great to learn about the different cultures and how everyone celebrates spring and New Year in the way that that each culture does.'",
        "'speaker_1': 'And so thank you very much. I just appreciate it right now in this challenging time to be able to. And so I wish peace and prosperity and comfort to everyone. Thank you.'",
        "'speaker_4': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you, Councilmember Price. You mentioned it seven years. It's hard to believe it's been seven years since you introduced this. And it's, you know, even though we're virtual right now, that was a very informative video. I learned a lot more in this format about no rules.'",
        "'speaker_3': 'So rules pros look forward to next year and and even some more of the delicious treats and cookies that your mama your mother normally bring. Thank you so much.'",
        "'speaker_4': 'Thank you. And Council member Austin.'",
        "'speaker_2': 'Thank you. I just wanted to also. Join in the celebration of Nowruz. Look forward to it every year. Unfortunately, it's virtual, but I will say that the presentation was with excellent and it was educational because it went beyond the Iranian community.'",
        "'speaker_2': 'It explained how it was actually celebrated throughout the Middle Eastern region and how many help and how much it means to to so many people. And today, more than ever, you know, we are celebrating the new day ahead.'",
        "'speaker_2': 'And so happy Nowruz. Thank you. Yeah, I'll be dropping by for some cookies later.'",
        "'speaker_4': 'Councilwoman Allen.'",
        "'speaker_1': 'Yes, sir. Thank you. Councilman Pryce, this is such a wonderful video, and I did not know all those things, but, you know, love and prosperity and help. And so thank you for sharing this. And I look forward to when I get.'",
        "'speaker_0': 'To.'",
        "'speaker_1': 'When this comes back to city hall and we get to enjoy this next year. So thank you so much. That was really that was really awesome.'",
        "'speaker_4': 'Thank you. I'll just add also that I really enjoyed celebrating Nowruz over the last few years and getting to know the community. So thank you, Councilman Price, for always sharing such a beautiful part of your culture and of the diversity of Long Beach.'",
        "'speaker_4': 'Which one of the best parts I think about our celebrations is really enjoying kind of each other's traditions and cultures. And in your case, as you know, my absolutely favorite food and in fact, I think some of our colleagues would oftentimes I would we would we would have so, so, so much Persian food that you and I'",
        "'speaker_4': 'think were or enjoyed it maybe more than than most folks. It was so often when we were all gathered together. And I also, of course, I'm very grateful to your mom and all the sweets that happen every single year and look forward to those next year.'",
        "'speaker_4': 'And the best part I think, about Nowruz is really the opportunity for renewal and for a new start and a new day. So I love I love that part of it. So thank you all. And with that, there is not public comment, I believe, on this item.'",
        "'speaker_4': 'There might be one actually. Madam Court, do we have a public comment on this item?'",
        "'speaker_0': 'There is no public comment on this item.'",
        "'speaker_4': 'Okay, then we will go ahead and go to a vote.'",
        "'speaker_0': 'District one. I district to. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_4': 'Hi.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_4': 'Thank you. Let me go ahead and go ahead and start with we're going to do items 14 through 18/1, which are some staff items, and then we'll go back to some of the Fed pledge and other items after those.'"
    ],
    "Recommendation to request City Attorney to prepare a resolution to set operating days and hours for Parking Meter Zones 1 and 1A, pursuant to Section 10.28.130 of the Long Beach Municipal Code, to Monday through Sunday, excluding holidays, during the hours of 10:00 a.m. to 7:00 p.m., for a maximum of two hours, at a rate of $1.00 per hour.  (District 3)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_4': 'Okay. Next up is Adam 15.'",
        "'speaker_0': 'Please report from Public Works recommendation to request city attorney to prepare a resolution to set operating days and hours for parking meter zones. One and one a district three.'",
        "'speaker_4': 'Okay. Can I get a motion in a second, please? IV in motion by Counsel Murray. Can I get a second? Second bye. By Vice Mayor Richardson. No public comment on this item. So, members, please go ahead and do a roll call vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five. I. District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight. By District nine.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute all documents necessary to enter into an agreement with the Los Angeles County Flood Control District (LACFCD), to accept and expend funding in the amount of $10,800,000 for the Long Beach Municipal Urban Stormwater Treatment (LB-MUST) - Phase 1 Project from the Safe, Clean Water Programs (Measure W) Regional Program Transfer Agreement No. 2020RPLLAR02;   Increase appropriations in the Capital Projects Fund Group in the Public Works Department in the amount of $10,800,000, offset by Measure W revenue from LACFCD; and   Increase appropriations in the Capital Projects Fund Group in the Public Works Department by $10,800,000, offset by transfer of Measure W revenue from LACFCD funds from the Capital Projects Grant Fund.  (Districts 1,7,8,9)": [
        "'speaker_4': 'All right. Motion carries item 16, please.'",
        "'speaker_0': 'Report from Public Works. Recommendation to adopt resolution to enter into an agreement with L.A. County Flood Control District to accept and expand funding for the Long Beach Municipal Urban Stormwater Treatment Phase one project districts one, seven, eight and nine.'",
        "'speaker_4': 'I do have a I do have a motion and a second. I do want to add the next three projects. And Mr. Modica, correct me if I'm wrong, but the next two or three projects are projects that have received funding through the L.A. County Measure and measure W And Mr. Modica, do you want to maybe talk briefly'",
        "'speaker_4': 'on each one so that the community knows about these projects?'",
        "'speaker_5': 'Sure. Thank you, Mr. Mayor. We also have public works here to answer any specific questions. But Long Beach has been very, very active in Measure W. We were one of the major proponents for Measure M and Measure W to really bring additional stormwater resources to Long Beach to make sure that one city's upstream from us are paying'",
        "'speaker_5': 'their fair share and taking care of their stormwater. But then we also have solutions available to ourselves. So we're really excited to bring over $24 million to you tonight. One, you know, it's got to be one of the largest awards that we're aware of.'",
        "'speaker_5': 'The first project is for the Long Beach, Ms.. Project, which is a really innovative stormwater treatment plant down by the Drake Chavez Park and is going to be really a signature project to treat water, have wetlands on site, to fill those with treated water, and also to do irrigation.'",
        "'speaker_5': 'We're also able to do under a number 18 I'm sorry, number 17 is a stormwater retention basin to capture and filtrate water at scaling. And then we're also improving our Eldorado Lake projects with this money as well. So kudos to the entire team for putting this together and a real big investment in our water quality and also'",
        "'speaker_5': 'part of our L.A. River projects that we're constantly working on to improve the L.A. River. And that's the whole be must project. And any other questions? Eric Lopez and his team are available.'",
        "'speaker_4': 'Great. Why don't we go ahead and Madam Kirk will? Well, we'll vote on all three of these together. Do you want to read the other two items so we can all go round them together? It's all part of the same big grant program.'",
        "'speaker_5': '17 is a report from Public Works. It's a recommendation to adopt resolution, to accept and to expand funding for the gaming golf course at Willow Stormwater Capture Project, District five. And Item 18. It's also a report from Public Works to adopt resolution to accept and expand funding for the Eldorado Regional Project District five.'",
        "'speaker_4': 'Thank you. Well, with that, we do have a motion by Councilman Sun House and we have a second by councilman, mongo, councilman and Day House.'",
        "'speaker_1': 'Thank you, Mayor. I just really want to say how excited I am about the we must project here in the First District. This is such an amazing opportunity for both to address serious environmental challenges in our area, but also to, to, to it's an opportunity to develop this area.'",
        "'speaker_1': 'And it's going to be incredible having the wetlands space there for our community and to continue our Drake Charvis master plan in this area. Staff has been working really hard on this. So for that I'm very, very thankful for your continuous updates to my office on this and thank you for your hard work on this.'",
        "'speaker_1': 'I'm especially excited about the way that we that we can expand this project. And this is this is an idea that that is growing and that we'll we'll keep that in mind as well. And it really is going to become a regional leader in the L.A. River area.'",
        "'speaker_1': 'This is something that's built with growth in mind. And I can't wait to see all the amazing opportunities that are going to be created here, not only for ourselves and our residents, but but for for the entire county and staff.'",
        "'speaker_1': 'So I'm really excited about this. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'Thank you. We're very excited about this project that's been in the works for several years and the community is very supportive. Thank you.'",
        "'speaker_4': 'Vice Mayor Richardson, did you have any comments?'",
        "'speaker_3': 'Oh. Comments supportive. Thank you.'",
        "'speaker_4': 'Councilwoman. Sara, was that just a motion or any comments?'",
        "'speaker_6': 'Now a motion. Okay.'",
        "'speaker_4': 'And, Councilman, your anger or those comments are just emotion.'",
        "'speaker_2': 'No, I actually have some comments. I'm a member of the Rivers Animals Conservancy, and we contribute some money to go towards a law which must. And with these gone with these contributions, now that we have it almost fully funded.'",
        "'speaker_2': 'So I'm really looking forward to the completion of that project. Thank you.'",
        "'speaker_4': 'Thank you. And I want to just congratulate the team. I think a lot of us were involved in Measure W and we were active supporters of that county measure, and it's producing some significant projects for the city as it relates to stormwater and water in general.'",
        "'speaker_4': 'And so this is a significant award for the city and we're going to see other projects in the future also receive funding. So we are we're excited about that. And so with that, we're going to take one vote.'",
        "'speaker_4': 'This is for items 16, 17 and 18 benefit.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. District three. District three, District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'District five. District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to respectfully request City Council approval of the 2021 Federal Legislative Agenda as recommended by the Federal Legislation Committee.": [
        "'speaker_4': 'Thank you. We will go back now up to item number 11, please.'",
        "'speaker_0': 'Communication from Vice Mayor Richardson, chair of the Federal Legislation Committee, recommendation to approve the 2021 federal legislative agenda as recommended by the Federal Legislation Committee.'",
        "'speaker_4': 'Vice Mayor Richardson.'",
        "'speaker_3': 'Thank you. I just have a few comments, but I want to ask our staff if we're able to take all three of these on one vote. They're all related. Vice mayor, this is Charlie Parker. And I think, yes, if the clerk.'",
        "'speaker_4': 'Reads all three of the items and then.'",
        "'speaker_3': 'If there's any public.'",
        "'speaker_2': 'Comment on all.'",
        "'speaker_3': 'Three items.'",
        "'speaker_5': 'If that's heard before.'",
        "'speaker_3': 'The action is taken. Yes, you can take them to. Great, great, fantastic. Can we read the other two?'",
        "'speaker_0': 'Item number 12. Communication from Vice Mayor Richardson, Chair of the Federal Legislation Committee. Recommendation Requests Request City Attorney to draft a resolution in support of Medicare for All, as recommended by the Federal Legislation Committee. And a communication from the Federal Legislation Committee.'",
        "'speaker_0': 'Again, Vice Mayor Richardson, Chair recommendation to approve the recommendation of the Federal Legislation Committee to support federal legislative proposals.'",
        "'speaker_3': 'Thank you. So proud to bring these recommendations from the committee forward. They were supported unanimously in the committee level. These are obviously some changes to the agenda, all consistent with our goals around economic development, public safety, public health, sustainable and livable cities.'",
        "'speaker_3': 'COVID 19 response. And it also is consistent with our Racial Equity Reconciliation Initiative. Initial report. I look forward to continue to work with the committee to identify more resources for Long Beach. We're pretty proud to see the results of the Long Beach Recovery Act.'",
        "'speaker_3': 'Next, Congress is going to focus on a large infrastructure bill. I've spoken with Lowenthal Waters, Bass, Norma Torres and others. This bill will be much bigger than infrastructure. It will have housing, CDBG support. Large projects like Metrolink and high speed rail.'",
        "'speaker_3': 'Also green infrastructure projects consistent with cleaning our air. So that will be the next significant order of business. I will expect Congress to pick up on that very soon, expect action in May or June. So that said, I'm happy to make this vote, this recommendation to approve these three items.'",
        "'speaker_4': 'Kate. There is a motion to approve the items on the floor. And I have a have a second to my councilman's in Davos. Councilman Van de Haas.'",
        "'speaker_1': 'Thank you, Mayor. I just wanted to show my support for all three items, but especially for Medicare for All. The COVID pandemic has further exposed just how poorly we can't just how any, you know, art our care health care system has been.'",
        "'speaker_1': 'Because it seems that insurance nowadays is a luxury when there's actually millions of people that cannot even afford to go see a doctor when they're sick. So I'm very excited that the federal Federal Legislation Committee has proposed a resolution in support of Medicare for All.'",
        "'speaker_1': 'I think it's the right thing to do. And I think the whole committee for bringing this forward. Thank you.'",
        "'speaker_4': 'Thank you. And next up is Councilwoman Price.'",
        "'speaker_1': 'Mr. Mayor, I did have a question for perhaps city staff can help me with this and I can't switch back to my PDF notes from the agenda item, so I don't know what page it is, but I want to talk a little bit about gun control and I am very interested in seeing what legislative proposals are out'",
        "'speaker_1': 'there. Federal legislative proposals are out there that the city can support or even possibly suggest that address the loophole in the universal background check proposal, because right now that background check proposal applies to retailers and not private sales.'",
        "'speaker_1': 'And I was recently listening to a piece in NPR about some of the violence that we're seeing in South America and in Mexico with the guns flowing south and these private sales of of a really large amount of arms and.'",
        "'speaker_1': 'Very dangerous weapons between private parties is not really regulated at all in terms of universal background checks. So are we aware of anything like that? And I know that our Fed large agenda has a very general comment about supporting legislation to control access to guns.'",
        "'speaker_4': 'And I think maybe it's Dr. Curley on the. On the line.'",
        "'speaker_5': 'Yes, I am.'",
        "'speaker_4': 'Okay, great. What do you want to give her an overview of? I know that some of that's in the agenda currently, but you wanted me probably speak to councilwoman prices questions, please.'",
        "'speaker_5': 'Yes, absolutely. So some of the things that we are recommending in partnership with Long Beach PD is new items around ghost guns regulations and also just more interoperable databases around ammunition cases, things like that. But there are existing items in the legislative agenda related to strengthening gun control laws and requiring background checks on ammunition purchases.'",
        "'speaker_5': 'You know, I think that we could potentially, if there was an amendment or a friendly to include something more specific around universal background checks that would give us more direction around just how far we'd like to go on that specific item.'",
        "'speaker_1': 'I would like to offer a friendly that if there is legislation proposed on universal background checks that the city advocate in favor of it and also. Evaluate whether it can apply to private sales as well.'",
        "'speaker_3': 'Accepted.'",
        "'speaker_1': 'Thank you. And then the other question I have is, what is there any legislation pending right now regarding assault weapons ban on assault weapons? I mean, it's just that the mass shootings don't seem to be stopping. And I'm just wondering if there's anything pending in the legislation right now on that.'",
        "'speaker_5': 'I would have to double check exactly what proposals are out there right now. But yes, those are often introduced and then would likely pass the house right now. But I don't know if they would be successful in the Senate currently, but that is definitely something that we could check back on for the details.'",
        "'speaker_1': 'Yeah, and it could just be either a two from four or if you just send me an email. I'm just curious what current legislation there is regarding banning assault, large scale assault weapons and whether that discussion is is is ripe right now or not.'",
        "'speaker_1': 'So thank you. And with that, I'm happy to support all the items. Thank you.'",
        "'speaker_4': 'Thank you, councilwoman. I also have next up is Councilwoman Sara. Well, actually, I think that was just a part of the motion. I do have a just a couple broad, broad comments and as well. First is, I think this is a great agenda for federal agenda.'",
        "'speaker_4': 'And I want to thank the committee Vice Mayor Richardson for their work on this. I think it's going to be a couple of very big years in Washington, D.C.. I want to also speak to Councilman Price's comments around additional gun control or, you know, gun safety legislation.'",
        "'speaker_4': 'I think that's really important for us. That debate, obviously, we have supported those issues in the past. There will be additional bills in front of the Congress or ones that will be reintroduced. And so the more that we can be involved in and engage in that conversation, we should be.'",
        "'speaker_4': 'And I also just want to also just touch on something that Vice Mayor Richardson said as it relates to infrastructure that is going to be a massive recovery bill as well that is now being negotiated and discussed. And so we look forward to being very engaged in that at the federal and local level as that bill is'",
        "'speaker_4': 'developed. And with that, I think that has answered all the questions. Are there any public comment on this item?'",
        "'speaker_5': 'Yes. We have Steve Shukla.'",
        "'speaker_3': 'Good evening again. I urge you support for all three items and would like to thank the Federal and State Legislation Committee of the Council for bringing them forward, particularly H.R. one, the for the People Act, the Medicare for All Act, and in the federal legislative agenda, the focus on implementing the city's Climate Action Adaptation Plan, particularly as'",
        "'speaker_3': 'we look, as a major said, towards the infrastructure portions of the American recovery plan. You committed the city of Long Beach needs to turn the corner from being a state laggard, state leaders in emissions reduction and particularly achieving net negative emissions by 2030, 2045, 2040, 2050.'",
        "'speaker_3': 'We're simply too late looking forward to seeing not only these measures, passion, but also seeing how this year how we develop achieving these needed targets. Thank you. Thank you.'",
        "'speaker_2': 'That concludes public comment for this item.'",
        "'speaker_4': 'Thank you. And with that, we will go and take the the one vote on items 11, 12 and 13. Localities.'",
        "'speaker_0': 'District one.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'District five. District five. District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'District nine. I motion carries.'"
    ]
}