{
    "Recommendation to receive supporting documentation into the record, conclude the hearing and grant an Entertainment Permit with conditions on the application of Casto Corporation, Inc., dba The Brit, 1744 East Broadway, for Entertainment With Dancing by Patrons.  (District 2)": [
        "'speaker_1': 'Thank you. The first hearing involved financial management department with a recommendation to receive supporting documentation into the record. Conclude the hearing and grant the entertainment permit with conditions on the application of Cascade Corporation doing business as the Britt at 1744 East Broadway for an entertainment with dancing by patrons permit.'",
        "'speaker_1': 'This is in District two.'",
        "'speaker_0': 'Okay, I'm going to turn this over to our city manager.'",
        "'speaker_5': 'This item will be held will be taken care of by Jason MacDonald, our business services manager and Commander. Farfan. Mayor Council Members. Jason MacDonald Purchasing and Business Services Manager for the Financial Management Department. Tonight you have in front of you the application for entertainment with dancing forecast of corporation doing business as the Britt 1744 East Broadway in'",
        "'speaker_5': 'District two. All the necessary departments have reviewed the application. The application and proposed conditions are contained in the packet that was provided. We would like to highlight the fact that this is an existing business that had previously held a short term entertainment permit.'",
        "'speaker_5': 'We are prepared to address any questions or concerns along with the police department regarding the application or conditions.'",
        "'speaker_0': 'Okay. Thank you. I'm going to first begin by going if there's any public comments on the hearing, this would be now the time for you to come forward. And just please identify yourself for the record.'",
        "'speaker_5': 'I am Tom Hertzog, property owner at 1725 East Second Street. My partner and I and our two sons live there. Well, my partner I have lived there for 20 years. Our adopted sons for up to ten or so.'",
        "'speaker_5': 'Anyway, the threat has been more of a problem in the last five years since the city first granted the variance for the outdoor patio, gogo dancers and even karaoke. I live two blocks away or 2 hours away, and we have constant, ongoing issues with the noise.'",
        "'speaker_5': 'In the last year I didn't bring my calendar, but I've called the police probably approximately ten, 10 to 12 times, maybe a little bit more. But there is a record of that because the city council directed it to the residences to manage this issue instead of addressing it themselves.'",
        "'speaker_5': 'So we have a noise noise issue where the board is not complying with the noise ordinance. And I don't know if you've read the noise ordinance, but it is at from 10 p.m. to 7 a.m. at 55 decibels at the property line.'",
        "'speaker_5': 'Actually have a noise meter from my project work where I know from my bathroom window they exceeded. So we have that calling the threat they will respond. But I've also been told any number of language that it's not my business knowing that I am a property owner vested and financially inclined.'",
        "'speaker_5': 'It does affect my property value. It does affect our quality of life. Finally, it is the City Council's duty to implement the noise ordinance and the general plan and that does disturb, does do disturbing noise with language, loud music in close proximity to residential sleeping court facilities, which if you look it up, it's 880 dash 130.'",
        "'speaker_5': 'So anyway, I've called all the officers strongly opposed to this being in favor. It doesn't generate enough revenue to allow dancing in a bar of 880 800 square feet. It's going to put more people out onto the patio, which doesn't have any noise restrictions, puts more smoke, more general nuisance out into the neighborhood, which address public a'",
        "'speaker_5': 'number of properties. So even with the, you know, the apartments right around it, we have to deal with it. So you may vote for it thinking that, oh, it's business, but no, it's our life and it's our homes.'",
        "'speaker_5': 'So please vote against that. There are not a good business.'",
        "'speaker_0': 'Thank you. Any other comments?'",
        "'speaker_8': 'Please.'",
        "'speaker_9': 'Hi, my name's Reg Latham. I'm the property owner at 1747 East Second Street, which is directly behind the Britt. Our property lines are right next to each other, so our little courtyard in the back of our house, I've.'",
        "'speaker_6': 'Got a wife and two kids.'",
        "'speaker_9': 'In elementary school. I live there. But the place in 2005 did a really good remodel and it's a good property. I can tell you when we first moved in it was okay. We knew we were behind a bar.'",
        "'speaker_9': 'We knew what we were getting into. There's there's no secret there. We've been fine. The variants five years ago that increased the noise level substantially. Is there smoke that we can count that we smell coming into our home at night?'",
        "'speaker_9': 'Yes. Is there a lot of noise? Yes. Are there people walking in that door next to the bar and defecating and sleeping and doing whatever in that in that space between our house and apartments next to us? Yes.'",
        "'speaker_9': 'However, we've been living close in proximity with these people and we've been working with them and we haven't really complained. But I can tell you now that if you vote with them even more noise rates, there's going to be some serious problems and there will be.'",
        "'speaker_9': 'The police called your services will be will be used. And it's just going to waste a bunch of people's time and effort and money. Owning a home, owning a rental property, that's a business, too. And when we sell our house, we don't want exterior issues with an appraisal saying that there's smoke coming in the house that you'",
        "'speaker_9': 'can hear cursing. You can see vagrants. And it's very loud. So common sense would give you guys a little bit more insight as to how to vote on this one. Thank you.'",
        "'speaker_0': 'Thank you. Any other speakers, please?'",
        "'speaker_5': 'Very good you cook as he dress circumstance circumstances have it. I was here at the last hearing you had and the dialog is the same. Essentially my take is essentially the owners are giving the middle finger to the residents.'",
        "'speaker_5': 'Nothing has changed substantially. So they're in violation of a code. You need to take action in concert with that and bring down the hammer period or close the place down. There are a lot of bars or, you know.'",
        "'speaker_5': 'I've yet to hear of any complaints out of of Jojo's. And there are a lot of other bars around this town that can act responsibly. Period. It's just a question of whether or not the owners want to be like that and whether or not the elected representatives want to keep taking the cash from the people to allow'",
        "'speaker_5': 'them to do that. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker put.'",
        "'speaker_5': 'Thank you, Mr. Mayor. City Council. My name is Jerry Cochran. I'm the property owner at 1735.'",
        "'speaker_10': 'East Second.'",
        "'speaker_5': 'Street and 1732 through 1738 Broadway. My apartment building is adjacent to the brick, particularly the patio, and I have been unable to keep tenants in one of my units based on the noise and more importantly, the smoke from the patio.'",
        "'speaker_5': 'I've had to turn over like every 90 days in one of my units, and I've had several people that move out my one rear unit and number three backs right up to the patio. And as somebody has.'",
        "'speaker_10': 'Said previously, we have people defecating, doing a little bit of everything.'",
        "'speaker_5': 'Right, actually, between my building and the Brett and the noise is extreme and the smoke is just absolutely ridiculous. And I know Long Beach is very considered over smoking and where you can and can't, but when you have residential around this facility and as the president, the previous speaker spoke, he has little children.'",
        "'speaker_5': 'This is a problem. And I, I beg you to not allow them to go forward with this project. Thank you.'",
        "'speaker_0': 'Thank you. Seeing no other public comment. I'm going to close the. There's more public comment, please. If there is public comment, please come forward. If you have public comment, I need you to line up at the at the at the podium right now.'",
        "'speaker_0': 'And there's something else that's beeping. Can someone turn that off?'",
        "'speaker_3': 'Used to have.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_5': 'This general manager. I just took over managing it seven months ago. I know their concerns. The gate on the left side is not our property. It's the apartment complex. It used to be locked since the new people took over.'",
        "'speaker_5': 'It is unlocked so we can't really control people going in and out. I have put a doorman out on the patio to control the noise on Friday and Saturday nights when it's open till midnight. It actually closes at 1145 because we're on bar time on Friday and Saturday nights during the week.'",
        "'speaker_5': 'It closes at ten, so it's actually closed at 945. We are working on, you know, controlling the issues, the smoke. I can see it as being a problem. There's you know, it's a smoking patio. We could go nonsmoking on it.'",
        "'speaker_5': 'I don't you know, I would hate to do that for the patrons, but it is under doing it.'",
        "'speaker_11': 'I spoke with both the neighbors.'",
        "'speaker_5': 'And commented up there in the past trying to control issues and problems with it.'",
        "'speaker_8': 'They both have.'",
        "'speaker_5': 'My personal cell number to call me at any time. I haven't, you know.'",
        "'speaker_8': 'Trying to do our best there.'",
        "'speaker_5': 'So I don't know. I say that. Thank you.'",
        "'speaker_1': 'Could you please state your name for the record? Yeah.'",
        "'speaker_5': 'Joe Meeker. Julia.'",
        "'speaker_0': 'Thank you. And see no other public comment. I'm going to close the comments and bring the public hearing back to the council with Vice Mayor Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I have a few questions for staff, and I'm wondering if the owners in the audience. Mr. Beaker is the owner here. Okay. Thank you. So, two staff. I wanted to ask about Mr. Herzog's comment regarding the noise ordinance and violation of our noise ordinance based on a decibel reading that he's received.'",
        "'speaker_7': 'Did staff send anyone out? I don't know if Mr. Kurz in the audience.'",
        "'speaker_5': 'But Vice Mayor Lowenthal. The business license department doesn't have meter readings for noise complaints that I would want to speak to health before we could answer that question if they sent someone out for those.'",
        "'speaker_7': 'I don't see how in the audience. I see general health in the audience, but I don't see our health department in the audience. I'm just Lenny phrases delicately. If a constituent is concerned about a noise ordinance violation, would we not have contacted Health to investigate that?'",
        "'speaker_5': 'Vice versa. The process would have been that the complaining party would have called either the police department after hours or the health department during working hours. And then the police department did their normal review of the entertainment permit.'",
        "'speaker_5': 'So I'd let them speak to any other issues they identified there. But we were not made aware of any issues regarding noise from health prior to the to the tonight.'",
        "'speaker_7': 'And I can't see past Councilmember Richardson. Is that PD sitting next to you? So would you be able to answer that question in terms of the violation?'",
        "'speaker_8': 'Well, a part of the investigation.'",
        "'speaker_5': 'We contact residents within 100 foot radius, and it was 46 residents total. None of the.'",
        "'speaker_8': '4617 were not opposed to or opposed to an entertainment permit and 24 were not home. However, with the 24 that were not.'",
        "'speaker_5': 'Home, we do leave notes to contact the police if they have any positive or negative input. As far as the concerns for for noise or music from June 28th.'",
        "'speaker_8': '2014 through today, we responded five times to location.'",
        "'speaker_5': 'One was for a dispute. One was for an intoxicated person. Two were for misdemeanor assaults, and one was a theft of a passport. So basically, since.'",
        "'speaker_8': 'June 28th, we have not received any calls for service regarding loud music.'",
        "'speaker_7': 'And I think Mr. Herzog feels differently, correct? Yes. And I appreciate the report. I and I appreciate Mr. Becker being here. I understand that you're new and you're put in a precarious situation. So I'm not going to ask you to answer to anything or any questions.'",
        "'speaker_7': 'But I will say this has been in place for five years and we've had plenty of time to work it out. And hitting the reset button every time someone comes forward for an application is not fair to the residents.'",
        "'speaker_7': 'And and I appreciate the summary of what our outreach resulted in. It resulted in 17 people being okay and two people opposed. But unfortunately, when we talk about quality of life, it can't be that numbers game. The people that live the closest are impacted the most.'",
        "'speaker_7': 'And so we have to make some mitigation efforts. And so tonight, I don't I didn't know this coming here that I would feel this way, but I don't know that I feel comfortable proceeding tonight. I'd like to speak with the owner who's not here.'",
        "'speaker_7': 'I want to address the issue of the patio noise. I understand that it is a smoking patio and people do have a right to smoke outdoors. But in the second district we have such density of units very close together.'",
        "'speaker_7': 'And so it's a little different when your patio is right under someone's window. And I do think that that matters, whether that leads to a no smoking policy in the entire building, that's something we can talk about. I'd like to talk about that with your owner and the noise ordinance.'",
        "'speaker_7': 'I do want health to go out and and perhaps partner with Mr. Herzog and and his family. So when you do feel that a noise ordinance violation took place, perhaps we we can contact help that night. Mr. Kerr does provide his mobile number.'",
        "'speaker_7': 'And so I know it's a late night call, but I'd like us to be able to get that reading as well. And so that's going to take going to take a little bit of time. And so, Mr. Mayor, I'm going to ask to put this over.'",
        "'speaker_7': 'And Mr. City Attorney, would that require a time certain?'",
        "'speaker_5': 'I believe the answer is yes. But if the if you had a date that you wanted to continue to. Or they could bring it back as a new item at a future date.'",
        "'speaker_7': 'Or they can bring it back when?'",
        "'speaker_5': 'At a date. A future date. After you've we can put it back on the agenda at a later date. It doesn't have to be to a time certain.'",
        "'speaker_7': 'Okay. I would appreciate that, because I'd like to respect people's schedule and I'm not sure when we're able to get that on our end. And so if we can. December would be a great time if we can bring it back.'",
        "'speaker_7': 'But if it's not possible, then we will schedule it to when we can. And so for now, that's my motion is to put the item over until we have the opportunity to talk with the owner and collaborate a little bit more with our residents that are primarily impacted.'",
        "'speaker_7': 'I understand there are others that might be in support.'",
        "'speaker_0': 'Is there is there is a second kit has been in motion in a second we did the public comment period please cast your votes on to holding this over.'",
        "'speaker_1': 'The motion carries eight votes.'",
        "'speaker_0': 'Motion carries. Moving on. Mr. Kirkup, we're going to do the public comment period first. I have eight members of the public that want to speak. I'm going to ask the first four to please line up at the podium Fred Potter, Ricardo Ceja, Shawn Lanigan and Larry Goodhue.'"
    ],
    "Recommendation to request City Manager and City Attorney to return in 90 days with a draft ordinance making it mandatory for dog owners to spay or neuter their pets unless they possess a medical exclusion or breeding permit from the Department of Parks, Recreation and Marine, Animal Care Services Bureau;  Request City Manager to include recommendations for supporting the successful introduction and implementation of the Mandatory Spay & Neuter Ordinance, including but not limited to public education, spay/neuter vouchers, mobile services and enforcement through administrative citations and license canvassing; and  Request City Attorney to draft an ordinance making it unlawful to sell dogs, cats or rabbits in any pet shop, retail business, or other commercial establishment, unless they were (1) obtained from the city animal shelter, humane society, or nonprofit rescue organization or (2) bred on the premises possessing a breeding permit.": [
        "'speaker_1': 'This first item is from the Office of Vice Mayor Susie Lowenthal, Councilwoman Susie Price and Third District Councilwoman Stacy Mongeau with three with a three part recommendation. The first is to request the city manager and city attorney to return within 90 days with a draft ordinance regarding mandatory spay neuter for dog owners.'",
        "'speaker_1': 'The second part has to do with a recommendation to have the city manager plan and make recommendations on a for implementation of a mandatory spay and neuter ordinance. And then finally request the city attorney to draft an ordinance making it unlawful for the owners to sell dogs, cats or rabbits in any pet shop unless specifically exempted.'",
        "'speaker_0': 'Okay. Thank you. With that, I turn this over to Vice Mayor Alonzo.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I wanted to go ahead and start by moving the item with a couple of changes right now. For now. One is. The requested item, the actions as is with the third action item, including an exemption for AKC certified show dogs.'",
        "'speaker_7': 'And then I can explain in my comments and then the last line of the recommended action where it says Bred on the premises possessing a breeding permit. We'd like to change that to bred in Long Beach. Possessing a breeding permit.'",
        "'speaker_7': 'So just change the premises to in Long Beach.'",
        "'speaker_0': 'Okay. Is that the full motion? Can I get a second? Okay. There's been a motion in a second by Councilman Mongo. Vice Mayor Lowenthal, thank you.'",
        "'speaker_7': 'And I wanted to thank my co-sponsors, council members, Price and Mango for joining on this item. Council members. As you know from the agenda item background, this issue is very close to my heart. And so it's been a work in progress with our animal care services staff and community partners going on seven years now.'",
        "'speaker_7': 'And during that time we've done a lot of good things together. We've increased low cost spay neuter options. Just as we heard from Fix Long Beach tonight, and I'm thankful that you are here in the audience, we've created a full time veterinarian position and encouraged mobile clinics.'",
        "'speaker_7': 'All of these elements and others have increased the number of animals adopted and reduce the number of animals euthanized in Long Beach. However, seven years later, we're finding out it's still not enough. We have a real problem in our city.'",
        "'speaker_7': 'Long Beach has a real problem with pet overpopulation. Despite the great work of our Animal Care Services Bureau, very responsible dog owners, and we have thousands of responsible dog owners and our extremely passionate community partners. Knowingly or unknowingly, pet owners are contributing to our overpopulation, and we're not going to adopt our way out of this problem.'",
        "'speaker_7': 'That's simply just not possible. We know that the vast majority of dogs picked up by animal care services are unaltered. We also know that backyard breeders have created puppy mill businesses that are cruel and inhumane, sometimes dumping the mother in one of our dog parks and choosing a few new female pups to take her place.'",
        "'speaker_7': 'We also know that cats in Long Beach must be spayed and neutered by law. Over 80% of owned cats are fixed, and that's provided by our animal care services. It's a fact that's provided by them. These are health and public safety concerns as well as taxpayer concerns.'",
        "'speaker_7': 'We have to focus on the faucet and not only the drain of this broken sink. I believe this motion is another measured step in our attempts to go from a reactive system to a proactive system. And for those of you who've been committed to this issue for years and years and years, you know that this council starting'",
        "'speaker_7': 'seven years ago, has been laying down a foundation, moving toward this step. Installment by installment. Because as we reduce the number of animals being impounded, we can focus more of our resources and volunteer hours on adoptions, public outreach and mobile clinics.'",
        "'speaker_7': 'Let me also share with you what the intent of this motion is not. It's not an attempt to punish responsible pet owners or prevent purebred breeders and dog show owners from carrying on their business. And I know we have representatives here from AKC.'",
        "'speaker_7': 'They have had their invitational here, I believe, for seven years. We welcome that business. We encourage that. We know that there are responsible owners that participate in that, and we'll hear from them a little later today. But this is not to punish any one of those very responsible pet owners, dog owners.'",
        "'speaker_7': 'I believe a friendly amendment will address any lingering concerns from show dog owners. But I would like to continue the larger focus.'",
        "'speaker_3': 'To be the.'",
        "'speaker_7': 'Focus to be on the larger problem, which is pet overpopulation. And so the amendment I had made earlier, I believe, addresses that concern about show dogs. And then I'll welcome any comments or questions from my colleagues and would appreciate your support.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Well, what we're going to go ahead and do is take action is take public comment unless. Councilwoman, did you want to make a comment first, Gonzalez or do you wanna wait for public comment? Okay. So if you want to speak on the item, please come forward and line up.'",
        "'speaker_0': 'I need you, please, to line up on on the mike and everyone just please identify yourself for the record. And Mr. Clarke, can you get the stand up, please?'",
        "'speaker_8': 'Getting.'",
        "'speaker_0': 'And if you can line up on the stairway, that would be that would be very helpful, please.'",
        "'speaker_3': 'Good evening, everyone. My name is Judy Crumpton. I reside in the city of Long Beach and my address is on file. And I want to show you what we do want to achieve. And I am going to ask everyone in the audience who has a poster.'",
        "'speaker_3': 'And if you don't have a poster, just raise your hand. Just raise your posters for a second. All your hands. If you're in support of litter free Long Beach, this is our goal is to be litter free. Thank you so much.'",
        "'speaker_3': 'You can see the outpour from your humane community. There are many of us here. I want to give a very special thank you to once again, Mrs. Lowenthal. Dr. Lowenthal, Susie Price, Councilwoman Price, Councilwoman Mongo for bringing this together and bringing it forward.'",
        "'speaker_3': 'I thank each and every one of you for listening to my comments and allowing me to meet with you. We have such an outstanding, humane community here in Long Beach. We have a lot of spay neuter assistance in place.'",
        "'speaker_3': 'Mandatory spay neuter to me is the big fix. Once again, just as vice mayor said, we simply cannot adopt our way out of this tragedy. It's more than a problem. It's a tragedy. And our ordinance, as vice mayor stated, has been in place.'",
        "'speaker_3': 'The AKC wanted it. The AKC got it. It's a it's a decent enough ordinance, but it's really not strong enough to help us to make a significant difference in pet overpopulation. Our animal care services is very good, but they need a stronger tool.'",
        "'speaker_3': 'This is not a strong enough tool. Let's give them a tool to work with that will target the irresponsible pet owners and the backyard breeders. They're the main problem, and that's who we need to really focus on.'",
        "'speaker_4': 'And mandatory a.'",
        "'speaker_3': 'Mandatory law is not designed to be punitive. It can up Santa Cruz. I have talked to Melanie Sobel, who is the the manager of the Santa Cruz shelter. It's not just the Santa Cruz City itself. It's the outlying areas that are very problematic and they have a mandatory spay neuter ordinance in place.'",
        "'speaker_3': 'And it's very successful. People are concerned about the dumping. I get that. But we have so much assistance in place. This ordinance will get great education. We will educate our community about what we're doing. The enforcement will happen.'",
        "'speaker_3': 'And you're humane community is behind you on this. And as long as those are in place, this is just a recipe for success. Once again, once when one of our community members is sighted and that dog needs to be fixed, we will be behind them.'",
        "'speaker_3': 'The shelter has an outstanding spay neuter voucher program.'",
        "'speaker_4': 'We work very hard on it.'",
        "'speaker_3': 'Friends of Long Beach Animals, Pet Assistance Foundation, Fixx, Long Beach, Golden State, Humane Society. They're all the people that will be there to assist that individual with any calls for spay neuter. Melanie has reassured me about and it's just is not happening of animals.'",
        "'speaker_3': 'So there are other areas too. There's so much to say. Oh, and you know what? I would like to propose to anybody out in the audience. Audience, if you would please help us to sponsor a microchip program. Our city right now can't afford it.'",
        "'speaker_3': 'But if a corporate person wants to come along or an animal protection organization would like to sponsor the microchips, we can get these animals microchipped as well while they're being fixed. There's just so much to say. And I know my time.'",
        "'speaker_3': 'I hate seeing those lights. Come on.'",
        "'speaker_0': 'Well, actually, the light just turned on for you. It wasn't on. So I.'",
        "'speaker_3': 'Can slowly. I've got to wrap it up. Okay. And, you know, I want to say that our animal care services are in the trenches. They're the ones who have to deal with a community made problem. Pet overpopulation is made by the community, not our shelter.'",
        "'speaker_3': 'They're the ones dealing with it. We need to help them. We need to give them something powerful to work with and please support the pet shops.'",
        "'speaker_4': 'It's a great thing too.'",
        "'speaker_3': 'Let's just have adoptions out here and I still have a problem with number two. I'm very sorry. I'm still there. Still a little questionable. Where's that red light? It's coming on. Oh, no.'",
        "'speaker_4': 'Okay. Thank you so.'",
        "'speaker_3': 'Much. I love you. Thank you.'",
        "'speaker_0': 'Thank you. Next week with the.'",
        "'speaker_3': 'The City Council. Laureen Wilson, speaking on behalf of the American Kennel Club, is an exhibitor and breeder. Thank you very much, Mr. Lowenthal, for making the amendment to the proposal, because it certainly does address our concerns as an AKC show person.'",
        "'speaker_3': 'We cannot show spayed or neutered dogs. It's against the AKC rules of exhibition, and we are very responsible dog owners. In addition to that, we have dog clubs, purebred dog clubs that rescue dogs, if there are even any purebred dogs found in the shelters.'",
        "'speaker_3': 'So we are very responsible people. I would like to ask, though, how the enforcement officers intend to enforce a bitch that spay. It's obvious if a dog's neutered, but what are they going to do? Turn the bitches on their back and look for a scar.'",
        "'speaker_3': 'Just wondering how that enforcement would work with that. It is something to consider because we certainly don't want to feel harassed. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Very good. Cleric as he addressed the makers of the motion are certainly to be commended for bringing this forward. I'm going to suggest a friendly amendment. It was prompted by a rather revealing article in the L.A. Times reporting some national news relative to the number of orphaned young ones, if you will.'",
        "'speaker_5': 'So I'm going to suggest the easiest thing to do. The easiest thing to do and it's obviously a dramatic change is to drop the third strike law. And instead of having that after the second strike, if it goes to a third crime, you have neuter and spayed period.'",
        "'speaker_5': 'That will alleviate a great many of the problems. We are throwing millions upon millions of dollars, just like we're doing with our four legged friends after the problem. And it's not working. The DNC keeps pumping money into, you know, pop out again and we'll give it to, you know, give you the money that's not working.'",
        "'speaker_5': 'So let's eliminate the third strike, replace it with a spay and neuter on the offender and solve the problem. Thank you.'",
        "'speaker_0': 'Oh, you cute. Always so instructive. Next speaker, please.'",
        "'speaker_2': 'Hi. Good evening. My name is Daphne and I am an animal rights activists currently specializing in the care and stabilization of feral cat colonies. And I just wanted to bring to the table the, I guess, the human aspect of it.'",
        "'speaker_2': 'Any of us involved in rescue or people that are involved in shelter work. See, on a daily basis the just a flood, the flood of animals that are taken in and surrendered at animal care services. And it's it's it's blind to the rest of the population, doesn't know about it, doesn't worry about it.'",
        "'speaker_2': 'But to us, we see kittens, puppies, old animals, young animals, animals of all kinds that are only surrendered because they have nobody to their own owned. And so what I would like to say is that with this with this mandatory, mandatory spay and neuter ordinance.'",
        "'speaker_2': 'Sorry, I just put this together last minute, but. Well, let me just say this. I'd like to change the dialog from euthanasia to more murder. Euthanasia implies that there's an animal who is ill and is suffering. And what happens in our shelters is not typically euthanasia.'",
        "'speaker_2': 'Maybe 80% of the time, the animals that are in there and are killed are just killed to make room for more animals to come in and so on. And it's an endless cycle. And so with with the mandatory spay and neutering, if it was to go into effect, that would take that would free up so much kennel'",
        "'speaker_2': 'space and cattery space and leave more time for these animals to potentially be adopted. And the resources that are spent on this so called euthanasia would could be reallocated into more conscientious programs and bringing awareness to the community of what's happening in our shelter system.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, mayor and council members. My name is Elizabeth Orrick. I'm the national manager of Puppy Mill Initiatives for Best Friends Animal Society, and we wholeheartedly support the proposal to draft a retail pet sales ordinance. The fact is pet mills, particularly puppy mills, are in business to supply pet stores because responsible breeders do not sell to pet'",
        "'speaker_2': 'stores. And you can find that provision in the code of ethics for virtually every one of the American Kennel Club Parent Breed clubs listed on the AKC website. Although commercial breeders who sell to pet stores may be regulated by the USDA, the federal animal care standards do not ensure quality, breeding or humane life for dogs.'",
        "'speaker_2': 'For instance, dogs are allowed to be confined to tiny wire bottom cages, only six inches bigger than the dog, 24 hours a day, seven days a week for their entire lives. Forced to breed every cycle without ever being taken out, even for a moment, to stand on solid ground or feel the sun on their backs.'",
        "'speaker_2': 'These are the dogs producing puppies for local pet stores. This kind of substandard breeding often results in unsuspecting buyers purchasing pets with physical, genetic and psychological problems that result in many of them being surrendered to overcrowded shelters when the emotional toll and the vet bills become more than the buyer can manage.'",
        "'speaker_2': 'So this is not just a humane issue. It's a consumer protection issue. Pet stores supplied by mills are not an asset to this community. And yet, while they may profit from the practice of buying puppies and kittens at a low price and then reselling them at a high price, typically without first spaying and neutering them, it is'",
        "'speaker_2': 'the taxpaying public who pays for animal control to house and kill unwanted animals in the community. And yet there is a more humane alternative, which is for those stores to stop supporting the puppy mill industry and transition to an adoption model.'",
        "'speaker_2': 'As thousands of pet stores across the country have already done very successfully. So this proposal would not preclude pet stores from staying in business. It would not impact responsible hobbie breeders who could continue to sell directly to the public.'",
        "'speaker_2': 'And of course, it wouldn't prevent anyone from adopting an animal. And as we've heard, there's no shortage of puppies, purebreds, kittens, and I would also guess rabbits currently looking for homes in the Long Beach area. A retail pet sales ordinance is a reasonable means of preventing an endless supply of poorly bred animals from being imported into the'",
        "'speaker_2': 'city so that consumers are protected and fewer animals will have to suffer in order to supply the retail pet trade and would relieve the burden on shelters and therefore the taxpayers. By getting animals out of those facilities and into retail settings where they have a greater chance of being adopted by the public.'",
        "'speaker_2': 'These ordinances have been a fair, positive and effective measure for the 72 communities that have enacted them 17 right here in California. And it would be a very good thing for Long Beach as well. So I thank you for considering this important reform and for setting a positive example for the rest of the country to follow.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening. My name is Kate Karp, and my address is on record. First of all, I want to thank you council members, but I also want to thank everybody who had input and inspiration and impetus for this resolution, for this hopeful resolution, including Judy Crumpton, Friends of Long Beach Animals, Fix, Long Beach Animal Care Service, and every'",
        "'speaker_2': 'single rescue and trap spay neuter organization in Long Beach that pulls from the shelter and helps reduce animal overcrowding. And also the people who, because of the voucher program in Phenix, Long Beach, have become educated and have fixed their animals.'",
        "'speaker_2': 'I volunteer for friends of Long Beach Animals, which provides vouchers for low cost spay neuter for people who can't otherwise afford it. And I also volunteer with Fix Long Beach, which gives it away for free to the same population.'",
        "'speaker_2': 'And we meet an incredible lot of people who are grateful and lap up the education, the way their pets lap up the water we provide. But there's always a number who, for their own reasons, won't. And I don't want to turn this into a comedy production because some of them are absolutely ridiculous and this has to be'",
        "'speaker_2': 'addressed and it is being addressed. I've had people tell me that passing this law would cause pet owners to turn their dogs into the shelter. And that may be, but that'll be one dog that'll get fixed and possibly adopted out or not, sadly.'",
        "'speaker_2': 'But this is.'",
        "'speaker_4': 'Opposed to.'",
        "'speaker_2': 'Litters and litters that doubtless won't be as for as fortunate. And if that sounds like collateral damage, consider this spay. You would say reports that an underpaid female cat, her mate and all of their offspring produce producing two letters a year can total 11,606,077 cats in nine years and in six years one and spayed female dog and'",
        "'speaker_2': 'her offspring can reproduce 67,000 dogs. It's a shame that we have to legislate responsibility, but we just can't sit there and do nothing. My concerns about this, of course, can concern enforcement. I hope this will you will find the tools to enforce this law.'",
        "'speaker_2': 'And I'm wondering about tweaking the sales law. I'm glad that you excluded the adopt a shop type of stores. But will the dogs bred on premises in Long Beach? Will there be will the number of litters be controlled?'",
        "'speaker_2': 'And I also would want our unaltered cats, no unaltered cat laws enforced. And Suja, thanks for the thumbs up. Humane education in the schools would be great. Friends of Long Beach Animals has such a program and it works.'",
        "'speaker_2': 'I hope Long Beach is a model for the entire state. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hello. My name is Alison Levitt, and I'm speaking to oppose the proposal for mandatory spay neuter. I know this issue can become very emotional for the people involved, and I think that fixed Long.'",
        "'speaker_3': 'Beach is doing a fabulous job already.'",
        "'speaker_2': 'The numbers that they have put forward as far as the improvement rates speak for themselves. So I certainly encourage them to continue what they are working toward. I do think that mandatory spay neuter would not stop irresponsible pet owners.'",
        "'speaker_2': 'I think that the issue in question is enforcing the existing laws. If there is a breeding prohibition in the city, then the people who ignore that are just as likely to ignore spay neuter. The other element that's of concern to me is that spay neuter by four months of age in any animal, while it may be possible'",
        "'speaker_2': 'to do it, does not mean that it's a good idea to do it. There are numerous veterinary reports that it's actually.'",
        "'speaker_3': 'Harmful to the.'",
        "'speaker_2': 'Development of an animal. So I think that that is far too young for any surgery of that type. My other concern is that it's going to be costly to implement. There hasn't been a cost analysis done yet.'",
        "'speaker_3': 'But I, I firmly believe that.'",
        "'speaker_2': 'If the money spent on that were put instead toward expanding the microchip program or furthering the efforts of Fix Long Beach as far as their subsidies for low income pet owners, I think the results would be far more what the city wants to do rather than becoming top heavy with legislation that is either redundant, unenforceable or inappropriate'",
        "'speaker_3': '. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening. Mayor and City Council Members, thank you for considering this very important ordinance. My name is R Mighty May that spelled r m itii last name May and I am a practicing veterinarian. I've been in practice for over nine years.'",
        "'speaker_3': 'I graduated from UC Davis School of Veterinary Medicine in 2005, and I've done thousands of Space Invaders over a number of years, including high volume spay neuter in mobile clinic settings. And it is a highly effective way to not only curb the pet overpopulation crisis, but also improve the health of individual animals.'",
        "'speaker_3': 'I can count on all ten fingers and toes and then have more counting to do to tell you. All the times I've seen female dogs who develop geometry, which is a life threatening infection of the uterus if it's not treated in time, which involves surgery to remove the ovaries and uterus as well as intensive IV fluid and'",
        "'speaker_3': 'antibiotic treatment, it will result in death. And I have seen that. I have also seen female dogs developing mammary cancer because they were not spayed by their first or second heat cycle. And 50% of the cases of mammary cancer in dogs are.'",
        "'speaker_3': 'Metastatic and malignant. So that's basically a death sentence for the dog. It also affects cats. Similarly, in the case of males, I've seen a neutered males who have developed testicular cancer. And I've also seen many cases of dogs who have been hit by cars and almost all the time it's because they're unaltered and they're seeking a female'",
        "'speaker_3': 'in heat. So they jumped the fence. They burst through the gate. Whatever they need to do to get to that animal they're going to do. And if it puts their life in jeopardy, that's what ends up happening. So it's been shown time and again that spaying and neutering not only protects these animals from pregnancy, which leads to'",
        "'speaker_3': ', of course, unwanted animals like the ones pictured here. But it also protects the individual lives of those animals and their health. And I just want to remind you all that each of these animals in this picture and millions of others like them are individuals who matter.'",
        "'speaker_3': 'And I think we all need to keep that in mind. I have also an early age spay neuter and have not observed any adverse health effects from that. And I also want to make sure that feral cats are included in this conversation.'",
        "'speaker_3': 'They deserve attention and care as well. And we need to tackle this problem through trap neuter return. I've volunteered hundreds of hours of my time to spay and neuter feral cats, and it's a highly successful way to keep that under control.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'She's a tough act to follow, so I just want to be brief. I fully support having mandatory spay neuter ordinance and banning the sale of dogs, cats and rabbits for all the reasons stated by the other speakers. Thank you.'",
        "'speaker_1': 'Could you state your name.'",
        "'speaker_0': 'For the president? Can you just give your name for the record?'",
        "'speaker_5': 'It's Eric Deardorff.'",
        "'speaker_0': 'Thank you. Our next speaker, please.'",
        "'speaker_3': 'Hi. My name is Best Riley. I live at 375 Wisconsin Avenue, Long Beach, California, 90814. I came to just make a statement to you. I know you guys appreciate these beautiful show dogs. They're so magnificent. But I want to tell you about my type of dog.'",
        "'speaker_3': 'And it's not in your list. I do competitive herding. I have a border collie and I have an Australian shepherd currently. They're both fixed. I want to have some more dogs. My girl, I spent almost $50,000 on money for herding.'",
        "'speaker_3': 'Okay, I love it. It's my, my love. But when you talk about dogs, you're talking about something that I like. I want to breed my dogs. If I find an excellent breed, I'm not going to be a breeder.'",
        "'speaker_3': 'I'm 65 years old. My chances of doing, you know, becoming a great breeder is really off. But I want the right to breed my dogs if I have a great a great herder, I want the ability to breed those.'",
        "'speaker_3': 'And I understand I mean, I listen to these people. I understand their concerns. I love animals, too. My point is, I I'm I'm concerned that you're kind of cutting my people off because they're not pretty, but they really are pretty.'",
        "'speaker_3': 'If you ever saw them work, they're beautiful. So I just want you to look at this and see if you can make an exception for something like a herding dog. And I don't know about agility dogs. I was just thinking about people do that.'",
        "'speaker_3': 'But I know herding job dogs, it's inbred my border collies. Border collies have been hurting dogs all their life. They were born to herd. If you watched them herd, you understand that's what they want to do. That's what we're they were made to do.'",
        "'speaker_3': 'So I would like you to seriously consider making an exception to that. That's all. Thank you very much for your time.'",
        "'speaker_0': 'Okay. Thank you. Next speaker, please.'",
        "'speaker_2': 'Hi, my name is Stephanie Run is I actually live in Lakewood, but I spend so much time in Long Beach I might as well be living here. I work here, I spend my money here. I come out to eat here.'",
        "'speaker_2': 'I like to play here. So I'm very and then I come out to all the events. But I've been involved in animal rescue for a number of years and follow animal issues very carefully. I have to tell you that this is such a wonderful step that Long Beach is looking at taking in alleviating the pressures of overpopulation'",
        "'speaker_2': 'for animals. And I come from Fresno, and if you want to know really, really, really bad situation as far as animal overpopulation. And there are rings, dogfighting rings and lots and lots of cases of documented animal cruelty. And in the past few years, my family's still there.'",
        "'speaker_2': 'But in the past few years, a number of animal organizations have risen up to try to take care of feral cats who take care of dogs that have been abandoned.'",
        "'speaker_3': 'And in introducing.'",
        "'speaker_2': 'The conversation of how to be a responsible pet owner or guardian and introducing the concept of spay and neuter, that already has had an incredible effect on the conversation in Fresno, where it was such a it was such a foreign concept before.'",
        "'speaker_2': 'So here we are at an apex where language really has the ability to be a model city and other cities are watching. I'll tell you, Fresno is watching, Lakewood's watching. Your surrounding cities are watching.'",
        "'speaker_3': 'And where you.'",
        "'speaker_2': 'Go is going to make it so much easier for us to make a difference in the rest of the state. So please, please, please continue the good work and please get these ordinances in writing. And gosh, you got so many people who are just pushing for this to go through.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Wendy Aragon. I'm a resident of Long Beach and Representative Pet Assistance Foundation. We were founded in 1955.'",
        "'speaker_3': 'To combat the tragic pet overpopulation.'",
        "'speaker_2': 'Problem, and we've been active in Long Beach ever since, referring people to low cost spay and neuter services, education and subsidizing those who cannot afford.'",
        "'speaker_3': 'To alter their pets. We want to commend Councilperson Sudhir Lowenthal for taking steps to draft.'",
        "'speaker_2': 'These two ordinances that are long overdue. Long Beach has taken initial.'",
        "'speaker_3': 'Steps through the 2006 passing of the Breeding or Breeding.'",
        "'speaker_2': 'Control Ordinance, but many of us in the animal welfare community.'",
        "'speaker_3': 'Realized that we needed to take further steps to reduce.'",
        "'speaker_2': 'Euthanasia rates of healthy, adoptable animals and alleviate the animal.'",
        "'speaker_3': 'Suffering that is the direct result of pet overpopulation. The second ordinance.'",
        "'speaker_2': 'Banning of the.'",
        "'speaker_3': 'Sale of rabbits, dogs and cats in pet stores is especially important.'",
        "'speaker_2': 'Because we all know that these businesses are exempt from requiring the spaying and neutering of animals.'",
        "'speaker_3': 'When they are sold. This, I believe, is due to the passage of.'",
        "'speaker_2': 'The law in Sacramento that required the animal welfare organizations to do spaying neutering.'",
        "'speaker_3': 'But the businesses were exempt. Do I believe again to the powerful pet store lobby? Those of us.'",
        "'speaker_2': 'Active in animal.'",
        "'speaker_3': 'Welfare know all.'",
        "'speaker_2': 'Too well the tragic impact of too many unwanted animals, the abandonment, the passing from one bad home to another, the endless stream of kittens often motherless during the kitten season, the endless parade of unwanted.'",
        "'speaker_3': 'Pit bulls in Chihuahua.'",
        "'speaker_2': 'As a small organization, we have to listen to every single day on our hotline. Will you please take my animal? I have to move. I've been evicted or I found a little kitten under the porch. I can't keep it.'",
        "'speaker_2': 'Can you take it? I don't want to take it to the pound because it may be euthanized.'",
        "'speaker_3': 'We hear this over and over, yet we have limited room and limited resources.'",
        "'speaker_2': 'This has a tremendous negative.'",
        "'speaker_3': 'Impact on those of us in this work because we can only do so much.'",
        "'speaker_2': 'We know that many of these animals for whom we cannot intervene will end up in desperate situations.'",
        "'speaker_3': 'Or perhaps if they're lucky.'",
        "'speaker_2': 'In the shelter as a euthanasia statistic. It's tragic to say that, but.'",
        "'speaker_3': 'That's what we have to endure every day. As we've stated before.'",
        "'speaker_2': 'Here many times, we need a synergistic, three pronged approach to this problem, which Long Beach has made great strides in addressing legislation, education and low cost sterilization.'",
        "'speaker_0': 'Thank you. I have to wrap up because a little bit later on. Thank you.'",
        "'speaker_2': 'In closing, we urge you to appeal to the better angels of your nature and deal with the elephant in the living room.'",
        "'speaker_3': 'The moral imperative.'",
        "'speaker_2': 'To deal with pet overpopulation in our city.'",
        "'speaker_3': 'By drafting.'",
        "'speaker_2': 'And ultimately passing these.'",
        "'speaker_0': 'To. Thank you so much.'",
        "'speaker_3': 'Thank you. Good evening.'",
        "'speaker_4': 'My name is Luis Dubi and.'",
        "'speaker_3': 'I have been an animal control officer. I began my career with the city of Long Beach in 1980.'",
        "'speaker_4': 'And the.'",
        "'speaker_3': 'Majority of my career has.'",
        "'speaker_4': 'Been with the city. It's a great city, but mandatory spay and neuter. The time.'",
        "'speaker_3': 'Has come. We need this tool. Our officers are out in the city serving our citizens, addressing complaints.'",
        "'speaker_4': 'And we need this to.'",
        "'speaker_3': 'Address the issue of overpopulation.'",
        "'speaker_4': 'And the issue of people that don't want to spay and neuter their pets. Education and enforcement is our focus. We educate, we offer assistance. But when people do not want to comply, enforcement is necessary. This tool will.'",
        "'speaker_3': 'Be the enforcement we need. As far as.'",
        "'speaker_4': 'People say as they're worried about a mass abandonment of animals. We also need to address the quality of life that we give our pets. And if someone is going to abandon.'",
        "'speaker_3': 'Their animal or dump their animal.'",
        "'speaker_4': 'Because mandatory spay and neuter takes effect.'",
        "'speaker_3': 'They're not the right pet owner. One issue, too, I think is very important. Not only do are we talking about animals here, but we're talking about the.'",
        "'speaker_4': 'Citizens of the city and their safety and public safety. And it's a well-known statistic in my career, in my profession.'",
        "'speaker_3': 'Just for example, in our city.'",
        "'speaker_4': 'Between the months of July, August.'",
        "'speaker_3': 'September and October, we had a total of 196.'",
        "'speaker_4': 'Bites by dogs in our city. Out of that.'",
        "'speaker_3': '196 animals, 131 of.'",
        "'speaker_4': 'Them were unaltered. That's a pretty staggering statistic. The propensity for a dog to bite is lessened if the animal has been.'",
        "'speaker_3': 'Spayed or neutered.'",
        "'speaker_4': 'So helpless. So please take that into consideration with consideration when.'",
        "'speaker_3': 'You're addressing this ordinance. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening. My name is Emily Brewer. And to be respectful of your time, I'll keep it brief with the millions of animals who are euthanized in shelters every year. I feel like we owe it to Rose, who we met earlier, to move forward with the mandatory spay and neuter ordinance.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hi. Good evening. My name is Vicky Yamashita. I'm a 25 year resident of Long Beach, and this mango is my representative. I just came down here because I saw a post on Facebook that said, an organization that I've only sent until tonight only been in contact with through Facebook.'",
        "'speaker_3': 'I needed some support. I've been a long time adopter of animals. I will. I vowed 20 years ago when a friend of mine educated me on the importance of spay neuter and pet overpopulation. The importance of not contributing to the supply chain of any breeders and I have since adopted about five dogs, having two or three at'",
        "'speaker_3': 'a time and taking them through to the end of with a high quality of life. So I'm deeply, personally committed to adopting, but on a daily basis, just my heart breaks and I'm overwhelmed with the stories I hear and just the staggering numbers.'",
        "'speaker_3': 'And I would love to see Long Beach be a model city. I'm so proud of the city that I moved to after coming to Cal State Long Beach in the seventies and would love to be able to be able to have bragging rights that Long Beach lead in efforts like this.'",
        "'speaker_3': 'In one week alone, I learned of three people who had infant puppies.'",
        "'speaker_4': 'One was found.'",
        "'speaker_3': 'Rescued and my friend is actually raising it. It's been quite difficult because it needs to be fed around the clock. Another one was thrown from a moving car and hit some people and fortunately it survived the fall and is being raised by somebody.'",
        "'speaker_3': 'I think they're called bottle babies when they have to be fed around the clock because they're so tiny and they've not been weaned. I don't know the circumstances of the third one, but three instances of puppies being used, thrown like litter and that is all a part of our pet overpopulation problem in the city of Long Beach'",
        "'speaker_3': '. And I would love to see this ordinance passed. I would love to be able to see some of my friends who run adoption, um, excuse me, rescue agencies privately and work tirelessly. They would love to go out of business.'",
        "'speaker_3': 'They'd love to just be able to go get a real job sometime. So thank you very much for your time.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_2': 'Hi. My name is Alicia.'",
        "'speaker_3': 'Johnson and I volunteer for Pet Assistance Foundation and I started volunteering there a month ago. And you see the conditions that the animals are in and how they have no home because there's so many animals out there and why people are breeding and buying animals.'",
        "'speaker_3': 'The innocent animals that are just in shelters and have no home to go to are being put down. And if we make spaying and neutering mandatory, we can save so many innocent lives. Because, you know, if a human has a baby, we don't put them down because there's not a home to go to.'",
        "'speaker_3': 'And I just wanted to say, animals have the same feelings, too. Thank you.'",
        "'speaker_0': 'Thank you. Before before our next speaker, I'm going to close the speakers list here. Unless there's someone else that didn't get a chance to get in line, please get in line. I'm closing the speakers list. So after this gentleman here will be the last.'",
        "'speaker_0': 'We'll be the last speaker in the jacket, please. And you can, sir. You can if you'd like to sit. That's okay. I just want to, sir. So we'll close it after this. Gentleman, please.'",
        "'speaker_3': 'Good evening. My name's Larry Hansen. I'm a 25 plus year resident of Long Beach, also a small business owner, California Canine Services. I oppose this proposed mandatory spay neuter. However, I was delighted to hear that you were considering an amendment for the AKC show Dogs.'",
        "'speaker_3': 'And if you're going to go that route, I would hope that you would consider any national registry. There are some dogs that show work complete that are not AKC registered dogs, but are United Kennel Club, American Dog Breeders Association, APD are several different organizations, also North American Red.'",
        "'speaker_3': 'Association, which a lot of our police dogs come out of that program. Those dogs cannot compete as the breed they are unless they have both testicles. I also think and I can appreciate everything everybody is saying here, none of us in this room, I'm sure, want to see any animal injured, neglected, abused.'",
        "'speaker_3': 'However, I really think that we need to target the owners. You may also want to consider some sort of safe dog program a little different than the American Kennel Club's canine good citizen. There is a video that they watch, a test that they take, and then they do a little demonstration with their dog showing basic behaviors, but'",
        "'speaker_3': 'really trying to educate the owners to target educating the owners a little outreach program like that. Thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_2': 'And hello, my name is Lena Gaiser. I while I'm not a resident of.'",
        "'speaker_3': 'Long Beach on this issue about.'",
        "'speaker_2': 'Spaying and neutering dogs is really important to.'",
        "'speaker_3': 'Me. So I just I'm here to voice my support for the ordinance making banning the spaying and I mean ban.'",
        "'speaker_2': 'Making it mandatory to spay and neuter dogs. And.'",
        "'speaker_3': 'You know, because I feel that animals, while they are not human beings, they still deserve a lot more.'",
        "'speaker_2': 'Respect than they're being given at the moment.'",
        "'speaker_3': 'Being put to sleep by these numbers that have been discussed. And it's really sad. And I think that we we need to be doing more about it. So thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Anna Wong with Stray Cat Alliance as well as being a resident of Long Beach. And I want to commend the Council for bringing forth this ordinance for the pet shops. We enthusiastically support this and thank Julie Crumpton for her tireless work and moving forward for the Long Beach Animals.'",
        "'speaker_3': 'I would encourage all of you to consider strongly wherever you go with this mandatory spay and neuter that you please add on mandatory microchips. I run many, many community cat programs within our Long Beach area and contract cities.'",
        "'speaker_3': 'We microchip every single one of our feral cat and community cats that are released. This protects them when they end up back in the shelter from multiple trappings. It protects their lives. It protects their their livelihood. We are able to assess when a cat gets retract the health and condition of that cat in that colony.'",
        "'speaker_3': 'This also stands true for owned animals as well. It's a really great way to protect the animals of Long Beach. And I would encourage you, please, please, please consider the microchip issue.'",
        "'speaker_0': 'Thank you. Next speaker, please, sir. Final speaker.'",
        "'speaker_10': 'Thank you. My name is Jack Smith, and I'm the president of the Long Beach Kennel Club and also the great Western Terriers location that has conducted dog shows in the city of Long Beach since well before 1970s. I think we were the first Kennel Club to hold our shows in the Convention Center in 1973.'",
        "'speaker_10': 'I really, first of all, want to thank Councilman Councilwoman Lowenthal for the amendment. I came here to speak to the issues that she just amended. And so therefore, I really don't have a lot to say. But thank you.'",
        "'speaker_10': 'But I would like to say, because I've heard all these speakers and and I'd like to have a comment on it other than being the president of dog shows, because I enjoy the sport of dogs. I enjoy breeding dogs.'",
        "'speaker_10': 'I was also I'm also a retired captain of police for the Los Angeles Police Department. I was the chief of police for the city of El Cajon, and I was the assistant sheriff for the county of San Diego.'",
        "'speaker_10': 'So I've had a lot of experience and working with kennels. I've had a lot of experience in working with pounds. I used to manage one when I was in El Cajon. And everything that you've heard here tonight regarding the the heart break of going into the kennels and seeing the euthanasia scene, the the dogs that are abandoned'",
        "'speaker_10': ', it's always been a heartbreak to me and been working with the council here. I have to say that when we put this ordinance together, the one that's existed now about nine years ago, the idea was to create a model ordinance that would allow the care of dogs that do need to be cared for, but at the same'",
        "'speaker_10': 'time allow the sport of dogs and the breeding the purebred dogs to continue to help to have them both. And what we realized was that while the AKC, I think, is probably one of the best registered registries in the country for purebred dogs, there are many others that don't offer the same advantages that the AKC does.'",
        "'speaker_10': 'And so in the ordinance you'll see that it talks about the fact that if we're going to. If we're going to allow dogs to be bred in the city of Long Beach, that the registry that they're registered with has to offer certain things, which includes rescue, it includes genetic testing, that includes training to be a responsible dog'",
        "'speaker_10': 'owner and things such as that, so that we have a combination of both that we have the AKC really working together with the people that are here today to try and create the best world we can for our dogs.'",
        "'speaker_10': 'And I think I think the council and I think these people that we look forward to working together with you in the future. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_2': 'I have to think of Vice Mayor Lowenthal. I know it's been a long time coming. Also. Judy Crumpton. I see Kate, April, Claudia, all of you, the great work that you've been doing on this. I have to commend you because I know how passionate you you all are.'",
        "'speaker_2': 'We've had many discussions on this, but thank you, Vice Mayor Lowenthal, for really leading this effort. And just wanted to say my thanks and it's certainly needed. I know that in the First District we have such an amazing amount of dog owners that are responsible, but yet we have another handful that are not very responsible.'",
        "'speaker_2': 'And that I think that this ordinance would certainly do something to achieve, you know, under puppies, under populating, if that's even possible.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And I wanted to thank everyone that came out to speak on this issue and the proposed ordinance. And I've taken copious notes with most of the comments that have been made. And I want to thank Jack and his wife for being here as well.'",
        "'speaker_7': 'Since Jack spoke last, I do want to ask I want to ask our staff to be sure. It's probably the last paragraph of the second to the last paragraph of our item, asking for staff to consult with other cities and other resources and putting this together.'",
        "'speaker_7': 'We aren't the first to do this. That's the beauty of it. That's the extreme beauty of being in this position is we're not the first. And so we can certainly learn from the cities that have been mentioned here earlier, learn from the best practices that Mr. Smith has highlighted.'",
        "'speaker_7': 'And I think there's an effort that can be made to bring all of those together so that we make a proposal that makes sense for our city. And all cities think that their unique we really are unique. So I, I firmly believe that I take comfort in it.'",
        "'speaker_7': 'And, and I think our staff knows that. And if I can judge based on everything that our animal care staff has done in these last seven years, moving toward good policy on the various items they've worked on, I know that they've looked at best practices elsewhere.'",
        "'speaker_7': 'So I'm confident and I, I know that you both will be open to working with our team as well. And I look to our staff to call on you for that advice, that expert advice on how to draft something that's responsible for us.'",
        "'speaker_7': 'There was an issue raised about enforcement. I know Councilmember Mongeau will address that. But just to staff, I would like Mr. Stevens or or our director of Parks, Recreation and Marine to highlight how our canvassers work at this moment.'",
        "'speaker_7': 'Could you do that for us?'",
        "'speaker_5': 'I'll let Mr. Stevens talk about that.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_8': 'George.'",
        "'speaker_9': 'Yeah. So our canvasing program, our. Our staff will go into the neighborhoods. They'll they'll run reports for the animals that are either currently licensed or delinquent their licenses. So they'll basically canvass, walk neighborhoods and look for unlicensed, unregistered animals.'",
        "'speaker_9': 'They'll make contact, educate. It's not about enforcement, writing citations, grabbing money from people. It's about educating, getting people in compliance, rabies shots. And so this is just one more one more tool that we just we'll just add in there with, along with the rabies and licensing.'",
        "'speaker_9': 'It's just checking for spay and neuter so we don't look at it to be too difficult.'",
        "'speaker_7': 'Thank you. Mr. Stevens, I also wanted to ask you about the cost to implement. While the item does not highlight an impact or a fiscal impact, that there's no fiscal impact to developing the item. But certainly we're very realistic that there will be an impact to the cost for public outreach, additional low cost, spay neuter vouchers and'",
        "'speaker_7': 'enforcement. But we're hopeful that the city manager, as the item calls for, will also find revenue opportunities to pay for these increased services. There were so many things that we do today with animal care that seven, six years ago we didn't think we could afford we never thought we could afford a veterinarian, but we prioritized it and'",
        "'speaker_7': 'realized with a cost savings to the city. So I think when we look at that cost benefit analysis to be able to add resources to this additional effort, we will realize that there will be a lot of cost savings.'",
        "'speaker_7': 'And so in that report that comes back in the recommendation that comes back, we will look to staff to highlight those differences. What are the costs and then what are the savings? And then finally, I wanted to also mention there.'",
        "'speaker_3': 'Was.'",
        "'speaker_7': 'There was a resident that spoke about breeding for hurting animals. If I could get this correct. There you are. Thank you. And. I'd like staff to address how that can. That possibility already exists today. She can get a permit to do so.'",
        "'speaker_7': 'Correct, Mr. Stephens?'",
        "'speaker_9': 'Yes. Currently she could buy a breeding permit.'",
        "'speaker_7': 'And I understand that you indicated you don't want to be a breeder, but our definition of breeding isn't. I think what the commercial definition might be, it's not so much about breeding for sale, but for what you describe.'",
        "'speaker_7': 'You already have that ability to do that here, and so this does not prohibit you from doing that. I want you to rest assure and I know that there's a section of folks that might feel the same way.'",
        "'speaker_7': 'And I wanted you to be sure that that this did not impact your ability to do that. There was mention made of feral cats, and that is a very serious problem. And I want to thank the the constituent that came up and spoke about her work in that area unaltered.'",
        "'speaker_7': 'Feral cats do roam our neighborhoods in far greater number than stray dogs to. It is a bigger problem certainly and trap spay neuter and release programs. They do play a very important role in controlling this population. I do think it's worth noting some of the success that we've had.'",
        "'speaker_7': 'So that's the tragedy with the success that we've had, is that 80% of owned cats are spayed or neutered. And that's to the great work that you've done, great work that staff has done. So we have to celebrate that.'",
        "'speaker_7': 'We have a long way to go. But in combination with the volunteers that are helping, along with our staff, I think we are getting there. I will ask staff to consider if there is an opportunity to address the feral cat population through this effort.'",
        "'speaker_7': 'And if you don't have a response today, that's okay. But I would hope that you would consider that because it is a big problem and perhaps that will be our seventh or eighth installment in this overarching policy over these last several years.'",
        "'speaker_7': 'But we recognize it's an important issue. Mr. Stevens Did you want to address that at all tonight?'",
        "'speaker_5': 'Vice Mayor Yeah, I think Ted can address that. We do have a similar program.'",
        "'speaker_9': 'Yeah. Well, first of all, I would just mention that we already have mandatory spay neuter for cats, so we already have that. We have cat licensing and rabies for cats. We I know for at least the last couple of years that I've that I've been over animal care services.'",
        "'speaker_9': 'I have done everything I can to support TNR groups that are out there, some of them out there I see their today and I'm sure they would agree that I support a lot of them through assistance with spay neuter vouchers and things like that, helping to get animals fixed.'",
        "'speaker_9': 'We help have normal, everyday residents that contact me and want to tnr their own neighborhood. I help them with that. We and we've been doing this for probably a couple about two years now. I've been supporting a lot of these groups are helping these groups with their work.'",
        "'speaker_9': 'In addition, recently, earlier this year, we started a community cat shelter neuter return program, also addressing community cats and trying to limit the number of litters that are born in the community through to feral cats. So it's definitely something we've been working very diligently on for the last few years.'",
        "'speaker_7': 'Thank you. I appreciate that. Councilmember Mongo.'",
        "'speaker_3': 'I want to thank everyone here who has brought this issue up for years. I've known many of you since my time with L.A. County Animal Services several years ago, back when Long Beach and L.A. County partnered to grow the CANVASING program here in Long Beach.'",
        "'speaker_3': 'Spay verification is done through providing your certificate of spay when you license your animal. So as our wonderful director, Ted Stevens mentioned the verification, the canvassers that are in the field are canvasing for a license. And then upon getting your license, you would then provide the verification of the spay and neuter.'",
        "'speaker_3': 'So there will be no flipping dogs in public will be okay about that. I am passionate about many animal issues, but working hand in hand with our supervisors in our puppy mill ban in L.A. County is a step.'",
        "'speaker_3': 'But as we talked about, it's really the demand for animals that continues the import of puppy mill pets into our cities. And so what we hope will happen is that our local certified AKC breeders will be a resource, and our cute little puppies like Rose, who is here today, will come from our shelters into our pet shops'",
        "'speaker_3': '. So I look forward to hearing about the partnership between pet shops in the city. I think that this is also an opportunity to lower the cost of inventory for those businesses because they'll be partnering with us and we'll also be lowering the costs of our shelter for providing care and euthanasia.'",
        "'speaker_3': 'Those animals will get to be in the pet shops loved by the pet shop administrators, and additionally, I'm supportive of another friendly amendment. I know we talked about the earlier friendly amendment, but of competitive herding and other types of animals specifically.'",
        "'speaker_3': 'The word breeding permit is often confusing to consumers. And so whether we call it another classification, so that if your animal is deemed to be a champion in herding or any of the other animal areas, that they would have that later option to breed, working that end would be encouraged.'",
        "'speaker_3': 'So thank you to Jack and to Judy and to all of you that I see at the dog park regularly. Thank you for your continued commitment to our fixing animals and our trap neuter release. Those are all components of getting to where we've all said we were going, which is one of the friendliest cities in America for'",
        "'speaker_3': 'animals.'",
        "'speaker_7': 'Councilmember Austin.'",
        "'speaker_9': 'Thank you. And before I start, I want to salute all of the the caregivers and the volunteers, the folks who are working so hard to deal with our overpopulation of our animals. You guys all have great hearts, and I appreciate you being here.'",
        "'speaker_9': 'I. This is policy work. And so I'm going to to ask a few critical questions, if you may ask. And, you know, it was interesting in the the write up for for this particular agenda item. It said dogs, cats and rabbits.'",
        "'speaker_9': 'And I haven't heard anything about rabbits here this evening. I have a question, a few questions for staff. When was the last ordinance around done toward this this matter? I know that there was an audit is done a few years ago that increased fees for for dogs and unaltered dogs and cats.'",
        "'speaker_9': 'When was that ordinance done? Then increasingly this was for increasing the fees for unaltered animals. We have not increased the fees since I've been there and I started in January of 2012. Okay. I believe it was 2009. What about Councilmember Lowenthal?'",
        "'speaker_9': 'I believe you were signature to that particular item. Right. And I'm curious to know what sort of performance between since 2009 have we experienced in terms of dog registration and the the the reduction in terms of unaltered pets?'",
        "'speaker_9': 'Is there any data to show performance over that period of time?'",
        "'speaker_5': 'Councilmember, if you're asking what our data is in terms of unregistered.'",
        "'speaker_9': 'Well, let me let me.'",
        "'speaker_5': 'Record on all three dogs registered.'",
        "'speaker_9': 'What sort of data do we have to show progress, if any, to reducing overpopulation of animals in the city of Long Beach since that ordinance was was enacted?'",
        "'speaker_8': 'Good.'",
        "'speaker_9': 'We have seen I know since the cat an ordinance ordinances were passed the cat licensing and mandatory spay neuter for cats has passed. We have seen a significant decline every year in our cat in pounds and our cat euthanasia.'",
        "'speaker_9': 'And I know our dog euthanasia is in dog in pounds have been were pretty steady for several years. But just recently since the voucher program was started, we've seen a steady decline in dog euthanasia, in dog in pounds.'",
        "'speaker_9': 'And since fixed Long Beach has started the actual which was in June of last year I believe Korea we've seen significant declines in pounds and euthanasia of dogs but especially the pounds dogs. It was pretty significant when I ran the numbers after fixed Long Beach started for the year after they started compared to the previous year, it'",
        "'speaker_9': 'was a significant drop in euthanasia and in pounds. Okay, so how many households currently have registered dogs in the city of Long Beach? Number of households that currently have registered dogs is kind of fluctuates, but it's around 30,000.'",
        "'speaker_9': 'Okay. And they can have multiple dogs and they could have multiple dogs. Yeah. So that's that's unique. When we ran it, we did it by unique addresses. So that's not the number of licenses. That was the number of households that house not licenses.'",
        "'speaker_9': 'Yeah, licenses is a little bit more it's closer.'",
        "'speaker_5': 'To like.'",
        "'speaker_9': '36,000 or 38,000. Well, totally more. Almost 40,000 somewhere in there, 35 to 40000. And so it's so there's 35 with 40,000 households with licenses, right? Some of them are expired, but yes. So how many total households do we have with with dogs?'",
        "'speaker_9': 'With dogs. The estimate, based on federal statistic models, we would estimate that there's roughly 62,000 households with dogs. And about a population of about 100,000 dogs would be that's an estimate based on models from the Department of Finance.'",
        "'speaker_9': 'And of that 100,000 dogs, how many are registered? Current licenses, I believe, is a little over 30,000. There are about 10,000 expired licenses. So somewhere in there. So one third of our the dogs in the city of Long Beach are registered.'",
        "'speaker_9': 'Yes, that's correct. And what are we doing to enforce registration right now other than the CANVASING program? The CANVASING program is our main method of enforcement. Okay. How many? Uno. Uno. Two dogs are registered in the city today.'",
        "'speaker_9': 'Current licenses are about 3000. Okay, I'm in listening to this. I mean, this is this is compelling. And all of the public testimony that has come before us, I believe, is extremely compelling. And I support. Voluntary spay and neuter neutering of our dogs and cats.'",
        "'speaker_9': 'I think we have an enforcement problem, and that's really where I'm having a heartburn with with this this protest that this proposed ordinance. With all due respect, I know Councilmember Lowenthal has worked and is very passionate about this.'",
        "'speaker_9': 'And, I mean, I commend us for bringing this forward for conversation. But if we're talking about 100,000 dogs and we have a third of them are actually registered. We have an enforcement issue in terms of registering our pets.'",
        "'speaker_9': 'If we're going to move towards a mandatory spay and neuter program here in the city. What what? I'm not too confident that we have the resources to to enforce that. And I would love for you to tell me otherwise.'",
        "'speaker_9': 'Well, I can say that our CANVASING program is still relatively new. It's only been a few years in existence since 2010. We've increased by over 10,000 licenses overall in the city. And so it's we haven't actually a higher compliance rate than most cities as far as licensing goes up very much, very high.'",
        "'speaker_9': 'And now it's not as high as obviously we'd like it to be, but we are higher than most cities in the state. And I would say that this is going to be every year we add more and more licenses to our database and more and more we get higher compliance rates every year.'",
        "'speaker_9': 'And this is I don't think anyone believes that this is going to make a difference overnight, but we feel like that over time the enforcement will come, more and more people will be educated, more and more people will come into compliance.'",
        "'speaker_9': 'And this is this is a long term thing as we've increased our licenses over the years, will increase compliance. Well, in a lot of respect, I mean, I think that's what we're doing now. I mean, I think we're moving in the right direction with the current policy.'",
        "'speaker_9': 'And, you know, I may be in the minority here, but, you know, I want to be consistent. If we're going to push forward with policy, it needs to be enforceable policy. The thank you.'",
        "'speaker_3': 'In.'",
        "'speaker_9': 'I'm curious to know how many pet stores currently are selling puppies in the city of Long Beach. To my knowledge, one. Okay. So we're putting together a policy that that is restricting the sale of pets in the city of Long Beach, which will impact at least one one store.'",
        "'speaker_9': 'And that's good. I support that that component of this this ordinance, a proposed ordinance. And I've done a little bit of research and research about many poultry, spay and neuter policies in other cities. And I've noticed that that several cities have not produced the desired results because of the lack of enforceability and.'",
        "'speaker_9': 'And in many respects, it has created a situation where where pet owners have actually promoted irresponsibility, where pet owners are not taking their pets to the vet. Pet owners are not registering their pets. And they are they're essentially going underground in response to local policy that that that concerns me.'",
        "'speaker_9': 'And I don't want to see the progress that the city of Long Beach has made over the last several years in reducing pet overpopulation turned around as a result of that. And so I have some real, real concerns here.'",
        "'speaker_9': 'I think, Councilmember Longo, you you offered I think you began to offer a friendly amendment which recognizes the other types of dogs other than AKC dogs. There are there are other dogs that that are bred for agility and competition and agility, fly balls, obedience training, working dogs, herding police work.'",
        "'speaker_9': 'We don't even touch that. Does that mean that we're going to fix our police dogs, arson detection and customs dogs? I think this issue is a lot more broader than than what is before us here today. And I would love to have a lot more time, a little more more time to massage this this issue, if possible'",
        "'speaker_9': '. Again, I know that I'm not speaking in in favor or I'm not championing the issue the way that many of the people who came before us to speak see this. But again, this is policy work. Councilmember Lowenthal, you mentioned another point that I want to raise is the impact to the budget.'",
        "'speaker_9': 'This is an unknown, complete unknown. We don't know how much this is going to cost at all. You know, and to really do this right, I think we're going to have to really commit real resources to doing this, a robust CANVASING program so that our Animal Services Department actually has teeth.'",
        "'speaker_9': 'Again, one third of the pets in the city are registered. That's a real problem. So I'll reserve my comments and thank you for dodging me.'",
        "'speaker_8': 'Okay.'",
        "'speaker_0': 'Jump. Councilmember Price.'",
        "'speaker_2': 'Thank you. I first of all, I want to thank Vice Mayor Lowenthal for bringing this forward. I know this is something that she's worked diligently on for years, and I am learning a lot about the process through hearing the public speak tonight.'",
        "'speaker_2': 'And I think a lot of good questions have been raised. I did want to ask staff just a few questions before we go further with this, and that is.'",
        "'speaker_3': 'Why is staff.'",
        "'speaker_2': 'In favor of this proposed ordinance or would they be.'",
        "'speaker_5': 'Councilman. I believe it would help us in the long run to reduce the number of euthanised pets.'",
        "'speaker_2': 'Councilman Austin raises a good point about fiscal impact. And as I indicated just last week, I don't think it's prudent for us to adopt any agreements or legislation when staff is telling us outright that they don't know what the fiscal impact is going to be.'",
        "'speaker_2': 'My understanding of this item is that staff is going to do a fiscal impact study before we as a body direct you to go out and do anything. Is that accurate?'",
        "'speaker_8': 'That's that's accurate, councilwoman.'",
        "'speaker_2': 'In terms of our current policies, we talked a lot about breeding and the limitations on breeding. Could you please describe for me what our current breeding license policy or requirements what they are?'",
        "'speaker_5': 'Yeah.'",
        "'speaker_9': 'I'll try to keep it brief, but.'",
        "'speaker_0': 'Basically someone who.'",
        "'speaker_9': 'Can apply to get a breeder's permit. There is a background check done on them to make sure they haven't violated any any laws like animal cruelty and things like that. They they would pay for the permit. And then, like I said, it is in the batch.'",
        "'speaker_9': 'There's a lot of restrictions. The the breeding animals, they have to show paperwork showing that they're not related, like in, you know, incest type situations. They have to show that the animal's healthy. There's age restrictions. I believe it's 2 to 7 years old.'",
        "'speaker_9': 'They can only have one litter per year. So they have to be said that be microchipped. So there's just a there's a lot of restrictions on what they can and can't do as far as breeding their animal.'",
        "'speaker_2': 'I've received several emails in regards to this item, mostly in support, but a couple of the comments that I've heard and we heard from some of the members of the public tonight was about them wanting to breed. Is there anything that prevents someone who wants to breed for for applying for a license, for example.'",
        "'speaker_9': 'Currently, right now, no.'",
        "'speaker_2': 'Okay. And how would that change, if at all.'",
        "'speaker_9': 'Depending on what you guys would approve? Depends what exclusions are approved, if they're, you know, AKC certified or competition animals. Animals like that. But I think you just you're every day random animal. I don't I don't know what kind of exclusions we would come up for that, but we could look into it.'",
        "'speaker_2': 'Now, in terms of some of the direction you've received this evening as a result of what council members have stated in public, do you feel like you have enough in terms of coming back with a recommendation on what exclusions might apply?'",
        "'speaker_5': 'I believe we do. Councilwoman.'",
        "'speaker_2': 'We talked a lot about enforcement and I think Councilman Austin makes some good points. What are the short term and perhaps even long term plans that you have as a department in terms of enforcement and education in regards to this particular policy?'",
        "'speaker_9': 'Well, you've seen some of the posters that some of my volunteers and I have already kind of started working on the campaign. Obviously, those posters currently don't talk about being mandatory, so that would change the posters. But I think we could look at some educational outreach to the schools.'",
        "'speaker_9': 'We could look at social media. We can look at print media, you know, do as much outreach as we can, busses. And most of it is going to be I think we're going to look at our enforcement is mostly going to start with probably animals coming to the shelter.'",
        "'speaker_9': 'Those are just people that we interact with every day and educating them. And I believe that we want to be more towards the education part of it and compliance and not a heavy handed type of citation compliance. I don't think that's what we're looking for.'",
        "'speaker_9': 'We're looking for educational compliance.'",
        "'speaker_2': 'And I would say, personally speaking, I think that would be the right place to have the focus in terms of this kind of policy. Currently, what if an animal is adopted? Are they do you do any spaying and neutering before the animal is relinquished?'",
        "'speaker_9': 'Yes. State law requires that animals that are adopted are spayed or neutered.'",
        "'speaker_2': 'And that's.'",
        "'speaker_5': 'And microchipped. Any any animal that leaves the shelter in.'",
        "'speaker_9': 'Long Beach has to be microchipped.'",
        "'speaker_2': 'Okay. And that's what I did not know. Okay. Spayed or neutered as well. Correct.'",
        "'speaker_9': 'Animals that are adopted have to be spayed or neutered. Animals that are redeemed by their owners currently do not have to be spayed or neutered.'",
        "'speaker_2': 'But they do have to be microchipped.'",
        "'speaker_9': 'They do have to be microchipped, yes.'",
        "'speaker_2': 'In terms of enforcement of illegal breeding. I'm assuming that happens now. What can you tell us a little bit about how you enforce illegal breeding allegations or complaints?'",
        "'speaker_9': 'Well, currently now it's it's mostly complaint driven. And one of the problems with it is there has to be a litter of puppies before we can actually enforce it. So the babies are already born at that point will issue the citation.'",
        "'speaker_9': 'We will require that the animals are given to a nonprofit rescue organization or were relinquished to the shelter. We do not allow them to buy a breeding permit after the fact and then sell the puppies. To answer your.'",
        "'speaker_2': 'Question, it did. Thank you. Thank you. I have no from a question. No more questions.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman Mongo.'",
        "'speaker_3': 'I do want to make another statement about how we as council members receive comments. I know that so many of you have come here today, and we appreciate your time and your comment. I'd also like you to know that while these discussions go on and in advance of the meeting, each of us as council members on our'",
        "'speaker_3': 'iPads have access to anyone who submitted their comments in advance. Those show up on our agendas and we're able to look at the specific dialog and verbage. So oftentimes if you are choosing between coming personally to council or making a comment in advance online, I would strongly recommend you consider making the comment in advance because it's a'",
        "'speaker_3': 'part of our record that we can continue to reference during the dialog. So consider that in the future and in reading some of these. I also wanted to ask a quick question. Director Stevens, would you be able to tell us what our return to owner number of animals were released in our prior year for dogs?'",
        "'speaker_3': 'Yes.'",
        "'speaker_9': 'It's roughly 26%.'",
        "'speaker_3': '26%. And what was our live animal release last year?'",
        "'speaker_9': '75% for dogs.'",
        "'speaker_3': 'What was our live animal count? I'm trying to count the number.'",
        "'speaker_9': 'Of dog or the number of the number of our tails.'",
        "'speaker_8': 'If I had the number of pounds.'",
        "'speaker_9': 'Was roughly 4200. So 26% of that.'",
        "'speaker_3': 'Okay. So under this ordinance, would you believe that autos would be required to spay and neuter despite where they lived, whether it was Long Beach or an adjacent city or a contract city?'",
        "'speaker_9': 'It would. We would only enforce it on Long Beach residents and some of them in Long Beach.'",
        "'speaker_3': 'Or Animals Court in Long Beach. I should be. I believe that we are in. And if I could make.'",
        "'speaker_9': 'Sure we're all in on that right.'",
        "'speaker_3': 'Now. Okay. As an L.A. County animal shelter, we required all animals released from our shelters to be if it was impounded in the city, if it is impounded in an unincorporated area or a city that has a mandatory spay neuter ordinance, we would require that pet owner to spay and neuter other animal unless they had an age'",
        "'speaker_3': 'exemption or a medical exemption or an AKC or breeder exemption. So I just wanted to put that into your thought process for writing the ordinance. I also wanted to make some comments. Well, we have a few pet stores.'",
        "'speaker_3': 'We have a few pet stores, but only one that currently sells dogs. Is that correct?'",
        "'speaker_9': 'Yes, we do have one pet store that takes cats from our shelter, which would be legal in the new ordinance. And they do adopt cats.'",
        "'speaker_5': 'From pet.'",
        "'speaker_3': 'Shelter. And are there any other pet stores that don't sell dogs or cats, but they may sell hamsters, rabbits and all the others?'",
        "'speaker_9': 'I don't know of any that sell rabbits. I know there are some that have rabbits from rescue groups, so they would be okay. And there are a lot of pet stores that do adoptions.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_9': 'Through rescue groups.'",
        "'speaker_3': 'Absolutely. And so under this ordinance, the sale of those animals would be spayed or neutered. An example would be a current pet shop that is not actually a pet shop, but as a pet store would be PetSmart. And PetSmart currently brings in animals from all different types of rescues.'",
        "'speaker_3': 'And under this ordinance, would those animals be required to be spayed or neutered before sale?'",
        "'speaker_9': 'Yes, the rescue groups are required to spay and neuter before they adopt them.'",
        "'speaker_3': 'Perfect. When we talk about lack of enforceability, I just want to say and once again commend the city of Long Beach, because our enforcement rate is so much better than it was six years ago and significantly better than a majority of the cities.'",
        "'speaker_3': 'Also with the number of pets that are unregistered as a comparison to other cities. A lot of it has to do with each city's ability to contract for services with the County of Los Angeles. Because the County of Los Angeles is canvasing unit is scheduled years in advance.'",
        "'speaker_3': 'And so even cities who know they have low compliance, they do not have the resources and they have not been put on the schedule in enough time in advance to increase their compliance rate. And so having that in-house is a remarkable program, and I commend you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Just a few follow up items. I know that Councilmember Austin raised some good issues regarding cost and outreach and enforcement and what responsible pet owners will do. And I think the last item were the theme last themed item was probably equity.'",
        "'speaker_7': 'On the cost piece, we the item is asking for staff to come back with what the costs would be, but just on canvassers alone. The activity that the canvassers do pay for them. They pay for themselves. And it's distasteful to say it, of course, but that is the reality of it.'",
        "'speaker_7': 'We have enough in order to be able to do that. Their canvasing work results in being able to pay for greater activity. When and I'm not sure if it was heard earlier, but I did address the constituent that came forward about the hurting dogs and and other types of dogs that people would like to breed.'",
        "'speaker_7': 'I think staff has been instructed to look at that when they come back with their recommendations. And I know the staff is clear that they are going to look at that and make a recommendation that's appropriate for our city.'",
        "'speaker_7': 'So that is not excluded. But we are giving staff the latitude and the flexibility to be able to do that. I've heard from some comments. Councilmember Mongo indicated that we do get lots of emails as well. And so in addition to everyone that's come today, there are quite a few individuals who aren't able to make it and'",
        "'speaker_7': 'we value their their comment and input just as much. And we also have to think through policy for those who aren't able to comment at all or make their make their opinions known. But a couple of times we've heard that this may drive people to drive responsible pet owners to go underground.'",
        "'speaker_7': 'If one is a responsible pet owner, I don't think you go underground. It just that those two don't quite comport in the same sentence. And so. What I do believe will happen is those that don't abide by ethics or whatever guides you toward pet responsibility.'",
        "'speaker_7': 'They will try to find other ways to avoid enforcement. That's a human behavior. I don't know that we can legislate our way out of that, but we do the best that we can. And so I don't want to leave that out there hanging that somehow responsible pet owners will go underground.'",
        "'speaker_7': 'I don't believe that to be the case with outreach. I know Mr. Stevens addressed outreach as well as Mr. Chapman did. We are asking staff to come back with a pretty robust outreach effort. We know that outreach has worked for us in these last several years.'",
        "'speaker_7': 'That's why Mr. Stevens is able to report the numbers and the decline that he has mentioned. A lot of it is outreach. People do want to be good pet owners. I, I believe that that they do want to be and need to know how they can be and need to have the resources to do so.'",
        "'speaker_7': 'On the equity issue, I just wanted to mention that this item actually does address equity. We made manage we made it mandatory to spay and neuter cats. And now to bring plus you now to now to bring dogs into that same requirement is an equity issue.'",
        "'speaker_7': 'It is mandatory to spay spay and neuter cats right now. And so to leave that as unaddressed with dogs, I think is an unequal treatment in our public policy. And so I'm confident that that is equitable. And with that council members, I ask you to support this item.'",
        "'speaker_7': 'This isn't something that's come overnight. We've been working on it for nearly a decade, leading our way to this point, proving with every step that we have taken, every installment that we have made toward good animal care policy, that this is the next step for Long Beach.'",
        "'speaker_7': 'You have heard our animal enforcement officer who's here on her off time indicate that this would help tremendously. We need to support our staff. We need to support our residents and we need to support our volunteers. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. I think this has been one of the most interesting nights since my tenure on the city council. We've had a music video. We've had some very interesting quotes that I don't think I'll ever hear again coming from some of this public testimony.'",
        "'speaker_10': 'I got to rescues Rocky and Kizzee very proud of those dogs. So I wanted to shout them out at home. And and so I want to. Vice Mayor Lowenthal mentioned something just a moment ago. She mentioned the person who came to testify on her off time.'",
        "'speaker_10': 'And I thought that was that was really compelling for me. I mean, people who work in our shelters, they don't do it because they want to euthanize animals. They do it because they love animals. That's why they work in our shelters.'",
        "'speaker_10': 'So that said, I mean, I had a I was able to work with L.A. County shelter workers for a number of years when I represented them in L.A. County. And I just would you know, I would just say that long be should strive to be, you know, the leader in the state on this issue.'",
        "'speaker_10': 'That said, I mean, I do think this was a lot of discussion. I think the public's been educated to to a great degree tonight on the intricacies of breeding and herding and so on and so forth. So I think this discussion has been reasonable.'",
        "'speaker_10': 'I think our vice mayor has taken and wrangled a lot of the comments and formed that into a motion that I will be able to support tonight. And I think that I am interested in seeing the finer details in this ordinance.'",
        "'speaker_10': 'I think it does stop short of an issue that, in my opinion, we should be talking about, which is really like a real definition of responsible owners. I think if if we cut a deal and someone gets a permit under a rule that one pet, you know, one pet is spayed and the other one is not neutered'",
        "'speaker_10': '. I mean, one is not neutered. Another one is spayed. They can't meet. Right. And so they built a plan for their pet around that and then we change it on them. I think that's what I don't want. We can't I don't want to call them irresponsible.'",
        "'speaker_10': 'I think irresponsible is the people who have the aggressive dog who they can't keep control of, who gets out and attacks the old lady in the neighborhood. And I think that's an issue. I've had a conversation with our staff about figuring out like how we identify and track dogs that constantly get out.'",
        "'speaker_10': 'They're not always they're not always pit bulls either. I've been beat on the ankles by Chihuahuas too many times, and I am upset about this. So what I'm saying is I think we need to like this stopped short of a discussion that a lot of people are concerned about, these dogs that just constantly get out.'",
        "'speaker_10': 'If we want to create this culture of responsibility, we got to be able to call out irresponsible pet owners. And I don't think this I don't I think we just got to be careful who we're calling irresponsible. I just think we should say that.'",
        "'speaker_10': 'That said, a lot of discussion. I call for the question.'",
        "'speaker_0': 'Okay. There there are two other speakers. The question has been called in by 1/2. Anybody wants to second the call for the question by Councilmember Austin and Andrews and they're going to go to a vote.'",
        "'speaker_9': 'Thank you very much, Mr. Mayor, and I do appreciate the debate and comments. And I had to ask the questions that were were in my mind just for a point of information. I, I worked with the veterinarians in the city of Los Angeles when this issue was hot and heavy a few years ago.'",
        "'speaker_9': 'And it wasn't pleasant. And many of the veterinarians questioned the mandatory spay neuter policies as well. And so I'm not coming to this as completely ignorant. You know, I've kind of walked this through this policy once before. And again, I'm not sure that the policy is necessarily performing the way they envisioned it in the city of Los'",
        "'speaker_9': 'Angeles either. And so to say that we are leading the state on this issue is is a little misleading because we're kind of behind the curve. Secondly, I wanted to just make sure you knew that last last year when at the end of the budget cycle, when I had a surplus of resources from my district office budget'",
        "'speaker_9': ', I allocated it to animal care services for for spay neuter programs and I think actually benefited from that. So thank you very much for your work in my district and Councilmember Lowenthal. I do. I'm going to vote in support of this because I recognize that we will this this issue will come back before us and we will'",
        "'speaker_9': 'be able to massage some of the finer details of this. And with that, I'm going to also support and ask that you really and this council really look at putting forth a robust canvasing and outreach program. And you mentioned that.'",
        "'speaker_9': 'But I want it to be more than words. I want to serious resources to be committed to it. I think there's an opportunity to to to move forward on some of the even ideals that Mayor Garcia has talked about in terms of bringing interns into the city to to to help us with that.'",
        "'speaker_9': 'And so I would ask that we look at doing that as well and to the equity issue. I think cats and dogs are like apples and oranges. When you talk about mandatory spay neuter, they're different kind of animals altogether.'",
        "'speaker_9': 'You can't control you can't put a cat behind a gate and and keep it contained whereas a dog you can. And so and Councilmember Richardson, I do appreciate your your comments regarding those responsible pet owners or or redefining what a responsible pet owner is tonight.'",
        "'speaker_9': 'I think it's very important to understand that that, yes, they are pet owners who have said, you know what, I have a girl dog, I have a boy dog, and one of them is going to be fixed so that we don't have a problem here.'",
        "'speaker_9': 'And so and I'm one of them, by the way. So I do think we need to take that into consideration. And families, responsible pet owners and families throughout the city of Long Beach who are in those situations as well.'",
        "'speaker_9': 'So thank you very much.'",
        "'speaker_0': 'Okay. And finally, Councilmember Andrew.'",
        "'speaker_8': 'Yes, I want to thank you, first of all, Mr. Richardson, for calling for the question. But when I finish, I first of all, I really want to thank Vice Mayor Souljah for all the hard work and effort. You know, what I'm hearing is that we're making progress in this item, too, and I will keep the progress moving'",
        "'speaker_8': 'along. You know, I do not want to use this as an endorsement because making people hide the fact that they own animals. You know, I have the homeless people with pets in my community. I have community members that do not have much, but they do love their pets.'",
        "'speaker_8': 'You know, I do not want to support more enforcement as people in my community cannot afford, you know, more penalties. What I need and what I'm hearing in this item is asking for it is for the education of our community and how to better care for their pets.'",
        "'speaker_8': 'And I want to thank you for bringing this item to voice, and I thank you and I will support it. Thank you.'",
        "'speaker_7': 'Mr. Mayor.'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'Just briefly, Councilmember Andrew's raised an issue that I know staff is going to consider and look at. But just so we can have it on the record, if if affordability is an issue, we have always found a way to remove that as a barrier.'",
        "'speaker_7': 'And I think in this policy, we have an opportunity to do the same. For instance, if there is a citation, but then I don't have a better analogy. I was going to call it a fix it ticket, but it's a fix it ticket, right?'",
        "'speaker_7': 'So if there's a citation that's in place, but then the owner makes good on using a voucher to spay and neuter that animal, then the citation should go away. And I know that our staff has a compassionate approach to this policy.'",
        "'speaker_7': 'So I want to thank you for raising that.'",
        "'speaker_0': 'Thank you. We're going to we're going to go ahead go to a vote. I just wanted to thank listen, I know that. Everyone here, myself included, as a as an animal lover, cares about animals. I know that. What the work to fix Long Beach and friends of Long Beach animals and all the rescue groups from the cat'",
        "'speaker_0': 'rescue to all of the work that's being done. Everyone here cares about animals. And thank you all for being out here, regardless of what what side you fell on the issue. I think what's before us is responsible and it does address the issues that we have with those members of our community that are breeding their pets responsibly'",
        "'speaker_0': '. But but what I don't want to get lost on is there's two pieces, I think the the ordinance in related that's related to eliminating the use of pet shops and then purchasing animals that have been, you know, breed it in these large puppy mills in factories is as significant.'",
        "'speaker_0': 'It's something that we've been watching happen in other cities, and I think that's a really good piece of this as well. And so there's been a motion already on the floor and a second. So, Mr. Quirk, if we'll do a vote, please.'",
        "'speaker_1': 'Motion carries eight votes. Yes.'",
        "'speaker_0': 'Great. Thank you all very much. And before we go to the next item, since I know there's a lot of interest, the the item will be back to the city council within about 90 days and that will actually be the law that will be before the council.'",
        "'speaker_0': 'So the law will be written, the law will come before the council and the council will then vote on that law or before a law similar to that. Okay, thank you all. Item number nine.'",
        "'speaker_1': 'Item nine is a report from the Office of Councilmember Al Austin and Councilmember Roberto Rango with a recommendation to ask the city attorney to draft a resolution commemorating National Family Caregivers Month.'",
        "'speaker_0': 'Let's. I want to make sure that we give time for the next item. So. Can I have everyone? We're still in a council meeting. If I can have everyone have the conversations outside and really appreciate it. Sorry. We have another item.'",
        "'speaker_0': 'Thank you so much. Mr. Clarke, let's just hold on 1/2.'",
        "'speaker_5': 'Mayor, if Councilmember Richardson could announce. Yeah, we will.'",
        "'speaker_0': 'We're going we're going to do it right now.'",
        "'speaker_5': 'Okay. I'm.'",
        "'speaker_0': 'We are. Let's have the conversations outside, please, because we have to move on to our next item. All of these items are important. Okay. Mr.. Mr. Clarke, can you read the item one more time?'"
    ],
    "Recommendation to request City Attorney to draft a resolution to commemorate National Family Caregivers Month and in recognition of the importance of the In-Home Care Provider Workforce.": [
        "'speaker_1': 'Thank you very. It's a report from the office of Councilman Al Austin and Councilmember Roberta Ranga with a recommendation to request the city attorney to draft a resolution to commemorate National Family Caregivers Month in recognition of the importance of in-home care provider workforce.'",
        "'speaker_0': 'And before we begin, I'm going to have Councilmember Richardson make an announcement.'",
        "'speaker_10': 'I'd like to say out publicly, I'm going to recuse myself over legal conflicts of interest to do some consulting with this group.'",
        "'speaker_0': 'So if you're going to. You're going to. Great. Okay. Motions and motions being made. I'm going to turn this over by to turn this over to Councilmember Austin.'",
        "'speaker_9': 'Thank you, Mr. Mayor. Yes. This is an issue that is near and dear to my heart, as I have worked hand-in-hand, side by side with many home care workers over the years. This is a draft resolution to commemorate the National Family Caregiver Month, an important meeting in recognition of the importance of in-home care provider who who do'",
        "'speaker_9': ', in my opinion, God's work. They do work that is unseen and goes unseen and often unappreciated. They work with our our seniors. They work with our our our disabled. They work they work with our developmentally disabled. And they do great work.'",
        "'speaker_9': 'They save the state of California millions and millions of dollars with the work that they do, working with the clients that they work with. If their clients weren't with care, in-home support services or caregivers, they would be in nursing homes or developmental centers cost in the state of California.'",
        "'speaker_9': 'Instead of them costing a few thousand dollars, a couple thousand dollars a month, there would be six, seven, $8,000 a month. So the work that they do is critical to our community. Many of us don't realize that we have over 100, almost 150,000 home care workers who live in the county of Los Angeles.'",
        "'speaker_9': 'We have over 11,000 of them right here in the city of Long Beach. I'm looking out here in this crowd, and I see quite a few familiar faces because many of them are eighth District residents. I appreciate their work and I'm proud to want to recognize them here to stay today.'",
        "'speaker_9': 'I keep talking.'",
        "'speaker_11': 'Thank you, Mayor. And also, I want to thank Councilmember Austin for bringing this forward. Having been a individual who benefited from home care, where my father in law was in his in its final days, and you see the quality of work that they do in there.'",
        "'speaker_11': 'It's a it's a branch of service that is very much under looking, very much underappreciated. And so I want to thank Kazu, Austin and Richard Hill for bringing this forward. I totally support it. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Andrews.'",
        "'speaker_8': 'Yeah. Yes. I really want to thank you also for standing here just at this time of night. But you guys are really if people really knew what you individuals are doing when it comes in, Askia, I mean, the work that you do is just I mean, impeccable because the fact that it's not easy, because the fact I'",
        "'speaker_8': 'know that, you know, for my father himself had to have been asking, but you guys are just tremendous. And the work you do, you know, everyone would really seriously take a serious, you know, look and see what you guys if they had a chance to see the work that you go through, man, I'm telling you, they would'",
        "'speaker_8': 'be so appreciative. And I know I am. And thank you guys again for your hard work. But.'",
        "'speaker_0': 'Thank you. Council member Austin.'",
        "'speaker_9': 'Yes. I don't want to to to to under undervalue. What we're doing here tonight and what we're doing here tonight is also we're recognizing in-home caregivers, but we are also saying that, you know what, we're standing with them in support of of of a fair wage on their path to to earning $15 an hour very, very clearly'",
        "'speaker_9': '. And there's a lot of conversation about raising the minimum wage and who deserves $15 an hour or what that should look like. I don't think that that anybody would argue that the work that these individuals are doing, the savings that they are providing the state in our communities, we shouldn't there shouldn't be an argument about the wages'",
        "'speaker_9': 'that that these folks deserve. And so I just wanted to make sure that was very clear. I'm going to read the last paragraph of the proposed resolution, and it says Whereas whereas whereas and I think we've covered how great our in-home caregivers are now, therefore, be it resolved that the city of Long Beach, standard support of home'",
        "'speaker_9': 'care workers, acknowledging the essential work and contributions they bring to Long Beach by officially recognizing the month of November as family caregivers month and supporting their efforts to lift themselves and their communities out of poverty as they fight for path to earn an hourly wage of $15.'",
        "'speaker_9': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Councilmember Price.'",
        "'speaker_2': 'Thank you. I have a couple questions for the city attorney. First of all, no quarrel whatsoever with the premise of this item. The work that these individuals do is it's God's work. And you cannot mean arguing how much it's worth is kind of a useless argument to have because I don't think we can even quantify what their'",
        "'speaker_2': 'work is worth. Its its there are very few professions out there who do the type of work that you can't even fairly quantify, especially not with something like a minimum wage. But having said that, I'm concerned about this last paragraph and I noticed it was in the revised and I wanted to maybe ask the city attorney about'",
        "'speaker_2': 'this. So in this resolution, the last paragraph is basically. Articulating as a body that these individuals would be working towards a wage that is higher than the minimum wage. Is there any legal issue with that? Are we are we then setting a new minimum wage?'",
        "'speaker_5': 'No. The resolution would not set or establish the minimum wage in Long Beach. It is, as the resolution indicates, it's to commemorate the National Family Caregiver Month and a recognition of their importance. The last paragraph does talk about a path to an hourly wage of $15.'",
        "'speaker_5': 'I don't know that this resolution in itself articulates that the city is supporting the $15 in this particular resolution. It's supporting and recognizing their work. And I think it as a goal for that organization to get to $15.'",
        "'speaker_5': 'But it does not establish or establish the policy of Long Beach that there's a $15 a wage, minimum or living wage for this particular sector.'",
        "'speaker_2': 'Okay. And I mean, maybe I can ask the makers of the of this the authors of this item, where did that number, $15, come from? How was it determined that their worth that their their work is worth $15 and not $30, for example?'",
        "'speaker_2': 'Well, is that an arbitrary number?'",
        "'speaker_9': 'It's an it's I wouldn't say it's an arbitrary number. We have representatives here from SEIU. You will T.W., I'm sure during public comment. They will they will speak to that. I know for a fact that they have they have bargaining relationships with various counties throughout the state of California.'",
        "'speaker_9': 'And that is who they they bargaining. They bargain with. They their funds come from a a blend of federal and state moneys that that are that are moved through the county of Los Angeles. And they they bargain with them as the caregivers for, like I said, over 150,000 folks who they provide care to here in our county'",
        "'speaker_2': '. I guess my concern is the title of the draft resolution is recognition of the Importance of the in-home care provider Workforce and National Family Caregivers month. And most of the. Resolution seems to be consistent with that title. The last paragraph seems to be.'",
        "'speaker_2': 'Frankly, unrelated to that title, it seems to be more of a maybe a labor support issue. I'm not sure. And to me, I think that the resolution's purpose is met without that last paragraph and certainly without placing a dollar value on it.'",
        "'speaker_2': 'That last paragraph really has nothing to do with the purpose of the resolution. We might want to title the resolution something else like helping this particular labor organization or something, but calling it appreciation or recognition of the importance of the in-home care provider workforce and national family caregivers.'",
        "'speaker_2': 'Month And then including that last paragraph in there, to me it just doesn't seem like it fits. So my, my recommendation would be that we and you know what I would love to hear from public comment and see maybe there's a link there that I'm missing.'",
        "'speaker_2': 'So before making any friendly amendment for fear that it will be rejected, let me just hear the public comment and I will go from there. How about that?'",
        "'speaker_0': 'Okay. Next, we have Councilwoman Gonzalez.'",
        "'speaker_2': 'Just want to say thank you all for being here, too. You've waited so long. And I know that this resolution is a step in the right direction, in my opinion. And I know the $15 is a trend that, you know, Los Angeles County had been making.'",
        "'speaker_2': 'I know you're onwards toward that towards that trend. And so I want to thank you for every single day you know, what you're doing for folks in our city. Thank you.'",
        "'speaker_0': 'Thank you. And now we'll take. Yes. Please come forward and you can just identify yourself for the record. Anyone who wants to speak to us, please come to the mic. Thank you.'",
        "'speaker_8': 'Good evening. My name is Leonard Camarena. I'm a home care provider, being a home care provider for 13 years. Finally got to meet you, Mr. Mayor. You hear everybody. Counsel. Thank you very much. And I am really happy that you guys are with us on this.'",
        "'speaker_8': 'But, Mr. Price, I will answer any questions if you need to know anything. But first of all, I'd like to tell you that I am here supporting my brothers and sisters at home care working providers. Right. And you guys are right.'",
        "'speaker_8': 'We do do a job that we give home care provision to to the elders, to the sick and to the disabled. Okay, so that's us right here. That's the job that we were chosen to do. This is a job that we take with a lot of pride to meet these people, to make our clients, to feel real'",
        "'speaker_8': 'relaxed during the days of their illness. Okay. So then I'm asking you also if you would stand up with us and fight for us for $15 an hour that the county has presented us with. Right, because it's $15 an hour.'",
        "'speaker_8': 'Sure. 965 an hour that we're making now. And we fight for $0.65 for about six months in 2013. Well, now we're asking you, because the job we do, you know, it doesn't pay a lot. So a lot of us live in property, you know, like we we can we always worried about our rent and our bills and'",
        "'speaker_8': 'our finances, but still, we don't give up. We keep taking care of those that we are we're asked to to give health care to. So I would just like to come to the county council and ask you to join us to help fight for $15 an hour.'",
        "'speaker_8': 'And as in January, coming up, me and my. Me and some providers.'",
        "'speaker_4': 'We will be.'",
        "'speaker_8': 'Going to the to the county legislators for tally county status for for higher wages and better dignity in life saved by being a home care provider. I mean.'",
        "'speaker_4': 'We were.'",
        "'speaker_8': 'We're not really recognized, but through you. I really appreciate it. But through others were not recognized. But now we're starting to get recognized. Now all the cities are combining together to fight, to assist us to get $15 an hour.'",
        "'speaker_8': 'So that's what we're asking you, if you would join us to get $15 an hour. And we appreciate it. And I'm glad to be here.'",
        "'speaker_0': 'Okay. Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening. My name is Jimmy Taylor. I'm also a home care worker. I've been a home care worker for about seven years now. I used to take care of my mom. She's passed on as well as I take care of my aunt now.'",
        "'speaker_3': 'So I had two clients that I took care of. I'm asking the council tonight to stand up to stand up with working families. And we demand $15. I know you said $15 not. Why not 39.60 $0.05. If you walked a day in my shoes taking care of my client, which has multiple different health health issues.'",
        "'speaker_3': 'Nine $65 would be nothing. 965 For a lot of folks that's in poverty or barely making it. Nine 69.65 Since I've gone to a lot of folks home, that makes 9.65 and they're barely making it. $15. We could put money back into the economy, which would give it a boost that would help.'",
        "'speaker_3': 'We would save the the country, the state, millions of dollars, millions of dollars that we wouldn't have to build different facility. So. 965 Yeah, it's really nothing. You ask yourself on this panel. Could you live off a 9.60 $0.05?'",
        "'speaker_3': 'I don't think so. Even $15, it's not a lot, but it is a start. It would help a lot of home care workers out there that really needs that. So, again, I ask you, please stand with us. Approve the $15.'",
        "'speaker_3': 'We thank you for your support and the recognition that you're going to give us. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Bennie Thompson, SEIU, United Long Term Care Worker Staff. I wanted to come to address some of the issues that the council.'",
        "'speaker_8': 'Price raised, and your act tonight would be an act of solidarity.'",
        "'speaker_9': 'And standing with the long term care workers as we go forward into bargaining in January with L.A. County. And just to continue with the comments of the city attorney, it would not change the minimum wage.'",
        "'speaker_8': 'Or set any wage here in.'",
        "'speaker_9': 'Long Beach. Your act is purely.'",
        "'speaker_8': 'An act of solidarity and standing with the over 11,000 long term care.'",
        "'speaker_9': 'Workers who are providing services to the elderly.'",
        "'speaker_8': 'And to the most vulnerable in.'",
        "'speaker_9': 'Our community here in Long Beach. Does that answer the concern? Are there any other concerns?'",
        "'speaker_0': 'No, I think right now it just wouldn't comment on. Okay. Thank you so much. Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Hi. My name is Patsy Walton. I want to say thank you for coming out to listening to us tonight. I've been in-home care worker for 12 years. My first four years, being a worker, I did not get paid.'",
        "'speaker_4': 'I worked for free because it wasn't just family members, it was friends also, and they didn't have it. And if.'",
        "'speaker_3': 'They did, I didn't know anything about.'",
        "'speaker_4': 'It. Now I have two clients. I work for elder people, 95, 85 years old. We do I do the same kind of work that people in the hospital does. You know, and sometimes I do more. You know, I have relationship with my workers, my clients today.'",
        "'speaker_4': 'And I love my clients. And if I can get more, I will. My goal is to help any elder I can, any kind of way I can. That's what God got.'",
        "'speaker_3': 'Me here for. You know, and.'",
        "'speaker_4': 'And I wish you guys we really look at that we really need a $15 cut for real for real. This $9 an hour. The way the rate is, we can barely live. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Hi. My name is Larry Prince. I live in the first district. Hi, Councilwoman. I was walking to school. One of the young men I mentor. To the elementary school.'",
        "'speaker_5': 'Here and with his mother. And we were.'",
        "'speaker_10': 'Confronted by a transient who had to use. The sidewalk as a toilet. And as I ushered them past that, I, the man, exposed himself and defecated on the sidewalk. And I called the police. And it just it was a a reminder how bad our.'",
        "'speaker_5': 'The homeless problem is.'",
        "'speaker_10': 'Here. They. The mother asked me later, why would he do such a thing? And I had to tell.'",
        "'speaker_5': 'Her that they don't have any place to go.'",
        "'speaker_10': 'They can't go to Starbucks. They can't go to a restaurant. They won't let them in. So. It was a tragic reminder of the human tragedy. All of you walk through every day when you walk through the park next door, any place downtown.'",
        "'speaker_10': 'But that aside, I was. Reminded also that the the the mother of the woman of the young boy I'm mentoring is somebody who is in need of in-home supportive services.'",
        "'speaker_5': 'And she's applied for such.'",
        "'speaker_10': 'She has debilitating effects of diabetes and also lupus. And she has.'",
        "'speaker_5': 'Applied to receive this care and.'",
        "'speaker_10': 'Has not received.'",
        "'speaker_5': 'An answer for this.'",
        "'speaker_10': 'And. I'm very encouraged by Councilman Austin's support for in-home supportive services. I think that's that's a great thing. But she has not received an answer for this. Somebody who has diabetes and lupus, I'm just wondering, does she need a third major disability to qualify for this?'",
        "'speaker_10': 'I'm just wondering if there's an advocate. Councilman also asked Austin or Councilman Andrews or your. I know you've spoken in support of this.'",
        "'speaker_8': 'Is there somebody who can help.'",
        "'speaker_10': 'This particular person who needs this help.'",
        "'speaker_5': 'Urgently? Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Just.'",
        "'speaker_0': 'Please come forward if you're going to. We need to get through the speakers. If you're going to speak, just please come forward.'",
        "'speaker_3': 'Hi, my name is Wanda Williams, and I'd like to thank you all for being here and taking a time out to listen to us. And also, I'd like to thank you guys for recognizing November as the Caregivers Month.'",
        "'speaker_3': 'That's a great thing you've done. And as for the $15 an hour, that's just something for all the home care workers who are striving for all over Southern California and Northern California. That's our fight. We're coming here to thank you right now for making November.'",
        "'speaker_3': 'I can't give as much myself. I have 25 years in a health care union health care industry, but my fiancee had a massive stroke due to his football days, so I ended up taking care of him. We never lived together.'",
        "'speaker_3': 'We got engaged. February 22. We had a massive stroke in May of 2000. Two didn't know who I was. So what was I going to do, walk away from him? No, I let him move in with me. So it didn't matter about the money, us, whatever we get paid, we're going to take care of our family, our'",
        "'speaker_3': 'friends, whoever we going to do this. So but everything costs and we need to be recognized. And I so thank you guys for what you done for November. Thank you.'",
        "'speaker_0': 'Thank you, Count. Oh, sorry. We have another speaker. Please come forward.'",
        "'speaker_4': 'Hello. My name is Donna. I'm the disabled person. I'm here today to tell you how my caregiver helped me and how it saves you money. I wasn't born with a brain damage, disabled, couldn't walk, talk or hear. As you see.'",
        "'speaker_4': 'To know I'm why I talk, I could hear. But unfortunately I had medical problems in my stomach. But leave me to have 15 surgeries in my stomach that left me with a cloth in me bag for the rest of my life.'",
        "'speaker_4': 'For now, I have a hole in my stomach. It's very hard with my hands with die with with arthritis to put my own bag on, to have one bag to mess it up at $22. Could you imagine? My caregiver were kind enough because my supply was not in and I ran out to buy me one.'",
        "'speaker_4': 'Not only that, I cannot do this by myself. Not only that, I want to let you know if you put me in a boarding care, if you put me in a hospital, it would cost more the state more money to care for me.'",
        "'speaker_4': 'So I get off my butt every day and I fight for my life and keep on fighting because not only my stick, I have a son was to rest and kicked in the brain and my brother unfortunately been hit by a car for a time that left them with a brain injury.'",
        "'speaker_4': 'But I get up every day and I help the workers and I give them hope that I am going to try one day to get off of Social Security and be a worker myself. This is my caregiver. She helps me.'",
        "'speaker_4': 'And I want you to understand the work that you do, the hard they help every day and make sure that I get my medicine taken. I have came a long way. I've stopped taking a lot of medicine. I don't want to take pain pills.'",
        "'speaker_4': 'I want to get up and walk. I want to crawl, I want to walk. I want to run. I want to scream. Without a caregiver, I don't know what I would do if they give me hope. I What have you told me?'",
        "'speaker_4': 'The child. You would never believe that I couldn't even talk the way I talked. And now, 20 years ago, when the caregiver union people met me, I couldn't write a word I wrote back was upside down. They said, Butler, you need to pick up the phone and try to call.'",
        "'speaker_4': 'I did it my way. I did it every step of the way for the worker because I believe the workers need to help the disabled. Please. They don't need they need what they deserve. They worked very, very hard.'",
        "'speaker_4': 'They even were better than some nurses. I thank you very much to listen to my story. Okay.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_4': 'Hi. My name is Crystal. I actually want to thank God for one thing, for giving me this opportunity to work with disabled peoples. You know, I want to thank the councilor and the mayor's, my friends, that made news.'",
        "'speaker_4': 'And I really appreciate me. You know, I've been an assistant for working for disabled people since 2001. And some days it's hard because we get these clients. Sometimes I can really, really help. They serve. I mean, they sometimes mess up on me.'",
        "'speaker_4': 'So and we take the time, even the little time that we do how we do overtime to make sure these clients are accountable. What they provide is because some of us, we can't deal with a lot of these clients, but me, I'm so grateful that I'm be able to take care and not a disabled person because I'",
        "'speaker_4': 'don't want somebody to take care of my mother. So I'm just begging and praying on it. You think about giving us just $15 an hour because we work hard, but to help the community, knowing that there is some good people out there that will go over time to help these clients.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilwoman Mango. Oh, another one.'",
        "'speaker_5': 'Please.'",
        "'speaker_3': 'Hi. My name is Betty. I'm from Carson. I'm not from Long Beach. However, just to let you know, I want to let you know that the the $15 an hour is a pathway to $15 an hour. And the the council the council people of Carson have also given us a resolution stating that they are also supporting us'",
        "'speaker_3': 'in our in our fight. It's not from you guys. The $15 is going to come from it's from the state and the county, Los Angeles. Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_3': 'I am a county of employee professional. Home health care workers are an important group of health care professionals in our system. I specifically have worked on health care policy for the CEO's office for Los Angeles County, and I know the financial savings that each and every one of you provide for the system.'",
        "'speaker_3': 'Having had elderly grandparents, I know and understand how hard it is to care for someone after a stroke and during other times of need and the work that you do. As my colleague said, it is the work of God.'",
        "'speaker_3': 'That being said, wages are a complicated matter with rippling impact and we as a city are in bargaining with I am employees right now, some of which make less than $15 an hour as well. And. A resolution for your service is warranted.'",
        "'speaker_3': 'Asking this body to get involved in the labor negotiations of the County of Los Angeles is a different matter, and I feel that the revision to the resolution was not timely. I think that. If if the true weight needs to be behind this that you're asking for, then you should ask your council member to come here with'",
        "'speaker_3': 'the resolutions specifically stating only. That the city of Long Beach is asking for your support in getting involved in the labor negotiations of the County of Los Angeles. Let me also state that my mother is a member of SEIU.'",
        "'speaker_3': 'I am a supporter of labor. She is not a member of your particular group within. So I am not in a conflict. But but I have a significant problem with bringing. Issues of wages through a resolution process that is changed after posted to the public.'",
        "'speaker_3': 'And to make any evaluation of your value without having it stand on its own.'",
        "'speaker_0': 'Councilmember Austin.'",
        "'speaker_9': 'Yes. I want to thank the many people who came down, particularly from the the home care providers here who live in Long Beach, who serve residents here in Long Beach. Again, I think everybody behind this dais appreciates the work you do.'",
        "'speaker_9': 'And I believe most of us support your pathway to earning a living with a living wage. And so with that, I would call the question.'",
        "'speaker_0': 'Okay. There's been a there's one more person that wants to speak. You called the question is or a second to call the question, can the second that have called the question with one more person wants to speak to will Mr. Judy Turner will vote on the question first.'",
        "'speaker_0': 'Is that correct?'",
        "'speaker_5': 'There's been a motion and second, yes, it'd be okay.'",
        "'speaker_0': 'He'll withdraw. Okay. There's one other person. So, Councilwoman Pryce.'",
        "'speaker_2': 'Thank you. So I think what this I'm gathering from the comments that that what this item is asking us to do is basically adopt a resolution. But not only appreciates the work of this class of employees, but also helps them with their labor bargaining with the county of L.A..'",
        "'speaker_2': 'Mr. City Attorney, is that your understanding of what?'",
        "'speaker_5': 'Yes. The resolution would indicate that the city this would be a position of the city of Long Beach supporting and recognizing their importance and then also supporting their efforts in their attempt to earn or make $15 an hour.'",
        "'speaker_5': 'So, yes.'",
        "'speaker_2': 'So and I don't really think this is a city attorney question, but common sense wise, if we were to do this for this. Labor group, then we would be. I guess that would be some. It certainly wouldn't be unprecedented then for us to do it for other labor groups who are about to embark on negotiations with their'",
        "'speaker_2': 'employer, which is not the city of Long Beach. Right. So. So my my issue is that I think it sets a really bad precedent for us to be asked as a city to weigh in on labor negotiations in another with another entity, knowing full well that we ourselves are going through labor negotiations here in the city of'",
        "'speaker_2': 'Long Beach. And let me just ask hypothetically, perhaps the city manager might be able to assist me with this question if we were to support a $15 wage for all of our employees who are currently making under $15 an hour, would that have a financial impact on the city of Long Beach?'",
        "'speaker_5': 'Councilmember Yes, it would.'",
        "'speaker_2': 'And would would that financial impact possibly result in us having to cut services to our residents?'",
        "'speaker_5': 'It possibly could.'",
        "'speaker_2': 'So by adopting this resolution, we'd be saying that we want the city of L.A. to do something for its employees, that the city of Long Beach is not currently doing for its own employees. That's my understanding. And and I think that's that sets a bad example, bad precedent.'",
        "'speaker_2': 'It has nothing to do with this particular organization, because if we do this for this organization, we're going to be expected to do it for others. I'm not sure what other discussions are going on out there, and that's a concern to me.'",
        "'speaker_2': 'I think that it's important for us to think about the ramifications of passing a resolution like this. Given that we are in the process of labor negotiations in the city of Long Beach and will continue to be for the next few years, what are we saying?'",
        "'speaker_2': 'Are we in fact saying that this is a principle that we want applied to all the hardworking employees in the city of Long Beach as well? And if so, are we okay with the financial consequences that are going to come with that?'",
        "'speaker_2': 'We given the fiscal. Situation that we're in. I don't know how we could answer that question responsibly in the affirmative. So with that, I have nothing else to say.'",
        "'speaker_0': 'Okay. I have I have one more council comment here that's popped up and then we're going to go to a vote. Councilmember Mongo.'",
        "'speaker_3': 'I want to say that. Even more so. I think it is unfair that it is unreasonable to think that our council colleagues do not have an impact on us. And unfortunately, one of our colleagues is a consultant of yours and.'",
        "'speaker_3': 'While he is recusing himself from voting on the item. That does not take back his influence. And it just really upsets me that this is brought before us and this has to go on. And I. Would strongly request that the friendly amendment that we were hearing potentially come forward would be considered.'",
        "'speaker_3': 'Are there any ideas of any amendments you'd like to make? Councilmember Alston.'",
        "'speaker_9': 'May I call it question?'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Okay. There's questions being called. I think we're done with the comments, public comments over. There's an emotion. The second on the floor. The motion on the floor is to approve and move forward with the resolution that the city attorney would draft.'",
        "'speaker_0': 'Correct.'",
        "'speaker_5': 'The motion is to request our office to draft. We would bring the resolution back for a final vote. Yes.'",
        "'speaker_0': 'Okay, great. And Mr. Clark, everyone, please cast your ballot.'",
        "'speaker_1': 'Motion carries five votes. Yes. Two votes no.'",
        "'speaker_0': 'Okay. Thank you. That that resolution will come back to the council. And I also want to thank all of you for coming down today. Like I think everyone up here said, you guys do some really, really important work in our community.'",
        "'speaker_0': 'It really is some of the work that you're taking care of those that need the help the most. So thank you all for being here. And the resolution will be back to the city council. Mr. Kirk Item number ten.'",
        "'speaker_1': 'Item ten is a report from the city manager with a recommendation to approve the Magnolia Industrial Group Property and Business Improvement District Annual Report and authorize payment of the city's assessments in the amount of $1,488 per second.'"
    ],
    "Recommendation to authorize City Manager to execute a Memorandum of Understanding (MOU) with Long Beach Transit in association with the Alamitos Bay Berth 3 Dock & Gangway Replacement Project to provide up to $687,000 in funding support.  (District 3)": [
        "'speaker_1': 'Report from the city manager with the recommendation to authorize execution of a memorandum of understanding with Long Beach Transit in relative to the Alamitos Bay berth Dock three and Gangway Replacement Project.'",
        "'speaker_0': 'Public comment on the item. CNN members, please cast your vote at Mr. Goodyear. You coming on this? Okay. Go ahead.'",
        "'speaker_5': 'Larry. Good. You work as the address. I obviously support the project with the following caveat. I want to make sure and I haven't seen the I haven't been able to discern from the plans whether or not there is any mitigation required by any of the work that has been done.'",
        "'speaker_5': 'And I'd like to get a answer one way or another if in fact, this drives the need, if there's any damage to the environment that there was driving, that will drive mitigation. And if so, where is that mitigation site?'",
        "'speaker_0': 'As you know, you don't get to ask questions of staff. But we'd like to continue your public comment.'",
        "'speaker_5': 'Yes, I'd like to find the answer. Is there. Does this drive the need for mitigation? Number one. Number two. Has that mitigation been approved? And the project if there's a mitigation project, has it been identified? And in most cases the Coastal Commission rules require the mitigation be completed before the project.'",
        "'speaker_5': 'This driving it is completed. But what I need is an answer under oath that there is no. Mitigation required.'",
        "'speaker_0': 'Thank you. Are you done with your comments?'",
        "'speaker_5': 'Yes, but I'm waiting for the answer.'",
        "'speaker_0': 'Mr. Goodyear, as you know, members of the public don't get to ask questions of staff of a council member wants to ask a question. They're able to. But that's the way it works.'",
        "'speaker_5': 'I thank you for demonstrating to Mr. Komi what the problem is.'",
        "'speaker_0': 'Thank you so much, sir. Next item. And we actually will take a vote on that item first. Please cast your votes.'",
        "'speaker_1': 'Motion carry symbol. Yes.'",
        "'speaker_0': 'Next item.'",
        "'speaker_1': 'Adam, 13, is reporting the Financial Management Department with recommendation received from the Investment Report for the quarter ending September 30th, 2014.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager to execute a contract with West Coast Arborists, Inc., of Anaheim, CA, for providing as-needed tree trimming services on the same terms and conditions afforded to the City of Tustin, CA, in an annual amount of $2,135,000, and authorize a 25 percent contingency in the amount of $533,750, for a total annual amount not to exceed $2,668,750 for a period of two years, with the option to renew for two additional one-year periods, at the discretion of the City Manager; authorize City Manager or designee to execute all documents necessary to enter into the contract, including any necessary amendments thereto; and   Amend purchase order No. BPPW14000026 with West Coast Arborists, Inc., by adding $410,000 for a total amount not to exceed $505,000.  (Citywide)": [
        "'speaker_1': 'Thank you. Item 18 is a report from financial management with a recommendation to adopt a resolution authorizing the award of a contract to West Coast Arborists for as needed tree trimming services in a not to exceed 2,000,680 $68,750 for a period of two years.'",
        "'speaker_0': 'Okay. Thank you. Mr. City Manager didn't make a report on this.'",
        "'speaker_5': 'Yes, Mr. Mayor, Councilmember Chase McDonnell is going to give us a quick report on this. Mr. Mayor, city council members, the staff is requesting that council consider a request to withdraw the first portion of this item to allow time for additional analysis based on new information that was received by staff.'",
        "'speaker_5': 'We would request approval of the second element in the amendment to the contract in order to in order for time sensitive work to be completed by the user departments. Staff anticipates being able to return with an updated request to council following the additional analysis.'",
        "'speaker_5': 'That concludes my report. Thank you.'",
        "'speaker_0': 'Can I get a motion back? Okay. There's been a motion and a second. Councilwoman Gonzales.'",
        "'speaker_2': 'I have a couple of questions that I just wanted to go over. Will this update include.'",
        "'speaker_3': 'Because I don't know if there's.'",
        "'speaker_2': 'A certain amount that we have to go out to RFP and why there was no bid in the first place. Can you answer that?'",
        "'speaker_5': 'Councilwoman, this contract was to be piggybacked off of the City of Tustin contract. So in a piggyback situation, the city relies on the competitive process of another municipal agency, and we step into the shoes of that competitive process.'",
        "'speaker_5': 'So Tustin had completed an RFP that we were going to be use as the basis for our pricing. West Coast Arborist was willing to acknowledge that pricing and share that pricing with the city of Long Beach.'",
        "'speaker_2': 'So why did we choose Tustin and what are the what are we paying per tree at this at this point?'",
        "'speaker_5': 'I don't know the answer to the second part of your question. The reason we chose Tustin at the time was that was a valid contract that had the longest length of time available. I'm still on it.'",
        "'speaker_2': 'Okay. So will the update include all that information or what will we get back when we have that?'",
        "'speaker_5': 'Sorry. The intention was to analyze the new information that was provided that we received last night and come back to council with a new recommendation.'",
        "'speaker_2': 'Okay. So it's just a new recommendation on a on a new service or a new contract or I'm sorry, or is it a recommendation to come back and go out to RFP again?'",
        "'speaker_5': 'We were going to analyze what was provided and then return to council with a recommendation. It could be to do the same piggyback. It could be to go to a new RFP or some other combination. We have not made that determination yet.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_11': 'Thank you. I also have some questions about the you said the second part of the RFP. Currently, as it stands, you want to go ahead and proceed. That became sensitive stuff.'",
        "'speaker_5': 'Correct? Yes, sir.'",
        "'speaker_11': 'What is that and what's the cost?'",
        "'speaker_5': 'The second portion of the item reads Amend purchase order with West Coast price by 410,004 Mt. not to exceed 505. Some of that work includes time sensitive work by Parks Rec and Marine that for trees that will be subject to nesting requirements.'",
        "'speaker_5': 'And that work has to start on or about December 15th and conclude by January 15th.'",
        "'speaker_4': 'Okay.'",
        "'speaker_11': 'So there was a time sensitive issue from beginning when this went out to to bid, if you will, with the city as they went in to piggyback. We are correct.'",
        "'speaker_5': 'Councilmember, we did not bid this item. So again, when we relied on touchstones, we were attempting that.'",
        "'speaker_11': 'What I meant is that because of the time sensitivity of the issue, you went with Tustin as a piggyback contract.'",
        "'speaker_5': 'That was one of the considerations. Yes, sir. Okay.'",
        "'speaker_11': 'Well, you know, when I read all the other contracts out and I read where there's a bid put in place, or so aggregating goes through to the press telegram or some other advertising agency. And I think this does not happen here.'",
        "'speaker_11': 'I would I would not be supportive of this. I think we should put it out to bid.'",
        "'speaker_0': 'Okay. Thank you. And either.'",
        "'speaker_11': 'If that's if that's in the in the face of emotion, make that.'",
        "'speaker_2': 'Motion second.'",
        "'speaker_0': 'Okay. There's been a there's been a motion and he's saying now there is already a motion on the floor right now to to a to approve the recommendation as amended by staff. Sir, I'm actually running the meeting, so just relax.'",
        "'speaker_0': 'Thank you very much. So just say to the pro, the process is, is there was a motion on the floor that I believe was made about Councilwoman Pryce to accept the the the the motion as amended. Then now what we have just to make clear is Mr..'",
        "'speaker_0': 'Your angle you would you want to get substitute motion. Okay, so there's a substitute motion that is on the floor. Someone seconded today didn't hear who it was, but Councilwoman Gonzalez and that would be to go through an RFP process for the motion, is that correct?'",
        "'speaker_0': 'Before we go any further, and I do have some speakers, I'd like the city attorneys to comment on this just to make sure that we're this is something that is optional for the council here at this point. Go ahead.'",
        "'speaker_5': 'Thank you, Mayor. Yes. The the way I understand the substitute motion, I believe that Mr. Rangel said that they would approve the time sensitive nature on the additional money and then require the not approve the proposed piggyback contract, but to direct staff to go out to RFP with that portion of the agreement.'",
        "'speaker_5': 'If I understand that correctly. And the answer to your question, Mayor, is is is that allowed by the staff? Yes, I think the council has the authority to either approve or disapprove this contract and give further direction to staff at this time.'",
        "'speaker_0': 'Okay. And Mr. and Mr. West, I guess my question was more a question about I have no idea where the process on this is at at this point. So did you want to comment on that?'",
        "'speaker_5': 'Mr. WEST Yes, Mayor. Councilmembers One of the reasons we'll be doing this is because we are getting a better price. We've been directed by the council. Previous Council, of course, this might be a policy we might want to revisit is to go ahead and utilize bids, combine our resources with other entities to get better bids, to get'",
        "'speaker_5': 'cheaper prices for us that are out in the marketplace. That would include piggybacking, that would include working with the school district for stationary, for things like that. So this is something that we've been asked to do to get better pricing for the city of Long Beach.'",
        "'speaker_5': 'I do want to highlight that we do have some necessary work in the Tidelands area that may not be able to get done. If we have to go back to rebid this because of what Jason talked about, given the nature of the birds and trees and things like that.'",
        "'speaker_0': 'My question my question is this. So my interest is there's a motion, the subject motion to just essentially go up for RFP. Is it possible that by just going out to RFP that we would get a we would not get a bid as low as the one we could possibly get by going back out and doing this'",
        "'speaker_0': 'additional information and coming back, or is that not a possibility? Very possible. So I would just just mention and caution to the council, I think what staff is asking for is to come back with information. What you're going to bring back to council would be, I'm assuming could could be we want to go back to our RFP'",
        "'speaker_0': 'or it could be we want to go forward with our proposal or it could be a variety of options. Is that right?'",
        "'speaker_5': 'Yes, we could come back immediately. Honestly, we were fully prepared to go forward tonight to award the contract. However, we did get a protest last night and we wanted to do the protesting vendor, an opportunity to review his documents and all that.'",
        "'speaker_5': 'So we're just trying to be as transparent as possible and analyze this. We've worked with the city attorney. We certainly could have come forward and gone forward this, but we just didn't want to give an alternate vendor an opportunity to review his documents.'",
        "'speaker_5': 'And given what we received yesterday and I'm not saying that after review, that would change our opinion or alter it in any way. But we can come back very, very quickly with the information you're asking for.'",
        "'speaker_0': 'Okay. And so I just want to make that the council aware of that fact. So, you know, it's your call whether you want to go to an RFP or not, but just know that that's a possible consequence if you just don't wait for the information to come back.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_2': 'It's my understanding that the first part of this item was withdrawn as the first order of business before we started talking about this. So the first item isn't even something that staff is asking for us to act on tonight.'",
        "'speaker_2': 'In fact, they withdrew it. The second part of it, it's my understanding that the second part is time is of a time sensitive nature because it's paying invoices for work that has already occurred during an interim purchase order.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_5': 'Yes. Jason, any other information for that? Correct. Councilmember City Manager There was there are some invoices that were incurred that we were looking to pay through this money. Additionally, Parks Rec and Marine, as I mentioned, has specific work scheduled that would be required notice scene as well as scheduling within the next 30 to 45 days.'",
        "'speaker_5': 'That must be completed due to the nesting issue.'",
        "'speaker_2': 'That's right. So if we don't do this work before the nesting season starts, then we can't do this work for some time until the nesting season is over because we don't want to harm the birds. Is that correct?'",
        "'speaker_5': 'Yes, ma'am, correct.'",
        "'speaker_2': 'Okay. So just to be clear, when when you took the first part of it off the table, the only remaining part for this agenda item was whether or not we pay the invoices that we've already incurred.'",
        "'speaker_5': 'The pay the invoices that we have incurred, as well as this additional work for Parks Rec and Marine, to be clear. Okay.'",
        "'speaker_0': 'Thank you. And I think Councilman Price, you're correct, but I think Mr. City attorney, the substitute, the maker of the subs who can still make that substitute regardless of it, because it's germane to the item, is that correct?'",
        "'speaker_5': 'Correct. And I understand the substitute motion includes that second portion and adds the direction to city council to go out to RFP with the first part that was withdrawn, not review the situation and come back with maybe a recommendation to piggyback or go to an RFP as I think staff originally described.'",
        "'speaker_2': 'Okay. So the substitute motion is to go out to an RFP on the first part and then go ahead and pay the bills on the second part.'",
        "'speaker_0': 'See no other council comment at this time on public. Oh, I'm sorry. You're right, Councilmember Austin.'",
        "'speaker_9': 'Just one quick question. How long would the RFP process take?'",
        "'speaker_5': 'Councilmember Probably we would estimate the RFP process.'",
        "'speaker_9': 'Between six weeks to. I mean, it could be it could be up to two.'",
        "'speaker_5': 'And a half months. Well, an RFP is a complex process sometimes.'",
        "'speaker_9': 'Understanding the complexity of the process. Would it be possible to expedite it?'",
        "'speaker_5': 'We can certainly work to make that timeline as short as possible.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you. We're going to take public comment at this time. So if you remember the public wants to speak, please come forward and identify yourself. 3 minutes.'",
        "'speaker_5': 'Yes. My name is Gus Franklin, and I am the president of United Pacific Services. First of all, I was very surprised when I when I found out about this, the contract being piggyback on to the city of Tustin.'",
        "'speaker_5': 'And test them way out there in Orange County. The West Coast Company has four other cities that we bet against them that were just right here locally in the L.A. area and their average unit price on those contracts.'",
        "'speaker_5': 'Let's take La mirada, which is right next to the Long Beach.'",
        "'speaker_9': 'Was $44 per.'",
        "'speaker_4': 'Tree.'",
        "'speaker_8': 'On trimming the cost at the city of Tustin.'",
        "'speaker_9': 'The average cost is.'",
        "'speaker_5': '$64 per trailer. West Coast is currently charging the city on their old contract $55 a tree for great trimming. It was Coles wanted to give the city a piggyback city, the one to take the city and one to bellow their charge to the city.'",
        "'speaker_5': '$44 a tree for good trimming. Ah, the city of commerce. They're charging them $44 a tree trimming. We better get some. A couple of weeks ago. We bet against him in the city of Highland.'",
        "'speaker_8': 'They beat $44 to tree. We bet 43. 75 a tree. And the contract was.'",
        "'speaker_5': 'Awarded to us. We beat them by $0.25. We've been trimming the trees for the city of Long Beach since.'",
        "'speaker_4': '2001 for 13 years.'",
        "'speaker_5': 'And during the past 13 years, they let out the contract four times for three years, three years of each. And we were the low bidder. West Coast, bit higher than.'",
        "'speaker_9': 'Us.'",
        "'speaker_5': 'Last year. Our contract was extended for one year now. We were the company that.'",
        "'speaker_9': 'Did all the trees in Queensway Bay.'",
        "'speaker_5': 'And we trimmed all the palms on the Thailand. I came down here today to to request and.'",
        "'speaker_4': 'Ask the city to renew.'",
        "'speaker_5': 'Our contract expired in June of 2014. That was from the one year extension. Can the city renew our existing contract.'",
        "'speaker_9': 'For until a first, maybe 90 to 6 months until you let out a.'",
        "'speaker_8': 'New RFP? Remember, we've been trimming your trees in the Queens way.'",
        "'speaker_5': 'In the Tidelands and your parks for the past 13 years. And. I think myself that West Coast does this piggybacking on a lot of different contracts. We bet against them.'",
        "'speaker_8': 'They piggyback from one city?'",
        "'speaker_5': 'We were betting against them in a contract to San.'",
        "'speaker_4': 'Diego.'",
        "'speaker_5': 'And then they piggyback from from.'",
        "'speaker_4': 'The Sierras.'",
        "'speaker_5': 'Made it. At very high unit prices.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Thank you, sir.'",
        "'speaker_5': 'I see my time's up.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please.'",
        "'speaker_8': 'Hello. My name is Jack Boring. I'm the vice president, general manager with United Pacific Services. And it was interesting.'",
        "'speaker_5': 'Your comment you made about the cheaper prices for trimming.'",
        "'speaker_8': 'That these trees that are that had to be done on a time sensitive timeline because we've been trimming those trees for the last 13 years at $25 apiece. And West Coast is priced under the proposed piggyback is $45 apiece for the same trees, 80% price increase.'",
        "'speaker_8': 'And the same. And Queensway Bay that we've been doing for 13 years has a budget for $75,000. For the last four years, we've been trimming all the trees in Queensway Bay for.'",
        "'speaker_5': '75,000 for.'",
        "'speaker_8': 'Four years. The West Coast, the proposed West Coast Prize, would double the budget cost for the Queensway Bay Area to 150,000 for the same trees that we've been doing for 13 years. So I don't understand what your cheaper price argument on that one.'",
        "'speaker_8': 'But anyway, that's all I have to say. Thanks.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'Honorable Members of City Council. My name is Angel James Otello, director for True Milan Company. We've been your contractor for the Parks and Rec for the last 3 to 4 years and we were also surprised when we read the agenda report trying to piggyback this contract.'",
        "'speaker_5': 'If you look at your staff report, you'll see that the rates for city testing are not included. I actually got a contract when the see test in city clerk and they gave me the prices that I proposed under this piggyback contract.'",
        "'speaker_5': 'If my company had an opportunity to bid this contract, we would instead of 64 or $50, whatever they're proposing, we would charge you $45, $47. And this is what you get when you go out to RFP. You get companies to compete for your business.'",
        "'speaker_5': 'There's at least 4 to 5 different companies that could do this work. We are also a contractor for City of Riverside who is comparable in size to the city of Long Beach instead of City of Tustin, ten square miles compared to 50 square miles.'",
        "'speaker_5': 'City of Tustin at 16,000 trees. Long Beach has more than 200,000 trees. So we were one of the contractors here, along with UPS and West Coast, was the contractor for the city, and that contract expired in June. What the second portion of this contract is asking is to take TLC out.'",
        "'speaker_11': 'Of the out of the.'",
        "'speaker_5': 'Program, take ups out of the program, and give all of that to West Coast arborist until the second portion, I believe, is in the best interests of the city to extend the current contract with TLC for the parks up W for the marina and the bay and West Coast are best for the city.'",
        "'speaker_5': 'Until an RFP process comes out, even if if we are offering the city of Long Beach four times out of the tree, that's a 25% decrease of the $2.6 million a year contract that West Coast is proposing. Since 80% of this money is going to come from the general fund, that's half a million dollars a year you'",
        "'speaker_5': 'can save. This contract is asking for a four year contract over $10.6 million contract. That would be maybe the largest contract in the city of Califor in the state of California. And I believe that the city of Long Beach will get the best possible rate if it puts that contract out to RFP.'",
        "'speaker_5': 'If you look around to your neighboring cities area, Signal Hill went out to RFP and they're paying $39. The Tree City of Bellflower and Lakewood both went out to RFP and they're paying 4490 a tree. We are a contractor here in the city of Long Beach.'",
        "'speaker_5': 'We are a certified minority owned business enterprise. And this piggyback option is eliminating minority firms from actually giving you guys a bid. I respectfully ask council to give us an opportunity to put this out, to bid. Let the private sector compete for your business.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Could we have another speaker? Okay, last speaker.'",
        "'speaker_8': 'Go ahead. Okay. Think. Think. Thank you. I'm Patrick Mahoney.'",
        "'speaker_10': 'From West.'",
        "'speaker_5': 'Coast Arborist. And I just want to.'",
        "'speaker_10': 'We've been working here in the city of Long Beach for the last 30 years. I think all of us have different contracts, but we're welcome the opportunity if you want to go back out for bid. There's all these different prices.'",
        "'speaker_10': 'Long Beach has a very mature, overly mature population of trees that really 44, 50, 39. It's hard to really compare the different prices. But we're happy to go compete on an RFP basis. They're talking about extending our current contract that we currently have, and we're happy to do that.'",
        "'speaker_10': 'And I'm here to answer any questions if you want, but thank you for the business you've given us.'",
        "'speaker_0': 'Thank you. With that and to go back to the council. Councilwoman Price.'",
        "'speaker_2': 'I'd like to ask city staff at this point if we were to not approve the second part of this item, the item that's before us in terms of the work that's already scheduled and the invoices that we've incurred, would that delay any existing projects or work in the city?'",
        "'speaker_2': 'And specifically any projects that were on a tight timeline on or anything like that.'",
        "'speaker_5': 'Thank you. Councilman, we. We would need some money for emergency removal of limbs that are down from storms. About 50,000 of that. About 240,000 for the palm trees and the tidelands area, because, as you know, the front will have a tendency to fall.'",
        "'speaker_5': 'So they would trim those palm trees. So again, needs to be done before January 15. We have a tight timeline for the nesting period, September 15 to January 15. If we don't get it done by January 15, we can't do it until next September 15.'",
        "'speaker_5': 'So that leaves the palm trees untrained, and it's an annual trimming process for the palm trees.'",
        "'speaker_2': 'Now, maybe I can ask for some clarification from the maker of the substitute motion councilman or Ranga. Were you thinking that we would not pay the outstanding for the outstanding projects that we've already contracted for and go out to RFP on the work that hasn't been done?'",
        "'speaker_2': 'Or were you thinking in terms of the first part of who we're going to enter into a contract with?'",
        "'speaker_11': 'Well, what I'm dealing with, my concern is the transparency of going out to a contract. It's the bidding process that is merited in such. Contract to get out there and we do it. I understand there's been a commitment made.'",
        "'speaker_11': 'I understand the city charter allows for us to do this, but I'm concerned that there wasn't enough transparency in putting out the bid and maybe the city staff to give us a clarification as to how this happens. But from what I can understand or see here is that under the piggybacking section 18 or two in the city'",
        "'speaker_11': 'charter, there's no information, there's no notice that this is even going to take place. It just sort of it's sort of done. For lack of a better word, better terms. And back in the back, in the back door, you know, in the kitchen sink.'",
        "'speaker_11': 'But I would I would like to have is an opportunity to have other agencies be able to bid for this. And any time that there is going to be a consideration about invoking City Charter Section 18 or two that we know about it.'",
        "'speaker_11': 'Nobody knew about it. It sort of surprised everybody and surprising me that we're dealing with this. It surprised the other vendors who are out there who didn't know who got wind of this sort of last minute. And it comes up to us at the last minute.'",
        "'speaker_11': 'So I think that in all fairness, for everybody to be equal on level ground, in terms to be competitive, to go ahead and do that, and we have commitments right now that we need to meet, let's meet them.'",
        "'speaker_11': 'But I think what we need to do is make sure that when we are awarded the more two or three year contract, that it's that it goes out to bid.'",
        "'speaker_2': 'And I and thank you for that clarification, and I don't disagree with you on any of that. My concern is for any projects that we've already committed to paying for or projects that they're waiting to be paid on that have been scheduled because those those palm trees, you know, when when they don't get trimmed, they're incredibly dangerous'",
        "'speaker_2': '. We had one fall on a, you know, neighbors car recently in our community. And we need to yeah. So we need to make sure that that that trimming takes place. But I agree with you on the inclusiveness of the bid process and the transparency.'",
        "'speaker_2': 'I just want to make sure that your motion, you know, basically supports us moving forward and paying the bills for the expenses we've already incurred and paying the cost of anything that is in the process of being done and then making sure that we go through a transparent process, as you've indicated, in terms of who we're going'",
        "'speaker_2': 'to award the contract to, is that okay with you? Are we on the same page on the substitute? Okay. Thank you.'",
        "'speaker_0': 'Councilmember Richardson.'",
        "'speaker_10': 'So contracts are are protested all the time. And people come to the council, they protested the I think it was the library. This stuff happens and rarely am I ever compelled by someone who lost a bid because city staff typically has a methodology for why that subcontractor was selected.'",
        "'speaker_10': 'Tonight, there was a compelling argument that that process hasn't gone through, and that's the process that that is the process that we should all take pride in. And we should be able to say we do have a public process that does value minority owned businesses, women owned businesses, local businesses.'",
        "'speaker_10': 'And when we when we circumvent that process, we expose ourselves to. To a discussion that I really don't want to be a part of. So. So that said, I mean, I'm going to support I'm going to support the substitute motion and I really want a review.'",
        "'speaker_10': 'I think we should have a discussion at some point about this process. I've never heard of this piggybacking until tonight.'",
        "'speaker_0': 'Thank you. Next, we have Councilwoman Price.'",
        "'speaker_2': 'In terms of the substitute motion. And again, just to clarify it. Is the maker of that motion. Okay. With staff coming back to us next week on that part, one option and letting us know exactly what happened, how they came up with that recommendation and what the RFP timeline, if that's what we chose to do, would be'",
        "'speaker_2': 'to give them some time to come back to us on that first.'",
        "'speaker_11': 'They could do that. What we're looking for is a clarification and more transparency in regards to the process. It's all about the process.'",
        "'speaker_0': 'That's good. That's not going directly to RFP, though. That's different than the first time. So what I'm hearing then from what the substitute now is, is to have staff come back at the next council meeting and explain not.'",
        "'speaker_0': 'So you didn't accept that. Okay. So I want to make sure quickly different motions here and I want to just be very clear about what they are.'",
        "'speaker_11': 'Council to pay our bills and go up to our people per.'",
        "'speaker_0': 'Council. Council Councilmember, your rank is motion, as I had understood it prior to the question was to directly go to RFP on the first part and then to to pit to pay for the second piece. The original motion, which was I believe made by Councilman Price, is to also pay the bills section.'",
        "'speaker_0': 'But then on the first part, to give staff some additional time to come back and kind of walk the council through how they got to that process. And I believe to meet with the or have a discussion, at least with those that are have an issue with with the contract being awarded this way.'",
        "'speaker_0': 'Is that correct? Mr. West.'",
        "'speaker_5': 'Yes, we did. And again, we'd be comfortable with the substitute that gets the work done on the Tidelands. And again, I am hearing perhaps we do need a discussion with the new Council regarding the piggybacking policy as well.'",
        "'speaker_0': 'So that's separate. So there's two, there's two motions. So. Councilwoman Gonzales.'",
        "'speaker_2': 'I think my questions were answered about the piggyback because I want to get more familiar with it as well. So that's about it.'",
        "'speaker_0': 'Okay. Mongo. And then we're going to vote.'",
        "'speaker_3': 'So I'm going to be supporting the original motion, which I don't know if I was the second on it or not. Mostly because I want to follow through with the process as it was started so I can find out what happened before I make a vote to go out to bid.'",
        "'speaker_3': 'I want to have a full understanding because I don't think that we have all the information yet. And so I'd like to say that I'll be okay.'",
        "'speaker_0': 'So now we have the substitute motion, which is the Durango motion. Please cast your votes. Well.'",
        "'speaker_1': 'Motion fails. Four votes. Four votes? No.'",
        "'speaker_0': 'Now we have the original motion, which is to come back, have council come to have to come back. And the second part will be paid. The first part would come at the council members. Please cast your vote.'",
        "'speaker_1': 'Let me capture the no's on the previous vote. Please cast your vote.'",
        "'speaker_0': 'Please cast your votes. This is the original motion.'",
        "'speaker_1': 'Motion carries seven votes, one vote no.'",
        "'speaker_0': 'Okay. Can I also ask Mr. West, there's been enough discussion about this provision that I think it deserves a conversation either at the council or in the member for matters. I think clearly the council wants to talk about the process as far as moving forward itself.'",
        "'speaker_5': 'Mayor Councilman, I totally agree. And if we're going to continue to use that policy, I want to make sure it is supported by the Council.'",
        "'speaker_0': 'I also think it's important that this issue come back ASAP. So at the next council meeting, if we can please have this issue back on the council agenda. Sir. Okay. Next item.'"
    ],
    "Recommendation to adopt resolution declaring a shelter crisis; suspending applicable provisions of local law, including those contained in the City's zoning ordinances and regulations; and authorizing the operation of a winter shelter between the dates of December 1, 2014 and March 15, 2015, inclusive; and  Authorize City Manager to execute any and all documents necessary for a Lease between Eddie N. John #1, a limited liability company (Lessor), and the City (Lessee), and a Sublease between the City (Sublessor) and the Long Beach Rescue Mission (Sublessee) and/or affiliated entities, and any necessary amendments at the discretion of the City Manager for approximately 12,000 rentable square feet of industrial space at 6845 Atlantic Avenue at the monthly base rent of $6,000 for use as a winter shelter, and increase appropriations in the General Fund (GP) in the Department of Health and Human Services (HE) by $21,000.  (District 9)": [
        "'speaker_1': 'Item. Item 19 is a report from the Health and Human Services Department with the recommendation to adopt a resolution declaring a shelter crisis for the operation of a winter shelter from December 1st, 2014 and March 15, 2015. Inclusive and authorize the city manager to execute a lease and subleases for 12,000 square feet of rentable of industrial space'",
        "'speaker_1': 'at six, eight, four or five Atlantic Avenue.'",
        "'speaker_0': 'Can I get a motion? Councilmember Richardson, you want me to cut some comments?'",
        "'speaker_10': 'Sure. Just quickly. The winter shelter is an asset to our city county fund. It provides a resource for folks who may not have a place to sleep during those cold months. They're brought into my district. It's happened the last few years.'",
        "'speaker_10': 'They brought in by by their busting. There's no impact on the neighborhoods. That said, you know, I just want to encourage city staff. Going forward, we should talk about like a long term strategy every year. So we're not in a place where every year we're figuring out where the stretch shelter, where the winter shelter are going to'",
        "'speaker_10': 'be located. I think we should, you know, place a value on a lot of these homeless folks, many of which are many of whom are veterans. We should have that conversation before this comes up yet again next year.'",
        "'speaker_0': 'Thank you. Public comment.'",
        "'speaker_8': 'Please.'",
        "'speaker_5': 'Good evening. Mayor and council members. My name is Robert Props. I'm the executive director of the Long Beach Rescue Mission. And I'm just here and in good faith. First of all, to say thank you. Thank you for your support.'",
        "'speaker_5': 'And also to let you know that Health and Human Services has been doing an outstanding job, working with us, collaborating on how to do a better job helping the homeless. We've we've been running such a great shelter that just just last year they called it probably the cleanest and well, the cleanest and best organized shelter in in'",
        "'speaker_5': 'the county of Los Angeles. But I want you to even know we're even going to raise the bar a little bit. We're taking it to a whole nother level because, like Councilman Richardson said, that it's a continued problem and we need to do something better and how we can handle this better.'",
        "'speaker_5': 'So we're really looking to take it to another level as far as. Just instead of just more than a shelter and food, to actually give them an opportunity for a life change, and that's to case management and really showing them and pointing them in the right direction.'",
        "'speaker_5': 'So I just basically, I'm here out of good faith saying that's what we're committed to. I like what you said. Councilman Richardson, I have some really good ideas for the future, the route that the rescue mission actually owns property.'",
        "'speaker_5': 'And we like to think we have a permanent spot where we could work on something like that. So thank you all. Appreciate each and every one of you.'",
        "'speaker_0': 'Thank you. Any other public comment on the item? Seeing none there. Can we have a motion, Councilman Richardson? Yeah. Would you move? Was there a second? Okay. Gonzalez, please cast your vote.'",
        "'speaker_1': 'Motion carries eight votes 20. Item ten is a report from Long Beach Airport with a recommendation to execute an agreement with Paradise, Long Beach for a period of five years for one time. Early opening assistance services in the amount of $200,000.'"
    ],
    "Recommendation to authorize City Manager to execute a Fourth Amendment to Contract No. 32168 with BiTech Construction Company for the annual contract for concrete repairs and related improvements, increasing the contract amount by an additional $3,000,000, for a total amount not to exceed $15,000,000, and extend the contract term to December 30, 2015 at the discretion of the City Manager.  (Citywide)": [
        "'speaker_1': 'Motion carries eight votes. Yes. Adam 2525 is a report from the Public Works Department with the recommendation next year an amendment to a contract with Vitek construction and the amount not to exceed $15 million.'",
        "'speaker_7': 'It's been a motion as a second. That's member Andrews.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_7': 'And Mr.. Good to you.'",
        "'speaker_5': 'Yes, I have. The name is Larry Good. You Kirk, as he address the questions I have on number 25 or identical to the item number and the question, the issue of number 26 coming up, I will not take the total of 6 minutes, probably about 4 minutes.'",
        "'speaker_5': 'And let me say to the counsel and also to Mr. Comey that. I have complete confidence in our Director of Public Works and our Director of Parks Recreation and Reed and had we had had our city manager in Jerry Miller or Jim HANKLA this question these questions would not that I'm going to ask would not have to'",
        "'speaker_5': 'be raised. And had we had Ernie Cal or Beverly O'Neill as the mayor, it would not be raised. But to to ask the questions that are need to be focus in. And my questions are have to do with two or really a one sentence or tail end of the sense it refers to the work is repairs and'",
        "'speaker_5': 'related improvements, repairs and related improvements added that language is in both of those contracts. What brings rise to the issue is the criminal rules relative to tools which blindsided the good director of Parks, Recreation, Marine, blindsided the director of Public Works and blindsided the new councilperson.'",
        "'speaker_5': 'When Marine Stadium two s was taken down. And without any contract, the normal contract coming before this council. And some black ops groups within Mr. West's shop came up with a contract that was signed. One month before the California Coastal Commission sat in Bank.'",
        "'speaker_5': 'To approve the two ads issue. This all tolls to the issue of again. I'd like to get an answer. And it's easier to answer. The question can be answered here or eventually if the grand jury. Want to make sure.'",
        "'speaker_5': 'What the repair what the related improvements are. And again, the issue of that goes back to that other contract. There was no contracts that specifically stated Marine Stadium two was going to be taken down, period. Set aside the fact that the contract was signed.'",
        "'speaker_5': 'A month, six weeks before or four weeks before the California Coastal Commission met in Bank to decide the issue. What that tolls do is that simply our city manager and the mayor cannot be trusted. So I'd like to find out what assurances we have and have those assurances given under oath as to specifically what the related improvements'",
        "'speaker_5': 'are going to be. And. To pass that without. Without securing that information and placing it in the public record so Mr. Comey can hear it tonight or tomorrow morning whenever he views this and the public knows. I don't think it's good judgment to pass this.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Thank you. Members. There's been a motion and a second on item 25 saying no further comment, please cast your vote. I mean. I mean. Yes.'",
        "'speaker_1': 'Motion carry somewhat, yes. I'm 26.'",
        "'speaker_7': 'Councilmember Mongeau would like to cast her vote. Are you? And I'm a council member.'",
        "'speaker_1': 'Are you and I? Okay. Motion carries eight votes. Yes.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_7': 'Item 26.'"
    ],
    "Recommendation to authorize City Manager to execute a Third Amendment to Contract No. 32487 with CJ Concrete Construction, Inc., for the annual contract for concrete repairs and related improvements, increasing the contract amount by an additional $5,000,000, for a total amount not to exceed $18,000,000, and extend the contract term to December 30, 2015, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_1': 'M26 is a report from Public Works with the recommendation. Authorize a contract with CG construction company an amount not to exceed $18 million.'",
        "'speaker_7': 'An emotion. I can't remember. Andrews Was there a second? Item 26.'",
        "'speaker_1': 'Their second.'",
        "'speaker_3': 'It's her second. Second.'",
        "'speaker_8': 'Thank you. The CDC.'",
        "'speaker_7': 'Thank you. Councilmember Richardson.'",
        "'speaker_10': 'Thank you. So with these bus shelters, I have a number of questions about this process. Five years ago when we began. Well, when we began this process of contracting out, that's.'",
        "'speaker_7': 'Item 27.'",
        "'speaker_9': 'Or so.'",
        "'speaker_7': 'This is the J.C. Taco I'm sorry, KBS taco item is 27.'",
        "'speaker_10': 'That's why I didn't second the motion.'",
        "'speaker_7': 'We'll dispense with tricks soon enough. So, members, please cast your vote on item 26, which is for concrete repairs and related improvements. And I'm a yes.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Motion carries a vote. Yes. Item 27.'",
        "'speaker_7': 'Councilmember Richardson.'"
    ],
    "Recommendation to authorize City Manager to execute a five-year Agreement with CBS-Decaux to construct and maintain ad-bearing bus shelters, with an option to extend the agreement for two (2) additional five-year terms.  (Citywide)": [
        "'speaker_10': 'So I'm not making a motion right now.'",
        "'speaker_3': 'Oh, okay.'",
        "'speaker_10': 'I want to talk all my.'",
        "'speaker_3': 'I'll make the most sense of it.'",
        "'speaker_5': 'All right.'",
        "'speaker_7': 'Just so we might.'",
        "'speaker_10': 'Make a substitute, I'm not sure. So. Okay. When we started putting ads on bus shelters, there was a larger discussion within the city about these should be intended to provide a benefit to the city. So the first time this happened, and I'm going to ask city staff to elaborate a little bit when this happened initially they purposed'",
        "'speaker_10': ', I think like the first five years of this two of these resources, which were about $360,000 a year to go to youth services. The way that the city met that that sort of idea was they purposely it to pay for the rent on the power center power centers long gone.'",
        "'speaker_10': 'That's fine. And I don't want to beat a dead horse, but we're we're at the we're at a place where we're renegotiating and we're executing another five year agreement on these shelters. And I think there's a few questions that need to be asked.'",
        "'speaker_10': 'I think, one, where are the shelters going to be located? Right. I'm going to run off a list of them where the shelters are going to be located. What's the condition of these shelters? Many of these bus shelters are rundown.'",
        "'speaker_10': 'The Long Beach Transit doesn't have the means to update a lot of these shelters. A lot of them get painted and spruced up. But really, it comes from project costs in one time costs to spruce up a bus shelter.'",
        "'speaker_10': 'Are we taking that into consideration here? Just a question for me. And and then lastly, should we have a discussion about like if we're going to renew this contract, are we receiving some larger public benefit rather than just placing blight on our our bus shelters?'",
        "'speaker_10': 'So those are some questions for city staff.'",
        "'speaker_7': 'Mr. WEST.'",
        "'speaker_5': 'I'm going to turn this over to our budget manager, Leah Erickson. And then we also have Ara Malloy in to help out.'",
        "'speaker_3': 'To the council member, we are receiving approximately $350,000 a year for this contract in the past, and that is the amount approximately that we're going to be receiving going forward. And that amount is deposited into the general fund and it is used as all general fund resources are used for the services that City Council has prioritized as'",
        "'speaker_3': 'part of the annual budget appropriation. So it is not specifically earmarked, which would be a bad financial policy to earmarks, dollars that could be going to the general priorities of the city council. So right now, if it were to be earmarked, it would be a it would be cause a resource allocate reallocation from other.'",
        "'speaker_8': 'Respectfully, I'm.'",
        "'speaker_10': 'Not asking for an opinion on I have specific questions, I'm not asking for an opinion.'",
        "'speaker_3': 'But over to our Malloy and for the other questions.'",
        "'speaker_6': 'Honorable Richardson In regards to bus shelter, these are existing bus shelters. They're not putting any new ones. And they're basically it's the advertisements on these bus shelters. If you and they are supposed to maintain those bus shelters, if there is any issue with any of those bus shelters, I would like you to bring it to my attention'",
        "'speaker_6': '. I'll have them fix it. But that's part of the contract for them to maintain those bus shelters as much as possible. And that's that's my answer to your first question.'",
        "'speaker_7': 'So Mr. Malloy and I wanted to weigh in a little bit of Councilmember Richardson will allow me to. So in Santa monica, we don't have bus shelters, but we have them outside of the city of Santa monica. So in all the bus stops where some of the bus stops in Los Angeles, and so depending on who the'",
        "'speaker_7': 'contractor is, if there's a problem with cleanliness or the the condition of the bus shelter, we ask constituents to call CVS directly if they're the vendor, if they're the installer or another company. Or we ask them to call the transit agency.'",
        "'speaker_7': 'So I get calls at the big blue bus for bus stops outside. And so there are ways to have these bus shelters addressed if they're not in the right condition. And they should be. My recommendation to staff is ensure that Long Beach Transit is part of that, that tree of complaint process.'",
        "'speaker_7': 'Otherwise it shouldn't. I understand that it's an on city property, but it should not be just the city's responsibility to ensure that they're in good condition, whether the revenue comes here or not. So I would appreciate knowing from our public works director what his thoughts are and how these complaints can be processed.'",
        "'speaker_7': 'Because there are I don't know them specifically, but bus shelters aren't maintained unless someone points that out. I wish they were, but they're not always.'",
        "'speaker_10': 'My vice mayor. I think we should get to those. But my questions were not answered by city staff and I'm still so forgive me.'",
        "'speaker_7': 'I just know I interjected. I don't think you're finished answering your questions. Interjected on that bus stop. I want to.'",
        "'speaker_10': 'I want to restate and thank you very much. And I'm fine. But the question was where are they located? What is the public what is the perceived public benefit of renewing this contract? There's obviously like putting we're going through a whole discussion about billboards because there's a perception that these advertisements are blight.'",
        "'speaker_10': 'There's a public benefit to like, they're contributing money to our cities. So I think we should have a discussion about what's the benefit there, and then why are we negotiating the same value as we did five, ten years ago?'",
        "'speaker_10': 'Like, has the value of these ads increased over the last decade? Right now, we're negotiating for the same amount of money today that we negotiated last time. So I would like those questions answered. I'd like this question answered today, otherwise I'll probably make a.'",
        "'speaker_5': 'Motion or something.'",
        "'speaker_7': 'Mr. Malone.'",
        "'speaker_6': 'Honorable Richardson, I can't tell you where they are exactly at this point. I don't have a list of all those locations. I can get it to you as soon as possible, if that will satisfy you. As far as your second question, what is the public benefit?'",
        "'speaker_6': 'Obviously, we're receiving 300,000 or 350,000 cars, as Ericsson mentioned, that goes into the general fund. I guess that's the nexus as far as the public benefit is concerned. And this went to RFP. There's only nobody responded, but except the same company.'",
        "'speaker_6': 'So we did try to find a competitive bidding process, but unfortunately nobody else was interested except the same company who was incumbent.'",
        "'speaker_7': 'If I might ask. This relationship started in 1998. Do you have. Do you have knowledge of what the revenue was to the general fund, say, in the last five years? I think because the way this is written, it's either $140 per bus shelter or 20% of gross revenue, whichever is greater.'",
        "'speaker_7': 'I'd like to believe that we've been leaning on the 20% side rather than $140. So if this Ericsson or Mr. Malone can answer that question, I think that would help move this conversation a little bit further.'",
        "'speaker_6': 'Unfortunately, I don't have that data since I was not around in 1998, but we can get that information to you.'",
        "'speaker_7': 'So I think it would be very important before this council makes a decision, because it's it's a it's a very unique industry. There aren't there are not a lot of there are not even many there are barely a few companies that actually can respond to this type of RFP.'",
        "'speaker_7': 'I'm curious why only one responded and why. Similar to Mr. Councilmember Richardson, why we would negotiate the same rates. It may be that that $140 or 20% of gross revenue, whichever is higher, is the industry standard. If that is, I think we need to be told that confidently.'",
        "'speaker_7': 'Otherwise, we are creating a subset of a billboard policy that I don't think this council intended. And I appreciate the revenue, Ron. We all are council members and in a city that struggles with revenue and preserving revenues, I don't think any one of us is looking to erode a revenue source, but we do have an approach toward'",
        "'speaker_7': 'billboards and bus advertisements are no different. And I will.'",
        "'speaker_3': 'I will.'",
        "'speaker_7': 'Mention my I'll mention Santa monica one more time. There are no billboards in Santa monica except for one that's been grandfathered. And that's why they don't allow bus advertising. I mean, advertisements at the bus shelters because it's technically outdoor advertising.'",
        "'speaker_7': 'So how we have that two tiered policy without the council weighing in on it, I think is interesting at best. But we should have that conversation. Councilmember Richardson.'",
        "'speaker_10': 'So that said, what I'd like to do is I'd like to add a subject to motion to and I might want needs to return to weigh in on this but to come back. With this after you've like considered either, you know what I'm going to say?'",
        "'speaker_10': 'Recirculate the RFP with a specific intent to have a larger benefit. A greater benefit. And I'd like to see if there's a way to see if, like, we can improve the general condition of our bus shelters through this process if we're going to advertise, they need to be the best bus shelters in Southern California if we're going'",
        "'speaker_10': 'to advertise in our neighborhoods on it. So I would say, like, go back to the table. Go back to the table. Recirculated RFP. Or maybe I'll say maybe I'll put it as a question for our the motion if we wanted to go back and get a better deal.'",
        "'speaker_10': 'What will be our methods, our triggers to do that?'",
        "'speaker_6': 'Well, obviously this was a competitive process and nobody else is interested besides this company we can recirculate. I'm not confident you're going to get any better deals.'",
        "'speaker_10': 'What do you think the issue is?'",
        "'speaker_6': 'I think I would like to know if the council is interested in having bus shelters or not, because basically the nexus is they're providing bus shelters with the ad. So they're providing a service to the city, providing a shelter for the residents and users of the transit.'",
        "'speaker_6': 'And the benefit that we're getting is the advertising plus some cash counts.'",
        "'speaker_5': 'If I can interrupt, Councilmember and Mayor, you certainly could increase the monetary benefit by going digital, and we don't allow that at this time.'",
        "'speaker_7': 'I'm sorry, what did you say.'",
        "'speaker_5': 'To go digital?'",
        "'speaker_7': 'Right. So, Councilmember Richardson, just so I can clarify. There is a benefit to the shelter it provides. Certainly, it provides shelter from the inclement weather that we have here. But there is that benefit. But it does need to be maintained.'",
        "'speaker_7': 'Well, so that that's not.'",
        "'speaker_10': 'I mean, I think, you know, where I want to go here. I want to and I'm going to make you know what? Let me just make this motion I want to direct it to. Yes. I'm sorry. I want I want to I would make a motion to receive and file this and come back with a greater plan'",
        "'speaker_10': 'on how we can utilize the opportunity to provide bus shelters for greater benefit, including improved conditions of bus shelters. That's that's what I that's what I want to do.'",
        "'speaker_7': 'So there's a motion I have to councilmembers cued up. Is there a second for that motion?'",
        "'speaker_10': 'I got a second.'",
        "'speaker_7': 'Okay. Councilmember Mongo.'",
        "'speaker_3': 'Could could finance answer for me when the current agreement ends and if there'll be a loss of revenue if we don't, what are the implications of not approving tonight? How far of a lead time where we give in as a council to discuss this?'",
        "'speaker_6': 'The original agreement expired on December 31st, 2013.'",
        "'speaker_3': 'So. Okay. Let me let me take a side note. I'd like to find out if in open new business, I need to make an item. I'd like to know all of our expired agreements that are currently in effect, but not on the back burner for a quick second.'",
        "'speaker_3': 'That would be that would be city wide, please. This is not just directed to finance and or. Right. And I understand there's many complications and RFP than sole sources and all of those things. I work in this world.'",
        "'speaker_3': 'I understand it. But more specifically, are we currently operating under the prior agreement receiving revenue today?'",
        "'speaker_6': 'Allow me to correct myself for continues that conversation. The existing contract expired on December 31st, 2013. There were two extensions that city council approved. So we're at the end of the last extension with expires on December 31st of 2014.'",
        "'speaker_3': 'And under the agreement as written, were we given an option for an additional extension?'",
        "'speaker_6': 'We can check into that if if that would be amicable to continue either on a month to month basis or on a short duration, six months or whatever times it takes. It took it took us about six months to get get through this RFP.'",
        "'speaker_6': 'So yeah, it's not an easy task. There's a lot of steps that we have to go through. But whatever your wishes, if you wish us to go to another RFP, we will do that. If you have additional comments, we can make sure that it's incorporated into RFP.'",
        "'speaker_4': 'It's.'",
        "'speaker_6': 'It's up to the city council. How do you want us to do it?'",
        "'speaker_3': 'Well, I don't want to have a loss of revenue to the general fund. We are already experiencing record well, not record, but near record setting lows in our oil revenue. So I want to be cautious about the revenue coming into the city and protect what we have to ensure that no services need to be cut and that'",
        "'speaker_3': 'we can afford what we've already committed to. If if we are coming to the end of an extension period, I would. I'd like to at least keep options in place. How long is this extension for? Five years. An additional five years.'",
        "'speaker_3': 'Correct. What are the opt out options?'",
        "'speaker_6': 'It's basically a five year contract with options to add another two or more years. Two additional years and also there are termination clauses.'",
        "'speaker_3': 'So in the termination clauses, either party.'",
        "'speaker_6': 'Could terminate.'",
        "'speaker_3': 'For cause or no cause.'",
        "'speaker_6': 'I, I believe it. You know.'",
        "'speaker_5': 'It was not.'",
        "'speaker_6': 'It could be mutual.'",
        "'speaker_3': 'Okay. I need to think about this for a few minutes.'",
        "'speaker_7': 'Councilmember Austin.'",
        "'speaker_9': 'Thank you. And along the same line of questioning and I'm concerned about the potential lost revenue here, I'm actually in support of the staff's recommendation on this this motion, this particular item. But I do appreciate Council Member Richardson's questions on this.'",
        "'speaker_9': 'If we can get more out of it, I think we should. But understanding that we are in the second extension, I think is a bit concerning. He's talking about community benefit and where's the community benefit here? And I just want to remind the council that this particular contract did have a significant community benefit at one time and'",
        "'speaker_9': 'that it. Helped provide youth services at the Palin Athletic Center in North Long Beach, and it was dedicated toward that for many, many years. And at some point, I think we lost our way as a council, and particularly when we talk about a community benefit, it's now a general fund item and it's funded toward the general fund'",
        "'speaker_9': '. And, you know, yes, it's it's it's it's supporting the entire city in some incremental way. But I would like to get back to that discussion and repurpose this these funds at some point during the budget conversation toward youth services and youth programs and to to to deal with the community benefit component that Councilmember Richardson spoke about.'",
        "'speaker_9': 'And like I said, I think we we could we could really see a true benefit from from these dollars if we were to put them into youth programs in our districts currently where we were funding our Be Safe summer programs with one time funds.'",
        "'speaker_9': 'I think this is a structural way to deal with that that issue. So I'm going to go back and just to say, Councilmember Richardson, I think you made some excellent points, but I think the timeliness of this is it would be prudent, prudent for us to support the staff recommendation.'",
        "'speaker_7': 'Thank you, Councilmember Austin. And I wanted to just share I, I support the staff recommendation as well, but I would like to know from staff and perhaps staff can let us know how quickly they can get this information back to us is what is the industry standard for negotiating the revenue share on bus shelters?'",
        "'speaker_7': 'I don't while I'm in the industry and in advertising on busses, I don't know that because I don't we don't do bus shelters, so I don't have the answer. And I know we have a couple of speakers lined up or we'll queue up and they can maybe share that.'",
        "'speaker_7': 'But I think those are valid points is why are we having in the same arrangement that we had in 1998, if that in fact is the industry standard, we need to know that. Councilmember Price.'",
        "'speaker_2': 'Thank you. I just wanted to say that I agree with council member Austin and I support staff's recommendation as well. I think he makes some excellent points things.'",
        "'speaker_7': 'Councilmember Richardson.'",
        "'speaker_10': 'So just quickly. So is there a this is a good question about the revenue where we're based, we're budgeting based on that is our way to continue to receive this revenue before we lock ourselves into another five year deal.'",
        "'speaker_7': 'Yes. That's what Mr. Malloy had had responded to earlier, that we can we can continue in this extension.'",
        "'speaker_10': 'No. This is a five year.'",
        "'speaker_7': 'How to you asking for? I'm sorry.'",
        "'speaker_10': 'So what I said was come back. Come back, like receive and file these and come back. But I think I'm going to change it because I don't want to like create some unintended consequences. I would say if there's a strategy to go to a month to month basis, why we like renegotiate with them like a month to'",
        "'speaker_10': 'month contract. And a greater question is like this, 340 $300,000 would receive this $300,000 receive annually. Is it like a monthly check they would receive? Have you received it? Received it for this year? Like, what is our real exposure?'",
        "'speaker_10': 'The contract ends, but like when is when is our budgetary exposure for this window? When? When will we have a deficit if we ended the contract works?'",
        "'speaker_5': 'If if indeed Councilmember the the contract was over in December 31st, that would begin. We no longer be in receiving a proportion of the $350,000. I was just chatting with Mr. Park and we could postpone this decision that the Council wanted and respond to the Vice Mayor's comments by going back to the company and asking their permission'",
        "'speaker_5': 'if they would go forward with a month to month. Right now, we don't know that. I suspect they probably would, but their contract expires December 31st and they're kind of in the driver's seat on whether they would go forward with a month to month or whether they want us to pull the trigger.'",
        "'speaker_10': 'So I would say that what I would say is. Like I don't want like every everything folks brought up makes a lot of sense, but I don't want to lock ourselves in. And when we're in the budget conversation, we're in the middle of a five year contract.'",
        "'speaker_10': 'Next time we talk about the budget. So as a matter of process, what I'd like to do is change my motion, like change my motion if the second year of the motion would agree or if somebody else wants to rethink seconded, I want to change my motion to say between now and the end of the contract, direct'",
        "'speaker_10': 'the city manager to go back, see what they if they would be amenable to a month to month until we renegotiate with them. I go through a process to renegotiate, since they're the only ones who responded for greater benefit than what we negotiated 15 years ago.'",
        "'speaker_10': 'So that would be my my motion. So it doesn't stop us. It doesn't give us any. It doesn't stop our our ability to still our general fund to benefit from this.'",
        "'speaker_7': 'If I might ask Mr. Parkyn to weigh in, we have gone out to RFP and so there are certain obligations. I think that combined with that. So if you can address.'",
        "'speaker_5': 'That, right, I think hearing Councilman Richardson's direction, what you would have to do then is reject this proposal and direct staff to see if they could maybe negotiate either a month to month or another short term extension, six months or whatever staff believes is the appropriate time to do a new RFP.'",
        "'speaker_5': 'And that's assuming you either they bid again or you get other proposals to see if you can make the change, the compensation that you're receiving. So, yes, I think you have to either accept or reject this or direct staff to come back in a short time period if they want to extend that contract.'",
        "'speaker_7': 'Thank you, Mr. Park and Councilmember Mongo.'",
        "'speaker_3': 'I think I have even greater concerns with we as a city wrote an RFP and I think we've talked about this as a council in public forum before. Related to maybe we should be a part of that process because what I don't want to do is responding to an RFP is an extensive process that's expensive for a'",
        "'speaker_3': 'business to participate in. And so if a business in good faith fulfills the requirements of the RFP as we put forward, we need to have some good faith. We hear a lot about how hard it is to do business in Long Beach.'",
        "'speaker_3': 'We don't want it to also be very difficult to do business with Long Beach. And so I appreciate that there are some ways to step out of this in the future. I think there's a lot of opportunity for our by Long Beach at Long Beach adopt Long Beach shop Long Beach to be incorporated into this in some'",
        "'speaker_3': 'way with any vacant space, if there is any, that would come to Economic Development Committee. But for the time being, even though I have passion for all of those options, I also don't want to provide that risk to the city in terms of the loss of revenue.'",
        "'speaker_3': 'So I'm going to support the staff recommendation at this time, and I think we should continue to look at this and be involved a little bit earlier in the RFP processes, because I want businesses who bid to know that we will follow through when they win.'",
        "'speaker_7': 'Council member, Austin.'",
        "'speaker_10': 'Point of order. My, my, my motion didn't get a second. Right. So we're on the original motion, right? Okay. You want to just withdraw it because you're in support of the I mean, I would withdraw it if the second do I need a permission to.'",
        "'speaker_10': 'I'm going to withdraw my motion my sec my substitute motion.'",
        "'speaker_5': 'Is that in agree is a second in agreement. That's a consensus of the body. Yes.'",
        "'speaker_7': 'Was there. Who was? Who's the maker of the original motion? I.'",
        "'speaker_3': 'Of course I was. Jeremy Corbyn.'",
        "'speaker_7': 'Thank you. And I do support the staff recommendation, but I. Mr. West, I want us to pay close attention to the issues that Councilmember Richardson raised, and that is, we don't know the value of this. And so in this is not a good preparation of our council members.'",
        "'speaker_7': 'We don't have what industry standards are. We have nothing to compare it with. And so I think that we'd be better served knowing that as opposed to learning staff went out to RFP. Here's our recommendation and there you go.'",
        "'speaker_7': 'It's very tough to make a decision like that. I work in the industry and I don't feel like I can tell you right now if $140 a shelter or 20% is standard. I don't know. We need to know those things.'",
        "'speaker_7': 'Okay. There's been a motion and a second public comment. So anyone from the public that was to comment on this item. Okay. The motion is to adopt staff recommendation with a request to city staff to come back with some information to to the council.'",
        "'speaker_7': 'All those in favor. Please cast your vote. Me? Yes.'",
        "'speaker_1': 'Motion carries equal tears. Item Pollinators report from public works with a recommendation. To work toward a contract to all American asphalt for improvements on Ocean Boulevard between Livingston Drive and Bayshore Avenue in an amount not to exceed $1.6 million.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 2.01.210.B, 2.01.340.B, 2.01.370, 2.01.390, 2.01.420, 2.01.810, 2.01.1010, 2.01.1030, 2.01.1210, and 2.02.010; by adding Section 2.01.395; and by repealing Sections 2.01.330, 2.01.350, 2.01.610, 2.01.620, and 2.01.730, all relating to the Long Beach Campaign Reform Act and Campaign Disclosure Statements, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Is a recommendation to declare an ordinance amending the municipal code relating to the Long Beach Campaign Reform Act and campaign disclosure statements read and adopted.'",
        "'speaker_0': 'Kim has been in motion in second. Any public comment on the item? Please.'",
        "'speaker_5': 'Yes. If the AMCU AMCU board wondered where that stench was coming from, I think we know. At least I. You should never put it. This puts the council on a war footing. With the voters. If the voters pass this, then you should have the intellectual integrity.'",
        "'speaker_5': 'To go back to the voters and say, look. This is in your best interest. Revise it. If you if your candidacy is legitimate. And you're doing a good job. You shouldn't have a problem raising money. Capital of the people supporting this.'",
        "'speaker_5': 'Or one of them said, well, it makes it easier for us. With all due respect, it's not you know, you're not here to have an easy job. It's tough, no question. Or integrity, in my view. And I think in the view of many people, if you've got you know, if you've got a case, put it forward like'",
        "'speaker_5': 'Martin Luther nailed it to the door. Say, this is what we want to do. Don't try to sneak around at the last minute. At the end of the day or at the end of the first reading, this was what the distant from the majority of the council people.'",
        "'speaker_5': 'Citizens. The odor. You know, the odor is. But it's the stench will linger too long. Thank you.'",
        "'speaker_0': 'Okay. Thank you. As you know, the public comment members, please cast your vote.'",
        "'speaker_1': 'Motion carries eight votes. Yes.'",
        "'speaker_0': 'Thank you. Next item.'"
    ],
    "Recommendation to approve use of Council District 4 funds for various parks and infrastructure improvement projects to be allocated as follows:   Eyes on Anaheim \t\t\t\t\t$85,000   Cameras   Signage   Orizaba Park \t\t\t\t\t\t$20,000   Cameras   Whaley Park Baseball Field \t$410,000   Storage Structure   Field Stands   Stearns Park Baseball Field \t$275,000   Baseball Field III Enhancement   ARC Field Enhancement": [
        "'speaker_1': 'I'm 34 as new business from the office of Customer Patrick O'Donnell, Councilwoman Suzy Price, Councilwoman Stacy Mango and Councilman Al Austin with a recommendation to approve the use of fourth District Council Council District funds for various parks and infrastructure improvements.'",
        "'speaker_0': 'Okay, there's been a motion and a second. Councilman Price, were you cued up?'",
        "'speaker_2': 'I would just like to. Sorry. States that I've talked to Councilmember O'Donnell. And it's his intent that that we approve these District four funds as recommended and allow the director of Parks, Recreation and Marine to use the remaining funds for additional district for park projects as he sees fit and under his discretion.'",
        "'speaker_0': 'Any public comment on the item? CNN. Please cast your votes.'",
        "'speaker_1': 'Motion carries eight votes.'",
        "'speaker_0': 'Next item.'"
    ],
    "Recommendation to respectfully request City Manager to work with the Gateway Cities Council of Governments (GCCOG) to form an Artesia Boulevard Corridor Committee and develop an Artesia Boulevard Corridor Master Plan.": [
        "'speaker_1': 'It's item 35 with it's a recommendation from the office of Councilmember Rex Richardson, Councilmember Roberto Ranga and Councilman Al Austin with a recommendation to request city manager to work with the Gateway City's Council of Governments to form an Artesia Boulevard Corridor Committee and develop an Artesia Boulevard Corridor Master Plan.'",
        "'speaker_0': 'Councilor Richardson, Thank you.'",
        "'speaker_10': 'So the hours late, I want to acknowledge Executive Director Dick Powers for for being here tonight. The Artesia corridor is an incredibly important corridor. It's an alternative to the alternative to the 91, the 91 corridor. And when you look at Alameda all the way to Orange County, you've got the cities of Compton, unincorporated Rancho Dominguez.'",
        "'speaker_10': 'You've got about three miles of Long Beach. You've got a you've got Bellflower, Lakewood and Cerritos. And so we have a unique opportunity here to join those cities in doing those agencies and begin a discussion about the long term vision of this corridor.'",
        "'speaker_10': 'We've had a discussion with with the COG, and they are fully prepared to step up and quarterback this process for us with Long Beach solidly in leadership. So I'd like to ask Mr. Powers just to give us some remarks.'",
        "'speaker_5': 'Excuse me, Mr. Mayor. Council members, before Mr. Power speaks. I've just got to throw a shout out. Dick and I have worked together for a very long time in Paramount. Dick is one of my mentors. He's been the executive director for 20 years since it's been founded.'",
        "'speaker_5': 'He's been a city manager at Garden Grove in Norwalk and the Paramount redevelopment director for a long time in Paramount. So Dick, welcome to Long Beach. And Dick is also in line to be president.'",
        "'speaker_0': 'That's right. I would say the most important parts of it. He lives in Long Beach. Every resident of the second District.'",
        "'speaker_9': 'Yes. Thank you, Pat, for the kind words. Kevin Richardson and I met and he was ironically advancing an immediate solution to our first project. Which one was going to go first? So that's our teachable moment. For the longest time, you know, the Congress done the highway corridor planning and funding.'",
        "'speaker_9': 'We were tasked originally through federal legislation to do subregional planning, and that includes all the highways which we've focused on for the last decade or more 1791, six two, five, four or five. The COG is also the funding conduit for those regional projects.'",
        "'speaker_5': 'The Artesia.'",
        "'speaker_9': 'Boulevard Corridor will be the first one, along with the Florence quarter and to the north where we would take much of the what we learned of this over 17 and 1965 corridors having a policy committee of elected officials a where each city.'",
        "'speaker_5': 'There everybody at the table.'",
        "'speaker_9': 'And the public works officials all performing attack. One of the big.'",
        "'speaker_5': 'One of the things we.'",
        "'speaker_9': 'Have learned in our 20 years with this large base of.'",
        "'speaker_10': '28 cities.'",
        "'speaker_9': 'Plus three case supervisors districts, if we have 100% consensus and a plan, we've always gotten the money and there is always be a first that that's.'",
        "'speaker_8': 'MTA give us allocate.'",
        "'speaker_5': 'Us.'",
        "'speaker_10': '$8.'",
        "'speaker_9': 'Billion of measure over time. So that's the pattern which we would use in the Artesia quarter.'",
        "'speaker_8': 'All of the usual.'",
        "'speaker_5': 'Engineering.'",
        "'speaker_9': 'Issues of the quarter would be looked at capacity, lane improvements, esthetics, landscaping, lighting. But we're also adding a new component, Complete Streets, which would include including pedestrian and bicycle planning in that mix. There's a concept called first mile, last mile where street designs now would look at how does the how does the homeowner get from home to'",
        "'speaker_9': 'the bus stop, say, about last mile? So the.'",
        "'speaker_5': 'Street would then take.'",
        "'speaker_9': 'That into consideration. It may be just as simple as having a bike rack at the bus stop so that the person that lives within a radius can walk to not get the car out of the garage at all, to go walk from home to the bus stop.'",
        "'speaker_9': 'So all those things will be taken into account in our cheeseboard for the first time in the Cox Regional Planning Process. That's pretty much all I have to say. If there's any other questions, we're ready to go.'",
        "'speaker_10': 'Thank you. I just don't think I made the motion so, so moved.'",
        "'speaker_0': 'Because when the motion in a second comes from Boston.'",
        "'speaker_9': 'Thank you. And thank you, Mr. Powers, for being here. And during this meeting, as long as you have. He is a true man of wisdom, and we appreciate his great leadership on the Gateway Cities card. I'm on the caucus as a city representative, as is Councilmember O'Donnell, and I believe Councilmember Urunga will be joining in his place'",
        "'speaker_9': 'very, very soon. I look forward to supporting Councilmember Richardson's vision along with the other cities along Artesia Boulevard, because it is certainly a vital arterial for for for many of the cities in this region. And so I look forward to working with you on that.'",
        "'speaker_9': 'Likewise. Thank you very much.'",
        "'speaker_0': 'Thank you. Good to see you again, Dick. Okay. There's been a motion on the floor. Please cast your vote.'",
        "'speaker_1': 'To make her the motion in the second.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay, Rick. Cindy, thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Motion carries eight votes. Yes.'",
        "'speaker_0': 'Thank you. Now, do the second public comment period. If there's any, please come forward.'"
    ]
}