{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt resolution amending the Master Fee and Charges Schedule.  (Citywide)": [
        "'speaker_2': 'Thank you. Now moving on to our hearing, which is the first item up, we can have the agenda for the hearing. Madam Clerk.'",
        "'speaker_0': 'Hearing item one is a report from financial management recommendations received supporting documentation into the record concluded the public hearing and Adobe resolution amending the master fee and charges schedule city.'",
        "'speaker_2': 'And. Q We're going to go ahead and turn this over to staff. Mr..'",
        "'speaker_1': 'MODICA Thank you, Mr. Mayor. The staff report will be given by Leah Erickson, our Assistant Finance Director.'",
        "'speaker_6': 'Good afternoon or evening met and members of City Council. City Council's approval is being requested for mid-year changes to the master fee and charges schedule. These changes are identified an attachment to the Council letter for the mid-year adjustment process for departments.'",
        "'speaker_6': 'I've proposed a total of 30 fee changes to the schedule, along with eight fee deletions. The master fee and charges schedule is updated at least twice a year to allow departments to meet City Council's stated policy on user fees, which calls for full cost recovery whenever appropriate.'",
        "'speaker_6': 'City Council last approved an amended master fee and charges schedule on September six, 2016 as part of the FY17 budget process. Some examples of fee changes in the report include changes in library room rental fees in order to encourage public use of under-utilised spaces.'",
        "'speaker_6': 'Fees charged to transportation network companies such as Uber and Lyft operating on temporary permit at the airport. And an adjustment parking permit fees that aligns the city's fees with prevailing market rates. The full list of fee changes and deletions is available in the Council letter.'",
        "'speaker_6': 'That concludes my staff report, and Department of Representatives are here to answer any specific questions you may have on any of the proposed fee changes.'",
        "'speaker_2': 'Thank you. We'll start with Councilman Austin.'",
        "'speaker_3': 'You know, just have one quick question. Obviously, this is a staff report is pretty voluminous. What are the what exactly are the feed deletions that you mentioned and where are they at?'",
        "'speaker_6': 'So count Councilman Austin, the attachment A has a two page list and on attachment A page three of three is the list of proposed fee deletions for fiscal year 17, and it includes some changes in library services related to eliminating fees for compact discs, video DVDs and other media type of charges.'",
        "'speaker_6': 'And this is being aligned in order. These fees were collected by the library on behalf of Friends of the Long Beach Library, who pays for the media. And so the Library Department had requested two ladies with books which are being provided free of charge, and so these fees are being deleted.'",
        "'speaker_6': 'In addition, there was a couple of coffee urn charges that are no longer being offered. So those fees are being deleted as well.'",
        "'speaker_3': 'I see.'",
        "'speaker_2': 'Thank you. Council member are actually based on. Richardson. Do you have anything? No plan.'",
        "'speaker_5': 'Customer Pearce Yes, I want to support obviously a lot of this. I did have a few questions that I wanted to just ask quickly about the TNC. It says here that our fee structure is based on the cost of providing the services.'",
        "'speaker_5': 'And so I wanted to understand a little bit more what the cost of providing the services are and whether the $3 fee both for dropping off and picking up came from.'",
        "'speaker_2': 'Yes. Councilmember Jess Romero, Director, I want to just first frame this up, that this is a pilot program, as we had earlier explained to the council when it was approved. The fee itself is based on a number of factors.'",
        "'speaker_2': 'There's a range of fees that we looked at at competitive airports, all in California, most of them here in the L.A. region. And there's a range of fees. They go anywhere from about $2 to $5. And a lot of that is reflective of the fact that each airport is different in terms of its cost structure, what it'",
        "'speaker_2': 'needs to support, or what they call the landside element or the roadways, parking areas that are out, you know, outside of the fence, if you will. So with this research, you know, we believe that the $3 fee for a pick up or dropoff is appropriate.'",
        "'speaker_2': 'And really what this is doing is this is helping us continue to diversify the revenue that is required at the airport. We heard from the council very loudly and clearly when there was a discussion on the FISA vote that financial stability was extremely important.'",
        "'speaker_2': 'And the more money that we make through these programs like this, the less we have to rely on other funding sources, specifically passenger facility charges, which are entirely driven by activity at the airport.'",
        "'speaker_5': 'So will there be these fees be used to invest back in the airport infrastructure parking? Can you elaborate on that a little bit?'",
        "'speaker_2': 'Absolutely. And to your point, this year alone, this fiscal year, the airport has spent about $550,000 on roadway improvements for any recent visitors to the airport within the last few months. They'll notice that the island area that separates the inner and outer curb was lengthened and shrunk to allow for more traffic lanes in front of the terminal'",
        "'speaker_2': 'to ease congestion. We do resurfacing projects all the time, so this actually is just going to go part of the way toward helping us fund or landside element more appropriately so again, that we don't have to rely on funds that otherwise could go to securing debt on the bonds that are outstanding at the airport and other projects'",
        "'speaker_5': '. Last question. I see that the yellow cabs, they have a one time fee and this one is pick up and drop off. Can you just elaborate? And I promise that's my last question.'",
        "'speaker_2': 'Well, again, this pilot here was specifically intended to focus on the T and C's. We just completed a ground transportation study through a consultant. And our goal is over the next several months, but also dovetailing with this pilot period, to gather more information and examine fees for all commercial ground transportation providers.'",
        "'speaker_2': 'The legacy fee, I'm calling it from Yellow Cab is a fee that's been in existence, I think, since the 1980s. There's no doubt that it needs to be updated, but we'll be looking at the appropriate fee structure in the coming months.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_2': 'Thank you, Councilwoman Mongo.'",
        "'speaker_5': 'Thank you. I want to thank city staff for this report. I know that they have to do it twice a year. It is a lot of work. We appreciate that. I do want to, for the record, just put on note that and ask a rhetorical question.'",
        "'speaker_5': 'Leah, can you confirm that any fee made to the fee schedule, which is very lengthy, is outlined in the letter? There are no changes that were not specifically called out in the letter that a constituent who was trying to read this would be confused by.'",
        "'speaker_5': 'Is that accurate?'",
        "'speaker_6': 'Councilwoman Mango Between the the letter and attachment a to the letter, every single fee change or deletion is detailed.'",
        "'speaker_5': 'Just not exhibit A because that seemed a little bit overwhelming to some, but I wanted to make sure that I was accurate in what I had stated. That is correct.'",
        "'speaker_6': 'Exhibit A contains the full list of all existing fees and charges, including any.'",
        "'speaker_5': 'Amendments that were already that are singled out and identified in attachment A to the memo. Perfect. And then secondly, I just want to thank the city staff for their creative approach to parking. Splitting the day, parking, parking in the evening parking really will open up.'",
        "'speaker_5': 'And then the hire. Option in terms of our ability to properly sell parking at those locations currently without actually knowing how many days versus night users you have, you have a limit to how much you can sell. So we've a shortage of those permits.'",
        "'speaker_5': 'And I know that the community and I personally who use some of these downtown lots will really appreciate that they have that differentiator. I think it's a great solution. We've heard the community asking for more parking. This is a way to get there and I think it was.'",
        "'speaker_6': 'Creative and I appreciate the hard work.'",
        "'speaker_5': 'Done on that. And then finally, and to echo the comments of Councilman Pearce related to taxes versus cab and legacy fees, I'd be interested in aligning the legacy fee. I think what's good for one is what's good for all I know in meeting with the cab providers, they said they wanted a level playing field.'",
        "'speaker_5': 'I think the more appropriate way to level the playing field is that everyone move to a per pickup, per drop off fee. And then I would also like to see us explore. The neighborhoods who are around the airport have recently been significantly impacted by people parking on Friday in their neighborhoods and then now there's not any parking'",
        "'speaker_5': 'for their kids birthday parties and utilization of those areas. They're there and parking there for more than the 72 hour limit, which is allowable. And so then they're taking either an Uber or a cab from a nearby location to the airport.'",
        "'speaker_5': 'So they're trying to skirt the fees. They're also parking at our local hotels that are in the area, even though they are not guests in the hotel. So I've seen this and they will park at a local hotel.'",
        "'speaker_5': 'They will get in a cab and go to the airport even though they are not a guest. So I'd like to see a little bit of that money in the first year set aside to alleviate the pains that are being caused by this, as long as it's allowable under the federal rules related to airport revenue.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman Price.'",
        "'speaker_7': 'Thank you. I, too, want to thank staff for the report. And I have a couple of questions. I first wanted to point out that I like the proposed changes, although they don't impact my district with the parking fees and the lots having consistent daytime and nighttime parking fees I think is appropriate.'",
        "'speaker_7': 'And I've talked with Mr. Beck about that, that we shouldn't be charging more for nighttime permits or daytime permits. We should try to have some consistency there. So I like that that's at least being proposed in regards to some some lots that are mentioned in there.'",
        "'speaker_7': 'And the master fee staff letter I did. I have a few questions about the TNC fees as well, and I want to thank the airport staff for taking some time to talk with me earlier this week about it.'",
        "'speaker_7': 'And my concern is really this, and that is if this is a pilot program and we're using it to collect data, why are we not waiting to determine what the fee should be based on the data that we're collecting?'",
        "'speaker_7': 'And if we believe that there is going to be a need to increase revenues in order to offset some of the detrimental impacts of having this additional flow of traffic through the airport, then where did we come up with the $6 amount?'",
        "'speaker_7': 'So if there's any answer to that, I'd appreciate that.'",
        "'speaker_2': 'Thank you. Staff Councilman do to clarify it's some the fee is is a an either or fee. So the way it would work operationally is the customer would be brought to the airport passing into the Geofence system. $3 is added to that fare.'",
        "'speaker_2': 'They have to go out, either leave the it will leave the airport and go on their way to another pick up. Or we have a under the pilot program, we have a holding lot and they can stay there.'",
        "'speaker_2': 'So it's it's it's $3 for either a pick up or a drop off. You know, they won't necessarily do two transactions during one visit to the airport. Again, as I said earlier, as it relates to the fee, we know that it is costing the airport money to maintain the roadways, to do repairs, to do enforcement.'",
        "'speaker_2': 'All of that is is ongoing. That's just as it relates to the expense that up to this point, the airport, other than through what I'm going to call it, fairly nominal fees that are assessed for the permits for these commercial providers.'",
        "'speaker_2': 'We have not kept up anywhere near to what it cost to run the programs. At the very least, you know, it's the goal of the airport at the very least to achieve cost recovery, which I'm not even convinced that we'll get there when this program is complete.'",
        "'speaker_2': 'And again, part of that is collecting the metrics, the data and determining whether or not these fees need to be adjusted at some point in time. So I think it is very appropriate to go into this with a fee.'",
        "'speaker_2': 'It's bracketed by the other fees that are being assessed at the other airports. And again, each airport is different. But based on what I know, we're expanding what staff what I've seen staff information, the data and what we're expecting based on these these trip fees, it's not going to cover these costs.'",
        "'speaker_2': 'It'll get us in the right direction. And as I said earlier, what we're trying to do is diversify the revenues from many sources so that we don't have to rely on fewer revenue centers like parking, airport concessions, things like that.'",
        "'speaker_2': 'So this is really going to help our overall program.'",
        "'speaker_7': 'And I appreciate that because your answer clarifies to me that it's not an arbitrary fee. It's a fee that is designed primarily for cost recovery. So do you envision that after the pilot program, there will be an adjustment to both the TNC fees and any fees assessed on our cab services based on data obtained?'",
        "'speaker_7': 'Or is this is this fee estimated to be able to be sufficient and cover what we think it's going to need to cover?'",
        "'speaker_2': 'Quite honestly, I think it's a little too early to tell. I can I can tell you this with reasonable certainty that the $3 fee, I think, is is a good cost point, if you will, a price point for the operators.'",
        "'speaker_2': 'Again, I think that it's going to help move us toward cost recovery as it relates to the cab drivers and the cab companies. You know, obviously, it and it was mentioned earlier that, you know, the goal is a level playing field and we would we'd obviously support that as well.'",
        "'speaker_2': 'What we'll have to look at is their cost of operating that particular enterprise versus the TNC, which are you know, they're measurably different. So we don't want to discriminate by, you know, necessarily setting one uniform fee it. May turn out that that's what happens.'",
        "'speaker_2': 'I want the data to show, though, you know, what what really is defensible, what is appropriate. And again, our eye is toward really making sure that we're protecting revenue streams and growing revenue streams at the airport.'",
        "'speaker_7': 'Thank you very much. I appreciate it.'",
        "'speaker_2': 'Thank you, Councilwoman. Next up, we have Councilmember Supernova.'",
        "'speaker_1': 'Thank you. I think Mr. Romo just answered all of my questions, but I'll just frame it a little differently. And that is your your wording was the fees are bracketed by the region, almost like a market driven fee.'",
        "'speaker_1': 'But to clarify that there is no correlation between Long Beach and a lake size airport in the region. Cost could be drastically different. Would that be correct?'",
        "'speaker_2': 'Well, I would say we're looking at, I think, within the fee range or the cost or the fee assessed at the airports that we're looking at, especially the airports there between two and $5. So percentage wise, yes, you can say it's drastic, but from an absolute dollar amount, it's you know, I think it's not as big of'",
        "'speaker_2': 'a spread. That said, you know, each airport is a little bit different. And I believe that based on the characteristics and the the cost burden and the requirements at bay at Long Beach, that $3 is a very appropriate fee to start this program.'",
        "'speaker_1': 'Okay. And then that's just on the function of the service. And beyond that, we have the cost of the airport. Not all airports in the region have a new terminal, a new parking structures, etc., to pay for.'",
        "'speaker_2': 'Yes, that's correct. I would say this, though, is that it's not necessarily even in the newness of safe facilities or assets at an airport. In our case, we've got aging assets and things that need more attention. And again, if we don't have to take money from other sources of revenue, that's not much more.'",
        "'speaker_2': 'We can invest in other airport projects. So I believe I'm a firm believer in making sure that elements at the airport, whether it's on the airfield or the landside, that they are being able they're able to generate and extract revenue from various sources in this case, because Long Beach Airport, really, for all intents and purposes, has not'",
        "'speaker_2': 'had a ground transportation program up to this point. We need to do that anyway. And part of that is making sure that it looks at appropriate funding, you know, to meet the burdens, to repave the roadways, to improve, you know, ingress and egress to the airport.'",
        "'speaker_2': 'And really even what we'd like to do, if possible, is use some of this revenue to help fund what I'm going to call wayfinding or beautification projects at the airport. That's a that's a longer term goal of ours.'",
        "'speaker_2': 'But I think that anything we can do to help fund that and offset that from other funding sources that like, for example, PFC, I'd like to make sure that we could keep PFC in place, firm and center on our bond obligations and use these other revenue sources for what I'm going to call operating expenses.'",
        "'speaker_1': 'Okay. Thank you. One last question or just a comment. I concur with Councilmember Mungo's statement about the issue with folks having an Uber or Lyft pickup within a neighborhood or a hotel parking lot. If there's any way to get that into the contract, we'd appreciate it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'I just wanted to highlight one additional line that is also changing the reservation based around transportation and non reservation based ground transportation. Just to be clear, is that, say your limousines, your bus services that are for hire when you drop off six or eight people at the airport, all of those.'",
        "'speaker_5': 'And it seems as though the permit is only being increased for the one time, but not necessarily on the per pick up or the per drop off. It's on one of three of attachment.'",
        "'speaker_2': 'Yes. In the case of the other, ground transportation is really this pilot program because of the technology that's available and because of industry standards, where it is a per trip fee, that's we're going into this focusing on the tax ideally.'",
        "'speaker_2': 'And if you've had a chance or do get a chance to read the ground transportation study, one of the recommendations is for the installation and investment of what's called an ABI or automated vehicle identification system, because ideally every commercial vehicle that goes into the airport should be paying some fee based on activity.'",
        "'speaker_2': 'I said earlier, I it may be that it it results in a single fee, but I know this from my time at L.A. World Airports, they actually have different fees, trip fees for different types of vehicle. I'm not saying we would do that.'",
        "'speaker_2': 'I'm not saying we wouldn't do that. Part of this exercise is to collect that data. So these fees here relative to the permit fees. Again, in my experience, they were greatly under charging those service providers. We weren't. We are we have not, to this point being, been recovering the administrative time that it takes to process these documents'",
        "'speaker_2': ', get them signed and sent out. So this is this right here is is really just to cover the paperwork.'",
        "'speaker_5': 'I appreciate that. I, of course, would prefer to be fee free. I do understand, though, that this program and other programs has an impact to our neighborhoods, which is why I brought that up specifically. I read the memo.'",
        "'speaker_5': 'I appreciate the research done, and I recognize that it is the industry standard and we're not the first into this market. And so for us to take a major diversion from that might be difficult for both the consumer and the the industry.'",
        "'speaker_5': 'So I appreciate your work on this and I'll be supporting this item. Thank you.'",
        "'speaker_2': 'Thank you. And just to just as a clarification, also, Mr. Remo, I mean, I think almost every airport that has implemented the rideshare program has has a fee, correct? That's correct. Okay. Thank you. There's a motion and a second public comment on the fee schedule issue.'",
        "'speaker_2': 'Please come forward. Just a quick question and a good point Councilwoman Mongeau made, and I'm not sure I followed all of the details, but if a neighborhood is being impacted by that, can there not be what some neighbors have, some neighborhoods have as a parking permit that the neighbors would have and that anybody that has a car'",
        "'speaker_2': 'parked there that does not have that permit would be towed, period. Thank you. Q Next speaker, please.'",
        "'speaker_1': 'Good evening, Mr. Mayor and council members. My name is Max Gellar. This is Diana, my colleague. We're from left. We look forward to picking up passengers at the airport, but we have some serious concerns, namely the trip fee.'",
        "'speaker_1': 'Just a point of clarification, these trip fees. All airports do have a trip fee where we're permitted. Some of them don't have both a pick up and a drop off fee. Especially airports besides Burbank, San Jose, San Diego, a bigger one.'",
        "'speaker_1': 'It's just a pick up fee. There's no drop off fee. So what we're asking for is for the pilot to begin to gather this data to then determine a more permanent fee structure. And it's not Lyft and Uber that pays these fees.'",
        "'speaker_1': 'It's the customers themselves. We're sort of a conduit. We get these fees and then it goes straight to the airport for the cost recovery that they're seeking. Also, generally, airports that we've dealt with have provided a really sort of annotated detailed description of the TNT operations costs and where these fees will go down to the point of'",
        "'speaker_1': 'the salary of the people who point to where a taxi pickup has to happen. We want this pilot to start tomorrow, but we have concerns that if we sign an agreement with a double sided, $3, $3, it will set a bad precedent.'",
        "'speaker_1': 'And we haven't sent back the agreement for that reason. So what we're asking is that the six months start with all the data being collected and then a more appropriate fee is sort of determined based on the data we haven't been picking up at the airport, so we're still confused as to where they're getting these numbers from'",
        "'speaker_1': 'their client, you know, all the sort of numbers that they're citing. But we're here for any any questions you have.'",
        "'speaker_2': 'As a resource, too.'",
        "'speaker_1': 'And a follow up for any past experience. We have California airports and experience with airports, the size and that's all.'",
        "'speaker_2': 'Thank you. Thank you very much. Let me go back to Mr. Mr. Romo, because I know I just want to ask a question. The regional airports of the five regional airports, I believe we are the one that currently doesn't have the TNC program in place.'",
        "'speaker_2': 'Of those five, do they all have which only have one or the other or both? Can you? I would say Ontario Airport currently does not allow TNC. I think they're working toward that here in the coming months. L.A.X. charges $4, pick up and drop off for dollars.'",
        "'speaker_2': 'Pick up and drop off. Orange County, I believe, is $2 for pickup and $2 for drop off. And I defer to staff. I don't know. Burbank, I think is three and change. I'm not sure if it's just a single fee.'",
        "'speaker_2': 'So but L.A.X. and Orange County, both do both pick up and drop off. Yes. Okay. And can I get a response? Do we know about Burbank?'",
        "'speaker_6': 'It's a we can. It's $3 only for pick up fees. And one of the reasons actually.'",
        "'speaker_2': 'I'm sorry, I'm in the discussion. Thank you. So. Okay, and and I know that Ontario right now is doing the same thing we're doing, which is moving towards a policy, correct? Yeah, they're looking toward it's supposed to be from what I hear, it's supposed to be go into effect next 60 to 90 days.'",
        "'speaker_2': 'Okay. Okay. Thank you, Councilman Mango and work here. Thank you. If you have a question. Well, thanks, guys. Appreciate it.'",
        "'speaker_5': 'So I know one of the things that's a challenge is we want to continue to maintain the quality of the options available. And we would, of course, love for people to get to the airport in any means they like.'",
        "'speaker_5': 'But one of the things that comes in, at least my discussions with staff related to the drop off fee, is that every drop off sub vents a parking at the airport. And so to Mr. Romo's point related to the budget, I saw in our fee analysis that we actually believe that parking revenue is going to go down'",
        "'speaker_5': 'because of a lot of factors. Actually, people are using other transportation. People are parking at the airport as long people, the destinations have changed. So they're not going away for as long. We don't have the flight to D.C. anymore, etc., etc..'",
        "'speaker_5': 'So these shorter hauls have less days at the parking structure. And so we never want to put ourselves in the red and we don't want to create new fees if we don't have to. But I think that with the pilot program in mind, if we could just encourage the staff to keep in mind that the bottom line'",
        "'speaker_5': ', they think that that's really important to our community so that we have a safe and stable airport.'",
        "'speaker_2': 'And some reassurance.'",
        "'speaker_1': 'I just want to respond to Mr. Good Hugh's point about creating preferential parking districts, at least in my district. That's not free. It starts with a 1400 dollars traffic study. The residents would have to pay for signs and also an annual permit.'",
        "'speaker_1': 'And I don't think I'd ever ask my residents to subsidize a private company doing business in their neighborhood like that. But thank you for bringing that up.'",
        "'speaker_2': 'Thank you. There's a motion in the second. Members, please go and cast your votes.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a Memorandum of Understanding with Microsoft Corporation, for the programming of Microsoft Digital Alliance YouthSpark, for a three-year period.  (Citywide)": [
        "'speaker_0': 'Constant motion carries.'",
        "'speaker_2': 'Thank you. Next step was item 211.'",
        "'speaker_0': 'Item 11 is from Library Services recommendation to execute an email you with Microsoft Corporation for the programing of Microsoft Digital Alliances, Youth Spark, City Y.'",
        "'speaker_2': 'Cosme Mission and a second Councilwoman Gonzalez.'",
        "'speaker_7': 'Yes, I have to formally recuse myself, unfortunately, because I work full time with Microsoft. I won't speak on the item, but I will just say thank you. Megan Traver, you're probably one of the most ambitious and hard working principles, and I'm glad the students are here to.'",
        "'speaker_2': 'Okay. There's a motion and a second. Any public comment saying that? Please cast your votes.'",
        "'speaker_0': 'No motion.'",
        "'speaker_2': 'Carries. Okay, motion carries. Thank you.'",
        "'speaker_6': 'Can we.'",
        "'speaker_2': 'Oh, absolutely. Come up.'",
        "'speaker_5': 'Sorry.'",
        "'speaker_2': 'It's okay.'",
        "'speaker_6': 'We were trying to be really respectful, and we didn't really know how this works. No problem. Hi, everyone. Thank you so much for having us here.'",
        "'speaker_5': 'And I just want.'",
        "'speaker_6': 'To say sorry. I'm the principal at Washington, Megan Traver, and I want to say thank you so much. It's such an honor to work in a city.'",
        "'speaker_5': 'That.'",
        "'speaker_6': 'Supports education, public education the way you do. So, thank you so much. And we're just here to speak on behalf of this wonderful proposition about having this digital alliance with Microsoft. We've had the benefit at our school, and I have a couple of students who've.'",
        "'speaker_5': 'Either attended the program already are going to.'",
        "'speaker_6': 'Attend a field trip to the Michelle.'",
        "'speaker_5': 'Obama Library on Monday. And it's just been really an incredible.'",
        "'speaker_6': 'Experience for our students at Washington. So they're going to be the ones to tell you better than I do. So let me introduce them. Our first speaker is Hazel Santos.'",
        "'speaker_0': 'Hello.'",
        "'speaker_7': 'My name is Hazard Santos. Well, first of all, it's a complete privilege and honor to be among you all, including the mayor of Long Beach himself.'",
        "'speaker_6': 'So I've been.'",
        "'speaker_7': 'As Ms.. Traver said, I was blown away when I was told to be here. And it's actually very great because the alliance with. Microsoft well has been changing our lives because Microsoft is practically technology. And without technology, our lives wouldn't have been this way as they are now.'",
        "'speaker_7': 'So I'm also looking forward for this field trip because, well, two reasons. One, because.'",
        "'speaker_6': 'It helps.'",
        "'speaker_7': 'The students learn about technology to pursue their passions of their future jobs in their lives. And two, it helps them get a better idea, helps them get a better example of the many, many jobs that are included within their within their lives.'",
        "'speaker_4': 'So, yeah.'",
        "'speaker_2': 'That was great. Thank you. Next speaker, please. Very good.'",
        "'speaker_0': 'This whole thing down. Okay. Thank you.'",
        "'speaker_6': 'Russell.'",
        "'speaker_4': 'Introduce yourself first.'",
        "'speaker_0': 'Okay. Hello. I'm in Alaska. And I just have to say as before, anything else, that it's a great honor to be presented and to talk about this issue. And I am I it's I'm blown away. I there's no words to describe this one.'",
        "'speaker_0': 'Fulfilling, wonderful feeling is. So I am a scholar. I clearly attend to Washington Middle School and I would like to discuss the topic of the STEM program in which I believe should be supported and should be allowed at that school.'",
        "'speaker_0': 'You don't realize how important this is to our school. I hate to say it, but school does have disadvantages from our environment to many sorts of things. And our students, they are the most motivated, most hardworking people I've ever, ever known.'",
        "'speaker_0': 'And I know this better because I am one of them. And not only I'm just seen as all the fact is, my personal opinion is that we score the highest as the most, like people who gain the most in mathematics by the aspect that doesn't prove that they're should prove how motivated our people are, how motivated we'",
        "'speaker_0': 'want to be somewhere in life. And this damn program helps and proves helps encourage that. As you can see, my my own sister, she went into this program. Stempel had no clue, no idea what was coding and merely once came back.'",
        "'speaker_0': 'She's like, I think I want to do this. I think I want to pursue a career in technology and coding and mathematics. And I interview also students who also went there and the all to the same thing in I went to a program there it was for women's empowerment and it was hosted by the STEM program and'",
        "'speaker_0': 'I can say is absolutely amazing what they're trying to do for future generations and that people forget the fact that our future generations help build our society. We are the people that help decide decisions for tomorrow and tomorrow, tomorrow.'",
        "'speaker_0': 'And this truly, truly, this tampon will definitely help encourage that and help people like look beyond what is in front of the in front of their environment. And that's all I have to say. Thank you and also thank you for a STEM program.'",
        "'speaker_2': 'Great. Thank you guys very much. Appreciate it. And it all it already had already passed. So I'll get it. I'm going to go over and say, how do you guys. Councilman Pierce?'",
        "'speaker_5': 'Yeah, I just wanted to say thank you to the students for coming out and speaking in front of us today. It really is inspiring to hear from you guys. Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Sir. You did great. Good to see you. Has a great.'",
        "'speaker_6': 'Picture. Yes, please. From Australia. You too. Well, get them for one. All right. All right. Now, a school without the principal. That's right.'",
        "'speaker_5': 'She?'",
        "'speaker_6': 'Cheez Whiz was our favorite man.'",
        "'speaker_4': 'Yes. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'I sent my wife here. Probably. She's in a hurry.'",
        "'speaker_5': 'Oh.'"
    ],
    "Recommendation to receive and file the application of Baja Fish Tacos, Incorporated, dba Baja Fish Tacos, for a premise to premise and person to person transfer of an Alcoholic Beverage Control License, at 5224 East 2nd Street.  (District 3)": [
        "'speaker_2': 'We have such great kids, don't we? Amazing. Good job, guys. You guys were awesome. And the last item that was pulled was slated for 1112, I think.'",
        "'speaker_0': 'Yes. Item 12 is a report from police. Recommendation to receive and file the application of buy how fresh buy fish tacos for a premises to premises and a person to person. Transfer of an ABC license at 5 to 24 East Second Street District three.'",
        "'speaker_2': 'Councilman Price.'",
        "'speaker_7': 'Thank you very much. Before I make any comments, I'd like to see if we have a staff report from the police department.'",
        "'speaker_2': 'Commander Laverne, Honorable Marion City Council.'",
        "'speaker_1': 'Item number 12 is an application for a premise to premise and a person to person transfer of an on sale general eating place ABC license. This location currently holds an on sale beer and wine license for an eating place, and the police department has conducted our investigation and do not anticipate any adverse impact with the issuance of'",
        "'speaker_1': 'this license. That concludes my report. I'm available for any questions, if you might have any.'",
        "'speaker_7': 'Thank you. I don't have any questions. I do want to make a couple of comments about this application. I know the business owners are here. You know, when we are operating a business in a corridor like the Belmont Shore corridor, which is a geographically close, very close to residential housing, one of the concerns that are raised any'",
        "'speaker_7': 'time there's an application for a liquor license or an alcohol license is whether or not that's going to impact the community. And in terms of Belmont, sure. The question we always get as well as everyone going to be approved or everyone going to be denied.'",
        "'speaker_7': 'And so the way my approach has been and will continue to be that we'll evaluate each application on a case by case basis and do our research to ensure that the establishment that is now going to be having additional privileges associated with its operations understands the delicate balance that we have and the importance of maintaining good relations'",
        "'speaker_7': 'with our neighbors. So I've had the opportunity to speak with the ownership of Baja Fish Tacos. I have to say, since the day that they opened, they've been incredible neighbors in the community. They're very respectful. They have a great relationship with the council office and understand the sensitivities of the particular neighborhood.'",
        "'speaker_7': 'They also operate businesses in other areas within the region. So they understand how to operate a business and and really are are not taking too many risks with this particular facility. That's just not how they operate. They're very deliberate.'",
        "'speaker_7': 'Based on my conversations with them. There are a few changes to the business operations that I think would shed some light into this particular application. Right now there are Counter-Service type restaurant so that you would order at the counter, but before they serve any liquor, if these conditions are approved and ABC grants them their license, they have'",
        "'speaker_7': 'committed to me that they will change their operational structure so that they have they will have a full fledged sit down restaurant with waitress and waiter service at the tables serving the liquor. They've also committed to me that all of their waitstaff will receive training through an approved agency on alcohol sales and distribution, through any of the'",
        "'speaker_7': 'courses that are available through the state of California, such as LEAD. This is really important to me because impaired driving and underage drinking are areas of major concern, and they've committed to me that they'll be a partner in educating their staff in terms of responsible service.'",
        "'speaker_7': 'And they have also committed to not increasing the number of TVs from four, which I know is a is a really big issue in the Belmont Shore area. Everyone is concerned that all of our establishments are going to turn it into sports bars and they prefer to have more restaurants that are family oriented and maybe don't have'",
        "'speaker_7': 'a sports bar feel. So the owners have committed to me that they will maintain that feel for their establishments. So I want to thank them for their partnership and wish them the best in terms of their success. And they know that some of these particular conditions are not enforceable through ABC.'",
        "'speaker_7': 'But I feel very comfortable in my discussions with them that they will honor and commit to these conditions as they operate their business. So, gentlemen, thank you. And I don't know if you want to say anything. If you do or you don't, you want to introduce yourselves.'",
        "'speaker_7': 'You can do that. No pressure.'",
        "'speaker_4': 'Could you bring me to know?'",
        "'speaker_0': 'No. On 12.'",
        "'speaker_4': 'Jesus. Oh, God, no.'",
        "'speaker_1': 'They're okay. Sorry. It's a it's a privilege to be among all of you and the mayor of Long.'",
        "'speaker_8': 'Beach finally get to meet. We spoke to.'",
        "'speaker_1': 'Councilwoman Pryce, and we assure her that our record speaks for ourselves. We're a family owned business. We've been in business for 21 years.'",
        "'speaker_8': 'And we've always open new neighborhoods where families like a quiet living standard. There's there's a lot of neighborhoods, all schools. We are a family business that is growing day by day. And what we're found here in Long.'",
        "'speaker_1': 'Beach is that we want to go ahead and we want to expand our menu. We want to.'",
        "'speaker_8': 'Provide our customers what they're asking for. What we learned from since we opened a couple of years.'",
        "'speaker_1': 'Ago to what we know.'",
        "'speaker_8': 'Now is that customers here, and especially in the area of Belmont Shore, they want something cozy. They want they want to come in. They want to get that full service feel. And that's what we're going to offer them.'",
        "'speaker_8': 'And we we spoke to Councilwoman Price.'",
        "'speaker_1': 'And the extent of what we are going to do with with our business, and we're going to transform it into a full sit down restaurant.'",
        "'speaker_8': 'And we are not going to sell any liquor until we do that. And we want to thank Councilwoman Price and also Lisa West for working with us and understanding that our interest is always the neighborhoods that we go into.'",
        "'speaker_8': 'We always want to provide the best thing that we can for our customers, because our business depends from our customers. We are nothing without them. And we want to thank you once again for.'",
        "'speaker_1': 'For for helping us with this. And we want to thank you for your time. Okay.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'And thank you for opening a business in Long Beach. Thank you. Thank you for your for your investment. Thank you very much. There's a motion and a second on the on the item. No public comment on this. So please go and cast your votes.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an amendment to Contract No. 32983 with Central Parking System, Inc., of Los Angeles, CA, for providing parking operations and management services, to increase the contract amount by $450,000, for the period ending March 31, 2017.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Kane A last concern item that was pulled tonight was 60.'",
        "'speaker_0': 'Item 16 is a report from Public Works recommendation to authorize city manager to execute an amendment to contract with Central Park System for providing parking operations and management services to increase the contract amount by $450,000.'",
        "'speaker_2': 'City Councilman Gonzales.'",
        "'speaker_7': 'Yes, thank you. I remember pulling this item about a month ago and had questions. And I want to thank Craig Beck for depicting all of the the information that will are all of the details as to what this contract will cover.'",
        "'speaker_7': 'However, I did have one question relative to the security, because I know City Place has been in an issue historically with security. So can you tell me a little bit about what that will cover and entail? Exactly.'",
        "'speaker_5': 'Craig.'",
        "'speaker_2': 'Certainly Councilmember Gonzales, members of the council, the item that you have before you is really focused on the operating side of our parking lots, not so much the CHP elements, which we we do have a number of those coming forward.'",
        "'speaker_2': 'But we felt it was prudent to make a reinvestment in many of our facilities, especially the city place garage in the downtown. And we've added a number of security personnel and security hours over the course of 24 seven operation in City Place alone, we've added over 160 hours of security time.'",
        "'speaker_2': 'Plus under this agreement with central parking who are now ESP plus they put in somewhere in the neighborhood of 60 additional security cameras in that garage, which are now monitored by the security officers. So we've really tried to step up that experience.'",
        "'speaker_2': 'There's also increased maintenance, power washing. We've increased the frequency of power washing in those garages where we have a number of other items that we're going to be addressing moving forward. But those are some of the ones under this particular request.'",
        "'speaker_7': 'Great. Thank you, Craig. I just wanted to make sure we clarify that and I appreciate your work on this. Thank you.'"
    ],
    "Recommendation to approve the Citys Draft Blueprint for Economic Development to guide the Citys overall economic development work plan for the next ten years.  (Citywide)": [
        "'speaker_2': 'Thank you. There's a motion on the second. See no public comment. Please cast your votes. Motion case consent count and the consent calendar and all the pulled out ins have been approved. We're going to go ahead and do a couple of items out of order.'",
        "'speaker_2': 'The first one will be on the agenda will be item 23.'",
        "'speaker_0': 'Item 23 Report from Economic and Property Development. Recommendation to approve the series Draft Blueprint for Economic Development to guide the city's overall economic development plan for the next ten years.'",
        "'speaker_2': 'City I thank you, but I making some opening comments because I think this is a really important discussion and item. And then I'm going to turn this over to to staff. So I just want to remind the council that when when this current council formed, this city did not have a economic development department.'",
        "'speaker_2': 'And as we probably remember, one of the first actions this council actually took in that very first budget was bringing back the economic development department that had been cut years ago in the city budget. And so I want to again just thank the council.'",
        "'speaker_2': 'That kind of investment that was made now about two years ago when that budget cycle restarted, the economic development department, which is now, as we all know, have been completely staff led by our director, that department, Mr. Jon Keisler.'",
        "'speaker_2': 'And in addition to that, the other thing that we did, again, thanks to the support of the Council, is we brought back and filled the Economic Development Commission. The commission had been completely vacant and and unfilled for many, many years.'",
        "'speaker_2': 'Clearly, in doing economic development work, you have to have business leaders and community members and workers and folks at the table doing this work. And so we approved a really great group of community leaders and commissioners to serve on this body.'",
        "'speaker_2': 'Their main task, informing the informing this commission and the main task that I had asked them to be involved with was the development of the blueprint that you see in front of you today. Now, just as a note, the blueprint is still in draft form.'",
        "'speaker_2': 'And so what you're seeing today, well, we printed out a few copies just for the council and us internally. This is not a final document. And so this is what you are seeing tonight is a is the draft of the essential completion of their work and and staff is looking forward to hearing from council tonight about your'",
        "'speaker_2': 'thoughts about this final draft before it goes into a final, final phase. Let me also just say that they've been working on this blueprint probably for about a year. There has been approximately 25 community meetings. There has been intense conversations and discussions with every single bed across the city.'",
        "'speaker_2': 'All of the leaders have been involved. There have been deep conversations with Cal State, Long Beach, Long Beach, City College, Long Beach, Unified School District, community groups of all types have been involved, whether it's on whether it's been groups like Building Healthy Communities or business groups that are like Virgin Galactic and others, all have been asked to'",
        "'speaker_2': 'provide input into the document that you have in front of you. I want to also think, because I think it's important to acknowledge there has been an incredible amount of work that these commissioners have been involved with, and I want to just personally thank them.'",
        "'speaker_2': 'And that has been Randall Hernandez, who's been the chair. Becky Blair, who will be saying some words tonight. Who is the vice chair? Cyrus Parker. Janette, who is one of the commissioners, also the dean of the College of the Arctic Council at Long Beach.'",
        "'speaker_2': 'We have Blair Cohn, who we all know, Bobby Oliviera, Frank Colonna, Kristi Allen, Lincoln Bower, Michelle Molina, Ralph Olguin and Walter Larkins. They have been a incredible group of commissioners and have put a lot of work into this.'",
        "'speaker_2': 'If you have had a chance to to watch them in any of their meetings on this topic, they have they have gone really, really deep and gone into the community and held meetings across the city to put what we have in front of us.'",
        "'speaker_2': 'And so I know that they are anxious to hear your thoughts on what they've put together. I know staff wants to hear from the council tonight what really stands out and what you really like about this document. And if you think there's anything that can improve this document, I think now is the time to please give those'",
        "'speaker_2': 'thoughts as well so that we can end up with a really strong final product. Let me also say that this this document is meant to do two things. The first is to really guide our economic development efforts for the next decade.'",
        "'speaker_2': 'It's going to be a great guide for staff to use as they do their work as a new department moving forward. And it's going to be an opportunity for the Commission to now begin working with the Council, in particular the Economic Development and Finance Committee, on how some of this work is implemented.'",
        "'speaker_2': 'What's the work plan look like? How do we begin to achieve some of the goals and recommendations that are in the the report? And so all of that I think is in the future, of course. But I wanted to thank the commission for.'",
        "'speaker_2': 'For their incredible work on this on this project, everything from the developing of the vision to the goals, to the to the to the plan itself. And the last thing I'll say is what Tim and I had a chance to to view this just a week or two ago when it was completed.'",
        "'speaker_2': 'And I what struck me about the document that I thought was really impressive is to me, at the core of this document are people and you guys really focused on people, on the entrepreneur, on on the worker, on the the business person, on the small business owner.'",
        "'speaker_2': 'And I think that was really impressive and is very different from from economic development documents. I think that have happened in the past in the city is there's a real strong focus on on people. And I thought that was that was something that really stood out to me.'",
        "'speaker_2': 'And so thank you to them. And I want to thank everyone for being so supportive of this process. It's one that I'm really proud of to to have been a part of. So with that, I'm going to turn this over to Mr. Chrysler, who's going to walk the council through some of the data and and some of'",
        "'speaker_2': 'the report. Honorable Mayor and members.'",
        "'speaker_4': 'Of the City Council, I would like to introduce Eric Romero, who has been our staff lead on this project to give you the staff report.'",
        "'speaker_1': 'Good evening, Mayor, and members of the City Council. My name is Eric Romero. I am a development project manager in the Economic and Property Development Department. Today I'll be presenting to you a short presentation on the draft blueprint for economic development.'",
        "'speaker_1': 'And we'll start with a brief economic snapshot. I'm going to start at the top and move to the right so that you can follow along. So we can see in the first chart that unemployment rate has dropped significantly between 2010 and 2016, which is good news on the chart to the right.'",
        "'speaker_1': 'We can also take a look at the top industries in terms of the number of jobs and how that compares to the state of California. We can also see on the chart furthest to the right that the economic status of our residents differs depending on race and ethnicity.'",
        "'speaker_1': 'And then going down to the to the first chart on the left, we can also see that wages differ by industry, with the top wages being in the transportation and warehouse industry. The next chart shows that total private employment has surpassed pre-recession levels, which is good news as well.'",
        "'speaker_1': 'And then the final chart there, the pie chart shows that the majority of our labor force commutes outside of the city for work.'",
        "'speaker_2': 'Mr. O'Mara, before you move on, can you're speeding through some of the stuff here, which is but I think it's really important to go back to that because this is what also is was was surprising to me. Can you go back to the charts?'",
        "'speaker_2': 'Sure. I'm going to I'm going to go ahead. So going back to these charts, I just wanted to just say point two things out. The first is the the real historic drop in unemployment that the city has seen is outpacing, by the way, in talking to mayors across the country and seeing what's going on, we are outpacing'",
        "'speaker_2': 'most cities across the country of our size or larger. So we are doing very well when it comes to job growth and the amount of jobs available to our community. That's something to be very proud of. And to me, it's one of the most important data points that a city should be looking at.'",
        "'speaker_2': 'When you're looking at economic activity is what the unemployment rate is, and that's something we should be very proud of. The and the other point that I wanted to make, which I think is really interesting, is if you look at the growth of of populations within the city and and the household income, this to me has been'",
        "'speaker_2': 'impressive. When you look at the five year growth of our populations, when you broke down, our populations are in a black, Asian, white, Hispanic. And you look at the five year growth for our for residents in Long Beach workers compared to the county.'",
        "'speaker_2': 'That's a striking difference. And look, if you look at, for example, just the Asian population, Asian-Americans in Long Beach had a 15.7% growth in household income versus 3.3% in L.A. County. You look at the the African-American population in the city of Long Beach and the five year growth ahead of 4.2% growth in household income.'",
        "'speaker_2': 'And unfortunately, there's been a negative point 2% decline in household income across the county. And the same can be said for the white population. You see the growth, the five year growth of 5.9 versus 3.9 across the county and within the Hispanic population of 7.8 to 2.4.'",
        "'speaker_2': 'So I just I point that out just because of the other, I think data point in the snapshot that I think is is important to note is that when you look at where the city is going and you look just take a look back on the last five years of every worker and every subgroup while certainly there'",
        "'speaker_2': 'are differences and those I think some some of those are addressed in here. Our growth is outpacing the county currently for everyone. And that's another thing that we should be very proud of. And so I just wanted to point that out and make sure the council saw that as well.'",
        "'speaker_2': 'So, Mr. Romero, sorry to interrupt you.'",
        "'speaker_1': 'Those were excellent points and thank you for for building on that. So I'll I'll jump into some background on the blueprint. So in 2015, the Mayor and the City Council tasked the Economic Development Commission with developing a vision and recommendations for how to grow our economy over the next ten years.'",
        "'speaker_1': 'The Mayor and the City Council really wanted the commission to drive this effort and for the recommendations to capture the essence of the steps that we could take as a city to grow our economy. The Commission consists of 11 members from various different sectors.'",
        "'speaker_1': 'For example, we have the Dean of the College of Arts at Cal State Long Beach, a director of a business improvement district, commercial brokers, entrepreneurs and more. And we feel that the draft blueprint really captures all of their diverse perspectives.'",
        "'speaker_1': 'And I have to personally commend the commission for their hard work. This commission was meeting every week at one point and biweekly at other points, which is not come in for most commissions. So I really applaud them for for their dedication to this process.'",
        "'speaker_1': 'The blueprint is a policy document that outlines goals, objectives and recommendations for how to grow our economy in the next ten years, and also will serve as a catalyst for economic activity across the city. The deliverables are a high level policy document, which is the draft blueprint, a work plan for further assessment and strategy.'",
        "'speaker_1': 'The development will take into consideration how we begin to operationalize some of these policy recommendations and consider our budget and staff resources and sequencing of the different programs and initiatives over time. And we're also looking to develop an online dashboard to track key performance indicators that will help us gauge how our economy is performing at a particular'",
        "'speaker_1': 'point in time. Some indicators that we're looking at is the total number of jobs, the total number of businesses, per capita income, median household income, educational attainment, and many more. And this will be a public facing dashboard that will be available to all to help gauge how our economy's performing.'",
        "'speaker_1': 'The Commission went through an extensive research process as a part of developing the recommendations for the blueprint. The city commissioned Beacon Economics for developing an economic analysis which was made up of two different parts. Part one provided essential background information on the city's economy, its workforce and its residents.'",
        "'speaker_1': 'Part two was a deeper dove into the different key industry clusters in the city, such as health care, logistics and business services, to name a few. And it helped us to get a baseline understanding of how these clusters are performing and how we can better serve them.'",
        "'speaker_1': 'Moving forward, the Commission also did a great job at organizing various different study sessions that focus on different topics and the organized panels with developers to understand how we can improve the real estate and property development process. We had a panel on workforce development, a panel with city staff, so that they can better understand the business licensing'",
        "'speaker_1': 'process, the permitting and inspection process, and the planning process as well, and a number of other study sessions that were organized. We also looked at other plans from across the country to inform this planning process and to identify best practices.'",
        "'speaker_1': 'For example, we looked at the Seattle Economic Development Plan, the Santa Ana Economic Development Plan, and also looked at the L.A. County Strategic Plan for Economic Development and others as well. And we organized a number of different listening sessions or interviews with the commissioners themselves, department heads and other institutional partners to get some insights as to some'",
        "'speaker_1': 'of the challenges that we're facing and also opportunities to grow our economy. Once the Commission developed some initial recommendations, we organized focus groups in the community to get some initial feedback on the policy recommendations. And we also looked at other key reports to identify best practices, for example, for how to best support small businesses or how to'",
        "'speaker_1': 'help grow a creative and innovation economy locally and regionally. So with all of this work, the commission did put together their draft recommendations for the Economic Development Blueprint. And the vision for the draft blueprint is that Long Beach is a city of opportunity for workers, investors and entrepreneurs.'",
        "'speaker_1': 'And the commission really felt that the blueprint should serve as a catalyst for action, so that it should create a vision for different institutional partners across the city to come together behind one vision to grow our economy, that it should create higher wage job opportunities, spur investment throughout all of the city.'",
        "'speaker_1': 'So investment in the north side, west side, central, Long Beach and everywhere else that it should build an ecosystem that supports entrepreneurs to confidently grow and to start and grow businesses in the city of Long Beach and to provide opportunity for our residents to live healthy, productive and prosperous lives and to positively impact where they live.'",
        "'speaker_1': 'The blueprint has seven focus areas. The first is engines of growth. And this has to do with making sure that we grow and support our key industry clusters and emerging sectors. The second one is economic inclusion, which has to do with advancing economic equity, particularly for low income communities across the city.'",
        "'speaker_1': 'The third is jobs and workforce development, which has to do with making sure that we have a prepared workforce so that our residents can get good jobs and also so that we can attract higher wage job opportunities to the city.'",
        "'speaker_1': 'The fourth is business assistance, which has to do with putting the support systems in place again so entrepreneurs can confidently start and grow their business here. Number five is the development environment, which has to do with ways to make to improve the real estate and property development process, making it more cost effective and streamlining it as well'",
        "'speaker_1': '. Number six is quality of life and this takes into consideration the wellbeing of our residents across all of our unique neighborhoods and it considers many questions relating to public safety. The social services some people would need particularly vulnerable populations to lead production productive lives.'",
        "'speaker_1': 'Also questions about walkability and likability as well. And number seven is economic leadership and cooperation, which has to do with advancing an integrated approach to local and local and regional economic development, and to really have long to be a leader out there advocating for our city and our region to help grow jobs, businesses and opportunity for our'",
        "'speaker_1': 'residents. If approved, the following implementation process would be recommended for the blueprint. The first would be to work with our city partners and also institutional partners across the city to encourage alignment with economic development goals and objectives. Sorry about that.'",
        "'speaker_1': 'Number two would be to work with city staff and partners to develop a blueprint work plan to operationalize these policy recommendations and see how we would sequence the initiatives and programs that come out of this plan. Number three is to develop an online platform for tracking and reporting performance.'",
        "'speaker_1': 'This is the online dashboard that I referred to earlier. Number four is to produce a communications and marketing plan to to market this to the world, to let everyone know what we're doing here in Long Beach, to grow our economy and to also let people know why they should be considering investing in the city.'",
        "'speaker_1': 'We would, of course, provide regular updates to the City Council, the Economic Development and Finance Committee, and to the Economic Development Commission. And we would organize an annual conference that highlights progress on the blueprint to keep it relevant and to keep people excited about this partnership to grow our city's economy.'",
        "'speaker_1': 'That concludes my my staff report, and we're happy to answer any questions.'",
        "'speaker_2': 'Thank you. And I think everyone has the blueprint in front of them as well. So let me turn this over to the before I turn over to the council, I believe actually someone from the commission was going to say a few comments.'",
        "'speaker_2': 'Is that correct? Ms.. Romero.'",
        "'speaker_1': 'Yes, yes. I apologize. I would like to invite Vice Chair Becky Blair to add a few additional remarks if she would like to step up to the podium.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Good evening, mayor, vice mayor and the city council. It's a pleasure to be here tonight to celebrate what we have accomplished through the recommendations for the blueprint. And it is important to show that Mayor Garcia and some of the city council members to whom we've spoken to are all a part of that.'",
        "'speaker_6': 'It is something that they're looking at for the first time. It's something that they've helped us in participating. They've reached out to the business community and they've asked the business community to help them run the city with development and small business in the best manner possible, more efficiently and more effectively.'",
        "'speaker_6': 'And when reaching out to the business community like this, the business comments that I have coming back from others are that the city is working on our side now. The city is working collaboratively. The door is open and it's business not as usual, but it's new business.'",
        "'speaker_6': 'And we appreciate that. I think that I respect and am happy to have worked with each and every one of the commissioners. They come from varied backgrounds and careers, and they have brought such a new sense of where Long Beach is growing and a security for the future for all the areas and economic equality for each and'",
        "'speaker_6': 'every neighborhood. So I also appreciate two of the commissioners that are here that have done a fine job throughout. Michelle Merlino And also Cyrus. Janette Parker. Thank you very much and thank you very much, Mayor, for bringing this forward.'",
        "'speaker_2': 'Thank you. Thank you very much to our vice chair, Blair, and, of course, to the commissioners that are here for the work. I'm going to turn this back over to the council. Councilwoman Mongo.'",
        "'speaker_5': 'I want to thank all the members of the commission. Excellent work on more than 25 meetings went into this process. I also want to thank the members of the community who were at these meetings and were constantly involved.'",
        "'speaker_5': 'I appreciate the many members of the commission who met with me regularly throughout the process to keep me as Chair of Eddie and F apprized of the situation and where we were moving and what it looked like, and also to the city staff of economic development who gave us regular briefings.'",
        "'speaker_5': 'And for those of you who were able to attend earlier tonight, the Eddie and F committee asked that we move and recommend adopting some form of this tonight with any inclusions of our colleagues, but also that we potentially pulled together a committee of three or four members of the commission.'",
        "'speaker_5': 'The three members of the Eddie and F City Council to help develop the specific, measurable outcomes that we want to measure over time. We also named a couple of other entities we thought might want to be at the table, including having in the audience when we convene this meeting and then the chair or executive director of our'",
        "'speaker_5': 'Workforce Investment Board and our city partners in any organizations that have been a part of the process to get us to this part so far. So I want to thank everyone for their work. I've literally handed over two versions of a printout of this in advance, written on and included by input and working with the chair directly'",
        "'speaker_5': '. And I'm very proud of the work that our committee has done. I think that it's an exceptional and thoughtful effort in this way. We did not keep track of any of these things before and what gets measured gets done.'",
        "'speaker_5': 'And so if you have a moment to reflect on what we did earlier tonight, in reviewing the statistics of many of our measurable goals that the EDI and F keep track of, I think that in partnering those together, I think we're going to have something really magical here.'",
        "'speaker_5': 'So I look forward to hearing from my colleagues and the community on this exciting day.'",
        "'speaker_2': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I just want to take a moment to say thank you to the commissioners for their very hard work. When the commission step up and develop a work plan, it's valuable service to your city because we work very hard to implement this work plan, and it was obviously done in a very cooperative way.'",
        "'speaker_1': 'You know, when I see friends or allies or colleagues, they all are referencing this blueprint. They're all hands on deck on this blueprint. I want to say it to staff I, John and your team. You know, sometimes I can be a bit cynical when it comes to another plan, right?'",
        "'speaker_1': 'Another plan. But, you know, I believe in this one. And it's very clear that you're very sincere about inclusion and things like, you know, I see things like vision here, cooperation, an implementation strategy, a work plan. Those are words that that get me excited because it's something to actually get my hands on and work on.'",
        "'speaker_1': 'So we've already talked about a few ideas for implementation in North Long Beach. I'm really excited about that. And so I would just say, finally, I think, you know, some of our other commissions could benefit from having very targeted direction.'",
        "'speaker_1': 'As to, you know, looking at developing blueprints, prints or strategies for their specific, you know, expertize, subject matter expertize, particularly. You know, I think that, you know, we're doing some work relooking at the youth commission and I think coming up with a youth playbook would be good.'",
        "'speaker_1': 'We just had a lot of conversations around veterans. I think veterans could put together something comprehensive like that that puts a playbook together, a blueprint for veterans. So this is a great model and I hope that other commissioners follow suit.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilmember Pierson.'",
        "'speaker_5': 'Thank you. I want to thank everybody that's worked really hard on this process over the past several months. And I really want to recognize the staff effort that has gone into this and also recognize Eric Romero, who was my intern for a great year plus when I worked at Laine.'",
        "'speaker_5': 'And so thank you for the great presentation today. I think that this does a really great job of talking about some of the core things that we as a city want to do. And I think an economic blueprint is the right direction that we as a city, we are at a critical point in our time right now'",
        "'speaker_5': 'where the market's kind of exciting. We've got new developments happening everywhere. We've as a council, prioritized things like 1% for the arts. And so having a blueprint that really says, where are we going and what's our vision, I think is really important.'",
        "'speaker_5': 'It's important in times like this also to recognize the impacts of economic development and really make sure that as we have these conversations, we're doing it in a way that is not too quick, that doesn't exclude people in the population that might feel excluded in the past.'",
        "'speaker_5': 'And so I want to just highlight a couple of comments that were brought to me by members in our community. I want to thank the the downtown. Well, now I have to call it the downtown Long Beach Alliance for their letter that they've shared with us.'",
        "'speaker_5': 'And this letter pretty much, I think, does a great job about asking us to include some recommendations. They've listed out a nine recommendations to be included in the blueprint, which include things like housing. That includes not just, you know, market rate housing by using the White House Development Toolkit to put together a policy that's really thoughtful and'",
        "'speaker_5': 'robust in how we address housing for a growing population. As we seen and as our mayor noted, we do have demographic changes in our city. And how are we thinking long term for that? Making sure that we have online accessibility, not just with our permits and with C P process, but including that overall.'",
        "'speaker_5': 'So I'd like for us to I'll share the letter with you guys, and I would like us to to try to include this as much as we can in the comments of if some of it has been left out.'",
        "'speaker_5': 'I also want to recognize some of the community meetings that you guys had with building healthy communities that I think tapped into some of those things around, making sure that we're using empty space, making sure that those that have felt it's been difficult to access housing, that that is included and ensuring as as we talk about the'",
        "'speaker_5': 'demographics, that we have equity changes in our city, we've got leadership in our city that are addressing issues of equity and that as much as we can include that in our economic blueprint, the city overall, no matter if you're a business owner or if you're a renter, is going to be better off for it.'",
        "'speaker_5': 'And also just want to, you know, do one more recognition to the fact that whenever we have a city that does three things and I want to recognize the commission for doing this work, making sure that our city is business friendly while looking at those residents that are most impacted.'",
        "'speaker_5': 'We can do those side by side. And so making sure we've got a uniform licensing and permitting process, making sure that we have predictability no matter if you're a new business owner or someone that's opening up your third business, that we have high levels of customer service and that I think that our city is on the right'",
        "'speaker_5': 'path to those things. The last thing I'll say is the one thing that I feel like is missing out of here is a little bit on our arts and entertainment. And so I talked a little bit this morning with staff.'",
        "'speaker_5': 'I would like to see the possibility of reforming the permitting process for live performances in downtown. That's something that we're going to be working on in my office, and I would like to see that are reflected in this plan as well.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_2': 'Thank you, Councilman Price. Well, that's really got to count somebody a Ranka and then I'll go to Councilman Price. Councilman.'",
        "'speaker_7': 'Sorry. Thank you for the report. I saw the presentation earlier at our economic committee meeting, so I want to thank staff again. One of the issues that I raised earlier today that I wanted to highlight again is this is a really great report and I'm impressed by the involvement of the various stakeholders, and I think we have'",
        "'speaker_7': 'some good data that we've obtained, but I think it's very important moving forward that we have realistic performance measures and that we are held accountable to those performance measures. And if. We need to break that up into phases because I know we have a lot of objectives outlined in the blueprint, but if we need to break it'",
        "'speaker_7': 'up into phases so that thank you so that we can have some realistic performance objectives to judge ourselves and our progress on, I think that would be really great and I understand that is part of the plan. So thank you.'",
        "'speaker_2': 'Thank you. Council member Sri Lanka.'",
        "'speaker_8': 'Thank you, Mayor. I, too, was a recipient of the report earlier with the Aden Africa Committee that we met. And they raised some some points that I thought were important for for me and for the West Side, especially when talking about as we look at economic development and growth and business growth, that we do it responsibly, that'",
        "'speaker_8': 'we do it with the awareness of the environment, that we keep our air clean, that we that we keep transportation and mobility at the at the forefront of what we do here. Because a lot of what we what we do have has unintended consequences.'",
        "'speaker_8': 'And a lot of those unintended consequences might be the affect that they have on the quality of life of our residents. And so I want to also include the fact that when we're looking at economic development, we also look at training and the training that's essential to and to ensure that we have the workforce available to take'",
        "'speaker_8': 'many of these new jobs that we're looking at creating and business opportunities. But with business, you get jobs. And with jobs you get people who are going to be able to buy homes and have a good quality of life.'",
        "'speaker_8': 'And I want to ensure that that that the the living Long Beach working Long Beach to have fun and Long Beach. The last thing I want to say is that we always keep keep in mind keep open the possibility of having training programs that that come into Long Beach, opening new schools.'",
        "'speaker_8': 'I know we have great educational institutions here. We have Chelsea, Long Beach. We have limited college and a great school district. But we also have other programs that are out there that provide training opportunities, such as apprenticeships in areas other than high tech or any other business that we might be looking at.'",
        "'speaker_8': 'Because we still need plumbers, we still need carpenters, we still need service providers. Told us in the report that where, you know, we have a great hospitality business here in LA, which is one of the highest, but yet their salaries are depressed and not reflective of the great opportunities that we had here, Long Beach in the service'",
        "'speaker_8': 'industry. So we need to also look at how we can increase wages in those areas as well and to create opportunities for people who want to come to Long Beach and work in a service industry that they're going to get the jobs and the wages that are that are living wages for them as well.'",
        "'speaker_8': 'So keep that in mind. Just a little food for thought for all of you. Thank you.'",
        "'speaker_2': 'Okay. Thank you, Councilwoman Gonzalez.'",
        "'speaker_7': 'Yes, I would like to thank the commissioners as well for being here and all those that are not here as well as the department. I think this is a fantastic blueprint. It's very it's got a lot of great ideas, I think.'",
        "'speaker_7': 'And there's specifically, you know, streamlining the tracking of the key performance indicators, which I know will be, you know, hearing more about as time goes on, the value of business improvement districts, mapping out areas of our city, lacking key economic opportunities.'",
        "'speaker_7': 'You know, I think like Councilmember Duran, I think about the West Side that doesn't have a bank or a pharmacy and it addresses, you know, being able to prioritize those areas to add economic opportunities there and then incentivizing innovation.'",
        "'speaker_7': 'When I think about that, I also would like to see possibly and I've talked about this before, but working with our U.S. Patent Patent Office, I know I've worked I've talked to John Kessler about this in the past on how we can look at ways to encourage patents and innovation in that way.'",
        "'speaker_7': 'I know some cities quantify how many patents they have as part of their you know, this is City of Long Beach. We have, you know, this many patents in in the city. And I think that's a really key area.'",
        "'speaker_7': 'We can look into a couple other things. Also to training and retraining. I think just it has been addressed kind of on a bigger level. But as tech knowledge advances and as automation becomes more and more clear, it's kind of looking at ways to retrain people to be either accustomed to new technology or retraining in a different'",
        "'speaker_7': 'sector that would be more beneficial for them. And then recently, I know myself and my colleagues, we put together an item that will be coming back soon, but it looks at doing business with the city as local businesses.'",
        "'speaker_7': 'How do we offer preferential procurement opportunities for local businesses? So I think that also should be looked into as well. And then lastly, I know we've talked about the unemployment rate and I'm very glad that our overall unemployment rate is very low.'",
        "'speaker_7': 'But we do have pockets in the city that are still upwards of 16%. And so looking at that and kind of prioritizing in those pockets as to what we can do for those communities would be essential as well.'",
        "'speaker_7': 'And then the last thing I think I'll also chime on to what Councilmember Pearce said about music and entertainment. We do have a lot of events that occur in our city and how are we maybe providing more ways to look for economic opportunities there?'",
        "'speaker_7': 'So in our special events and filming music events, artistic events, I mean, it's really ramping up in those areas. So looking at that and then I think that's it. Sorry. And one other thing. Oh, I'm sorry. The global business imports and exports.'",
        "'speaker_7': 'So since we are next to the port, I know this probably has been addressed, but if there are any ways we can work, even with the U.S. Embassy on my travels abroad, I had worked with the U.S. Embassy, and they create a matchmaking service for U.S. businesses that want to invest in foreign countries but also have a'",
        "'speaker_7': 'mainstay here. So maybe creating synergy with the U.S. embassy to be able to do that. But I think this is fantastic. Great job to all of the commissioners and everybody involved. Thank you.'",
        "'speaker_2': 'Thank you, Councilman Ashton.'",
        "'speaker_3': 'Thanks. And I agree with everything that has been stated. I want to congratulate, salute the commissioners for excellent work staff for the dedication. I know there was a number of public meetings. And so to anybody in the public who participated and gave public comment to to add to this this blueprint, and we salute you as well.'",
        "'speaker_3': 'I think this provides us some great economic statistics. That snapshot is extremely interesting. It provides us with some good, valuable data, data that we can we can come back a year from now, two years from now, three years from now, and measure our our, our, our, our, our, our deliverables and improvement and how we have implemented this'",
        "'speaker_3': 'plan. I'd like to put a greater emphasis on and it's just, you know, you'll hear me talk about this week after week after week, but the greater emphasis on creating and maintaining quality jobs in this city. And with that in mind, I mean, we always talk about economic development.'",
        "'speaker_3': 'I would like to see employment kind of mirrored or married to that that term economic and employment development, because it's I think it's really what we're doing but we can't under if. Besides the importance of creating quality jobs in the city, especially when you look at only 77% of the folks in the city are leaving the city'",
        "'speaker_3': 'to work. That's, I think, very, very important. It would be. And I got to tell you, it is for those who get a chance to to live and work in Long Beach. You you have a you are very fortunate.'",
        "'speaker_3': 'You're very fortunate. And so so to come off the island, I got to tell you, it's rough out there on an in traffic and on those Southern California freeways to be able to create a greater number of quality jobs in the city.'",
        "'speaker_3': 'Is that that's something that I'd like to see us truly, truly work on. I know this blueprint will help us get there. But again, I'm in terms of framing economic development, I think in the future we need to to look at marry in that term with employment because it's so, so important as well.'",
        "'speaker_3': 'And again, congratulations and great work.'",
        "'speaker_2': 'Thank you. Councilmember Supernanny.'",
        "'speaker_1': 'Thank you. I'd like to acknowledge the hard work of staff and our council colleagues on the committee, and especially to the commission. I believe that this was the only project you had that would be impressive. But having served on a commission for seven years, I know your plate is full with other items too.'",
        "'speaker_1': 'So thank you and for all your hard work on that. I also just want to give a shout out to the fourth District, of course. I noticed on the list of top 25 sales tax generators, ten of them either have a location, the fourth, or are entirely located in the fourth, as in the case of Serco, Porsche'",
        "'speaker_1': 'and Audi. So go forth.'",
        "'speaker_2': 'Thank you. Any public comment on this? Please come forward. Good evening again, Robert Fox. Great report. Very much supportive of it. I have a comment to make about disseminating this information. It's nice that we all have it here.'",
        "'speaker_2': 'We're very involved in this stuff, but we need to get it out to the community so that they understand what we what we're planning. My concern is a very pragmatic one. I am now executive director of the Council of Neighborhood Organizations, went to the Neighborhood Resource Center and tried to find out where is the database for all'",
        "'speaker_2': 'of the neighborhood associations. We have 132 and we have the Council of Business Organizations and all the business associations are listed there. Also, 40% of the data is not correct.'",
        "'speaker_1': 'It's just gone.'",
        "'speaker_8': 'People moved. Somebody died.'",
        "'speaker_1': 'But all the emails are not working, you know.'",
        "'speaker_2': 'Like 40% of them not working. And the telephone numbers are not correct. The people are not correct. Maybe some of these things.'",
        "'speaker_1': 'Went belly up. We don't know.'",
        "'speaker_2': 'So I went to Margaret Madden, who's a good friend of mine. I've known her since she was 16. And I said.'",
        "'speaker_1': 'Margaret, you know, we kind of get this database together.'",
        "'speaker_2': 'Here, you know. And I wasn't really satisfied, to be honest with with the response. This is such an important report. I've been a business leader most of my life, and I really, really want to get this out there to the community.'",
        "'speaker_2': 'So rather than waiting for nine months to get the data together at the Neighborhood Resource Center, I would urge you to maybe put another person there or dedicate somebody specifically to make sure that we have at least the communication link that to all business associations in the city and neighborhood associations in the city so that this great'",
        "'speaker_2': 'news can get out there. Thank you so much. Thank you. Next speaker, please. It's Hansen. Please come down.'",
        "'speaker_6': 'I just want to.'",
        "'speaker_0': 'Congratulate all of you and the.'",
        "'speaker_6': 'Whole city. Who? Oh, my gosh. You accomplished.'",
        "'speaker_5': 'So much. And. And then I met with Superintendent Steinhauser today. Oh, my gosh. The things the wonderful things that are going on in our school district.'",
        "'speaker_6': 'Are just unparalleled.'",
        "'speaker_5': 'With I don't know how anybody else could measure up. But anyway, it just there was one thing that I always have thought that would really help Long Beach, and that would be if we had that must be a reason it hasn't happened.'",
        "'speaker_5': 'But we are Long Beach.'",
        "'speaker_0': 'That's what we're known for.'",
        "'speaker_5': 'From the very beginning, I mean, that's our greatest resource is that ocean out there. And maybe someday we could have something that's like like they have on Venice Beach with all those little shops and things and people going up and down.'",
        "'speaker_5': 'And I think it could really.'",
        "'speaker_0': 'Be.'",
        "'speaker_5': 'Something that could be enchanting and so much fun for everyone. And, you know, and it's what you know, Venice Beach.'",
        "'speaker_6': 'Is known all over the world.'",
        "'speaker_5': 'When people come to California, they want to go there. So anyway, just think about that. And the Obama library. Michelle Obama library. I've been there since. You know, fathers with their kids, you know, studying and doing homework. I mean, it's just so wonderful.'",
        "'speaker_5': 'It's like something that.'",
        "'speaker_0': 'We have always.'",
        "'speaker_5': 'Dreamed of having. You guys are making.'",
        "'speaker_0': 'Really good.'",
        "'speaker_5': 'Dreams come true. Thank you. And then there's other public. We're all trying to do good deeds. And I'm just in the mood to celebrate when I go to the Michelle Obama library and talk, you know, see all these good things happening.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Thank you, Senator. Next speaker, please.'",
        "'speaker_1': 'Hello. Good evening, Mayor. City council members, city staff. Keeping with the positive comments tonight, I'm here on behalf of the Chamber and our leadership and our members to fully endorse and support this draft blueprint for economic development as presented tonight.'",
        "'speaker_1': 'Over the last year, we've attended and provided input at multiple Economic Development Commission meetings and study sessions. We're grateful for allowing us to have such input through this process as it relates to the blueprint. And while the blueprint covers seven focus areas, we are particularly excited about two areas the business assistance and the economic leadership and cooperation'",
        "'speaker_1': 'areas. Ensuring our businesses, our business community has continued to access to technical, financial and regulatory assistance is paramount to sustaining our current businesses while attracting new. At the same time, we appreciate the recommendation of a small business concierge program as we've begun a similar concept for our members and welcome further dialog around this area and how we'",
        "'speaker_1': 'can assist all businesses in Long Beach under the Economic Leadership and Cooperation Focus Area. We welcome the discussion on a partnership between the city and the Council Business Associations, commonly referred to as COBA. Any time you have multiple partners in this case the Chamber Business Improvement districts, other business associations are at the table discussing customer service, regulatory'",
        "'speaker_1': 'process and any proposed new audiences that will ultimately impact business. We view this as a good start to a wonderful strategy. The chamber stands ready to work with these various partners who dedicate a significant amount of time to this endeavor and also resources that went into this document.'",
        "'speaker_1': 'Lastly, as outlined in the blueprint, we look forward to further engagement directed by all of you and also the city manager's office. We appreciate our inclusion to the sterile process to date. Applaud all the work by the Economic Development Commission and staff.'",
        "'speaker_1': 'Specifically, we'd like to publicly thank EDC chair Randall Hernandez, Vice Chair Becky Blair, all of the commissioners, and especially John Keisler and his wonderful staff and his former staff at the Long Beach Innovation Team. So job well done by all.'",
        "'speaker_1': 'Thank you for tonight.'",
        "'speaker_2': 'Thank you. SPEAKER.'",
        "'speaker_1': 'Good evening, Mr. Mayor. Members of the City Council. Craig Cogen with the downtown Long Beach Associates. On behalf of our board, our economic development committee, as well as the staff, we want to commend the mayor for initiating this vision and this process that's led to Long Beach being open for business for so many years.'",
        "'speaker_1': 'As the mayor mentioned earlier, the commission did not exist and the department was not functioning at its at its regular level of personnel. This is really a welcome relief for not only downtown, but certainly the city. And with your vision, this has really helped us propel Long Beach into the very dynamic and certainly competitive market that we'",
        "'speaker_1': 'exist in. I'd also like to thank the commissioners commissioners. The Economic Development Commissioners did a wonderful job expressing and exercising due diligence on all of the aspects that are covered in this plan. And I also appreciate the work that COBRA, as Jeremy mentioned, the Council of Business Associations did.'",
        "'speaker_1': 'All the business improvement districts, including the Chamber and the CVB, have been working together to really bring to the forefront the needs of business and recommending and certainly agreeing with Councilmember Pierce's comments earlier that business can coexist with its residents in the neighboring area.'",
        "'speaker_1': 'So we look forward to working with with our citywide partners. And certainly the jobs recommendations that we've presented to you have already been presented to city staff. They're aware of this. We want to be able to continue working towards these towards these objectives and helping you with the tasks as well as the as well as the work'",
        "'speaker_1': 'that's necessary to get this done. And this is really an awesome starts. We look forward to working with our continued work that we have already started and with the collaboration that we have with the citywide partners as well as the newly found commission, as well as the city staff.'",
        "'speaker_1': 'So thanks very much.'",
        "'speaker_2': 'Thank you very much, Craig. Next speaker, please.'",
        "'speaker_6': 'Hello, everybody. I'm Sylvia Contreras, and I just wanted to say thank you to the commission that created this blueprint. I took note, Vice Mayor Richardson, that hopefully the veterans commission will take this as a model. I'm here also as commissioner of Veterans Admission or Veterans Affairs Commission.'",
        "'speaker_6': 'I liked it right away. So I second to your motion and I'll bring it to Gina's attention and everybody else's. And that's all. Thank you.'",
        "'speaker_2': 'Thank you. So with that, we have we have a motion on a second to approve the draft and staff will read it the final and of course, synthesize everything they've heard today as well as the comments that have been submitted.'",
        "'speaker_2': 'Members, please go ahead and cast your vote.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Thank you very much. Congratulations. Let's give everyone a round of applause for their hard work on that. And you know, one thing one thing I didn't say just briefly that I think it's important to thank the innovation team because, you know, this is one of the things that they worked on early on as an initial project.'",
        "'speaker_2': 'Then it got transitioned over to the department and that's I think what the innovation team is all about is starting something with the commission and then it got transitioned to the full department. And so the innovation team members worked really, really hard on that, particularly the early days of this of this report.'",
        "'speaker_2': 'And I want to thank them as well. So congratulations. We're going to go ahead. And the next item that I had a request to be moved up was of the item 2021. I'm sorry. Nope. Item 20. He was only 20.'"
    ],
    "Recommendation to respectfully request City Manager, Department of Health and Human Services and Development Services Department to develop an incentive package to encourage landlord acceptance of subsidized tenants through the Housing Choice Voucher Program, and return to the City Council in 30 days. The incentive package should incorporate the following options:\n\n\tAlign and streamline the current city-mandated inspections with \n\tthe HUD-mandated Housing Choice Voucher inspections;\n\n\tWaive various permits and inspection costs for apartment \n\towners who accept Housing Choice Vouchers;\n\n\tCreate a Damage Mitigation Fund which provides financial \n\tassistance to landlords to mitigate damage caused by tenants \n\tduring their occupancy under the Housing Choice Voucher \n\tProgram;\n\n\tProvide landlords vacancy payments to hold units while the \n\tlandlord is going through the Housing Choice Voucher \n\tProgram approval process.": [
        "'speaker_0': 'Item 20 is a communication from Vice Mayor Richardson, Councilmember Pearce, Councilwoman Mango Councilmember your recommendation to request the City Manager, Health and Human Services Development Services Department to develop an incentive package to encourage landlord acceptance of subsidized tenants through the Housing Choice Voucher Program and return to the City Council in 30 days.'",
        "'speaker_1': 'Thank you. And Mayor stepped down. So I'm going to run this portion. So about a year, a little less than a year ago when I became chair of the Housing Authority, I sat down with the chair, with the executive director, Allison King, to learn more about the various programs and the support that they offered Long Beach residents'",
        "'speaker_1': '. It's an amazing program that serves many hardworking Long Beach working families, and we're in a particular time when the status of the program is in jeopardy given the climate in Washington, D.C. and the dynamics of our local rental market.'",
        "'speaker_1': 'So let's look at what's stood out to me was when I learned that our housing choice voucher program, commonly known as Section eight, is not being utilized to its full potential with a 2% vacancy rate in the Long Beach housing market.'",
        "'speaker_1': 'It's become increasingly difficult to subsidize for subsidized tenants to find housing. There are over a thousand families and individuals who hold a voucher but are unable to find a landlord that's willing to rent to them or a vacant Section eight vacancy.'",
        "'speaker_1': 'So we began to look into why this is so. So we partnered with the Apartment Association. We conducted multiple focus groups and surveys to better understand apartment owners barriers to accepting the housing choice vouchers. After speaking with several apartment owners, we found that there's a strong need for modernization for the program to compete with rising rents, coupled'",
        "'speaker_1': 'with an education campaign to dispel the many misconceptions about the program. Throughout the process, we explored questions like Why would a landlord bother with a housing choice voucher when they can receive a higher premium in the marketplace? Why bother with yet another, more rigorous inspection when we already were already subject to other multiple inspections?'",
        "'speaker_1': 'Why would an apartment owner hold a unit vacant while a potential tenant conducts a Section eight process? When we can lease up to a market rate tenant and less time with less bureaucracy. It's clear to me that in order for the housing choice voucher program to compete with the open market, we need to modernize and create a'",
        "'speaker_1': 'better value proposition for property owners. In addition, early on we found that apartment owners felt that applying for the program was a difficult, difficult process to navigate and the website was not as helpful as it could be. So the Housing Authority was able to respond to some of these quick concerns quickly and realign their resources to create'",
        "'speaker_1': 'an ombudsman position to work specifically with apartment owners who are applying for the Housing Choice Voucher program as well as well as current owners in the program. Further, the Housing Authority is moving forward with redesigning its website to be more friendly and modern before.'",
        "'speaker_1': 'But there are some elements that require a deeper dove. So let's go ahead and move to a staff report so we can hear a little bit more on the focus groups, the surveys and some of the some of the next steps.'",
        "'speaker_2': 'Alison King, our director of our housing authority.'",
        "'speaker_6': 'Thank you. As Vice mayor stated, our program is one of the largest affordable housing programs here in the city of Long Beach. We provide financial assistance to low income, elderly and disabled residents of Long Beach so that they can live with dignity and decent, safe and sanitary housing.'",
        "'speaker_6': 'Currently, the Housing Authority, in partnership with 2600 property owners, assist over 6300 households that lease units in the city of Long Beach through various programs, including the Housing Choice Voucher Program. In addition to the Housing Choice Voucher program, we have other programs that specifically support veterans, those with HIV and AIDS and those with mental health challenges.'",
        "'speaker_6': 'Our tenant based rental assistance program offers much of a subsidy to housing residents. They generally pay between 30 and 40% of their income toward the rent, and the housing authority subsidizes the balance. We currently receive $68 million for the Housing Choice Voucher Program and have the opportunity to serve 7398 families with permanent, stable housing.'",
        "'speaker_6': 'The problem is that the housing authority for many years was a high performing agency, and that means basically that we achieved a 98% utilization rate of the vouchers that we were allocated over the last several years. There has been a increase in the number of vouchers that we have been provided, largely due to the VASH program, which'",
        "'speaker_6': 'is the only program that has had an increase of allocation. However, we have had a significant decrease in the number of owners who have been willing to offer their unit in the service of the Section eight voucher program.'",
        "'speaker_6': 'Currently, we are at an 85% lease up rate. This means that we are in jeopardy of having leftover funds recaptured by the federal government to assist other programs throughout the country that are running a shortfall. Understanding the problem to attain increased program utilization.'",
        "'speaker_6': 'Vice Mayor Richardson has engaged in a process, along with the Apartment Association of Southern California Cities and the Housing Authority, to engage apartment owners and identify causes for the recent decline in use of the voucher. Through this process, we convened three focus groups with over 40 owners and administered over 150 surveys.'",
        "'speaker_6': 'The owner demographics are 60% of our owners owned five or less units. 30% own between five and ten units and 10% owned 20 or more units. In our own conversations, there were many misconceptions, such as different rules govern subsidized tenants.'",
        "'speaker_6': 'The truth is, is that subsidized families are subject to the same rules as market rate families, as long as they are applied consistently, with the exception of the notice to vacate, which must be a 90 day notice. Without cause I can't ever evict or ask a subsidized tenant to vacate.'",
        "'speaker_6': 'This also is a misconception in that, as I mentioned, the 90 day notice to vacate without cause is always an option after the first year of tenancy and an individual can be evicted for cause at any time. I cannot charge voucher tenants.'",
        "'speaker_6': 'Market rate rent payment standards are what we publish to owners, and yet they are not the cap on the rent, only the cap on the subsidy. While some of our voucher holding families have significantly low income, they cannot pay more than 40% of their adjusted income in the first year after the first year of tenancy.'",
        "'speaker_6': 'That can indeed increase as long as the rent is reasonable. Section eight Tenants are criminals, drug dealers and bad people. The majority of housing choice voucher holders are simply low income families, and any owner has the ability and should take the responsibility to vet any individual who occupies their unit.'",
        "'speaker_6': 'Through these various focus groups and some and surveys, a number of recommendations have emerged from these groups to help increase the voucher lease up. The findings largely included the need for more outreach and education to landlords to address the misconceptions about the program.'",
        "'speaker_6': 'We believe that this has presented many opportunities for us to move forward. Some of the concerns that were raised are the city mandated inspections and fees that owners pay. Owners believed that if they accepted a Section eight voucher that they had to upgrade the unit, which is definitely a misconception.'",
        "'speaker_6': 'Voucher holders are hard on the unit and leave them with high costs to fix damages, and the section they process takes up to a month and they are expected to hold the unit for that period of time. These are some of the things that we hope to address along with, as vice mayor said, streamlining our website, having'",
        "'speaker_6': 'a single point of contact with an ombudsperson and improving our communications with owners via our newsletter as well as other opportunities to engage. At this time, I'll turn it back to Vice Mayor for the opportunities he'd like to propose.'",
        "'speaker_1': 'Thank you. So before continuing with my emotional and take a minute and just thank Alice and her team at the Housing Authority for educating my staff and myself these last few months and working together to think outside of the box, to find new ways to address the needs of both the program participants and the apartment owners.'",
        "'speaker_1': 'I also want to thank the development services partner for being a well being willing to color outside of the lines and explore some ways to partner and create some efficiencies. I want to thank the Apartment Association for coming to the table, convening multiple focus groups of apartment owners.'",
        "'speaker_1': 'Your assistance, your support has been instrumental in shaping how we modernize the Housing Choice Vote Voucher program. I also want to thank the tenant rights groups for supporting this effort as it's our single largest resource to keep families from slipping into homelessness.'",
        "'speaker_1': 'So tonight I'm requesting that the City Manager, Department of Health and Human Services and Development Services Department develop an incentive package to encourage broader adoption of the Housing Choice Voucher Program and return to City Council in 3045 days.'",
        "'speaker_1': 'I'm requesting that staff work to incorporate the following elements align and streamline the current city mandated inspections with the HUD mandated housing choice voucher inspection. Waive various permits, license fees, inspection costs for apartment owners who accept housing choice vouchers.'",
        "'speaker_1': 'Create a damaged middle damage mitigation fund, which provides financial assistance to landlords to mitigate damage caused by tenants during their occupancy under the Housing Choice Voucher Program and provide landlord landlords vacancy payments in order to hold the unit while the landlord is going through the housing choice voucher program.'",
        "'speaker_1': 'These are elements that could be a part of this incentive package. The obviously we've done a little bit of homework, but they still need to be vetted out completely. So we do have the flexibility to come with what we think will work and what we can support.'",
        "'speaker_1': 'And and so with that, I asked my colleagues for their support tonight. Thank you. So next we have Councilmember Pearce.'",
        "'speaker_5': 'Thank you, vice mayor, and thank you staff and the apartment association and all the housing advocates that have done work on this saying in my office, as always, that everybody needs to be at the table and that if we're not talking at the same table together, then we're always going to have misconceptions.'",
        "'speaker_5': 'And so I really want to applaud the vice mayor for doing that, not just on one occasion, but on multiple occasions where we can really take apart some of the misconceptions and start fixing our program. And so when I first came into office, homelessness was one of my biggest issues in my district, and we continued to meet'",
        "'speaker_5': 'with as many department folks as we could and many advocates and try to find out some of the challenges. And so I'm thankful that Rex is leading on this. Proud sponsor, co-sponsor, because we know that the housing choice voucher program is a critical tool that can be used to combat and prevent homelessness at any given moment there'",
        "'speaker_5': '. Between 506 hundred voucher holders in Long Beach who cannot find an affordable unit to lease. Oftentimes their vouchers will expire, as the vice mayor mentioned, and many have to start the process over and reapply all over again. The impacts on this are huge for our city, and we are now at a new opportunity with new revenue sources'",
        "'speaker_5': 'as well from the passage of Measure H and unique opportunity to develop such programs as this. I had just two questions on are there opportunities right now outlined in Measure H that directly connect to Section eight housing? That's for staff.'",
        "'speaker_1': 'I can't answer that. Yes, Mr. West.'",
        "'speaker_2': 'I'm going to turn that over to Allison.'",
        "'speaker_6': 'There are opportunities. They have not specifically been defined at this point. Our director of Health and Human Services, Kelly Calliope, is serving on a county wide committee to review those. So, yes, there are opportunities.'",
        "'speaker_5': 'Great. Thank you so much, Vice Mayor, for bringing this item forward. I hope everybody can support this tonight.'",
        "'speaker_1': 'Sure thing. Thank you, Councilman Austin. Well, I think.'",
        "'speaker_3': 'My question was was certainly answered here. I will definitely be supporting this because I think it merits a look in and I'm very interested with what I'm going to be most interested in, what comes back from staff. I think I'm concerned about the funding, obviously, with the at least three of the points here.'",
        "'speaker_3': 'I'm wondering where those funds are coming from. And I heard Measure H being an opportunity. I'm curious to know you mentioned that that we were at a 85% threshold. So can we use the rest of that 15% toward this?'",
        "'speaker_6': 'Unfortunately, no. HUD funds us in such a way that our housing assistance payments are specifically only for the purpose of paying rent, and that is only once an individual begins their tenancy in a unit. We would have to use our administrative fees, which are being pro-rated at about 80% of what we should be receiving.'",
        "'speaker_6': 'And we are only getting those administrative fees when an individual leases up. So our revenues have been dipping and do not present an opportunity for them to use in a very broad manner.'",
        "'speaker_3': 'Okay. And I understand the challenge in terms of finding available housing with those who are holding vouchers. And I know we've we've had housing authority meetings pretty regularly. What is the vacancy rate here in Long Beach now?'",
        "'speaker_6': 'It still remains at about 1.8 to 2.2%. I believe that has been the information that has been reported.'",
        "'speaker_3': 'So if we were to actually incentivize Section eight housing, incentivize landlords to to to make that 1.8% available, how many would what does that look like in terms of real numbers?'",
        "'speaker_6': 'I'm sorry, I couldn't answer that specifically, but the challenge has been that many owners in the area are not even giving an opportunity to voucher holding families. We understand and respect their need to vet these families and anyone else who occupies the unit.'",
        "'speaker_6': 'We simply want them to have a chance to apply and be considered based on their suitability for tenancy.'",
        "'speaker_3': 'Understood. And then and then lastly, on the first point, I mean, it says to a line is drawn line. The current city mandated inspections with HUD mandated housing choice voucher inspections. And perhaps somebody from staff can tell me how those inspections are currently done.'",
        "'speaker_3': 'Now, are they done by the same personnel?'",
        "'speaker_6': 'Each of them were conducted by two separate departments, and we are investigating where there is synergy in each of those. At this time, we don't have that information.'",
        "'speaker_3': 'Okay. Now, in a.'",
        "'speaker_2': 'Former.'",
        "'speaker_3': 'Role, I was I represented a Section eight housing inspectors in for Hakala. And I know their role is a lot different than code enforcement. So I know that's something that's going to have to be really vetted out and worked out through with staff and with the the impact of labor organizations.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Austin. And those are some of the things we hope to explore. Maybe if one inspections happened in on one day, the other inspection could perhaps happen the same day. So there's less, you know, disruption to the landlord and the folks who live in the complex.'",
        "'speaker_1': 'So these are all great questions. Thank you for those. Councilman Price.'",
        "'speaker_7': 'Thank you. I want to thank the vice mayor and my colleagues for bringing this item. It's a great item. I look forward to hearing what representatives from the Apartment Association and the tenants rights groups have to say. I know we have received some letters, but I like to hear that everybody was at the table and input was'",
        "'speaker_7': 'elicited from everyone. I think that's really great. I know that one of the things and I read the stuff, I read the agenda item a couple of days ago. So my memory may not be correct on this, but I think I also heard Vice Mayor Richardson make a statement about maybe needing an ombudsman, too.'",
        "'speaker_7': 'So my concern is I'm wondering what staff resources we already have, at least maybe for a pilot. Graham could we use our existing staff resources? And that's something that I think would be included in the city manager's report.'",
        "'speaker_7': 'Is this something that we can explore without taking on an additional cost in terms of staffing for the city? So the city manager can look at this issue with an eye towards us not having additional staffing? I would feel a lot better about it, at least for a pilot period of time, until we can figure out whether'",
        "'speaker_7': 'we can use measure funds and things like that.'",
        "'speaker_1': 'I think we can say to a rest we already figured out the Ombudsman without spending an additional dollar rate.'",
        "'speaker_7': 'That's fantastic. That makes me feel a lot better. And I think the other thing I was going to ask Allison is I think I had read an article about something, a similar program to this being used in other municipalities in the Western Cities magazine.'",
        "'speaker_7': 'Is this something that other cities are exploring in terms of incentive packages?'",
        "'speaker_6': 'Absolutely. Our neighbors have it. The County of Los Angeles Housing Authority and the City of Los Angeles Housing Authority are already doing many different things. I was at a recent meeting where they identified 1553 I'm sorry, strategies that they are using to combat this issue.'",
        "'speaker_6': 'They, however, have elected to turn over all of their new vouchers for the purposes of homeless persons only. So there was a recent article that indicated that their waiting list has over 40,000 persons, and that is because they are targeting specifically homeless individuals.'",
        "'speaker_7': 'And in in terms of that, were they experiencing the same problem with the the that the voucher is not being utilized to their fullest extent?'",
        "'speaker_6': 'There were challenges in getting owners to the table. They are already doing things such as the vacancy payment and the security deposit. Yes. Okay.'",
        "'speaker_7': 'That's that's an interesting consideration. Utilizing it for exclusively for homelessness. Is that something that you think down the road might work for, for the city of Long Beach based on your expertize?'",
        "'speaker_6': 'That's not an answer that I can really give. However, I will say that we currently do set aside vouchers to our multi-service center. They are our coordinated entry system and they do already identify those persons who would be a good candidate for the voucher.'",
        "'speaker_6': 'We have been increasing that number as the need arises. Fortunately, we are all in the same department and will continue to be responsive to the need as it presents itself.'",
        "'speaker_7': 'Do you know if all the vouchers that the Multi-Service Center has get used to any of those not get used?'",
        "'speaker_6': 'Every one of those that they get allocated are referred to us. Now, of course, those persons are also struggling to find places to use them. But every voucher that we set aside for them, we get a referral from them.'",
        "'speaker_7': 'That's great. Thank you, Will. Thank you for the report. It was really informative. And again, thank you to my colleagues for bringing this item.'",
        "'speaker_1': 'Thank you and council members.'",
        "'speaker_7': 'Yes. I, too, want to just say thank you for bringing this item forward. Vice Mayor and council colleagues. I think it is a fantastic item that, you know, where we need to look everywhere to find housing opportunities. And so thanks to everyone in the audience as well for being a part of it.'",
        "'speaker_7': 'I have just a couple of questions on the item, and I want to also thank Housing Authority Alison for your great work as well. So the damage mitigation fund, I was talking to Council Member Pearce and what other cities have something like this and what are the logistics?'",
        "'speaker_6': 'The county is doing this program as well. It's a $2,000 fund that they set aside with very strict policies on how it is used. They implemented this in February of 2016. At a recent meeting last week, they indicated to date that they have only had to pay one damage claim for an individual who had only been occupying'",
        "'speaker_6': 'the unit for two months before they destroyed something. But they also do have supportive services in place to follow up with families once they lease a unit.'",
        "'speaker_7': 'Okay, great. That's good to hear. And then next question. I know you had mentioned that we received an abundance of ash vouchers, and I know we haven't we haven't gone through all of them. Is that correct? At this at this time.'",
        "'speaker_6': 'We have not least of all of our ash vouchers, they, too, have the same concern of not having places to be able to use them. However, we do have a new project based development that is coming online in the fall anchor place on the property of the villages of Cabrillo.'",
        "'speaker_6': 'Those will be 75 project based vouchers. Vouchers.'",
        "'speaker_7': 'And those are specifically for veterans. Correct. Okay. So if we don't have and who knows, you know, the specs, of course. But do we have an ongoing need for veteran housing? I mean, it would seem like we would, but I know we don't have a place.'",
        "'speaker_7': 'So I guess my question would be if if say we don't have any more veterans out there that need these types of vouchers, would this with these vouchers possibly, is it possible to convert them to just generic vouchers at all?'",
        "'speaker_6': 'No. These vouchers were specifically identified by HUD for the voucher program. We receive all of our VASH referrals directly from the Veterans Administration, and those are sent to us. And I do believe that they still have a very significant number of persons that are in need of housing.'",
        "'speaker_7': 'Okay, great. Thank you very much for that. And again, appreciate all your work.'",
        "'speaker_1': 'Thank you. And that was a good, robust discussion. It's not so often that we see, you know, something come the council that has apartment owners and renters both saying the same thing. And that said, let's let's go ahead and have public comment.'",
        "'speaker_1': 'So please come forward and you have state your name. You have 3 minutes.'",
        "'speaker_2': 'Thank you. Robert Fox again. Sorry to be in front of you so often tonight. I gave you all a letter, and I hope you will read it. It sounds a little harsh, but it's my personal experience. The Section eight Housing Department.'",
        "'speaker_2': 'At one time, I worked very closely with the head of the department, Laura Joseph, when she was the director. And we did have a reform of Section eight housing, and it worked pretty well for a long time. Unfortunately, in the meantime, that those reforms were kicked out the window.'",
        "'speaker_2': 'So I appreciate the fact that we're at least coming to the table and talking about reforming this department. Let me tell you what my problem is with it, because I don't accept Section eight anymore. Like many, many landlords and I'm I'm just angry that I don't because I'm like this crazy, generous person.'",
        "'speaker_2': 'I sat on the board of the Gay Lesbian Center, so I accepted Hopper grants, you know, and I wanted to help people. I furnished an apartment for somebody who didn't have any furniture, you know? I mean, I've done way over-the-top stuff, but I got burned so bad by this department.'",
        "'speaker_2': 'It was amazing. The inspectors would come in and literally tell me if my toilet didn't flush in 3 seconds, I had to replace the toilet. And I thought, Where in the hell is that in the code? You know, I helped write the building planning code for the city of Long Beach long time ago with Jeanne Zeller.'",
        "'speaker_2': 'So I thought that sort of weird, you know, they had inspection standards that would be like for a mansion in Newport Beach. What I in my buildings are in great shape because I'm fanatic, you know? But it's like they cited me for all this stuff and I going, What?'",
        "'speaker_2': 'What are you talking about? Oh, what the PSA is and how high enough in your your kitchen faucet.'",
        "'speaker_1': 'Really? Because mine is just the same as that in my house.'",
        "'speaker_2': 'We need to codify the kind of inspection that we are going to do on housing. We are not in Section eight giving palatial palaces to rich and famous folks. We just want good, standard, clean housing. That's what we want.'",
        "'speaker_2': 'And I provide it. I don't provide anything else. But. And yet. When you're in an inspection process with Section eight, they can just withhold your rent and it doesn't matter that you took care of it in 10 minutes, you lose a month's rent and there's no negotiation with these people at all, period.'",
        "'speaker_2': 'So it brings me to the other issue that, of course, me as a landlord and as a person have that department is so hostile. And when I go up there trying to do my best to get a friend of mine into the Section eight program and he's going to move into my unit, it's like the two of'",
        "'speaker_2': 'us just I mean, Vince and I just were freaked, you know, he was treated like some sort of lowlife criminal and I was treated like some greedy jerk. They'd close windows on us. They'd make us wait for two and a half hours, you know, sitting there and it's like, wait a minute.'",
        "'speaker_2': 'So I go up to the window. I said, How long do we wait for this stuff? Shall I make an appointment with you? Now you just have to wait. And rudely. So I got to tell you something.'",
        "'speaker_6': 'It's about staff, Allison.'",
        "'speaker_1': 'You have.'",
        "'speaker_2': 'Got to.'",
        "'speaker_6': 'Train people.'",
        "'speaker_2': 'To have good manners. You know, you. If you anger people that much, what landlord wants to go through that.'",
        "'speaker_1': 'So if you can direct. Well, it looks like a few minutes, but thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening to Mayor Garcia in his absence. And greetings to all on the panel tonight, especially Mayor Rex Richardson. My name is Rhonda Butler, and thank you so much for being concerned about the housing problem that we have in Long Beach.'",
        "'speaker_6': 'I am one of the ones who is unable to use my voucher. I was on the list for 18 years before my name was chosen. I was issued my voucher in May of last year. I'm at my last extension and I have nine days left.'",
        "'speaker_6': 'No one will take my voucher. I have always worked hard and have always paid my way. Being a city employee, working my way up from the bottom custodian, parking enforcement officer, and then to public works as a parking checker, I made the 525 when working a city vehicle, came out of gear and pinned me up against a'",
        "'speaker_6': 'parked car. I was let go due to my non career status. I'm not looking for a handout, just a helping hand. Thank you so much. I've been here since 330. I need to say something to you tonight, and I just want to thank everybody that came.'",
        "'speaker_6': 'I don't know about the gentleman in the red shirt, but I've never came to office, man. And nobody never treated me wrong there. I've never waited longer than I should have. I waited for my name and I waited for my number.'",
        "'speaker_6': 'And I always got service when I was there. So maybe he just showed up on a bad day, but I never came here and got mistreated. And I'm so glad to see you here tonight. And I'm so glad that everybody is here tonight.'",
        "'speaker_6': 'I know that Long Beach is working. I've been in this city for 60 years. Me and my mother came here when I was a little girl. Before all this stuff was even here. So I just want to say thank you for.'",
        "'speaker_6': 'For looking out for us. We need somebody to look out for us. And I don't want to be homeless.'",
        "'speaker_4': 'But I'm on my way.'",
        "'speaker_6': 'I ran out of all my options. Thank you so much. Thank you so much, sir. I read that article. Somebody hurt us and God is using you. He's using you. Thank you so much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Hello again, Sylvia Contreras. I just wanted to make a comment. Years ago, I had a family member that lived here in Long Beach, worked in Long Beach, and moved out of the city and then moved out of state.'",
        "'speaker_6': 'Came to a point that when she moved out of state, she needed state assistance and she wanted to come back to Long Beach. And I said, well, you know, what? Does she have state assistance out there? Maybe you can qualify for state assistance here.'",
        "'speaker_6': 'So so let me call a section, a group, and see how this can work. So when I did, what they told me is that, no, it cannot be a family member. They have to wait in line. I don't know if that's true or not.'",
        "'speaker_6': 'But what that made me feel, I said, Well, if I can't help my own family, like, you know, I felt bad helping strangers. So that deterred me from going to Section eight. She came back again about a year ago and I said, you know, that's what they told me years ago.'",
        "'speaker_6': 'I can't help you unless I become the subsidized person, and then that would affect my income. So yeah, incentive maybe an incentive would be to let landlords, you know, if they have a family member in need and they qualify, why can't they be the ones to move in?'",
        "'speaker_6': 'I don't know. That's just my comment. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, everyone. Can we fight and live at 17 Pacific Avenue? And I'm with the Long Beach Gray Panthers. And affordable housing is one of the key issues that we are addressing this year in our campaigns. And I'm very heartened to see that the working towards creative solutions to an affordable housing issue.'",
        "'speaker_6': 'And I just want to commend the Housing Department. And Ms.. King has been amazing in her willingness to work with the community to create solutions that really help our community. But we still have a number of issues with affordable housing and unjust evictions, and there's just going to be more and more demand on our housing and our'",
        "'speaker_6': 'landlords. So I'm very hopeful since we're beginning to take steps to address some solutions. Thank you for all your efforts.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_5': 'Mayor Garcia and Honorable City Council. My name is Johanna Cunningham, the executive director for the Apartment Association, California Southern Cities. I am happy to come before you this evening on behalf of and in support of work that was spearheaded by Vice Mayor Rex Richardson and included ARCC and the Housing Authority.'",
        "'speaker_5': 'ARCC boasts over 2500 multifamily property owners, landlords, management companies and vendors who support this industry an industry that contributes greatly to our local and statewide economy, but an industry that has also been misrepresented by a few bad owners over the past few years.'",
        "'speaker_5': 'It has been our mission to connect with our city representatives and to inform and educate the truth about owning rental property. For over 98% of our owners in our city, you have responsible, compassionate and reliable owners who care about their residents.'",
        "'speaker_5': 'This is why it was a welcome partnership to engage in a conversation on some of the challenges that exist with a program that so many owners participated in and supported. In the past, over 98% of housing vouchers were being used, but it became clear that the changes in policies had not been adequately passed along or adopted by'",
        "'speaker_5': 'our owners. After several meetings with both the vice mayor and Alison King from the Housing Authority. There were issues that were not only cleared up as misunderstandings, but also made both sides aware that communication needed to be consistent.'",
        "'speaker_5': 'Needless to say, the meetings resulted in positive outcomes for both parties, and we look forward to continuing to work with willing partners. So I come before you this evening to thank you for including the Apartment Association California Southern cities in this process, for being willing to listen to our concerns and for being willing to work on an'",
        "'speaker_5': 'incentive package that will help increase participation in the housing voucher program. In conclusion, I want to thank Vice Mayor Rex Richardson, Alison King, and I want to thank you for those who have signed on to this recommendation. Janine Pearce from District two.'",
        "'speaker_5': 'Roberto, you on the from district seven. And Stacey Mongo from District five. We look forward to continuing this partner and we look for it as an industry that is more than just people oriented but is family oriented. Thank you for your time this evening.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hello. My name is George O'Hara, and I have a small apartment in District seven.'",
        "'speaker_1': 'I'm new to residential housing, and I'm an insurance agent by day. A couple of years ago, I bought a small property built in 1955. Since that, it has required regular maintenance and repairs to plumbing systems, landscaping. And I just replaced that entire bathroom because of rot to the supporting beams under the floor.'",
        "'speaker_1': 'I guess that's to be expected for a 60 year old building. By chance, I was already a member of the Apartment Association of California Southern Cities. Their input has been instrumental in educating me on how to operate as a property owner.'",
        "'speaker_2': 'And inspire me to maintain a.'",
        "'speaker_1': 'Clean and attractive property. I want to thank Vice Mayor Rex Richardson for opening dialog with the Apartment Association on how to improve the Housing Choice Voucher Program in Long Beach for both landlords and tenants. I also want to thank Alison King for giving me an education on how Section eight of the voucher program works.'",
        "'speaker_1': 'I feel more confident with it now. I thank you. Thank you. Next bit of news.'",
        "'speaker_6': 'My name is George. I'm the total and I was here in October. I want to thank you, Mayor. You gave me a card and I got my section it. But five months I've called at least 400 numbers and either it's like we don't want to work with them and they hang up.'",
        "'speaker_6': 'Or there's just nothing there. There's nothing there. So my daughter is getting ready to run out. And I was told I don't get an extension. I know another young lady with three kids living in her car. When I was here last time, it was because we got evicted by.'",
        "'speaker_6': 'It's called the Dome now. It was the Mike Dunphy group. And they told us when we got kicked out that they were going to remodel and that we would have a chance to move back in where they're remodeled.'",
        "'speaker_6': 'So I went to a to apply for an apartment in the same building with Section eight. They accept Section eight, but they still want you to make twice that amount of rent. When I lived there, I was paying 750.'",
        "'speaker_6': 'A little small studio now. LS 1195 section. I don't pay that much. They only pay 1128. You guys build them all so everybody can be homeless. You know, it's just it's crazy. I've been here 52 years my whole life.'",
        "'speaker_6': 'And now I'm here again. Go again. Going to be homeless. There's got to be. Maybe when we turn, if we get our package turned in, if we bring our package in to section eight, can they get them going faster?'",
        "'speaker_6': 'So the managers don't give us you know, don't want to give our apartment away? Or is there a way that because I'm doing Multi-Service Center, if they can pay the deposit to guarantee that we're going to have that apartment, because a lot of managers said, well, we have to wait, you know, they don't want to wait.'",
        "'speaker_6': 'They don't want to leave their apartments sitting for a month, sometimes two months. There's got to be some. You know, we got all these abandoned buildings around here. You guys are building all this stuff. Redo a building for people that need it.'",
        "'speaker_6': 'Not all the homeless people out there want to be homeless. They don't want to be out there in the street. But there's no housing. None. There's more kids homeless out there than I even care to think about. So one more time.'",
        "'speaker_6': 'June. If I don't find a place and they won't give me an extension. What am I supposed to do? I'm 57 years old. I have lupus, I have Parkinson's, and I'm on a liver transplant list. And I'm in recovery, so I got ten years clean.'",
        "'speaker_6': 'If I have to go back out there and be homeless.'",
        "'speaker_1': 'Well, we understand. Thank you. Thank you for your time. Next speaker, please. Good evening, Mayor and city council and staff. I want to commend Vice Mayor Richardson and all the coauthors on just thinking out of the box and really thinking about innovative ways to help solve this affordable housing crisis that we have here in the city.'",
        "'speaker_1': 'I think it's a it's a great first step to, you know, to to move towards actually housing the people that need it the most. As you heard from Georgianna, Georgianna is definitely you've been having a hard time as well as another person out here in the in the audience that is also in Section eight, having a hard'",
        "'speaker_1': 'time finding a place to live. So and it's also just a shame that we're we're at the brink of losing all this funding from the federal government if we don't find, you know, find a way to actually keep it here.'",
        "'speaker_1': 'And then and then on top of that, the new administration and the threats that come to to the housing authority because of that, you know, and all of this ties in together, because I know the homeless the homeless or the people without homes is a huge issue and problem that the city is trying to tackle.'",
        "'speaker_1': 'And this is just one way, one step in moving toward actually solving that issue or finding a solution for that issue. If we can't if we can't remedy this, if we can't save this this great resource that that our city has, then we're just going to find ourselves piled up, piled on top of more people without homes'",
        "'speaker_1': '. I mean, we have two people here in the audience, three people that are on the brink of that right now. And I know we can't build housing that fast, but we can try to encourage property owners to take Section eight and do whatever we can to think outside the box to make sure that people do have homes'",
        "'speaker_1': '. So I do commend everybody on working, working on this and just let me know, you know, again, I didn't introduce myself. I'm sorry. We're hearing that our program director of Libra. So anything that we can do to help, to help educate the community, to let us know.'",
        "'speaker_1': 'And when you do come back with some educational program, I do recommend that you probably give VIP seating to Robert Fox because he definitely needs to to be educated on maybe dispelling some of the myths that he has on Section eight voucher holders, because that's definitely something that we need to do.'",
        "'speaker_1': 'Not everybody that holds Section eight, as you saw, is Georgina is not a drug dealer, is not a gang member, is not some sort of criminal. And we're not trying to to protect them because there are laws to get them out if they do if they do violate some sort of laws.'",
        "'speaker_1': 'But we do need to educate the community and those property owners that still holding on to those myths about Section eight tenants and and just maybe educate them and open their minds a little bit. Thank you very much for all the work on this.'",
        "'speaker_1': 'And thank you for your time. Thank you. Next speaker, please. Good evening, Mayor. Vice Mayor and other members. Other council members actually came here for a different reason, but I thought I would propose an idea. It's a long term shot, but I actually represent a landlord that borders a Section eight housing community in North Long Beach.'",
        "'speaker_1': 'The people there are generally good people. My proposition is find contractors, contractors, people that are willing to donate lumber, maybe renovate some projects in Long Beach that could use an uplift and find these people that were normally going to use the vouchers.'",
        "'speaker_1': 'Because it seems like there was two problems with your report, ability to use the vouchers and problems with the landlords so the city could then themselves become the landlord. And you hire or you teach these people that are willing to do contractors that are willing to donate their services, help people in need, learn a new craft.'",
        "'speaker_1': 'Therefore, they can be employed by the city afterwards, stay in Long Beach, pay taxes to Long Beach, and they live in a home that they helped build. Thank you. Thank you for your time. Next speaker, please. John dilatory names on file.'",
        "'speaker_1': 'Mr. Honorable Mayor and City Council. I appreciate the opportunity to come up and speak with you tonight. Before I can go into my speech, first thing I'd like to say is I think, you know, what we're hearing here tonight is that there's hope, right?'",
        "'speaker_1': 'You're hearing from all sides and from everybody. There's hope because we do have a crisis. Right. We have too many people and not enough housing. It will take just like the last two gentlemen said, it's going to take a while and hopefully working together, we can come to that.'",
        "'speaker_1': 'So I think it's just it's encouraging as a citizen of Long Beach that we do have hope. So I am also an association member. I would like to thank you for the opportunity to speak. I just want to let you know, we fully support the recommendation that that's in front of.'",
        "'speaker_1': 'And we really appreciate all the work that Allison and city staff and the council members have put in putting this together. And we like that we were included as a part of this solution because really solutions only come if everybody's at the table has been said many times tonight and we really look forward to continuing being a'",
        "'speaker_1': 'part of the solution over the next 30 days, whether when this comes back. So, again, thank you. And we do support this. Thank you. Next speaker, please. Thank you council for tackling and looking to tackle this project. I'm a Bill Davis and I'm actually a property manager who does accept Section eight and I can testify that some'",
        "'speaker_1': 'of the inspectors do get a little bit unreasonable with their inspection items.'",
        "'speaker_8': 'But that being said, for.'",
        "'speaker_1': 'The most part, I haven't had too much.'",
        "'speaker_8': 'Of a problem with that.'",
        "'speaker_1': 'I do want to address I do agree with the three points that have been made in regards to on the incentive.'",
        "'speaker_8': 'Side and the education side. Those items are good.'",
        "'speaker_1': 'There is some very practical, non expensive methods.'",
        "'speaker_8': 'That can be used to alleviate some of.'",
        "'speaker_1': 'The timing gap that occurs and that would be in the preapproval aspect for the tenants. Currently I have a unit, I've had 20 people, 20 on on vouchers come through. Most of those were people that had their we're looking for a ground floor unit because they had some type of a disability.'",
        "'speaker_1': 'And in regards to a comment that was made that the price per zip code is not a fixed point in total. My experience is that is not true. The local office does treat that as a mandatory cap. They don't take the person's available income under the 40% and add two.'",
        "'speaker_1': 'They merely say what that zip code cap is, is what we're going to.'",
        "'speaker_8': 'Pay no matter what.'",
        "'speaker_1': 'So that has been an issue that has caused almost all of the 20 that have come to look at the unit to say, you know, look, I'd love to take it, but, you know, they're not approving it. The pre-approval thing that I've been working with the local office on is to be able to basically say, Look, here's'",
        "'speaker_1': 'the stuff that you're really looking for. It's pages three and four of the owners packet. That's what they're looking for. It says We have this many units that we've rented at this price. Here's the amenities that we're putting with this unit and to be able to subject that for the pre-approval, if we can keep that on file'",
        "'speaker_1': 'instead of having to refill out every time someone wants to come and apply for it, to be able to work with that local office and say, Hey, look here, you already know you're going to need a price exception or you know, because you're doing a mandatory cap on that zip code.'",
        "'speaker_1': 'If you could just keep these pages on file so we don't have to the managers don't have to constantly fill this out and send it back. It would speed up the process.'",
        "'speaker_8': 'Okay.'",
        "'speaker_1': 'If we can get the approval times down to a day, we can then get the inspections done in two weeks because that's generally about how long it takes them to get out. And that alleviates having to pay the apartment owners for an extra month.'",
        "'speaker_1': 'Thank you. Thank you for your time. Okay. Next speaker, please. Good evening, members of the council. My name's Andrew Weil, and I live at 1995 Canal Avenue. I lived in Long Beach since 1986, and I've got rental property in the first District, the second District, the seventh District, and the eighth District.'",
        "'speaker_1': 'And I'd like to especially thank Councilmember Pearce, because I found out about this meeting and from one of her relentless emails. And what I want to tell you is why I'm no longer taking Section eight. And there are two reasons.'",
        "'speaker_1': 'Number one is last year I had an inspection for one of my tenants and they point out some things are wrong and we fix and they put in a time and they did the rent anyways. So I'm quite angry about that.'",
        "'speaker_1': 'And now the end. But here's the main problem. I think that probably affects most other landlords, that makes them reluctant is, you know, over the years I got my first Section eight tenant back in 1991 and over the years maybe they had a dozen or two.'",
        "'speaker_1': 'And I found that the vast majority, the vast majority of them are bad housekeepers. A lot of them don't even know they're bad housekeepers, but they're bad housekeepers. And a huge percentage of them are horrible housekeepers. And what's the consequence of that?'",
        "'speaker_1': 'Always, roaches. And when they move out, it's just a terrible condition to try. You get to do so much cleaning, replace so many things. So, you know, every year and over the years, how many how many times have you ever been cited for this bad housekeeping?'",
        "'speaker_1': 'None, even though it's right there on the inspection form. So what I would recommend is that, you know, you hold us accountable to a certain standard because we have a yearly inspection, is that you should hold the tenants accountable to a to a standard, hold up their end of the bargain.'",
        "'speaker_1': 'And for those that need a little help and and a little direction that you provide that to them so that we know that when we rent to Section eight, we're not going to get someone who's going to be creating a problem for the neighbors and a problem when we have to come and redo the apartment.'",
        "'speaker_1': 'So and was those are my $0.02. I thank you very much for your time and have it evening. Thank you for your comments. Next speaker, please. I really wasn't planning to come today and speak tonight, but I've got to take this time to thank everybody that's up in front of us.'",
        "'speaker_1': 'Let me just say, I've lived in Long Beach for 77 years. I've been on housing cabinet and, you know, helping them. And nobody is doing a better job right now.'",
        "'speaker_8': 'Than Rex and Alison.'",
        "'speaker_1': 'Let me just tell you, I've been up the 50 vouchers that I've had under my control. I grew up in the projects of the Carmelites, and now I live in a better part. I love this system because it's better than the projects where you put everybody.'",
        "'speaker_1': 'The kids are playing with other people that are going to work and doing it. All I can say is we're here tonight. Fox I mean, everything that people have said here, it's true. It is truly true. I haven't heard anybody get up here and say something that I would say was a lie.'",
        "'speaker_1': 'But the thing is, is what we're doing now is we're correcting it. This is the first time. And believe me, I've been way before, Alison and Reggie and Laura and, you know, the whole bunch. We used to have committees that got together as owners.'",
        "'speaker_1': 'Now I'm the chairman of the board for the Apartment Association. I think they gave it to me because we never had a chairman of the board just because they didn't want me to leave. And I've been in that even longer.'",
        "'speaker_1': 'So with that being said, we're on the right track, guys. And let me just tell you, Robert, believe me, talk to them, because I've had the same thing happen to me that's happened to you, but to communications. We're going to change it.'",
        "'speaker_1': 'Thank you. That's enough for my time. Thank you. Next speaker, please. Bill, Mayor, City Council. Thank you for taking.'",
        "'speaker_2': 'A minute.'",
        "'speaker_8': 'To listen to me. I work for our county, contracted our peer run community center in Huntington Park. And I worked in a lot of there this this nonprofits, agencies, places throughout the county because we have over 200 groups that are assisting individuals who have lived experience and are now doing better recovery.'",
        "'speaker_8': 'The part of the system that we're discussing today and I thought it was important to show show up and converse for a few seconds about our agency. There are alternatives. There's a share program. They have a program where they share space to individuals.'",
        "'speaker_8': 'They have different places like National Affordable Housing, where they have Section eight listings in different states and they let you apply there. There's, you know, a few alternatives, but as you can see, it'll all work somehow. And the Wells Fargo Bank has a two year waiting list with Habitat for Humanity.'",
        "'speaker_8': 'And that's because they have to do all the process, find the people that volunteer for them. So we've discussed some of those particular alternatives. But when I went to Japan a few times, it's really difficult because they have a place where I went to and it was just outside of Tokyo and it's a combination hotel, hot springs'",
        "'speaker_8': 'and restaurant, and they train individuals who leave the mental health hospitals with a ten year minimum stay, and only one owner is a doctor of that place. So he's responsible for everybody there. So it's really difficult over there.'",
        "'speaker_8': 'I brought this to the attention of individuals here at the county level where I am assisting with peer run wellness centers throughout the county. There are 69 of them and I let them know that it's not enough because basically there's a lot of people and I can show statistics where Proposition 63 was put to the vote twice'",
        "'speaker_8': 'and twice. The voters said, do not use that money for anything else but mental health services. So the.'",
        "'speaker_3': 'Money's there.'",
        "'speaker_8': 'Somehow we have to find more inclusiveness for individuals like myself, who is a person with lived experience and has continued to work diligently to somehow alleviate the problem with what is available out there and what people can understand and want to be a part of.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Very good to address on file. Following up on this comment from the speaker a few moments ago, relative to some of the Section eight people being bad housekeepers, as it were. Perhaps what the city should do is take a city staff member well-trained in that, you know, our Marine.'",
        "'speaker_1': 'Bureau.'",
        "'speaker_2': 'Has. I know. People that do a great job of keeping the restrooms around the area clean and other facilities as well spotless and had that as of have them go in and if they are challenged, if their housekeeping knowledge is challenged, show them what to do.'",
        "'speaker_2': 'And if not, then read in the riot act and say, if I got to come back and clean this up again, you're out and see how that works. Thank you.'",
        "'speaker_1': 'Thank you. And say no further comment. I just want to thank everyone who joined us tonight. And later, comments like to the city council and the staff. And even if we move the needle just a little bit, it's going to make a big difference to Long Beach families in need.'",
        "'speaker_1': 'Seeing no further comment. Comment members, please cast your vote.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_2': 'Okay. Thank you. And thank you all for coming and for your involvement. Appreciate that. Okay. We're going to go back to the regular agenda. We do have some members of the public that signed up on on non agenda items.'"
    ],
    "Recommendation to respectfully request City Council approval of the 2017 State Legislative Agenda as recommended by the State Legislation Committee.": [
        "'speaker_0': 'What about 18?'",
        "'speaker_2': '18? Sorry, I skipped over that. 18.'",
        "'speaker_0': 'Key Item 18 is a communication from Councilman Alston, Chair of the State Legislation Committee, recommendation to request approval of the 2017 state legislative agenda as recommended by the State Legislation Committee.'",
        "'speaker_2': 'That's right.'",
        "'speaker_3': 'Yes. Well, the item is before you, I'd like to get a staff report from Diana Tang or Mr. City Manager.'",
        "'speaker_5': 'Mayor, members of the city council. The State Legislative Committee did meet on January 10th, 2017 and received and filed all of staff's recommended changes for the agenda for this year. Staff's changes were predominantly organizational in nature. Last year, the.'",
        "'speaker_7': 'Federal Legislative Committee chose to reorganize the agenda so that it would perhaps be.'",
        "'speaker_5': 'A little bit more accessible and easier.'",
        "'speaker_7': 'To read for the public. And so we made those same changes to the state agenda.'",
        "'speaker_5': 'We also added language to say that we would support legislation, policies and grants in addition to simply state legislative proposals. The committee at the time also asked staff to add in three new items. The first was related to minimum wage.'",
        "'speaker_5': 'There was a discussion related to the restaurant industry and discrepancies between tipped workers and untapped workers. So we went and did some research and came up with language to.'",
        "'speaker_7': 'Support legislation that minimizes wage disparities between.'",
        "'speaker_5': 'Tipped and untapped workers in the restaurant industry without impacting existing scheduled.'",
        "'speaker_7': 'Minimum wage increases.'",
        "'speaker_6': 'The committee also.'",
        "'speaker_7': 'Asked us to add in language related to.'",
        "'speaker_5': 'Grant funding for local governments as related to law enforcement and marijuana growers that may, may pop up in the city as a result of new state laws. And so funding to local governments to eradicate illegal growth of marijuana plants has been added to the agenda.'",
        "'speaker_5': 'The committee also asked us to add an item to support additional funding to local governments to support housing, animals and.'",
        "'speaker_7': 'Animal care shelters beyond three days. And so that change has been made as well.'",
        "'speaker_5': 'And so those are the only three changes.'",
        "'speaker_7': 'The committee requested.'",
        "'speaker_5': 'Beyond Staff's.'",
        "'speaker_7': 'Recommended changes which are in.'",
        "'speaker_5': 'The item before you. With that, I'm available to answer questions.'",
        "'speaker_3': 'Thank you, Miss Tang, for your very, very complete and brief report. I also want to recognize other members of the State Ledge Committee and thank council members Gonzalez and Mongo four for their work in helping to frame this agenda.'",
        "'speaker_3': 'I know there are a lot of other moving pieces going on in Sacramento right now. I think our state legenda is is one that is, I think, pretty comprehensive in really, really, I think embodies the the the the the the vibe and the the direction of our city council.'",
        "'speaker_3': 'And so I would ask for your approval. But before I do that, I'd just also like to just compliment Diana Tang for her tremendous work as our government relations director in Sacramento, but also her work in just keeping the council informed about changes going on in Sacramento, which we have a big one happening just this week.'",
        "'speaker_3': 'One of the our state legends over the last three years has been to push for a statewide fix. Our Highways and Roads campaign, which will, I'm happy to announce, should be voted on tomorrow by the state legislature, SB one and AB one.'",
        "'speaker_3': 'This council has supported those bills in concept over the last three years, and it will yield a tremendous amount of new resources to our city for infrastructure repairs to the tune of about $11 million a year. Is that correct?'",
        "'speaker_6': 'That is correct, yes.'",
        "'speaker_3': 'And so congratulations, city council, for your efforts in that regard. And so with that, I would ask for your your support and in adopting the state legenda. Thank you.'",
        "'speaker_2': 'Thank you very much and any public comment on this. Before I turn to Councilman Gonzalez, not Councilman Gonzalez.'",
        "'speaker_7': 'Great work, Diana, and thank you, Councilmember Austin and Councilmember Mongo, for your work on this as well.'",
        "'speaker_2': 'Okay, Councilman Mongo.'",
        "'speaker_5': 'Thanks to my colleagues for their collaboration. And then I just wanted to. Earlier today at EDF, we kind of started talking about some of the sales tax implications and some of the things that have changed. I know that I've mentioned it to Diana.'",
        "'speaker_6': 'Since our hour five 4:00 meeting.'",
        "'speaker_5': 'But specifically, I think that it's.'",
        "'speaker_6': 'Time that we start looking into legislation related to how the sales tax has changed its movement with the sale of solar.'",
        "'speaker_5': 'And so it used to be that.'",
        "'speaker_6': 'If you sell solar and you're a contractor where you sell.'",
        "'speaker_5': 'It, etc., but now.'",
        "'speaker_6': 'That they're selling it out of Costcos and Home Depots and the such.'",
        "'speaker_5': 'That transition has happened and we're going to have some more leakage in those areas if we don't address it. So I don't I'm not sure where we want to go on that, but I.'",
        "'speaker_6': 'Just want to throw it out there. So the next time we have.'",
        "'speaker_5': 'An item that the community and our staff could look into that for us and give us a little bit more background. Thank you. But great working with everyone. Team proud to be a new member of a state. Let's.'",
        "'speaker_2': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_1': 'Just want to say good work to the committee and to Diana and $11 million for STS. Nothing wrong with that.'",
        "'speaker_2': 'Thank you. And congratulations to the whole committee. Count on us and a great job of winning the state, the state committee. And that vote tomorrow is very important to us. We've all been very involved. And if that happens, is, as we all expect it to, to go through that will be some immediate major highway construction money for'",
        "'speaker_2': 'us, for the city. So that'll be additional support. So thank you for that. There's a second. There's a motion and a second. Please cast your votes.'"
    ],
    "Recommendation to request City Manager to gather data on Illegal Dumping and draft an Illegal Dumping Action Plan to address the City's approach to resources, education, reporting and enforcement related to illegal dumping. The report should be drafted and returned to City Council within 120 days with subsequent updates on progress annually.": [
        "'speaker_0': 'Councilmember Mongo. Bush and Kerry's.'",
        "'speaker_2': 'Okay, now item 19. Councilman Urunga item.'",
        "'speaker_0': 'Item 19 is communications from Councilman Miranda, Councilwoman Gonzalez, Councilman Andrews and Vice Mayor Richardson. Recommendation to request the city manager to gather data on illegal dumping and draft an illegal dumping action plan.'",
        "'speaker_8': 'Get married, guys. Well, go ahead and take it. Thank you. Elizabeth Tatum says it is a consistent and visible problem in the city of Long Beach. It contributes to blight in our community. It is also one of the most frequent calls we receive in our city council office.'",
        "'speaker_8': 'Decided to allow us to take a closer look at where items are being dumped citywide and develop a comprehensive approach to solving illegal dumping. We would like to study to explore current barriers to reducing illegal dumping. One of the biggest barriers is that we have no plan for our multi-unit dwellings as it relates to bulky item pickups'",
        "'speaker_8': '. Our current policy as it relates to items dumped in alleys also needs updating. Currently, items don't do it and now they are the responsibility of the adjacent property. Owner and I are forced to call enforcement action. This is a policy that needs to be reexamined.'",
        "'speaker_8': 'And as we know that nine times out of ten the adjacent adjacent property owner has not played a role in the owners being behind their property and are now responsible for the disposal of it. I know that if we look at our goal on beach data, the calls for service we received through the illegal dumping hotline and'",
        "'speaker_8': 'the calls to city council offices, we can draft a comprehensive plan to proactively educate and reduce occurrences of illegal dumping in our city. I am glad that we are having this conversation and I know that we can make some improvements as it relates to illegal dumping.'",
        "'speaker_8': 'I want to thank my colleagues, Councilwoman Lena Gonzalez, Councilmember de Andrews and Vice Mayor Rex Richardson for sending in to the Senate with me. I also want to thank Craig Beck, Nicole Marconi in and the Public Works Environmental Services Bureau team for their work on this area as well.'",
        "'speaker_8': 'Thank you all to staff.'",
        "'speaker_2': 'Next up is Vice Mayor Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. Councilmember Turanga, I'd say you're spot on. This is one of the largest, most significant reports that come into our office about dumping we got in our district. We've got two freeways that bisect our district and that, you know, makes us a little more susceptible to different items being dumped in the different pockets and'",
        "'speaker_1': 'the different alleyways that sort of end right at the freeway. So the more we can do to work with our neighborhood associations, to have a strategy that really targets these, you know, highly susceptible neighborhoods, I think that's that's the right direction.'",
        "'speaker_1': 'So you have my support for Councilmember, and I look forward to seeing what staff comes back with. Thanks.'",
        "'speaker_7': 'Yes. So, Councilmember Suranga, thank you. Thank you so much. I cannot thank you enough for bringing this forward because I will agree with you that, yes, this is like the number one thorn in our side as a council members.'",
        "'speaker_7': 'It's just really taking care of the little things, which is the illegal dumping. And as you can see, how horrible it could be in all areas of the city. I think that we do need to explore additional options, whether it's education, even looking at technology.'",
        "'speaker_7': 'I know we have go Long Beach, but how can we further support that through technology in getting these items picked up right away? So I look forward to that. And and again, thanks so much for bringing this forward and look forward to hearing more.'",
        "'speaker_2': 'Councilmember Pearce.'",
        "'speaker_5': 'Thank you. I do want to thank my colleagues for bringing this forward. Illegal dumping is a really big issue in my district. My team is out there every weekend and every single neighborhood cleanup. Our dedicated volunteers that there's always new stuff in the alleys.'",
        "'speaker_5': 'Last week alone in seven days, we had 31 cases of illegal dumping reported just directly to my field deputy. And so I think it's important that we're starting the conversation tonight. I know that Los Angeles also had a big challenge with illegal dumping and great good over there that works for Garcetti.'",
        "'speaker_5': 'I talked to me months ago about some of the work that they had done with changing the way that all their city staff addresses illegal dumping. And so I hope that in looking at a best practice, we are also looking at other cities and what has made the most sense and how they've done some of their work'",
        "'speaker_5': '. So, again, thank you, everybody, for bringing this forward.'",
        "'speaker_1': 'Councilman Super. Now, thank you, Councilmember, for bringing it forward. And you know, it's a serious problem when Councilmember Durango wants to do a study. I would say, generally speaking, he does not like studies. So I think this reflects about how big an issue it is in reading over some of the materials and how these are just ideas'",
        "'speaker_1': ', bullet points. But one of them I wanted to speak to is hiring of a waste enforcement officer or something like that. I want to take this moment to give a shout out to Frank Ramirez. I think he's one of the most meritless employees we have in the city.'",
        "'speaker_1': 'What strikes me is his institutional knowledge. Anytime I have an issue, I swear he knows the history of it, no matter where it is. And that's just my district. I can't imagine all the little nuances he knows about the entire district.'",
        "'speaker_1': 'So what I would like to recommend moving forward, if we can find a way to have Frank hold this position or somehow encourage him to hang hanging around a while because I think he could add so much value to this whole piece.'",
        "'speaker_1': 'So I'll get off my soapbox. But thank you.'",
        "'speaker_7': 'Yes. I forgot to request. I'd like to add a friendly amendment if we can have its states 120 days, I believe, for it to come back to council. Can we make sure it comes back to this body versus the two from four?'",
        "'speaker_7': 'That would be my friendly amendment. Would you accept? Thank you.'",
        "'speaker_2': 'Councilman.'",
        "'speaker_6': 'I would also like to add a friendly I would like to start off on.'",
        "'speaker_5': 'A positive note. I want to thank my colleagues for bringing this forward.'",
        "'speaker_6': 'I also want to.'",
        "'speaker_5': 'Thank the member of the city council who.'",
        "'speaker_6': 'I've actually seen pick.'",
        "'speaker_5': 'Up dumped items in his.'",
        "'speaker_6': 'Own vehicle. Councilmember member supercar just driving through the community, literally picking up vehicles and putting them in his trunk.'",
        "'speaker_5': 'And taking them away. He's a good member of the community. We're happy to have him as.'",
        "'speaker_6': 'Both a trash pickup and a council.'",
        "'speaker_5': 'Member.'",
        "'speaker_6': 'And now onto a more serious note. The Long Beach app needs to be fixed. It is unacceptable. Our IT department needs to get it together. I have been complaining about this app since I was elected three months ago.'",
        "'speaker_6': 'It's inaccurate the.'",
        "'speaker_5': 'Information. We are constantly putting.'",
        "'speaker_6': 'Community members to work for us to gather the.'",
        "'speaker_5': 'Data and the.'",
        "'speaker_6': 'Behind the scenes of it all and the guts of it all is broken. The we have too many vacancies. We have other priorities. All of those things are all it's been too long and we need it fixed. And so I would like the go along each component and the community engagement component of illegal dumping and pick up'",
        "'speaker_6': 'to be a part of the report back to this council with a serious deadline with ramifications and implications to staff members.'",
        "'speaker_5': 'Who don't follow through and meet deadlines related to this app and the dumping.'",
        "'speaker_6': 'Because we have such an amazing resource of community members who care so much. I have reported in the fourth District.'",
        "'speaker_5': 'Many dumping off of Cherry on that app and it's.'",
        "'speaker_6': 'Terrible. They're picked up. They're not picked up. They say they have been picked up. You go by, they haven't been picked up.'",
        "'speaker_5': 'And so having used.'",
        "'speaker_6': 'The app on multiple things, I don't actually think it's public works fault at all. I think the app, I literally am willing to set aside money in the budget this year if that is.'",
        "'speaker_5': 'Necessary to have some.'",
        "'speaker_6': 'College kids design an app that would be more effective. And obviously our city staff wouldn't have to build it and I'm sure that it would meet whatever measure requirements because these college kids can data and donuts over breakfast and do something which would be more remarkable than what we have today.'",
        "'speaker_6': 'And it's just been too long and I'm so sorry to be negative.'",
        "'speaker_5': 'But the time has come.'",
        "'speaker_2': 'Thank you. Councilman Mengers phoned me up, so I'm going to comment. I was going to not say anything because I haven't seen most of the things. I think the staff and I just I just publicly say a few things.'",
        "'speaker_2': 'The first is I want to thank everyone that brought this up. I want to start just by saying that, you know, obviously, sometimes you forget the amount of work that happens. And so a lot of folks don't know.'",
        "'speaker_2': 'I think our public works team, they probably pick up close to 50 or 60, 60 mattresses a day. Is it a day or is it a week?'",
        "'speaker_6': 'A day?'",
        "'speaker_2': 'A day. Okay. 50 to 60 mattresses a day, which is unbelievable to think that that's happening. But that's what's happening. So and so is our our our, our, our, our folks doing an incredible job working with the resources.'",
        "'speaker_2': 'And they're absolutely doing great. And so you guys are out there, they're picking stuff up, we're calling things, and I'm incredibly grateful. But it's also clear to me that we do not have enough resources when it comes to cleaning the city.'",
        "'speaker_2': 'I've already mentioned this to you and Mr. West in this year's budget. I want to see how we actually begin to take care of this issue, which it's not acceptable to have litter and trash and waste in people's alleys and in the neighborhood.'",
        "'speaker_2': 'It's just it's not okay. And we must do a better job at at this. I think as a community and as a city, I've always I've been saying to staff, we have to sweat the small stuff. And the small stuff are the basics of just keeping the city clean and neighborhoods clean for the community.'",
        "'speaker_2': 'And so I expect that the amazing job that we're already doing because it's it's damn good Craig and you and your team are picking up tons of waste every single day. These guys need more resources to go out there and and do more.'",
        "'speaker_2': 'And if, if, if we need to double the effort that's currently in place and we got to double and figure out how we how we get there. But we've got to do more than what we're doing now. I'll just add to the Columbia conversation, and you've obviously been sending some messages about that.'",
        "'speaker_2': 'When the when the app first launched in its first two or three years, it was working so well. And I'm not sure what happened over the last particularly two years or so, but the particularly on the reporting of dumped items and other issues, it's not working.'",
        "'speaker_2': 'It's broken on the back end. And and we're providing and confusing residents by the messages that we're sending. And so I'll just uplift a lot of what Councilwoman Mongo said. She's absolutely correct. All this needs to get fixed immediately and we need to put more resources into this area because we're working hard, but we need to do'",
        "'speaker_2': 'a lot better. And every one and all the department heads and all the managers in the work force, they need to take ownership of the city in the way it looks. And, you know, be interested to know how many of our own folks are actually reporting stuff outside of the people that are actually picking up the trash'",
        "'speaker_2': ', because I think that that is to me, this is everyone's job. Whether you're the department, head of another department or whether you're manager of another area, everyone should be interested in ensuring the city is as beautiful and a good place to live and work.'",
        "'speaker_2': 'And so that it's, I think, a challenge for our team to figure out in this next budget cycle. Councilman Austin.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And I want to thank the people, my members, from bringing this item forward. Obviously, this is one of serious concern. I want to just just kind of piggy back on some of the latter comments regarding the app.'",
        "'speaker_3': 'I think it works. It has worked pretty well. But I think we also need to be mindful that there is a you know, it's great to be able to push a button and expect a result, but understand that there's human resources behind those buttons that we push.'",
        "'speaker_3': 'I had a conversation with the Public Works director a little earlier, and I was kind of astonished at what some of the challenges that he is dealing with as a department in terms of having the personnel to actually do that work.'",
        "'speaker_3': 'And I think, you know, that that merits some of our attention as well to assist with making sure that we have adequate a number of personnel to actually perform the duties because it is very laborious work. Folks who do that work suffer back injuries and other sorts of repetitive motion injuries.'",
        "'speaker_3': 'They're dealing with heavy loads on a daily basis. We have to be mindful of that as well. And so one week it could be working great because that team is out there and it's fully staffed. And then the next week it may not be working as well because there may be staffing shortfalls and so on.'",
        "'speaker_3': 'I don't want to make excuses. I do concur with the mayor's comments that it's everybody's job and my staff. We have a motto. We don't drive past the graffiti, we don't drive past dumped items. We make sure to report them.'",
        "'speaker_3': 'And I think if everybody had that mindset, not only city staff, but but residents, we'd have a much better city.'",
        "'speaker_2': 'Absolutely. Thank you, Smith RICHARDSON.'",
        "'speaker_1': 'Well, thank, councilwoman. Go for kickin up the comments for a second round. I got a little inspired by your, uh, your comments. So I wanna say first, good job for whoever handles the public works Twitter. I get a lot of Twitter stuff and if we just, you know, tag public works team it's handle 100% of that 100%'",
        "'speaker_2': '. One of the best in the entire city is is the public.'",
        "'speaker_1': 'With the words Twitter. Fantastic. Secondly, you know, because I have two freeways that run through my district, I have 24 on or off ramps in my district. And simply, it is hard to navigate for a resident who wants to clean up an off ramp or complain.'",
        "'speaker_1': 'They come to us, they go to different departments. They hear it's Caltrans. Their process isn't clear. I'm not saying that the city should maintain the on ramps, but if someone takes a picture of it, we should at least make sure that Caltrans gets a copy of whatever, whatever is submitted because they should hear what we're hearing about'",
        "'speaker_1': 'the on and off ramps. So many times we we, you know, direct them to a field deputy or someone with Caltrans. But we should streamline that process because to a resident, they don't know the difference between the right away.'",
        "'speaker_1': 'It's Long Beach to them and it reflects poorly on our city. So but thank you, Councilman Tarango, for bringing this up. I think we're we're going to get something good out of this.'",
        "'speaker_2': 'Thank you, Councilman Mongo.'",
        "'speaker_6': 'I just wanted to clarify and in my passion, I may have spoke a bit quickly, but I specifically did say, like public works is doing a great job. I think the big issue with the app is it will tell you it's picked up and you'll drive by and it's not picked up or it will tell you it's'",
        "'speaker_6': 'not picked up and you'll drive by it and it'll be like, We'll get back to you in a couple of days and it won't be. There was a television in front of someone's house for three weeks and I thought to myself, I am just going to put this on the back of my truck.'",
        "'speaker_6': 'And I thought, Where am I going to put it? I don't want to be in that little dumper dumping it into some other trash bin. So you're in this tough position.'",
        "'speaker_5': 'Of wanting to help but not knowing how.'",
        "'speaker_6': 'To do that. And so I hope that those statistics can come back to us on what is going on with the Long Beach, because I think that it's just too important.'",
        "'speaker_2': 'Thank you, Councilman Tauranga.'",
        "'speaker_8': 'Well, I guess I touched a nerve with this item here. Glad to hear all the suggestions in the comments and it's been an important topic for us in the seventh District. I also have two freeways in the river going through my district.'",
        "'speaker_8': 'So there's it's a big issue in my district and I'm glad to hear. Let me rephrase it. Now now I'm hearing that it's a big issue in yours as well. So, yes, it is another study, but I think it's going to be coming one with some great results.'",
        "'speaker_8': 'Thank you for for supporting this.'",
        "'speaker_2': 'Thank you. And I think it's important to note, of course, I think everyone appreciates the work that's happening already from staff and in management here. So any public comment on this kind of please come forward. Good evening.'",
        "'speaker_1': 'Again. So as I stated before, I work for the landlord AP Atlantic, which is right, 5150 Atlantic Avenue, which is in your district. Councilman Suber Now my initial question is, I didn't see you on this. Are you included in this or is the city entirely included in it?'",
        "'speaker_1': 'Okay. What address did you get? 5150 Atlantic Avenue. It's right next to the city of Long Beach. Which center? Oh, I thought this was your district. I apologize. So my main concern is I. The property. Where do I start?'",
        "'speaker_1': 'North via parcel, which is behind the Wick Center. There is severe dumping behind this, which comes at a great concern because when I walk behind the property, I find needles and bottles full of schizophrenic drugs. And you've got this in relation to dumping with mattresses, homeless people sleeping on the mattresses that are obviously using these drugs and'",
        "'speaker_1': 'needles. The street, to my knowledge, so serves no purpose to the community because it's directly behind the building. There would be no purpose for anyone to either exit or enter that street unless they were doing something that they shouldn't be.'",
        "'speaker_1': 'So my question to you is, should I be if I've been spending hundreds of dollars every month to take care of this junk? And I think cleaning it up, sweeping it up. And I really want to know if I should be filing for a prescriptive easement.'",
        "'speaker_1': 'And that's all I have to say, because, I mean, I'll clean it up. I'll put Gates on the side of it to help prevent the dumping, and I'll take care of it when it's dirty. So. That's it.'",
        "'speaker_2': 'Okay. I am sure. I'm sure that someone will will connect with you. We have already. Mr. West. Mr. Harrison, if you could talk to this gentleman. Yeah, great. Thank you. Thank you. Okay. Thank you very much. To me, the public comment.'",
        "'speaker_2': 'Okay. There's a motion of a second, actually, Councilmember Supernanny.'",
        "'speaker_1': 'Just a quick shout out to Craig Indico. Thank you for all your work. I agree with my colleagues. You guys do a phenomenal job. I just want to mention Frank in particular. So I hope you didn't feel slighted there.'",
        "'speaker_1': 'Also, just a follow up on the Caltrans issue. We met with Caltrans at the quarterly meeting a couple of weeks ago and they talked about the adopt a highway program and I ended up adopting a highway. So that's one other option that we can do, that council officers can get our own volunteers out there once they have'",
        "'speaker_1': 'training from Caltrans or you can hire a crew to do that. Thank you. Thank you.'",
        "'speaker_2': 'Kim. We have a motion on the floor and members, please cast your votes. I'm sure it'll be unanimous.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to request City Manager to study the feasibility of aligning councilmember and other elected officials officeholder accounts to those of state/FPPC regulations.": [
        "'speaker_2': 'Thank you. Okay. We're going on to the next item, please, which is with the 2021.'",
        "'speaker_0': 'Item 21 is a communication from Council Member Pearce Chair, Elections Oversight Committee recommendation to request the city manager to study the feasibility of aligning Council member and other elected officials. Officeholder counts to those of State FEC regulations.'",
        "'speaker_2': 'Council Member Pearce.'",
        "'speaker_5': 'Thank you for this. We had our Elections Oversight Committee meeting a couple of weeks back where we looked at this. Right now, the municipal code sections 2.01.380 and 390 currently prohibit the use of office holder funds as transfers, loans or contributions to any other candidate for elected office.'",
        "'speaker_5': 'I would like to make a motion to request the City Attorney to amend l l BMC Section 2.013.80 and three nine to permit office holder funds to be used and consistent with the provisions of state law. California Government Code Sections 89510 as amended.'",
        "'speaker_5': 'This would include the use of office holder funds to purchase tickets to fundraising events for candidates for elected office. I ask for my colleagues support.'",
        "'speaker_2': 'Thank you, Councilwoman Gonzales. Not any public comment. Senior members, please cash customer support now.'",
        "'speaker_1': 'Yeah, I just I just want to include here that I dissented on this vote. I sit on the election committee. There's a lot of good things about getting old. But I do remember when this, uh, this ordinance changed when a previous council voted this in, and I thought it was a good idea then, and I stand by'",
        "'speaker_1': 'it. I don't. I can't understand why if someone contributes to my campaign, why I'm going to turn around and give that money to someone else, to that person who donated to me, did not endorse. So that is the basic premise.'",
        "'speaker_1': 'I realize tonight we're just looking for a study. We're not looking for that absolute decision. But that was the rationale behind my my dissent before. Thank you.'",
        "'speaker_2': 'Thank you. Just to clarify, I actually think the council was actually asking for a change in the municipal code.'",
        "'speaker_1': 'That's correct. The way I understand the motion this evening, it is a request to prepare an amendment to the ordinance which would make those changes and not a study in that this would come back to the council for a first and a second.'",
        "'speaker_2': 'Reading at that.'",
        "'speaker_4': 'Time.'",
        "'speaker_1': 'Okay. Thanks for that clarification.'",
        "'speaker_2': 'Okay. There's a motion and a second. Please cast your votes.'"
    ]
}