{
    "Recommendation to declare ordinance amending and restating Long Beach Municipal Code Chapter 21.54, related to billboards, read and adopted as read.  (Citywide)": [
        "'speaker_4': 'Item one report from Development Services Recommendation to receive supporting documentation into the record, conclude the public hearing and declare the ordinance. Amending the Zoning Regulation of Long Beach Municipal Code Title 21 Relating to the regulation of billboards. Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_3': 'Southwest. Mayor are members of city council making stout presentation will be Amy Bullock, Director of Development Services Department.'",
        "'speaker_4': 'Mr. Mayor, members of the City Council, we are here today to have a first reading of the billboard ordinance based on direction that you provided to staff back in January. Specifically, we made modifications to the language to allow development agreements to be utilized in the event that copies cannot be utilized.'",
        "'speaker_4': 'And that we also made changes to the regulations requiring private room prior or removal of billboards that are to be demolished before a building permit can be issued for construction of a new billboard. We have made additional minor amendments to the language to reflect suggestions that have been provided to us by billboard companies related to the Outdoor'",
        "'speaker_4': 'Advertising Act when they preempt the city. We've also made some clarifications on how we would measure light and glare studies and the technical specifications related to that. We have provided consistency now that previously did not exist in distances that billboards can be allowed, electronic billboards can be allowed from residential districts or institutional and park districts.'",
        "'speaker_4': 'And we've provided some other clean up language that you have in your red line version. The sum result of this is, I believe that we have struck a balance and have two different processes that various companies can use, depending on whether they have a lot of inventory or no inventory in the city in order to achieve the'",
        "'speaker_4': 'goals of electronic billboards in specified locations, and then clearly the removal of billboards in the neighborhoods where they may not be as appropriate. So with that, I'm going to wait to answer any questions that really does conclude my staff report, and we're available to answer any technical questions you may have.'",
        "'speaker_5': 'Mr. Mayor, do you like a motion.'",
        "'speaker_3': 'As always, in order.'",
        "'speaker_5': 'Moved to accept the staff recommendation?'",
        "'speaker_3': 'I believe there's three. Mr. Page, want to help me here? Three separate votes.'",
        "'speaker_0': 'Excuse me. Yes, Mayor Foster, members of the City Council. There is a ordinance and two resolutions.'",
        "'speaker_5': 'Can one motion cover all three?'",
        "'speaker_0': 'No, we need three. So the appropriate thing is just to take the motion to adopt the ordinance first.'",
        "'speaker_3': 'Correct.'",
        "'speaker_5': 'Okay. So moved.'",
        "'speaker_3': 'Moving, seconded. All right. Any questions from council members on this? Any public comment? Janeane members cast your votes on the ordinance.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Adopt resolution directing the Director of Development Services to submit the ordinance amendments to the California Coastal Commission for a finding of conformance with the Certified Local Coastal Program;   Accept the Categorical Exemption CE-13-118; and": [
        "'speaker_3': 'Thank you. Go to the first resolution. So moved that moved and seconded a any comments or questions from council members? Any public comment saying none members cast your votes on the second resolution.'",
        "'speaker_4': 'There's a comment.'",
        "'speaker_3': 'Oh, I'm sorry. I did not see that. Please come forward. Identify yourself.'",
        "'speaker_5': 'I need to. Goodman I work for a company called Bulletin Displays, located at 3127 South Street in Long Beach. Honorable mayor and Council Members and staff. I sent this letter to each of you today and I'd like to go ahead and read it, please.'",
        "'speaker_5': 'As one of the only two local billboard companies located in Long Beach, California. We are writing to you in opposition of this ordinance. Bulletin displays is located at 3127 East South Street, Long Beach, California. As a local billboard company, we have not proliferated the surface streets, residential or commercial with our billboards at the detriment of the city'",
        "'speaker_5': '. Over many rewrites, this ordinance continues to favor those companies who have overbuilt within the city or who have challenged this ordinance. The ordinance does achieve most of your objectives, the most important being the takedown of billboards on surface streets located in residential areas, mixed use areas and planned development areas.'",
        "'speaker_5': 'But the Council has also given good direction to staff through many hearings to create a level playing field that allows companies who haven't proliferated the surface streets with billboards or have taken down all their legal non-conforming billboards to write a development agreement.'",
        "'speaker_5': 'This allows the city to generate additional revenue based on the criteria in the ordinance. These two options. Diaz Being development agreements and leasing city property create competition among the billboard companies and the city is the benefactor from increased revenues.'",
        "'speaker_5': 'I have met numerous times with Amy Boda and staff when I was working with CBS Outdoor and now bulletin displays. Over the years, the industry has worked openly with staff to help craft an ordinance that is both fair and workable for the city of Long Beach and the billboard industry.'",
        "'speaker_5': 'After my most recent meeting with staff on February 13th, 2014 to discuss the section on development agreements and the definition of infeasible staff has returned with a more restrictive ordinance. The information that we discussed and the concerns that we raised were turned around and used against us.'",
        "'speaker_5': 'The intention of the development agreement and the language that defines and feasible could be achieved by bulletin displays. One staff had this information. They used it to add a section in the ordinance that mandated a trade ratio takedown.'",
        "'speaker_5': 'Based on our circumstances, bulletin displays met the word infeasible, met the definition of infeasible aspect of the ordinance. Now only to find another hurdle that doesn't make sense. In the staff report paragraph cited below, staff states they believe these new provisions reflect the direction and desire of the City Council in specifically addressing freeway oriented signs.'",
        "'speaker_5': 'I again assert that this paragraph below was added to the report and to the Development Agreement section based on staff's meeting with bulletin displays and staff's realization that bulletin displays may have an opportunity to build new.'",
        "'speaker_3': 'Billboards, which Patterson have to ask you to conclude.'",
        "'speaker_5': 'In conclusion, as Amy stated, the development agreement was added to the ordinance to allow for a competitive billboard situation within the city. Then what staff does is they go ahead and they add a 1 to 1 ratio of takedowns for development agreements based upon the word infeasible.'",
        "'speaker_5': 'I mean, I'm sure you understand where.'",
        "'speaker_3': 'You're out here well over the 3 minutes now. So I'm sorry then. Really, nothing I can do. All right. We will enforce that with everybody. Sorry.'",
        "'speaker_5': 'All right. All right. Thank you very much.'",
        "'speaker_3': 'Any questions? Okay. Is this on the resolution to direct the direct directing to development? The Director of Development Services. Members, cast your vote. Motion carries okay and final resolution is on the M.P. in charge of schedule. Our our entertaining motion.'"
    ],
    "Recommendation to request City Manager to provide to the City Council a status report on the implementation of the Rapid Medic Deployment staffing model, report on the current status of the Fire Department's FY 14 budget, and consider providing further direction to the City Manager regarding the implementation of the RMD model, including whether to delay implementation until a full discussion can be had as part of the FY 15 budget process.": [
        "'speaker_4': 'Item 12 Communication from Councilman Al Austin, Councilwoman Geri Ship City Councilmember Steve Neal. Recommendation to request the City Manager to provide to the City Council a status report on the implementation of the Rapid Medic Deployment Staffing Model Report on the current status of the Fire Department Fiscal Year 14 budget and consider providing further direction to the City'",
        "'speaker_4': 'Manager regarding the implementation of the R&D model, including whether to delay the implementation until a full discussion can be had as part of fiscal year 15 budget process.'",
        "'speaker_3': 'Mr. AUSTIN.'",
        "'speaker_0': 'I'd like to turn it over to to staff to follow up on this simply back to us. Thank you, Mayor. Council members, as you know, we've been discussing the R&D model for a couple of years now. It was included in the fiscal year 14 budget and we have provided the Council with updates on the status of implementation'",
        "'speaker_0': 'on several occasions as requested. I'm going to have our Finance Director, John GROSS discuss the financial impacts on the fire department's budget. Then I will have Fire Chief Mike Terry discuss the public benefits of the R&D program. First, however, I want to show a slide that depicts the state of the industry in California regarding the staffing model'",
        "'speaker_0': '. The Blue depicts the OEM's local agencies granting alternatives to two paramedics per ambulance mandate. There's basically 33 local EMS agencies in California. 29 have allowed this. There's four left that haven't. As you can see, the L.A. County and Orange County are significant in that picture where they've not allowed that at this time.'",
        "'speaker_0': 'I do want to note that the city of Los Angeles has recently commissioned a fire services study that indeed recommends that the City of Los Angeles Fire Department look at their staffing model. So with that, I'm going to turn it over to John GROSS for the finance.'",
        "'speaker_0': 'And thank you. Manager West. I'm going to start first with a little background on the current fiscal year for R&D fiscal year 14 Art. The R&D program is in the FY14 budget, but its start was delayed. We don't anticipate it to start until some time in July, but nonetheless I anticipate that the fire department will be within'",
        "'speaker_0': 'budget in fiscal year 14. Regardless of that delay, the fire department is able to be within the budget because the fire department used a little over $500,000 in one time funds originally intended for a start up for Engine eight and Rescue 12, which did not happen.'",
        "'speaker_0': 'And it's also able to be within budget because the fire department had one time salary savings due to attrition, a substantial amount of which will not reoccur in FY 15 the next fiscal year. And I'm going to switch to next fiscal year, the fiscal year that is going to be considered by city council in the next few'",
        "'speaker_0': 'months. That proposed fiscal year 15 budget will include the RMD program. One reason for that is that the city managers has a stated goal that the 515 budget will retain retained city services if the IMT program is eliminated for FY 15.'",
        "'speaker_0': 'Ambulance service costs would increase of necessity. There would then be need to be a reduction in other fire services to keep the fire department budget balanced. The R&D program costs about 1.4, saves about $1.4 million annually less, and it costs less than our current ambulance service by that same amount.'",
        "'speaker_0': 'If the city eliminated the RMD program in FY 15. The city would need to reduce the 515 fire department budget in other areas by that $1.4 million. Well, it isn't known what the fire chief would choose to cut in his budget if the department were directed to eliminate the R&D program.'",
        "'speaker_0': 'The size of the required cut amounts to about 70% of the operating cost of a fire engine. And that concludes the finance report. Turn it over to the fire chief. Mr. Mayor. Council members. So the question is, why are we going why are we doing RMD?'",
        "'speaker_0': 'And as you can see on the map, this is a system of deployment that is widely used throughout the state of California. There are 33 local EMS agencies in the state. Of the 33, 29 of them already authorize and have functioning systems in place that are similar to what we have proposed in an industry where seconds count'",
        "'speaker_0': '. This program will place a paramedic on the scene. One point. 5 minutes faster. On average, citywide emergency medical service in Long Beach accounts for nearly 84% of the overall workload of the Long Beach Fire Department. Currently, we have 17 fire engines and only nine of those engines have a paramedic on board.'",
        "'speaker_0': 'This program converts out of all of our existing 24 hour ambulances to ALS or advanced life support ambulances, adding resources to Station three, Station 12 and Station 22. Municipalities that currently operate this program are not limited to just rural areas.'",
        "'speaker_0': 'They include large metropolitan cities such as San Francisco, Sacramento and San Diego, as well as many medium sized cities in the state with populations over 100,000 people. As the Director of Finance just said, implementation of this program does also provide for budget savings.'",
        "'speaker_0': 'As he has clearly pointed out, that I stand ready to answer any questions. Thank you, Chief Terry and Mr. GROSS. In conclusion, as you can see, the staffing model puts paramedics on the scene faster than the model that we use today.'",
        "'speaker_0': 'It is also going to save money, which allows us to maintain the fire department's services that will be impacted if there is a decision to not go forward with the staffing model. That said, you heard from Mr. GROSS that the fiscal year 14 fire department budget should come in on target because of the one time dollars in'",
        "'speaker_0': 'attrition. You also heard from Mr. GROSS that R&D is included in the fiscal year 15 proposed budget, and that because the R&D program costs less than our current ambulance program, it allows the city to provide more fire services than would otherwise be possible.'",
        "'speaker_0': 'So tonight, the Council can choose to continue to move forward with the implementation of the R&D staffing model this summer, or because the fire department budget is expected to come in on target if and for fiscal year 14.'",
        "'speaker_0': 'If we hold off on implementation until October 1st and there is a decision to eliminate the R&D program in the fiscal year 15 budget. We will have to identify $1.4 million in other fire service reductions to keep the fire department budget balanced.'",
        "'speaker_0': 'So thank you very much. We stand ready to answer questions.'",
        "'speaker_3': 'Mr. AUSTIN.'",
        "'speaker_0': 'Thank you very much for the report, and I'd like to thank my colleagues for joining me on this item. Council Member Leo and Shirkey, we talked about the you talked about the the need to cut from the FBI, the fire budget, should the R&D program not be implemented.'",
        "'speaker_0': 'We did just have a fire academy class and we graduated 20 to 28 firefighters. Is that correct? Yes, sir. Okay. How many vacancies were budgeted? Firefighters positions do we currently have? We believe right now we have about nine vacancies.'",
        "'speaker_0': 'Okay. And as I understand it, if implemented, the the R&D model will result in seven fewer firefighters on duty at any given time or 20 working fewer firefighter positions. Is that correct? Yes, sir. So. If implemented, how will the elimination of those positions be handled?'",
        "'speaker_0': 'Councilmember those positions when this when the R&D was put into our budget in 2013. That budget. Our budget today is reflective of what was done in 2013. So if this program were put in place today, it would not result in a physical elimination of any people that are currently employed by Long Beach Fire.'",
        "'speaker_0': 'So if we actually did that R&D, we probably would. Need a fire academy. Is that correct? Councilmember No, that's not correct either. We were doing some numbers earlier today. We anticipate through regular attrition and sending people to paramedic school and regular promotions that we anticipate in the next few months.'",
        "'speaker_0': 'We would still need to have a fire academy going forward. We do expect up to 20 to 30 vacancies will exist probably by the end of this calendar year. Okay. Moving on, what was the approval given by the L.A. County Emergency Medical Services Commission?'",
        "'speaker_0': 'Was it for a full implementation of the R&D model or for a one year pilot study? The Councilmember The entire discussion with the local EMS agency has been about engaging in a pilot program. And at the end of the pilot program, the agency would make a determination as to whether or not it should be considered as policy'",
        "'speaker_0': 'within the county. So a pilot program. Was there a term specific to a pilot program? We we have two specific terms have been considered a one year term and a two year term. When they finished the discussion with the IMC agency last month, it was a two year term.'",
        "'speaker_0': 'Okay. There. In the criteria, was there any additional criteria that you would be looking to evaluate on how the program was working? Councilmember No, there was no additional stipulations or criteria that the agency gave to us at the last meeting.'",
        "'speaker_0': 'It was all the criteria that had been vetted throughout the process over the last couple of years. Nothing new. Okay. Is there going to be additional training required to implement this? Yes, sir. As part of the program, we are required to offer training to our existing firefighters and paramedics in order to launch the program.'",
        "'speaker_0': 'And have you done a cost analysis to see what that would be cost us? We don't believe there's additional costs. It's part of a regular it would be absorbed as part of our regular continuing education recession training that we currently do today.'",
        "'speaker_0': 'And as you know, currently today, when it when we said to implement the new model, the councilmember the letter that we sent to the EMC Agency suggests that an implementation start date of July 10th, 2014. So that would be full implementation throughout the city of Long Beach.'",
        "'speaker_0': 'Yes, sir. Okay. And if R&D is fully implemented, will all fire engines and trucks have a firefighter and paramedic on board? Or will there be some engines and trucks that will not have a paramedic assigned to them? Specific to that question, Councilman Randy Clarke, clarification.'",
        "'speaker_0': 'All fire, all fire engines and trucks will have firefighters on board under R&D. Every engine company in the city would have a firefighter, paramedic, as well as one truck company, and the city would have a firefighter paramedic. So there will be no no variation in any way that the variation would be in the other three truck companies'",
        "'speaker_0': 'in the city would not have a firefighter paramedic on board. Q Does it make a difference from implementing from an implementation perspective whether armed was implemented in July or at the beginning of the 515 fiscal year in October from.'",
        "'speaker_0': 'No. Okay. And then given that we've heard that the fire department is currently within the FAA budget, 14 budget, and is expected to meet their budget under the current configuration at the FAA, that the R&D model was proposed to the City Council in 2012 as a budget savings measure.'",
        "'speaker_0': 'I believe that it's more responsible to have a discussion of the R&D budget savings as part of a more comprehensive discussion of our budget priorities for the fire department and the overall general fund. Therefore, I'm making a motion that we direct the city manager to delay the implementation of the R&D program until fiscal year 2014 and presented'",
        "'speaker_0': 'as part of the overall budget discussion and approval by the City Council. Thank you, Mr. Neal. Thank you, Mr. Mayor. I had a couple of questions, Mr. Chief, in regards to the implementation of the R&D, it's going to require numerous changes to the existing policy and procedures.'",
        "'speaker_0': 'Is it your intent to meet and confer on the policy changes prior to implementing? Council Member We believe that, yes, and anything that would require a meeting confer, we will engage in good faith with the Firefighters Association to do that.'",
        "'speaker_0': 'Okay. Thank you. And with the current R&D budget shortfall or if there is no shortfall for your budget this year? Correct. Councilmember Fire Department is, we're estimating to close our budget on on target for fiscal year 14. Okay.'",
        "'speaker_0': 'And with that. Should your pilot project fail? What are the plans to revert back to the existing system? Council Member That becomes a very similar to the regular annual budget discussion. If the pilot program were to fail and we needed to realize $1.4 million or more in savings, we would engage that number in the same way we'",
        "'speaker_0': 'have done in previous deficit years and determine, based on data, what would be the best place to look across the organization to to create that efficiency. So it could result in a reduction in number of apparatus, some place or number of personnel assigned to apparatus in some place.'",
        "'speaker_0': 'And in regards to monitoring the success or failure of this program. What are the plans of doing that and reporting back to this body? The Councilmember. I don't know that we've had any specific plans to report back to the Council specific to the success of the of the program.'",
        "'speaker_0': 'But we are required by the County EMS Agency to provide them with biweekly data that they will monitor for quality assurance and quality improvement purposes and make recommendations on the program as it moves forward and to rework. Why was the date of July 10th selected to for the initial start date?'",
        "'speaker_0': 'It at the time the EMS Commission gave us the green light to move forward. IT We needed to set a date far enough out to facilitate the training required to get the organization up to speed. We did not want to implement something right at or before the 4th of July holiday, knowing that that's a busy time for'",
        "'speaker_0': 'us. So the next logical date was that week after. So it gave us enough time to get the training facilitated. Thank you too. Sure.'",
        "'speaker_3': 'Any further questions? We have a motion in the second on now call for public comment. And remember, the public was just a council on this item who's come forward to identify yourself when you see the light, there's 20, 30 seconds remaining.'",
        "'speaker_4': 'Thank you. My name is John Makowsky and I have been a resident of Long Beach, homeowner of Long Beach for since 1971. We've been talking budgets and numbers. The human element. Two years ago, on Father's Day, 6:00 in the morning, my husband began experiencing difficulties.'",
        "'speaker_4': 'He tried to get up and fell out of bed and went to try to pick him up. And he was perspiring profusely. I knew something was wrong and I called the paramedics. They were there in just a very short amount of time.'",
        "'speaker_4': 'They did some tests and took him to the hospital. I followed in my car and by the time I got there, he was already in surgery. So I did not get to see him or the surgeon until after the surgery was finished.'",
        "'speaker_4': 'When the surgeon came out, after he told me to stop crying, he said my husband was fine. He was going to be okay. And he pointed his finger. I mean, he said, you did the right thing. Minutes mattered.'",
        "'speaker_4': 'He had no damage. He had had a heart attack. He's doing wonderfully today. As I said, we've been residents, homeowners since 1971. That was our first experience with calling 911. And I can't tell you how much it meant to us to have such a talented team.'",
        "'speaker_4': 'I'm I'm wearing their t shirt. I am not an employee of the fire department. I'm one of their biggest fans. And I appreciate the work that they do on a daily basis. And that was our first encounter. I hope we never have to go through that again.'",
        "'speaker_4': 'I expected that when we retired we would move someplace where there was a lake and big trees. After that experience, we've had to rethink and there is no way I want to live anyplace else but in a city that provides such great emergency services.'",
        "'speaker_4': 'In addition to all the other services provided citizens of Long Beach, I urge you, do the right thing. Don't make these cuts. Don't make these changes to the fire program and the paramedic program. And thank you to all of you.'",
        "'speaker_3': 'Thank you. Next, please.'",
        "'speaker_0': 'Rex Pritchard, president of Long Beach Firefighters. Just a couple of comments with regards to the map that was displayed at the beginning of the meeting. Within the state, to my knowledge, I don't know of a single fire department that deploys a model with a sworn and non sworn on the same ambulance.'",
        "'speaker_0': 'The map you're referring to is showing what private industry does. Private ambulance companies do it tonight in relation to fire department, fire based EMS. So that's a large distinction. Secondarily. This was a solution to a budget deficit we had two years ago that we no longer have today.'",
        "'speaker_0': 'And the need to bring forward when we're on budget this year and cut sworn firefighters at a time when we don't have that need anymore. I hope we take hesitation in that. Secondarily, we have a lot of educators on the council, and sometimes it's hard to understand in the realm of the fire service and what we do'",
        "'speaker_0': ', but in essence, what you are proposing, bringing forward. Bringing forward is replacing. And I'm going to use a correlation to teach and I used to be a school teacher is you're replacing teachers with substitute teachers. And in essence, that threat is occurring here.'",
        "'speaker_0': 'We're replacing sworn firefighters with non sworn, single functioning EMT and all this firefighter who can operate on fires, water rescues, structure fires, car extrication and replacing them with a non sworn single function, not all risk employee. And that's not efficient.'",
        "'speaker_0': 'And it is. But the biggest thing I think to take away and again going to that map in relation if you were to take that map and plug in. Fire department, EMS systems operate like this. You will see the reverse.'",
        "'speaker_0': 'I don't know of a single one in the state who operate with sworn in on sworn on an ambulance. Oh, and lastly, just please remember, we have 13 ambulances in the city transporting every single patient to the hospital.'",
        "'speaker_0': 'Please don't forget we're going from 13 ambulances to 11 call volumes. Keep going. We are going to have fewer ambulances. And I promise you, 11 ambulances in the city are not sufficient to get all our patients to the hospital.'",
        "'speaker_0': '13 We run two ambulances on a regular basis. We go to. 11. I promise you, this issue is going to come back to you quickly because we're not going to have enough ambulances. Again, this was a creative solution to a budget deficit we had two years ago that we no longer have the day.'",
        "'speaker_0': 'And I encourage you to allow the next just be a discussion and a 515 budget. Thank you. Hi. I'm Tartakovsky. I live on Green Metal Road. I'm in the fifth district. You heard my wife talk about how important it was when I had my heart attack to get me to the hospital.'",
        "'speaker_0': 'Quickly, I heard the chief say that we'll be getting there more quickly, but it's not a matter of fact. Not only getting there quickly and getting me to the hospital quickly, but it was the amount of service that I received in my home that I think really made the difference.'",
        "'speaker_0': 'It's like sending a firefighter to a fire quickly, then handing him a little garden hose to put out the fire. It takes a team. It takes more than one just paramedic at times to do the job. I'm not saying all emergencies are definitely the same, but in my case I needed both.'",
        "'speaker_0': 'I remember the few times when I was coherent. They were both working. It wasn't a matter of when, but standing there taking notes and the other one working. I would also ask that if you've ever had emergency, which would you rather have the model you have now where you have two paramedics doing your service?'",
        "'speaker_0': 'Or would you rather have one of your loved ones only have one paramedic I also get a little irritated when I hear budget constraints or budgets instead of talking the human element out of the equation. You know, I hate to say that I'm going to the Long Beach Municipal Band concert, but in order to do that, if'",
        "'speaker_0': 'three people had to suffer because the budget constraints I enjoyed the concerts in the park, but I'd really hate to think that that came at the cost of firefighters. They provide the safety, the police department. I'd hate to think that we're sacrificing the safety and the health of the community strictly for the budget.'",
        "'speaker_0': 'And just because Johnny up the street has gone to this R&D type of model doesn't mean we should. Anyway, I I'm starting to ramble now. I'm not used to this, so thank you very much. Thank you. Keep it the way it is.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_4': 'Hi, everybody. My name's Deidre Girardi. I live in the fourth district on San Vicente Avenue, and I'm the mother of a three year old, and he has a severe seizure disorder of genetic origin that causes him to have life threatening seizures.'",
        "'speaker_4': 'I just want to give you a small sample of the number of times we have called 911 at our house. That's what this small pile is. And it's not even all of them are a hallmark of my son's seizures.'",
        "'speaker_4': 'His may seem like a typical cute little three year old when you see him, but once a seizure hits, he oftentimes goes into respiratory failure. And what I have witnessed with the amazing paramedic services we have here in Long Beach is oftentimes three paramedics in the back working on my son as it travels to the hospital, somebody'",
        "'speaker_4': 'trying to get an IV line on him, somebody trying to draw meds and somebody bagging him so that he can continue to breathe until we get to the hospital. I have been nothing short of grateful for the response and respect I have received from the fire department, and I have often times called 911 for my son once'",
        "'speaker_4': 'a week, twice a week. We've gone through some pretty traumatic periods of time and I am really nervous about the lack of discussion about the human element here, that lives are a big part, saving lives are a big part of what the fire department does here in Long Beach.'",
        "'speaker_4': 'And I really hope that you consider the collaborative effort of more than one paramedic, the working on an infant or a three year old, or your husband or your wife or your sister while a trauma is happening, it's not something I ever thought I would experience in my life.'",
        "'speaker_4': 'But, you know, here I am trying to describe to you the the scene I've seen many times. And I would just like to thank the fire department because I honestly owe my child's continual life and that he continues to thrive because the paramedics are staff the way they are right now.'",
        "'speaker_4': 'Sir, thank you very much.'",
        "'speaker_3': 'Thank you. Anyone else who wishes to speak.'",
        "'speaker_0': 'James Farley, vice president, long firefighters. I empathize with the position that you guys have been in over the last few years. You guys were served a difficult time, a time when the budget wasn't coming up to par and you were the fire chief to come up with a solution.'",
        "'speaker_0': 'And he did what he could to come up with a solution. Let's look back two years. When we stood in the first DHS meeting, the deputy chief got up in front of the DHS group and said, Listen, this is why we have to implement this, because we've cut fire engines, because we've cut trucks, because we've cut rescues'",
        "'speaker_0': ', and it's still not enough. We have nowhere else to look. That's almost a quote. So it's a budget issue. And so that's where this sprung from. And it's not about times. If it was about times, if it was about a minute and a half, then we would just take a paramedic and put them on every corner and'",
        "'speaker_0': 'they would walk in and they'd be there, but they'd be without equipment, they'd be without their partner, they'd be without the ability to call the base station and talk to the doctors there. So it's not just about times.'",
        "'speaker_0': 'It's about arriving at it in a fashion where you have a team that's capable of performing standing behind me. These are the men and women of the firefighters. There's hundreds, if not thousands of years of experience right there.'",
        "'speaker_0': 'I hope that that impresses upon you that you've asked them on a daily basis to go out and put their badge on and quietly and honorably, go out and serve the public and take care of their safety and their medical conditions.'",
        "'speaker_0': 'And they do this day in and day out. And the reason that they're staying there right now is they want you guys to maintain the tours and they need to serve the public to serve the citizens of Long Beach.'",
        "'speaker_0': 'They're not here asking for a pay raise. They're not here asking for a pension. They're here because they want the tools to go out and do their duties. It's not worth $1.4 million to cut them when this was voted.'",
        "'speaker_0': 'There was no way that any of you could have known what it would even look like. And I doubt that everyone knows exactly what it would look like today because the first six policy didn't even exist back then.'",
        "'speaker_0': 'Had the healthy discussion in October. That's what's right. You guys need to vet this thoroughly because it's a huge change. Thank you.'",
        "'speaker_3': 'Next was.'",
        "'speaker_0': 'Very good. You could the address and we'll revisit the issue and it goes to the. I want to make sure that all of the fire operations, fire departments, operations that are on the tidelands area are being 100% funded from Tidelands.'",
        "'speaker_0': 'And if there's a shortage there, I want to make sure again that we stop the urination of money that early reference to like wasting it on that bike path racing at our front the word for the for the convention center and wasting it for so many things like the $300,000 that the vice mayor wanted to give to'",
        "'speaker_0': 'a few select residents. There's ample money in this city. If we have competent management. Our problem is we don't have the competent management on the 13th floor of this city council. This city. Thank you.'",
        "'speaker_3': 'Thank you. We'll. We'll take it behind the rail. Oh, up there, please. To state your name.'",
        "'speaker_7': 'I'll address is on file. I would be one that would echo what's been said already. I've had to use the tremendous abilities of the Long Beach Fire Department to come to my aid several times, and I cannot see any way that any cutbacks should be made.'",
        "'speaker_7': 'If there are budget issues that have to be dealt with much dealt with, let's deal with them somewhere other than cutting certain fire services.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilmember Lowenthal.'",
        "'speaker_4': 'Thank you, Mr. Mayor. If I could ask the fire chief, I had a question about something that Mr. Pritchard mentioned in reference to the map that was up on the screen. He indicated that those were reflective of only the private ambulance services versus the public.'",
        "'speaker_4': 'And if Chief Drury could clarify that for me that appreciate it.'",
        "'speaker_0': 'Councilmember, the map that you saw up on the screen is a map that we got from the state of California EMS Agency. It breaks down by geographic district, the local EMS agencies, of which there are 33. In each one of those EMS agencies.'",
        "'speaker_0': 'The staffing is left up to the local municipality to determine based based on policy from the local EMS agency on how they want to do it. So it's a it's a mishmash. And depending on which municipality you go to, some have private providers, some have public private partnerships, some are fire based.'",
        "'speaker_0': 'What that map is meant to show you is that those local EMS agencies authorize a staffing model that is different than what is authorized in Los Angeles County. But how they do it locally is left up to the individual municipality.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Councilmember Chayefsky.'",
        "'speaker_4': 'No, actually that was the question, because I had asked Mr. West earlier, because that was my research that indicated that many of those that are pictured on that map, that there are no cities who have their own fire department that utilize that model unless they're contracting out for their paramedics.'",
        "'speaker_4': 'So I think that should be worrisome for the citizens of the city of Long Beach. Not only do you pay taxes, but you are billed for the services that you do receive. So I would hope that we could, because of the budget information we were given, that with this vote tonight, that we can enable the incoming council'",
        "'speaker_4': 'to revisit this and to make the decision based upon the information that they're given at that time. My other concern is I understand that the county said in terms of the conditions and you said, Chief, that the conditions were still in place.'",
        "'speaker_4': 'What happened about the electronic medical records? And I thought that was going to be a requirement for us to be able to implement this program. And I understand we're not there yet.'",
        "'speaker_0': 'Councilmember The EMS Commission received a report from the Data Safety Monitoring Board, which was the the group that was looking at electronic patient care reporting. That group recommended to the full commission that electronic patient care reporting not be included in this study so as to make the prospective data that's captured mirror, if you will, the retrospective data'",
        "'speaker_0': 'that was provided at the outset of the discussion. So the Data Safety Monitoring Board took the PCR out of the equation and then the full EMS commission agreed with the recommendation.'",
        "'speaker_4': 'My understanding is Medicare, though, requires in terms for billing that electronic medical records be implemented. So is that happening?'",
        "'speaker_0': 'The High Tech Act does not specifically mandate that provider agencies such as fire based EMS or local EMS providers. We are not mandated to implement electronic patient care reporting to be reimbursed for ambulance billing. For ambulance billing.'",
        "'speaker_4': 'All right. The other requirement on there was that the city was supposed to indicate that it had adequate money, I understand, budgeted so that if the pilot does not is not positive, that the city has indicated that does have the money available to reinstate the older current model.'",
        "'speaker_4': 'Was was that how was that communicated to the county council member?'",
        "'speaker_0': 'The county accepted the response that we gave them that this was kind of a simple budgeting question. They agreed that we did not need to have a set dollar amount of money set aside in kind of an escrow account that if we were faced with a reversion to our existing program, with that reversion would come a $1.4'",
        "'speaker_0': 'million question that we would address the way we do typically through deficit budgeting.'",
        "'speaker_4': 'Okay. But if you wait two years to reinstate it, certainly it's going to be a much more than 1.4 million because the cost of salaries, benefits and other things, particularly with the PERS additions that are coming, it's going to be much more than 1.4 million.'",
        "'speaker_4': 'So they they, in essence, waived a lot of the conditions they initially had.'",
        "'speaker_0': 'Yes, ma'am. Go forward.'",
        "'speaker_4': 'On this.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'God help us. Thank you.'",
        "'speaker_0': 'Mr. Armstrong. Excuse me. I do want to point out that there definitely are many cities in California that do have this model. So that statement is wrong. We'll get in and get you a list of that. But there are many cities.'",
        "'speaker_4': 'I do respect Mr. West. We've been asking for this for quite a bit about who else was using it and what their experience was, and that has never been provided to the Council. So for that reason I would ask that we support the motion and put this off so that the Council can get the information it needs'",
        "'speaker_4': 'to really make an open and transparent decision.'",
        "'speaker_3': 'Mr.. DAWSON.'",
        "'speaker_0': 'Yes, I did have some clarification based on Councilmember long thought and subsequent questions regarding the the MSA decision, the map. Just just to clarify, do the agencies that you have outlined, the 33, do they have jurisdiction over both public sector and private sector ambulance services?'",
        "'speaker_0': 'Councilmember Yes, sir. The local EMS agency sets the policies for that specific geographic area that they're responsible for. And any agency, public or private, that functions in in this arena is required to adhere to those policies. So, yes, they set the standard for everybody in that area.'",
        "'speaker_0': 'So as a subject matter expert, can you give us an example of a private sector kind of situation where you would have a, quote, one and one ratio? A private sector? Yes. Example, Sacramento Metro Fire Department privatizes there.'",
        "'speaker_0': 'They contract out for their paramedics and they have one paramedic and one EMT that are non sworn employees. They carry out that duty. So the paramedic is non sworn enemy. The EMT is not sworn correct? Yes, sir. Okay.'",
        "'speaker_0': 'And so the paramedic does it. Is he qualified to fight fires either? That's correct. Okay. Just want to be clear on that, because I think there's a real distinction here. Our paramedics are firefighters. All right. With two firefighters on an ambulance, we have a greater capacity to deal with the most egregious calamities that that may face the'",
        "'speaker_0': 'city. I don't want to water that down personally, but I do think this merits a further discussion and a discussion in for the 2015 budget.'",
        "'speaker_3': 'Thanks, Mr. Dawn.'",
        "'speaker_0': 'Well, you know, the most.'",
        "'speaker_5': 'Surprising thing I heard this evening was that the $570,000 of sidewalk money remained in the fire department. So just to refresh everyone's memory, you know, and that first came out in the budget conversation. There was a decision the council made at a recommendation of the BRC and Vice Mayor Garcia to take some a sidewalk money and loan'",
        "'speaker_5': 'it to the fire department for two months to restore engine eight and rescue 12 and then it be repaid with GMT revenue. And then there's the GMT. Revenue did not become clearer over the next 30 days or so.'",
        "'speaker_5': 'There there's an additional council action to defer that decision another 30 days to give more time for clarity. And then when it came back that in fact, the GMT anticipated revenue was not going to measure it, we had hoped for it is going to be significantly less.'",
        "'speaker_5': 'There is then a council action not to restore Engine eight and Rescue 12 because there is no identifiable long term funding source. So shame on me. But. But I assumed that when we eliminated the use of those monies, it was always to be alone.'",
        "'speaker_5': 'It would go back to its original bucket. So, you know, we can certainly follow through online. But but I don't it's not clear to me where the authority is that if council sets aside as a loan, a certain amount of funds for a specific purpose, and then that disappears, that where the authority like to then automatically reprogram'",
        "'speaker_5': 'those funds without any council approval to do so. And again, I don't expect that to be decided tonight, but I would like to get a little further education on how that happened. I don't understand how that happened. Additionally, it's not clear to me why the $570,000 is required for the fire department.'",
        "'speaker_5': 'Because I did go back and look, and on November 5th of last year, there was a motion that was a policy that was adopted by City Council to set aside those one time GMT revenues to make up for the delayed R&D deployment.'",
        "'speaker_5': 'So I don't understand and we can we can certainly come back on that, but I understand why that wasn't fully funded. So therefore, the $570,000 shouldn't be necessary. And that motion was made by me in Sacramento by Councilmember Johnson.'",
        "'speaker_5': 'But nevertheless.'",
        "'speaker_0': 'Chief Tory.'",
        "'speaker_5': 'If you could elaborate a little bit on the comments I heard during public comment was that we're reducing from 13 to 11 ambulances. So could you share does that concern you? If so, why? Or is is this this new model to provide more efficiency, 11 ambulances?'",
        "'speaker_5': 'But could you comment on that, please?'",
        "'speaker_0': 'So currently in Long Beach Fire, we have eight paramedic rescue ambulances. We staff 324 hour basic life support ambulances with two non sworn EMTs. We also staff to pick road staffed ambulances, basic life support ambulances with non sworn EMTs for a total during peak load times throughout the week of 13 transport capable units under the RMD program'",
        "'speaker_0': ', the number of ambulances would go from 13 to 11. All 11 would be 24 hour ambulances staffed with one firefighter, paramedic and one emergency medical technician. The the data decision the decision was made based on the data in 2012 as we went into the fiscal 2013 budget discussions.'",
        "'speaker_0': 'The data suggested at the time that by having those ambulances on duty 24 hours a day, we would be able to meet the call volumes that we expected for that year.'",
        "'speaker_5': 'So do you anticipate the remaining 11 ambulances to have higher call volumes, or do you think that the total call volume load for ambulances will decline because some of those calls will be handled differently?'",
        "'speaker_0': 'Councilmember. Ultimately, by having a paramedic on every engine. We believe that what will happen is we will see in some cases a lesser incidence of transport to the hospital because those engines that have a paramedic would be able to evaluate a patient and potentially downgrade a patient to a to non transport level.'",
        "'speaker_0': 'However, it's important to note that the ambulances that that remain will be transporting both ALS, advanced life support and basic life support patients. So it's something that we would monitor very closely as we move forward to determine whether or not we were meeting the needs of the community with the ambulances that we had.'",
        "'speaker_5': 'Okay. I appreciate that. All right. Well, given that I would make a motion to receive and file the item second.'",
        "'speaker_3': 'Moving second to receiving file. Okay. No further discussion. We'll have a substitute motion to receive and file members. Cast your votes on that.'",
        "'speaker_5': 'But.'",
        "'speaker_4': 'Motion is a tie.'",
        "'speaker_3': 'Okay. We'll go to the original motion, which is to on Mr. Austin's motion. Cast your votes on the original motion by Mr. Austin.'",
        "'speaker_4': 'Motion is a tie.'",
        "'speaker_3': 'That we have do not have sufficient votes to add. That measure is still with us. Thank you. Move to item 13 cookery support.'",
        "'speaker_0': 'Point of order, Mr. Mayor. Quick question. So by this motion being a tie in both instances, what what happens now?'",
        "'speaker_3': 'You don't have any. You'd have there's not sufficient votes to pass it.'",
        "'speaker_0': 'So so many members of the council. So that sort of effectiveness is that it fails. So there is no action taken. So you move forward as.'",
        "'speaker_3': 'As as planned.'",
        "'speaker_4': 'As previously counsel directed.'",
        "'speaker_0': 'That that's correct. That there was no action taken on this item. So the previous authorization by the council would stand until some other action would be brought forward by the Council.'",
        "'speaker_3': 'Thank you, Mr. Parker. Item 13. Clever.'"
    ],
    "Recommendation to request City staff and the Belmont Shore Parking Commission to do the following: 1.  Review and update previous parking studies; 2.  Approach private parking lot owners to determine if opportunities exist to lease parking lots at various times of the day; 3.  Develop an analysis of the costs, benefits and impacts associated with a shuttle service between beach/marina parking lots and 2nd street; and 4.  Hire a design specialist to review the Citys existing parking lots in Belmont Shore to determine if efficiency improvements can be made.": [
        "'speaker_4': 'Item 13 Communication from Councilmember Gary DeLong. Recommendation to request city staff and the Belmont Shore Park Parking Commission to do the following review and update. Previous parking studies approach private parking lot owners to determine if opportunity exists to to lease parking lots at various times of the day.'",
        "'speaker_4': 'Develop an analysis of the costs, benefits and impacts associated with the shuttle service. Hire a design specialist to review the city's existing parking lot in Belmont Shore to determine if efficiency improvements can be made.'",
        "'speaker_3': 'Mr..'",
        "'speaker_0': 'Go on. Thank you very much. MEMBERS If you recall, we had a.'",
        "'speaker_5': 'Closed session recently where we discussed 205 11 and not moving forward with the purchase of that property to convert it to a surface parking lot during that conversation and then months of hearing from the public. We learned that there are there still are opportunities to improve parking in Belmont.'",
        "'speaker_5': 'Sure. And therefore, I'd like to make a motion to request city staff and the Belmont Shore Parking Commission to do these four things as outlined.'",
        "'speaker_3': 'Is there is there a second movement moved in second? Any member of the public is just at Councilman 13. Any council discussion. Mr. Sheldon. Not so, Mr. Sheldon. Somebody else? I'm sorry. I can't see 125 feet seven. Thanks, man.'",
        "'speaker_3': 'Just as a point of clarification.'",
        "'speaker_0': 'And for the council's information, the home at 205 Laverne. Four days after.'",
        "'speaker_3': 'It went on, the market again had an.'",
        "'speaker_0': 'Accepted offer by a.'",
        "'speaker_3': 'Family that's going to live.'",
        "'speaker_0': 'There for more than the asking price.'",
        "'speaker_3': 'That being said, I.'",
        "'speaker_0': 'Think, Councilman Dillon, for this motion, though, I would ask that you consider an alternative in as much as the parking commission is by ordinance focused completely.'",
        "'speaker_3': 'On the businesses in Belmont.'",
        "'speaker_0': 'Shore. And it's been the position of the residents that this has never been an us.'",
        "'speaker_3': 'Versus them scenario, that it's a we scenario.'",
        "'speaker_0': 'And the parking in the sure impacts.'",
        "'speaker_3': 'The residents as much, if not more than.'",
        "'speaker_0': 'The businesses. I would like to see some consideration that when we're talking about reviewing and updating the.'",
        "'speaker_3': 'Previous parking.'",
        "'speaker_0': 'Studies, that committee be appointed perhaps three people by the parking commission and three people from the Residents.'",
        "'speaker_3': 'Association.'",
        "'speaker_0': 'So that there is transparency within the process and then all of the.'",
        "'speaker_3': 'Issues that I'm not sure.'",
        "'speaker_0': 'Addressed. I thank you for that consideration. And my last thing my last comment is congratulations to all the folks that won their elections. Thanks.'",
        "'speaker_3': 'Thank you. Okay. We have a motion in the second. Any other discussion? Members, cast your votes in item 13.'",
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': 'Thank you. Members Item 14 Clark Reid.'"
    ],
    "Recommendation to receive and file communication from the Fire Chief to Marine Safety Division staff regarding staffing of the Citys four rescue boats.  (Citywide)": [
        "'speaker_4': 'Item 14. Report from the City Manager Recommendation to receive and file communication from the Fire Chief to Marine Safety Division Staff regarding staffing of the city's four rescue boats.'",
        "'speaker_3': 'City West.'",
        "'speaker_0': 'Mr. Mayor. Council members during the public comment period of the last council meeting also this evening and also in closed session or prior to close session, a number of our Long Beach lifeguards spoke out about issues surrounding the staffing of the city's four rescue boats in the Marine Safety Division.'",
        "'speaker_0': 'The mayor and city council requested both a closed session and open session item B scheduled for tonight. As you know, we already had the closed session and the city attorney reported that out. This obviously is open session. The closed session was held earlier this afternoon.'",
        "'speaker_0': 'And as you heard from the city attorney, the council has instructed us to go back and meet with the Lifeguard Association to discuss the staffing plan and training that the fire chief is planning to move forward with, which will be completed no later than October 15th, at which time the fire captain will be placed on the shoreline'",
        "'speaker_0': '. Vessel will vacate the vessel. With that, we'd be available to answer questions. But again, we're being directed to go back to the table, to work with our lifeguard department, to create this training program and be concluded with the entire training program and conclusion of the fire captain on the shoreline vessel on or before October 15th.'",
        "'speaker_5': 'Would you like a motion, Mr. Mayor?'",
        "'speaker_3': 'I would love to.'",
        "'speaker_5': 'Move to the receiver file, so.'",
        "'speaker_3': 'I'm moving. Second, any member of the Public Trust Council on item 14.'",
        "'speaker_0': 'Larry, could you clear? Cassie address. John Could you pull up, put on the screen the transparency? As I mentioned last week or the last time you met, my views relative to the lifeguards are based upon interfacing with them since 1982.'",
        "'speaker_0': 'When it comes down to the details, with all due respect to the fire department. When in doubt, I would stand behind the judgment. But a lifeguard as there is to that which is on the 14th floor. Of the city hall.'",
        "'speaker_0': 'That was not always the case in terms of the city hall management. It was generally in sync with the management of the lifeguards. What you see there is an interesting photo that is from the one of the members of the Swift Water Rescue Scheme.'",
        "'speaker_0': 'I would rather rely on their skill and judgment and their counterparts. As I say, then, these people in this building and in emergency. Be it on water or be it on be it on land? Yes. There's an interesting back story which is on the backside of this, which will come into play in about 6 to 8, less'",
        "'speaker_0': 'than six, eight months and so forth. This was just a very little side note here. This was the first branding or marketing of the effort of the two nearly two and a half decade effort, which will culminate hopefully within six months of securing the next Olympic bid, if the IOC if the USOC decides to bid.'",
        "'speaker_0': 'But again, the message is I would rather rely on the talent and the skills of somebody able to accomplish that. Then those on the 14th floor of this city. Thank you.'",
        "'speaker_3': 'Thank you. Next, please.'",
        "'speaker_0': 'Automated Council members public. My name is Erin Fletcher. I'm a board member for the Long Beach Lifeguard Association. First, thank you guys very much for all your energy for these last several months, both in listening and meeting with us and responding, and for your energy behind closed doors to get a firm deadline of October 15th on this'",
        "'speaker_0': 'plan. We look forward to working through the meeting confer process. One of the questions I have is, are we gonna go through the entire meet and confer process prior to.'",
        "'speaker_5': 'The implementation of.'",
        "'speaker_0': 'Putting the captain on the rescue boat? Or is that going to be is that going to be done.'",
        "'speaker_5': 'Prior to the completion of our meeting confer process?'",
        "'speaker_0': 'And what we don't understand why the captain is still going out there and we don't agree that he has to be placed out there, especially considering budget cuts when we talk about the R&D program and also about budget and now we call back to the lifeboats and we're talking about increasing the amount we're spending.'",
        "'speaker_0': 'It just begs some questions from us. And with that, just again, thank you for your time. Thank you for your energy. We still have concerns and.'",
        "'speaker_3': 'Thank you, Mr.. Actually. You have to identify yourself again.'",
        "'speaker_0': 'Okay. My name's John Rancic. I wear a lot of hats.'",
        "'speaker_3': 'I'm the current Commodore of the Association of San Pedro Bay Clubs.'",
        "'speaker_0': 'Which in Long.'",
        "'speaker_3': 'Beach encompasses SEAL Beach Yacht Club, Little Ships, Fleet Yacht Club, Navy Yacht Club of Long Beach. Long Beach Club. Alamitos Bay Yacht Club and the Marina Yacht Club.'",
        "'speaker_0': 'And I went at our last meeting.'",
        "'speaker_3': 'I was directed to express to the City Council the fact that we really felt the need for the lifeguards to be on the boats, even in the firefighting capacities, primarily because when we're out there on the water, especially when we're racing or.'",
        "'speaker_0': 'Especially during.'",
        "'speaker_3': 'Peak times like 4th of July.'",
        "'speaker_0': 'I want the lifeguards out there who have our license.'",
        "'speaker_3': 'By the Coast Guard that have the experience.'",
        "'speaker_0': 'In the rescue.'",
        "'speaker_3': 'Operations and not necessarily.'",
        "'speaker_0': 'The firefighters.'",
        "'speaker_3': 'Who, you know, their job is to fight fires. So I commend the.'",
        "'speaker_0': 'Council in their efforts.'",
        "'speaker_3': 'To keep the lifeguards on the boat.'",
        "'speaker_0': 'And I want.'",
        "'speaker_3': 'To express the appreciation of the Association of San Pedro, the Yacht Club. Thank you. Thank you. Any further comment? Okay. Was there emotion? I forgot.'",
        "'speaker_0': 'I'm sorry. Yes.'",
        "'speaker_3': 'Emotion in second. All right. Members, any questions? Members, cast your vote for an item 14. The receiving firelight, but.'",
        "'speaker_4': 'Councilman. What? Motion carries.'",
        "'speaker_3': 'Thank you. Item 15 Clinical Reid.'"
    ],
    "Recommendation to request Department of Development Services to work with the City Attorney to draft an Ordinance dissolving the Disabled Access Appeals Board (DAAB) and transferring the responsibilities of the DAAB to the Board of Examiners, Appeals and Condemnation (BEAC); and return to the City Council with the implementation ordinance(s).  (Citywide)": [
        "'speaker_4': 'Item 16 Report from Development Services. Recommendation to request the Department of Development Services to work with the city attorney to draft an ordinance dissolving the Disabled Access Appeal Board and transferring the responsibilities of the B to the Board of Examiners Appeals and Condemnation and returning to the City Council with implementation ordinance.'",
        "'speaker_5': 'So move.'",
        "'speaker_3': 'Moving, seconded. Any public comment on item 16? Any counsel request. Mr. JOHNSON.'",
        "'speaker_0': 'Well, thank you, Mayor. Yeah. My question for staff is, is why do these two boards exist? And I never know why we eliminate it now. I mean, I guess my question is why when the second one was proposed, why didn't they just roll those functions in to this other board at that time?'",
        "'speaker_0': 'Councilmember I'll turn it over to the development services director, Amy Bodak, and the Deputy Director, Angela Rounds.'",
        "'speaker_4': 'Thank you. City Manager, West Mayor, City Council Councilman Johnson I can't really tell you the genesis of the two boards, but what we're proposing is a is an efficiency because they were both they're both seated to hear appeals of the building officials rulings, one for accessibility and then one for everything.'",
        "'speaker_4': 'So it's just a matter of efficiencies. The disabled board rarely meets, so we wanted to just combine them with the back that already exists. Board of Examiners Condemnations and Appeals.'",
        "'speaker_0': 'Has that received any comments or concerns from disabled community or others about the change?'",
        "'speaker_4': 'Well, part of the change would require that two disabled folks served on the back, and that's the same in the ordinance for the disabled board.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_3': 'All right. Any further comments? Members cast votes on item 16.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to approve the assignment of the Amended and Restated Field Contractor Agreement and associated agreements (Harbor Department - Segment II) from Occidental Petroleum Corporation to California Resources Corporation and authorize City Manager to execute the Assignment Consent Agreement;": [
        "'speaker_3': 'Thank you. Item 17, Mr. Park. And this has got just one motion or do we have to?'",
        "'speaker_0': 'Members of the Council. If there is no objection, then the Council can be made as one motion.'",
        "'speaker_3': 'I think we would all like to do that.'",
        "'speaker_0': 'Thank you. In the clerk has a summary that she would read as the item.'",
        "'speaker_3': 'No. Excuse me.'",
        "'speaker_0': 'The clerk has a summary of the items.'",
        "'speaker_3': 'Which I certainly hope so. 17 Clerical Read.'",
        "'speaker_4': 'Item 17 Report from Long Beach Gas and Oil Authorize the city manager to execute any and all documents necessary to approve and consent to the assignment of various oil field related contracts in Occidental Petroleum Corporation and its affiliated entities to California Resource Corporation and to release Occidental Petroleum Corporation and its affiliated entities from current obligations as grantor'",
        "'speaker_4': 'under such contracts and accept a replacement gain guarantee from the California Resource Corporation.'",
        "'speaker_5': 'I'm moved.'",
        "'speaker_3': 'And seconded. Any member of the public would stress counsel on item 17. Any council discussion? Members cast your votes on item 17.'",
        "'speaker_4': 'Motion counts.'"
    ],
    "Recommendation to adopt Specifications No. RFP GO14-014 and authorize City Manager to execute contracts and any amendments thereto with Sensus USA, Inc. of Raleigh, NC, Harris Utilities of Ottawa, Ontario, Canada, Utility Partners of America of Greenville, SC, and Utiliworks Consulting of Baton Rouge, LA, in an aggregate amount of $20,085,466 plus a 10 percent contingency in the amount of $2,008,547 for a total aggregate amount not to exceed $22,094,013;": [
        "'speaker_3': 'Thank you, members. 818 We have the similar situation, Mr. Bergman. Can that be consolidated as well?'",
        "'speaker_0': 'That may be consolidated will have to know if there's no objection from the Council.'",
        "'speaker_3': 'Any objection to consolidation. We'll do that. Our 18 clerk read.'",
        "'speaker_4': 'Item 18 report from Language, Gas and Oil, Financial Management and Technology Services Recommendation to adopt specifications and authorize city manager to execute contracts and any amendments thereto with Census USA.'",
        "'speaker_0': 'Some moved.'",
        "'speaker_3': 'Second, moved in second, and a member of the public was stress counseling a meeting? Ms.. Well.'",
        "'speaker_0': 'Mr. ANDREWS. Yes, yes, yes. First of all, I liked it, you know, like the savings that the new media will be, bring it to us, as well as a new communication that they offering the public to connect with the gas and oil company.'",
        "'speaker_0': 'And I would really like to think the individuals who really got together and put this together. Thank you guys again.'",
        "'speaker_3': 'Okay, Mr. Johnson.'",
        "'speaker_0': 'Thank you, Mayor. Mr. City Manager. My understanding is with this item, the gas heat, our gas utility is moving to a wireless meter system. Edison has already moved a wireless meter system. Whether the water permit will remain with the current system, meaning that we'll still have someone checking water meters, but not gas meters or electric meters.'",
        "'speaker_0': 'So I guess my question is, is that accurate? And you tell me what the Water Department's position is or nothing. And let's hear from the water department. Are they interested in this working on this project or what's what's their their thoughts?'",
        "'speaker_0': 'Councilmember I'll turn this over to Cris Garner or Craig Beck, Manager to Council. Councilmember Johnson We've had numerous discussions with Long.'",
        "'speaker_3': 'Beach Water about this. In fact, they were part of the early process in this way. Along the way, they felt.'",
        "'speaker_0': 'That the technology may not be there as far on the water.'",
        "'speaker_3': 'Side than it is for.'",
        "'speaker_0': 'Electric and gas. And so they chose to sit out at this point. One of the benefits with the system that we're going with tonight is that the backbone system is identical. If it's gas alone or gas and water.'",
        "'speaker_0': 'So there's nothing that precludes water from joining us one year, two years, three years down the road, if they so choose. Okay. And in order for them to do that, what would need to happen? I mean, they would need to agree and there's some additional fees or something like that.'",
        "'speaker_0': 'But you're saying that the technology is there. They wouldn't need to install new hardware, essentially. Yes. Yep. At some point in the near.'",
        "'speaker_3': 'Future decide to go this route.'",
        "'speaker_0': 'They would have to.'",
        "'speaker_3': 'Install the units onto.'",
        "'speaker_5': 'The water meters themselves.'",
        "'speaker_0': 'But the backbone system will be there. Okay. And I received one of the other bidders sent a letter concerning the fact they seem to represent that, oh, a consultant who was retained by the city to actually draft this RFP then is now getting work under the RFP.'",
        "'speaker_0': 'In other words, kind of helped design the process and is now getting work out of that process they designed. Is that accurate? And if so, do you do you have I mean, is this a fair and open process?'",
        "'speaker_0': 'No, Councilmember, that's not accurate. They were chosen under a separate RFI and RFP process. And then the actual decision making as far as who to select as far as the final vendor was a joint effort.'",
        "'speaker_3': 'By.'",
        "'speaker_0': 'Long Beach gas representatives, representatives from technology services, raptors, from financial management and also.'",
        "'speaker_3': 'From signal have a water. So they certainly recommended and made.'",
        "'speaker_0': 'The advice.'",
        "'speaker_5': 'But it was our final.'",
        "'speaker_0': 'Decision. But they are not part of this.'",
        "'speaker_3': 'RFP that is before you tonight.'",
        "'speaker_0': 'But we're asking you tonight to do is extend the.'",
        "'speaker_3': 'Terms of the RFP that they were chosen on in 2013.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_3': 'All right. Any further questions? Our members cast your vote for an item 18.'",
        "'speaker_4': 'Councilmember Jones. Motion carries.'",
        "'speaker_3': 'Thank you. Item 19, click read.'"
    ],
    "Recommendation to authorize City Manager to execute agreements and any necessary documents with the Long Beach Unified School District (LBUSD) of Los Angeles County, to include Department of Parks, Recreation and Marine Summer Day Camps in the LBUSDs Extended School Year Optional Program for Fiscal Year 2014.  (Citywide)": [
        "'speaker_4': 'Item 19 Report from Parks, Recreation and Marine Recommendation to authorize City Manager to execute agreements and any necessary documents with the Long Beach Unified School District include Department of Parks and Recreation, summer summer day camps.'",
        "'speaker_0': 'Term out.'",
        "'speaker_3': 'Move moving. Second, any member of the Public Distressed Council Item 19 Any Council. Just come forward, please. Lose benefits of beware the yellow light.'",
        "'speaker_0': 'Excuse me. Your foster counsel I actually meant to step up in regards to item 18 have.'",
        "'speaker_3': 'Already gone.'",
        "'speaker_0': 'That didn't know what the process was. Would I be able to speak it?'",
        "'speaker_3': 'It's already just.'",
        "'speaker_0': 'Just just real quick. Obviously, I just want to learn in year two that my name survives because I represent International Association Machine as union. As you guys know, we are remember you with the city of Long Beach and we're really interested on that and we will wish that it would have been tabled or pulled off the agenda'",
        "'speaker_0': 'so that we could further evaluate to see how it affects our membership here in the city of Long Beach. So as you probably know, I do not know. We currently have members that work at the water department and gas and oil, so that I guess we dropped the ball on this one.'",
        "'speaker_3': 'I tell the truth, there's been a couple of issues about jurisdiction. I don't think any of those issues have been decided. And Mr. Garner, I don't believe there's any impact on on people in the department at this time, is there?'",
        "'speaker_0': 'No. No, there is not.'",
        "'speaker_3': 'What will be replaced eventually over time is the cortex workers, which is a outside contractor.'",
        "'speaker_0': 'Our contract with them expires in 2015 and the.'",
        "'speaker_3': 'Deployment, full deployment of the AMA will take through probably 2017. Good.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_3': 'All right. All right. Item 19, any comment on it? Members cast your vote in item 19.'",
        "'speaker_4': 'City Councilman Chayefsky.'",
        "'speaker_3': 'That's the stadium.'",
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': 'Thank you. Item 20 Click or read.'"
    ],
    "Recommendation to receive and file the application of Cuban Petes Rhythm Lounge, LLC, dba Cuban Petes, for an original application of an Alcoholic Beverage Control License, at 245 Pine Avenue #200-220, with conditions.  (District 2)": [
        "'speaker_4': 'Item 20 Report from Police Recommendation to receive and file the application of Cuban Peter Leather Ribbon Lounge for an original application of an Alcoholic Beverage Control License at 245 Pine Avenue. With conditions district to sell moved.'",
        "'speaker_3': 'Second move and second any member of the Public Research Council on item to consumer law.'",
        "'speaker_4': 'Q I just wanted to make sure that it was with conditions. Madam, quick. Yes, thank you.'",
        "'speaker_3': 'Thank you. Members cast your votes in over 20.'",
        "'speaker_4': 'And the council met a lot of. Council member Andrews. Council member? Austin.'",
        "'speaker_3': 'Did you? They're all on.'",
        "'speaker_5': 'A.'",
        "'speaker_4': 'Motion case.'",
        "'speaker_3': 'Thank you. They'll go to item 21.'"
    ],
    "Recommendation to adopt Specifications No. ITB FS-14-061 and authorize City Manager to execute a contract with NAIAD Inflatables of Newport, Inc., of Portsmouth, RI, for the purchase of one 38-40 foot, multi-use Port Police boat, in a total amount not to exceed $777,076, inclusive of tax and fees.  (Citywide)": [
        "'speaker_4': 'Item 21 report from Police, Financial Management and Harbor Recommendation to adopt Adobe specifications and authorize the city manager to execute a contract with an air inflatable of an airport for the purchase of 130 foot down 3840 foot multi-use port police boat.'",
        "'speaker_0': 'So moved back in. I want to know whose boat.'",
        "'speaker_5': 'Will be bigger places or find.'",
        "'speaker_0': 'Out if movements moved.'",
        "'speaker_3': 'In, seconded anywhere the public officer does to council an item with a head going on. 21. Any council discussion members cast your votes in over 21.'",
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': '22.'",
        "'speaker_4': 'Item 22 Report from Public Works Recommendation to authorize City Manager to execute MRU with the Los Angeles Gateway Regional Integrated Regional Water Management Joint Powers Authority two for administration and Cost Sharing of Preparing and Implementation of Coordinated Compliance, Monitoring and reporting plan.'",
        "'speaker_3': 'Select moving seconded. Any member of the public is just outside of 22. Any council discussion CNN members cast your votes and I 922.'"
    ]
}