{
    "Recommendation to receive Charter Commission appointments and reappointment approved by the Government, Personnel and Elections Oversight Committee pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code.": [
        "'speaker_3': 'Thank you, Madam Clark. Mr. Clark, let's move on to the bid to commission appointment item. So let's start with item 19, please.'",
        "'speaker_1': 'Item 19 is a communication from Councilman Super, now chair of the Government Personnel and Election Oversight Committee. Recommendation to receive Charter Commission appointment and reappointment approved by the Government Personnel and Election Oversight Committee.'",
        "'speaker_3': 'Thank you. I'm loving our new committees already. Doing all this. Doing all this great work. Controversy or not? Do you have a motion on this being supported by the committee?'",
        "'speaker_2': 'I'm sorry, Miss. May I have my sticky mute button again tonight?'",
        "'speaker_3': 'So no problem.'",
        "'speaker_2': 'But let me get up. Okay. Okay. Can you. You can hear me now?'",
        "'speaker_3': 'Yes. Yes. I just wanted to make sure I know this is coming from your committee, so I just wanted to make sure that you had put the motion to approve.'",
        "'speaker_2': 'Absolutely. I apologize for the audio problems, but yes, that is the most.'",
        "'speaker_3': 'Okay. Thank you so much. And then we have a second. So thank you. I can't remember. Want to just go ahead and thank the committee for moving forward these charter commission appointments. And I just want to briefly just mention who they are.'",
        "'speaker_3': 'I want to start by going through these new appointments. On these new appointments, we have the two for the Citizen Police Complaint Commission, the PCC. The first appointment is Irma Archuleta. Irma Archuleta is a Council District seven resident and she has a long and distinguished career in education.'",
        "'speaker_3': 'They really focus on outcomes for historically underserved populations. She served as a trustee of the Lombard City College and also was a former vice president at a community college and a longtime educator and advocate within the city. She has really focused her work to help immigrant students and has held numerous leadership roles across the region.'",
        "'speaker_3': 'And she's really committed to, of course, serving Long Beach with her experience. So congratulations to Ms.. Archuleta. And then also we have Melanie Von Melnick is a resident of Council District six and has served in the lobbyist community for over 20 years, most recently as a member of the Long Beach Human Trafficking Task Force.'",
        "'speaker_3': 'She's organized numerous fundraisers and community service events and also works with a lot of social enterprise programs that also works with artisans in Cambodia to implement fair wages and programs to empower families and learn skill sets to survive.'",
        "'speaker_3': 'And so they're going to both make wonderful additions to the PCC and I want to thank them also to the Civil Service Commission we have. Yvonne Wheeler. Yvonne is a Council District eight resident and she has dedicated her career standing up for workers.'",
        "'speaker_3': 'She currently serves as a worker advocate in her role as national representative for the American American Federation of Government Employees. Prior to this role, Yvonne served as an area field services director for the American Federation of State, County and Municipal Employees.'",
        "'speaker_3': 'Asked me where she worked with over 82 local unions and has been very active across the city and in numerous organizations. Also being appointed tonight to the Parks and Recreation Commission is Charlene Higa. Charlene is a resident of Council District five and a lifelong resident of Long Beach.'",
        "'speaker_3': 'She attended all the U.S. schools and is now an English teacher at Jordan High School. She has been teaching in North Long Beach since 2014. She strongly believes in multiculturalism and diversity, that their strengths within our city and really hopes that her experience in the classroom can even break more barriers on questions around equity and access for'",
        "'speaker_3': 'everyone. So she'll be a fantastic addition to Parks and Rec. And then to add to the KPCC, we are also doing a re-appointment of Dan McNish, which will be her second term. So those are the charter commission appointments.'",
        "'speaker_3': 'And with that, I want to thank everyone with that on the committee for moving these forward. I don't think that we do that. We have any public comment on this item, but we do have council comment. And so first up, I have a councilwoman as in the House.'",
        "'speaker_0': 'Thank you, Mayor. I just wanted to congratulate each and every one of these very impressive residents of Long Beach on their appointment tonight. Thank you so much for wanting to serve on these very, very, very important commissions. And.'",
        "'speaker_0': 'And best of luck. And I know you are going to bring so much value to this commission. So thank you very much.'",
        "'speaker_3': 'Thank you. Councilor Marie Ringo.'",
        "'speaker_2': 'Thank you, Mary. And I, too, want to lend my congratulations to the community members who have stepped up to volunteer on these important, very important committees for the city. So I want to congratulate them and thank you for their community service.'",
        "'speaker_3': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_2': 'Just want to chime in. A great group of appointees on this list. And the next list, we're here. Congratulations to all of you. A lot of great north lobby folks that we see involved and look forward to welcoming you into these new commissions.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you. Very excited about our new fifth district commissioners. I'm proud that they are getting an opportunity to lead and be on a charter commission. It's not often that these change over. So we're really excited for the great work that you're going to do.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you. With that roll call vote, please.'",
        "'speaker_1': 'Councilwoman Cindy has.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Councilman Allen. Hi, Councilwoman Price.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilman Sabina. I sent a woman manga. Councilman manga. Councilwoman Sarah. I Council member Oranga.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_3': 'Thank you. Next up is item nine, which are the non charter commission appointments? And if I can just get a motion any second, please.'"
    ],
    "Recommendation to consider renaming the Long Beach Performing Arts Center as the Beverly ONeill Performing Arts Center, and forward this item to the City Council for approval.": [
        "'speaker_3': 'Thank you. Next up, we're going to do item 11, please.'",
        "'speaker_1': 'Item 11 Communication from Councilwoman Allen. Councilwoman Price and Councilman Alston. Recommendations to forward a request from community members to the Government Personnel and Elections Oversight Committee to consider naming the Long Beach Performing Arts Center, the Beverly O'Neill Arts Center.'",
        "'speaker_3': 'Thank you. Before I before I pass this over to Councilwoman Allen, just want to make some some some statements, and then I turn this over to the council. I just want to just note that. I think we're all I think we're all, first of all aware and understand how incredible of a legacy that Beverly O'Neal left for'",
        "'speaker_3': 'the city and continues, quite frankly, to create and build. She started here in our city, going through our schools, leading numerous organizations. She herself spent time, of course, as president of Lombard City College. She was a faculty member.'",
        "'speaker_3': 'Taught music. Music and the arts were always part of her life. And as mayor, I just significantly increased the ability of arts organizations to be able to operate within the community. She's always been an incredible patron of the arts.'",
        "'speaker_3': 'A year ago, the Beverly on your theater was Christian and supported by this council. It's been a great a great space of performance. And a late last year, a group of arts of citizens and leaders chaired by Randall Hernandez, who was her former chief of staff when she was mayor, brought folks from the community together to discuss'",
        "'speaker_3': 'other ways of honoring Mayor O'Neal. She, of course, will continue to be honored in the city. She's just an incredible person and a mentor and a friend to many of us. That committee spent many weeks meeting with the folks that new Mayor O'Neil best and that served with her.'",
        "'speaker_3': 'And they came forward with this recommendation, which folks have in front of them today, which is really to try to rename not just the theater, but to that whole performing arts center after Mayor O'Neill, which is significant but absolutely justified.'",
        "'speaker_3': 'She is a really a the senior stateswoman of our city and just will be remembered for having transformed this community really out of a very, very difficult moment in our city's history. And I think we all can't say enough about about her and her leadership.'",
        "'speaker_3': 'And so I want to thank Councilwoman Allen for kind of spearheading this and working directly with Mr. Hernandez on this issue. And I want to turn this over to her, because she really kind of took this on and introduced this.'",
        "'speaker_3': 'And I want to thank her for her leadership on this. So, Councilwoman Allen.'",
        "'speaker_0': 'Thank you, Mayor Aaron. Thank you, Randall Hernandez, for your leadership with this. And also want to thank the community members who organized and came together to propose this way to honor Mayor Beverly O'Neill. And I also wanted to say just thank you, Mayor, for your longtime support of the arts and for your leadership and partnership.'",
        "'speaker_0': 'I also would like to thank my council colleagues, Councilwoman Pryce and Council Member Austin, for signing on to this item. On a personal note, my neighbor Johnny Steel gave me a book this weekend that I read that was called Passionately Positive The Beverly O'Neal Story written by Harry at the Gazette.'",
        "'speaker_0': 'I enjoyed the book so much, and it just confirmed how deserving Mayor Beverly O'Neal is. Just here are some things that I took from the book. She's a collaborative leader. She did not care who got credit. She was just born to lead and born to lead this city.'",
        "'speaker_0': 'She listened and she inspired people around her. She believed that the small victories added up to big success, and she was a trendsetter and a barrier breaker. And she did that with such style and grace. And everyone that knows her will attest to that and to illustrate her immense contributions to our city's musical and cultural culture.'",
        "'speaker_0': 'I would just like to read a short paragraph on the community letter. Like a mirror, Garcia said. It is attached, and I really encourage all of you to read this great letter that our community and put together. But here's a paragraph it says Throughout her life, music and throughout her life, music and theater has been a personal'",
        "'speaker_0': 'passion and focus of civic pride. Beverly Bunnell was an avid singer and has worked tirelessly to expand arts and cultural opportunities at Long Beach City College and across the city. Mayor Beverly O'Neal often remarked how vital a vibrant arts and cultural community is to the economic, health and spiritual enrichment of a city and its people.'",
        "'speaker_0': 'And after the after the proposal from the community and stakeholders, I also heard from several groups and individuals. So I look forward to discussing those topics that were that were the emails and letters that were sent to me.'",
        "'speaker_0': 'I look forward to discussing those ideals and concerns through the committee process. And I just want to say, I've heard while I've had a wide net of people who are really supporting this, I know and I want you know, that people, especially in our community, want to make sure that there is a focus on the performing arts'",
        "'speaker_0': 'in this name. And I understand that that makes sense. We want to make sure that that that performing arts is still in the name. So I would like to make a slightly modified recommendation to the committee and I the committee.'",
        "'speaker_0': 'I'd like to propose that the committee consider renaming the Long Beach Performing Arts Center to the Beverley O'Neill Performing Arts Center. So thank you very much and I appreciate your support on this item.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Price.'",
        "'speaker_0': 'Thank you, Mr. Mayor. And thank you to Councilwoman Allen for bringing this item forward. I know that Mayor O'Neal is a source of inspiration for many of us local leaders here in the city of Long Beach. She, as the mayor, said, she really led this city through some very challenging times, and she did so through her positivity'",
        "'speaker_0': 'and her willingness to work hard to get things done, which was so important to her, as Councilwoman Allen said. She's just one of those people that is really about getting the work done, making progress. But she's never, ever the kind of person who demands praise or self-promote.'",
        "'speaker_0': 'I mean, when you hear her talk about the progress that the city made during her her time, there was never an eye associated with any of it. She talks a lot in the way. And I really learned I've learned a lot.'",
        "'speaker_0': 'I have a long way to go in terms of lessons of leadership from her. She's a tremendous mentor to me personally, but she's really a wonderful representative of the city. Her ideals, her values, her work ethic, and her commitment to making sure that the trust the public has placed in her is not misused or used for a'",
        "'speaker_0': 'personal purpose or a personal gain or advantage was evident in all of her years of service and certainly evident in the vote of the people to elect her for a third term as a write in mayor. She is part and parcel to the city of Long Beach that we all know today.'",
        "'speaker_0': 'You cannot separate her from the city that we are today. The good parts, especially so and so. I'm grateful that this process has led to the recommendation that is being brought forth tonight. And I can't wait to see her name on the Performing Arts Center, Big in Lights, because anyone who knows Beverly O'Neal knows how much she'",
        "'speaker_0': 'loves the arts, but how much she really shies away from getting too much attention. But yet she deserves it. And she has earned it, and she has earned it in the most selfless way. So I proudly support this item, and I thank the councilwoman from the second district, councilwoman Allen, for bringing it forth.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I want to, first of all, take this opportunity to just appreciate Councilmember Allen for inviting me to sign on to this item. I am enthusiastically in support of it. I think no, but no one is is more worthy of such an honor than former Mayor Beverly O'Neal.'",
        "'speaker_2': 'She I'll just just say on on a personal level, I was a student at Long Beach City Council City College when she was the president of the college. I had the privilege of working on her campaign as a young aerospace worker.'",
        "'speaker_2': 'I realize and remember those that very difficult times. But she led our city with grace and strength and poise and really was a very highly respected national on a national level. I think the last president to visit the city of Long Beach was with President Clinton.'",
        "'speaker_2': 'I may be wrong on that, but but she brought President Clinton to the port of Long Beach. And I was really honored to be appointed to the Citizen Police Complaint Commission. A charter commission got my start in the city back in 2003 under then Mayor Beverly O'Neal.'",
        "'speaker_2': 'And so she's someone who has profoundly impacted my family, me personally, but so many others, and been a role model for so many people in this city. She is somebody she's a woman who, like I said, govern with strength and poise.'",
        "'speaker_2': 'And, you know, it's really nice for us to be able to to recognize and salute individuals and give them their roses while they're here. And I think that's very, very important. And I don't think anybody would disagree with.'",
        "'speaker_2': 'Beverly O'Neal being honored the way we we're seeking to do so. So it's my pleasure to support the side of your councilmember.'",
        "'speaker_3': 'Councilwoman and house.'",
        "'speaker_0': 'Mayor. Thank you. Sorry about that. And I just want to say what a great honor it would be to to support this item. I think that Mayor Beverly O'Neill has been such a fantastic and inspirational example of a woman for so many years.'",
        "'speaker_0': 'Yes, she was our mayor for several years. And she gave so much to our city in a very difficult time. But ever since then, she continues to give and continues to give and continues to give. So this is only something very, very I would say, very natural for us to be able to give something, even gifts of'",
        "'speaker_0': 'this magnitude to her. In honor of all of the the work that she has done for our city and all of the values that she brings to our city. So I am so happy to be supporting this item.'",
        "'speaker_0': 'Cool.'",
        "'speaker_3': 'Vice mayor.'",
        "'speaker_2': 'Thank you, Mr. Mayor. This this item. This item does feel good. I agree with with council members. And based on our thanks to Councilmember Allen, Councilmembers Price and Austin for bringing this forward. I think what stands out to me the most is this letter.'",
        "'speaker_2': 'This letter is incredible. They've already named ad hoc committee members. These are respected community members. It carries a lot of weight, got elected officials from the state and across the region. You have civic leaders. I mean, these people here all are very invested in our community.'",
        "'speaker_2': 'See downtown interest. You see tourism interest to the arts community. This is the way this is the way it should be done. And, you know, if anything, this should be a model for how we move forward name process in the future.'",
        "'speaker_2': 'Look forward to voting on this. You know, I encourage the committee to go ahead and, you know, get this back to the council, as, you know, as as as soon as you can. And and we look forward to recognizing celebrating this tremendous legacy of, you know, our lobbyists favorite mayor.'",
        "'speaker_2': 'You know, I was just reading her bio little bit. We all hear about it. She's kind of a larger than life figure. When I was 11 years old, looks like she was elected mayor. I feel like I know more about I know more about her just based on her legend and the things she was given.'",
        "'speaker_2': 'Just her incredible track record in our city. So congratulations to Mayor O'Neal. And I look forward to voting on this. Thank you.'",
        "'speaker_3': 'Thank you. Mary Richardson. Councilman Mongo.'",
        "'speaker_0': 'Thank you. I am in full support of this item and I appreciate the committee that has brought forward this recommendation. It's important that we take the time to recognize those who helped build our city back to the place where it is today.'",
        "'speaker_0': 'And I'm very grateful for all of the things that that has taught me personally and us as a city. Thank you.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'Thank you. That concludes our council comment. I just want to close by again, just thinking. Mr. Randall Hernandez I couldn't thank him enough. He just did a phenomenal job. Numerous meetings, brought a lot of people together. And I want to just leave leave us with what was with one thing, which is why when they kind of presented'",
        "'speaker_3': 'the performing arts center as as kind of the option that that where they landed, which I thought was really, really great. And that is that a lot of people forget that Mayor O'Neill was a music teacher. And I know I've said it before, but I think that's where her that is where her life as an educator started'",
        "'speaker_3': '. And she taught music from, you know, early elementary. And then, of course, going through Atlantic College and became in leadership roles within the music department at Long Beach City College, which then got her to become a vice president at the college under the dean and then the presidency.'",
        "'speaker_3': 'It's her career, too, on the on her road to politics. I began in music. She was a performer for those that have not heard her sing. She is a great singer. She is a musician and she loves the arts.'",
        "'speaker_3': 'And so when this was presented in the way it was and the connection was made to her history and what got her started in Long Beach, which was music. This is just a home run, in my opinion. And so I'm just very grateful to her and her contributions to the city.'",
        "'speaker_3': 'And so very well done. Again, Councilman Allen, thank you again. I know you worked hard on this in the last few weeks and months, so I appreciate the committee's support. And let's do a roll call vote, please.'",
        "'speaker_1': 'Councilwoman Zendaya's. Councilwoman Ellen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price. I councilman's subpoena. I asked the woman mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Aranda.'",
        "'speaker_3': 'Have him do.'",
        "'speaker_1': 'Councilman. I'm Councilman Austin.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion case.'"
    ],
    "Recommendation to receive and file the Fiscal Year 2020 Year-End Budget Performance Report and increase appropriations in several funds across several departments for various purposes to reflect final expenditures and carryover clean-up.  (Citywide)": [
        "'speaker_3': 'Thank you very much. Let's move on to item. 12.'",
        "'speaker_1': 'Item 12 is a report from financial management. Recommendation to receive and file the fiscal year 2020 year end budget performance report and increase appropriation in several funds to reflect final expenditures and carryover up CDI.'",
        "'speaker_3': 'Okay. I know. Mr. Modica. I think Mr. GROSS was gonna give us an update.'",
        "'speaker_4': 'Yes, sir. Mr. GROSS and Grayson are able to give us that report.'",
        "'speaker_0': 'Hello, Mayor. And members of the City Council. Can you all hear me?'",
        "'speaker_3': 'Yes, we can.'",
        "'speaker_0': 'Okay, great. Good evening, Mayor and members of the City Council. This is the year end performance report for FY 20 for all funds. As we know, this past year was an unprecedented year with the city facing issues, a worldwide pandemic, the injustices and increased exposure of systemic racism and economic disruption.'",
        "'speaker_0': 'These events altered the city's priorities and focus in Fy20 and has had a significant impact on the city's finances and our financial strength. As a reminder, the Fy20 budget was adopted before employee contract negotiations were complete and the budget did not include funding for these potential costs.'",
        "'speaker_0': 'Therefore, when negotiations were complete, cost of about 10 to 12 million were unfunded. However, based on strong fy19 performance, there were encouraging signs at that time that strong revenue performance in Fy20 could help cover these costs. Unfortunately, the pandemic hit and that strong revenue did not occur after it became clear that the world was in a pandemic'",
        "'speaker_0': 'situation. The initial shortfall projection indicated that the general fund could have a potential shortfall of 25 to 41 million, largely due to pandemic related revenue loss. Fortunately, the final shortfall didn't turn out to be as bad as initial signs showed.'",
        "'speaker_0': 'The ending of FY 20 shortfall in the general fund is 19.7 million. However, I would like to note that this is an incredibly unusual and unique year with many accounting complexities that we are still researching, adjusting entries and the financial systems were still occurring subsequent to finalizing this report that could impact the shortfall by 2 to 3'",
        "'speaker_0': 'million. Potentially to the good. But the ultimate situation of a large shortfall will not change. This ending shortfall is better than the early projections due to several factors, both on the revenue and expenditure side. The revenue shortfalls were not as severe as originally thought to be possible.'",
        "'speaker_0': 'Additionally, some revenues outperformed expectations such as cannabis revenues. Lastly, the revenue loss was mitigated by actions such as not funding the annual oilfield abandonment liability costs to preserve as much of the expected oil transfer, as well as additional gasoline transfers due to strong performance in the gas fund while staying within charter limits.'",
        "'speaker_0': 'In terms of expenditure, proactive measures were taken during the year. The city manager issued mid-year savings target and a hiring freeze to departments who work to scale back on costs and generate savings. The City Council also suspended some previously approved one time projects.'",
        "'speaker_0': 'Federal and state grants such as FEMA and CARES also help cover eligible pandemic costs. And a separate report providing full detail on pandemic related expenses and offsets will be issued soon in a separate tff. Ultimately, while these actions help to reduce the shortfalls, revenue were not sufficient in covering expenses, which included unexpected costs related to First Amendment'",
        "'speaker_0': 'demonstrations, response to civil unrest, the negotiated contract costs that were not budgeted, as well as additional funds needing to be reserved, such as the measure and litigation lawsuit. This general fund shortfall is being addressed by utilizing 12.6 million of the 13.5 million operating reserves and about 6.8 million of the 46 million emergency reserve.'",
        "'speaker_0': 'This essentially depletes the operating reserves and bring both reserves below the recommended minimum levels. Replenishing these reserves and restoring financial resiliency should be a high priority for any future surplus use or for any federal stimulus funds the city might receive.'",
        "'speaker_0': 'Other funds were also adversely impacted by the pandemic or have fiscal challenges for other reasons. These include the Tidelands Operating Fund, the Special Advertising and Promotions Fund, the Insurance Fund, the Civic Center Fund and the Towing Fund. Unlike the Tidelands and the special advertising and promotion funds are anticipated to have continuing challenges in FY 21, with the'",
        "'speaker_0': 'pandemic related revenue loss and expenses, they will need to be closely monitored with potential mitigating adjustments in FY 21. To conclude with some good news, the measure program ended with a surplus of 5.3 million due to a mix of revenue coming in over budget expenditure, savings from the delayed police academy and not contributing to the measure b'",
        "'speaker_0': 'stabilization reserves which occurs by design when there are fiscal difficulties such as the one we faced in Fy20. The city manager is proposing to allocate these dollars towards critical infrastructure projects as listed in the report, with investments for street improvements, improvements in sidewalk, curb ramp and ADA compliance program, traffic circle, wayfinding signs, tree trimming program, and support'",
        "'speaker_0': 'for repairing and upgrading citywide security cameras. In FY 20, the City Council had adopted a motion designated future measure surplus funds to be focused on alleys and park improvements. But with the pandemic impacting the availability of funds for various critical needs.'",
        "'speaker_0': 'The recommendations focus on immediate needs, which other funding is not available. If the City Council concurs with these allocations, the measure recommendations will be incorporated into a FY 21 Budget Adjustment Report as contingent appropriations subject to the Citizens Advisory Committee review in April to ensure that a use is in compliance with the intent of measuring spending.'",
        "'speaker_0': 'This concludes my staff report and I'm available for questions.'",
        "'speaker_3': 'Thank you. I have a motion to approve by Councilmember Ringa. Is there a second place? Second by Councilwoman Zendejas. Let me before I go back to Councilmember Durango, I just want to make some broad comments. First is I certainly there's no question that this is a better update than we had a few months ago.'",
        "'speaker_3': 'And it's great to see, obviously, many of our funds and projections perform better than we were expecting. So I think that's really great news. I think also it's important to note that we are using our emergency reserve on exactly what the name of the reserve is called, and that's in case of emergencies.'",
        "'speaker_3': 'These are kind of once in a generation events. This certainly this pandemic has been the truly the largest challenge to us that we have faced as a city and community. And so it's very appropriate that that in these emergencies, we have this fund to help us get by and get through.'",
        "'speaker_3': 'Let me also just add, and I think also that which is really critical and this this is not not a conversation for tonight, but it certainly will be a few weeks from now is that the White House and Congress are putting final touches on the American rescue plan, and we don't have final details yet on what those'",
        "'speaker_3': 'numbers look like. But we do know that there is going to be significant support for cities. And we are working very hard to ensure that Long Beach receives a significant share of that plan. We should know kind of the conclusion of that in the in the in the weeks ahead.'",
        "'speaker_3': 'And and as part of that, many of our kind of shortfall challenges, including the ability to look at how we build back that reserve, is all possible within this plan. And so I think I look forward to sharing more when when it is set by the Congress.'",
        "'speaker_3': 'And I know this council also looks forward to having that conversation in the future. And so I just wanted to add that a little context to what's in front of us. And so thank you again to our budget staff for this presentation.'",
        "'speaker_3': 'Customer Oranga Did you have any comments? You made the motion.'",
        "'speaker_2': 'I just thank you there for the hard work that you're doing and making sure that we get this fair share of the assistance that's going to be coming from the federal government. And as a member of the Oversight Budget Oversight Committee, I am committed to looking further into other creative ways that we can manage this budget and'",
        "'speaker_2': 'weather this pandemic, as well as all the other challenges that we face this past year. Thank you.'",
        "'speaker_3': 'Thank you, Councilman. Sunday House.'",
        "'speaker_0': 'To thank you, Mayor and staff, for working really hard on this. I know it's been a very difficult year, so I appreciate all the hard work that has gone into saving as much as we can, wherever we can.'",
        "'speaker_0': 'And I'm looking forward to the funds coming down to us. So thank you.'",
        "'speaker_3': 'Thank you for super now.'",
        "'speaker_2': 'Thank you, Mayor. I just have one comment on the report and it is regarding an item on page 12. The Measure A and it is an enhancement of $800,000 to be spent on signage and landscaping at the traffic circle in the fourth Council District.'",
        "'speaker_2': 'First, I'd like to thank staff for supporting the city for project. Unfortunately, I have not received any information on the proposed project, so I cannot vote in support of the agenda item for a project of this magnitude. I would have expected to receive a briefing renderings and the opportunity to share the project with the public.'",
        "'speaker_2': 'That did not happen. So regretfully, I will not be able to support the item and also like to add that I am not commenting on the merits of the project. Potentially, this could be the greatest public works projects in the history of mankind.'",
        "'speaker_2': 'The problem is, I don't know what it is, so it puts me in an awkward position of turning down $800,000 for my district, but I can't do that without knowing anything about the project. So thank you for that.'",
        "'speaker_2': 'And that concludes my comments.'",
        "'speaker_3': 'Councilman Austin.'",
        "'speaker_2': 'Thank you. I just wanted to thank staff, particularly Ms.. HUME, for the great presentation, our finance team for for really staying on top of our budget. It's good for us to know where we've been, to know where we're going.'",
        "'speaker_2': 'And just a couple of remarks here. Measure a you know, again, I want to thank the voters in Long Beach for for passing Measure A, because I don't know where we'd be without that fund. We'd be really handicapped to be able to do anything comes related to infrastructure repair as well as, you know, maintaining the level of'",
        "'speaker_2': 'public safety that we do have today. And then congratulate the the council and the city staff or for its work related to cannabis as well. Cannabis is is a new industry that is really way outperforming projections that were that were projected back in 19 and 20.'",
        "'speaker_2': 'So, you know, again, being innovative, being creative, being bolder, looking at new revenue opportunities was was incredibly important for us. We still had a deficit year on balance of $19 million in FY 20, but it could have been much, much worse.'",
        "'speaker_2': 'I'm, again, very interested in seeing how we how we rebound over the next several months and hopefully and and we'll be working with you, Mr. Mayor, to. To get all the support we can from the federal and state governments to replenish our reserves and continue to provide a great service that we do for the residents of Long'",
        "'speaker_2': 'Beach. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you, Mr. Mayor. I guess my biggest concern is something that I communicated to the city manager when he brought forward this. The city council voted when we brought forward measure what we wanted those next set of priorities to be.'",
        "'speaker_0': 'And those priorities are not here. And so while a lot of these projects are important, we told the voters and and we also told the community when we had these hearings and people came forward to talk about the budget, that the next round of measure funding, if it became available, would be for park bathrooms, would be for'",
        "'speaker_0': 'pump values. We talked about these things. And so my big hesitation is we went through a process and the Budget Committee and the budget chair brought that forward. And we discussed it as a council and we made those recommendations.'",
        "'speaker_0': 'And I get that it's important to make adjustments on the floor. And as time goes by. But in the discussions with city staff, it sounds as though those priorities were an afterthought. And so that gives me heartburn. And so I feel like this was the same type of thing that came up when we discussed the worst streets'",
        "'speaker_0': 'first. We talked about that there are streets across the city that are very poor and alleys across the city that are very poor. And we agreed that those were the priorities. So is, as Mr. Otunga, the maker of the motion.'",
        "'speaker_3': 'He is.'",
        "'speaker_0': 'I guess I would ask the city staff, what's the urgency of approving this tonight and if there potentially are other councilmembers that feel that this needs to go back and get another look? And if there is, then I would hope Councilmember Odinga would be open to having some city staff bring back a revision next week.'",
        "'speaker_0': 'And let's continue this item.'",
        "'speaker_3': 'Councilmember. How can we have a motion on the floor? We're going to go ahead and go to a vote. Kashmir ranga. Unless you have a. A change or a friendly on that.'",
        "'speaker_0': 'I'm asking if you'd be open to a.'",
        "'speaker_3': 'Sorry.'",
        "'speaker_0': 'Attenuation. A friendly amendment to continue for a week.'",
        "'speaker_3': 'Cut from your income?'",
        "'speaker_2': 'No, I don't think so. I think what we can do is we can work this out through the Budget Advisory Committee for the whole country.'",
        "'speaker_3': 'Okay. We're going to go to a roll call vote. Madam Clerk.'",
        "'speaker_1': 'Councilwoman Sunday House.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilwoman Ellen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman subpoena.'",
        "'speaker_2': 'Names.'",
        "'speaker_1': 'Councilman Mangum.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Alston.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson. May motion carries.'"
    ],
    "Recommendation to receive and file a presentation and Public Service Announcement regarding Teen Dating Abuse Awareness Month.": [
        "'speaker_3': 'Thank you. Next up is item number ten.'",
        "'speaker_1': 'Item tense communication from Councilwoman Price Recommendation to receive and Fire Presentation and Public Service Announcement regarding Teen Dating Abuse Awareness Month.'",
        "'speaker_0': 'Mr. Mayor. With your permission.'",
        "'speaker_3': 'Yes, I have you. Have you? I think I'm seeing a performance, a performance, a presentation cued up. So I'm going to turn this over to Councilwoman Pryce.'",
        "'speaker_0': 'Thank you, Mr. Mayor. So I'm glad to have the opportunity tonight to highlight the importance of an often overlooked issue of teen dating violence. Nearly 1.5 million high school students nationwide experienced physical abuse from a dating partner in a single year.'",
        "'speaker_0': 'Often high school students lack the knowledge to identify unhealthy relationship behaviors and to report the same. To speak on this tonight, we have two speakers on the phone who will provide us an update. We have with us tonight, Sharon we from Interval House and Ava Carbonaro, who is the student and president of the Female Leadership Academy at'",
        "'speaker_0': 'Wilson High School. We also have a brief PSA that I would like to show you before regarding this topic, and then I'll conclude with some final remarks. So with that, let me turn it over to Sharon and then Eva.'",
        "'speaker_0': 'Good evening, Mayor Garcia and honorable council members. My name is Sharon. We with Interval House. We are so grateful and proud that our beloved city of Long Beach and our influential city leaders are considering recognizing this important teen dating violence Awareness Month, which is February.'",
        "'speaker_0': 'Dating violence has already impacted so many of our community's youth. As you most of you know, Interval House has a long history of spearheading efforts related to dating violence. Our work has been recognized as a national model for youth violence prevention, largely because our executive director, Cara Williams, has always encouraged us to engage and empower youth to'",
        "'speaker_0': 'be involved and to be the voice for change. Youth who grew up in the interval house shelters for abused women and children have become pioneers in the youth violence prevention movement. And it has been so exciting for us to be a part of all that has been accomplished.'",
        "'speaker_0': 'Nothing more could be more powerful of an example and partnership than what we have been doing with Wilson High School over the past five years. The student leaders of the Female Leadership Academy and the associated student body have truly dedicated themselves to breaking the cycle of violence through prevention, education and organizing teen dating violence awareness events for'",
        "'speaker_0': 'the entire student body throughout the school year and a global pandemic that caused closures to in-person classes could not stop them. Instead of using virtual schooling to limit their impact, they actually got more creative and designed a virtual PSA, which you'll see shortly, and a campaign to reach all students at home.'",
        "'speaker_0': 'We were truly in awe of the students dedication to our cause. Of course, none of this would have been possible without the support of Principal Kim Holland and a special team of faculty at Wilson High School, Mizrachi, Ms..'",
        "'speaker_0': 'Lovato and Ms.. Frazier. Lastly, I would like to extend our deepest gratitude for the incredible support and involvement of Council Member Susie Price, who has not only been a part of our on campus events and efforts over the years, but also featured in our PSA for Orange Day, which was February 9th.'",
        "'speaker_0': 'We want to thank you for this incredible recognition for our community's youth to break the cycle of violence and as Councilmember Price stated. Also joining tonight is one of our wonderful student leaders at Wilson High School. Okay. Ava, you're on.'",
        "'speaker_0': 'Take it away. Yes. Hello. Good evening, honorable mayor and council members. My name is Carbonara and I'm a senior at Wilson High School and president of our Female Leadership Academy. As you know, this year has been quite a challenge for so many of us students and youth because of these extraordinary circumstances.'",
        "'speaker_0': 'Student leaders at Wilson High School are so proud to continue bringing awareness to team dating violence while attending school virtually. As we stressed in our online campaign, you young people are at the highest risk of dating violence and minority groups like LGBTQ plus black and Native American women are at even higher risk.'",
        "'speaker_0': 'As an academy is dedicated to the empowerment and support of young women. We aim to educate our Long Beach community on this enduring issue and prevent future violence. Through Female Leadership Academy and the Associated Student Body in partnership with Interval House, we have used our passion and creativity to create a campaign that engages students and gives them'",
        "'speaker_0': 'the power to promote healthy and safe love for all. We are so proud of this year's Orange Day event and February's team Dating Violence Awareness Month and are honored to be part of such a important movement. To the people of Long Beach and City Council, we kindly ask you to continue sharing our message and protect our youth'",
        "'speaker_0': 'against physical, emotional and sexual violence in relationships. Thank you for this incredible proclamation and for helping us to spread a message of love and leadership. This means so much to you to see our city leaders supporting our efforts.'",
        "'speaker_0': 'Thank you. Yvonne, if we could please have our team run the PSA. That'd be great.'",
        "'speaker_2': 'Okay. So the mayor stepped away. There's the vice mayor Richardson. I don't see any additional cues from from the council.'",
        "'speaker_0': 'Vice mayor. I think they say.'",
        "'speaker_5': 'Oh, forget me, forget.'",
        "'speaker_0': 'Thank you very much to our Abbie Tex for showing that PSA and to the students at Wilson for putting it together and for bringing this item to our attention. And I just want to end with sharing that, you know, increasing education regarding team dating violence is critical because violent relationships in adolescence can have serious ramifications by putting'",
        "'speaker_0': 'the victims at higher risk for substance abuse, eating disorders, risky sexual behavior and further domestic violence. Here in Long Beach, we are lucky to have several organizations taking this topic seriously this year. Interval House is working with Wilson High School to bring attention to this problem, as we discussed.'",
        "'speaker_0': 'But we're also lucky to have the Long Beach Women's Shelter providing support year round to stop teen dating violence violence. They'll be holding their fourth annual youth conference this Saturday, February, February 20th, from 11 a.m. to 1 p.m..'",
        "'speaker_0': 'Through dedicated efforts of community groups like Interval House and the Woman's Shout Long Beach Women's Shelter, we can work together to prevent long, long, lifelong impacts of teen violence, and hopefully we can all be more mindful of it as we talk with our communities about this important issue.'",
        "'speaker_0': 'I want to thank both Sharon and Ava for joining us this evening. And Vice Mayor Richardson, I'm going to turn it back over to you.'",
        "'speaker_2': 'Thank you. Sorry about that. It got silent. I know. That was an ongoing loop. I see a second from mayor councilmembers in De Haas. I don't see any additional council comments, any public comment on this.'",
        "'speaker_1': 'There's no public comment.'",
        "'speaker_2': 'Right. Let's go ahead and have the roll call vote then.'",
        "'speaker_1': 'As we mentioned, there's.'",
        "'speaker_0': 'I like.'",
        "'speaker_1': 'Councilwoman Allen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabrina.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilwoman. Mongo.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilwoman Sarah. I council member otunga.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'"
    ],
    "Recommendation to adopt Specifications No. RFP HE21-019 and award a contract to The Illumination Foundation, of Orange, CA, to provide site operations and interim housing services at a 102-unit hotel property at 1725 Long Beach Boulevard that will be acquired through the State of California Department of Housing and Community Development (HCD) Project Homekey Program, in an annual amount not to exceed $2,000,000, for a period of 12 months, with the option to renew for an additional 12-month period, at the discretion of the City Manager; and authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments; and   Increase appropriations in the Health Fund Group in the Health and Human Services Department by $2,265,600, offset by grant revenues from HCD.  (District 1)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. Let's have item number 13, please.'",
        "'speaker_1': 'Item 13 A report from Health and Human Services. Recommendation to award a contract to the Illumination Foundation to provide site operation and interim housing services at property located at 1725 Long Beach Boulevard that will be acquired through the Project Homekey program in an annual amount not to exceed two point million District one.'",
        "'speaker_2': 'Thank you, sir. Let's start with the staff report.'",
        "'speaker_0': 'Good evening, Mayor and Council Members. Thank you for.'",
        "'speaker_2': 'This opportunity.'",
        "'speaker_3': 'To share our progress for our project.'",
        "'speaker_0': 'Homekey Non Congregant Shelter and Sobering Site at 1725 Long Beach Boulevard. As you remember, you may remember the city purchased the best western of Long Beach last year. This contract is the next step to opening a new 102 room non.'",
        "'speaker_2': 'Congregate housing.'",
        "'speaker_0': 'Site in our city. The contract will be funded as part of the 2.265 million in state funding for the operations of our project site. Through an RFP process, the Health Department selected the Illumination.'",
        "'speaker_2': 'Foundation to operate this non congregate site.'",
        "'speaker_3': 'The Illumination.'",
        "'speaker_0': 'Foundation operates sites throughout L.A. and Orange County.'",
        "'speaker_2': 'And has.'",
        "'speaker_0': 'A strong reputation in their.'",
        "'speaker_3': 'Work. For people.'",
        "'speaker_0': 'Experiencing homelessness, the population to be served would be primarily people experiencing homelessness with incomes at or below 30% area median income who are engaged in the city's continuum of care coordinated entry system.'",
        "'speaker_3': 'The goal of.'",
        "'speaker_0': 'This transitional housing program is to facilitate the movement of people.'",
        "'speaker_2': 'Experiencing homelessness.'",
        "'speaker_0': 'Into permanent housing within 24 months. The Project Homekey Opportunity provides.'",
        "'speaker_3': 'A move towards this goal. The Illumination Foundation Contract for Project.'",
        "'speaker_0': 'Homekey includes site monitoring to ensure that participants are safe and have basic needs that are.'",
        "'speaker_3': 'Met.'",
        "'speaker_0': 'Case management and to support connection to permanent housing. Connection to needed services such as mental health services and employment opportunities. Transportation to connect to services and care appointments. Food services for people who are seeking food support. Security onsite to ensure people are safe.'",
        "'speaker_0': 'And that unauthorized people do not come on to property and basic cleaning services as we do for all other.'",
        "'speaker_2': 'Congregate non congregate facilities.'",
        "'speaker_0': 'The site is scheduled to open on March 15 to begin taking residents. This is required by our state contract for the funding the March 15th date. We look forward to working with the.'",
        "'speaker_2': 'Illumination Foundation to provide this.'",
        "'speaker_0': 'Interim housing opportunity.'",
        "'speaker_3': 'For people.'",
        "'speaker_0': 'Experiencing.'",
        "'speaker_2': 'Homelessness in.'",
        "'speaker_0': 'Long Beach.'",
        "'speaker_2': 'With that, I conclude.'",
        "'speaker_0': 'My presentation and I'm open for questions.'",
        "'speaker_2': 'Thank you. I see a motion from council members that they have. Council member you have for.'",
        "'speaker_0': 'Thank you very much, Vice Mayor, and thank you, Kelly, for that presentation. I just want to thank you for all your hard work. As you know, this is very important to me. Every step closer, we get towards the full operation of this amazing project.'",
        "'speaker_0': 'Home t location makes me so very happy and excited for all of our houseless residents that are in so much need right now. I know that the operation of these sites is something that that's really important for both, you know, for both us as a city and for our residents.'",
        "'speaker_0': 'And I was wondering, Kelly, if possible, if you could highlight a little bit more on why the Illumination Foundation was selected to do this, to oversee this project. Yes. The Illumination Foundation has experience across the many sites. And Paul Duncan, our homeless services division, knows of their their.'",
        "'speaker_2': 'Their work well.'",
        "'speaker_0': 'I have had many conversations with them.'",
        "'speaker_2': 'They also run.'",
        "'speaker_0': 'Recuperative care and other types of services for people experiencing homelessness. So they have a very strong reputation for the work that they are doing, and we know that.'",
        "'speaker_2': 'They'll be a good partner in this process.'",
        "'speaker_0': 'Thank you, Kelly, for that. And I have heard of the wonderful work that they've done outside of the city. And so I'm happy that we that they're going to be the ones doing this project to actually mayor. Before I continue, is there any way that we can see if there's public comment on this item?'",
        "'speaker_0': 'Sure.'",
        "'speaker_2': 'We can go to public comment.'",
        "'speaker_0': 'Is there public comment?'",
        "'speaker_2': 'There is. I believe there are.'",
        "'speaker_4': 'Yes. Our first speakers, Jonah Breslau.'",
        "'speaker_2': 'Hi. My name is Joan Breslau. I work at the Los Angeles Alliance for a New Economy, an organization dedicated to supporting good jobs and healthy communities. We agree that Project Homekey is a critical program in this moment. We need to do everything that we can to support getting people housed in off the streets and especially in non'",
        "'speaker_2': 'congregant facilities. During this terrible COVID crisis and the housing crisis that has been pre-dating COVID for so many years. But we cannot forget the hotel workers who are also struggling in this moment as unite here. The Hospitality Industry Union has estimated 80 to 90% of their members have been laid off due to COVID.'",
        "'speaker_2': 'And unfortunately, some of these hospitality workers may themselves be facing homelessness at this time. This council actually has not forgotten about these workers. And I want to thank you again for for passing a worker recall and retention law that will protect hospitality workers whose hotels continue to operate as hotels.'",
        "'speaker_2': 'But as we see in this situation, there may be workers who will not necessarily be covered. And even though we do think that, you know, perhaps that could be applied to this situation, we urge you to specify in the contract that former best Western workers be given the opportunity to work in any position that they might be'",
        "'speaker_2': 'qualified for. You know, as you mentioned, there are basic cleaning positions. There are also food service positions. And, you know, some of these workers may have skills for other roles as well. And so I urge you to include that in the contract so that we can all move forward together and protect both the hospitality workers and our'",
        "'speaker_2': 'houseless neighbors who need support in this time. So please keep those things in mind and please make those changes so that we can ensure that we are all safe. Thank you very much and take care.'",
        "'speaker_4': 'Thank you. Your next speaker is Mary Dawn.'",
        "'speaker_0': 'Hello. Casson members. An honorable man. Garcia. My name is Mary. You and a pastor and a faith organizer with Clergy and Laity United for Economic Justice, also known as COO. And I represent faith leaders and congregations connected through you in urging you tonight to ensure that the workers from this Western hotel will be brought back to work'",
        "'speaker_0': 'in this new project. I want to say thank you to the Council and Mayor Garcia for supporting the worker recall and retention ordinance last year to ensure that our workers in the hospitality and beauty services can return to work with businesses safely reopen again.'",
        "'speaker_0': 'And I commend you for doing the right thing in taking steps to provide safe shelter for our citizens with their homes. However, as we care for our folks with their homes, let's not forget our workers from the hotel who also needs good jobs to be able to pay rent and put food on the table for their children'",
        "'speaker_0': 'and families. And both both the folks without homes and the hotel workers are vulnerable and need protections from our city. So I ask the City Council to ensure the recall and retention ordinance will cover the hotel workers at best Western.'",
        "'speaker_0': 'And as people of faith, we believe that we are all interconnected as one family. So safety and flourishing depend on each other and not compete against each other. So your support to ensure the recall and retention of best Western hotel workers in this project is also your support for our community's health, safety and sustainability.'",
        "'speaker_0': 'Said This will help our city survive and move forward together in this health crisis. So I want to say thank you for the Council's leadership, and I urge you to require the contractor to bring back the hotel workers in this new project.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Give us one moment when we transition to the Spanish portion of public comment.'",
        "'speaker_2': 'Thank you. Okay, next, we have a different form of cancer for.'",
        "'speaker_4': 'Sorry, Vice Mayor. We have the Spanish speakers we're moving to.'",
        "'speaker_2': 'Our first speaker is Guadalupe Lopez. Well, I look at Lopez.'",
        "'speaker_4': 'Guadalupe Lopez.'",
        "'speaker_2': 'Well, I look at the.'",
        "'speaker_1': 'It went.'",
        "'speaker_0': 'Unnoticed.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_0': 'Well, I love the things, but I'm a heck of more accommodating and holding.'",
        "'speaker_2': 'Nora Lopez.'",
        "'speaker_3': 'And I worked as.'",
        "'speaker_2': 'A maid chamber at best Western in continuing.'",
        "'speaker_0': 'Um, but about her holidaying in Condo de los Angeles. Comparable in holidaying. But it's a little project. The home, he.'",
        "'speaker_2': 'Says in Los Angeles. Comprar A lot. Del BARCO but I think the home key but also see Daniel's back or holiday in. On the night.'",
        "'speaker_0': 'Um. I like the woman.'",
        "'speaker_2': 'So good at English? Yes. Interpreter will. Correct.'",
        "'speaker_0': 'Um.'",
        "'speaker_2': 'And you know, I said, you know, to go with this, you're learning lessons. Okay. This is my Lopez. Lopez. And she.'",
        "'speaker_3': 'Worked.'",
        "'speaker_2': 'For seven years holidaying. And the hotel was purchased by L.A. County for the Homekey program. Continue.'",
        "'speaker_0': 'I do believe that. And make more our day home. You may be the real appearance on the finale of The Guilt of Me Later.'",
        "'speaker_2': 'And then I was fired when the transition happened by the end of 2020.'",
        "'speaker_0': 'You know well, both of our hearts. And the one thought that our hard work we must battle for for corporatism is the idea for our local level. O Happy Warrior Project or Home t. They don't know. There are things that they want me to say, that I want that to be the end.'",
        "'speaker_2': 'And so I agree with the project. But the problem is that when we got fired, then people was some subcontracted. And so it would not be fair for our families to face a homelessness situation.'",
        "'speaker_0': 'One moment that I really want. That is over. Resort is a comparable hotel. It's a double barrel travel.'",
        "'speaker_2': 'So when they realized that the council bought their hotel in the county, then I was hoping to go back to work. Continuing.'",
        "'speaker_0': 'Estimated to back it. But I don't buy that unless you let all elements that are me early join me like at Idle Not a puzzle of me, small little me mocking my past. So I may have a set about how all of this you've been.'",
        "'speaker_2': 'So this month I had to either pay rent or support my daughter or feed my daughter. So I had to select and pick my daughter, of course. So I don't want other workers to face the same situation that I had to face.'",
        "'speaker_2': 'Continue watching.'",
        "'speaker_0': 'So there is a feeling that I could very well have ordered hope. But I had already run scared in. So I think that there is room for our humble on this empathy for.'",
        "'speaker_2': 'I ask that organization to record jobs. If those workers had lost jobs for so many years. I'm doing what?'",
        "'speaker_0': 'The idea that the little thing which is democracy.'",
        "'speaker_2': 'And that is on my comment and I thank you very much.'",
        "'speaker_4': 'Thank you. Our next speaker is Johanna monet.'",
        "'speaker_2': 'And this. Joanna Montanez. She sang it up with aplomb.'",
        "'speaker_0': 'Oh.'",
        "'speaker_2': 'Give me one minute, please.'",
        "'speaker_0': 'Alarming number of journalists recommended, including.'",
        "'speaker_2': 'Hi, my name is John and I worked as housekeeper at Holiday Inn. Continuing.'",
        "'speaker_0': 'Under the La Pandemia and Coleraine, but also in the settlement. And we look for other job. We decide either condo.'",
        "'speaker_2': 'And so the L.A. County purchased the property for the program and I was one of the.'",
        "'speaker_3': 'Workers that was fired.'",
        "'speaker_2': 'Due lot of that change. And I was never able to go back to work.'",
        "'speaker_0': 'We must pursue other people. Friends of a man together, Nicola Holmes, that we thought that.'",
        "'speaker_2': 'So was replaced by subcontractors when they realized that the County Board of Supervisors bought the hotel continuously in.'",
        "'speaker_0': 'But I almost hurt, especially in front of me.'",
        "'speaker_2': 'So we have been waiting for a telephone call in order to go back to work. I am currently pregnant and I am.'",
        "'speaker_3': 'Very concerned for my.'",
        "'speaker_2': 'Future and my family's future. Continuing.'",
        "'speaker_0': 'What they need in style. Yeah, they all matter. Nokia. Oculus, Barcelona, PS4. Yeah, yeah, yeah. That was the most terrible holiday.'",
        "'speaker_2': 'So I am about to very close to becoming homeless. I don't want this to happen to people. The same things are happening to me. Continuing.'",
        "'speaker_0': 'It was a little trouble, huh? I lost my virginity with. Look at those two samples.'",
        "'speaker_2': 'So I would ask the organization to record this, just to bring the jobs back to those people that want to work. We want to work and support our families. That is all my comment. Thank you very much. Thank you.'",
        "'speaker_4': 'Our next speaker is Nydia Cardona.'",
        "'speaker_2': 'Near Nicholson.'",
        "'speaker_0': 'And I just.'",
        "'speaker_2': 'See, I learned this and yet I put out a.'",
        "'speaker_0': 'Number of media card on that. But I like the camera and I am Holliday. Duran, the Quattro I you.'",
        "'speaker_2': 'Hello. My name.'",
        "'speaker_0': 'Is.'",
        "'speaker_3': 'Kapo.'",
        "'speaker_2': 'Now, and I worked as a housekeeper holidaying. Continue.'",
        "'speaker_0': 'And now I have forgotten one young and holy name and then holy name, I don't think suddenly. And so the thought of how my good.'",
        "'speaker_3': 'So I worked for four years, for.'",
        "'speaker_2': '40 days, and then L.A. County purchased that property in order to establish that program. They continue.'",
        "'speaker_0': 'Doing it. And I do I don't know how long they spend in that, you know, commitment and plus our taxes system.'",
        "'speaker_2': 'So I was one of the workers that was fired by the county, but then we were replaced by subcontractors.'",
        "'speaker_0': 'One woman said, It's one of those people we thought of. The brother looked at it, said, I don't know your mother, but a woman has.'",
        "'speaker_2': 'When the board of supervisor purchased property at the hotel, I was hoping for a telephone call to go back to work. But that never happened. Continue with.'",
        "'speaker_0': 'It better meet them in the end. But only a map of all buried travel. A map? Well, that I know. It's so important.'",
        "'speaker_2': 'They never call me back.'",
        "'speaker_0': 'Continuing to stand up for women in the military and.'",
        "'speaker_2': 'Say, I am struggling to cover the basic needs, like rent or even food.'",
        "'speaker_0': 'Continuing in esprit de corps, they were at the home again.'",
        "'speaker_2': 'So I agree with them. The goal objective of.'",
        "'speaker_0': 'Not have yet. Nobody ever says that. Proper familia. The circle of the division. The.'",
        "'speaker_2': 'So it shouldn't be the case where our families are about to become homeless. Continue.'",
        "'speaker_0': 'I still didn't know your mother.'",
        "'speaker_2': 'Till today, I did not receive any call.'",
        "'speaker_0': 'No Caracalla Barthelemy, my sister, I have noted that is the thing.'",
        "'speaker_2': 'I don't want the same to happen to these hotel workers right now.'",
        "'speaker_0': 'Yup. Yup. The list goes on, not the strava strava holiday skipper. I had sent up the info.'",
        "'speaker_2': 'So I asked this organization to bring back those jobs to the workers that worked for so many years. Continue.'",
        "'speaker_0': 'Mm. And then I had to look for the Myrtle Temple for the Journal.'",
        "'speaker_2': 'So I thank you all very much for taking the time to listen to us.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_2': 'All right. So we have a few speakers cued up. Let's go. And Council District two, Councilmember Allen.'",
        "'speaker_0': 'Thank you very much. Vice Mayor, I just want to say this is an important step to address homelessness and affordable housing in the city. I am grateful to the governor and our state representatives for the increased resources that they have provided to the local communities.'",
        "'speaker_0': 'I did get a letter from Unite Here 11 and I did have a call with them over the weekend. I definitely would like to see the language in this contract. Contract state the following. So I'd just like to make, you know, a friendly and I understand that this is a different business model and it's not a, a'",
        "'speaker_0': 'motel anymore. But I would like for you to consider this friendly that the receipt of this award and any of its subcontractors at the site provide the former workers of the best Western, the first opportunity to come back and work at any position that they are qualified for before they hire new employees.'",
        "'speaker_0': 'And we just heard from these speakers, these are hard times for everyone. And I would hate to see any one lose their jobs. And if they are qualified for any of these positions, I would definitely like to see them considered.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_2': 'Fantastic. Thank you. Max, do you have Council District six. Council member. Sorry.'",
        "'speaker_0': 'Yes, thank you. Vice Mayor. I also want to. You know, reiterate my gratitude for the support we have to be able to purchase this hotel for Project HOMEKEY and also just want to thank the many speakers that provided comment today about the job retention.'",
        "'speaker_0': 'And I also want to express the importance of having Project HOMEKEY in order to address our housing crisis as well as our homeless issue. But I also want to explore I actually wanted to see if this is I I agree with Councilmember Allen that we do need to figure out a way to support and retain workers.'",
        "'speaker_0': 'But I also want to ask staff if there's a timeline, a sensitive timeline. We have to move this item forward. As well, if you know. So I just want to make sure we consider the timeline as well. I yes, councilwoman.'",
        "'speaker_0': 'So we the further requirements of the state contract with us for this funding, this needs to open on by March 15th.'",
        "'speaker_3': 'So we are.'",
        "'speaker_0': 'Under a tight timeline, too, to be able to move.'",
        "'speaker_2': 'This forward.'",
        "'speaker_0': 'Okay. And I don't you know, I'm not sure if I'm able to offer another friendly or a friendly to the friendly. Given the timeline we have. But I'm just wondering and maybe we could do a report back on city efforts to retain existing workforce.'",
        "'speaker_0': 'Given the time sensitive nature of ensuring that we retain this contract opportunity to be able to move it forward. And Councilmember the you know, we were able to work with the Pacific Gateway and we offered everybody who was working on the site an opportunity to work with Pacific Gateway for additional supports in in finding jobs.'",
        "'speaker_0': 'We were also able to provide assistance to the two people who were living on site. One has already received another job and the other is has decided to move. So we have reached out. We have been working to connect them.'",
        "'speaker_0': 'We're certainly happy to forward the names.'",
        "'speaker_3': 'Of those who.'",
        "'speaker_0': 'Have not been able to find other employment through other best Western opportunities or through the specific gateway to the Illumination Foundation for, you know.'",
        "'speaker_2': 'For opportunity as they are coming in.'",
        "'speaker_0': 'And we will be able to get a I guess then a report back in 30 days on those existing workers that might not have a position at the moment just to ensure that they do get have opportunities provided for them.'",
        "'speaker_0': 'Yes, we'd have to reach out to Best Western and see and.'",
        "'speaker_3': 'Learn of.'",
        "'speaker_0': 'Their willingness to share that information with.'",
        "'speaker_2': 'Us. But we're certainly.'",
        "'speaker_0': 'We.'",
        "'speaker_2': 'Can certainly report back.'",
        "'speaker_0': 'Thank you. Thank you. Vice Mayor, I may have a chance to address the two friendlies. First off, I wanted to also make it clear. Well, first of all, I wanted to thank everyone who participated in the public comments today.'",
        "'speaker_0': 'I think it's very important to do so and to voice your opinions and give you a regulator that's going to ask you to give back the final aprobado to say experiences on on Project HOMEKEY. Is that that is someone to ask versus a thumbnail sketch layered on.'",
        "'speaker_0': 'I also wanted to make. You know, maybe and maybe you can help me clarify this, but I wanted to make a clarification that Project Homekey and Project Roomkey are two very different, but yet with similarities projects. And that Project Homekey is, is something that was, is a building that was purchased by the L.A. County.'",
        "'speaker_0': 'And this is our own our own long the city of Long Beach is home project. And if you could clarify that as well quickly. Yeah. So there there are three project Homekey sites purchased in the city. Two were purchased by L.A. County.'",
        "'speaker_0': 'And then we purchased this best western site.'",
        "'speaker_2': 'So the Holiday Inn site and.'",
        "'speaker_0': 'The Motel six site were purchased by the county. And we were not privy to, you know, their operations from that point. This is the one site that our city purchased, and we.'",
        "'speaker_2': 'Have.'",
        "'speaker_0': 'Been working to connect people in terms of the ability.'",
        "'speaker_2': 'For further employment.'",
        "'speaker_0': 'I think you and I really appreciate that. That I really appreciate you taking the F word and connecting everyone with, like I said, the gateways. I think that shows really good initiative on our side. You know, I think that with the community with asking for and what Councilmember Allen and City were probably alluding to is something like'",
        "'speaker_0': 'a peace labor agreement. But I wanted to hear from staff how how if that was feasible in this particular situation, especially going into this with a nonprofit organization.'",
        "'speaker_4': 'The City attorney. The answer to that question is no. That would not apply to this nonprofit homeless shelter operation.'",
        "'speaker_0': 'Thank you. Thank you, Charlie, for that. With that, I know that we I think that it would be nice to share with us your efforts in a report that give, you know, the retention or the intentions of the retention of the workers, at least in our project.'",
        "'speaker_0': 'So I you know, so maybe I'd like to accept that as a friendly. Hopefully that can come back in 30 days if that is not going to start the process of moving this item forward. City staff. We can we can certainly support the.'",
        "'speaker_0': 'We can come back in a report.'",
        "'speaker_3': 'From the efforts that.'",
        "'speaker_0': 'That we've made.'",
        "'speaker_2': 'Through this process in.'",
        "'speaker_0': 'Connecting any staff.'",
        "'speaker_3': 'From the.'",
        "'speaker_0': 'Previous best Western Hotel to the opportunities.'",
        "'speaker_2': 'That that could be available through the Elimination Foundation.'",
        "'speaker_0': 'We can bring that back.'",
        "'speaker_3': 'As long as we can move that forward.'",
        "'speaker_2': 'Then that would.'",
        "'speaker_0': 'Also allow us to align with the March 15th requirement that we need to open. Thank you. Kelly. Yes.'",
        "'speaker_2': 'Thank you. Next grades council. Thank you. I appreciate the conversation on this. But I really am excited, too, to enter into this agreement and and accept the funds for the project homekey that will house and increase our bed capacity for those experiencing homelessness in our city.'",
        "'speaker_2': 'And that has been a priority for us for some time. It is really unfortunate that this is comes in conflict with the with the workforce and jobs in our city. But I do think that the conversation is definitely headed in the right direction.'",
        "'speaker_2': 'I support us to the best extent possible. Retaining workforce of four positions that qualify for recognizing that, you know, this budget for operations is, you know, just over $2 million. It's not a lot of money, clearly not a lot of jobs.'",
        "'speaker_2': '17 full time employees to manage the program. I wanted to ask and that raises the question, what will these employees be doing? Do we have an idea or a breakdown of the positions that will be required to operate such a site?'",
        "'speaker_2': 'I guess the question is for the health director, Miss Colby.'",
        "'speaker_0': 'Yes. I don't.'",
        "'speaker_2': 'Have.'",
        "'speaker_3': 'You know.'",
        "'speaker_0': 'Specific numbers for each for each thing that they'll be doing, but there will be onsite site monitors. So those who are living on site.'",
        "'speaker_3': 'And available 24.'",
        "'speaker_0': 'Over seven, there'll be case management.'",
        "'speaker_2': 'Staff.'",
        "'speaker_0': 'Will be engaged as well. Transportation, some of these maybe subcontracts, others will be on site. And I don't I don't have the proposal in front of me to be able to.'",
        "'speaker_2': 'Do that, but I can provide you.'",
        "'speaker_0': 'Additional information. So transportation and food service and our food service that we do is generally by contract, by subcontract to.'",
        "'speaker_2': 'Folks to provide the food service. Then we'd also have.'",
        "'speaker_0': 'Security and then basic screening services. But I don't know how many fall into each one, so I would have to come back to you with that.'",
        "'speaker_2': 'Well, won't there be mental health support? Social workers associated with this contract. Yeah. So that's. Yeah, that's.'",
        "'speaker_0': 'Connected. So the connection to these, to those services through the case management will be there.'",
        "'speaker_2': 'So they'll have.'",
        "'speaker_0': 'Access to all.'",
        "'speaker_2': 'Those different providers. And that will be included in the 17 full time employees. Those services?'",
        "'speaker_0': 'No, not necessarily. So that in many cases we have other providers as well. So some of those may be on site as part of the staff. We don't actually have we don't.'",
        "'speaker_3': 'Have a breakdown.'",
        "'speaker_0': 'Right now, but I can get back to you. But then we also have a number of through their folks that they have other.'",
        "'speaker_2': 'Services.'",
        "'speaker_0': 'Other providers within the city and area, different areas to be able to provide those services.'",
        "'speaker_2': 'So I'm not sure that all of those folks fit within the 18. Okay. And then my last point is those 17 full time employees that will be hired to manage the program. It does say that it may potentially provide employment for up to 17 full time employees residing in the city of Long Beach.'",
        "'speaker_2': 'And so I think that's very important. Let's make sure that that that is an aim or a goal as well that we meet. Thank you. Yep. Thank you. Thank you. Council member. Council member. Frank.'",
        "'speaker_0': 'Very much so. I. I don't have too many comments on this particular project, but I do get very excited every time I have an opportunity to talk about the project, home key project that is in my district. The one in my district is a county run project.'",
        "'speaker_0': 'And so the city wasn't very involved in it by it. But I imagine from an operational standpoint they'll have a similar model. Our project was a Motel six conversion and there's approximately 40 rooms there and I've been onsite to visit.'",
        "'speaker_0': 'And I can tell you that the nonprofit that took over that Operation Serenity did retain some of the employees from the Motel six, and they have found that that was a very positive thing for them. So to the extent that that experience is relevant for the nonprofit operator that will be operating this site, I would encourage a'",
        "'speaker_0': 'connection between the two of them because it was really nice to see the former Motel six employees working at the location when I went to visit and they were obviously very grateful for the continued work. But also the work as is, is really meaningful in a different way given the the scope of their responsibilities and what their'",
        "'speaker_0': 'mission is as a whole in that nonprofit. And so I thought it was a very nice way to expand upon the previous employment that the motel workers had, but also to provide them new exposure, new skills, so that they're able to advance themselves professionally through working with a nonprofit that has a different operational model, obviously, than the'",
        "'speaker_0': 'motel did. So to the extent that that's relevant, I wanted to share that that is a very successfully happening happening at other Motel six site. Now, like the legality of imposing that as a requirement, I don't know. This is really the first time I'm hearing that conversation and dialog with our city attorney.'",
        "'speaker_0': 'But from our operational standpoint, I think that it's it's really very positive. And my understanding that is that the were the employees that were retained at the Motel six were retained at the request of Supervisor Hahn's office, who worked with the nonprofit, to ensure that that as many people as possible could retain those jobs and have some'",
        "'speaker_0': 'continuity in their knowledge of the operations of that site. So I'm really grateful to Supervisor Horne and to their staff, because the roll out of that project was fantastic and the operations have been really great. And I mean, there's 40 people who are no longer living on the streets as a result of that site.'",
        "'speaker_0': 'And I'm really proud to have that in my district because I think it's being part of the solution. And I and I really look forward to more of these sites as one of our solutions to providing long term transitional housing.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_2': 'Thank you. Councilman, your anger. Thank you. Is there a guarantee of this whole topic? Is the fact that while creating some some housing for homeless and displaced workers who are creating. All this have displaced workers. So I would like to see that this move forward with the friendly amendments it's okay with that councilmember said that she would'",
        "'speaker_2': 'accept the friendlies and told supporters of this home with friends. Thank you very much. Thank you. So I'll add my comments here. And then we have some some folks in the up again. So just just to clarify and talk through a few things.'",
        "'speaker_2': 'I'm going to ask Director Colby a few questions. So so first. Tell me a little bit about and I'm familiar with this, but I want to I just want to explain this a little bit more publicly once this hotel was acquired.'",
        "'speaker_2': 'Is it ever going to become a hotel again? Is that within the agreement or what is the future of this property?'",
        "'speaker_0': 'No. And what just is, is that for the next two years, it will run as an interim housing site, otherwise known as a non congregate sheltering site for the state. From there, our goal would be to either continue this model or move it to a permanent supportive housing opportunity that would operate.'",
        "'speaker_2': 'More like a supported.'",
        "'speaker_0': 'Apartment complex.'",
        "'speaker_2': 'Thank you. And what is the date that we have to have this facility open? March 15th of this year. Okay. So and so there are significant timing considerations on where we have to move forward this contract. The other thing I would say is.'",
        "'speaker_2': 'You know, I get the gist of it. The gist of it here is these motels are being acquired very quick period of time. State came out with the guidelines. We our staff is doing a great job acquiring these hotels and no one wants to do this in a way that it is unintended consequences or that we are'",
        "'speaker_2': 'impacting these workers. So I support the friendly amendment. Asked after you know take a good hard look at our efforts to ensure that there are, you know, recall you know, retention provisions to make sure whatever if there's a janitor that was at the hotel, there's likely going to be a janitor at the permanent supportive housing facility.'",
        "'speaker_2': 'You know, someone's been working at that site. Let's make sure this person gets to keep their job as best as we can. And those are the things we expect. You know, we hope that staff can, you know, think about more outwardly, talk about as we move forward.'",
        "'speaker_2': 'But I'm going to support the motion that's in front of us. And I think we've already done public comment. You know, we have more council comment. Let's go to councilman. Looks like council members and is next. But vice mayor.'",
        "'speaker_4': 'May this is city attorney. May I ask for a clarifying question before we go back through.'",
        "'speaker_2': 'Again or go forward? Thank you. I have the.'",
        "'speaker_4': 'Motion to approve staff's recommendation with. There's been two friendlies requested. One, I believe, has been accepted. And that is a to receive a report from staff on the former hotel employee workers within 30 days or 30 within 30 days.'",
        "'speaker_4': 'The second friendly, I'm not sure, has been accepted. And I believe if I heard it correctly, I was from Council District two, which requested additional or a change in the language be added to the contract that the recipient of the award and any of its contractors at the site provide former airport workers from the best western.'",
        "'speaker_4': 'The first opportunity to come back to work at any position they're qualified for at the location before any new employees are hired. Because of the timing, this contract has been shared and negotiated with the proposed vendor in anticipation of tonight's action by the Council.'",
        "'speaker_4': 'We could certainly ask them to consider that, but I'm going to need direction that if they decline and the short deadline, we need to know whether we should move forward with the contract or what the council wishes to do if they say no to the friendly, if it's been accepted.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'All right. Thank you. Mr. Perkins. Thank you very much for asking for the clarification. I did a set, the first friendly I think that the second primary right now is not feasible. But I think that the intent is to make sure that we, you know, highlight the efforts that we are doing as a city to try to'",
        "'speaker_0': 'help those who are going to be maybe losing their jobs as previously had, quote unquote, with the best list, or if that clarifies it for you.'",
        "'speaker_2': 'So it sounds like council members and they have accepted the report and the way that you describe it, I think Charlie way you described it was just about these workers. I think the report you want to we want to understand that this is efforts that the city has done to ensure that they can be retained.'",
        "'speaker_2': 'And and is that right? Council member and they have been council member through.'",
        "'speaker_0': 'Yes. Yes, that's okay.'",
        "'speaker_2': 'Are you clear, Charlie? Yes. Thank you. Okay. We'll move on. We have Councilman Austin back. Thank you. I think most of what I wanted to get cleared up has been cleared up. But I did have one question that I think I know the answer to.'",
        "'speaker_2': 'And it's for the city attorney in purchasing the motel or the best Western. You know, I'm assuming that there was a labor agreement with the previous owner. Did or did the contracts have successor agreements to ensure that that the workers would be protected?'",
        "'speaker_4': 'Councilmember Councilmember. I don't have that information. Taylor Anderson's on the line also. I don't know if Taylor does.'",
        "'speaker_0': 'I do not have that information off hand. I can definitely try and find it right now. Well, the council continues to discuss them.'",
        "'speaker_2': 'Okay. Well, okay. Thank you. Thank you. I was just curious. I think I know the answer to that, but. But I just wanted to get clarification on it. I support what's on the floor.'",
        "'speaker_4': 'The mayor and council. This is Tom. And we are getting a sense that most of the employees did have the ability through Best Western to have ultra employment at their other sites. We've also connected a number of them with workforce development.'",
        "'speaker_4': 'Something we've done in the past is we have requested interviews for anybody who did not have other opportunities to at least be able to interview with the group and see if there's a fit. We find that is people are a little bit more willing to do that if there's a process that they are able to see if'",
        "'speaker_4': 'that that employee is a good fit. So we'd like to be able to offer that as well for the ones that are remaining or that we do at this point think it's not that many that were impacted.'",
        "'speaker_2': 'Okay. Thank you. And it's my last comment. This this is a this is an item that I think we should be celebrating. Again, we're creating rooms in capacity to house folks who who don't have homes, who don't have shelter.'",
        "'speaker_2': 'This is this is something that we should be moving with urgency on. And and, you know, we've, I think, put a lot of conversation into this item this evening. Obviously, you know, we want to take care of our workforce and those who have lost their positions due to the pandemic.'",
        "'speaker_2': 'But at the same time, I would have appreciated being. They reached out to buy, buy, buy some of these folks because this is kind of taken me off guard. And had I had I had an opportunity to tend to prepare, I would have been been able to look into this matter a little bit more.'",
        "'speaker_2': 'So thank you very much for the robust conversation and congratulations council members and De Haas and the entire council for moving this item. Thank you.'",
        "'speaker_3': 'Thank you. I just want to this is Mary Garcia. I know that that has concluded the both the public comment and the council comment. So I just want to just to add, there is a motion on the floor and I wanted to add just more, more broadly speaking, that we are of course, this is this project is'",
        "'speaker_3': 'part of a much larger state effort of working to house people, experiencing homeless people that are trying to get into transitional housing. And I also want to just uplift the work of the state and the county in getting this project across the finish line and for their partnership.'",
        "'speaker_3': 'But really the Long Beach Health Department, who I know put in a proposal to get this done. And I'm also grateful to Governor Newsom and his team, who's worked with the city to ensure that we get these projects done in Long Beach.'",
        "'speaker_3': 'And I want to thank both, of course, customers in Dallas for kind of ensuring that we get back more information as well to sure that we're doing right by workers and jobs. So I think all of this is important.'",
        "'speaker_3': 'And I want to thank everyone for their work on this roll call vote, please.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'Filed.'",
        "'speaker_1': 'Councilwoman Allen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price, I. Councilman Sabina.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman Mango. I transwoman sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member oranga.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'And.'",
        "'speaker_1': 'Bush and Kerry.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a Fourth Amendment to Contract No. 34342 with Plenary Properties Long Beach, LLC, of Los Angeles, CA, and any other documents or agreements necessary, to address COVID-19-related impacts to the Civic Center Project and to allow for the completion of Lincoln Park construction and the demolition of the old City Hall;  Authorize City Manager, or designee, to execute an amendment to Contract No. 33444 with ARUP North America Limited, increasing the contract amount by $180,000 for additional services associated with support of the Civic Center Project Phase II and Lincoln Park operations, in a revised total amount not to exceed $11,461,545, and extend the contract term to February 15, 2023;  Increase appropriations in the Civic Center Fund Group in the Public Works Department by $1,250,000, for the revitalized Lincoln Park, offset by a transfer of revenues from construction and development funds totaling $1,250,000 in the Development Services Fund Group in the Development Services Department;   Increase appropriations": [
        "'speaker_3': 'Thank you. Item 14, please.'",
        "'speaker_1': 'Item 14 Report from Public Works. Parks, Recreation and Marine. Recommendation to execute amendments to contracts with winery properties. Long Beach and Arab North America to address COVID19 related impacts and for additional services associated with support of the Civic Center Project Phase two and Lincoln Park Operation District two.'",
        "'speaker_3': 'Okay. Let's kind of briefly go to this presentation, Mr. Mayor.'",
        "'speaker_4': 'Thank you, Mr. Mayor. This is an exciting project we want to talk to you about. Want to show you the kind of updated design for the Lincoln Park that is part of our public private partnership. It is the last major piece of the public improvements that needs to be done for that agreement.'",
        "'speaker_4': 'And we're getting pretty close to moving forward to getting that started. So we'd like to go through that for you today and then also talk to you a little bit about the next steps for the demolition of City Hall and then hopefully the subsequent private development that will come on that site in the pending future.'",
        "'speaker_4': 'The Eric Lopez will give a staff report.'",
        "'speaker_3': 'Thank you, Tom. An honorable mayor and members of the city council. We're ready to proceed with construction for Lincoln Park and the demolition of the Old City Hall. Next slide. We've worked really hard on the side plan and on the different activation elements for this park.'",
        "'speaker_3': 'We're going to be providing opportunities for for dog owners at the new dog park. There's going to be a playground, a field, a basketball court, fitness equipment and an outdoor reading room and other elements focused on activation. Next slide, please.'",
        "'speaker_3': 'Shown here on the screen is a rendering of a nighttime shot. We've designed this park with the ability to be.'",
        "'speaker_2': 'Activated as.'",
        "'speaker_3': 'An 18 hour park.'",
        "'speaker_2': 'We know that.'",
        "'speaker_3': 'Costs money and we're working hard on the operations and maintenance plan and will be returning to council prior to the end of construction on on that on that plan and on that strategy. But we wanted to really make sure that this park had something for everyone and that it could be active not just in one element, but'",
        "'speaker_3': 'in multiple elements at the same time, and that it would have the opportunities for special events and that there would be synergy between the new library to the north and and the adjacent a park. And in the future with the block development, we're looking for connections.'",
        "'speaker_2': 'To the West as.'",
        "'speaker_3': 'Well.'",
        "'speaker_2': 'Next slide, please.'",
        "'speaker_3': 'This is the view from the. From the front, the corner of Ocean and Pacific, and it shows one of our art components. To the left, you can see the library. In the back, you can see the activity within within the park.'",
        "'speaker_3': 'This is one of a couple of renderings that we will.'",
        "'speaker_2': 'Quickly show you.'",
        "'speaker_3': 'Next slide, please. She has a rendering of the playground at at nighttime. This is just a rough rendering we're still working on on refining some of the color elements to to make it pop.'",
        "'speaker_2': 'But we're really happy about the effect.'",
        "'speaker_3': 'During the nighttime and really making this a a.'",
        "'speaker_2': 'Lively.'",
        "'speaker_3': 'And cool place for people and kids to to play and just interact at night with with their families.'",
        "'speaker_2': 'Next slide, please.'",
        "'speaker_3': 'We've identified multiple locations for public art in addition to the two, the Lincoln Memorial and the reading area, and to the link in our piece on Ocean Boulevard. These to our areas shown in this slide are going to be areas where we're going to be focusing on working with our arts communities to really develop sculpture art that'",
        "'speaker_3': 'can really help with the what our goal of activating the space and making this an iconic area. Next slide, please. We haven't designed the art, but we have developed the size and the scale and we want this to have a wow factor and this as well as we're ready to go through this process of developing the design'",
        "'speaker_3': 'of these sculptures.'",
        "'speaker_2': 'And we really.'",
        "'speaker_3': 'Want to.'",
        "'speaker_2': 'Work with our.'",
        "'speaker_3': 'Local artists to help them take a lead role with this component and really help us make this park great. Next slide, please. This is the view from the corner of Pacific of Ocean and Cedar. And you can again see the sea, the library in the background, see the playground and just different elements, different areas for people.'",
        "'speaker_4': 'To to.'",
        "'speaker_3': 'Interact at. Next slide, please. In addition to proceeding with construction of Lincoln Park staff, is proposing to proceed with the demolition of the Old City Hall concurrently. Like in other areas within our organization, the COVID pandemic has negatively impacted the Civic Center project.'",
        "'speaker_2': 'The sale and development of the MID-BLOCK has been significantly delayed, which has caused problems at the at the site.'",
        "'speaker_3': 'That early demolition would.'",
        "'speaker_2': 'Help us address. Next slide, please. This concludes staff's presentation.'",
        "'speaker_3': 'And we stand ready to answer any questions. Thank you. Thank you. Mr. Lopez, before I turn this over to Councilman Allen, I want to make just a couple of brief remarks. This is, of course, going to be just a a spectacular park in the city of Long Beach.'",
        "'speaker_3': 'Really impressed with the work that the architects and the designers and our public works team put in place for the park. I want to just also just share one. I absolutely love that the. But the designers of the park really kind of took this idea of building some kind of special moments and spaces in the park of'",
        "'speaker_3': 'significance. And I think that speaks to the opportunity for those large art pieces and really to that just amazing piece that will be the the Lincoln Penny. And I imagine that that that a piece like that done the right way will become an instant overnight hit from an art perspective and the way that you connected that to'",
        "'speaker_3': 'the idea of Lincoln Park. Yet it also harkens back to the idea of of of the bike and of of of what was there before and the penny arcade. It's the whole thing, honestly, is amazing just the way that at least that's what I interpret from that Penny and the Lincoln on it.'",
        "'speaker_3': 'So I think it's just it's just pretty phenomenal. And I can guarantee you that you're going to have an endless stream of Long Beach residents and visitors posing in front of that large penny, taking endless pictures. And, you know, it will be a probably one of our most Instagrammed moments and sites across the city and so very'",
        "'speaker_3': 'well done on the park. Look forward to seeing it completed. And I just I love the attention to art that was placed in the park and the history that that that Lincoln still is spoken to at the park as a as a, you know, obviously.'",
        "'speaker_3': 'One of the greatest presents that we've ever had here in our country. And so thank you for still continuing to honor President Lincoln, which I think is really important and in a very unique way. Councilwoman Allen.'",
        "'speaker_0': 'Thank you, Mayor. I was so excited to get the report on Lincoln Park. And as you all see, it just has something for everyone. I love, love, love the playground with the black lights. And I can just see that there are going to be so many kids that are going to enjoy that.'",
        "'speaker_0': 'And the basketball courts. I love that. I was literally cheering. I love basketball courts. In fact, I was down at the I don't want a parallel like basketball courts over the weekend. And it's just so wonderful to see the families and children, you know, engage down there.'",
        "'speaker_0': 'And they even had some of the break dancers with music. And it just remind me, you know, back in the days when I was in high school here at college, just what these parks do and how they bring people together and create, you know, community.'",
        "'speaker_0': 'So I'm just so excited about this. Lincoln Park is going to be a gem. And our city, the planners did such an amazing, just amazing job on this. And I just cannot wait to see it completed. So thank you so much for this report and just I really appreciate this and excited about it.'",
        "'speaker_3': 'Thank you. And councilman's in the house.'",
        "'speaker_0': 'Congratulations. Council member Alan on this amazing park. I'm so excited. Of course, reactivating this green space in downtown Long Beach is going to be phenomenal for all of our residents, including the First District residents. So I can't wait to see you support this item.'",
        "'speaker_0': 'So again, congratulations.'",
        "'speaker_3': 'Thank you. And Councilman Allen, there was a motion.'",
        "'speaker_0': 'Yes, Mayor. That was a motion.'",
        "'speaker_3': 'In conference in the House. That was a second.'",
        "'speaker_0': 'So.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'I do not think I see public comment on this item. So with that, was there a roll call vote?'",
        "'speaker_1': 'Councilwoman Zendaya's. Councilwoman Ellen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Pryce.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Councilwoman. Mongo. I as woman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Alston. I Vice Mayor Richardson.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Motion k.'"
    ],
    "Recommendation to request City Attorney to prepare a resolution by the first week of March in support of the certification and publication by the National Archivist of the State of Virginias ratification of the of the Equal Rights Amendment (ERA), in addition to support for the joint resolution introduced in Congress on January 21, 2021 to eliminate the arbitrary deadline towards full constitutional ratification.": [
        "'speaker_3': 'Thank you very much. Our next item, please, which is item number 15.'",
        "'speaker_0': 'Item 15.'",
        "'speaker_1': 'Communication from Councilwoman Mango. Councilwoman Sunday has Councilwoman Allen and Councilwoman Price recommendation to require city attorney to prepare a resolution in support of congressional ratification of the Equal Rights Amendment.'",
        "'speaker_3': 'However, most of my councilman. Mongo councilman.'",
        "'speaker_0': 'Thank you. Many know the story of the era, and it has gotten additional attention recently with the television series that recently came out. I think it is time that we as a city work towards the bipartisan support of the era.'",
        "'speaker_0': 'I'm glad to be supported by, I'm sure, all the women on the council. We had four of us on the item, but that's only because of Brown after restrictions. Otherwise, I know all of us would have been on it and I am so thankful to the partnership with the community.'",
        "'speaker_0': 'We've communicated some opportunities and we hope to celebrate this and many other big victories for women during Women's History Month in March.'",
        "'speaker_3': 'Councilwoman Price.'",
        "'speaker_0': 'Mayor. And I want to thank Councilman Mundo for bringing this item forward and for asking me and some of our colleagues to sign on to this item. I'm very, very pleased to support this item. And I think that over the years we've taken.'",
        "'speaker_0': 'We've taken the opportunity so many times as a council to talk about disparities with both gender and racial, ethnic and financial disparities. I guess it's more than just both, but many disparities that we have recognized as as a council in our city.'",
        "'speaker_0': 'And I think that we continue to talk our talk about gender equity and celebrate the progress that we have made for women both in the city but also around the country. And efforts like this continue to celebrate the progress, but remind us that we still have tremendous ways to go.'",
        "'speaker_0': 'And I'm grateful that the city has raised this issue as as one of focus. I know that I have brought an item forth a few years ago, and we worked with Cal State Long Beach to identify some of the the gaps and our in our services and our programing and the things that we need to do as'",
        "'speaker_0': 'a city to recognize and celebrate gender equity and make it at the forefront of our efforts, as we do with with all issues of equity. So I'm grateful to have signed on to this item and to be joining so many others in supporting this this particular policy action.'",
        "'speaker_0': 'So thank you very much. And thank you to Councilwoman Rondo for bringing it forth and for connecting us all on this very important topic.'",
        "'speaker_3': 'Thank you, Councilman Allen.'",
        "'speaker_0': 'Yes, thank you, Mayor. I'm just. What a great item. And I also want to thank all the council women, Mango Price and Zane de Hoff. And I know that all the women on this council or at this. Neither women or woman or sex are words that appear and constitution.'",
        "'speaker_0': 'And this definitely reveals the limits. Our Founding Fathers had an understanding of women as equal citizens. This meant that one of the things that this does that went that. Sorry, I just muted myself. And that meant that people of color were regarded as less than full citizens.'",
        "'speaker_0': 'So ratifying this era would confirm that sex discrimination is inconsistent with the nation's core value of equal protection under the law. And one of the things that this does, it sends a clear message about our national commitment to the equal right of all people.'",
        "'speaker_0': 'I want to say just a quick thank you and appreciation to Zoe Nicholson, who was a second District resident and sits on the Human Relations Commission. She's just been steadfast and committed to women's rights, and I know she immediately reached out when I got elected.'",
        "'speaker_0': 'And and I just want to thank her for her dedication to equal rights for women and commend her for her lifetime work. And thank you, Councilwoman Mungo, for bringing this forward. I appreciate it.'",
        "'speaker_3': 'Thank you, customary, Ringo.'",
        "'speaker_2': 'Thank you, Mary. And I want to thank all our female cast members for supporting this, to bring it forward. But I would say that if I were invited, I'd be right there working for right in front of it as well with you guys that I think that this makes the city proud again.'",
        "'speaker_2': 'But we at the forefront of these kinds of issues and certainly have my support. We've always had my support at any time that I could be there. I'm ready. So thank you very much to all councilmembers. Support this forward and looking forward to it.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. Wanted to chime in offer my my strong, solid support for this resolution. Look forward to adopting. And I think it sends a good, strong message that, you know, Long Beach is on the right side. We have a council full of, you know, proud, dynamic, educated female leaders, women who are ensuring that we are on'",
        "'speaker_2': 'the right side of history here and acknowledging this important resolution and the era. And so I'm happy to sign on and I'm happy to vote and support and look forward to when this comes back to council.'",
        "'speaker_3': 'But Councilman Van De has.'",
        "'speaker_0': 'Thank you, Major. Thank you very much to Councilwoman Mongo for bringing this item forward and for inviting me to. Beyond this item, I am more than honored to support this item. This legislation in Congress is so, so important, and it really is the last thing standing in the way of that.'",
        "'speaker_0': 'You are a being enshrined in our nation's constitution. This is long, long overdue. And I'm so glad that Long Beach will have taken our place standing on the right side of history with all of the amazing activists that have made this possible.'",
        "'speaker_0': 'We still have so much ahead of us to bring an end to gender discrimination, but adding that great to our Constitution is such a powerful step forward, and making making that possible is going to be amazing, not just for ourselves, but for all of the amazing woman who worked so hard to achieve this and the many who'",
        "'speaker_0': 'didn't live to see this bill come to fruition. So thank you again. Council member Mongo.'",
        "'speaker_3': 'Councilwoman Sara.'",
        "'speaker_0': 'Yeah. I also want to thank all of the council women for bringing this item forward and want to thank Zoe Nicholson for being such a staunch advocate for making sure that this is just a priority for us as a majority council women.'",
        "'speaker_0': 'And it's also just really symbolic as well that we also have our first female vice president. So this is just so meaningful and such as, you know, one of the very many step forward in ensuring that we have gender equity.'",
        "'speaker_0': 'And so for that, for many of those reasons, then I staunchly support this item.'",
        "'speaker_3': 'Thank you. Yeah, absolutely. Absolutely. Support this item. It is far past time. So thank you to everyone involved. And I'm glad that Zoe Nicholson was also mentioned because she has been leading this effort across the city and really doing great work.'",
        "'speaker_3': 'So thank you to to her. Is there I believe we do have public comments. I want to go do the public comment on this item and then we'll go.'",
        "'speaker_0': 'To here, if you wouldn't mind.'",
        "'speaker_3': 'What am I to do?'",
        "'speaker_0': 'I can modify my emotions slightly.'",
        "'speaker_3': 'Oh, sure. Councilman Mongo. Absolutely. Go ahead.'",
        "'speaker_0': 'Thank you. And we asked for community feedback and received some after the agenda item had been filed. And so we wanted to also modify the motion to include sending a letter to the national archivist that the City of Long Beach supports the publication of the 38th state.'",
        "'speaker_0': 'So if that could be noted, for the record, we'd like that letter of support sent should this pass, as I hope it will.'",
        "'speaker_3': 'Sure thing. It's added to the motion public comment, please.'",
        "'speaker_4': 'Our first speaker is Zoe Nicholls.'",
        "'speaker_0': 'Thank you very much. This is Zoe Nicholson, and I'm barely able to speak. Uh, how fabulous to hear my name spoken by several of you. Um, I'm really proud of that. Um, I am bursting with pride that after bringing the array to council several times, uh, actually, council came to me.'",
        "'speaker_0': 'Um, the fact is, since Michelle was Paul wrote it in 1923. Today, right now, in 2021, we are the closest to passing it we have ever been. And I want to tell you why. It's because in 2016, something really significant changed.'",
        "'speaker_0': 'And that was women started running for office at every level, at every turn, and women were elected. Nevada elected a majority of women into their state legislature. And then African-American veteran and state senator Pat Spearman organized Nevada and broke through that mountain.'",
        "'speaker_0': 'And Nevada ratified in 2017, thus becoming number 36. Their attorney general certified it, and the archivist in Washington published it in June of 2018. Illinois ratified and again their A-G certified and the archivist published it. In January 2020.'",
        "'speaker_2': 'Because.'",
        "'speaker_0': 'Of a majority of women elected to the legislature in the state of Virginia.'",
        "'speaker_2': 'They completed their.'",
        "'speaker_0': 'Requirement of a full majority of 38 states. I'm proud to say I was in the balcony when it happened.'",
        "'speaker_2': 'The Virginia.'",
        "'speaker_0': 'A.G. certified. And the national archivist got a call. From Bill Barr at the behest of President Trump to stop the publication of the Equal Rights Amendment. And David Ferraro, the national archivist. Is waiting for the green light. And you may know that both President Biden and Vice President Harris have committed to the Equal Rights Amendment.'",
        "'speaker_0': 'Your letter of support joins with city state citizens, urging this new administration to direct the National Archives, David Farrow to publish that last 38 state and thus adapting the Equal Rights Amendment as the 28th Amendment to the United States Constitution.'",
        "'speaker_0': 'I want to say this is great news for all your daughters, your mothers, your sisters, your aunts, and actually all Americans, regardless of sex. Together, we will finally have equal rights.'",
        "'speaker_4': 'Thank you. Our next speaker is Marcella de Rivera.'",
        "'speaker_0': 'Am I still.'",
        "'speaker_2': 'On?'",
        "'speaker_0': 'We will have equal rights under the.'",
        "'speaker_2': 'Marcelo Rivera. They came back thanking me.'",
        "'speaker_0': 'But thank you. I just want to get in. Thank you. There before my time is up.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Marcella de Rivera. Marcella de Rivera. Please begin.'",
        "'speaker_2': 'Mercier.'",
        "'speaker_4': 'They were very they're.'",
        "'speaker_3': 'I think that that included a comment or more.'",
        "'speaker_4': 'Yes, that'll conclude public comment.'",
        "'speaker_3': 'Okay, then let's go and go to a roll call vote, please.'",
        "'speaker_1': 'Councilwoman Sunday has high councilwoman Ellen I. Councilwoman Price.'",
        "'speaker_0': 'II.'",
        "'speaker_1': 'Councilman Sabina.'",
        "'speaker_2': 'High.'",
        "'speaker_1': 'Councilwoman Mango.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Trans Woman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Richardson.'",
        "'speaker_2': 'Right.'"
    ],
    "Recommendation to direct City Manager to work with the Health Department to establish a Food Security Plan for communities impacted by the closures of grocery stores and make recommendations for inclusion in the inclusive economic recovery plan.": [
        "'speaker_1': 'Bush and Kerry.'",
        "'speaker_3': 'Thank you. Item number 16, please.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Item 16 is communication from Vice Mayor Richardson, Councilwoman Sunday and Councilwoman Allen. Recommendation. Recommendation to direct city managers to establish a food security plan for communities impacted by the closures of grocery stores.'",
        "'speaker_3': 'Q Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. I think it sounds like it's resolved the audio issue so quickly. The idea here is that food security is at an all time insecurities, an all time high right now, well, at the highest levels in generations, in fact, according to the Northwestern Institute of Policy Research.'",
        "'speaker_2': 'Nationwide, food insecurity has doubled overall and tripled among households with children as a result of this current economic crisis that we have on hand. A Long Beach has actually done a pretty good job since the pandemic. We began with our basic needs security work, and we were able to fund that with CARES Act, building significant capacity across'",
        "'speaker_2': 'town for delivering and expanding access to food, everything from pop up markets to pantries and even direct delivery of meals and direct delivery of groceries through nonprofits and local restaurants. We have, you know, most recently, we we went through the Heroes Act dilemma when Kroger announced that it may be closing two of its Long Beach grocery stores'",
        "'speaker_2': '. This announcement comes at a time when our nation is again facing unprecedented levels of unemployment and food insecurity. And so we want to make sure that if this were to happen in April, we have a game plan on how we're going to provide food and enhance food security in the areas around food for us.'",
        "'speaker_2': 'I asked my my social work fellow to create this map because identifying where the, you know, access to food, the bodegas, the big box grocers, all of them exist around the food for less is true. Food for less is in my district, the one near South Street at the bottom.'",
        "'speaker_2': 'That's the one that's closing. Now around it, you see to the right the WinCo and food for left to the north, superior to the south. There's a number of big boxes surrounding it. It's had some issues. But if you go sort of north northwest, it's a big you know, it's a big gap in terms of access to'",
        "'speaker_2': 'food. And so what we need to do is make sure that we put we plan for it. We know that there may be a shock to the system if this grocery store closes. We can talk about long term plans and development, all those things.'",
        "'speaker_2': 'But I think our most immediate need is to ensure that the needs of the local residents are met. And so to offset the sudden economic shock that may be created, food shock by the closure of these grocery stores.'",
        "'speaker_2': 'We should prepare an equity informed food security recovery strategy, a food security plan, and this should be put in place to prevent further escalation of food insecurity in this fortunately impacted areas. Now, and my motion as written, I'm going to make that motion as written.'",
        "'speaker_2': 'But I will say I think there are many areas of uptown that could be areas that need additional attention with food security. Again, we built a lot of capacity care that I want to see what opportunity we have specifically around this area.'",
        "'speaker_2': 'But if there's other areas as well that may be impacted by closure of grocery stores or lack of grocery store, we need to be intentional about calling out what our food security plan is and making sure that that is as a part of our ongoing inclusive recovery plan that the city council directed staff to work on last'",
        "'speaker_2': 'December. And so that's the gist of this motion, and I'm happy to submit it to the Council and urge your support.'",
        "'speaker_3': 'Okay. There is a second by customers and they have concerns and they has.'",
        "'speaker_0': 'Thank you. I absolutely want to thank Vice Mayor Richardson for bringing this item forward. Both of us represent neighborhoods that are severely impacted by a lack of access to fresh, affordable groceries and produce, which makes the COVID 19 crisis and store closures that much more painful in our communities.'",
        "'speaker_0': 'It's it's critical. It's critical that we have that we treat food security as a basic right of our residents and develop a plan to make sure that we are all actively working on ways to preserve and expand access.'",
        "'speaker_0': 'As a matter of policy, it's unfortunate the case that even before the pandemic, far too many of our residents were faced with hunger and food insecurity. Those numbers have only grown since COVID 19, and it has become harder and harder for a Long Beach residents just to keep food on the table.'",
        "'speaker_0': 'This plan is needed and it is my hope that we can use it to work together on actionable items that will close this gap for our food insecurities. So I really, really hope that not only focusing on late nights, Long Beach, I'd really welcome the the opportunity, thanking my mayor, the opportunity of implementing these and other districts'",
        "'speaker_0': 'as well with high food insecurities. So thank you.'",
        "'speaker_3': 'Cut some of your anger.'",
        "'speaker_2': 'Thank you, Mary. And I want to thank my colleague device where Richardson cuts to the pencil analogy for bringing this forward. And I want to add my voice in regards to the food insecurity that exists in Long Beach.'",
        "'speaker_2': 'I certainly have my area in the West, long, weak that is food insecure and extremely disappointed, not only for the fact that during a time when they were making record profits of being close to stores and especially especially disappointed in the press telegram with their recent editorial regarding the heroes pay, especially when they're saying that Kroger has'",
        "'speaker_2': 'it's been affected by the fact that because of the Heroes Act or the heroes pay that they're losing or they're minimizing the profits, a profit is a profit, and therefore they're making a pay based over low tax profits.'",
        "'speaker_2': 'They can certainly afford it. So I'm very supportive of this item. Thank you for bringing this forward. And I think that this would be helpful a long way. This would go a long way in helping those communities that are food insecure.'",
        "'speaker_2': 'So thank you again.'",
        "'speaker_3': 'Thank you. Councilman Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Yes, I'm happy to support this motion. Certainly. Food insecurity. As a city council, we should be looking to provide as much comfort, and particularly in the area of food for for our residents. I think some of the challenges with insecurity have to have the have a lot to do with the market.'",
        "'speaker_2': 'You know, just a few years ago, a superstore was was developed in the ninth District in North Long Beach. A Wal-Mart superstore right down the street from a pooper less that is now on on the table to be closed.'",
        "'speaker_2': 'And I certainly hope that that that that's not a final decision. I hope that Kroger will come to their senses and realize that, you know, that this is a store that is meeting the need of community. And if they don't, I think someone else will.'",
        "'speaker_2': 'I certainly hope someone else will. And so what does this item does it actually. Direct staff to to look at other grocers, to come into the community to provide groceries or all these services. Maybe that's a question for the author.'",
        "'speaker_2': 'So I'm happy to answer. So this plan can include a whole host of things. But I think in terms of developing that site, that's a different conversation there. You know, in conversations with development and others, we identified this site as an opportunity, as a major opportunity when we went through the land use settlement process.'",
        "'speaker_2': 'And as you know, we're in Upland right now at about 12, 13 acres right in the heart of North Long Beach. Huge opportunity banks, housing, grocery. If that were to happen. But right now, the interest is how do we how do we do a needs assessment and analysis on what the food insecurity levels are and also build'",
        "'speaker_2': 'on the capacity that we have? I mean, we've you've got lobbies it. You've got organic harvest gardens, lobby, center for Economic Inclusion, a lot of food distribution giveaways. These things didn't we didn't have this year. And so there's significantly more capacity.'",
        "'speaker_2': 'I think this is about the strategy of what can we deliver? Is it. Is it pop up, farmers markets, arm stands? Is it additional food distribution? Is it conversations with grocers? All of that could be factored in. I think this is just about sort of bringing the mindset table.'",
        "'speaker_2': 'I'll figure that up. Thank you. And I would just say that that to add to that point, you know, there are resources that that should be considered like our our seven acre urban farm in the eighth district, the hard a district right by the Carmelita that is providing lots of organic vegetables for for for families.'",
        "'speaker_2': 'That's a resource that should be tapped into. I talked to many residents who live in Carson and Compton and other cities who come to Long Beach for their groceries. And so this is a this is not just a North Lawn Beach issue.'",
        "'speaker_2': '90805 issue. But this is a regional challenge because I know for a fact that a number of folks from other cities come into our city to shop. I've heard from that from so many people just recently. I'm fortunate.'",
        "'speaker_2': 'I live within walking distance to the four or five grocery stores, literally. And we have a hub here in the eight district of grocery food providers, which is, I think, an asset and resource here in our community. Look, people should be able to have resources close by.'",
        "'speaker_2': 'And so I support that 100%. But I do think, again, some of the market factors should be considered and some some of that we can't control, as the city council is the private private market that that that that is driving some of this this all this activity, in my opinion, outside of our certainly we all supported the'",
        "'speaker_2': 'Heroes Pay Act. We stand on that. It was the right thing to do. And and, you know, whatever PR move it was to to to to announce closure, you know, and blame it on that, that's fine. I don't necessarily believe that that is the case.'",
        "'speaker_2': 'I can I guess we can state that publicly now. I think it was more have had more to do with market factors than anything. Thank you.'",
        "'speaker_3': 'Councilman Allen.'",
        "'speaker_0': 'Yes, thank you, Mayor. And I, too, look forward to supporting this item because the pandemic has had a significant impact on our residents and especially on families. And that's why we have to look at ways to support food security for our communities.'",
        "'speaker_0': 'And I just want to say great word to Vice Mayor Richardson for bringing this item forward and also want to say thank you for inviting me to co-sponsor.'",
        "'speaker_3': 'Thank you. That concludes council comment. Is there any public comment on this item?'",
        "'speaker_2': 'Yes. Our first speaker is Joey King. Joey King. Good evening, Mayor. Vice Mayor. Can you hear me? Yes. Please continue. Good evening, mayor, vice mayor and council members. My name is Joey King. I volunteer in District nine with Collins Neighborhood Association and collaborate with a network of pantries and community organizations that span across this amazing city we'",
        "'speaker_2': 'call Long Beach Item number 16, which is a recommendation to direct the city manager to work with the health department to establish a food security plan is a step in the right direction. But it does make me wonder why would we not already utilize all existing and possible resources to work together in fighting food insecurity?'",
        "'speaker_2': 'So let's not just do the research, write a report, and let it collect dust on a shelf somewhere. Let's use this momentum and start to take action. The food insecurities that already exist in District nine will be exacerbated with the closure of food for less on South Street.'",
        "'speaker_2': 'Local pantries and community organizations stand ready to help, as we always are. But making the decision to build food security into the fabric of who we are as a city would mean that we finally begin to address the problem at its root and stop very important fruit.'",
        "'speaker_2': 'I urge that in developing a plan to move forward, you include those local organizations that fight the battle of food insecurity on a daily basis. As we all look forward to rebuilding our city. I'll leave you with this.'",
        "'speaker_2': 'America is the richest country in the world. And yet tonight. Thousands of your neighbors will go to bed hungry. It may be your child's schoolmate who is undernourished and has difficulty learning on an empty stomach. Or it could be a coworker or a working parent whose low wage job doesn't make ends meet.'",
        "'speaker_2': 'Perhaps it's an elderly neighbor who has to make a decision whether to delay filling a prescription or buying groceries. The faces of hunger are as broad as the faces of America. That was David has be with General Mills.'",
        "'speaker_2': 'Thank you for allowing me to speak. Good night.'",
        "'speaker_4': 'Thank you. Your next speaker is Marcella de Rivera.'",
        "'speaker_0': 'Hello. This is Maricela. Can you hear me?'",
        "'speaker_2': 'Yes. Please begin.'",
        "'speaker_0': 'Thank you. Good evening, Mayor Garcia. Council members and staff. I really appreciate the opportunity to speak on this item. I'll be brief. I want to thank my council member, Vice Mayor Richardson. I am a proud resident of District nine, and I'd like to thank him for bringing this forward and council women and their husband, Allen, for co-sponsoring'",
        "'speaker_0': '. As a resident of the ninth District, Food for Less on South Street is someplace we shop regularly or at least did. And so I just want to let you know that that the heroes pay that they purport is the reason that they are closing even though, again, they purport that it is why they're closing the store.'",
        "'speaker_0': 'I still support completely. This is absolutely going to impact my life. I look forward to Vice Mayor Richardson. I know that he's going to aggressively try to address this issue and the food desert in the ninth. I know that he has for years before he was even on council when he was serving on staff under Council member'",
        "'speaker_0': 'Stephen Neal. And I know that this is an issue that's not going to go away for us right away and it's going to be exacerbated for now. But I still think the city of Long Beach did the right thing.'",
        "'speaker_0': 'And so I'm very excited about what will come and what better grocery store we can get, hopefully to come to the ninth district and serve our residents. I think we're a diverse community that deserves better than Kroger if what they are giving us is not good, not being good employers, I just don't think that that's worth fighting'",
        "'speaker_0': 'for. I think we need to fight for good employers who are going to treat their customers well. And so I thank you for this and I thank you for the heroes pay also.'",
        "'speaker_4': 'The next speaker is Juanita Top. We need a deeper more.'",
        "'speaker_0': 'I need it.'",
        "'speaker_2': 'Okay. Please begin.'",
        "'speaker_0': 'Yes. Hello and good evening. Yes, thank you. Good evening, Mayor. Vice Mayor. With such members of city council and staff. Good evening. My name is. We need a couple more. And I'm a resident here in the ninth district.'",
        "'speaker_0': 'I'm also the founder and president of the Colors Neighborhood Association. During this pandemic and moving forward this year, the Collins Neighborhood Association has hosted food distributions at Jordan High School and in the North Long Beach community. In addition, we partnered with North Long Beach Pantry Collaborative, sponsored by the Long Beach Center for Economic Inclusion.'",
        "'speaker_0': 'During the pandemic, these distributions represent approximately 200,000 of food. And speaking of this, to bring awareness to this need, the closure of the food for left on south and north Long Beach will put families at greater risk. This also puts the residents of Long Beach closer to being a food desert.'",
        "'speaker_0': 'We have more marijuana dispensaries in the ninth District than we have places to shop and get fresh fruits and vegetables. The residents in North One Beach experienced greater rates of poverty. One in four children living in North Long Beach.'",
        "'speaker_0': 'Residents with their families live below the poverty level. Children attending public school are dependent on milk for breakfast and lunch. With school closures during this pandemic. Those students are going without daily meals. How can they focus on school on an empty stomach?'",
        "'speaker_0': 'These are issues being brought to life as a result of this pandemic. I'm asking for the city manager and many a members of city council to take a closer look at the number of food distributions that are being held in North Long Beach and develop a plan to address the food insecurity that our residents in Long Beach'",
        "'speaker_0': ', throughout Long Beach are facing. Please be proactive and develop an effective plan, not just putting a Band-Aid on food insecurity, but to come up with a plan to address the issues of food insecurity and the lack of funding taking place in North Long Beach.'",
        "'speaker_0': 'Thank you very much for your time and the opportunity to speak with you tonight. Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for the center.'",
        "'speaker_3': 'Thank you. Please go through a roll call. Vote, please, on item 16.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'Right.'",
        "'speaker_1': 'Councilwoman Ellen?'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Councilwoman Price. Councilwoman Pryce. Councilman Sabrina.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Councilwoman mango. Councilwoman Sara, I council member oranga.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Alston. My Vice Mayor, Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Bush and.'",
        "'speaker_0': 'Kerry.'"
    ],
    "Recommendation to direct City Manager to provide a progress update on the Long Beach violence prevention and intervention strategies, and, further, engage with the County of Los Angeles to explore funding opportunities to accelerate the implementation of the SAFE Long Beach Violence Prevention Plan and intervention strategies through the recently adopted Measure J and other potential funding opportunities.": [
        "'speaker_3': 'Thank you. Next item, which I think is 17.'",
        "'speaker_1': 'Item 17 Communication from Vice Mayor Richardson. Councilwoman Cindy has Councilwoman Sarah and Councilwoman Allen recommendation to direct city manager to provide a progress update on the Long Beach violence prevention and intervention strategies.'",
        "'speaker_3': 'Vice mayor.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I have a presentation on this recommendation here. There's been a lot of progress over the last year on violence prevention. Some of it was touched on last week in the youth. Youth Development Office work.'",
        "'speaker_2': 'But there's a lot more that's taking place. And I think we need to highlight and understand that's created some opportunities for us that I think we can use now more than ever. A little bit of background. We've had a violence prevention plan since 2014.'",
        "'speaker_2': 'Important. It's an important plan. And we believe that it's the philosophy. I'll save Long Beach that talks about making investments, investing in youth, using data to understand what are the what is the violence? What is violence that is at its root and how can we intervene early?'",
        "'speaker_2': 'But it's sort of a long term plan for many years. That plan was, you know, as we would say, sitting on it, sitting on a shelf. We didn't have the investments necessary to actually implement this plan. Last year, things changed.'",
        "'speaker_2': 'There was a motion that the city council made to explore other ways to accelerate this that ultimately led to a Long Beach Active Safe Communities program. It's a $1.1 million grant that began and piloted in the Washington neighborhood in Central Lobby.'",
        "'speaker_2': 'So let's go to the next slide. And then, you know, we we adopted we unanimously adopted our racial equity reconciliation initiative, which really double down on violence prevention as a public health issue. It has a strategic goal on violence prevention, which it calls for increasing funding and investment into into these things and community based intervention strategies and'",
        "'speaker_2': 'focusing on reentry. So City Council adopted that. How do we respond? Let's go to the next slide. We we responded. We invested three point $2,000,000 million, implement certain recommendations related to this. And more specifically, we invested in creating one reentry position and additional position on violence prevention to complement the one position we had.'",
        "'speaker_2': 'And then with the grant from Long Beach acting safe communities, we added a separate position as well in addition to additional funding to go out and work across the community. So we went from essentially 0 to 1 staff for violence prevention in the city.'",
        "'speaker_2': 'Now for staff for violence prevention, that adds incredible capacity for us. Let's go next time. And so this is this highlights some of that background and funding that we talked about. So between the framework funding, the B C program, that gets us a good start, but there's still more that we can do to expand it.'",
        "'speaker_2': 'And I think the next slide will help illustrate that. So this map was put together by our health department to really show the areas of focus with the LBC. And there is focus in Washington and the Stevens Center.'",
        "'speaker_2': 'Long Beach has $1,000,000 investment going in. But if we if we know what we all know is that we've had you know, we've we've had violent crime across the city. And there was in North Long Beach, we really don't have the funding to really implement the types of strategies that are being implemented in Washington and in Stevens'",
        "'speaker_2': 'neighborhood. Let's go to next slide. So. So what does that mean? It means there is a gap. So we know that that there's, you know, increasing rates of violence, particularly since the beginning of COVID 19. What are our opportunities to take this capacity that we've built additional staff to implement our plan and invest into communities?'",
        "'speaker_2': 'Well, if we know that we have $1,000,000 invested in the in the central Long Beach area, we should identify now that we have capacity, additional resources to invest in north and west parts of our city where we know that there is a direct overlay with violent crime.'",
        "'speaker_2': 'Now. You know, I want to be clear. This isn't the for that. This is it. This is in place of crime suppression or police work. This is investment in the community that when you have crime, you don't you don't abandon that anything.'",
        "'speaker_2': 'You double down on these investments when you need it most. It's like when folks say, you know, when the stock market goes down by as much stock as you can. You want to invest. It's a long term play.'",
        "'speaker_2': 'That's what we have to do here. We have to identify resources to invest in violence prevention more than we're doing right now. Next slide. I think that might be both. Okay, great. That's the last slide. So. So the proposal here is let's identify let's work together.'",
        "'speaker_2': 'And we're starting with some, you know, some initial direction here. We know that L.A. County adopted Measure J. It may be some time until Michigan is ready, but they're already having convenings and meetings about how to appropriate measures.'",
        "'speaker_2': 'And measure J is direct alignment with our youth work and our violence prevention work. It's 10% of the of the non dedicated operating budget from from the county. It has to be spent in these ways. So we should get to the table with them and begin negotiating that.'",
        "'speaker_2': 'Additionally, we should seek other resources. If we have the capacity now to move, we should invest those resources, go into community partners, those resources going to go into prevention. That's where those resources go to help amplify and accelerate what the violence prevention strategy.'",
        "'speaker_2': 'So this is something I believe in. I believe that we should continue to invest in violence prevention. We have to continue to invest in youth. We need to make sure that we are being creative and leveraging these resources that we put forward over the last year.'",
        "'speaker_2': 'We leverage them to get as maximum of an impact that we can get in order to have a long term impact and reduce violence within our city. And so that's the that's the proposal here. And I'm happy to make this motion.'",
        "'speaker_2': 'I urge City Council for support. Now you can take down the slideshow.'",
        "'speaker_3': 'I have Councilwoman Sara, please.'",
        "'speaker_0': 'Thank you, Mayor. I'm very happy to cosponsor this item because as somebody who's work with young people and particularly around violence prevention, it's really critical that while important, we do have violence suppression. We need Metron and long term solution.'",
        "'speaker_0': 'I don't think that violence prevention necessarily have to have you see results in the long term. You can actually have them alongside, you know, short term strategy that can show up in different ways. You know, my chief of staff is really a results of a programing where it's afterschool programs saved his life because there was a place'",
        "'speaker_0': ', a safe place he could go to, surrounded by mentors that helped shape his path. So it's hard, short term and long term impact. And I also want to express support that that we do need to make sure we are addressing violence and tackling them head on.'",
        "'speaker_0': 'Because I believe that gun violence is a public health issue. It's a disease that really spread. And we really just don't target the the the spots and the area that's highly needed. And so I think that it's important that we really go to them and we've seen huge spikes in central as well as West and North Long'",
        "'speaker_0': 'Beach. So for those reason, I support this item. Thank you.'",
        "'speaker_3': 'Thank you, sir. Public comment on this item.'",
        "'speaker_4': 'Yes. We have Sri in Senegal.'",
        "'speaker_0': 'Good evening, mayor. Vice Mayor on council members. Thank you, Vice Mayor, for bringing this item forward and for the council members who coauthored it. I have heard a lot of comments about policing to stop our gun violence, but this is not the solution.'",
        "'speaker_0': 'Investment in our youth development. Ensuring that our brothers and sisters coming home from prison have the opportunities to build better lives, mental health support, trauma based education programs, and propping up our community based organizations that are on the ground across the city that are working with intention.'",
        "'speaker_0': 'I support this item tonight, but I have to agree with Councilwoman Sorrow that it is important for us to recognize gun violence as a public health issue. And I urge City Council to take the steps to make it that so that we can have long term prevention that is sustainable.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_2': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. I do have calculators in the house.'",
        "'speaker_0': 'I think in there in there, as we all are aware, of violent crimes and gun violence, especially then on the rise in Long Beach in the past couple of months and especially in my district, we have seen overwhelmingly increases in gang violence.'",
        "'speaker_0': 'So I am very supportive of this item and and look forward to the item that I brought forward a couple weeks ago as well. And so thank you very much. Anything that we can do to really bring attention to the the issue that is gun violence in our in our city is very important.'",
        "'speaker_0': 'So thank you, Vice Mayor, for bringing this forward.'",
        "'speaker_3': 'That concludes comments. Roll call vote, please.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Councilwoman Allen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabrina.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council Member Oranga. I can't say I'm in Austin. Councilman Austin.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Vice Mayor Richardson. My motion carries.'"
    ],
    "Recommendation to direct City Manager to work with the Long Beach Health and Human Services Department Office of Youth Development to establish the Long Beach Youth Fund, utilizing Measure US revenue and additional revenue sources.": [
        "'speaker_3': 'Thank you. Next up is item 18.'",
        "'speaker_1': 'Item 18 Communication from Vice Mayor Richardson. Councilwoman Sarah. Council Member Oranga. Recommendation to direct City Manager to establish the Long Beach Youth Fund. Utilizing Measure US revenue and additional revenue sources.'",
        "'speaker_3': 'Vice Mayor Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I was a few years back that city council received a fail to invest in youth report on youth. Youth leaders across the city advocated for Youth Fund. And we explored city council, explored a number of options to create this youth fund.'",
        "'speaker_2': 'The case was made that, you know, a number of major cities in America have made this commitment to have an ongoing fund, to support youth development ongoing and and certain steps have been taken. The mayor allocated $200,000 in his 2018 budget to to begin the process of developing a fund.'",
        "'speaker_2': 'And the youth group said we'd rather work on the youth strategic plan and in the hopes of coming to a fund later after exploring of those opportunities. Well, since then, a lot has happened. Last week we heard about the strategic plan.'",
        "'speaker_2': 'We know that the Framework for reconciliation invested in creating a new Office of Youth Development. And we also went to the ballot to find ways to fund investing in equity through youth and as the US was adopted. And now it's time that we make these youth whole and we move forward with directing staff to begin making taking'",
        "'speaker_2': 'the steps to create a youth fund, create a program website, engage with how to rules and how to work and all those things to have it ready for the next fiscal year. So if we start now, February, we have a lot of time to make sure we've designed this the right way where it makes sense, and we'",
        "'speaker_2': 'begin the next fiscal year with the youth fund in place with the rules and the parameters, with equity in consideration and all of the things that we need to do to make sure that we are making a real commitment to investing.'",
        "'speaker_2': 'Now, I mentioned measure us, but I also say don't stop there. I think once we have this established, let's see what the Port of Long Beach has to say to Mendes. L.A. County again is going through the conversation on Measure J.'",
        "'speaker_2': 'Again, that's not ready today, but we can get to the table and begin seeing it. Can we leverage some of these, measure U.S. dollars to draw down county resources and others to expand this youth fund? So we take incredible steps.'",
        "'speaker_2': 'I think we're in a really good place to make a strong commitment, a strong statement here by beginning the process of shaping this youth plan. I want to thank particularly my girls in action and all the youth that have advocated Invest in Youth Coalition have advocated for Youth Fund for many years.'",
        "'speaker_2': 'And I want to thank you for staying on it. And I think this is what the City Council should do in its moment. So that's my motion. The motion has written and I urge city council support.'",
        "'speaker_3': 'Thank you. Council member Ringo.'",
        "'speaker_2': 'Thank you, Aaron. I want to thank Vice Mayor Richardson for bringing forward more and more importantly, I want to thank the voters of Long Beach for a fascinating review. It's going to speak it speaks volumes for how the city feels about our view.'",
        "'speaker_2': 'And then also it's a statement about how we need to address not only terms of bringing our youth to get better services, but to also provide them with all the resources they need to be successful. So I very strongly support this measure, and thank you to all my colleagues for supporting this.'",
        "'speaker_3': 'Thank you. Our twins are a.'",
        "'speaker_0': 'Thank you, Mayor. I want to thank Vice Mayor for bringing this item forward. And, you know, as somebody who I've shared, when we had the strategic plan presented before us, sure. That I was the former executive director, Michael was in action.'",
        "'speaker_0': 'And, you know, I'm proud of their leadership on this, bringing this item forward to council as well, working with everybody and coordinating the effort. And I think that, you know, our young people have worked really hard in so many different ways to bring this strategic plan forward.'",
        "'speaker_0': 'And I think as adults, we need to demonstrate that we support them through investments to follow through with their plan. To really support them is to see their Plan B come alive. And the way we can only do that is to ensure that there is an investment in the form of funds.'",
        "'speaker_0': 'I'd also like to see if we can draw that up from state and federal dollars as well. As far as supporting this plan and so and so, yes, I'm proud to support this item. Thank you.'",
        "'speaker_3': 'Council member, Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Certainly, I support this, the direction that this item is going in. But I think as a council, didn't we already do this last year? We supported putting measure us on the ballot and identified that that a good percentage of those dollars would be going toward supporting youth.'",
        "'speaker_2': 'And won't this be coming to us? And I expect this to be coming to us as a budget proposal anyway as a result of our action last year. Leicester City Manager Can you comment on that? Yes. So we see.'",
        "'speaker_4': 'This as giving us direction to start with the concept of creating this fund and then it would be incorporated into your f y 22 budget process. One of the primary funding sources that we would look at would be measure us and measure us starts actually generating money in October.'",
        "'speaker_4': 'So that would be a part of the city manager's proposed budget and to lay out the uses of the first year, measure US funding.'",
        "'speaker_2': 'Okay. Thank you. I just wanted to get some clarification on this because it does seem like dja vu. We already, you know, committed to to supporting our youth through to a fund by putting a ballot initiative on. And in that ballot initiative, we identified that this was one of the areas that we wanted to target our resources'",
        "'speaker_2': '. You know, I I'm really interested in, you know, getting engaged in the budget process. And I know this year we will have a different type of process which will engage more the community, more of the Council through our strategic priority budget process, but which is a take up a zero based budgeting which was also directed by the'",
        "'speaker_2': 'Council. Yes, investing in our youth is certainly the priority. I'm happy to support this. But I just wanted to get clarification because again, I think we we as a council have already committed to doing this. And I'm happy to recommit tonight to supporting our youth.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_3': 'Thank you, Councilwoman Mongo.'",
        "'speaker_0': 'Thank you. I actually have had a couple of agenda items tonight that are already things that we as a council have discussed. And I thought we're coming back to a certain committee, whether it's budget or. I mean, I think that this sounds a little bit more like not just making funds available through the budget process, but it's'",
        "'speaker_0': 'really a program. And I think the confusion comes with the naming of the fund. It sounds like a youth program that establishes criteria by which when the council. Authorizes funding. Whether it's restricted or non restricted or how that works, that there there would be a process.'",
        "'speaker_0': 'At least that's what it sounded like when hearing from Councilmember Richardson. So I'm happy to support the item tonight. It does seem like there are a lot of different components of what we're working on for youth, and I just want to be sure that it all comes together.'",
        "'speaker_0': 'We have the youth strategic plan, we have the violence prevention, and we have many, many other programs that we've approved over the last six years, including and you did mention this one, Mr. Austin, but some of our parks after dark programs and then our summer reimagined or after school reimagined, we hear a lot from the community that'",
        "'speaker_0': 'they want to know how much we're investing in our youth. And I think that a component of this that's really going to be important is being able to bring all of that together so we know where all those investments are being made so that we're able to see the return on that investment and the outcomes and what'",
        "'speaker_0': 'things what levers you invest in have the highest return in lifting up our youth and preparing them for prosperity, especially as we go into some of the the listening that I've done related to financial literacy that is not taught in our schools and other components.'",
        "'speaker_0': 'So I'm happy to support the item tonight, and I look forward to the city staff ensuring that all the components of what we're working on at the council are included. Thank you.'",
        "'speaker_3': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. And just just to clarify, we pass as we move forward, measure us. We established a resolution. It didn't establish a funding that youth as a priority for investment, wealth, climate. But it didn't call out a fund.'",
        "'speaker_2': 'And what I don't want is for the fund itself to be lost in translation, because councilmember among those. Right. There's been a lot of things that sound like they're very similar. This is a very specific request, reflective of a community ask that honors the community's work.'",
        "'speaker_2': 'And so this is an important win to those youth to have fun. You know, the program, the website, you all know what I'm saying and where we can point to. And this was the communities when they fought for this, they set us on this course to get there.'",
        "'speaker_2': 'Now, in terms of the presentation last week, if you notice, the youth fund wasn't was it highlighted as an element? It is called out in the reconciliation plan. It is referenced in the strategic plan. I spend a lot of I read both those plans, spend a lot of time folks and those things.'",
        "'speaker_2': 'This is ties it together I think, and aligns it really well. And I think the things that I'll be looking for is a similar what Councilmember Mongeau said. I want to see some transparency. I want to see investments and things like, you know, I've got a lot of youth sports in North Economy, Pop Warner and, you know'",
        "'speaker_2': ', Uptown Little League and a lot of a lot of folks who are a little just a small investment goes a long way. A $5,000 grant here, there, you know, goes a long way. Let's create a process to actually hear from these folks where we stand it up and we begin collecting youth.'",
        "'speaker_2': 'Measure us. We're ready to go on day one that that takes a motion from this council to staff to say, we want to do it. We kind of want to go about it this way, begin that process now.'",
        "'speaker_2': 'So that's the intent. Thank you to the City Council for your support and read about.'",
        "'speaker_3': 'Thank you, Councilman Zoro.'",
        "'speaker_0': 'Yeah. I just want to just follow up on one point around making sure we have an allocated, you know, my experience and having done, you know, fundraising went from private foundations to public and state is that the pool of resources are together.'",
        "'speaker_0': 'And then when it comes down to then making a decision on how much is allocate for young people, it's a very, very small percentage. And I think I want to lift up what Councilmember Mungo said is it's it's to make sure that we know how much is needed and to fully invest in young people and how much'",
        "'speaker_0': 'is really spent. And I think that the only way we can tell is having a specific fund. So we know really how much it really takes to develop and support young people to be successful and to implementing a plan.'",
        "'speaker_0': 'So that's just what I just want to make sure to add to it from my experience and that at times young people get the kind of the very kind of leftover funds. And so I just want to make sure we prioritize it by having their own fund.'",
        "'speaker_0': 'And that's why I think you.'",
        "'speaker_3': 'Thank you. Is your public comment on this or did we do public comment already?'",
        "'speaker_2': 'Yes, we did. Right. Well, we still have public comment.'",
        "'speaker_3': 'Oh, I'm sorry. I'm sorry. You're right. Go ahead.'",
        "'speaker_2': 'Our first speakers, Jillian Moore.'",
        "'speaker_0': 'Hello and thank you for having me. My name is Jillian Moore. I'm a resident of North Long Beach and a youth and family commissioner representing the ninth District. My recommendation is to the city to use the funds for measure us to establish the Long Beach Youth Fund.'",
        "'speaker_0': 'Programs in Long Beach that uplift youth are long term investments in the future of Long Beach as a whole, and with help from Measure U as the fund would truly thrive, programs that create spaces for youth to grow individually and together with their community to target the problems plaguing our city at their core.'",
        "'speaker_0': 'Programs that bring youth together, such as arts programs and sports programs, allow youth a place for mentorship, friendship and deeper education. These programs preemptively lower crime and will greatly improve the well-being of Long Beach youth. Because of COVID, we have all learned firsthand the importance of having local communities to build one another at.'",
        "'speaker_0': 'As it currently stands. There is a lack of program in Long Beach for youth that served its purpose as a youth in Long Beach. I see a. I see a great need. As a youth in Long Beach, I see a great need for community spaces, specifically for youth, and would benefit from them greatly.'",
        "'speaker_0': 'These programs would also open up opportunities to connect youth to job opportunities and college funding sources. Youth young people need resources that will help them bounce back from the devastating effects of the COVID 19 pandemic. Reopening schools will not alone solve the problem.'",
        "'speaker_0': 'The corona virus only revealed the problems that were already present and showed us that we cannot go back to the way things were before, especially not for our youth. If we do not address the mental health crisis among youth now, it will continue to get exponentially worse.'",
        "'speaker_0': 'Now is a perfect time to make the change. Youth have needed access to resources. And we. And. Ray offered. I'm sorry. The major roadblock for community development is always money. And now because of us, we no longer have this roadblock.'",
        "'speaker_0': 'You see the problem in their communities. They know them in and out, and they're the ones with the knowledge to fix them. By utilizing the youth funds, they will be able to carry out the change they want to see.'",
        "'speaker_0': 'Thank you to the city manager and the city council. I hope you'll consider my words and choose to establish this fund. Thank you.'",
        "'speaker_2': 'Thank your next speakers, Jennifer Hing. Jennifer.'",
        "'speaker_0': 'Hi. Can you hear me?'",
        "'speaker_2': 'Yes. Please begin.'",
        "'speaker_0': 'Great. Thank you. Hi. Dear me, are Garcia in Long Beach. Councilmember is my name is Jen lead organizer with Kline Girls in Action on behalf of the Investing Youth Campaign. We thank you all for the passing of the Youth Strategic Plan last week.'",
        "'speaker_0': 'Tonight, we want to especially thank Vice Mayor Rex Richardson, Councilmember Dr. Sally Sara and reporter Aranda for sponsoring Agenda Item 18 and for leading by bringing young people, vision and leadership to the table. Tonight, we are hopeful for all councilmembers to continue to show your support by voting yes on establishing the first ever Lyme Disease Fund with'",
        "'speaker_0': 'dedicated funding revenue. Young people deserve support and resources, especially in challenging times like these. I speak tonight because youth leaders and community residents envision a more equitable world where young people are valued and included in our city's budget.'",
        "'speaker_0': 'And with the implementation of the U.S. treatment plan, young people are eager to continue their leadership in shaping decisions that impact their lives. Youth are facing barriers today, but continue to be civically engaged regardless of they are eligible to vote.'",
        "'speaker_0': 'For example, council meetings are not always accessible for young people to speak, so your decisions and your vote tonight can show you that your efforts are seen, valued and prioritized. Are Youth Fund dedicated funding from the local passage of measure US as well as the county passage of Measure J ensures an equitable infrastructure that supports positive youth'",
        "'speaker_0': 'development and centers racial equity. We urge the Council to leverage these funds to ensure young people are prioritized no matter the economic climate. We also have submitted a letter of support to your offices from partners and organizations from the investing campaign, which include the Advancement Project, Building Healthy Communities, Long Beach, California Conference for Equality and Justice.'",
        "'speaker_0': 'The Long Beach Chapter of the California Faculty Association. California for Justice Educated Men with Meaningful Messages, Genders and Sexualities. Alliance Network. Long Beach, Forward Filipino Migrant Center, I Girls in Action Voice Waves as well as the Youth Leadership Institute.'",
        "'speaker_0': 'So since 2017, young people have been helping to lead an equitable budget process in our city and have looked forward to the day they can say they were part of establishing the first ever youth one in the region.'",
        "'speaker_0': 'We have an opportunity to support long term COVID recovery and intergenerational healing. And we hope you can show you still love tonight by voting. Yes. Thank you so much.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you, Councilman. Mongo. I'm sorry. Thank you. Yes, that's right.'",
        "'speaker_0': 'Thank you. So I just want to thank all the speakers, particularly the first speaker you talk about, because considering your words. Youth leadership in this city has been a dominant force that has gone unanswered since the nineties. And I served on the Long Beach Press Telegram's Youth Coalition in the nineties to talk about violence in our communities'",
        "'speaker_0': 'and the things we needed to do. When I was elected, we proposed lots of special funds and city management pushed back and said there were all sorts of barriers to getting there. So I appreciate. Vice Mayor Richardson's comments that this is brought forward by the community.'",
        "'speaker_0': 'Funds, which become available in October.'",
        "'speaker_3': 'Councilwoman, we lost you for, like, the last maybe 20 seconds or so. Councilman, mango.'",
        "'speaker_0': 'Challenges and or restrictions and how we work together.'",
        "'speaker_3': 'We just so you know, we you cut in and out. So we haven't really been able to hear anything you said. Okay. You know, the last like minute or so.'",
        "'speaker_0': 'Okay. So when we talk about a special fund and we're talking about our reporting requirements on our annual CAF and all of those things, Mr. Groves has consistently pushed back that special funds are not really possible. My office has proposed multiple special funds in the last six years, all of which were brought forward by community members with'",
        "'speaker_0': 'a special intent or need, including youth sports, which we talked about, and depending on some different considerations. And so I don't know if we need a report back from the city manager's office on how he plans to do this now when in the past it's been rejected.'",
        "'speaker_0': 'I can understand the side of it where we talk about a program that every year the council allocates a fund or two funding to. That has a roll over mechanism. I guess I'm just interested in the city management and maybe it's it's just something that you provide to us in a to from for annotating why a special'",
        "'speaker_0': 'fund would work this time when it hasn't in the past or if it is possible now. And some laws have changed that all the other special funds that have been rejected in the last six years would come back to the Council for reconsideration because they were rejected at the staff level before you even made it to council'",
        "'speaker_0': ', even though community groups are the ones bringing them forward. So I am passionate about a youth fund. I am passionate about stopping and stopping issues in our community and empowering youth to find those solutions. But I also want to do it in a way that doesn't create a false sense of hope or a false a tool that's'",
        "'speaker_0': 'not available. So if there's could just be some outline or information about that, because I know I even asked some of these questions at our briefing and it seemed as though we were going down a path of a program.'",
        "'speaker_0': 'But I hear something very different from the vice mayor. And so I just want to make sure that we're all on the same page and that previously rejected requests are not now overlooked, because.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Would like to know the reasoning that there would be a variance. So thank you.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'Thank you, Councilman de.'",
        "'speaker_0': 'Thank you, Major. I just wanted to thank Councilwoman Richard, Vice Mayor Richardson for bringing this item forward and for those who cosigned on this. I was very, very impressed last week with our discussion on our strategic plan and all the work that that went into the plan and especially the work coming from all of the organizations that'",
        "'speaker_0': 'have been involved, all the youth organizations. May I add, that have been involved in in the youth strategy. So I'm so happy to be able to support this item going forward and making sure that we achieve the goals that we set and that we're able to follow up on this, this just to make sure that we bring'",
        "'speaker_0': 'this fun into fruition for our youth within their strategic plan, because that was something that was the big ask was a youth plan. And as we all know, and especially in my district, I think that investing in our youth is definitely a game changer from providing a good quality of life for their future.'",
        "'speaker_0': 'And I'm very happy to be able to support them like this. So thank you again.'",
        "'speaker_3': 'Thank you very much, Vice Mayor.'",
        "'speaker_2': 'It's a. Thanks, Mr. Mayor. Just to sum up a couple of things, though. First, this is within the general fund. It's not a special fund. And we've done this a number of times, legal defense fund, other things that we've done.'",
        "'speaker_2': 'The city manager we talked about this at length for many, many years is not a new idea. In fact, we discussed when we talked about the resolution that these are general fund dollar measure, U.S. general fund dollars. They all have to go through the budget appropriation process.'",
        "'speaker_2': 'And, you know, within the whole conversation about this, you know, I don't want it to be lost that by establishing a fund, this empowers the youth to help set the rules on the fund, talk about the allocations, talk about what the needs are and and and make our strategic plan live.'",
        "'speaker_2': 'And because a major U.S. structural fund can be structural. So so we're really talking about semantics here. I think staff knows exactly what what it is they want to do. What I don't want to do is give the false hopes to folks that this is a one time thing.'",
        "'speaker_2': 'We had that discussion, that council councilmember Mongo, if you remember, you offered $1,000,000 to take the measure off the table and walk away. And we said, no, we want to go to the voters because we want the structural.'",
        "'speaker_2': 'And that's what the voters voted on. This was not one time. This is something we're going to we want to commit to now. Could it change? Sure. A council could could change and make other priorities. But, you know, the idea here is we want to stand up to flag down and say that we really, truly believe in'",
        "'speaker_2': 'this. And that's what we're we're voting on. We're voting to move forward with establishing a fund, transparent and open. And I think. Yes. The city manager should provide regular reports to the city council. I think he already does that and so we will be informed on what that process looks like.'",
        "'speaker_2': 'But I hope that it's really youth, youth and youth serving organizations really have a strong voice and how its how its shape. So thank you and we can move on.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you. I appreciate that. You said that it's part of general fund. I think that it's important to note that the legal defense fund is an annual allocation by the city council. And so, yes, like you acknowledged each year, the council would have to acknowledge.'",
        "'speaker_0': 'The reauthorization or authorization of funding towards that. If we wanted to do a resolution of some sort about how much or of what percentage of this council feels is appropriate. Even still, two years from now. Five of the current council members could be gone and that new majority could decide something different.'",
        "'speaker_0': 'And so the difference in what I thought you were trying to suggest, which I would be supportive of if the city staff would give me a methodology to make it happen, is setting money into a fund like the Legal Defense Fund?'",
        "'speaker_0': 'When we did that, we took that money and we contracted it out to the vendor and it was set. It's not like it was just like any other general fund. At the end of the year, what's not used can be swept, but the council can make it a priority otherwise and so.'",
        "'speaker_0': 'I understand the methodology and I look forward to reading the report back because making it a priority is one thing. Setting aside $1,000,000 is another thing, but measure us is a general fund and in any given year those challenges do come up.'",
        "'speaker_0': 'And so the city financial management staff has parameters that are in place that I was just questioning Mr. Modica earlier today at our briefing to find out if parameters that were set before are no longer in place because we do have strong fiscal policies for a reason.'",
        "'speaker_0': 'And it's important to be honest and transparent with the youth about what those are, so that they're clear on how to continue to advocate for themselves and the fund, because that is the part of the process and they are capable of that.'",
        "'speaker_0': 'And so if we can change a law that makes it possible to set it aside in a special fund like tobacco tax or any of those other things, or a refuse fund, that would be great, but. Calling the fund.'",
        "'speaker_0': 'The fund without those legal restrictions is something that we just want to be very transparent about. So I'm happy to support the item and happy to continue to support youth. And I'm also happy to sit down and have a real conversation with the community and or the youth and or they can have that with the Budget Chair'",
        "'speaker_0': 'about what we've tried to do in the past and what legal measures may be appropriate to protect funding on a long term basis. Thank you.'",
        "'speaker_3': 'Thank you. That concludes everything. We will go ahead and go to a roll call vote. I don't think there's any more common sense.'",
        "'speaker_1': 'Councilwoman Zendaya's.'",
        "'speaker_0': 'Right.'",
        "'speaker_1': 'Councilwoman Ellen. I can Silverman Price. I can swim in Sabina. I can swim in Mango. Times. Woman Mango. Councilwoman. Sorry.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Zahra.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Council member Oranga.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Alston. Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_2': 'Enthusiastic, I.'",
        "'speaker_1': 'Russian case.'"
    ],
    "Recommendation to: (1) Based on the analysis provided, consider the request to (i) adopt resolution authorizing the City to support the California State Communities Development Authority Community Improvement Authoritys (CSCDA) issuance of bonds under its Middle-Income/Workforce Rental Housing Program to enact moderate-income deed restrictions on the existing Oceanaire apartment project, at 150 West Ocean Boulevard (Project), and (ii) authorize the execution of a Public Benefits Agreement (PBA) with CSCDA in connection therewith that includes a provision that shares any future sale profits with taxing bodies proportionate to the current tax allocation;  (2) Request City Manager to develop a proposed policy for any future similar projects that participate in the Middle Income/Workforce Rental Housing Program; and  (3) If action (1) is approved, designate the Project as a pilot, with no similar projects to be approved until the City Council has an opportunity to consider the City Managers proposed policy.  (District 2)": [
        "'speaker_3': 'Thank you. Next up is I am 20.'",
        "'speaker_1': 'Item 20 Report from Development Services. Recommendation two DAB Resolution Authorizing the city to support the California State Communities Development Authority. Issuance of bonds under its Middle Income Workforce Rental Housing Program to enact moderate income deed restriction on the existing Ocean Air apartment project at 150 West Ocean Boulevard, District two.'",
        "'speaker_3': 'Thank you, Mr. Modica.'",
        "'speaker_4': 'Thank you, Mayor and Council. This is a relatively new program that was brought to the state of California to look at how to convert some existing housing to a moderate income housing, something that the council had asked us to look at back in November.'",
        "'speaker_4': 'And we are here to you tonight to recommend a pilot project. We've done a lot of negotiating on this. We want to make sure that you're aware of the various program features. There's some benefits. There's also some risk that we need you to be aware of.'",
        "'speaker_4': 'And with that, I'll turn it over to Oscar Orsi, our development services manager.'",
        "'speaker_3': 'Thank you, ma'am. Thank you, Mayor. Members of the city council. As the senator indicated in November, Council had directed staff to study the benefits and risk associated with participation of the Community Statewide Development Authority, also known as CDA, to develop and preserve middle income workforce housing staff contracted with HRA advisors to analyze the proposal between CDA and'",
        "'speaker_3': 'Waterford to acquire property and maintain it for middle income households. So that would be the ocean area. 150 West Ocean Staff Attorney CDA in Waterford have worked to address and identify concerns and address those through some project modifications.'",
        "'speaker_3': 'Can you please go back to the previous slide? Thank you. The as you can see from the slide, the there are many steps in this involved in this transaction. We've highlighted the area where.'",
        "'speaker_2': 'The.'",
        "'speaker_3': 'Council is asking for your direction on how to proceed with this transaction. Overall, Waterford proposes to purchase Ocean Air from the air for 122 million. Proposes to simultaneously purchase Ocean Air from Waterford, who will act as a project administrator and asset manager.'",
        "'speaker_3': 'What we are requesting that you consider tonight is the city's proposal to is is a request to enter into a public benefit agreement PPA with CDA to act as a host. Forgoing our ad valorem property taxes and reserving the right to force the sale after 15 to 30 years.'",
        "'speaker_3': 'Excellent. Thank you. CCD will finance the project through tax exempt bonds as well as housing revenue bonds. The financial structure also includes closing fees and annual ongoing fees for property maintenance and property administration and asset management. Next slide, please.'",
        "'speaker_3': 'As indicated in our staff letter, this transaction provides several benefits. It preserves 216 units for middle income households for again, for a period of 15 to 30 years or longer, if the council chooses to do so in the future.'",
        "'speaker_3': 'In response to his staff's comments, Waterford and KDA have modified their initial proposal to the following. They've modified the affordable housing mix to provide additional 80% Army units. They've also agreed to provide annual reports, as well as that allow staff the opportunity to investigate the condition of the building to make sure that the Oceanarium maintain is maintained'",
        "'speaker_3': 'at a class A condition. This slides indicates the May levels and the household size for the project. Typically, the city will use the state income limits. This transaction proposes to use the light tech, which is slightly higher in terms of income household requirements at 3530 5% versus 30%.'",
        "'speaker_3': 'Next slide of. Patrick yeah will complete continue this presentation and we do have the project proponents CDA in Waterford here also to provide a brief presentation once we conclude our presentation. Thank you, Patrick.'",
        "'speaker_4': 'Thank you, Oscar. And good evening. Mayor Garcia and City Council. I'm now going to cover the project's potential issues and risks. Before doing so. I must reiterate that this is a new program designed to assist moderate income households.'",
        "'speaker_4': 'There are no other programs or funding available to provide moderate income housing opportunities. So along with a few issues, there is a great benefit to providing moderate income housing units. The projects for affordable housing gains are modest compared to market.'",
        "'speaker_4': 'There are significant rent reductions only at the 80% AMI level, which comprise 87 of the 216 units. These units have a 28% reduction from market rents. We will not be able to get credit for these units because they're not new construction units and they do not have long term 55 year affordability covenants placed on them.'",
        "'speaker_4': 'And it is estimated to take about four years for all the units to convert to affordable units. A completed I'm sorry, a complicated financing structure and aggressive rent growth assumptions may result in high debt and limited sales proceeds to taxing entities upon the project sale at 15 or 30 years.'",
        "'speaker_4': 'There are no new housing units created. But again, this is currently only the only option for providing moderate income housing units. It will take a little time for the units to become affordable through attrition, but that's really unavoidable.'",
        "'speaker_4': 'Based on Rene's analysis, the initial loss property tax revenue would be about 1.5 million for all taxing entities in year one, which includes 264,000 for the city over 30 years. The lost revenue would have a present value of $43 million for all taxing entities and about $8 billion for the city.'",
        "'speaker_4': 'With the current structure, the city can request the sale of the project after 15 years. There are risks and trade offs associated with the exit scenarios. If the city chooses to sell earlier at 15 years, this minimizes the lost tax revenue and risk of deferred maintenance, but it also limits the affordability term and sales revenue.'",
        "'speaker_4': 'Conversely, if the city chooses to sell it later, there is a risk of deferred maintenance cost. Additionally, the option to maximize the value of the asset is to allow the project to return to market rate, which means that the city would lose the affordability benefits.'",
        "'speaker_4': 'Staff believes that this is an undesirable outcome for the city and therefore there's a risk that sales proceeds, which are needed to pay off bonds and repay taxing entities, will be limited. Only a few of these projects have been approved in cities throughout California, and there are no operating experience or models that we can show how the'",
        "'speaker_4': 'long term transaction may play out. Staff recommends that the City Council consider designating this particular transaction to be a pilot project and request staff to develop a draft policy for this type of project going forward. The city has an established track record of working with CDA on the development of affordable housing.'",
        "'speaker_4': 'Waterford is a well-known developer that owns major assets in the city, including City, Place and the World Trade Center. Staff is encouraged by the development team's positive track record in the city and as such is supportive of approval of the project as a pilot.'",
        "'speaker_4': 'Create Middle Income Housing Project. Here again are the recommendations before you for your consideration this evening, and that concludes our presentation. Thank you. Aaron Council that concludes staff presentation. Kay and Waterford are here and available to answer any questions if you have of them.'",
        "'speaker_4': 'I think we've done a lot of work on this project. We've done a ton of analysis. We're at the point where we do feel like this is something we can try as a pilot if the council wants to move forward and otherwise, we're ready to answer questions.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Thank you. County Councilwoman Allen.'",
        "'speaker_0': 'No. Yeah. Thank you. Thank you, Mayor. And thank you, Oscar and Patrick, for the presentation and staff for all of your hard work on this. I know we started talking about this a while ago, and and I know it's been an incredible amount of work for for the team.'",
        "'speaker_0': 'I moved this item and I again, I just think the staff are there hard work it's an. ETA. And new type of program. And I'm happy to consider this as a pilot project only so that we can first analyze the impacts prior to setting any precedent for for other developers.'",
        "'speaker_0': 'One of the things that I do like about this project is that Water Ford is a well known developer. And like we said and you said in the presentation, they have substantial investment in the city. I mean, city plays and the World Trade Center are are significant developments in the area.'",
        "'speaker_0': 'And given their success and history and Long Beach definitely makes it easier for me to support this item also. More unit more unit units at a lower income level of affordability are crucial, and I'm always open to new ideas to add workforce housing for the missing middle.'",
        "'speaker_0': 'So again, I commend our city manager and staff for their diligent efforts and for a thoroughly, thoroughly vetted proposal, and especially that it's something new and innovative. So a question that I do have is if you are someone that's answering questions can describe what the Anaheim Project program is under and what that looks like.'",
        "'speaker_4': 'I'm sorry. Could you repeat the question, please?'",
        "'speaker_0': 'Yes. What does the what does the project in Anaheim look like?'",
        "'speaker_4': 'Remember, this is a Christopher Cross. There's three different projects in the city of Anaheim, one which is further along than the two others. We spend a lot of time with the Anaheim projects and the unit mix that was described by Patrick and Oscar earlier tonight is a similar request that was made by the city of Anaheim.'",
        "'speaker_4': 'So this deal is structured very similar to the city of Anaheim. And if you're familiar with Anaheim, it's its three platinum triangle multifamily buildings that are involved in what's been under consideration in Anaheim. So that's the information we have.'",
        "'speaker_4': 'But Waterford is with us and they were also involved in those transactions and would be able to provide you some more information about the Anaheim deals that preceded this deal by about two months.'",
        "'speaker_0': 'Thank you, Christopher.'",
        "'speaker_3': 'Councilwoman Price.'",
        "'speaker_0': 'I just queued up to second the motion.'",
        "'speaker_3': 'Okay. Thank you. Motion asked. Can Council Councilmember Austin? Count some of your anger.'",
        "'speaker_2': 'Thank you. I also cued up the second, but now that you have me, I have one question about the. It's early on in the presentation, there was no directive on the restrictions. Can you explain what that is?'",
        "'speaker_3': 'Yes, Councilmember. What? The property will be restricted for the life of the bond sales 15 to 30 years. They will be limited to only.'",
        "'speaker_2': 'Being able to.'",
        "'speaker_3': 'Have residents that meet the middle income household requirements, EMI requirements so they the deed restrictions.'",
        "'speaker_2': 'Will not allow for the CDA to offer those at market rate prices. Well, I think it's is a great project, it's a great experiment, and I'm looking forward to it as it is about it. I understand that. But the way it's celebrated now, it's great.'",
        "'speaker_2': 'And again, the Waterford and CSA are great partners for the city and the support to work with the ministry.'",
        "'speaker_3': 'Thank you. Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. I just wanted to chime in and just acknowledge, you know, a couple of things. The dedication on the part of Waterford to figure out how to make this happen and city staff's cooperation and working together to address this idea as a number of innovative pilots that they do with respect to this program and others'",
        "'speaker_2': 'across the state. I've I've, you know, probably had relation with a seat with CSP, KBA for the last five, six years in terms of seeing them at local government commission, others. And sometimes, you know, things are brought to us that we may not be familiar with.'",
        "'speaker_2': 'And I think the approach here with the pilot makes sense, makes a lot of sense. So I think the city manager did a good job at sort of working with the developer, negotiate the income levels and ensure that, you know, the project got better as it moved along.'",
        "'speaker_2': 'So congratulations to everyone and I look forward to support this project. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you. I want to echo Councilman Allen's comments. It is hard to approve of projects like this that can bring so much but have so much risk. It's great that it a trusted partner of the city and I was one of the reasons why I'm able to support it today.'",
        "'speaker_0': 'But as we move forward, I would look for options that come to the city like this to be even better and better as the housing market has also become better and better on the developer side. So thank you to this partner.'",
        "'speaker_0': 'I'm excited to support it today, but I look forward to more support of our community through future projects.'",
        "'speaker_3': 'Thank you, Councilwoman.'",
        "'speaker_0': 'Sun has been coming here. I just want to say how excited I am about this project. I don't think that we have enough middle income housing, so I think that this is really good. Any housing that is developed is going to help our housing crisis, not only the one that we're in right now, but what we're facing'",
        "'speaker_0': '. So I know that there's going to be so many families and just people in general that will be able to benefit from this middle income housing that is going to be available to them. And I'm so excited that we are working with Water Board.'",
        "'speaker_0': 'Thank you, Water Board for your commitment on this project and for, like Councilmember Mungo said and for the risk that you are taking and willing to take on for this project. So I look forward to seeing this project come to fruition.'",
        "'speaker_0': 'So congratulations, Councilmember Allen.'",
        "'speaker_3': 'Thank you, Councilwoman Sorrell.'",
        "'speaker_0': 'Thank you, Mayor. I appreciate all the work that's gone into this. I know that there's a lot of layers to this. And I just have a you know, I you know, I'm still learning about this process. So I just have a few questions because I am you know, I know that there's benefits with risk.'",
        "'speaker_0': 'And I just want to make sure I understand, you know, the benefits are laid out in a way where we are moving forward with a pilot project so that we can learn from this. So maybe I can get some questions answered about, you know, because my concern is just the loss in potential property tax revenue with this'",
        "'speaker_0': 'pilot project. And I just want to make sure that we are being, you know, wise about our approach to taking risk that can also benefit keeping housing our our our our middle income, essential workers and teachers. And so if I could just kind of get it understanding and a little bit more explanation about how that works out'",
        "'speaker_0': 'so that we're moving forward in the best way possible.'",
        "'speaker_3': 'Yeah. Councilmember, this is one of the reasons why we are identifying this as a pilot program. We need we need to be able to study policy moving forward and bringing that to your attention for your review involving such things as property taxes and the benefit of of middle income as well as other income households, and solicit your'",
        "'speaker_3': 'direction on how to proceed moving forward with other similar projects, we are mindful of the property taxes and the loss or the foregone of those property taxes and would like to come back to you to discuss that that policy in greater detail.'",
        "'speaker_0': 'Great. Thank you so much.'",
        "'speaker_3': 'Thank you. I think that concludes. Council comment for now. Let me go to you public comment. Mr. Clarke.'",
        "'speaker_2': 'We have an election. Thank you, Mayor. Members of City Council Alex Charron with Englander and Albion Allen representing Waterford, want to thank first and foremost city staff. I know this has been several months of discussion in a learning process and engagement, so thank you to Tom, Linda, Oscar, Christopher Patrick and Regina Anthony in the city attorney's office'",
        "'speaker_2': '. There were hundreds and hundreds of exchanges and ideas and conversations, and tonight is really the culmination of that. I know it's a complex issue structurally, but I think it checks a number of housing boxes and policy boxes for the city, some of which were recently addressed in the city's housing studies last year.'",
        "'speaker_2': 'So I think this is incredibly consistent with where the city wants to have long term. And I'm glad that we can launch this as a pilot project to to see the benefits similar to what other cities have enacted, including Anaheim, San Jose, Oakland and others.'",
        "'speaker_2': 'There was a comment, I think, that Mr. Urie made about the arena numbers. We've been in discussions and I know others have too. There's a lot of momentum up in Sacramento to close that gap and to give cities that are enacting these programs arena credit.'",
        "'speaker_2': 'So just wanted to make the council aware of that. And lastly, just echoed the sentiments raised. Waterford is a good actor in the city and a good partner to launch this pilot program with. So thank you very much.'",
        "'speaker_2': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. Roll call vote, please.'",
        "'speaker_1': 'Councilwoman Sun has.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Ellen.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Pryce.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilman Sabina. Hi. Councilwoman Mongo.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilwoman Sara.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Councilmember Oranga.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Councilman Austin. I Vice Mayor Richardson.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_3': 'Thank you. I think that concludes the regular agenda. Mr. Quirk if that's correct. And that.'",
        "'speaker_1': 'Is correct.'",
        "'speaker_3': 'With that, great. I'm going to go on to a new business and any closing item. So I'm going to I'm going to start from I I'm sure that we all learned earlier today that our former mayor, Eunice Sotto, passed away.'"
    ]
}