{
    "Recommendation to, subject to review and consideration by the Personnel and Civil Service Committee in accordance with Long Beach Municipal Code Section 2.03.065, confirm Charter Commission appointments pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code; or in the alternative, if for some reason the Personnel and Civil Service Committee does not meet prior to or on February 17, 2015, waive the requirement for consideration and recommendation by the Personnel and Civil Service Committee in accordance with Section 2.03.065, and confirm Charter Commission appointments pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code.": [
        "'speaker_1': 'And I'm going to start off by doing number item number nine. And so with that, I'm going to turn this over. Both of these items relate to commission appointments. Item nine relates to the one charter appointment we're doing.'",
        "'speaker_1': 'And so with that, I'm going to turn this over to the clerk who can read the item and then over to Mr. Austin.'",
        "'speaker_2': 'Item nine is a communication from Mayor Robert Garcia. Recommendation to receive and approve commission board committee appointments to non charter commissions.'",
        "'speaker_1': 'Thank you. And I see a motion by Councilmember Austin and a second by Councilmember Turanga and I turn this over to the chair of the committee. Councilmember Austin.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I'm pleased to report that the Personnel and Civil Service Committee met this afternoon and we voted unanimously to reappoint Mr. Alan Fox to the Planning Commission to fulfill the term from 2014 to 2016. I'm asking for approval for the City Council from the full body of the city council.'",
        "'speaker_1': 'Thank you. There's a motion Councilmember Durango to join and make any comments.'",
        "'speaker_6': 'Yes. Mary, thank you very much. I just want to also congratulate our new appointees and re appointees. It's it's a it's a wonderful time. And we can say that you're community engagement is where it starts, where it starts, where you start looking at how the city functions and you lend your own wisdom and your expertize to the'",
        "'speaker_6': 'commissions that you participate in. And I really want to commend you for volunteering and stepping up to do that. I also want to throw a special shout out to my 2/7 District appointees, Veronica Quincy and Ramon Rhodes. Both are.'",
        "'speaker_6': 'Ramon is a student at Cabrillo High School, and I want to commend him for starting his path into leadership. And I'm sure that he'll find his appointment a very rewarding and and a learning experience. So, Veronica, thank you for your leadership.'",
        "'speaker_1': 'And just as a note that this item is just for Mr. Fox, his appointment, and then we're going to move on to all the other appointments. But that's okay. We like shoutouts, so so we're going to go with this.'",
        "'speaker_1': 'So I want to go ahead and please ask Alan Fox just to stand this is actually a please and said this is actually reappointment that I'll be making for the Planning Commission. Mr. Fox has been a resident of Long Beach for more than 23 years and is very active in our business community.'",
        "'speaker_1': 'He's an attorney as well. By profession, we had a chance to sit down and get to know each other as well and been very impressed with your long service to Long Beach and to the community. And he's been a lawyer for more than 40 years.'",
        "'speaker_1': 'So congratulations. Councilwoman Price is your biggest fan already just because you're a lawyer. And and we want to thank you for your work and your service on the Planning Commission prior and then your service moving forward. And so thank you.'",
        "'speaker_1': 'And to with that council members, we do have a vote. I think Councilman Alston want to make another comment.'",
        "'speaker_5': 'Yes, I did. And before I thought my my my cohort here, Mr. Urunga, was going to go into detail. But we do we're very proud to have Mr. Fox representing the Uptown Communities on the Planning Commission. I mean, you're going to bring a necessary perspective.'",
        "'speaker_5': 'You've already been there for several years. And as Mayor Garcia alluded to, you have a great deal of history in terms of public service to our city. So thank you again and congratulations again.'",
        "'speaker_1': 'Vice Mayor Lowenthal.'",
        "'speaker_7': 'I was just wondering if this was the time to thank our city attorney and city prosecutor again.'",
        "'speaker_1': 'What are they exactly?'",
        "'speaker_7': 'What's not very suspicious? I'd like to thank you all as well and congratulate you for this appointment. And I'm looking forward to the great work you're going to do. I know you're all very busy people, so it's very lucky for us that you're able to share this time with us.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. And before we go to a vote, I do want to make sure there's a I think, a small correction item. This is actually item ten, which would be the Alan Fox. So if we can just clear the board and then we're going to do ten, which is the this motion we're on and we're going to'",
        "'speaker_1': 'go to nine. Councilmember Austin was the maker of that motion. Customer Tauranga seconded that motion. Perfect. Any public comment on this appointment? Mr.. Good to you.'",
        "'speaker_4': 'Yes, Larry. Good. You click as the address. I thoroughly support the reappointment of Commissioner Fox. I've been before the Planning Commission one or two times over the years, and it's comforting to know that you will be there and have the insight because there's some some of those issues are one in particular is front and center.'",
        "'speaker_4': 'And we'll be coming back very shortly. And I think his perspective will be very, very helpful. Thank you.'",
        "'speaker_1': 'Thank you. Okay. With that, we have a motion in a second for the motion, which is to approve. Commissioner Fox, please cast your votes.'"
    ],
    "Recommendation to respectfully request City Council approval of the 2015 State Legislative Agenda as recommended by the State Legislation Committee.": [
        "'speaker_2': 'Item 11 is a communication from Councilman Al Austin, Chair, State Legislation Committee recommendation to request City Council approval of the 2015 State Legislative Agenda as recommended by the State Legislation Committee.'",
        "'speaker_1': 'Thank you. I'm going to turn this over to Councilmember Austin, who then will, I think, bring staff in for some report. Councilmember?'",
        "'speaker_5': 'Yes. And I'm going to turn it over to staff for a staff report. And then there can be council comment.'",
        "'speaker_9': 'Mayor, members of the city council before you tonight, we have our 2015 proposed state legislative agenda similar to the federal legislative agenda staff this year proposed to unpack our 2014 agenda and organize it into five categories of legislative interest.'",
        "'speaker_9': 'So I would say that the large majority of the items that we are used to seeing in our our legislative agendas are still in our new agenda. We just have a slightly new format that I hope will make the agenda a little bit more accessible and easy to discuss when we're meeting with our elected officials and state'",
        "'speaker_9': 'agencies. So with that, I'll I'll go into some of the five different categories and then we can talk about the proposed changes that staff has made. Next slide, please. Oh. All right. So the next slide, we have five categories of legislative interest.'",
        "'speaker_9': 'The first one is economic development. And in each category, you'll see there is a blue box on the first page with the highlights or the objectives for each category. So in economic development, we have cultivated a healthy environment to support sustainable economic growth, support community oriented businesses, support arts, tourism and culture, promote diversity and inclusiveness and support'",
        "'speaker_9': 'workforce development activities that align with industry needs. And in 2005, our focus in economic development will be to support and sponsor actually legislation to maximize the economic potential of our new language civic center project. We're also still working with the State Department of Finance to obtain approval on the city's long range property management plan, as was submitted'",
        "'speaker_9': 'to the DLF back in October of 2013. And this is the plan that the city's successor agency put together for all the former RDA properties that we're hoping to get back. And last but not least, with the end of the Enterprise Zone program and with the dissolution of redevelopment, the Governor's Office of Governors has a couple of'",
        "'speaker_9': 'tax credits that they're offering to small businesses. And it's my hope that we can make this more accessible and at least inform our community more about those tax credits. The next category. Thanks is public safety. And again, we have our objective statements in the blue box that you'll see in front of you and then in 2015.'",
        "'speaker_9': 'Our focus in this area will be to obtain funding for realignment related public safety operations. As you know, with AB 109 and with the passage of Proposition 47, we have a number of new public safety responsibilities that we are responsible for.'",
        "'speaker_9': 'And that, of course, comes with costs. We're also interested in supporting the County of Los Angeles with their programs to encourage mental health treatment programs instead of simply incarceration. We're also monitoring very closely medical marijuana legislation at the state level and per the agenda that the council had adopted previously.'",
        "'speaker_9': 'We'll support legislation that clarifies medical marijuana laws and in order to enable clear enforcement of state law while protecting the city's authority to establish municipal codes to regulate medical marijuana activities. And we will also be monitoring body cameras, as I know that that is an interest of this council.'",
        "'speaker_9': 'Next slide, please. Education is something that I've heard this council discuss quite often. And so for that reason, it is added as one of the five categories of legislative interest, and in 2015 will be focusing on supporting legislation and initiatives that provide funding for early childhood education or pre-K.'",
        "'speaker_9': 'We're also interested in supporting the limited unified school decision which city college? The California State University of Long Beach, where education and our interests as a city align. And then, of course, we want to support and expand upon the Long Beach College promise.'",
        "'speaker_9': 'Next slide. Sustainable, livable cities is the bleakest section of our legislative agenda. This covers affordable housing, sustainable practices, sustainable transportation. And so you'll see that the focused elements here reflect that. One of the things that the state is working on is implementation of the cap and trade program.'",
        "'speaker_9': 'These are revenues that are being collected from greenhouse gas emitters, and they're being provided to local governments and other entities to reduce greenhouse gas emissions. And it's our hope that we receive some of those fundings to improve our air quality and reduce greenhouse gases in Long Beach.'",
        "'speaker_9': 'And so that's an effort that's been taken on by caliper the Strategic Growth Council and SKOG as the Metropolitan Planning Agency for our region. A lot of those efforts are consistent with the cities mobility element, which promotes sustainable transportation.'",
        "'speaker_9': 'And so those two go together quite nicely. In Long Beach, we also have a waste to energy facility. Cerf, as you know, is the Southeast Resource Recovery Facility. And at surf we are able to turn municipal solid waste into electricity, which is quite unique.'",
        "'speaker_9': 'We only have three of these in the state of California. And so any way that we can maximize the economic benefit of surf and do it in an environmentally sustainable and reasonable manner, is is good. And so we're looking to continue that.'",
        "'speaker_9': 'And we also want to maximize partnerships with Long Beach Transit. Next slide, please. And last but not least, is local control. I think in the last several years we have lost a little bit of local control with with the demise of redevelopment and enterprise zones and some of the limitations that have been placed on affordable housing.'",
        "'speaker_9': 'And so this section of the legislative agenda is mainly to support the support implementation of plans that have been adopted by Long Beach City Council Violence Prevention Plan, Long Beach Housing Element, the limits, mobility elements, plans such as that.'",
        "'speaker_9': 'So in short, that those are the highlights for our 2015 proposed state legislative agenda. I did want to highlight that we have several amendments that we staff is proposing to to the agenda. And I'll just call your attention to four of those very quickly.'",
        "'speaker_9': 'One includes an addition of language to support covering petroleum Coke products during transport, similar to the language that was added to the federal legislative agenda. Another is to amend the language that was already in the agenda for surf to sort of updated to reflect the city's ongoing discussions with the governor's office and current cycle on perhaps developing'",
        "'speaker_9': 'an incentive program to foster innovative partnerships that promote sustainability, recycling and beneficial reuse of municipal solid waste. And last but not least, the city is proposing to add language in here that would allow us to support responsive legislation to clearly define that the historical life rate is the rate that we use to calculate interest on agency in'",
        "'speaker_9': 'city loans that we expect and hope to receive back from the dissolution. So with that, I turn it back to Chairman Austin.'",
        "'speaker_5': 'And thank you, Mr. Herring, for that very comprehensive report. And as you can see, we have presented a digest version here for the council. There is a lot more detail in your your staff report here before this body.'",
        "'speaker_5': 'I also wanted to just just add that Councilmember Andrews serves on the state legislation committee with me, and we thought it was very important to include the Council Directive regarding the minimum wage and in terms of economic development and under local control.'",
        "'speaker_5': 'You may have mentioned it, but we really and I think it's extremely important that the city of Long Beach seek to be represented on regional boards throughout the region, including the Metropolitan Transit Transit Authority, the HQ, M.D. We are a large city and we I think deserve a seat at the table at all times.'",
        "'speaker_5': 'And so we're going to be working with the state legislators to to achieve that. To that end. And then also there was a council directive regarding pers retirement. We we thought it was important to talk to legislators and seek support for clean up legislation regarding the CalPERS reform pension reform to support legislation that would amend the state'",
        "'speaker_5': 'law to clarify, former public employees who retire under the PA system are exempt from reinstating their retirement if they become employed again by PERS agency by virtue of becoming an elected official. As it stands right now, those who are elected to office, who are former city employees or former employees of the state jeopardize their their their retirement'",
        "'speaker_5': 'by serving the public in that regard. And I don't think that was the intent of the pension reform governor's pension reform legislation that was passed in 2013. And so with that, I would just ask for unanimous support of this body so that we can go forward to Sacramento and and advocate for Long Beach.'",
        "'speaker_5': 'And these are great policy initiatives that we have put before you.'",
        "'speaker_1': 'Thank you. And I want to thank Councilmember Austin and Councilmember Andrews for for their work on this. And just as a side note that the committee will be taking a trip to Sacramento fairly soon. So it's important that we have this wrapped up.'",
        "'speaker_1': 'I have Councilmember Durango.'",
        "'speaker_6': 'Thank you, Mayor. I want to commend the key committee for their work on this and also for the put in the law control directives that are there, especially for the project that we've been talking about that for a while.'",
        "'speaker_6': 'I've been I've been speaking to some of our state legislators about this. And there's a agreement that there's something wrong with the paper, with the public employment, public employees, retirement. Then I forget the name of pension reform. There you go.'",
        "'speaker_6': 'The Public Employee Pension Reform Act. Because I mean, we've seen it here in the city already. We had a candidate who was eligible to run in the fourth District, withdrew his nomination or his candidacy because of the fact that he is a poor retiree.'",
        "'speaker_6': 'Nobody should have to make that kind of decision. If a person wants to serve to continue their public service, they should be allowed to do so without fear of losing their pensions. And so I want to thank the council members for putting this on the legislation docket.'",
        "'speaker_6': 'I also want to commend them for dealing with the the covering of coal products on trains. It's very important that we do that. Obviously, it was a a big issue way back when we first got on. Well, when I first got into the council was a it was a very contentious and very versatile, controversial, controversial vote that'",
        "'speaker_6': 'had to take place. But we're addressing it. And I think that if we can get some kind of legislation passed within this year or next in regards to covering the products when they come into law, which I think we will have come a long way in addressing those issues that are important to our constituencies, and especially when'",
        "'speaker_6': 'it comes to West Long Beach and to our ports. And that's at both the state level and the federal level. And I want to thank all the council members involved with those two issues so they can put in this forward.'",
        "'speaker_6': 'I'm ready to work to support it.'",
        "'speaker_1': 'Thank you, Councilmember. Councilmember. Councilwoman. Mongo.'",
        "'speaker_9': 'Thank you. I'd like to thank the state legislative committee. I think you did an excellent job in really focusing on local control and incentives and set of penalties for businesses in our community. I'd also like to say that this council is made up of.'",
        "'speaker_9': 'For alumni or current government employees. And I think that we bring an excellent perspective, and I think that the Peprah law is a disadvantage to good government and the future of good government if it disincentivizes those of us who work day in and day out in the system.'",
        "'speaker_9': 'It really takes a perspective away from the counsel options. And I know that in the years that we've had many, many alumni, city and county employees serve on this council. And so I look forward to seeing a resolution.'",
        "'speaker_1': 'Thank you. Councilmember Andrews.'",
        "'speaker_4': 'Yes, and thank you, Mayor. I also would like to commend our chair, Mr. Austin, for this, because the fact that I think the sooner we get this to, you know, to Sacramento, the sooner this thing will be able to come to fruition.'",
        "'speaker_4': 'And I'm hoping it will come as soon as possible, because the fact that we do have some people who could be affected by this, and I'm really hoping that they will take these issues under consideration and do the right thing.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Price.'",
        "'speaker_8': 'Thank you. I, too, want to thank the committee. And I think it's it's very, very important that you represent the interests of our city when you're in Sacramento in terms of some of the key issues that are going to be impacting us.'",
        "'speaker_8': 'I want to talk for a moment about the public safety issues. You know that the voters enacted some legislation that has severely impacted public safety and specifically the city and our ability to be able to enforce the laws and to maintain some level of peace when we have the inability to be able to provide the resources to'",
        "'speaker_8': 'the offenders that they need in terms of probation services, police services and that kind of thing. And I think that's very important that we address those issues in terms of how they're impacting our cities with the number of probationers that we have out in the community and our inability to be able to service them properly.'",
        "'speaker_8': 'So that's a that's a key issue. I think it's a county issue, but I think it's also very, very much a city wide issue. And it's ripe for for discussion at that level in terms of the kind of resources that might be available to help us deal with the changes in the law.'",
        "'speaker_8': 'I also like the addition of the language that you have that you've included in there for minimum wage in the sense that it looks that you are it's definitely a discussion that's taking place on a national and statewide level, and that the acknowledgment that in the city of Long Beach, it's going to be very important if the'",
        "'speaker_8': 'state were to engage in these discussions, to think about a tiered approach so that it affects our businesses in a in a manner that is over time and not a direct hit in a very sudden period of time.'",
        "'speaker_8': 'So I appreciate you taking that into account as you move forward with our state legislative agenda item. So thank you.'",
        "'speaker_1': 'Thank you. Councilmember Richardson.'",
        "'speaker_3': 'Thank you. I want to thank Councilmember Austin and the rest of the folks who participated on the state legislation committee. And I just would like to note that there are a number of things in this in this agenda I see that are also in Fed language.'",
        "'speaker_3': 'So, you know, state and federal approach. I think that's the way to go. So thank you for doing that. And I and I really like the the new streamlined process. So I want to congratulate staff on doing a good job on putting together this prezzi and streamlining our our general agenda similar than what to what's done in'",
        "'speaker_3': 'the Federal Commission.'",
        "'speaker_1': 'Okay. Thank you. Are there any public comment on the State Ledger report? Sinan again. Thanks to the committee members for their work, please go and cast your vote.'",
        "'speaker_2': 'Motion carries seven zero.'",
        "'speaker_1': 'Thank you. Item 12.'"
    ],
    "Recommendation to receive a report on incentives to encourage small business recruitment, retention and growth and approve the recommended Incentives for Small Businesses Program; and  Request City Attorney to prepare any necessary documentation to implement the Program.  (Citywide)": [
        "'speaker_2': 'Item 13 is a report from financial management. Recommendation to receive a report on incentives to encourage small business recruitment, retention and growth. And approve the recommended incentives for small businesses program. And require city attorney to prepare a necessary documentation to implement the program.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'I think I have a motion by Councilwoman Pryce in a second by Councilwoman Mango. I'm going to turn this over to Councilwoman Pryce.'",
        "'speaker_8': 'I'd like this motion to direct the city attorney's office to prepare this in the form of an ordinance, if that's possible. Mr. PARKIN. Is that possible?'",
        "'speaker_6': 'Mayor. Councilman. Councilwoman Price. Yes, it is possible. We we initially drafted this and I'll let Mr. GROSS speak to it, but it seemed like there were some various options. And so when we brought it to council, I wasn't we weren't sure on which direction to take.'",
        "'speaker_6': 'You could come in the form of administrative policy, a resolution or an ordinance. So depending on the direction of the Council, we could work with staff and prepare it.'",
        "'speaker_1': 'Okay. Thank you. And I'll turn this back over to the councilwoman.'",
        "'speaker_8': 'Thank you. And Mr. Parkin, in terms of one of the things that I think we've been kind of interested in is what the impact of this was going to be. So we wanted to bring it back at some point so that we could see, you know, how many businesses have taken advantage of this incentive package, what that'",
        "'speaker_8': 'cost has been. How would that impact an ordinance if we were to go that route?'",
        "'speaker_6': 'I don't see the requirements to report back or the reporting requirements would necessarily be included in the ordinance itself. I think once the incentive program is is flushed out and we put it in the form of an ordinance in some format, I think direction from council staff could direct, it could be directed to come back at appropriate'",
        "'speaker_6': 'periods of time to report.'",
        "'speaker_8': 'Okay. And so with that, you know, I'd like to modify my motion, if that's possible, to request the city attorney to come back with an ordinance that puts this incentive package, has all the components of this incentive package, and to have it come back to council in six months for a review of Mr. GROSS, do you think'",
        "'speaker_8': 'that's a reasonable time period?'",
        "'speaker_6': 'I think six months for the preliminary review. It may take a bit longer to get a full report because the program needs a start up time.'",
        "'speaker_0': 'What.'",
        "'speaker_6': 'Councilwoman Price? I think if you're talking about six months, if we come back with a proposed ordinance, it will come back, of course, for first reading, second reading. And then approximately 31 days after the mayor signs, it'll go into effect.'",
        "'speaker_6': 'So the six months following the effective date of the ordinance is that.'",
        "'speaker_8': 'Let's do one year, give us some more time to collect data. So that would be my motion. I want to thank John GROSS, his office, for putting this incentive package together and for helping us come up with ways that we can assist small businesses by giving them some incentives for growth and establishment in the city of Long'",
        "'speaker_8': 'Beach. I do want to request that this particular ordinance, once it's drafted, be forwarded to our new Economic Development Commission so that they can work within the parameters of this ordinance to figure out how to market it and make it a practical reality for businesses, both those who are currently in existence and may be looking to expand'",
        "'speaker_8': 'their operations, or those wishing to relocate to the city of Long Beach who might qualify for an incentive so they can work with this ordinance to come up with a marketing strategy and a plan by which business owners are advised of these opportunities.'",
        "'speaker_8': 'But we don't want to have is is a policy that is not really being utilized or many business owners are unaware of or an ordinance. So that would be my recommendation as well. Thank you.'",
        "'speaker_1': 'Thank you. And so.'",
        "'speaker_6': 'Mr. Parking Mayor, members of council, if if there was if I could clarify. So the direction now is for the city attorney to prepare a draft ordinance for review by the Economic Development Commission prior to coming back to the City Council for first.'",
        "'speaker_1': 'To, you know.'",
        "'speaker_8': 'Clarify the direction would be for the city attorney's office to prepare a draft ordinance that would come back to council. The Economic Development Commission would then have the ordinance once it's been approved by council, and they would have, at our request to review this ordinance, to review this incentive package and come up with strategies and and methods'",
        "'speaker_8': 'of marketing it and making it known to the business community so that they could take advantage of the incentive program.'",
        "'speaker_1': 'Great. That's a great idea. There's a I think the motion is clear. I'm going to go to Councilman Mongo and then the speaker's list. I'm sorry. Councilman Price, were you all done? Okay. Councilman Mongo.'",
        "'speaker_9': 'I just want to give extreme thanks to the staff and the EDF Collaborative Committee, and this ordinance demonstrates to our businesses that Long Beach will take the steps to become a leader in supporting our local businesses and incentivizing them to grow more jobs for our residents.'",
        "'speaker_9': 'And these are the types of programs, along with the appointment of the Economic Development Commission, that really will go a long way in demonstrating to businesses that we're a new council. We're here to be business friendly. Long Beach is the place you want to come to partner.'",
        "'speaker_9': 'And Long Beach is the place you will grow and strive as a business so long as we know that. This business ordinance will be an incentive to help all businesses, and it will not infringe upon any of the incentives or requirements of our local business improvement district or any of the other programs we already have in place'",
        "'speaker_9': 'that are very successful in supporting our businesses.'",
        "'speaker_1': 'Thank you, Councilmember Richardson.'",
        "'speaker_3': 'Thanks. And I want to I want to give some credit, some accounts to my fellow colleagues for bringing this forward. This is outstanding. I've seen as a number of folks have discussed and talked about doing something like this, but to see it in this format and know that we're moving forward, it's it's it's a good thing.'",
        "'speaker_3': 'Just a couple of things to note. So just on the on the incentive for renovation discussion and construction for small businesses, it says that this would only work for businesses if it if it's a construction cost of above 40 $500.'",
        "'speaker_3': 'So. So if someone wanted to let's say that they were in a not in a CDBG eligible area and they wanted to improve their facade and it might not cost 40 $500. I think this should be a good incentive for those folks.'",
        "'speaker_3': 'So we can't use CDBG dollars for. So I want to talk through that piece a little bit. So so how would that work? And is this something I mean, so, Mr. City Attorney, is it true that only it would have to be 40 $500 or above for for a facade project?'",
        "'speaker_1': 'Mr. GROSS. I think I might be able to get the gross.'",
        "'speaker_6': 'The program, as written, is intended to say that if there is a permit pulled for any work that exceeds 40 is 40 $500 or higher, they will be eligible for this incentive period independent of any other program.'",
        "'speaker_3': 'Okay. I would ask with the makers of the motion, be interested in a just in that down some I think some of the small businesses, particularly in Artesia, they don't have we don't have the redevelopment and some of them aren't in CDBG eligible areas anymore.'",
        "'speaker_3': 'So we always find ways to just help them get open and get their sign open and all that so we can take it down on the $2,000.'",
        "'speaker_8': 'I'm okay with that. But I just want to make sure with Mr. GROSS that that doesn't put our fiscal impact.'",
        "'speaker_3': 'Well, I'll get to that. That's my next.'",
        "'speaker_8': 'Estimate of that doesn't skew it too much.'",
        "'speaker_6': 'And the amount is is a scientific guess. And certainly I think more people would be eligible, but I think it would be up to council. I think we could live with a slightly lower amount.'",
        "'speaker_3': 'Yeah. Most of these projects are not going to reach $5,000. They're going to be 2500 to 4, 2500 to $4000. So this just means that we will be able to use that. This will be another tool and tool in the tool kit for small businesses.'",
        "'speaker_3': 'So you go with that friend.'",
        "'speaker_8': 'I'm okay with that. I think Councilwoman Mongo had some ideas, too, on that.'",
        "'speaker_3': 'I still got the floor.'",
        "'speaker_9': 'Well, we're the makers of the motion. Yes, we were. When I was thinking through the original incentive. One of the benefits is if you were looking at doing an an improvement project and it only cost $3,000, you'd maybe go the extra mile to do it above and beyond to the top level to then be able to be'",
        "'speaker_9': 'eligible for the incentive. Does that change any of your thoughts? I mean, what does a typical improvement project cost?'",
        "'speaker_3': 'I mean, traditionally so if we so a lot of times we use the $2,000 rebate as incentive for people to do anything. To the front of their operation. In some areas, this is not available. So sometimes just the the the mere incentive is enough for them to actually take a look and say, hey, this is worth a'",
        "'speaker_3': 'few thousand bucks.'",
        "'speaker_9': 'So are you saying that if it was a $2,000 project, we'd pay for it completely? Or are you saying that if it didn't qualify for the full 4500, that we would incentivize it by paying for half?'",
        "'speaker_3': 'No, I'm just saying the same program this year.'",
        "'speaker_9': 'All the way down to.'",
        "'speaker_3': '2000. We take it down to 2000. Is that a 4500?'",
        "'speaker_9': 'Do you have an estimate of how many you think are going to apply for that? Just so we are thinking the fiscal.'",
        "'speaker_3': 'Our director of financial management has said this entire thing is a scientific guess. Right. I'm not going to try to guess more science. Okay. So and then the next thing on fiscal impact, I see maybe three or four sentences down.'",
        "'speaker_3': 'It says, because of improving economy and the low impact of the cost of this program, it's believed that there will be enough on budget at one time revenue to fund this balance, this program for the balance of 2015, subject to the impacts associated with the decline in oil revenues.'",
        "'speaker_3': 'So I guess my question is, since we had the conversation about on budget at one time revenue last week, was that considered? Here were the funds that we allocated last week, the funds that we're talking about here.'",
        "'speaker_6': 'Yeah. We think we're okay with this, even with the allocation of funds.'",
        "'speaker_3': 'So we have mystery money.'",
        "'speaker_6': 'But what we're saying here, council member, is that we believe and we're still working on the projections, but we believe that the revenues and FY15 will have will likely have enough surplus there. They are moving in a positive direction to cover this relatively small amount.'",
        "'speaker_6': 'In terms of our overall revenues. Great.'",
        "'speaker_3': 'Thank you very.'",
        "'speaker_4': 'Much. You're welcome.'",
        "'speaker_1': 'Okay. Thank you. And just just to clarify, also a question for myself on this, on the last conversation that happened, if staff can remind me the. The community block grant amount with the eligibility that the maximum is at 2500 or is it two?'",
        "'speaker_1': 'It's 2000. And remind me what the signage grant that we already provide that 2000 or 2500.'",
        "'speaker_6': 'I believe they're both 12.'",
        "'speaker_1': 'So they're both 2000. So so it's a total of 4000. If you are in a community, if you are in one of the zones, you can receive up to 4000. Is that correct?'",
        "'speaker_6': 'If you do signs and a facade, if you.'",
        "'speaker_1': 'Decide a facade, you can proceed with the four, right?'",
        "'speaker_6': 'No.'",
        "'speaker_1': 'Well, I thought that was the case.'",
        "'speaker_3': 'So you get so the sign facade program is the same. It's the same program. So you don't have to spin on a sign. You can use it on a facade. You can get 4000 if you're a new business, the property owner can get 2000.'",
        "'speaker_1': 'And that's exactly that's exactly okay. That's what I was trying to remember with.'",
        "'speaker_3': 'So the property owner and the business can both join the 2000.'",
        "'speaker_1': 'Okay. So let me let me go.'",
        "'speaker_3': 'There's a like a storefront with.'",
        "'speaker_1': 'No, get it. Yeah. Yeah. Okay, so let me go to city staff. Did you have an additional comment on this?'",
        "'speaker_6': 'Yes, Mayor. Councilmembers were incredibly excited about this program. We just heard about the ordinance aspect of it tonight. So that has a different aspect. So our thoughts might be we don't know how this is going to roll out.'",
        "'speaker_6': 'Just tonight, you can see we're talking about 4500 to 2000. Once you make an ordinance, you're stuck. That's it. And I'm just thinking, Mr. GROSS commented that earlier, maybe this could be like a six month or one year pilot program if the council chooses to the ordinance who were hoping, perhaps give it a sunset in a year'",
        "'speaker_6': 'and then the Economic Development Committee could adjust it or the council could adjust it and give them more of an opportunity to play with this as opposed just simply to market it. But our concern is once it goes in ordinance, we're not going to have the ability to tweak it if indeed what we're proposing needs to be'",
        "'speaker_6': 'tweaked.'",
        "'speaker_1': 'If you what you could do is have a sunset having to renew the sunset, which we've done before. It'd be up to the makers of the motion, though.'",
        "'speaker_8': 'I think that's a great idea if we sunset it. But I'm just trying to think about the date. Would we would ideally a year out.'",
        "'speaker_6': 'Six months or a year we're comfortable with either.'",
        "'speaker_8': 'Or in line with the fiscal year.'",
        "'speaker_6': 'It could be fiscal year. Whatever works for the council, I would recommend the fiscal year.'",
        "'speaker_8': 'Okay, let's do that then.'",
        "'speaker_1': 'Okay. Thank you. Let me go down the speaker's list. Vice mayor of Louisville.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I wanted to thank the staff as well. I'm very supportive of the program and in the conversation we just had, and I apologize if I missed it. Of the 200,000 or less required for implementing the program, did you determine how much would be set aside for the incentives?'",
        "'speaker_7': 'Does that? I don't mean the individual incentives that we just talked about, but in total.'",
        "'speaker_6': '200,000, the entire amount.'",
        "'speaker_7': 'Okay. Okay. And then. If we're doing. Was it just decided that we're doing the ordinance route or sunsetting through the ordinance? Correct. Okay. And then at the time when the ordinance comes back, are you expecting any kind of a report from staff?'",
        "'speaker_1': 'It's part of the motion. Yeah. Okay.'",
        "'speaker_7': 'Thank you. I appreciate that. And then. The challenge always becomes how long does it take for someone to go through the process? And so. Do you have an established time frame? For applications and how long will that take?'",
        "'speaker_7': 'And the and let me just add a caveat. We had great incentive programs that a lot of our quarters took advantage of years ago through the Neighborhood Resource Center. And and I think some of it became a staffing issue and really a challenge in processing the number of applications that came through.'",
        "'speaker_7': 'And then it also became a resource issue. And that might not be relevant with this, but. If we're asking council offices as well as others to let people know about this opportunity, I think we want to be able to manage expectations as well.'",
        "'speaker_6': 'The committee charged staff with making this a very simple process. And we believe that the application process will be simple and quick. There are not a lot of requirements. The forms that are required or the information that is required is minimal.'",
        "'speaker_6': 'There are very few and in the way of tests. So in working with the city attorney to convert this to an actual program that you would adopt, I don't think we will need additional staff. That's just a guess and I don't think it will take very long.'",
        "'speaker_6': 'So, meaning the process, I suspect is submitting a form, looking at a permit, construction permit. It will be a simple process.'",
        "'speaker_7': 'Okay. Thank you. That's it, Mr. Mayor.'",
        "'speaker_1': 'Thank you, Councilmember.'",
        "'speaker_5': 'Thank you. And I think the city manager opined in on my major concern, and that was just the ordinance approach, thinking that that would lock us in. I do want to compliment Councilmember Price and Mongo for thinking out of the box and their efforts since they've been on this council to to really try to turn around that'",
        "'speaker_5': 'image and to make Long Beach business friendly. I think. And in making this a pilot program, this also affords the economic new Economic Development Commission the ability to to to vet this as well and make further recommendations to make the program even more responsive to our small businesses throughout the city.'",
        "'speaker_5': 'So with those comments, I'm prepared to support this and look forward to a report back from the Economic Development Commission as well as staff in in a year or so.'",
        "'speaker_1': 'Thank you, Councilwoman.'",
        "'speaker_8': 'Thank you, Mr. Mayor. I did have a couple of other points that I just wanted to clarify. It was not the intent behind this legislation for this any sort of business license incentive to apply at all to the bids.'",
        "'speaker_8': 'And I just want to make sure staff is on board and agrees with that. That's everybody's understanding.'",
        "'speaker_6': 'That's correct.'",
        "'speaker_8': 'Okay. And then the other thing is and this was an issue that was pointed out to me, and I think it's a good one in terms of the incentive to create jobs. How is it that we're going to, you know, fact check?'",
        "'speaker_8': 'Is that kind of a an honor system in terms of how the information on number of employees is presented to us? I imagine if they want to qualify for the incentive, they're going to have to report an increased number of employees than the subsequent year.'",
        "'speaker_8': 'They'll have to pay the fees associated with that increased number of employees unless they've terminated or downsized. Is that correct?'",
        "'speaker_6': 'That is correct. And just as a clarification, so there's no misunderstanding on the bids. There is the the businesses that are in the bid will qualify for this incentive. That's so it's all a positive thing. There are no cost to the bid or no revenue reductions to the bid, but the businesses there will qualify.'",
        "'speaker_0': 'Great.'",
        "'speaker_8': 'And then and then in terms of the the the headcount on the employee, the number of jobs created and such, I imagine that it would not be in the best interests of the business to report a higher number than they actually have, because then the subsequent years after the year, the incentive they'd be responsible for any fees'",
        "'speaker_8': 'associated with that number of employees.'",
        "'speaker_6': 'That is correct. And we will be using what they certify and report to us. It'll be a simple process. Okay.'",
        "'speaker_8': 'I know that the Economic Development Commission is going to look at some of the marketing concepts and really look at this as an item that they're going to try to make practical. But in terms of our business license department, do we have any immediate plans for how we're going to promote this new incentive package to existing businesses'",
        "'speaker_8': 'or any new businesses? Are we going to send a letter? Are we going to give anything out at the counter? Are we going to post that on our city's Facebook page? Do we have a small business, you know, email list that we can go to?'",
        "'speaker_8': 'What are we going to do to let people know that this isn't an opportunity for them to take advantage of in the coming year?'",
        "'speaker_6': 'We're still working on that, but the immediate things are notifying people in the counter and having signs and verbal notification website and we may put together, but it'll depend on what the commission says. It may be that a brochure is appropriate at the very least.'",
        "'speaker_6': 'So I think all of those things.'",
        "'speaker_8': 'Thank you, Mr. GROSS.'",
        "'speaker_1': 'Thank you. And now do it, Mr. Park. Jiffy.'",
        "'speaker_6': 'I did a mayor member of the council just on the change to the ordinance under the incentive amount. If I. If it was accepted as a friendly amendment to reduce the 4500 to $2000. And then the second part of that sentence talks about or construction exceeds $9,000.'",
        "'speaker_6': 'Would there be a subsequent change to that dollar amount or does that remain at $9,000?'",
        "'speaker_8': 'I wasn't contemplating a change, but I'm open to that. If Councilman Richardson feels that that would help the businesses in his district. We certainly can look at modifying that.'",
        "'speaker_3': 'So this is if the the incentive amount equal to the total amount of one year of the business license if the total value of the renovation exceeds 4500. So then that would change the 2000 or an amount equal to two years the business license tax if the total of the renovation exceeds 9000.'",
        "'speaker_3': 'I know that seems kind of redundant. If the total value exceeds 4500 or over two years, if it exceeds 9000. I mean, the whole idea is if you want to break it up over two years, it has the.'",
        "'speaker_6': 'No, the the intent was to at a certain level, I'll use the original intent at 4500, you got a incentive equal to one year of the business license. If you spent $9,000, you could break it up over time.'",
        "'speaker_6': 'You can bring up two years of worth of incentive. You double the incentive amount.'",
        "'speaker_3': 'So the so you can only do it up to two years.'",
        "'speaker_6': 'Yes. Yes. The VAT a value equal to two years. So right now you have a one you have an incentive equal to one year of the business license fee at $2,000. And then you have to go to $9,000 to get the second year.'",
        "'speaker_3': 'Hmm. So. So I think the spirit of it, I think the spirit of what you wanted to do was just double the number. Is that the general spirit of what you wanted?'",
        "'speaker_6': 'That was the original intent.'",
        "'speaker_3': 'It will make sense for it to be if we're going to 2000 and it should go to 4000.'",
        "'speaker_0': 'It's only.'",
        "'speaker_8': 'I'm okay with that.'",
        "'speaker_3': 'I mean, honestly. If that's the spirit of it, it seems like it's just the right thing.'",
        "'speaker_8': 'I agree. And just to be clear, because I think there's some comments, we're not like paying for people's remodel. We're not you know, we're not giving away money. It's they're they're getting their business license fee waived for one year.'",
        "'speaker_8': 'It's not like we're doling out money.'",
        "'speaker_0': 'So.'",
        "'speaker_1': 'Okay. Great. Councilmember Austin.'",
        "'speaker_5': 'Yeah. So just one point. Mr. GROSS, you said this would the implementation would be under $200,000 annually. Is there any appetite from the council to to to kind of codify that, to make sure that we don't kind of lose control of this, you know?'",
        "'speaker_5': 'Maybe capping it at $200,000.'",
        "'speaker_8': 'I think that seems reasonable. Mr. GROSS, would you prefer that we do that? Because I know this is just an estimated guess based on we have never had anything like this before, so we're just guessing on what the the fees would be.'",
        "'speaker_8': 'I imagine that at some point, if it exceeded 200,000, you'd come back to us and tell us there was no money.'",
        "'speaker_6': 'I think that's what we prefer to do, is to come back and report to you.'",
        "'speaker_8': 'And I'm okay with that. If council is okay leaving it at that, it's somewhat fluid and I think we need to allow the program to be somewhat fluid and not really set any hard parameters at this time. I imagine that city staff will come back to us if they are in a position where they're concerned about resources'",
        "'speaker_8': 'to be able to cover this incentive package.'",
        "'speaker_5': 'Well, I just I'm okay with that. I just know this is going to be tremendously successful. And so, you know, the expectation was 200,000. But if it comes back and it's 1.2 million, don't be surprised.'",
        "'speaker_8': 'Well, I'm hoping that Mr. GROSS is willing to be a little bit flexible and allow it to go to maybe to 20 to 30 to 50. You know, somewhere around that number can help out a couple of extra businesses there, I think.'",
        "'speaker_1': 'Thank you, Councilman Richardson.'",
        "'speaker_3': 'I think in the same spirit, I know there was a conversation about doing a bunch of outreach for these. And I would just just as a note, just I think when I think of a pilot, I think of it being sort of targeted outreach, like maybe partnering with the bids and things like that.'",
        "'speaker_3': 'So we know what we're up against before we go out with the big push. So just a word of caution like, you know, we we've done pilot, I've seen pilots before and they weren't they didn't work out the right the way you anticipated they that they work out.'",
        "'speaker_3': 'So I would just say maybe this first six months or however long we're doing this pilot, maybe we should just be targeted about our outreach.'",
        "'speaker_1': 'Thank you. I think that is the entire speaker's list. Councilman Mongo.'",
        "'speaker_9': 'I would hope that in our outreach that we all put it in our newsletters. I know that in my district, the areas of business that struggle the most are the ones that actually can't get a bid together yet.'",
        "'speaker_9': 'And we're working together to get that bid in place. But we need to really reach out to all our struggling businesses, especially the ones that don't have the benefit of a community of business leaders together. And hopefully they'll see this as the type of thing that will hopefully coalesce them into a reasonable community.'",
        "'speaker_9': 'But thank you for the ideas.'",
        "'speaker_1': 'Okay. Thank you. That is all for the item. Is there any public comment? Please come forward.'",
        "'speaker_4': 'Good evening, Mr. Mayor. Members of the City Council, Craig Cogen. And this evening I'm representing the Council of Business Associations, and I want to thank Councilmember Price and Councilman Mongo for bringing this item forward. And thank you to Councilmember Price for meeting with us yesterday, Blair and I yesterday to talk about this issue and some of the'",
        "'speaker_4': 'specifics behind this proposed ordinance. And I'm I guess I'm happy to hear that we are moving from an ordinance to. Is this an administrative policy? No, it's not. So it is remaining an ordinance, a temporary ordinance.'",
        "'speaker_1': 'Mr. Cogen It's an ordinance with with a sunset at one year that will renew at the fiscal year.'",
        "'speaker_4': 'Okay, great. So what we'll look forward to and especially after the commission has a chance to review it, but using the Council Business Association as a conduit, as an outlet to its potential businesses as well as its existing businesses, to market this project and market this resource heavily to.'",
        "'speaker_3': 'Its.'",
        "'speaker_4': 'Stakeholders as well as its potential business owners. Because I feel as though that we could do a tremendous amount of good to notify these stakeholders and be able to allow them to take advantage of this resource, but at the same time review the measurable results and to make sure that it's meeting our reasonable expectations established at the'",
        "'speaker_4': 'outset. Okay. Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mayor. Council Members Jeremy Harris, Long Beach Area Chamber of Commerce. I would just echo what Mr. Craig Cogen has already stated and said that the chamber stands willing and ready to assist with that marketing push and be a communicator for other council members.'",
        "'speaker_4': 'Thank you to the leadership to Councilmember Price and Councilmember Mongo for bringing this item forward as well. Thank you. Thank you, Jeremy.'",
        "'speaker_1': 'At sea. No other public comment. We will go out and take a vote. Members, there's a motion on the floor. Members, please cast your votes.'",
        "'speaker_2': 'Motion carries seven zero.'",
        "'speaker_1': 'Great. And I want to want to congratulate the committee. I want to congratulate Councilwoman Pryce and Councilman Mongo for putting this on the agenda and kind of moving it forward. I think it's really great for the city and also staff.'",
        "'speaker_1': 'Staff. Actually, we also worked pretty hard on this, too. And so. Mr. GROSS and your whole team and. Mr. West, thank you. Thank you all for working with the council offices and on moving this thing in the right direction.'",
        "'speaker_1': 'And we're still out there at the early phases will be getting an ordinance back from the city attorney here in the next week or so to move this forward. So thank you all. Next item.'"
    ],
    "Recommendation to request City Manager to provide an update to the City Council on the status of the replacement of the citywide Financial and Human Resources Management Systems.": [
        "'speaker_2': 'Item 18 is a communication from Councilman Al Austin, Councilwoman Susie Price, Councilwoman Stacy Mango and Councilmember Roberto Durango. Recommendation to require city manager to provide an update to the City Council on the status of the replacement of the citywide financial and human resources management systems.'",
        "'speaker_5': 'Councilmember Austin Yes, I think this agenda item is pretty self-explanatory. Yes, the council and the 2014 2014 budget appropriated close to $10 million, about $2 million for a new financial H.R. financial management systems. I want to find out an update as it as it has been, a significant expenditure.'",
        "'speaker_5': 'And this is something particularly as we've been talking about innovation and technology here as a council over the last couple of weeks on a significant investment in new technology. And if so, it's important for us to know where we are.'",
        "'speaker_5': 'And so I would love to get a staff report.'",
        "'speaker_1': 'Thank you, Councilman Mongo. You have a second or any comments or not? Okay. Any public comment on the item? I know. Any public comment on the item? Seeing none. We're going to have the I'm assuming the staff report right now on this.'",
        "'speaker_1': 'Is that correct?'",
        "'speaker_6': 'Mayor Councilmember is our finance director. John GROSS gave us a quick staff report. But I think what the councilman was asking for is it would be much more than a quick staff report tonight. So we can come back with a full on two from for something because a lot of work's been going on.'",
        "'speaker_6': 'So, John.'",
        "'speaker_1': 'Thank you. Okay. Hold on a second before we go there, because I just want to make sure because I know we're asking for a report and so is it is it better for this to come back and get one full report?'",
        "'speaker_1': 'I am assuming you want a public report or are you asking for a two from four?'",
        "'speaker_5': 'Well, I would love to get a public report on that. If you could just give us an overview of of where we are and then to four from to the to the council. I think that would be actually sufficient.'",
        "'speaker_5': 'Again, when this this issue was was brought forth and there were 14 budget. Majority of the council was not here. And so one of the again, in the spirit of bringing everybody up to speed and understanding where we are today.'",
        "'speaker_5': 'I just wanted.'",
        "'speaker_1': 'To then report and then the follow up would be the two from four.'",
        "'speaker_6': 'We're happy to talk about it tonight because this is financial. Our project is well underway. It's on budget and it is. And we expect it to remain a top priority. There's a substantial use of internal resources to select design and implement replacement for all of the city's main financial and H.R. systems with a closely integrated modern set'",
        "'speaker_6': 'of systems. It's a joint project managed by technology and innovation, human resources, financial management, water and the harbor departments. The project, however, involves all the departments, and I'll talk a little bit about the reason for it. As was mentioned in In the Agenda item.'",
        "'speaker_6': 'This financial assistance replacement project is replacing essential technology from the 1970s. It's at risk for not even being able to be maintained in the future. In addition, the new systems will give the city capabilities well beyond what we currently have, including, for example, more in the way of open government access and more online capabilities.'",
        "'speaker_6': 'The system was authorized and funded by the City Council in 2014 and is by far the largest system replacement project the city has ever done. The project, as was mentioned, will cost $30 million, but what's important about that is that enterprise funds and other city funds are being used to leverage the general funds on a 2 to'",
        "'speaker_6': '1 basis. So as a result, with that, for a general fund investment of $10 million, you're getting a $30 million system. Much effort has already been put into the project. We've already spent a year with many city staff reviewing systems and system needs.'",
        "'speaker_6': 'An RFP for the new systems has been developed and released with about 4000 different specifications covering 20 subsystems. So that's what we did over the last year. Ten vendors have now responded to the RFP at the end of 2014, just a little while ago, and we're currently reviewing the proposals, having detailed software demonstrations, and then we'll do'",
        "'speaker_6': 'some site visits of the top systems to see them in use and to talk to users to make sure the staff makes a good recommendation to the city council. We expect to make that recommendation as to the system and vendor to select by the end of the summer.'",
        "'speaker_6': 'At that time we'll have a detailed report for you and we can do again the TFF if that's what you want. But we'll have a detailed report for the city council at that time. Yeah. And based on the information we have so far during the RFP process, we believe the project can be completed within the budgeted amount'",
        "'speaker_6': 'because we are one of the largest cities in the country and we'll be putting in extremely complex system for the implementation. Once we select the vendor, it's probably going to take 2 to 3 years. During the implementation part of the project, city will design processes for the new systems, train staff and make the systems operational.'",
        "'speaker_6': 'We expect the implementation to require an even greater effort than the staff time now being used. And then finally, because of the importance of the systems to the city operations and their current antiquated status of the systems, the project is a critical project and will remain a very high priority for staff.'",
        "'speaker_6': 'That's the end of our report.'",
        "'speaker_1': 'Thank you. Embarrassing.'",
        "'speaker_5': 'Well, thank you. And it's very encouraging to know that we are moving forward with that. It's in the RFP process. And so far as I hear, if I hear you correctly, we feel like we're on budget to make this happen within the specified amount that we have allocated.'",
        "'speaker_6': 'You are correct.'",
        "'speaker_5': 'And the two tier three year implementation process. Is there a prioritization in terms of what systems are most important to us?'",
        "'speaker_6': 'We will be talking to this selected vendor about that and we'll make a decision at that time is what's in the best interest of the city and what the vendor recommends. It is normal, but not always the case that financial systems go in first.'",
        "'speaker_5': 'Okay. So I look forward to to the from in the near future and then a report back around the summertime. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_9': 'Thank you to the staff for bringing this forward tonight. And I look forward to your more extensive memo, if that's still forthcoming. As a government employee who relies upon systems such as these in budget management and e-procurement and all those systems to ensure that we're operating effectively and efficiently, I also look forward to the ways that we'",
        "'speaker_9': 'can connect this system to open data. Because as more and more governments have pushed this information out to constituents and citizens and provide a more transparent government, it's really about ensuring that we are doing what's right for the citizens, first and foremost.'",
        "'speaker_9': 'So thank you very much, and I look forward to more.'",
        "'speaker_1': 'Thank you. With that, we've done public comment on this item. Please cast your votes.'",
        "'speaker_2': 'Motion carries seven zero.'",
        "'speaker_1': 'Thank you. Now we have item 19.'"
    ],
    "Recommendation to adopt resolution establishing a City of Long Beach Medical Cannabis Task Force.  (Citywide)": [
        "'speaker_2': 'Item 19 is a report from City Attorney. Recommendation to adopt resolution establishing a City of Long Beach Medical Cannabis Task Force Citywide.'",
        "'speaker_1': 'Thank you. We have a motion by Vice Mayor Lowenthal and a second by Councilmember Austin. So I will turn this over to Vice Mayor. Did you want the city attorney first to go over the.'",
        "'speaker_7': 'Yes. And I did not need to speak. I'm sorry. Okay.'",
        "'speaker_1': 'That's okay. So let me go ahead and turn this over to the city attorney's office to kind of walk us through what we have in front of us.'",
        "'speaker_6': 'Thank you, Mayor. And remember, the council, as you recall at the study session a week ago, there was a request to the city attorney's office to prepare a resolution creating a task force to review a medical cannabis task force.'",
        "'speaker_6': 'So what you have before you today is the establishment of the task force based upon the guidelines provided to us last week. The the task force is has certain duties which we have made very broad. They include, but are not limited to recommendations on the appropriate number of locations, operational restrictions, methodology of testing to ensure safety, appropriate'",
        "'speaker_6': 'buffers, etc. is sensitive land uses and any other such matters that would aid the Council in their efforts to develop such a regulatory ordinance. The task force will consist of six members appointed as follows Each current council member shall appoint two members to their choice to the task force by notifying the mayor in writing of their selections'",
        "'speaker_6': 'no later than February 24th, 2015. The mayor thereafter shall transmit these names to the City Clerk for record ation. The task force will be subject to the Brown Act and all of the requirements of the Brown Act. The members will serve in a voluntary capacity and the task force will select a chair from among its members, and'",
        "'speaker_6': 'then at the conclusion of its duties, it will be dissolved. If you have any questions, I'd be happy to try and answer.'",
        "'speaker_1': 'Okay. Thank you. And so we have the motion in front of us. There is a motion by vice mayor along with on a second by Councilmember Austin. I should I should be go to public comment first. When we go to public comment on this, please come forward.'",
        "'speaker_7': 'I want to thank you for listening to what I have to say, and I apologize if I'm a little nervous.'",
        "'speaker_1': 'Not a problem. Just make sure you say your name for the record and address.'",
        "'speaker_7': 'Brian goes well and my, my address. Uh, five 933 Cherry Avenue, Long Beach, California. 90805. Perfect. A couple years back. On April 8th, 2014, the members of the voting members of our city approved to tax medical cannabis, I believe 74 to 26%.'",
        "'speaker_7': 'I completely agree on instrument implementing regulation and implementing a task force. The way that we had collectives in the past was a bit out of control, not necessarily looking out for the patient, completely more recreational than medicinal. I also agree on the non compensated committee which I would like to be a part of.'",
        "'speaker_7': 'There are true medicinal medicinal patients who need these services. Um, and we can perhaps limit excessive or inappropriate products such as BHO, which is hazardous, dangerous to make these products with solvents. Um, having more emphasis on CBD true medicine involving hospice and elderly patients testing against molds, toxins, solvents.'",
        "'speaker_7': 'Um. It will. Speaking of small business, trying to bring money into, um, facade development and bring just in the city in general, it will bring much needed taxes help small business growth. And it's happening anyways. I mean, people are still buying and selling and there's still these delivery services within Long Beach operating without business licenses.'",
        "'speaker_7': 'Um, operating on these websites under false pretenses that they are. Um, uh, how would you say like um, medicinal massage or, and certain things like that? I think that we can regulate, then come combat that sort of, um, illegal behavior and turn it into beneficial profits.'",
        "'speaker_7': 'And as a nonprofit corporation, these collectives should be donating their time and funds to community development anyways. Um, and then also some people complain that taxes might be excessive when in reality some clubs are charging excessive prices, retail versus the wholesale that they're charging now anyways.'",
        "'speaker_7': 'So that committee to kind of help regulate the um, I know a lot of about testing and things like that and I'm definitely interested in being a part of that.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'Thank you. Speaker, please.'",
        "'speaker_7': 'Hi there, Diana Logins. Speaking of transparency, I have given you a quote, some quotes from Mia Garcia. You have that in front of you. I won't say the whole thing, but the pertinent quotation is and just ensure through working with the manager's office that it's representative of all the groups that were said before.'",
        "'speaker_7': 'Now, that would have been the patient advocates, neighborhood associations, collective operators. Then he goes on to say. So I think that everyone on this day is responsible enough and thoughtful enough that the members that we select are from a diverse constituency that is brought to the table constituency.'",
        "'speaker_7': 'That means here. That means Long Beach. This. These are the people that, you know, care about Long Beach. The council was very and this is. That's not what that's finished with what Robert said. The council was very clear in its deliberations that this medical marijuana ad hoc committee was to represent all facets of the medical marijuana issue'",
        "'speaker_7': 'within the city's consist crew well constituency. They need to be stakeholders residents of the city. It's not supposed to be a group of people solely selected by council members to represent their individual personal points of view. This is no time to facilitate cronyism.'",
        "'speaker_7': 'The whole purpose of this ad hoc committee and I'm by the way, I say ad hoc because it's an ad hoc committee, I think it's going to get very confused with our group, which is the Long Beach Medical Marijuana Task Force.'",
        "'speaker_7': 'It's very similar name that they're using. So it should be an ad hoc committee. The whole purpose of this is to facilitate the democratic process at the very foundation of our country. It should have represented views from a patient advocate group such as the Long Beach Medical Marijuana One, a task force, neighborhood associations, collective operators and maybe'",
        "'speaker_7': 'the medical profession. Public Safety and city attorney and community development should be there in an advisory capacity. They should have the committee members should have a thorough knowledge of the subject and ordinance at hand. Otherwise, it's just going to get off to a slow start.'",
        "'speaker_7': 'This should not become a political football game when the health and lives of our residents are at stake. And I do appreciate councilman you're ranga. Councilman Austin. Councilman Ric Richardson. Council women Lowenthal and price for paying attention and considering this important enough to listen.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, my neck. Thank you, Mayor Garcia, for allowing me to speak tonight. My name is Madeleine Johnson. I'm a civil rights and medical marijuana activist and also a cannabis patient for cancer. My concern is we have been fighting this and city council for the last eight years and nothing has been accomplished.'",
        "'speaker_6': 'I'm hoping that we can all work together with the activists, myself, Diane Levine, and others that has been fighting this. To be on the task force. This will make something happen. If you allow people from the outside who has no knowledge whatsoever about cannabis, how can they possibly tell us how to take care of myself as a'",
        "'speaker_6': 'patient of Long Beach cannabis community? We would like to see some collectives open where we have been suffering and we don't want to go to a lawsuit. Thank you.'",
        "'speaker_1': 'Thank you. Any other public speakers? Okay. I'm going to take this back to the council before I bring this bill back over to Councilman to Vice Mayor Lowenthal, to his maker of the motion. I just wanted to, too, for the for the public just give an announcement.'",
        "'speaker_1': 'So I received over the weekend an email from the chair of our Board of Health Commissioners, which is it's a board made up of medical doctors, health professionals, a variety of people involved in the health profession. And he had mentioned to me that they have been discussing the medical marijuana issue for many months as a as a'",
        "'speaker_1': 'group of health professionals, and that they would like to present to the council their thoughts on the issue as an additional piece of information that the Council could use as part of our deliberations. And so I just wanted you all to know that I received that email from from him unsolicited.'",
        "'speaker_1': 'And if if the listeners objection, I think they're interested in doing that over the course of the next few months from a Board of Health perspective. And so I'd like to also hear your feedback. If the Council is interested in that, I could relay that information back to to Greg, who is the chair of that group.'",
        "'speaker_1': 'And actually, he he himself is a is a veterinarian. But there's a variety of of other health officers on that on that board. So I'll throw that out there for for all for your for the input of of the council.'",
        "'speaker_1': 'Vice Mayor Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And I think that's a great offer and great suggestion and would probably contribute to the balance of the task force that we seek to have. So I would be open to that, and I hope that my colleagues would be as well.'",
        "'speaker_1': 'Council member, Austin. I'm sorry. Oh, you're past. Okay. Councilman Ringo.'",
        "'speaker_6': 'Thank you very. Again, I want to come out to commend the Council for looking at the task force as a as an aid and assist in trying to get through all the nuances of what we're doing here with with an audience, because it's very important, obviously, to to not only the the community, but the region as well'",
        "'speaker_6': ', because it's going to have a much broader impact than just Long Beach. So we need to to consider that as well. I've got I don't know about any of my other colleagues here, but I've got a couple of calls regarding the lack of representation from the fourth District.'",
        "'speaker_6': 'So I was wondering if if I were to suggest that we can have a mayor I know the mayor voluntarily chose not to participate in the selection process, but since his office is in charge of the fourth District at the present time, that perhaps he can nominate two for the fourth District in lieu of not having a'",
        "'speaker_6': 'representative there. And if in doing so, would that change the the the ordinance itself if we were to amend it to include to represent a support district by the selection from the mayor, mayor or members of the Council.'",
        "'speaker_6': 'This is a resolution before you this evening and could be amended to increase. I don't think you could decrease any of the members tonight. You'd have to bring it back again for a new reading. But we could certainly change this in any way you feel appropriate.'",
        "'speaker_6': 'If the changes get too substantial, we're going to have to bring it back next week, but or the next council meeting. But you're certainly could approve this or as is or change it. Well, my my my my thinking on this obviously is to have full representation of for the nine council districts that we have here.'",
        "'speaker_6': 'And again, since the mayor is the person who is monitoring the activity to the fourth district, if he could be the one to select two members from the fourth District or at least have that office have two selections, as we know that the it's opened up in terms of the selections and from whom we can choose.'",
        "'speaker_6': 'But if it's going to change and and slow the process, I definitely do not want to do that. So just just putting that out there as far as whether it can be done. And if not, then let's move on.'",
        "'speaker_6': 'I also support the the the that the the Board of Health coming to the council. They could probably come at the same time the task force present this report to be certainly helpful there. Another discussion that I want to bring forward was the the task force in our in our discussions a week ago.'",
        "'speaker_6': 'We also talked about these buckets of money that that we're going to be getting. And I think it was Councilmember Lowenthal who who mentioned that there are paperless ways of paying for these products at these various dispensaries. And I didn't see that in the ordinance.'",
        "'speaker_6': 'So if if again, if it's not going to change the ordinance, I would like that included in there. But if it is going to change it, then I suggest that we put it somehow in the agenda for the task force to investigate methodology or other ways of payment that does not include actual exchange of of cash in'",
        "'speaker_6': 'some of these where you could have an ATM, for example, or a card where they go to the dispensary and there's no exchanges of cash. But it goes directly into into an account identified already by the city where it would go.'",
        "'speaker_6': 'So I would like to see that somewhere in the discussion so that we can minimize some of the fears that are out there in terms of these buckets of money that are going that that's going to be coming in and being able to minimize that that we're here in.'",
        "'speaker_6': 'Councilmember Your Honor, that certainly would be included under the scope of the duties in asking the task force to look at and also any recommendations from either the task force or the council could be included in the revisions to the ordinance as they come forward.'",
        "'speaker_6': 'Okay. Thank you, Mr. Mayor. And members of the council, if I can add, that was also one of the questions that staff were tasked with as part of the council's deliberations last week, and that it's on our list of things to.'",
        "'speaker_4': 'Follow up on.'",
        "'speaker_1': 'Thank you, Councilmember Councilwoman Munger.'",
        "'speaker_9': 'I want to thank the city staff for getting this this memo so promptly. I know that first experience in the five and a half hour study session and then getting to rewatch it to word for word, take down all of our concerns.'",
        "'speaker_9': 'I think he did an exemplary job and our office will get our comments back to you tomorrow. With regard to the fourth District, I also received a few calls, specifically from SBA businesses that are represented in the fourth District who felt that they would like some representation.'",
        "'speaker_9': 'So I would also be open to supporting Councilmember Veronica's comment related to giving them some representation. And since they don't have a councilmember, I'd be open to allowing the current. Do we call it the custodian of the council office?'",
        "'speaker_9': 'Administrator of the Council responsibilities. Sharon Weissman. To make that decision. If we're all comfortable with that. And.'",
        "'speaker_1': 'Councilwoman Tracy.'",
        "'speaker_8': 'Thank you. I, too, want to echo, councilman, your manga's concerns about that. We've received some requests for that, too. And I think it's I think it's prudent that we have a committee that's representative of the entire city. And I do support, Mr. Mayor, the group coming and talking to us.'",
        "'speaker_8': 'I do know that there are other groups that might be interesting and educational for us to hear from, perhaps folks who work in law enforcement with the FBI or perhaps the IRS, people who have had experience with these issues.'",
        "'speaker_8': 'And so if we are going to have an opportunity for different groups to come and present, maybe we can talk about kind of the framework of that in terms of the time limit so we can let them know ahead of time if they're limited to that 3 minutes or if they get a little bit more time.'",
        "'speaker_8': 'Just because I think it's important that the education be. Comprehensive and thorough. So thanks.'",
        "'speaker_1': 'Great. Thank you. Sounds good to me and council member Richardson.'",
        "'speaker_3': 'So just a couple of things. I actually don't like the idea of having a bunch of outside folks doing presentations here, because I can just add to that list. So I would say, you know, I mean, we have our own public health department.'",
        "'speaker_3': 'I would encourage them to weigh in and consult with, you know, the public health community on on how they would on what considerations we should be given when they come back and report. And the same as to law enforcement.'",
        "'speaker_3': 'I would love to see that come through our own police department and our local experts in terms of the representation in the fourth District. I think those folks called my office as well. So. So I would say just so we draw an exclamation point here.'",
        "'speaker_3': 'So there's there needs to be a motion to make this happen.'",
        "'speaker_6': 'We would need to amend the currently there's a motion on the floor by the vice mayor, seconded by Council member Austin, to adopt the resolution as prepared. So we would need either a friendly amendment or a substitute motion to change.'",
        "'speaker_6': 'I believe Section three of the proposed resolution to read the task force show consist of 18 members appointed as follows Each council office shall appoint two members of their choosing to the task force by notifying the mayor.'",
        "'speaker_3': 'Okay, great. So it looks like there's signal in there. They're good with that voice. Thank you.'",
        "'speaker_1': 'Okay, that's. That's the. The friendly has been made their. We have the we have a motion in a second on the floor. No other comment from the council. We've done we've done public comment already. So let's just before before we vote.'",
        "'speaker_1': 'Mr.. PARKIN So just so that we're clear, we've made the friendly amendment. This passes the resolution tonight, and then we have a timeline that's already in place that we're the names is going to be submitted by, correct?'",
        "'speaker_6': 'That is correct. That the names would need to be submitted to your office no later than February 24th, 2015.'",
        "'speaker_1': 'Great. So let's make sure to do that. And just as as a reminder to the public, we will not be our office will not be screening the names or making selections of the names. Unlike other commission appointments, the two names that you submit will be the two names that are brought forward.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_2': 'Councilwoman Pryce. Motion carries seven zero.'"
    ],
    "Recommendation to adopt resolution of the City Council of the City of Long Beach to designate February 2015 Spay/Neuter Awareness Month.": [
        "'speaker_1': 'Okay. Thank you. And next up, we have. I'm 20.'",
        "'speaker_2': 'Item 20 is a report from the city attorney. Recommendation to adopt resolution of the City Council of the City of Long Beach to designate February 2015 Spay Neuter Awareness Month.'",
        "'speaker_1': 'Thank you. There's a motion and a second. Vice Mayor Lowenthal and Councilmember Andrews. Vice Mayor Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I wanted to thank Animal Care Services and the community groups such as Fixed Long Beach for their hard work. We all know that fix. Long Beach has come out here and shared with us their good work.'",
        "'speaker_7': 'They provided spay and neuter services to 71 pets at their Valentines Day mobile clinic. When you think about the exponential impact where those animals to remain unfixed, you begin to appreciate why it's so important for residents to get their animals spayed or neutered.'",
        "'speaker_7': 'So I am very thankful for their work and really happy that we're able to entertain this item tonight.'",
        "'speaker_1': 'Thank you. Councilmember Andrews. No comments. No problem, Councilwoman Price.'",
        "'speaker_8': 'Thank you. I want to thank the vice mayor again and Councilwoman Mungo on their efforts to bring this item forward. I believe she brought it again. And I want to thank them both for bringing this to our attention and for getting us this far.'",
        "'speaker_8': 'So thank you to both of you.'",
        "'speaker_1': 'Thank you. And Councilman Mungo.'",
        "'speaker_9': 'Has a big believer of incentives and reminders and encouragement as a way to bring compliance within our community. I'm really excited to bring forward this item where we will have spay and Neuter Awareness Month for 2015, and I hope to see it back next year.'",
        "'speaker_1': 'Okay. Thank you. Any public comment on the item? Seeing nine, please cast your votes.'",
        "'speaker_2': 'Motion carry seven zero.'",
        "'speaker_1': 'Okay. Thank you. Next up is we have announcements. My councilman, Mongo.'"
    ]
}