{
    "Recommendation to receive and file an amendment to Munis Contract No. 3190000026 (Contract No. 35169), with GSSI, Inc., dba General Security Services, of Wilmington, CA, for providing security guard services, to increase the contract amount by $963,600, and extend the term to February 20, 2021, made pursuant to Chapters 2.69 and 2.85 of the Long Beach Municipal Code (LBMC) and in response to the proclaimed emergency due to the COVID-19 pandemic; and  Authorize City Manager, or designee, to execute all documents necessary to amend Contract No. 35169 with GSSI, Inc., dba General Security Services, of Wilmington, CA, for providing security guard services, to increase the annual contract amount to $909,000, with an additional 20 percent contingency of $181,800, for a total annual contract amount of $1,090,800, plus an additional annual amount of $300,000 for emergency services related to the COVID-19 pandemic response efforts, as needed; and, reaffirm the original City Council adopted Specifications No. ITB LB18-123, including the contract term of two years, with the option to renew fo": [
        "'speaker_2': 'Right.'",
        "'speaker_4': 'Ocean carries.'",
        "'speaker_3': 'Thank you. Can we please read out five, please?'",
        "'speaker_0': 'Report from financial management. Recommendation to receive and file an amendment to this contract with GSI for providing security services, security guard services, and contract for providing all Social Security Guard services in the amount of $909,000 to provide.'",
        "'speaker_3': 'Thank you. I do have a motion by Councilmember Allen who's cued up on this, but she pulled the item. Councilwoman Allen, did you want a staff report on this or did you want to just go? Did you have comments?'",
        "'speaker_1': 'Yes, I have comments. I can make the comments either before or after the staff report.'",
        "'speaker_3': 'Okay. Why don't we go ahead and have a maybe have a staff report from from staff, Mr. MODICA.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Jan GROSS will give a brief staff report on this item.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Good evening. A mayor and council members. And this is a contract for security guard services, but only.'",
        "'speaker_2': 'For.'",
        "'speaker_0': 'Outlying facilities.'",
        "'speaker_2': 'Of the city. Uses employees at the city hall, the airport in the harbor. The contract was approved by.'",
        "'speaker_0': 'Council, but it has been authorized.'",
        "'speaker_2': 'Only in.'",
        "'speaker_0': 'Increments, so that council can look at the potential of using in-house security guards at the request of council. There was a study done by the city which.'",
        "'speaker_2': 'Showed that there would be a estimated 138%.'",
        "'speaker_0': 'Cost premium, more than double the cost.'",
        "'speaker_2': 'To go in-house. And that those costs could be.'",
        "'speaker_0': 'At the health and the library for the large.'",
        "'speaker_2': 'Part. There have been communications with council about the status and with the I am and the I.'",
        "'speaker_0': 'Think that's unless there are questions, that's.'",
        "'speaker_2': 'Kind of the.'",
        "'speaker_0': 'Status report.'",
        "'speaker_2': 'And I'm open for questions.'",
        "'speaker_3': 'Thank you. Let me turn this over to Councilwoman Allen.'",
        "'speaker_1': 'Yes. Thank you, Mayor. I did ask for this item to be pulled for a separate discussion. It's important to me that, you know, these good paying union jobs stay in Long Beach, and I don't want these jobs outsourced to nonunion employers.'",
        "'speaker_1': 'And prior to COVID 19, the previous council did give direction to the staff to bring back a plan on how these job hubs can be brought in-house. And I understand that projects have been delayed due to the pandemic response.'",
        "'speaker_1': 'But last week I did receive a letter from IBM that was sent to our office and response to the letter. I had several discussions with the city manager. I would like to approve this contract extension on the condition that a plan be made to bring these jobs in-house and brought back to council within 90 days.'",
        "'speaker_1': 'So I would therefore like to move that. We approve staff recommendations as amended to avoid service disruption while recognizing the ability of the city to terminate the contractual services at any time and request a preliminary report in 90 days that identifies the outlying security positions that are best suited for using city employees while there.'",
        "'speaker_1': 'And I think that some of these security work may not be as well suited for full time assignments. Additionally, the report should include information on ways to offset cost, including options to alter non general fund and general fund security services as needed security services and all the other alternatives.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_3': 'Thank you. I think I have a second by. Customary Ringo. Customary Ringo.'",
        "'speaker_2': 'Thank you, Mary. And I want to echo the comments that Councilmember Allard has stated. Those were exactly my thoughts. Also, you know, when we have these long term contracts that basically continue on year after year and we have a prop owl study.'",
        "'speaker_2': 'Sometimes the Prop eight also doesn't fully reflect the amount of time that it's given into the contracts and the amount of money in there. So I think that the study that Councilmember Allen has requested come back in 90 days with how we can incorporate dispositions into the family is an excellent idea that we should always consider the'",
        "'speaker_2': 'fact that we are not a contract city and we should always look at positions that are part of our jurisdiction and part of our responsibilities, that these are full time paid jobs. Thank you.'",
        "'speaker_3': 'But you. Next up is council. I'm sorry, Vice Mayor Richardson.'",
        "'speaker_2': 'Thank. Thanks, Mr. Mayor. I'll be brief. I think this is is the right approach to take a look at what we can do and bring a plan back to restore restore what jobs we can, what job we can restore.'",
        "'speaker_2': 'So I'll certainly support that. I think, Councilmember Allen, for hitting the ground running and picking up this issue and understanding it, given the critical analysis and making sure that we we are preserving local jobs as best we can.'",
        "'speaker_3': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'Yes. Thank you. During this time of a pandemic, I think it's more important than ever that we ensure that people aren't losing their jobs. And I would like to ask the maker of the motion to also add in a component where the H.R. department would help evaluate the criteria that would be need to be met so that'",
        "'speaker_1': 'these individuals could be become a part of the city family. Oftentimes, when contracts become city contractors become city employees, those contractors just lay off the people and other people who meet city standards are able to get those jobs.'",
        "'speaker_1': '23 of these individuals are Long Beach residents, and I think it's critical during this time that we ensure that our residents have opportunities to become part of our city family. So if the maker of the motion is open to adding that to the direction, I would be very supportive.'",
        "'speaker_3': 'Okay. So I think the the friendly concept mango is also have a chart. Take a look at the report that comes back to see if there's ways of incorporating some of the folks that are currently in those jobs, if they're part of the process and bring those back that I get that right.'",
        "'speaker_1': 'Yes. Thank you.'",
        "'speaker_3': 'Councilwoman Allen, are you okay with that friendly?'",
        "'speaker_1': 'Yes, I am. I am okay with that.'",
        "'speaker_3': 'Okay. Next up is Councilwoman Zendejas.'",
        "'speaker_1': 'I would like to thank Councilmember Allen for taking this out of the consent calendar. I really think that it needed to be discussed. So thank you for that. This is something that I think is really important for both the city government and for our working families in Long Beach.'",
        "'speaker_1': 'I think it's critical for us to do business in the way that preserves and extends opportunities for good union jobs in our community. And as such, it's my hope that we can work on a transition of some of these roles into our in-house, you know, city, city employees.'",
        "'speaker_1': 'I understand that we are going through a very hard budget cycle and budget situation overall, but I think that this is something that in the long run will benefit us as a city and will benefit our residents as a city as well.'",
        "'speaker_1': 'So again, thank you, Councilmember Allen, for bringing this this out of consent calendar and for your motion tonight.'",
        "'speaker_3': 'Thank you for that. Want to go ahead and also just add if you had to add a few things. First is, I do want to thank Councilman Allen for for bringing this issue forward and for communicating with me directly about your thoughts, which I of course, I agree with.'",
        "'speaker_3': 'And in addition to, I am for raising the issue, which is an important issue. I think all of us are proud of the work that our city employees do. We're obviously proud of the partnerships we have with across across the city as well with different organizations or different small businesses.'",
        "'speaker_3': 'We always want to ensure that the folks that work with us, the more that we can do to ensure that they have those great good jobs and benefits and are represented, I think is a great thing. So I look forward to this coming back in the next few months.'",
        "'speaker_3': 'And I know that in my conversations with with staff and Mr. Modack, I know that obviously this this is a the contract is a combination of more full time folks and some part time work that happens as well and kind of dedicated to types of security services.'",
        "'speaker_3': 'And so it'll be good to see kind of what what makes sense for us in Long Beach to kind of bring in-house and and how we can support those folks, especially like like we said earlier, our folks that are that are part of our community and part of our city.'",
        "'speaker_3': 'So anytime we can support these good jobs in our in our within our city structure, we know that the work is going to get done. Well, we know that these are folks that are part of our community. And so I'm happy to support this.'",
        "'speaker_3': 'So thank you all to everyone for being involved in this item and that. Councilman Allen Especially with that, I don't think there is any public comment that I have on my comment sheet. So we will go ahead and take a roll call vote.'",
        "'speaker_4': 'District one. A District two. I District three. High District for.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District five. By District six.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District eight. District nine.'",
        "'speaker_2': 'By.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to request City Attorney to prepare an ordinance (1) amending Chapter 5.81 of the Long Beach Municipal Code (Tobacco Retail Permit) to prohibit the sale of all flavored tobacco products, except for those products sold at hookah lounges and premium cigars under certain conditions, within the City, and (2) repeal Chapter 5.94 of the Long Beach Municipal Code (Sale of Certain Flavored Tobacco Products) temporarily prohibiting the sale of certain flavored tobacco products within the City of Long Beach.  (Citywide)": [
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Well, we go on to the next item, please. We're gonna do item number nine.'",
        "'speaker_4': 'Item number nine report from Health and Human Services. Recommendation to request city attorney to prepare an ordinance amending the Long Beach Municipal Code to prohibit the sale of all flavored tobacco products citywide.'",
        "'speaker_3': 'Turning it over to the staff or the city attorney have a report or comment on this.'",
        "'speaker_0': 'Thank you, Mr. Mayor. We'll have a staff report from Kelly Collopy, our director of Health and Human Services.'",
        "'speaker_5': 'Good evening, Honorable Mayor and Council Members. Thank you for this opportunity to discuss the request to establish an ordinance to prohibit the sale of all flavored tobacco products except for hookah lounges and premium cigars under certain conditions. A December 3rd, 2019, the City Council adopted Chapter 5.9 for the Long Beach Municipal Code, a temporary prohibition of the'",
        "'speaker_5': 'sale of certain flavored tobacco products, including flavored cigarillos, flavored electronic smoking devices, flavored electronic smoked smoking device fluid and menthol cigarets. As of January 4th, 2021, this has expired. We thank Councilwoman Price for bringing this item forward in 2019 and first supported this Council to pass that temporary measure.'",
        "'speaker_5': 'In August 2020, the California Legislature passed Senate Bill 793 to ban the sale of flavor tobacco products statewide. The ban prohibits the sale of all flavored tobacco products in California, with the exemption of hookah and premium cigars under certain circumstances.'",
        "'speaker_5': 'The Senate bill is more comprehensive than the temporary ban that was implemented in Long Beach, covering a wider array of flavored tobacco products such as flavored smokeless tobacco products. Senate Bill 793 was slated for implementation starting on January 1st, 2021.'",
        "'speaker_5': 'However, implementation has been postponed pending the outcome of a referendum planned slated for 2022. Statewide election. As of December 2020 over 60 jurisdictions in California currently have taken action independent of state action to regulate the sale of flavored tobacco products, and many more are currently working on ordinances at this time.'",
        "'speaker_5': 'Cities such as Beverly Hills and Manhattan Beach have banned the sale of all tobacco products. Our Health and Human Services Department strongly recommends that the City Council take immediate action to adopt a permanent prohibition of the sale of all flavored tobacco products in the city, except for hookah rounders and premium cigars under certain conditions, as outlined in'",
        "'speaker_5': 'Senate Bill 793 to protect the public health of our community. We recommend this based on compelling data regarding youth utilization of flavored nicotine products. Impacts of nicotine to the youth brain and health. The Future Addiction. Based on early use of these products, it's essential to take immediate action for the safety of our youth.'",
        "'speaker_5': 'Nationwide, youth e-cigarette usage has grown nearly 20 fold in less than ten years, increasing from 1.5% in 2011 to 23.6%, including nearly 5% of middle school students in 2020. Both the FDA and the U.S. Surgeon General have declared that use use of e-cigarettes is an epidemic.'",
        "'speaker_5': 'Flavored tobacco products are currently the current youth. Driving are driving the current youth vaping epidemic. 81% of youth who have ever used tobacco product initiated with a flavored product. This includes all types of flavored products, including cigarillos, hookah and menthol products.'",
        "'speaker_5': 'Nearly 40% of youth who use e-cigarettes have never been cigaret smokers. It's the flavored e-cigarettes that are engaging them in Nicorette and nicotine use nicotine as damaging effects on the developing brain, which continues to develop up until about the age of 25.'",
        "'speaker_5': 'It changes adolescent brain cell activity in the parts of the brain responsible for attention, learning and memory and can interfere with emotion and impulse control in the future. A younger person is. A younger person is. When they start using nicotine, the more likely they are to become addicted.'",
        "'speaker_5': 'As of 2017, there are more than 15,500 unique e-cigarette flavors available, such as cotton candy, gummy bear and juice boxes. Flavors can create the false impression that a tobacco product is less harmful than it really is and lead to increased nicotine intake.'",
        "'speaker_5': 'An average cigaret contains 6 to 12 milligrams of nicotine and a user inhales approximately 1 to 2 milligrams. Flavored product range and nicotine levels from just above 0 to 90 milligrams a day for pods or about 41 milligrams of nicotine and puff bars are at about 50 milligrams of nicotine ether, often aware of the amount of nicotine'",
        "'speaker_5': 'they are. Vaping and vape devices also deliver nicotine more effectively and generally and higher content. In addition, the flavor additives themselves can contain chemicals that are harmful when inhaled. According to the Surgeon General, some of the flavorings found in e-cigarettes have been shown to cause serious lung disease when inhaled.'",
        "'speaker_5': 'At least ten chemicals identified in e-cigarette aerosol around California's Proposition 65 list of carcinogens and reproductive toxins. To add to the concern. E-cigarette products are not regulated by the Food and Drug Administration and are not yet subject to manufacturing standards.'",
        "'speaker_5': 'Studies have found that even though 91% studies have found that 91% of e-liquids marketed as nicotine free actually do contain some level of nicotine. Menthol cigarets are also concerning as they pose more of a risk than traditional cigarets because menthol users may be inclined to smoke more due to the masking nature of the mint flavor.'",
        "'speaker_5': 'Additionally, an analysis conducted by Truth Initiative found that partial flavor bans that exclude menthol as a flavor increase the risk of flavored tobacco users switching to menthol tobacco products. There also is a link between COVID and smoking and vaping.'",
        "'speaker_5': 'Emerging research is showing an ever stronger link between COVID 19 and smoking and vaping. Studies show that the smoking doubles your risk of severe symptoms, such as hospitalization and death from COVID 19. And it stems from the fact that menthol and other tobacco flavorings and e-cigarettes increase the severity of lung related, lung related illness so it's harder'",
        "'speaker_5': 'to recover from COVID. A separate study from Stanford University shows that teenagers and young adults were five times more likely to be impacted by COVID than peers that don't vape. The Health Department has continued through all of this to provide a robust prevention program, including partnerships with Long Beach Unified School District, the YMCA, Youth Leadership Institute, Families'",
        "'speaker_5': 'in Good Health at St Mary Medical Center, and many other community based organizations to bring vaping education to youth in Long Beach. This program conducts an annual seven week summer leadership program focused on youth capacity building and engaging youth in conversations on tobacco control issues and how to make their communities healthier.'",
        "'speaker_5': 'Your Health Department seeks your support to pass a permanent ban on all flavored tobacco products with an exemption for hookah and premium cigars under certain conditions, as outlined in Senate Bill 793. That ends my presentation. I'm open for questions.'",
        "'speaker_3': 'Thank you. Have Councilwoman Pryce, have you up first? I do have a pretty lengthy public comment if you want to go to public comment. Or did you want to make comments first?'",
        "'speaker_6': 'I'll just make some brief comments. I don't really have a need to hear myself talk, especially after that eloquent presentation by staff. Thank you very much. It was very detailed. I fully support this and I urge my colleagues to do so as well.'",
        "'speaker_6': 'The only clarification question I had is I know that the state exempts hookah lounges as well as hookah retail. I just want to make sure that our ordinance would align with the state. So I just have a point of clarification.'",
        "'speaker_5': 'Yes, the ordinance would align with the state. The state allows for retail for only if people if it's for 21 and over as a say so. It would allow for retail in that in that situation.'",
        "'speaker_6': 'Okay. Thank you. And, Mr. Mayor, I don't have any additional comment. So if you want to go to public comment, I defer.'",
        "'speaker_1': 'Entirely to you.'",
        "'speaker_3': 'Okay. Great. I will. Go ahead. I think that's emotion. I do have a second, but I think it's Councilman Austin. Councilman, should we do public comment and then I'll come back to you. Councilman Austin.'",
        "'speaker_2': 'Yes. That would be fine, Mr. Mayor.'",
        "'speaker_3': 'Okay. So, Madam Clerk, let's go through public comment, then.'",
        "'speaker_0': 'Our first speaker is Eva carbonara.'",
        "'speaker_2': 'Diva.'",
        "'speaker_0': 'Hello, carbonara.'",
        "'speaker_6': 'Uh. Yes. Hello? Can you hear me?'",
        "'speaker_0': 'Yes. Please begin.'",
        "'speaker_6': 'Okay. Perfect. How are the city council members? My name is Ava Carbonaro, District four, resident and senior at Wilson High School. Although much has changed for youth of Long Beach over the past year, there's still an invisible plague that haunts us.'",
        "'speaker_6': 'A virus that, in addition to the rise of COVID 19, threatens the lives and wellbeing of those it captures. Youth, nicotine addiction and the appeal of flavored vaping products is as dangerous as ever. Pandemic withstanding. As mentioned, previously youthful vapor up to seven times more likely to contract COVID 19 and suffer even more severe symptoms.'",
        "'speaker_6': 'Returning to in-person learning will never be safe as long as smoking persists on my campus. As a teenager and lifetime Long Beach resident, I urge you City Council to implement a permanent ban on the sale of flavored tobacco and ensure the safety of my peers.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Amir Khan. Amir. Brian.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Please begin.'",
        "'speaker_2': 'Amir. Yeah. Hello.'",
        "'speaker_0': 'Yes, Ameer, please begin your public comment for item nine.'",
        "'speaker_2': 'Yes. I'm a store owner. I have two locations in six and four. And my comment was like, we've been hurting before. Like our business down by 30%. I wish it works, but what happens when you guys pass the law?'",
        "'speaker_2': 'All the business will signal help. Nothing changed except we lose business. It was the next city. All my customers. And then after you guys allow us to sell, buy from us after we stock up, now is going to happen the same thing.'",
        "'speaker_2': 'All our business is going to go down and all the money along with money is going to go to the next city. So I don't see was helpful. I wish the works but it wasn't helpful. It does give more business to the next city.'",
        "'speaker_2': 'That's my comment. So please consider we've been hurting because of quarantine. And then again, we're going to get hurt more after we purchase all this inventory. Then why not wait like the whole California people if they're going to vote on it?'",
        "'speaker_2': 'Why not? We'd like California to hold the whole state. Why? Only long before they do that? To harm us more and more with the coronavirus in the top of that. All the money goes to a different city. I don't know any of my customers.'",
        "'speaker_2': 'They stop because of smoke. Except.'",
        "'speaker_0': 'Thank you. Our next speaker is Charlie Patel.'",
        "'speaker_2': 'So. Hi, my name's Charlie Patella. I'm also a store owner. And like in last six months, once we banned flavored tobacco, all sales go to our neighbor city. And you look at like sales data, like about more than 70% of people of Long Beach, they smoke like menthol cigarets.'",
        "'speaker_2': 'And right now they're talking about like smoking is dangerous. But how do you consider like flavored tobacco is only dangerous? Non play what is not dangerous for smoking and please wait until California State decides to stop all state like menthol ban.'",
        "'speaker_2': 'Then it's going to stay the same customer either way all customer try to next city and they buy cigarets from them. Yeah. And for menthol you cannot stop anybody like that. Be like otherwise you have to make a distinction or something like that.'",
        "'speaker_2': 'So my concern please wait until the state here we decide like posted stop w where tobacco and menthol cigarets then so do not do right now at least due to COVID at least give us businessmen a little bit of any time.'",
        "'speaker_2': 'Either way, it's hurting too much to our business. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jamie Rojas.'",
        "'speaker_2': 'Good evening, Mayor and council members. My name is Hyman. I'm with the National Association Tobacco Outlets representing many of the retailers in Long Beach. We are definitely against the ordinance that's proposed. It's a shame that we're in the middle of a pandemic and the Long Beach Public Health Department is focused on this issue versus the issue of'",
        "'speaker_2': 'opening up business, vaccinations, distribution. And it's a wonder why things are a rea in regards to dealing with situations of public health in general. We completely oppose it. And I hope city councilor realizes that all they're doing is closing more businesses and losing the economic opportunities of businesses reviving in Long Beach.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Mark Torno.'",
        "'speaker_2': 'Good evening. Long Beach Mayor Garcia and City Council members. My name is Mark Torno and my family owns and operates Long Beach Circle K, which is a 76 station Circle K located at 6370 Strand Street in Long Beach, Palo Verde and Stearns.'",
        "'speaker_2': 'We're located in District four with our council member, Super Nine. We've been I've been a business owner in the city of Long Beach for 23 years, and I love Long Beach. I spent $2.1 million three years ago to rebuild this site and make it a beautiful site in the city of Long Beach.'",
        "'speaker_2': 'I pay a lot of business licenses to the city, to the health department. Business licenses. I pay a tobacco license and we oppose putting a ban on flavored cigarets. We're here to. To sell to our customers to make it so they don't go to other cities.'",
        "'speaker_2': 'You know, when they had that temporary ban on, we lost a lot of business. This year, our business is down over 30% due to COVID. I think right now we need to focus on saving lives. We got a lot of people dying from COVID.'",
        "'speaker_2': 'I think the health department needs to focus on that and that's not focus on labor. Cigarets Right now it's up to state do their job. You know, the state has that. Yeah. They're going to be voting on that state.'",
        "'speaker_0': 'Thank you. Our next speaker is Myra Batista. Myra Batiste. My Rabbi Battista.'",
        "'speaker_6': 'Sorry. Thank you. Hi. My name is Myra Batiste and I represent Natal. I like to give the examples of cities that have adopted a flavor ban and how it only makes adult customers travel to nearby cities and spend their money elsewhere.'",
        "'speaker_6': 'I'm taking away revenue from small.'",
        "'speaker_2': 'Businesses and still the youth.'",
        "'speaker_6': 'Find it online.'",
        "'speaker_2': 'And elsewhere.'",
        "'speaker_6': 'In are not regulated entities that they're going to find and that's going to be the problem. The mission of the city is to help and keep the underage usage of tobacco. Well, the stores that have legal appeal systems, that white cards are not the problem.'",
        "'speaker_6': 'Instead, the city should look at different ways that the retailers should help with school officials and find solutions and not take away from their revenue. I say please, please stick with SB 793. Give them a year and a half at least.'",
        "'speaker_6': 'This is something that at the very least, the city of Long Beach should be supporting their small businesses. So we should not be destroying them right now. There's a pandemic going on and right now we need to work together.'",
        "'speaker_6': 'The businesses, we do not feel supported by the city of Long Beach, and we want to be heard that this is not something that can be decided in one city council meeting. Please wait for the state. Do not hurt the businesses anymore and support us.'",
        "'speaker_6': 'Let's create let's create committees for small businesses to work with, with the schools and with the city. Let's work together. Stick with us.'",
        "'speaker_0': 'Thank you. Our next speaker is Michael Rowe, a child?'",
        "'speaker_2': 'Hi there. My name is Mike. For the past couple of months, I've had the opportunity to get signatures to declare the California flavor tobacco ban until people can vote on it. Because of this opportunity, I was able to talk to thousands of people about this issue.'",
        "'speaker_2': 'The main consensus was that we should wait for the voters to decide. Of all the people I talked to, I want to focus on the younger generation and what they said to us. Almost every response I got from the younger people was, I don't care about the ban.'",
        "'speaker_2': 'I will get it either way. They said they would get it from different cities out of state. Online, which is unregulated or the scariest part is from dealers on the street. A lot of the stores that I went.'",
        "'speaker_2': 'Who they're already dealers selling illegal drugs outside the stores. And now young people are going to go to those same dealers, get unregulated, questionable products that might contain other harmful drugs. I know that in many past cases, dealers have also added stronger drug products to their clientele.'",
        "'speaker_2': 'Please, we don't want our kids to have any more access to harmful drugs. Let's wait for the state to figure out a better way. Thank you.'",
        "'speaker_0': 'Thank your next speaker is Primo Castro.'",
        "'speaker_2': 'Hi. Good afternoon. My name is Primo Castro, government relations director with the American Cancer Society Cancer Action Network. Our goal is to reduce tobacco use and prevent cancer in our communities. We ask that staff be directed to draft the strongest ordinance possible to protect all residents of Long Beach from flavored tobacco.'",
        "'speaker_2': 'Specifically, this ordinance should include the following all flavored tobacco products, including menthol, mint and Wintergreen, include all flavored tobacco premium cigars, cigarillos, pipe, tobacco, snuff, chewing tobacco and loose leaf tobacco. Include all sheets of flavored tobacco products and exclude any exemptions for any tobacco product in this ordinance.'",
        "'speaker_2': 'Again, big tobacco continues to addict countless lives through the use of candy flavored tobacco, including flavored sheesha products levy tobacco continues to exploit communities in the name of profit. It is clear that Big Tobacco has not learned the lessons from the late 1990 tobacco master settlement agreement that found reprehensible practices to take tobacco advertising, marketing and promotion'",
        "'speaker_2': 'of these and cigarets to targeted communities. As one of the leading public health authorities, we continue to push for public policies that protect public health against cancer and other chronic illnesses. It is the reason, along with other public health organizations, we have led the fight to push for needed changes such as Pot 56.'",
        "'speaker_0': 'And thank you. Our next speaker is Vanessa Battista.'",
        "'speaker_6': 'Hello. Thank you for this opportunity to speak. My name is Vanessa, and I'd just like to start off by saying, in high school, I had the pleasure of working with the lieutenant governor and went on to work for the United States Senate.'",
        "'speaker_6': 'And tonight, I'd like to speak on behalf of my generation. I think one of the worst things that we can do for our youth in our upcoming generations is take away their right to make a choice, take away the right as a voter to express their voice and take away the right to education.'",
        "'speaker_6': 'Banning stuff. Taking stuff away has never helped. It's never worked in terms of the prohibition with alcohol. It doesn't work with abstinence. In fact, teen mothers that are pregnant have that are addicted to smoking cigarets are actually being told and encouraged to move on to vaping because there's less side effects and less harm for them, their bodies'",
        "'speaker_6': 'and their babies bodies. So vaping can be a big help to those who need it. And taking away the right to purchase tobacco isn't going to help education. Kids need to be able to learn. Education needs to start at home and in school.'",
        "'speaker_6': 'And furthermore, please consider the businesses, the local businesses, by giving them time. Let the California voters express their voice during SB 793. And don't take the businesses into your hands. Let California voice their opinions, exercise their vote, and be educated.'",
        "'speaker_6': 'Thank you for this time.'",
        "'speaker_0': 'Thank you. Our next speaker is after nine.'",
        "'speaker_6': 'The good.'",
        "'speaker_2': 'Hello.'",
        "'speaker_0': 'Yes. Afternoon.'",
        "'speaker_2': 'It's been a motif name. Yes. I would talk about my experience. Hello?'",
        "'speaker_0': 'Yes. Please begin your comment.'",
        "'speaker_2': 'Okay. I have a store in Long Beach. The border? Ramone Beach. And now you want to burn the minister and the Veep? I have a customer. We're going on Paramount. Buying the Cigarets the menthol cigarets from over there sale on Long Beach.'",
        "'speaker_2': 'Now you looking at that? I am losing my business. Just wait for the state for your voting. Give the customers the right to vote this or no thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Victor Sandoval. Hello. I please begin.'",
        "'speaker_2': 'Salutation to council members. My name is Victor Sandoval. I'm in the eighth District of Long Beach under Al Alston, but graduated from Jordan High School and I'm currently attending PCC. I would just like to inform you that I believe a permanent flavored tobacco ban would do this community well because of how flavored tobacco has been gaining prevalence'",
        "'speaker_2': 'within the youth of Long Beach, the Stanford School of Medicine stated that 97% of kids who smoke have done so with flavored tobacco products. This number amounted to 3.6 million kids from middle to high school. Imagine how much that number can be reduced by withdrawing flavored tobacco products.'",
        "'speaker_2': 'The reason why I want this effort to buy tobacco better passed is so the kids don't fall into addiction by flavored tobacco products, which can hurt them, especially during a pandemic. Please prioritize the health of our kids over the profit of us or another city like Signal Hill.'",
        "'speaker_2': 'Thank you for your time. Take care.'",
        "'speaker_0': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. With that, I'm going to go ahead and go back around. And I have Councilmember Austin. I have a motion and a second by Councilmember Austin. Councilman Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I also want to thank our staff for the presentation and the comments from the public. I want to thank Council Member Susie Price for bringing this item forward and back in December of 2019 and for the City Council for their bold support of a temporary ban on flavored tobacco here in the city.'",
        "'speaker_2': 'I think it was the right thing to do. It was the right decision. Moral decision. Because we know that the outcomes for youth are impacted negatively if they pick up addicting habits as youth, particularly smoking. A lot was said about our council's focus and our health department's focus, and I can I know for a fact that we'",
        "'speaker_2': 'are focused like a laser beam on COVID 19 and reducing our numbers there. But I think as other items come up this evening of those paying attention to the council meeting, we also understand that our focus is also on youth this evening and improving the outcomes for our youth in the city of Long Beach.'",
        "'speaker_2': 'I think some of the points were well taken and I do have a couple of questions just to follow up. But this permanent ban by having a permanent ban, I think we reduce the addiction to tobacco or for youth.'",
        "'speaker_2': 'We reduce the access for our youth and we reduce hopefully have impacts in reducing actual smoking habits among youth here in the city of Long Beach. And hopefully we can figure out some way to measure those outcomes over time.'",
        "'speaker_2': 'We want to also understand that that smoking leads to harmful outcomes, health outcomes, respiratory disease, cancer, even death. I mentioned when this item was before us. Before that I've lost loved ones, my own mother to lung cancer and smoking.'",
        "'speaker_2': 'And this this this smoking and the negative outcomes disproportionately do affect. Black people and communities of color. And so, you know, the moral thing to do, the right thing to do would be to turn to Turkey to support this this permanent ban.'",
        "'speaker_2': 'But I did have a quick question. Just understanding the state legislation and how it impacts other cities as it as was mentioned by some of the speakers and perhaps that this is for our city attorney or the city manager of the state legislation that currently bans flavored tobacco statewide.'",
        "'speaker_2': 'Can you give us an update on where that at and how that impacts other cities and what happens if we don't pass? An ordinance in the city of Lombard permanently banning. Taylor Anderson is on the on the line to answer respond to that question.'",
        "'speaker_1': 'TAYLOR Good evening, Councilmember. So Senate Bill seven 3793 was supposed to take effect January 1st of this year. The tobacco companies actually ended up gathering enough signatures for there to be a referendum. So and there is an injunction preventing this bill from becoming effective.'",
        "'speaker_1': 'So right now, there is no state law, in effect, prohibiting flavored tobacco products. It will go on the 2022 ballot for the voters of California to decide how to move forward. And it's my understanding that other cities in the interim are anticipating or waiting for that outcome, have banned flavored tobacco products because there is no state law'",
        "'speaker_1': 'in effect.'",
        "'speaker_2': 'Okay. Thank you for that clarification. I would just say that that I do understand the impact to to our small businesses and operators who have enjoyed selling this retail product for for many years. Well, but it's a horrible product and one that is is, again, the problem with our youth accessing these products in our retail stores.'",
        "'speaker_2': 'I really wish everybody played by the rules and this was only applicable and everybody and we were talking and having our only adult conversation. But this this impacted significant population in our city and we're doing our best. And the intent here is to to protect our youth.'",
        "'speaker_2': 'And that that is that is why I will be supporting this. I do understand the the the unintended consequences or creating an illicit market, I hope will will not be the case. But and I do believe that the economic impact on the city in terms of in terms of sales tax revenue is going to be negligible.'",
        "'speaker_2': 'But I would like to, if possible, have have that information and that information studied as well. But I'm supporting this item because I think it's the right thing to do and I encourage my colleagues to do the same.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you. Next up, I have Councilwoman Mango.'",
        "'speaker_1': 'Thank you. If I could get an answer from the health department as well. I'm interested in knowing if the target is to eliminate youth, getting access to tobacco products that we may not be bringing forward an item that has more strict guidelines and consequences for businesses that violate the.'",
        "'speaker_1': 'And sell to miners. And we talk a lot about the health order. And we have restaurants that violate in restaurants that are good. And we wouldn't want to shut down all the restaurants because two or three restaurants aren't meeting the health guidelines.'",
        "'speaker_1': 'We would then want to enforce and shut down the restaurants that are the problem. Why are we not bringing forward an item that says one strike? You lose your tobacco license completely. You're both adult and your adult your license to sell adult products at all.'",
        "'speaker_1': 'So that's my question for the health department.'",
        "'speaker_5': 'Councilmember right there. Sort of two pieces to that. One, the developing brain goes until about the age of 25. Currently, any sort of focus right now is the age of 21 around tobacco products. And so it goes beyond the the limit for which people are monitoring the utilization of vaping.'",
        "'speaker_5': 'The other is that there are a number of adults who have never been smokers who had who had begun vaping and also, you know, increasing the level of nicotine and other addictions going forward. So we are focusing on youth, particularly because of the impact on brain and long term development.'",
        "'speaker_5': 'But that does go up through at least age 25, for which no one is, you know, focusing on the ability to sell their as well as on adult.'",
        "'speaker_1': 'And. When the state brings this item on the ballot. If the voters approve the measure as written, wouldn't this overturn our own local? Ordinance.'",
        "'speaker_5': 'If the state passes the ordinance, then we would request that we become part of the statewide.'",
        "'speaker_1': 'Which the signatures that were collected were for. Allowing flavored.'",
        "'speaker_5': 'No. Well, so if the if the. So I'm going to turn that over. The city attorney, though, explain it better.'",
        "'speaker_1': 'Yeah. I was just going. Let me help. Let me help. Yeah. Yeah. I'm confused by the number of comments I've received in my inbox, and I can't even tell the difference anymore between one side or the other. Yeah.'",
        "'speaker_1': 'No, it's okay. And this this is a this issue keeps growing, too. So the council letter, letter and recommendation from the health department as written would actually have a sunset provision in it. So upon the effective date of a statewide ban and our local ban that mirrored the state's language would be terminated.'",
        "'speaker_1': 'And so only the statewide ban would be in place unless the council took a different action. So what the voters are going to vote on statewide in the 2022 election is to ban the sale of flavored tobacco products statewide instead of just at the local level.'",
        "'speaker_1': 'And it would be it's just about all flavored tobacco products. The state did carve out an exception for hookah lounges and then higher end, higher end cigar products. I believe it's a $12 is the threshold for cigars and flavored marijuana is not in the ordinance either.'",
        "'speaker_1': 'So no flavor. Marijuana is regulated by a different chapter in the state law. So this is strictly under tobacco products. Okay. Well, my preference would be and I, I voiced this before, but it doesn't seem to have gotten any traction.'",
        "'speaker_1': 'I preference would be that when you have a bad actor who does something wrong, they should lose their ability to participate in the game. When we say, okay, well, here's I can give you an example. There was a vape shop in my district that has now gone under and now that land that landlord is out rent, the'",
        "'speaker_1': 'tenant has debt, the storefront is vacant and I cannot find anyone who will give me an example of any time they've seen a youth in his store, he particularly catered to adults and specifically focused on individuals who wanted to quit smoking cigarets and move over to flavored vape.'",
        "'speaker_1': 'And so in that case, we've lost jobs, we've lost viability. That storefront is now vacant during the pandemic and many of you know the challenges that come with vacant storefronts. And so just the the ripple effect of this policy, which I think kind of pairs with the same discussion I've had with Mr. Modica related to the ordinances'",
        "'speaker_1': 'that the Health Department puts out. The Health Department says, you know, we want 60 people six feet apart. And then they put out an ordinance or a health order that says we want be feet apart, because when people are asked to be eight feet apart, their chairs scoot and they become six feet apart.'",
        "'speaker_0': 'But yet for Mongo, you're 5 minutes, right?'",
        "'speaker_1': 'Thank you. There are unintended consequences because if we said the thing that we're trying to accomplish and legislated to what we are trying to accomplish, there would be less unintended consequences.'",
        "'speaker_3': 'Thanks to Mexico Councilwoman Allen.'",
        "'speaker_1': 'Yes. Thank you. Thank you, Mayor. I just want to I just have a comment. I wanted to say that this is a public health issue. And I want to thank staff for taking the lead on this in light of Senate Bill 793 postponement.'",
        "'speaker_1': 'I also want to thank everyone who contacted my office to voice their support for this item. I think it's really important that I hear from the constituents and the residents on such critical issues like this. Labor, tobacco, and particularly vaping among the youth is something I'm definitely concerned about.'",
        "'speaker_1': 'Personally, my son quit his menthol cigarets because the band he just got out tired of driving out of the city to buy his menthol cigarets. And I'm here to tell you that the ban works. We are saving lives and we are helping our youth.'",
        "'speaker_1': 'And I think this is a may your step forward in improving the health of our communities. And again, I just want to thank staff and I want to thank the Health Department for their work on this. We're doing the right thing.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. Got some of your Ringo.'",
        "'speaker_2': 'Appreciate other comments have been made, I guess, to put it clarification legislatively. So the the the referendum that's going to come in 2022 is to. Have a permanent ban or not. So we adopt the permanent ban. What happens in 2022 if the referendum does not pass and it is not there?'",
        "'speaker_1': 'So council members.'",
        "'speaker_2': 'Are on the other way.'",
        "'speaker_1': 'Yeah. So council member if if tonight this council directs my office to draft an ordinance and an ordinance is put in place to ban flavored tobacco locally and the state does not implement a ban. Then the local ban would remain in place until this council either amended it or repealed it.'",
        "'speaker_2': 'Okay, that's all I have clarity that.'",
        "'speaker_3': 'Councilmember Super now.'",
        "'speaker_2': 'Thank you, Mayor, and thank you to everyone who participated in public comment. I just have one question, and I think it's for Taylor Anderson, and that is, should this item pass tonight? What would the timing be? When would that be brought back to council?'",
        "'speaker_2': 'Or more importantly, when would a ban go into effect?'",
        "'speaker_1': 'Good evening, Councilmember. I believe that we could get it back to you within the next couple of months. I don't even think that it would take that long because we have we have the states language to look to.'",
        "'speaker_1': 'So it should be fairly easy to implement. And then I'm sorry, what was the second question?'",
        "'speaker_2': 'Well, would it would there be a grace period built into that ordinance? Is that what you intend on bringing back? Oh, yes. For the retailers. Okay.'",
        "'speaker_1': 'So is in the council letter from the health department, there is actually a three month moratorium to allow the vendors to sell any product that they would have acquired between January 1st to now recognizing that our local vendors likely had acquired product.'",
        "'speaker_1': 'The time period is shorter than the last time that this council enacted a moratorium. And that's just recognizing that the amount of time that the vendors have had to acquire product, it's a it's a very short window, which is why it's only three months, I believe last time it was 180 days.'",
        "'speaker_3': 'Councilmember. Did you have anything else?'",
        "'speaker_2': 'No, no. The mute button is a little sticky tonight. I apologize. Thank you.'",
        "'speaker_3': 'Okay. Councilman's in the house.'",
        "'speaker_1': 'Thank you, Mayor, and thank you so much to Councilmember Price for bringing this forward for our city staff. I think that this is a very important item to bring forward. I know that a lot of our of our youths, including our Latino and black communities, are the most affected.'",
        "'speaker_1': 'And so it is always an it is always a priority of mine to see how we can improve the outcome of our youths. And so by providing such a and I think that we can definitely improve the quality of life, not only of our youth, but also of their families in this community.'",
        "'speaker_1': 'I do, however, appreciate all of the public comments, and I, I know that, you know, these are tough times, but we really have to look at the fact that this these tobaccos are really harmful to our youth, especially in the early years.'",
        "'speaker_1': 'But they can have over over lasting consequences that will last throughout a lifetime. And so it's very important that we take action. And I'm very, very much in support of this. So thank you again, Councilmember Price.'",
        "'speaker_3': 'Thank you, Councilwoman Zoro.'",
        "'speaker_1': 'Thank you, Mayor. Thank you. Two council women price. Excuse me for leading on this item. And I also want to thank Ms.. Collopy and the department for working on this. And I just want to share that I appreciate the comments and the letters and the meeting I've had with various members of the community that's concerned about these'",
        "'speaker_1': 'items. And I also want to share that the you know, the tobacco industry has also just really had a long history of targeting communities of colors and youth of color, especially around how flavored e-cigarettes and vapes have always been a risk for addiction for our youth, especially since a majority of youth of color lives in my district'",
        "'speaker_1': ', as well as the north, west and north Long Beach. And how? And also the number of retailers that are in the district as well, making the accessibility of it that it is there. And I and I am in support of this item because I think it's really important that we decrease the accessibility and that we ensure that'",
        "'speaker_1': 'we increase our young people's health. And and so and for that, I'm a part of it. Thank you.'",
        "'speaker_3': 'Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. I won't take too much time. Congratulations to all involved. Councilwoman Price, when you when you stepped up and let this is obviously was a trigger for the whole state. So congratulations to you. We all know what this is about.'",
        "'speaker_2': 'Flavor, tobacco targets, young people. And we all are unified and making sure that we make the right decisions and that we move away from these practices. I can remember as a kid, the ice cream truck had little, you know, little pieces of candy blow on it and it looks like a cigaret and smoke will come out.'",
        "'speaker_2': 'Little pieces of a pieces of ground and we move away from all of those things. So I think this is the right thing to do. And this obviously has my support.'",
        "'speaker_3': 'Councilman Price.'",
        "'speaker_1': 'Thank you very much, Mr. Mayor, and thank you to the comments from my council colleagues. This really is a public health issue. And when we brought this item forward in 2019, it was long before COVID and we knew the public health risks, and now the public health risks are exasperated.'",
        "'speaker_1': 'In light of everything we know about COVID and protecting our communities from being vulnerable to illnesses like COVID in the future, hopefully we don't have anything like this again, but I think it's really made us all mindful of what we can do to get at the root of the problems and make sure that people are strong and'",
        "'speaker_1': 'are able to fight anything that comes their way from a health standpoint. I think that I just want to I want to thank everyone who called in, especially the businesses. But I do want to just remind folks that when we brought this item forward, I'm not sure how many remember my comments at the time.'",
        "'speaker_1': 'I really wanted this to be a permanent ban then, but we made it a temporary ban as a way to mitigate the impacts on the businesses. And we alerted them that we were providing sufficient time for them to pivot in light of the scientific research regarding these products.'",
        "'speaker_1': 'Regarding the national conversation and gave them time to try to get rid of the products that they had and think about an alternate business model. And what I shared with a lot of those businesses is I'm a small business owner myself.'",
        "'speaker_1': 'If there were research that came out that said the products that we were providing to people was scientifically found to have a public health risk. As an industry, I know that myself and other businesses in our category would have to shift and pivot understanding that the industry was changing forever.'",
        "'speaker_1': 'And I understand that they're scared and this is going to have a negative impact, but we can't ignore the national conversation that's happening. And in a way, to say that we're pro-business, we are pro-business. I think this entire council does everything we can to help our small businesses.'",
        "'speaker_1': 'But when we've got public health versus supporting business, we've got to find a way to move forward that doesn't endanger public health. You can't even compare the two. And I just want to make sure that everybody understands this is something that we did tremendous outreach on.'",
        "'speaker_1': 'And because of COVID, the item hasn't even come back to council. So there's been plenty of time for our business owners to be able to get rid of their product and anticipate the changes in the industry and pivot in light of those.'",
        "'speaker_1': 'And so with that, I want to be sensitive to them, whatever the city can do to help them pivot their industry in terms of what they're selling and how they're marketing in light of this new reality for them, I think we would do happily, but this is a national conversation.'",
        "'speaker_1': 'It is a statewide reality. And if the voters disagree with what we're doing today, then we can reassess the situation then. But until then, I just want to thank my colleagues and just remind everyone this is really about a public health issue and nothing more.'",
        "'speaker_1': 'So thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. With that, that concludes council comment. I do have a motion by Councilman Price and the second by Councilmember Austin. We can please do the roll call vote.'",
        "'speaker_4': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District six. District seven.'",
        "'speaker_2': 'By.'",
        "'speaker_4': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to receive a report and confirm the proposed citywide Strategic Plan for Youth and Emerging Adults.  (Citywide)": [
        "'speaker_3': 'Thank you. Next, we have item 11 and then we'll have general public comment and then the rest of the agenda. So let's do item 11 is next.'",
        "'speaker_4': 'Report from Parks, Recreation and Marine and Health and Human Services recommendation to receive a report and confirm the proposed citywide strategic plan for youth and Emerging Adults citywide.'",
        "'speaker_3': 'Thank you. I'll turn this over to staff for their report.'",
        "'speaker_0': 'Thank you, Mayor, and thank you members of the city council. We're excited to be here tonight, the culmination of a lot of engagement and planning. And we've got a presentation from Brant Dennis, our director of Parks Rec and Marine, and Kelly Colby, our director of Health and Human Services.'",
        "'speaker_0': 'Good evening, honorable mayor and council members. Thank symbolic of the close working relationship between the Parks, Recreation and Marine Department and our Health and Human Services Partners. I'm honored to present the Long Beach Strategic Plan for youth and emerging adults.'",
        "'speaker_0': 'This plan was completed in the midst of two significant health crises the global COVID 19 pandemic and the country's reckoning with racial injustice. Shelter in place and stay at home. Orders, combined with social distancing measures introduced nearly a year ago in March 2020, sparked a definite shift in community conversations uplifting the social, emotional and economic impact on'",
        "'speaker_0': 'youth of color in Long Beach. Kelly will start our presentation by recalling how the plan before you this evening began. The plan began through a community effort led by Career Girls in Action and the Advancement Project to develop the Invest in Youth Campaign Report.'",
        "'speaker_0': 'Kelly.'",
        "'speaker_5': 'So. Good evening, Honorable Mayor and Council Members. Thank you for this opportunity to share the city's new strategic plan. This plan comes from the youth of our community and reflects voices from all of our communities in the city.'",
        "'speaker_5': 'The groundwork was led by the Invest in Youth campaign. This was a partnership of the coming Girls in Action, building healthy communities and other community apartment partners. The Advancement Project in Cal State, Long Beach. The partnership surveyed more than 700 people and engaged many others in the community.'",
        "'speaker_5': 'What it found was that Long Beach residents were willing to support greater investment in youth in the community, and that at this time the city spends more of its resources on youth suppression than it does on youth development.'",
        "'speaker_5': 'Utilizing these findings. The Youth from Invest in Youth Campaign presented their report to the City Council in June 2018. Youth leaders spoke to the multiple challenges they face and their vision for youth in the city to live their best lives now.'",
        "'speaker_5': 'In 2019, the City Council authorized $200,000 to develop a plan that would serve as the guiding vision and a framework for responding to the needs of the city's youth and their families over a three year, 3 to 5 year period.'",
        "'speaker_5': 'Parks and Parks. Recreation and Marine and the Health Department a partner to develop this plan with youth and consultants.'",
        "'speaker_2': 'Our youth ambassadors were really an important element in the development of the plan. We had nearly.'",
        "'speaker_0': '20 ambassadors in the fall of 2019 an application and. The Youth ambassadors were really an integral part in the development of this plan. We had nearly 20 youth ambassadors, ages 16 to 24, that were selected in the fall of 2019 through an application and interview process.'",
        "'speaker_0': 'Two ambassadors representing each of the nine council districts were joined by several other youth ambassadors that were nominated at large by the greater community. Ambassadors participated in several strategic planning trainings, facilitated all seven community forums, co-designed the online and key and format, survey instruments and outreach, and engaged to ensure the survey data was collected from throughout the'",
        "'speaker_0': 'city. I think very much reflective of the motivation and the energy shared by all of our youth ambassadors. The quote that's included by Alexa King is most appropriate. And she she said, quote, I believe that young people deserve to be involved in the institutions that govern them.'",
        "'speaker_0': 'The best way to represent the youth of our community is to hear from them directly. This is why I was so eager to get involved with the youth strategic plan, unquote. Just a quick glance at our planned development timeline.'",
        "'speaker_0': 'The project began back in early portions of 2018, and as the timeline indicates, several important steps led us to this evening. We will be presenting to you this plan for review and release to our city council leadership.'",
        "'speaker_5': 'The beginning of the planning process, we engaged the youth in conversations about their possibility, the possibility at home, in community, in school and their future. They described what it would look like when all was going well and when Long Beach was supporting them to be their authentic selves.'",
        "'speaker_5': 'They began the process of establishing the vision and their statement of possibility, and then refined it based on information they received from the community engagement process and then refined it even further through their experience of the COVID pandemic and the uprisings of last summer.'",
        "'speaker_5': 'The vision for youth is that all youth and emerging adults between the ages of 8 to 24 are healthy and empowered through the necessary resources to develop into their true, authentic selves. Their statement of possibility is that youth are valued and empowered as decision makers in the city of Long Beach to lead long term change and solutions'",
        "'speaker_5': 'for the betterment of youth now and future generations. When we look at youth in our city, we realize that we have approximately 130,000 youth between the ages of 5 to 24 across the city. The data show that our younger generation is much more diverse than our older generation, where 55% of those over the age of 65 are'",
        "'speaker_5': 'white. More than half of our youth, 56% are Latino. 16% are white, 14% are black, and 11% are Asian. The data also show that a majority of our youth are ages 5 to 17 in the city live in central, north and west Long Beach areas that also have the highest percentage of low income households.'",
        "'speaker_5': 'Nearly one quarter of our youth under the age of 18 lives below the poverty line. This impacts access to health, mental health and wellness, educational outcomes, future income housing, and opportunities for successful futures.'",
        "'speaker_0': 'Community engagement was significant and extensive. Led primarily by our 19 youth ambassadors. There were 71 key stakeholder interviews. Forums were attended by over 200 people. Residents completed surveys that totaled nearly 790, and there were three. My brother's keepers, Long Beach town halls that had nearly 14,900 viewers.'",
        "'speaker_0': 'Thematically, there were five challenges identified that faced our youth. The challenges included access to mental health, economic and educational opportunities, stable and affordable housing, safe spaces to belong and connect and stable and affordable transportation. From these challenges faced by our youth, six specific goals were established.'",
        "'speaker_5': 'The plan, as Brenda said, has six primary goals that are aligned with the themes. The first goal is around youth development and to ensure that youth ages 18 to 24 have robust, sustainable and accessible services within the city.'",
        "'speaker_5': 'Throughout Long Beach, there are services for youth in our schools. Our neighborhoods are employers and are community based organizations. Yet the services are not coordinated, can be difficult to find and are not sufficient to meet the needs of our youth.'",
        "'speaker_5': 'The first step is to establish an Office of Youth Development, to lead increasing access to services, coordination of available services, funding and support for youth in the city. The office will be focused on positive youth development, which recognizes, utilizes, enhances young people's strengths and promotes positive outcomes for young people by providing opportunities, fostering positive relationships, and furnishing'",
        "'speaker_5': 'the support needed to build on their leadership strengths. The office will be housed in the Health and Human Services Department with the funding appropriated to the Health Department and the FBI 21 budget. The focus will be on leveraging existing funding opportunities such as measure US and identifying new structural funding to support youth efforts.'",
        "'speaker_5': 'The Office will also focus on building coordination and collaboration with partners, tracking data to show impacts of the efforts across the city and building additional supports and services for our youth. The second goal is around physical health, mental health and emotional wellness for both physical health and mental health.'",
        "'speaker_5': 'It's not just the absence of disease, but includes emotional, psychological and social well-being, as well as the ability to navigate challenging life circumstances, adapt to change, and have fulfilling relationships to realize full potential. Parents and youth across the city identified mental health as a key concern based on the demands of schooling, employment, family and so much more'",
        "'speaker_5': '. There are many efforts underway to increase physical and mental health, including school based efforts. Healthy, active Long Beach parks activities, healthy market place conversions and teen programs. However, many youth say accessing mental health services is either very hard or somewhat hard.'",
        "'speaker_5': 'This goal focuses on increasing access through partnerships, funding, coordination with the County Department of Mental Health and local providers, and then making that access easier. It's also important to continue to create safe and open spaces for physical activity, connection and families through connected through increased programing of park sites, drawing user agreement with Long Beach Unified and other'",
        "'speaker_5': 'organizations, and creating a virtual connection to build relationship.'",
        "'speaker_0': 'Bill number three focuses on planning for the future. You should have career pathways to ensure economic stability and mobility. This can be done through the establishment of partnerships to increase access to pathways that expand economic and social capital for our youth.'",
        "'speaker_0': 'Also to increase private sector engagement. And a commitment to support youth development. And then thirdly, to increase access to technology and resources to support innovation and ensure that all youth have an equal opportunity to succeed. And then moving on to go for the focus is upon community care and social connectedness.'",
        "'speaker_0': 'The youth should have inclusive spaces that foster a caring environment to grow and develop. The creation of open spaces that reflect the needs of young people is essential. Also, the creation and the sustainability of youth led platforms that promote inclusive spaces and equity was was pointed out.'",
        "'speaker_0': 'And then thirdly, to increase and sustain programing that promotes pro-social engagement for youth that are system impacted.'",
        "'speaker_5': 'The Community Care section also includes a prevention and intervention section. This goal focuses on eliminating justice, touchpoints with youth and expanding enhancing availability of community based alternatives to youth incarceration and supervision that are trauma informed and promote healing.'",
        "'speaker_5': 'Community members and youth ambassadors expressed concern during the My Brother's Keeper Long Beach town halls about youth, sense of safety and the effects that current policing and public safety strategies have on youth growth and development. Information from the town halls led to conversations around alternative interventions and violence prevention strategies that reduce youth interaction with law enforcement.'",
        "'speaker_5': 'Within the Health Department, efforts to reduce violence in the city as well as alternative interventions are aligned to support these efforts for youth. Existing efforts at the Long Beach Unified School District have begun to promote positive alternatives to school discipline trainings, training school for faculty and staff on the use of restorative justice approaches that reintegrate students into'",
        "'speaker_5': 'the classroom through mediated conversations. This approach to justice focuses on repairing harm done to individuals and the community. The goal also focuses on building a multidisciplinary response system that advocates for individual youth needs, responds to mental health crises and school related incidents, invest in community resources and services, and integrates alternative non-law enforcement intervention specialists.'",
        "'speaker_5': 'This will help minimize the criminalization of youth behaviors and will help youth live in their communities with the adequate trauma informed support they need to thrive in their transition to adulthood. Well, five is a housing youth, that youth have safe, affordable and accessible housing options.'",
        "'speaker_5': 'Safe housing is a core basic need and is the foundation of wellness to have safe and affordable and accessible housing options for youth as they live with their families and as they grow and then when they leave home, is essential for those exiting out of foster care.'",
        "'speaker_5': 'The justice system are experiencing homelessness. Accessing this housing can be a much more difficult. Many efforts are underway through the Health Department, Development Services and other providers. However, there remains a need to focus closely on ensuring our youth have homes in which they are safe.'",
        "'speaker_0': 'Our sixth and final goal focuses on transportation that youth have safe, affordable and accessible transportation options. In that area to see the creation and sustainability of reduced and or no fair for youth policy. And also to increase access to safe transportation from the six goals.'",
        "'speaker_0': 'Kelly will share with you where things will be headed in early implementation and governance.'",
        "'speaker_5': 'Our early implementation is focused on bringing resources to the Office of Youth Development through the Racial Equity and Reconciliation funding to hire two people to lead this work for the city. Additional funding of $170,000 in CARES ACT funding was distributed through RFP to ten community based organizations to support their work with youth.'",
        "'speaker_5': 'Also, the measure, US ballot measure passed last fall with youth as a focus area for future investment. All of these funding streams are important to expand opportunity and oversight for youth across the city. The overall governance structure for youth development in the city is three fold.'",
        "'speaker_5': 'The Office of Youth Development, the Youth and Family Commission and the coordination with existing city led youth advisory and leadership groups in the community. The plan's goals indicate a restructuring of the Youth and Family Commission to align with the Office of Youth Development.'",
        "'speaker_5': 'This would be a partnership with parks and a commune and community members. With this, I turn it back to Britain.'",
        "'speaker_0': 'Thank you, Kelly. In closing, I'd be remiss if I didn't acknowledge our 19 youth ambassadors. I'm sure they're all patched in listening tonight. But also, I'd like to acknowledge the work of Ana Lopez, who's our health department's community impact division officer, and also our CARES Act consultant, Eli Romero, who did a great job.'",
        "'speaker_0': 'I also thought it was appropriate the youth selected, although she's quite famous now. Amanda Gordon An excerpt of one of her poems. And again, I'll try to do it justice. Quote Let every dawn find us courageous. Brought closer, heeding the light before the fight is over.'",
        "'speaker_0': 'When this ends, we'll smile sweetly. Finally seeing in testing times, we became the best of beings, unquote. Amanda Gordon So with that, we thank you for your attention. We're available to answer any questions.'",
        "'speaker_3': 'Thank you to the staff. Really great presentation. I do have a vice mayor Richardson, I think has a motion to approve, but I have also a public comment by somewhere. Did you want to make some comments or you want me go to public comment first.'",
        "'speaker_2': 'Before the public comment?'",
        "'speaker_3': 'All right. Let me go, Madam Clerk. Let's do public comment, please.'",
        "'speaker_0': 'Our first speaker is Alexa King.'",
        "'speaker_6': 'Alexis Garcia and city council members. Hello.'",
        "'speaker_0': 'Yes. Please continue.'",
        "'speaker_6': 'American City Council members. My name is Alexa King. My parents are she hers. And I'm representing Council District number five and 19 years old. And I go to Cal State Fullerton and I'm also the founder of the nonprofit The Exceptional Day of Play.'",
        "'speaker_6': 'And for the past year or so, I have also had the privilege of being a youth ambassador. And I'm so thrilled to share this plan that we've worked so hard on with all of you today. I urge you to approve this recommendation, to receive this report and confirm the proposed citywide strategic plan for youth and emerging adults'",
        "'speaker_6': '. And my time as youth ambassadors. I have been so lucky to have spoken with so many different people of all ages, from every background. But I can take away from the entire experience is that young people have voices that demand to be heard.'",
        "'speaker_6': 'This plan is a direct result of the collaboration from the youth of Long Beach and their shared experiences and opinions, all of which deserve to be recognized. It is no secret that our generation has inherited a planet in need of healing, and the young people who will one day be sitting where you sit in positions of power'",
        "'speaker_6': 'deserve to be part of the decision making. As you reflect on the recommendations here today, I urge you to think of the Long Beach youth who dedicated themselves to the adopting of this report and what it would mean for their futures to confirm the proposed citywide strategic plan for youth and emerging adults.'",
        "'speaker_6': 'Our futures depend on the decisions you make today, so please consider the feedback and recommendations shared from Long Beach youth and ensure the voices of young people are validated and represented. Thank you for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Brianna Mendez Padilla.'",
        "'speaker_6': 'Hello?'",
        "'speaker_0': 'Yes, please begin.'",
        "'speaker_6': 'Hi there, Mayor Garcia, Long Beach councilmembers. My name is my pronouns are she her and I'm representing Council District one and 19 and a freshman at Cal State Long Beach. Over the past two years, I have been involved with my community as a youth reporter for local news Media Hub VOICE We have been given a platform to'",
        "'speaker_6': 'uplift voices by sharing their stories. I am a youth ambassador for the same reason we have worked strenuously on this plan. I am thrilled to share it with you all. I urge you to approve this recommendation, to receive this report and confirm the proposed citywide strategic plan for youth and emerging adults.'",
        "'speaker_6': 'My main goal is that you can be ambassador has been to ensure that you have access to resources and opportunities that possibly support your leadership and growth. This is a way to ensure that. I want to emphasize two main points.'",
        "'speaker_6': 'Firstly, this plan has been youth led from the start. It is for youth by youth, and that must continue with implementation. Black and consumers, youth of color of all genders, entities have been systemically disrupted by policing. Poverty and racism must remain key for justice decisionmakers.'",
        "'speaker_6': 'Those most impacted by systems of harm should be leading the solution. Secondly, the vital to ensure that funding for positive use of violence in the city is never threatened by budget cuts. The mayor and council members need to ensure that there is an established one with children and youth and in this year's implementation process, again are here'",
        "'speaker_6': 'to approve and support the feedback share today with all these using. Thank you for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Cesar Armendariz.'",
        "'speaker_2': 'Hello. My name is Cesar Armendariz and I live in the third city council district. zipCode 90804. I want to express my support for the specificity, taking and recognizing the need to bring young people as partners to the decision making table.'",
        "'speaker_2': 'I feel very proud of the young people of our city and their allies who worked hard to put this plan together. This is progress because young people in our society are often excluded from the decisions that end up directly impacting their lives.'",
        "'speaker_2': 'The creation of the Youth of the Office of Youth Development is a cause for celebration because it implements a common sense solution to the issue of public health and public safety. Investing in the mental health of our youth and connecting them to resources and access to capital is a preventative and cost effective upstream policy.'",
        "'speaker_2': 'This plan gives us an alternative to the policies that inflict discriminatory and often lethal violence in our communities in the name of public safety. This plan gets us one step closer to building a community where public health and public safety is not measured by how many men with badges and guns patrol our streets.'",
        "'speaker_2': 'I urge city council members to increase funding to the Long Beach Department of Health and Human Services, which oversees the Office of Equity and will oversee the Office of Youth Development, a well-funded health department prioritized through the city budget as the alternative to a healthier and safer Long Beach.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Dave. Now. I'm sorry. Dan can. And now.'",
        "'speaker_2': 'Yes. Thank you. Dan Knapp, your contribution call Armitage. Good evening, Honorable Mayor City Council again. Dan Knapp. At the core, we applaud the city for developing a citywide, comprehensive plan for youth and emerging adults. You know, the Conservation Corps, which has been serving Long Beach in the community, has been a community resource for over 30 years.'",
        "'speaker_2': 'Our mission to develop young people to reach their full potential through work service, conservation, education is our our stalwart of the corps. That being said, I'd like to say that we're first and foremost a youth development organization. We utilize a project work such as urban forestry, recycling, resource conservation, greenspace and park development as a means to help'",
        "'speaker_2': 'develop the young people of the Conservation Corps. Most young people come to our doors looking for paid work. What they find and what keeps them here is our holistic approach to job training, skills development, opportunities for new experiences in environment, case management, transition, support and opportunity to serve the community, and of course, a passionate and caring staff'",
        "'speaker_2': 'and board. The opportunity to an ability to serve cannot be understated. We cannot be more proud of our young people, especially during this past year, whether it was helping the city establish testing in health care facilities to support the city's pandemic efforts, or helping clean up downtown, uptown and Midtown.'",
        "'speaker_2': 'Today, after the Conservation Corps, Corps members and staff marched in support of Black Lives.'",
        "'speaker_0': 'Think your next speaker is Gabe Sanders.'",
        "'speaker_2': 'Mr. Mayor and council members. My name is Gabe Sanders. I'm a freshman history major, attended the University of Wisconsin virtually from Long Beach, where I've lived my entire life, and I represented District three as a youth ambassador. Long Beach has cultivated within me a commitment to public service and a profound passion for advocacy, both of which I'",
        "'speaker_2': 'carry with me today. As I implore this Council not only to respond to this long overdue plan with words of affirmation, but to implement our recommendations with a sense of urgency. It must be noted that as as this is the first plan of its kind, not every important issue could be fully addressed.'",
        "'speaker_2': 'For this reason, I would also urge the Council to look beyond the language of this report to local and global youth led effort against climate change, one of the most enduring and existential crises of our time. In the wake of a pandemic, it would be easy to turn a blind eye to seemingly less imminent threats of carbon'",
        "'speaker_2': 'emissions and rising tides. However, the issue of environmental justice should be of paramount importance to a city that hosts the second largest port in the country, a port that happens to sit in the backyard of our indigent communities of color.'",
        "'speaker_2': 'Last year, I participated in the city run program Youth Leadership Long Beach, which provided me and 29 other high school students with an opportunity to learn how we might integrate environmental sustainability into our lives. I was given a phenomenal experience, however, in a city with nearly half a million people.'",
        "'speaker_2': '130 person youth program is not enough. Whether expanding this effort to educate and activate youth means allotting funding for a similar program in every district, or bringing the curriculum to middle and high school campuses. Young people must be at the forefront, and the time must be now.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jennifer Hing.'",
        "'speaker_6': 'Hi. Can you hear me?'",
        "'speaker_0': 'Yes. Please begin.'",
        "'speaker_6': 'Thank you. Hi. Mayor Garcia and Long Beach Councilmember. My name is Jen and the lead organizer with Clean Girls in Action. Two things I want to list on this agenda item. First, you said your plan emerged because leaders of the Investing Youth Campaign envision a more equitable world where young people are valued and included in our city's'",
        "'speaker_6': 'budget and in decisions that impact their lives. Before the pandemic, close to 30% of our city's youth population, ages 19 and under, were already living in poverty. Districts one, two, four, six, eight and nine hold 90% of youth poverty in our city.'",
        "'speaker_6': 'With the release of the planet Earth, the Mayor and Council to respond to crises and support positive interventions like establishing and prioritizing along these Children and Youth Fund with a dedicated funding source in 2021. This has been young people's asses before this plan.'",
        "'speaker_6': 'Secondly, I want to uplift goal number four, specifically prevention and intervention proposed activities on behalf of our community. I strongly recommend that OPD use their own budget to assess youth and police relations, to inform policing practices and not to serve, and that a survey to inform community care to not be facilitated by the Long Beach Police Department'",
        "'speaker_6': 'in our survey, which was received and filed as official city data. 80% believe the best way to make our community safer and invest in community based youth development programs. Furthermore, additional data shows black indigenous youth of color in District six, seven and nine live in heavily police neighborhoods, which specifically lead to more fear and mistrust moving towards'",
        "'speaker_6': 'a new generation of hope and COVID 19 recovery means creating a process of community.'",
        "'speaker_0': 'I think your next speakers, Mac Harris.'",
        "'speaker_6': 'Good evening, Murcia Beach Council members. My name is Mac Harris. My pronouns are they them? And I'm representing Council District six. I am 22 years old. I'm also currently one of the youth ambassadors of the Institute, a plan that we are presenting here today.'",
        "'speaker_6': 'I am so excited to share this plan that we worked so hard on with you all, and I urge you to approve the recommendation to receive this and report and confirm the proposed citywide plan for youth and emerging adults.'",
        "'speaker_6': 'I grew up in the city. Went to high school in the city. Like myself. And then one more way back to myself. With the help of the community in the city, I wouldn't be where I am today without the community I found.'",
        "'speaker_6': 'That's what uplifting the voices do or reminding a young person of what their power looks like. This plan is a way for the city to listen and be accountable to the youth reside within it. I want to bring that to the attention of the Council today.'",
        "'speaker_6': 'The Need for Youth Fund. Young people need infrastructure to support city wise, positive youth development and dedicated funding to ensure there is equal access and resources and opportunities. It is finally time I start our city side by youth and invest in our future.'",
        "'speaker_6': 'Lastly, it is vital to this plan that young people in Long Beach have an equitable opportunity to continue shaping the implementation of this plan. We deserve a voice at the table. Prior to this, there is no end to institutionalized practice that brings young people to the table to talk about needs and priorities that will shape our city'",
        "'speaker_6': 'budget and policies. Many spaces are adult led to the release of this plan shows what can and should be done differently. Please consider this feedback. Thank you for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Jordan Wynn.'",
        "'speaker_2': 'Hi there. This is Jordan Win District two resident and representative for the everyone in Mommy's campaign. I just want to speak to the great support of this wonderful Strategic Youth Initiative that has been in the works for quite some time.'",
        "'speaker_2': 'At this point, all the wonderful people at many of the nonprofits, including Kaga, who have been very close to creating this this really successful looking program. I just want to emphasize the need for affordable housing. As someone who was recently a youth and someone who has siblings who are growing up, you know, born and raised through the'",
        "'speaker_2': 'wonderful Lumbee public schooling system, we have a very stark housing affordability crisis in front of myself. I am getting by, but as the years go on, rents continue to rise and our affordable housing needs also continue to rise.'",
        "'speaker_2': 'We need close to 11,000 new affordable units, according to our regional housing needs assessment. So when we think about affordable housing, we need to think about investing in our youth, the people who have grown here in Long Beach.'",
        "'speaker_2': 'You know, I went to poly and the slogan is Enter to learn, go forth to serve. And I love to serve my city here so long as it's not breaking the bank. So I thank you for bringing this presentation forward, and I look forward to all the good that will come from it.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank your next speaker is Mina Marder.'",
        "'speaker_6': 'Good evening, magazine Long Beach Councilmembers. My name is Mina. My pronouns are she her. I'm 18 and I'm currently a freshman at UC Santa Barbara, majoring in history of public policy and law. I graduated last year as a valedictorian from Wilson High School, where my involvement in clubs and student run organizations fostered in me a passion for'",
        "'speaker_6': 'community and youth activism. I am honored to be in front of you today as a youth ambassador representing District five. This plan is incredibly important to me and I'm so excited that we get to share it with you.'",
        "'speaker_6': 'I urge you to receive this report and confirm the proposed citywide strategic plan for youth and emerging adults. As someone who lived in Long Beach my entire life, I feel very close to these issues and I'm so grateful to have been a part of this process.'",
        "'speaker_6': 'Like many youth in America, I've struggled with mental health issues and experienced many barriers when trying to access support. This is an opportunity to attack this issue head on, especially since it has intensified because of the pandemic. The city needs to play a more active role in bringing mental health resources to students.'",
        "'speaker_6': 'It could look like prioritizing funding for on campus counseling, creating safe spaces for students who don't feel safe, talking about their emotions at home, or even educating families in the best way to support their children. Your people will allow us to secure the futures that we envision for ourselves and ensure the mental well-being of Long Beach youth'",
        "'speaker_6': 'for years to come. Although this plan is the first of its kind, it must not be the last. The strategic plan itself speaks to just how capable the youth are when they are empowered and valued in society. Youth have been at the forefront of several movements, especially in the past year.'",
        "'speaker_6': 'Our collective initiative has shown that there is no.'",
        "'speaker_0': 'Thank you. Our next speaker is Sharon Sinegal.'",
        "'speaker_6': 'Good evening, Mayor and city council members. My name is Sharon Sinegal and I'm the executive director of Rodney's house. We appreciate the dedication and hard work of the city staff and the youth ambassadors and the entire team, including Arnold Lopez and Eli, for their dedication to this youth initiative.'",
        "'speaker_6': 'This past week, Ronnie's House and Success and Challenges host the 35 Team and Creative Leadership Program that integrated mental health, mentorship and podcast training. Thanks to the CARES Act funding, we asked teens to answer a survey to tell us where their priorities were.'",
        "'speaker_6': 'And in this order, number one was opening up a business. Number two were career opportunities. Three, Tutoring and mental health teams are hungry for the knowledge and the programing and mentorship, and we owe them. And we have an obligation to them to ensure that they receive that support.'",
        "'speaker_6': 'If we are committed as a city to public safety, stopping gun violence, eliminating poverty and building an equitable Long Beach. We must invest in our youth through leadership programs, spaces for recreation and creativity, and we must connect them with the proper mentorship and mental health resources.'",
        "'speaker_6': 'We can leverage our city owned properties and work with our local businesses. We can also invest some of the money that is put into our police department, expand our CARES Act funding and move some of our cannabis dollars into our youth.'",
        "'speaker_6': 'Considering that the cannabis industry has hurt many communities with the war on drugs.'",
        "'speaker_0': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you very much for that. I'm going to turn this over to Vice Mayor Richardson, but I just wanted to just say something real briefly, because I've been listening to all the comment, and I just want to just I just have to start us off by just saying how impressive everyone that spoke is.'",
        "'speaker_3': 'And it just I'm sure for everyone that's going to speak from the council, it just gives, like me just so much hope to hear all of our young people and the future of our city speak so forcefully about the issues that they care about and about putting this plan together.'",
        "'speaker_3': 'And, you know, just the testament to even those that have gone on to the next phase of their education but are still involved and still back and promoting this plan. It just speaks to, I think, the integrity of everyone that was involved in this.'",
        "'speaker_3': 'And, I mean, it just brings me back to all the great memories of of being in a classroom and just seeing students succeed. And you guys are awesome. So just thank you for all those amazing comments that some of the best stuff I've heard and at a council meeting in a very long time and I just want'",
        "'speaker_3': 'to thank you all for really uplifting the rest of us. So excellent, excellent work and comments. So with that, Vice Mayor Richardson.'",
        "'speaker_2': 'I couldn't agree. I couldn't agree more, Mayor. I think first, the timing couldn't be better. All the things taking place in our community to hear such passion and vinegar from our young people, it's really exciting. And to see that they know what they're talking about, how they've contributed this report to standing up and endorsing this report, that'",
        "'speaker_2': 'means a lot. I want to acknowledge the youth ambassadors and everybody who participated, Jillian Mack, everyone who contributed to this. You did an incredible job on the Invest in Youth Coalition. I remember when this was just a twinkle in your eye in the beginning.'",
        "'speaker_2': 'You know, that request was for youth that you have to move away from, that you want to youth hear you loud and clear out. We pivoted and mayor, thank you. It was your budget that allocated $100,000 to start the conversation on Youth Fund.'",
        "'speaker_2': 'And the youth said, hey, let's use that on a strategic plan. So I'm great. I'm glad to see the progress that we have we've made. I remember there was a discussion at my field office three years ago, you know, of numerous youth, our planning, strategic planning, you know, to bring this to front of the city council.'",
        "'speaker_2': 'So it looks it looks good. I think the goal is it was it was a lot of things. I like the goal. I think that to create the best youth development system in America, it's holistic and intersectional. And we have great institutions already, but we need to work together with one strategic plan.'",
        "'speaker_2': 'I love the term Live Our Best Lives. Kelly said that a few times. I wrote that now for our youth to live their best lives that we want for our children want them to live their best lives. I love the statement of possibility that was incredible that the youth prepared.'",
        "'speaker_2': 'I think the challenges faced by youth that were outlined really align with the challenges faced by the broader community. They brought out mental health. They brought up transportation to transit. And that's that's really insightful. I think equity really comes across here.'",
        "'speaker_2': 'And and framing our youth is assets and that's really a youth development to me is about reframing the conversation from youth, having a bit of insurmountable odds to changing those ads for making sure the system promotes and develops harmony.'",
        "'speaker_2': 'I think that's important to know. I'm inspired by these youth. I was 26 when I started working at City Hall. I'm you've all talked about 16 to 24 the adolescent, right? You guys can change the world. You can change the city to make it better.'",
        "'speaker_2': 'You have the opportunity to do that more specifically, just a few things. I think some critical next steps are important. You know, you strategic plan was one step in the reconciliation. We created the office youth development manager you see past there's all of those things create alignment I believe people know I'm always talking about plan plan this'",
        "'speaker_2': 'plan that. But then after you have the plan, you work the plan. That's where we need to go. Next one, a couple of things. One, I'm going to introduce the motion on Tuesday to begin the process. Now that measure us is adopted, create the process of structuring a youth fund for the community, for the community, as well'",
        "'speaker_2': 'as the youth that talked about we should leverage our measure us. But also look at L.A. County Measure J. That's important. Secondly, we got to think about integrating youth into our all of our planning process. We're already doing that.'",
        "'speaker_2': 'But I think the way we can appropriately do that is think about a civic engagement element in our general plan, our youth, to actually submit themselves and their voice into the future. The last thing I'll say is there was a discussion during My Brother's Keeper and all of this about creating a youth council within the city of'",
        "'speaker_2': 'our youth at Youth and Adults, the Youth Council of Youth. That's something I want to see that we pursue. Now, I'm not sure what the timeline would be. That's certainly something I think we need to have. Thank you to staff.'",
        "'speaker_2': 'Thank you to everyone who contributed this. I think this landed in a great. And I'm really eager. The timing is incredible to see what we can do to grow this clan and to make sure that we work this plan with our new offices.'",
        "'speaker_2': 'Development and measure U.S. Opportunity Manager Jack. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Price.'",
        "'speaker_1': 'There we go. Thank you, Mr. Mayor. I'm sorry about that. Thank you, Mr. Mayor. I want to thank staff for that amazing presentation. I love that it was done in partnership between health and parks, because I think that programing and providing opportunities and activities that are subsidized by the city for youth throughout the city to be involved'",
        "'speaker_1': 'in is such an important piece of this. And so I want to thank staff for the presentation. I want to thank Gabe Sanders, who was one of the youth that I recommended, and Mina motta, who spoke tonight, and Ali Khan, who did not speak tonight, but who were all people I recommended and served on this committee.'",
        "'speaker_1': 'I'm just so impressed by you guys. Mina motta was involved in our youth participatory budgeting plan that we did many years ago, and there's not a day that I don't walk through Marina Vista Park and look at the Luke Johnson Sport Court and think of the work that that youth did to honor a third district youth who'",
        "'speaker_1': 'passed away as a result of cancer. But what they did was engage that park and activate it. And that's been really positive. And I really want to talk about just Gabe's comments regarding climate change. There was a study that I read about recently in The New York Times regarding how climate change is affecting the youth in terms'",
        "'speaker_1': 'of allergies and how much longer they're staying sick. And these are climate change impacts that sometimes we don't think about, especially for a councilmember who represents the coast. We're often thinking about sea level rise and other major climate impacts, but we're not thinking about how these climate impacts are affecting our youth and their ability to succeed and'",
        "'speaker_1': 'thrive. I love the part of the strategic plan that talks about housing and transportation. I know that for my mother and I, we struggled quite a bit to find our footing in America when we came. And, you know, my own personal experience has dictated to me that if you don't have a safe structure from with from which'",
        "'speaker_1': 'to build your future, have that solid foundation, it's really the odds are against you. And so anything that we can do as a city to help build that strong structure in terms of housing and transportation is critical. We can't expect people to to thrive if they're set up for failure.'",
        "'speaker_1': 'And so I think that that's really important that that's in there. And then I just want to talk a lot about mental health and substance abuse. I staff one of the collaborative courts in my daily job, and I see people whose lives have been completely devastated as a result of substance abuse that started when they were in'",
        "'speaker_1': 'this age group. And specifically, what concerns me the most is opiate use. And I just worry that sometimes the pressures in life get really hard for all of our youth, regardless of what part of the city they live in.'",
        "'speaker_1': 'And if they don't have the support and the infrastructure in place, then they can easily go down the wrong path. And once you get on that wrong path, it's it's so difficult to get back out and be able to to make something great of your life.'",
        "'speaker_1': 'And so I just want to encourage our health department and our Parks and Rec department to think about mental health in terms of our youth. We should be offering programing in every corner of this city for our youth to have the support of infrastructure in place, to route their anxieties, their fears and their concerns in a healthy'",
        "'speaker_1': 'way. That, to me, is the number one issue that we should be focused on once we establish a strong foundation of housing and transportation and get people in a place where they can actually think about the type of support they need and utilize those opportunities.'",
        "'speaker_1': 'So I want to thank the youth that served on this committee, those of whom I I'm aware of, those who have never met. Thank you for your leadership, because you guys are the future of the city. And I'm really grateful for your participation in this process.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'The next step we have. And by the way, I think the motion was made by Vice Mayor Richardson and there was a second by Councilman Rice. Is that right?'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'Okay. Yes, Mr. Mayor.'",
        "'speaker_3': 'Okay. Then we have. Next up is Councilman Mongo.'",
        "'speaker_1': 'Thank you. What a great presentation. This is amazing. I want to thank all the ambassadors and the hard work that you put in. You spoke so eloquently about the item and your passion that you put into it. Thank you so much for your contributions.'",
        "'speaker_1': 'As I've been saying a lot with our listening sessions, it's really we as the elected officials that are here to represent your ideas and your opinions and make sure that the things that are important to you and allow you to grow, thrive and be prosperous are available.'",
        "'speaker_1': 'And so thank you for bringing forward this roadmap. I look forward to investing in it, and I really appreciate everyone who contributed to this report. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Zoro, please.'",
        "'speaker_1': 'Thank you, Mayor. So I want to thank my girls in action for their leadership, as well as our youth ambassadors, our, you know, the youth that participated Project Teen Advisory Committee part and all the partners. And just so much went into completing this, especially during a pandemic.'",
        "'speaker_1': 'And I just want to thank Ms.. Collopy and Mr. Dennis for his presentation and all the staff were working on this item. You know, as the former executive director of My Girls in Action from 2006 to 2011, I'm just so proud of our young people's leadership to see it as item and that it proposes a citywide strategic'",
        "'speaker_1': 'plan for young youth and emerging adults. You know, at that time, when I was that age, it was a vision, a dream that all of us doing the youth development and leadership work had something like this an office for Youth Development and to create an integrated system for young people, to have a seat at the table, to'",
        "'speaker_1': 'have their voice heard, and to make decisions impacting their lives. So I believe it's just so critical, crucial that we invest in young people's success by investing in programs and process, that it prevents the social health, social health, public health and educational disparities and inequities.'",
        "'speaker_1': 'So I've been I've always been deeply and fiercely passionate about developing and supporting our young people to organize and fight for a system that works for them. And I still do. And this is just a great example of how we can better support young people to grow and thrive and be engaged in a civic process and a'",
        "'speaker_1': 'systemic beginning process for systemic change. And I support keeping the Office of Youth Development and the Health and Human Services Department and of course, to supporting the strategic plans implementation. And I enthusiastically support this item. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And I, too, want to just leave my congratulations and applaud all of those involved in creating this plan, especially the youth ambassadors who participated. Our staff and the many community partners and advisors who were engaged in this is a very impressive document.'",
        "'speaker_2': 'I think it's a it's a great guideline and a good start for continue or improving engagement of our youth. I think looking at this, you know, understanding that positive youth development is the framework or a baseline for us to to develop this plan.'",
        "'speaker_2': 'I would say it would be lost on us, not to to mention that the most positive youth development is good parenting. And so I salute the parents out there who are nurturing and doing the right thing in terms of developing their kids and allowing them to build the confidence and allowing them to dream and be there, achieve'",
        "'speaker_2': 'their best lives. I do like that this plan emphasizes safe communities and stable communities as a as a as something necessary for it, for youth to be developed in the way that that provides a positive outcome for them.'",
        "'speaker_2': 'And I think that includes, you know, livable communities, walkable communities. We have to continue our investment in neighborhood libraries and in parks and recreation programs that really go a long way to to create a positive, a good experience for our youth in our city.'",
        "'speaker_2': 'And also, I would like to to just make a suggestion that, you know, we we continue to engage. I didn't see it much in the plan, but we continue to engage. You know, outlets like. Youth sports and the coaches related to those still sport programs as as strong strategic partners for the city and in developing.'",
        "'speaker_2': 'Hopefully this will will be done through the Office of Youth Development. The mentoring the many mentoring programs in the city as well as coordinating the internships that are so important in terms of developing our youth. But this is this is a great, great plan.'",
        "'speaker_2': 'I want to applaud the staff. I want to applaud the youth who were involved in this. I look forward to good things coming out of this Office of Youth Development. And I'm glad that this is that we now have an umbrella kind of organization or piece of our organization that will help us focus more on youth development'",
        "'speaker_2': 'in the city. So again, thank you. I'm happy to support this and I was delighted to see this before this evening.'",
        "'speaker_3': 'Thank you. Councilman Ringa.'",
        "'speaker_2': 'Thank you. And I think the comments have been made by my colleague is spot on. They're all exit comments and I couldn't be more proud of our youth in the public comment period when they came forward and spoke of their experience and their wishes for the future.'",
        "'speaker_2': 'We're doing a good job here at Long Beach. As I go, we'll close to 40 years of working with the city and the city, not only as an employee, but also as a member of the Community College Board of Trustees and City Council.'",
        "'speaker_2': 'And this is a proud moment for me as a city council member because we've tried this before. I want to be the stick in the mud. But we've had youth commissions before. We've had strategic, strategic plans dealing with youth and getting them to a level that we want.'",
        "'speaker_2': 'But this is the most comprehensive report and plan that I have that I've seen anywhere, and I think that it's an excellent one to reach out to both our directors of Parks, Recreation, Marine and Health and Human Services for the detail that they've done.'",
        "'speaker_2': 'And of course, they don't do it without the support of their staff. I think everyone did a great job with this. But as you all agree, the old village proverb goes It takes a village to do everything and to do anything to be successful.'",
        "'speaker_2': 'And by the way, if I didn't see it last week, I would say right now that Happy Black History Month, when it comes to these types of projects and these kinds of commitments, what I say, it takes a village.'",
        "'speaker_2': 'It takes all the stakeholders that we have in the city to get involved from employers to our boards of education, community colleges, universities. And we have in place the college promise that I think we can use and benefit from and get it more engaged in terms of what's going on with our youth and in our future.'",
        "'speaker_2': 'We have the city college, we have the district, we have the university, and then we have that fourth cog that are which was the of law, which involved which creates the full loop of education, internships and opportunity and employment.'",
        "'speaker_2': 'And where we put all that together, we have a successful and great city. So I am looking forward to the implementation of this program. There's a lot of different elements to it that we need to work on, but I think it won't be.'",
        "'speaker_2': 'It won't work unless we get everybody involved. And that's where we have been successful in the past, is that there hasn't really been that connection, that that opportunity to get all the stakeholders involved and engaged in what we're trying to do here.'",
        "'speaker_2': 'So I'm looking forward to working with our colleagues on the College Board and the school board at the university to strengthen our educational system. To strengthen the opportunities that we have for our youth to go into the programs, not only in terms of the community, college and university would be a doctor, programs and high paying jobs here'",
        "'speaker_2': 'in the city and elsewhere. So that that's my comment today and had really like I say, it's a proud moment for me being on the city council adopting this plan. Thank you very much.'",
        "'speaker_3': 'Thank you for that, councilwoman in Dallas.'",
        "'speaker_1': 'Thank you, Mayor. I just wanted to say a big, big thank you for Director Denis and Ms.. Collopy for this very impressive presentation. And even bigger, thank you to our ambassadors who obviously did put in so much work into into this plan.'",
        "'speaker_1': 'And I'm so excited. I couldn't be more thrilled with what's supporting this item. And as we all know it, it makes a huge difference when we have programs set in place for our youth. They could mean the difference between going down the wrong path or creating and achieving their dreams and being successful and really productive members of'",
        "'speaker_1': 'society. So I'm just super thrilled to be able to support these efforts that have been made. And I know it's been a long time coming and I know that it's been worked on for years, but the end result is a really great result and I look forward to in the near future supporting a fund for our children'",
        "'speaker_1': 'and youth. I think that that's going to be very important and that we need to move in that direction. So thank you very much for everyone that worked on this. And I'm very, very happy, any group to support this item tonight.'",
        "'speaker_3': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Thank you, Mayor. Just what a great presentation. And thank you, Director Colletti, and thank you, Director Dennis, for all of your hard work on this report. I also want to give a big shout out to all the 19 youth ambassadors and the staff who work so hard on all the forums and all the town halls.'",
        "'speaker_1': 'And like the mayor said earlier in his comments, I was just so impressed and and just really moved by all the the speakers tonight. I'm just so proud of the youth in our city, I believe, and the youth in our city.'",
        "'speaker_1': 'And I, too, want them to live and fulfill their best lives. And I look forward to supporting this office and making sure that we're able to find all of the elements of this plan. And as a young person who grew up in this city, I'm just so proud of our progress.'",
        "'speaker_1': 'Just great work, everyone.'",
        "'speaker_3': 'Thank you. Next up is Councilwoman Mango.'",
        "'speaker_1': 'Thank you. I was so excited to thank everyone and the youth and so impressed by all the things they said. I forgot that I had one question. Mr. Modica or Ms.. Cappelli, perhaps one of the slides discussed the transportation for youth and the desire to have complimentary transportation available.'",
        "'speaker_1': 'I know that we have a program in my district that we're piloting with the Transit Authority. Is that project. I mean, it was before COVID and obviously it was it was initiated and provided through Millikan High School. And so I'm not sure where we are with programs like that.'",
        "'speaker_1': 'Is that something that we could get an update on either via email or two from Ford just so we know that they know that providing free transportation to our youth is a a critical service.'",
        "'speaker_5': 'Councilmember Enter the objective one under goal six the current activity and say we're supporting a discount of bus passes for eligible students and increasing awareness at the city colleges. No cost, strong beach bus pass. So there are some free options right now.'",
        "'speaker_5': 'And then the intent would be to expand that. So I'm not as aware of the one that you're referring to, but we'd love to learn more.'",
        "'speaker_1': 'On how wonderful it was to the Long Beach Transit director way before that. And that program rolled out its best to potentially move citywide. And with COVID, I guess students weren't technically moving to and from school, but we can do during COVID to help facilitate getting those transportation options into their hands.'",
        "'speaker_1': 'I imagine that they're just as important now as when they're in school. Thank you so much. And with the staff and the community and the participants and the ambassadors, great presentation.'",
        "'speaker_3': 'Thank you. That concludes council comment and I just want to circle back and just thank everyone on the team. And I think folks have been really, really active at all levels at the city and it's just been really wonderful to see.'",
        "'speaker_3': 'And so thank you to the Health Department, to our Parks Department, all the especially the youth and the different groups that also were involved in the creation. And so great work, really great plan. I look forward to being able to implement it here at the city and and continue to engage youth as actively as this process did'",
        "'speaker_3': '. So thank you. And a roll call vote, please.'",
        "'speaker_4': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District three. Councilwoman. Is that an eye?'",
        "'speaker_1': 'It was an I. Can you hear me?'",
        "'speaker_4': 'Yes, thank you. District four. District five.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District six. Office. District seven.'",
        "'speaker_2': 'II.'",
        "'speaker_4': 'District eight.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': 'Thank you. That concludes the two big items we had tonight. Most of the public comment. So we're going to go back to open public comment. And Madam Karp, you can go ahead and go through those and then we'll go back to the agenda.'"
    ],
    "Recommendation to adopt resolution approving an exception to the 180-day waiting period for Public Agencies pursuant to Government Code 7522.56 and 21224 to hire Maria Armijo for a limited duration to work in the Technology and Innovation Department.  (Citywide)": [
        "'speaker_3': 'So I'm looking forward to that then be included in that process. So thank you to everyone that spoke and let's move on to the rest of the agenda. Let's do item ten, please.'",
        "'speaker_4': 'Report from Human Resources recommendation to adopt a resolution approving an exception to the 180 day waiting period for public agencies to hire Maria or Maria for a limited duration to work in the Technology and Innovation Department citywide.'",
        "'speaker_3': 'Thank you. Can we get a motion in a second, please? Motion by Vice Mayor Richardson. Second patient has recovered.'",
        "'speaker_4': 'District one.'",
        "'speaker_1': 'All right.'",
        "'speaker_4': 'District two.'",
        "'speaker_1': 'By.'",
        "'speaker_4': 'District three. My district for.'",
        "'speaker_2': 'My.'",
        "'speaker_4': 'District five I District six, I'm District seven. I. District eight.'",
        "'speaker_2': 'II.'",
        "'speaker_4': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to adopt Specifications No. RFP PW20-084 and award contracts to Bitech Construction, Inc., of Buena Park, CA, EBS General Engineering, Inc., of Corona, CA, and Sully-Miller Contracting Company, of Brea, CA, for design-build services for curb ramps, in an annual aggregate amount not to exceed $15,000,000, for a period of two years, with the option to renew for two additional one-year periods, at the discretion of the City Manager; and, authorize City Manager, or designee, to execute all documents necessary to enter into contracts including any necessary amendments; and  Accept Categorical Exemption CE-20-142.  (Citywide)": [
        "'speaker_3': 'Okay. Next item, please.'",
        "'speaker_4': 'Item 12 Report from Public Works Recommendation to Award three Contracts for Design Build services for curb ramps in an annual aggregate amount not to exceed 15 million citywide.'",
        "'speaker_3': 'Here. There's emotion and I get emotion. The second police motion buys in the house can make it a second place. Second by Vice Mayor Richardson. There is no public comment. Let's go ahead and take a roll call vote.'",
        "'speaker_4': 'District one. I'm District two. I'm District three.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District seven. I District eight. District nine. I motion carries. Item 13. Report from Development Services. Recommendation to declare ordinance amending portions of Part nine of the Youth Use District Map of the City of Long Beach. Red and adopted as Red District six.'"
    ],
    "Recommendation to declare ordinance amending and restating the Midtown Specific Plan (SP-1) to reflect a boundary change, read and adopted as read.  (District 6)": [
        "'speaker_4': 'District nine. All right. Motion carries. Item 14 Report from Development Services Recommendation to declare ordinance amending and restating the Midtown Specific Plan to reflect a boundary change read and adopted as read District six.'",
        "'speaker_3': 'Give a motion like Councilwoman Taro. Can I get a second, please? Second rate Councilwoman Allen there. There's no public comment. Roll call vote.'",
        "'speaker_4': 'District one.'",
        "'speaker_1': 'By.'",
        "'speaker_4': 'District two. By District three.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District for.'",
        "'speaker_2': 'High.'",
        "'speaker_4': 'District five. I District six and District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District eight. District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance repealing Ordinance No. C-3377 for the purpose of removing previously established special setback requirements on the 5800 block of Linden Avenue, read and adopted as read.  (District 9)": [
        "'speaker_3': 'Thank you. Item 15.'",
        "'speaker_4': 'Report from Development Services. Recommendation to declare ordnance removing previously established special setback requirements on the 5800 block of Linden Avenue. Red and Adopted is Red District nine.'",
        "'speaker_3': 'Can I get a motion in a second? Most of my advice May Richardson second by. Councilman's sorrow. No public comment.'",
        "'speaker_2': 'Let's cast our recovery.'",
        "'speaker_4': 'District one. My district to.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District three. I. District four.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District seven. I District eight. Hi. District nine.'",
        "'speaker_2': 'Right.'",
        "'speaker_4': 'Ocean carries.'"
    ],
    "Recommendation to increase appropriations in the Capital Projects Fund Group in the Public Works Department in the amount of $2,500, offset by the Fifth Council District One-time District Priority Funds transferred from the General Fund Group in the Citywide Activities Department to support critical need safety improvements in the Fifth Council District;  Increase appropriations in the General Fund Group in the Public Works Department in the amount of $7,500, offset by the Fifth Council District One-time District Priority Funds transferred from the General Fund Group in the Citywide Activities Department to support critical need safety improvements in the Fifth Council District;  Decrease appropriations in the General Fund Group in the Citywide Activities Department by $7,500 to offset a transfer to the Public Works Department; and  Direct City Manager and all applicable departments to work with Los Angeles Department of Water and Power (LADWP) on options for installing an additional gate at the Spring Street Service Road to limit pedestrian and vehicle access to the land owned": [
        "'speaker_3': 'Okay. Next item, please.'",
        "'speaker_4': 'Report from Councilwoman Mango recommendation to increase appropriations in the Capital Projects Fund by 2500 and add the General Fund by 7500. To support critical needs, safety improvements and direct City Manager to work with L.A. DWP on options for installing an additional gate at the Spring Street Service road to limit pedestrian and vehicle access to the land owned'",
        "'speaker_4': 'and operated by L.A. DWP.'",
        "'speaker_3': 'There's a motion. Is there a second? Second baseman Richardson. No public comment. Roll call vote.'",
        "'speaker_4': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District two. I District three.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District for.'",
        "'speaker_2': 'My.'",
        "'speaker_4': 'District five. I. District six. I. District seven. I. District eight. Hi. District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': 'Thank you. And I think we didn't do 12. Is that right? And then we'll go back to 17. Did we do well?'",
        "'speaker_4': 'We did do 12.'"
    ],
    "Recommendation to receive a report on the State Emergency Rental Assistance Program (ERAP) and adopt staff recommendation, Option B, relating to the implementation of the ERAP.  (Citywide)": [
        "'speaker_3': 'Okay. Thank you. So let's go to 17.'",
        "'speaker_4': 'A report from Development Services recommendation to receive a report on the State Emergency Rental Assistance Program and adopt staff recommendation option B citywide.'",
        "'speaker_3': 'Thank you. I do have a staff report. This is a pretty important agenda item, actually. So I want to make sure that we have a chance to to hear the report from staff. And then I'll have some comments and then we'll go into our council comments.'",
        "'speaker_3': 'We have one member of the public signed up to speak as well. So, Mr..'",
        "'speaker_0': 'Modica Thank you, Mayor and Council. This is a great opportunity to help out a lot of our residents through some direct tenant assistance. We will go over the options with you and Oscar Orsi will give that staff report.'",
        "'speaker_0': 'Thank you, Mayor. Members of the city council. This is a great opportunity. We've been awarded up to $28 million for additional residential rental assistance. We have before you tonight three options to present to you. We're recommending option B, but to Andrew Chang, our real estate project coordinator, will be giving you additional details on those options.'",
        "'speaker_0': 'Andrew. Thank you, Oscar. Good evening, Mayor, and members of the Council. This item is related to the Emergency Rental Assistance Program. Next slide, please. As part of the Coronavirus Response and Relief Supplement Appropriations Act of 2021, Congress established the Emergency Rental Assistance Program and appropriated 25 billion in federal rental assistance.'",
        "'speaker_0': 'Of this, 2.6 billion is allocated for use in the state of California. 1.5 billion is allocated to the state for use as a block grant program. And the remaining 1.1 billion is allocated by the Treasury directly to local governments with populations over 200,000, including Long Beach.'",
        "'speaker_0': 'The state block grant has 14.8 million reserved for the city, and the city has already received its 13.75 million federal allocation directly from the Treasury. Next slide, please. The States are offering three options for implementation of the State and Federal Emergency Rental Assistance Program.'",
        "'speaker_0': 'Under option A, the city would transfer its entire federal allocation of 13.75 million to the state, -206,000 or 1.5% of the allocation, which can be used by the city for coordination and administration. The state would then run a central program with these funds that designated for Long Beach tenants and landlords.'",
        "'speaker_0': 'Under Option B, the city would request that state block an allocation of 14.8 million from the state and self-administer a local program. Up to 10% of these funds can be used for administration, and the city program would need to conform fully with state requirements.'",
        "'speaker_0': 'Finally under Option C, the city would not conform its director allocation to state rules and would administer a separate local program while the state serves Long Beach to the state program simultaneously. The city would accept responsibility for duplication of benefits checks between the two programs.'",
        "'speaker_0': 'And it's likely. Staff considered the pros and cons of the three options available, with considerations made for maximizing program delivery, speed and control, maximizing the ease and access to the program for eligible tenants and landlords, minimizing the local administrative burden and minimizing financial risk for the city, including the risk of recapture of funds by either the state'",
        "'speaker_0': 'or by the US Treasury. Excellent. Staff is recommending Option B, which offers the highest level of standardization across both federal and state block grant allocations and allows the program to be locally administered and customized within the bounds of state requirements for customization, such as deeper income and higher need area targeting.'",
        "'speaker_0': 'Staff also seriously considered Option eight, which would place all funds under the state's authority to administer the state, already has assembled a group of partners experienced in the administration of such programs with a stated program launch date of March 15th, 2021.'",
        "'speaker_0': 'Option C was not considered viable due to the risks and complications associated with avoiding duplicate or improper payments. Next slide, please. The recommendation is for starters, it's for the City Council to receive the staff report on the State Emergency Rental Assistance Program and adopt staff recommendation option B.'",
        "'speaker_0': 'The state is requiring jurisdictions to submit an expression of intent form by February 12th, 2021. To be eligible to receive the block grant funding. And this will commit the city to its chosen implementation option. Next slide. That concludes my presentation and staff is standing by to answer any questions.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you. With that, let me go ahead and go to the council. I want to make some just broader comment. And then I have Vice Mayor Richardson who who's up? So first, I want to thank staff for their presentation.'",
        "'speaker_3': 'I think this is obviously a very, very important work. And I think most importantly, I do want to thank all the work that's gone on to ensure that we received both this federal allocation as well as the state allocation.'",
        "'speaker_3': 'Obviously, these resources just don't magically come down to us without a lot of work. And I think our local team, as well as all the work that's happened both in Sacramento and at the federal level, have been really helpful to ensuring that these resources come down to cities and especially a city with like Long Beach, which has'",
        "'speaker_3': 'such a robust tenant population that really needs this assistance. So just to everyone involved, a huge thank you. I did want to highlight and I mentioned this at my at the state of the city, just the URL allocation and loan, which is 13.8 million, which I talked about a few weeks ago.'",
        "'speaker_3': 'Just that allocation alone would be the largest tenant assistance program that we've ever had at the city. And so that was significant. And then, of course, the state came in and added and more than doubled that allocation. And so what we're looking at in front of us is by far the single largest opportunity to help tenants with'",
        "'speaker_3': ', particularly during this pandemic with with COVID and rents that we've ever had as a city. And so this is a program that will be enormous for us to undertake. I'm very supportive of staff and their ability to kind of go in to own the program to ensure that we're working with with organizations that can help get the'",
        "'speaker_3': 'word out, that we are working with associations, of course, that that are supporting tenants with landlords that are trying to get get their tenants to work with them as they're having to pay back, back rent. So just the whole process, I think is really important and I'm looking forward to the city's leadership on this.'",
        "'speaker_3': 'So I look forward to obviously getting regularly updated on how we're doing. It's going to take us, I think, some some time to get this program off the ground. And we're already started. But I just want to commend staff for all their amazing work and to everyone that's been involved in helping us get these funds.'",
        "'speaker_3': 'And so good work to already be able to help a lot of people with that. Vice Mayor Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I think I think you nailed it. I think option two or option B is that presented? So for a number of reasons. First, this allows us to set up scaffolding support for the front door.'",
        "'speaker_2': 'I'm on rental assistance here in the city in case we choose to invest in it again in the future. And that's really important. We place a front door on workforce programs, we place a front door on homelessness programs, and this is a great opportunity for us to have the program here locally.'",
        "'speaker_2': 'I also want to just acknowledge that the state's actually done a lot of good work recently with the extension eviction moratorium on the conversation on what happens with back rent investment into rental assistance. All of these things help make our job a lot easier as as council members so we can focus on sort of the broader recovery'",
        "'speaker_2': '. And then the federal support I think is incredibly key as well. So being able to put a front door on it and deploy it I think makes a lot of sense. So I'm going to move that. We go with staff recommendation of of option two or option B.'",
        "'speaker_3': 'Okay. I have a second by Councilwoman Allen. Councilman Allen?'",
        "'speaker_1': 'Yeah. Assad. Thank you. This is just exciting and hopeful and and just long overdue for our residents who are in desperate need for our help. And I, too, want to thank our federal representatives for all of their hard work and supporting this necessary assistance for our needy families and individuals.'",
        "'speaker_1': 'This is a down payment on our future economic recovery, and this is going to help a lot of people who desperately need it right now. So thank you.'",
        "'speaker_3': 'Thank you. Next up is Councilman Mongo.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Thank you. I'm very supportive of option B. I think this best provides us a position where our residents have a single door of access to all options. I think this is a great proposal and much needed help and I'm in big support of this item.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. Next up, it is customers in the house.'",
        "'speaker_1': 'Thank you, Mayor. I am grateful to have this funding made available to us here in Long Beach, to our tenants to be able to assist them. We all know we have just a tremendous need when it comes to our renters who have been severely impacted by COVID.'",
        "'speaker_1': 'And in many cases they are behind in payments and in severe risk of losing their homes. I think that this this is not only going to help our tenants, but it's also going to help our landlords who have been missing out on the rent.'",
        "'speaker_1': 'And so this is going to help a population that we've been wanting to help and that we've been, you know, advocating for, which is both our tenants and landlords. So I'm very, very happy with this. I think option B is definitely the way to go.'",
        "'speaker_1': 'And I'm like, man, Councilmember Allen said, this is definitely way into our recovery and I'm looking forward to supporting this item. So thank you again.'",
        "'speaker_3': 'Thank you. Next up is Councilman Sarno.'",
        "'speaker_1': 'Thank you. I also want to echo my colleagues in supporting option B when I think staff for their heart working on this as well and that I really the part that I really like about option B is allowing us to be able to distribute it, administer it locally so that we can work with our local community groups'",
        "'speaker_1': 'and leaders to ensure that we're doing the outreach necessary to getting it to the the relief that's so desperately needed right now to our residents, our tenants. And so thank you so much.'",
        "'speaker_3': 'Thank you. I do. I'm going to have to have one member of the public. Let me go ahead, make my comment and then we'll go to that member of the public and then take a vote. I just wanted to also just add and I'll ask Vice Mayor Richardson to add this hopefully to the motion as as a'",
        "'speaker_3': 'friendly or just a something for staff. I want to make sure as we do this, this is this is an enormous undertaking and really significant that we also are looking at doing some additional data collection as we are tracking who or who is receiving the assistance and how it's helping them.'",
        "'speaker_3': 'And I think that particularly around our our basic income and guaranteed income work that we're already doing, which we already kind of participated and started collecting some data. I want to make sure that when we do this, a tenant assistance program, this expanded program, that we're also within it, creating some opportunities for data collection or cohorts within'",
        "'speaker_3': 'this enormous amount of folks that are going to receive assistance that we can do some real targeted research on how kind of this consistent kind of monthly income is can help them. And so I'm excited about that opportunity.'",
        "'speaker_3': 'And I just want to make sure, vice Mayor, that we can add the guaranteed income piece as a data collection point for us. That I would appreciate that.'",
        "'speaker_2': 'We we certainly can. So I'll add that to my motion and I think we should. As we talk about the inclusive recovery plan coming back, we should be tracking based on average, certainly this.'",
        "'speaker_0': 'And Mr. Mayor, if I can clarify where we can certainly do some additional data and collection and take a look at that, I do need to say that the federal requirements do not allow us to run any guaranteed income programs as a part of this money, that that is an ineligible expense.'",
        "'speaker_0': 'But we understand the point. We can certainly do and look at a lot of data because we're going to give the people a lot of resources that they're going to need during this time.'",
        "'speaker_3': 'Right. And I know that I'm not suggesting we run it as a guaranteed income program and just to collect the data to understand, to help us with that, the broader guaranteed income work so that.'",
        "'speaker_0': 'Thank you for the clarification.'",
        "'speaker_3': 'Yep. And so and so with that, I have a motion in a second. Is there I think I think I have one public comment.'",
        "'speaker_0': 'Yes. We have Melody Osuna.'",
        "'speaker_6': 'Good evening, Mayor Garcia and City Council. My name is Melody Osuna and I live in the eighth district. I'm an attorney with the Legal Aid Foundation of Los Angeles, or Lala. And I run a medical legal partnership with a health care facility in Long Beach, providing free legal services to low income tenants.'",
        "'speaker_6': 'Lastly, is a nonprofit firm that protects and advances the rights of the most underserved. Even though we have Los Angeles in our name, we've been a part of the community of Long Beach for decades. We have a community office in downtown Long Beach.'",
        "'speaker_6': 'Laffer runs the self-help and domestic violence clinics at the courthouse. And we have two medical legal partnerships with health care providers of the city. We work closely with low income tenants, and we see what works and what doesn't.'",
        "'speaker_6': 'And I want to begin by thanking the mayor and city council and staff for applying for the rental assistance program and providing it for the residents of the city of Long Beach. I agree that local control of the program is important and has the ability to help so many tenants.'",
        "'speaker_6': 'I understand there are limitations to the use of the funds based on state and federal guidelines, but I encourage the Council to consider the guidelines as a floor instead of a ceiling for the residents of Long Beach. We recommend that the city prioritize tenants at or below 50% area median income and specifically lower than 30% PMI.'",
        "'speaker_6': 'These tenants do not always have access to other kinds of safety nets and these funds could be the difference between staying housed or ending up on the street. We definitely recommend that the city prioritize access to programs because one size does not fit all.'",
        "'speaker_6': 'This can be accomplished by hiring multiple community based organizations based in different Long Beach communities to assist with outreach, community education and application support in multiple languages. Finally, we ask that when administering the program, we're working with the contractor who administer the program.'",
        "'speaker_6': 'But the documentation requirements should be the minimum needed for audit purposes, and that they be flexible with required documents requiring onerous documentation from tenants places an additional burden on many tenants who would be qualified for the funding but couldn't make it to their bank on time, or don't have a inkjet printer to print up their unemployment statement'",
        "'speaker_6': '. Flexibility is key. I have a client who can get a copy of his lease agreement in time for the last one year program. He had COVID. He was hospitalized. He lost his job. And he's a bona fide tenant with rent receipts.'",
        "'speaker_6': 'But he didn't apply for the program because he couldn't get a copy of a lease agreement. He's still struggling to catch up on rent, and I'll be working with him to apply for this new round of assistance. Thank you.'",
        "'speaker_6': 'I appreciate your time. Thank you.'",
        "'speaker_0': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. Roll call vote.'",
        "'speaker_2': 'Please.'",
        "'speaker_4': 'District. District one. District two. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'District five. By District six.'",
        "'speaker_1': 'District by.'",
        "'speaker_4': 'District seven, six, seven.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'District eight.'",
        "'speaker_2': 'District by.'",
        "'speaker_4': 'District nine. High emotion carries.'",
        "'speaker_3': 'Thank you. That concludes the agenda items. We will now adjourn the meeting. But I do have a new business from Councilmember Yaw Ringa for an adjournment. Please.'"
    ]
}