{
    "Recommendation to request City Manager to update the Los Angeles River Link Plan for the City of Long Beach and present a new updated plan to the City Council, and request City Manager to work with the LA River Revitalization Corporation and other regional partners to coordinate efforts to improve and enhance the entirety of the Los Angeles River and surrounding areas.": [
        "'speaker_1': 'So item 21.'",
        "'speaker_3': 'Item 21 Communication from Mayor Robert Garcia. Recommendation to update the Los Angeles River Link plan for the City of Long Beach and to work with the L.A. River Revitalization Corporation and other regional partners to improve and enhance the entirety of the Los Angeles River and surrounding areas.'",
        "'speaker_1': 'Thank you. Well, let me begin by making some some comments. I think there's been a lot of conversation in both the media and in the community about the Los Angeles River and the impact, obviously, it has on all the cities it goes and travels through.'",
        "'speaker_1': 'But also on the real focus that has been coming from the city of Los Angeles and from other cities on really doing restoration and a relook at the Los Angeles River. We did as a as a city, we did our last major update to our river like Los Angeles River Master Plan back in 2007.'",
        "'speaker_1': 'Since 2007, there there's been a lot of work that has gone into upgrading projects up and along the Los Angeles River. And these projects include some great projects. When it comes to our wetlands and the de force wetlands in North Long Beach.'",
        "'speaker_1': 'Other projects, including the Drake Park expansion project here closer to to the south and a variety of smaller park projects that need to be incorporated into the master plan. As as we all know right now, the L.A. River Restoration Corporation is taking the lead effort, along with the city of Los Angeles, in going to the Army Corps'",
        "'speaker_1': 'and a bunch of other organizations and putting together a master river project for the entire, really, county and region. As we all know, while the river most of the river is in Los Angeles, here in Long Beach, we actually and the river ends in our city.'",
        "'speaker_1': 'And we see a lot of both the benefit and the damage that is done by storm runoff and trash and litter that goes onto our beaches and into our harbor. What's incredibly exciting is a few months ago, I had a chance to meet with architect Frank Gehry, who is probably the most well-known living architect currently alive, one'",
        "'speaker_1': 'of the most well-respected across across the world. And he has been in a partnership with the with the new in a new partnership with the L.A. River Corporation in trying to masterplan the entirety of the river. And so it's important for us to take this next step to redevelop our master plan and to work with the current'",
        "'speaker_1': 'structure to do something really fantastic for Long Beach. And so I think there's I talked about this in my state of the city. I've been talking about this for for many years, was on the council, so of others on the council.'",
        "'speaker_1': 'We really need to update this master plan and begin working with Mr. Gehry, his team, as well as the L.A. River Court. This is going to be a once in a lifetime opportunity to reimagine and have this world class architect and visionary as part of our our river project.'",
        "'speaker_1': 'And so with that, that is the motion on the floor. There's been a motion and is second. I'll begin. Councilman Richardson, do you have any comments?'",
        "'speaker_2': 'Sure. I think you hit the nail on the head, Mr. Mayor. I think it's really timely that we capitalize on the synergies that we already have with things like the projects you mentioned with the Forest Wetlands Restoration, the Drake Drake Chavez expansion.'",
        "'speaker_2': 'And and I think is really also an opportunity to really think about all of those areas adjacent to the L.A. River, like to see see right away the 710 expansion that's going to take place very soon. So it's an opportunity for us to really think broadly about how we activate that whole space, to really expand open space'",
        "'speaker_2': 'opportunities and create create a more inviting and holistic approach to to that corridor that really divides the west portion of our city. So thank you so much. And obviously I'll be in support.'",
        "'speaker_1': 'Thank you. Councilman Turanga.'",
        "'speaker_4': 'Thank you. As a member of the Rivers and Mountains Conservancy, we've been talking quite a bit about the river and some of the improvements that are taking place upriver. Some of it has been returned to wetlands. That has been very successful in creating more recreational opportunities for the citizens of that area.'",
        "'speaker_4': 'So looking forward to our new plan here and hopefully that we can create some additional recreation opportunities here in Long Beach.'",
        "'speaker_1': 'Thank you. Councilman Austin.'",
        "'speaker_6': 'Thank you. I think this does present a great opportunity, obviously, with other cities like Los Angeles moving forward to do this. It makes a lot of sense for us to be looking at it as well. I don't think we should leave out or not consider this, that all of the cities in between, which I think are critical'",
        "'speaker_6': 'to to making any sort of Los Angeles River link plan work. I know we'll be definitely looking at this and have been looking at prioritizing through the Gateway Cities Council of Governments in many of those cities or within the Gateway cities.'",
        "'speaker_6': 'And so I'll be working hard to build partnerships along the way. And I know that there are state legislation proposed by Assembly member Anthony Rendon that seeks to kind of bring people together to to develop that synergy and a plan around the Los Angeles River.'",
        "'speaker_6': 'And I think we should give that a serious look as well, showing that Long Beach has a has a significant voice in that process. I do have some concerns with this because it doesn't speak to the fiscal impact.'",
        "'speaker_6': 'And I know we are considering our F 16 budget. How would this be paid for? Have we identify potential funding? And I'm not not so ambitious to look at funding the entire project, but but I'm a study and looking at this is going to require some sort of commitment from from from this council.'",
        "'speaker_6': 'Is is this motion to have the city manager come back at some point for a vote for the council to appropriate funds or what?'",
        "'speaker_1': 'Yeah, I think that the this is obviously just focus on the update to the master plan is what the item is for. The idea is first and foremost, there are some pretty great grant opportunities out there right now to do some of this work.'",
        "'speaker_1': 'And so I think we want to make sure that the council moves in the direction of being supportive of the of the update. And from there, we're going to begin by looking at some grant opportunities through the RAMSI and in other agencies as well.'",
        "'speaker_6': 'Okay. Well, I'm prepared to support this. I just want to make sure that we're not blindly going into something where we are appropriating a significant amount of resources.'",
        "'speaker_1': 'And if if there's a if there's obviously a a resource that we have to end up spending in the future that would come back to council.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_1': 'Councilman Gonzales.'",
        "'speaker_0': 'I just want to thank you, Mayor, for your leadership on this. I know this has been a talk. We've been talking about this for some time. And so I'll reiterate a lot of what my council colleagues said. But it is certainly will be a place for recreation, hopefully a place for sustainability.'",
        "'speaker_0': 'And of course, I'll also mention adjacent support to the western half of our city, like Drake Chavez and Shoemaker, which I know our city staff has been working very hard on and providing updates. And so I think all of that will be a perfect marriage for for this.'",
        "'speaker_0': 'And so I just look forward to seeing how this progresses. And I thank you.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_7': 'Yes, thank you. Thank you, Mayor. You know, I agree with the mayor on this plan because I think we definitely need the update on it. And I have seen a great change in L.A. complete completely. And it would be nice to, you know, enhance these along our river banks because especially if it included diversions or that our'",
        "'speaker_7': 'rivers could be even cleaner. So it helps the beaches out also. So I really definitely agree with you, Mayor.'",
        "'speaker_1': 'Thank you. Is there any public comment on the item? Seeing none. And before we vote, just another point. And so all the mayors of all the upstream cities are actually having conversations about this right now. And so they absolutely are a part of it and are excited about about this next step.'",
        "'speaker_1': 'Please cast your vote.'",
        "'speaker_3': 'Motion passes eight zero.'",
        "'speaker_1': 'Thank you. We're going to do because we have some of the students here. We're going to quickly go to item 23 so that we can be respectful of their their time. So we can read number 23.'"
    ],
    "Recommendation to receive and file a presentation on Success In Challenges, Inc. and the Long Beach Freedom School.": [
        "'speaker_3': 'Item number 23, communications from Councilman Al Austin and Councilmember Rex Richardson. Recommendation to receive and file a presentation on success and challenges and the Long Beach Freedom School.'",
        "'speaker_1': 'Gentlemen, also.'",
        "'speaker_6': 'Thank you. And it is a real pleasure for me to recognize a nonprofit in our city that is doing exemplary work with with our young people, with families, particularly in the North Long Beach, Uptown communities. Success and Challenges is a Long Beach based nonprofit grassroots social service organization.'",
        "'speaker_6': 'It was founded in 2001 by our own Reverend Leon Wood and its executive director, his wife, Paula Wood. In 2005, successive challenges established the Long Beach Freedom School, the first of its kind in Southern California. Today, there are dozens of Freedom Schools operating throughout Southern California, impacting thousands of young kids.'",
        "'speaker_6': 'The Freedom School is a six week summer reading enrichment program that is part of the National Children's Defense Fund Freedom Schools Program. It's based on a motto of high quality literacy programs parent and family involvement, civic engagement and social action.'",
        "'speaker_6': 'Inter-generational Leadership development and health and mental health and nutrition. In addition, Freedom Schools to Freedom School Success and Challenges provides a number of other valuable resources and services to the community, including Saturday Tutorial Academy, Youth and Art Program and After School Program at the North Point Apartments.'",
        "'speaker_6': 'Providing homework assistance, enrichment activities and healthy snack to a population of more than 500 at risk youth. Mr. Mayor, a city council. I just felt compelled to recognize this exemplary work from a couple who have dedicated and dedicate and do dedicate so much of their time, their heart, their resources, their their, their intel and collaborative approach to'",
        "'speaker_6': 'bringing our community together. And I wanted to recognize success and challenges. And more importantly, Mr. Leon and Paula would I'd like to bring them forward to say a few words after Mr. Richardson. Councilmember Richardson.'",
        "'speaker_2': 'I want to thank Councilmember Austin for for taking the lead on recognizing freedom, schools and success and challenges. I got to tell you, this is an organization that finds this program finds its roots in the civil rights movement, the Mississippi Freedom Summer program in the 1960s.'",
        "'speaker_2': 'And here here we have it today. It's a high quality program that really works with with with our youth from north along the north Long Beach area. We've been tremendous supporters of this program. It's bounced between all corners of North Long Beach.'",
        "'speaker_2': 'It's been at Hamilton, I think it's at Perry Lindsay now. And so this is a program that we're all we're all tremendously supportive of. My predecessor, Councilmember Neal, is now on the board, I believe, and we're in and his his wife, Tanya, was, I think was she the fundraising chair this year?'",
        "'speaker_2': 'So so this is this is very much so an important priority to North Long Beach. Just a couple of weeks ago at our state of the ninth District, we recognized the now president, Paula Wood, for her leadership here with an Empower Uptown Community Partner Award.'",
        "'speaker_2': 'And it was the first first of its kind. And we had to obviously go back to Dr. Wood and Mrs. Wood for this award. So it absolutely makes sense. Again, I want to thank Councilmember Austin for his leadership.'",
        "'speaker_2': 'I really want to thank you for your hard work in keeping this program going for so many years.'",
        "'speaker_5': 'Thank you so very much. I would like to know where.'",
        "'speaker_4': 'Go for it.'",
        "'speaker_1': 'Thanks for doing the video first.'",
        "'speaker_5': 'Okay. On the screen, you'll see some of the highlights from our summer program that we just completed. Like the council member said, our program was at Perry Lindsay this summer in North Long Beach and in our district, actually.'",
        "'speaker_5': 'And we served 110 youth and the program is a six weeks program. It finished on August the seventh. And so these are some of the highlights from that program. While we're here, I'd like to introduce some of the staff that work our hard working staff that I have behind the scenes.'",
        "'speaker_5': 'I'd like to introduce our program director, Yvonne Nuttall Pace. And our sister site coordinator for Freedom School this summer was Vicki Oliver's. And our youth organizer was joined on the block. He works very hard with our teenagers. And so I was going to just take a lot of what I was going to say, our council members covered'",
        "'speaker_5': '. So what I would like to do is just kind of have a very quick, brief remarks by each one of our staff and how they're involved with Freedom School and what keeps them coming back every year. Ms.. Ms..'",
        "'speaker_5': 'Oliveira is actually a kindergarten teacher, but every summer she manages to arrange her schedule so that she can be involved with Freedom School. We are the longest operating Freedom School in Southern California and we've been operating now for 11 years.'",
        "'speaker_5': 'The program is free to the families that we serve, but we do have to raise a lot of money in the community to serve about 100 children. It costs us about 85000 to 100000 each year. And so we have a gala that we put on in the spring.'",
        "'speaker_5': 'And this year we were very pleased and honored to have Mayor Garcia as our guest speaker for our gala in the spring. And I'd also like to thank Councilman Urunga for his support with this program as well. And many people in the Long Beach community as well, we really have reached out and so many of the community'",
        "'speaker_5': 'leaders have come forward and are working to help us put on this program, either financially or serving in some capacity as a reader during our R&B portion in the morning or coming in the afternoon and providing skills where they can help with a craft or a special project.'",
        "'speaker_5': 'So just briefly, I'd like to have Ms.. I'll start with Ms.. Yvonne.'",
        "'speaker_3': 'It's an honor to be here today to talk about Freedom School.'",
        "'speaker_5': 'Freedom School, I mean, a lot to me, cause I started off as a college student.'",
        "'speaker_3': 'Going back to Tennessee for training, and it was extremely a lot of work. And for the 11 years I have been a part of this movement, it has been awesome. I have taught students, they came back and now they begin to be certainly the interns.'",
        "'speaker_3': 'So now we actually have our scholars that grow up in a program and come back and actually do the work as well. So it's just a love and a joy. Each scholar walk away with six books from our program, and they actually began to build their library and me as a mother first.'",
        "'speaker_5': 'It was a great opportunity to have my daughter there in the program. She'd been a part of the program now for ten years, so just extremely blessing. I turn over to my sister.'",
        "'speaker_0': 'Thank you so much for your time. Reading is Power and Language Freedom School. We encourage reading over the summer six weeks reading program. As an educator, I am excited to be part of the program. Been there for 11 years and will continue.'",
        "'speaker_3': 'Working in the community. Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_8': 'Thank you for having us. As a fellow.'",
        "'speaker_2': 'Long Beach native, born, raised and educated, I feel it's my duty to give.'",
        "'speaker_4': 'Back to my city. So this is.'",
        "'speaker_2': 'What keeps me going and keeps me.'",
        "'speaker_4': 'Helping the youth of the city. Thank you.'",
        "'speaker_5': 'I'd like to have our youth center here. Stand up.'",
        "'speaker_9': 'And we have come here.'",
        "'speaker_5': 'All right. And I won't take too much more of your time. But I did want to mention, I think Councilmember Austin mentioned that we started an after school program this year. We were blessed to get a contract to do an after school program about the Northpoint Apartments.'",
        "'speaker_5': 'And we completed a full year. We served over 70 to 100 children every day there. And we also, while we were doing Freedom School, we had a summer enrichment program going on at North Point as well. So we just want you to know that we are out there.'",
        "'speaker_5': 'We're actively engaged working with the youth in Long Beach, and we encourage you to check us out at our website. WW W dot success and challenge dot com and look up information about our programs and we hope that we've maybe inspired some of you who might want to call and volunteer.'",
        "'speaker_5': 'All right. Thank you.'",
        "'speaker_1': 'Thank you. Councilor MacGregor.'",
        "'speaker_4': 'Thank you, Mayor. I want to extend my congratulations to the previous group for all the work they've been doing around the community. And of course, Reverend Leon and his wife, Paula. I've known them for many, many, many, many years.'",
        "'speaker_4': 'And you continue to be an amazing couple with all the work that you do. And I congratulate you on this presentation tonight. And I join Councilmembers Austin and Richardson in this recognition. And congratulations to you.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_7': 'Yes, thank you, Mayor. I also would like to thank Councilman Richards in Austin for bringing this to the nation tonight. I would really want to give a special thanks to Dr. Leon Wood. And Paula was for all they have done for our youth and family throughout the city with this program.'",
        "'speaker_7': 'You know, it's educated on many levels and most important, it restores hope in many lives that participate in this. And I really don't see how Dr. Woods can be in many places that he goes to and still run a school.'",
        "'speaker_7': 'So efficient as this. Dr. Woods, I'll take my hat off to. I can't say I take my hat. I don't have it on tonight, but I just give you all the thanks and pleasure for that. Thank you so much, Doctor.'",
        "'speaker_7': 'What you and your wife and your staff, you guys are doing a great job.'",
        "'speaker_1': 'Thank you again, Councilman Austin.'",
        "'speaker_6': 'Yes. I'd like to also just just close by asking the woods and the staff and all the children to join us down here for a photograph. I can't tell you how important this Freedom School is and just how I've personally witnessed over the last few years young people who have come through the program and now who are'",
        "'speaker_6': 'coming back in and acting as as kind of camp counselors and leaders and inspiring young people, paying it forward. And so I loved to hope that this Freedom School is around for another 11 years and another 50 years doing and continues to grow throughout our city doing positive work for behalf of families throughout Long Beach.'",
        "'speaker_6': 'So if I could get Councilmember Richardson, the mayor, to join us up front for a photo, please.'",
        "'speaker_1': 'Okay. I'll call for public, obviously the vote real quick and also the photo call for public comment. Okay. Great. Please cast your vote and I will do the photo for to receive and file on this.'",
        "'speaker_3': 'Motion carries eight zero.'",
        "'speaker_1': 'Okay, we'll do the photo.'",
        "'speaker_4': 'What I'm doing.'",
        "'speaker_1': 'Why don't we just. Why don't we? Come on.'",
        "'speaker_2': 'Hey, man know. They always made me think. You look good.'",
        "'speaker_10': 'Yeah.'",
        "'speaker_2': 'Look good.'",
        "'speaker_6': 'You go out on the ground.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_2': 'Very much. Thank you. Thank you so much. Thank you.'",
        "'speaker_7': 'Thank you. Thank you. Great job, Dr..'",
        "'speaker_1': 'Okay. We're going to try to get through a couple two quick items as well, and then we'll get to our budget hearing. Since we're on a roll here, so why don't we go ahead and do item 22? Actually, let's actually let's do 24, which I believe there's a folks here for its 24.'"
    ],
    "Recommendation to receive a report and consider amendments to the Cultural Heritage Commission Ordinance as recommended by the Cultural Heritage Commission (Version A); or as recommended by the Development Services Department (Version B);   Request City Attorney to draft an ordinance amending Long Beach Municipal Code Chapter 2.63 related to the Cultural Heritage Commission (Version A or Version B), and amending Long Beach Municipal Code Chapter 9.65 related to Administrative Citations and Penalties; and  Increase appropriations in the General Grants Fund (SR 120) in the Development Services Department (DV) by $69,000.  (Citywide)": [
        "'speaker_1': '24 is a Cultural Heritage Commission ordinance. So why don't we do 24 since I know there's people here for that and and then we'll go from there. So, Madam Clerk, item 24.'",
        "'speaker_3': 'Item number 24, report from Development Services Recommendation to receive a report and consider amendments to the Cultural Heritage Commission Ordinance as recommended by the Cultural Heritage Commission VERSIONE or as recommended by the Development Services Department. Version B Request City Attorney to draft an ordinance amending the Long Beach Municipal Code related to the Cultural Heritage Commission.'",
        "'speaker_3': 'Virginie Irby and amending Long Beach Municipal Code related to administrative citations and penalties and increase appropriations in the Development Services Department by 69,000 citywide.'",
        "'speaker_1': 'Okay. Vice Mayor Lowenthal. There's a motion and a second. Vice Mayor Lowenthal.'",
        "'speaker_11': 'Thank you. I had a couple of questions. One. I know the staff report acknowledges the use of other cities in forming this policy amendment. If you can tell me, your staff can tell me what do the cities of Los Angeles, Pasadena and Glendale say about property, property owner authorization?'",
        "'speaker_8': 'The staff member answering these questions will be our development services.'",
        "'speaker_12': 'Manager, Linda Tatum.'",
        "'speaker_11': 'Continue.'",
        "'speaker_0': 'Good afternoon. Members of the council. Mayor, in response to the question about the city, specifically the cities of Los Angeles, Glendale and Pasadena. Of those three cities, the one city that does require owner notification prior to a landmarking process is the city of Glendale.'",
        "'speaker_0': 'The other two do not require owner authorization.'",
        "'speaker_11': 'Okay, I appreciate that. And the second question I have is from my staff. I know they asked about the policy in other cities in Southern California, such as Claremont, Sierra madre and Santa Ana. Do you know if they have a similar ordinance and what it requires by way of owner consent?'",
        "'speaker_0': 'Yes. I have the list. 1/2. We'll get the list.'",
        "'speaker_13': 'Yeah, we have that list as well. We did look at all of the cities in Los Angeles County that do have these types of ordinances, and it's about 5050 as to whether they actually require owner consent or not, specifically for.'",
        "'speaker_13': 'Claremont. Owner consent is not required. Okay. Uh, what were the other cities?'",
        "'speaker_11': 'Santa Ana. Sierra madre.'",
        "'speaker_13': 'Santa Ana is not on here because we only looked at Los Angeles County, and, uh, Sierra madre does require owner consent. Okay, so it is. It is a mixed bag.'",
        "'speaker_11': '5050. And, Mr. Mayor, I apologize. I'm sure staff has a proper report, and I should have waited till the end, so thank you.'",
        "'speaker_1': 'No problem. We'll go. We'll come back to you, Vice Mayor, as soon as don't we go to the staff report on this and then we'll come back to the to the council.'",
        "'speaker_0': 'Okay. Back in early 2015, our the development services staff was we began initial discussions with Long Beach Heritage regarding the process to designate some of the city facilities with the landmark designation. And as a result of that list and looking at the process, we realized that the process was fairly cumbersome and lengthy and there was some redundancy'",
        "'speaker_0': 'in the process. As a result, staff requested our historic preservation consultant, Galvin Preservation Associates, to to work with staff to come up with a recommended way to streamline the ordinance, to make the process a little bit more straightforward and a little simpler and more efficient.'",
        "'speaker_0': 'So working closely with that staff, we did with staff. The consultant looked at other ordinances in Los Angeles County. We also got feedback from Long Beach Heritage and from of the some of the historic districts in the city over based upon our annual meetings with those groups and based upon our experience with the process for previous historic'",
        "'speaker_0': 'preservation designations. So as a result, we came up with a recommended ordinance and you see that in your exhibit. And I'm just going to briefly tell you some of the changes to the ordinance. We added some definitions that were recommended by our consultant to clarify some of the terms that were contained in the ordinance.'",
        "'speaker_0': 'Really importantly, we simplified the designation criteria. We narrowed it down from, I think it may have been 11 or so criteria down to three. And the important component of that designation is that those criteria are now consistent with the State Office of Historic Preservation, as well as the federal regulations.'",
        "'speaker_0': 'So the benefit there is that once a designation is made at the local level, it can can go forward to the state and the national level a lot more simply and consistently. We also streamlined the application process. We made it less cumbersome.'",
        "'speaker_0': 'It now goes directly from the Cultural Heritage Committee, directly commissioned directly to the City Council, rather than the intermediate step of going through the planning commission. The other thing that was really important in this process, in terms of the recommended process, is that we we feel that it enhances the credibility of the designation with the process that'",
        "'speaker_0': 'we now have in place. Because for every application, whereas in the past, the application, along with whatever documentation, would go forward without any additional staff analysis or assessment of the application in the material submitted in the application, the city will now with every application that we receive for designation, either for an individual property or a district, the'",
        "'speaker_0': 'the city will pay for a consultant to do a much more thorough assessment of the property and do a proper survey. This was based upon some of the concerns that some of the current designations did not have a very thorough vetting based upon their current designation.'",
        "'speaker_0': 'So we wanted to remedy that. And the city will contribute resources to make sure that that occurs and that process would occur prior to it being taken forward to the CHC for a recommendation. The other items that we did was establish a process to either rescind or amend the designation that was not previously included in the process'",
        "'speaker_0': '. And lastly, we took out some of the redundancy by the leading the the section that addressed the publicly owned resources because when city properties are involved, the city had the right to to go through the existing process. So in addition to that, the less what we think was a really significant change to that process is that we'",
        "'speaker_0': 'added provisions for administrative citations. Currently, the code enforcement staff does not have a way to cite property owners for making additions or changes to historic designations. And the change that we're recommending with this adoption is a change to add citation provisions or administrative citations to Chapter 9.65, the administrative citations and penalties section of the code entitled to'",
        "'speaker_0': 'the Long Beach Municipal Code. So with that, that's an overall summary. So what? You see in your packet, there is a an exhibit A which is a CHC recommended ordinance and staff and the CHC agreed on all of the components of the ordinance with all of the changes to the process and the additions of the citations.'",
        "'speaker_0': 'But you also see in your packet a version B, which is the staff recommended ordinance. And the one difference between the two ordinances is that staff is recommending that we get owner consent as a part of the application packet.'",
        "'speaker_0': 'The Cultural Heritage Commission did not agree with that direction or with that recommendation, so they recommended that the owner, the language that does not require the owner's authorization, which is not in the current code, that that the current language remains.'",
        "'speaker_0': 'And in the staff report, we've provided more specific details of that language. The last component that I bring your attention to is the fact that this ordinance is also looking at the fiscal impact, and that impact is approximately up to approximately $70,000 each year because staff, as we said before, the recommendation is that the city fund full'",
        "'speaker_0': 'assessments of any applications that come before the city. The thought being that we want to make sure that the city's resources are being wisely spent as a part of that process. And we feel that the recommended ordinance, which includes the owner authorization before a process is going will essentially it's a good balance, we think, between the private'",
        "'speaker_0': 'property rights of the owner too, because the designation will affect the the owner's property and it will indeed establish some limitations on their property. And we felt that the owners informed consent to go forward with that process was an important consideration for the city to make, especially given that the city will be committing resources to have these'",
        "'speaker_0': 'properties fully vetted and that that commitment of resources is not to be taken lightly. And that concludes staff's recommendation or its presentation, and we're available to answer any questions you might have.'",
        "'speaker_1': 'Thank you. I'm going to turn this back over to Vice Mayor Lowenthal.'",
        "'speaker_11': 'That's all I have right now for questions. Thank you.'",
        "'speaker_1': 'Okay. Then I mentioned this over to councilman. Now, just to be clear, is there is there a motion on the floor or. No.'",
        "'speaker_11': 'There is a motion for option A. Is that how we're doing this?'",
        "'speaker_1': 'Well, there's two there's two versions. So there's version. Version. A, which is the recommended Cultural Heritage Commission version. Correct me if I'm wrong. Ms. BODAK And then there's version B, which is the staff recommended version.'",
        "'speaker_11': 'So the motion I'd like to make is for version A.'",
        "'speaker_1': 'Which is the cultural heritage recommendation. Yes. Okay. And Councilman Richardson. Okay. So there's a second by Councilman Richardson. So that's the motion on the floor. Councilwoman Gonzalez.'",
        "'speaker_5': 'It's so good.'",
        "'speaker_0': 'Okay. So I had a couple of questions. So is it possible I know we had just mentioned, Linda, that research within city staff would be about $70,000. Is it possible for us to do some sort of outside research, maybe using Long Beach heritage or using an outside group to be able to do this research that would show'",
        "'speaker_0': 'that that that amount.'",
        "'speaker_13': 'We actually did some preliminary research on a list of properties that were being considered by Long Beach Heritage. And we actually used a member of Long Beach Heritage to reach a certain point in that research. So we did have the benefit of that, and we do expect to be able to rely on those research capabilities.'",
        "'speaker_13': 'But beyond that, we still need to have them in a professional form and do a bit more research than I think volunteers are capable of. So it also would not necessarily be staff costs that are incurred, but actual outside consultant costs that we would we would incur in order to move those nominations forward.'",
        "'speaker_13': 'We did provide you a maximum. The $70,000 is a maximum, assuming that we have a very, very robust landmarking program and we're moving forward with multiple designations in the course of a year.'",
        "'speaker_0': 'Thank you. And then I know, of course, many people are afraid that if we go ahead with owners property rights, that it could potentially lead to demolition of these potentially historic buildings. So is there a way I mean, how do we I know that's difficult because we still need to do research, but is there an answer for'",
        "'speaker_0': 'that or is there a way to minimize that risk?'",
        "'speaker_13': 'And certainly, I think the issue before you today is is really an issue of a matter of trust. And we have not had an active historic preservation program for at least ten years in the city. And with the addition of Linda Tatum and with the addition of our advanced planning officer, Christopher Coons, and the addition of a'",
        "'speaker_13': 'of a historic planner funded by the city council during this fiscal year 15 budget, we do have a renewed emphasis on a historic preservation program. Linda and her staff have put together a work program that is actually presented to the the Cultural Heritage Commission.'",
        "'speaker_13': 'And that work program should hopefully demonstrate a renewed commitment to historic preservation that also includes the landmarking process. In this instance. The difference is that that we want to be able to work with the property owner ahead of time and make sure that the property owner understands what they're getting into and the potential impacts to the private'",
        "'speaker_13': 'property owner rights. With a landmarking designation, however, if a if an owner chooses not to landmark, we are fully informed and we have a lot more resources in place than we ever did before, that we know that that property is potentially historic.'",
        "'speaker_13': 'We now have those properties identified through surveys which we currently previously did not have. We now know that those are potentially historic properties and can put them in the computer system so that when an applicant comes forward and wants to demolish a building or a house, a commercial building or a house, it's in the computer system that'",
        "'speaker_13': 'gives us a warning that says we can't just automatically issue them a demolition permit. And I think that there has been have been cases in the past where that has occurred. And so there is a legitimate fear that there is that opportunity that a new property owner could come along and just ask for a demolition permit.'",
        "'speaker_13': 'I think we've put safeguards in place and that we have the programs in place now to prevent that from happening. If a private property owner says, I want to demolish the property and we know it's potentially historic, we have an obligation under secure to to look into that analysis and to actually complete a square review before we'",
        "'speaker_13': 'issue the demolition permit. That's a big change from the practice and the protections that we've had in the past. So I don't see this as weakening our ability to stop an unintended demolition from from occurring. I think that the protections that we're putting in place and the renewed focus on historic preservation will will provide us those protections'",
        "'speaker_13': 'that the preservationists are looking for.'",
        "'speaker_0': 'Thank you. And I just think your commitment and I thank you for bringing that forward, because I know you did speak at the Banbridge House to the Cultural Heritage Commission and some members there as well. As, you know, we had a great historic forum and we got I felt like there was a renewed sense of that as'",
        "'speaker_0': 'well. So I thank you for bringing that up. So appreciate it.'",
        "'speaker_1': 'I'm gonna go. If there's a Lester's any objection, I'm gonna go to the public comment, and they will come back to the councilmembers. So public comment on the item. Please come forward. Any public comment on a cultural heritage item?'",
        "'speaker_1': 'Nope. There's one come forward and they're going to move on.'",
        "'speaker_5': 'Good afternoon, Mayor. Vice Mayor, City Council. My name is Lee Fukui. I'm a sixth district resident. I'm a member of Wrigley's Going Green, Wrigley Clean, team member of L.A. Conservancy and Long Beach Heritage. Basically, I'm a local volunteer and architecture geek.'",
        "'speaker_5': 'Overall, I think the language of the ordinance is great.'",
        "'speaker_2': 'Especially with version A. It gives better.'",
        "'speaker_5': 'Enforcement in protecting Long Beach landmarks. I have great concern with version B, but it's a deciding factor with potential landmarks, you know, solely dependent on property owners. Even though we have the computer survey.'",
        "'speaker_2': 'And.'",
        "'speaker_5': 'Those protections in place, mistakes can happen. I'd prefer someone to.'",
        "'speaker_2': 'Be to double check, go on.'",
        "'speaker_5': 'Site.'",
        "'speaker_2': 'And and see.'",
        "'speaker_5': 'The site in particular, you know, up front and physical, because I know mistakes do happen. And with whatever survey you have, once, once a demolition goes through, that's it. You're not going to get that landmark back. And for example, the press telegram building is not landmarked, but it was fortunate to have Molina health care come in and'",
        "'speaker_5': 'adaptively reuse that building. But what would happen if Molina decided to sell that building and a new owner wanted to tear down under version B? That could happen and it would be a dramatic loss to the city. Um, as a council, all of you have historic landmarks or future landmarks in your districts.'",
        "'speaker_5': 'We've all seen positive transformations in areas like East Village Arts District, the art theater on Retro Row, the insurance exchange, and American hotel buildings near the promenade. These landmarks helped energize and encourage investment in your communities and the city overall.'",
        "'speaker_5': 'It makes Long Beach unique, and these places matter. This Council as a governing body should have the final determination on what is best for this city. This decision is far too important to let property owners.'",
        "'speaker_2': 'Have the last word. Please vote for CHC.'",
        "'speaker_5': 'Recommended version A and keep Long Beach a landmark.'",
        "'speaker_2': 'Destination. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. We think we've got three speakers. I'm going to if there isn't any warm closing the speaker's list of the three and then we'll go back. Yes, ma'am.'",
        "'speaker_0': 'He's with me.'",
        "'speaker_1': 'Oh, together. Then you're the last speaker.'",
        "'speaker_0': 'Go ahead. Hi, I'm Mary Vaux. I'm the executive director for Cure VI, which is the Community Foundation for the Preservation of the Iris Queen Mary. I have a few comments related to the current item. As a community based 501c3 nonprofit for the preservation of the Queen Mary.'",
        "'speaker_0': 'We're kindly asking City Council and the mayor to please consider postponing the vote of the recommended R 24 amendments to the Culture Heritage Commission ordinances to allow the community and Council members ample time to consider the cultural aspects and the possible outcomes they might have on historical properties and those yet not designated by the City of Long'",
        "'speaker_0': 'Beach as a historical landmark. I gave a few examples, one being the Queen Mary. It's been a long time intention by local preservationists, Long Beach Heritage and Termite to have the Queen buried designated as a city of Long Beach landmark.'",
        "'speaker_0': 'The Queen Mary was added to the National Register of Historic Places in April of 93 and remains recognized as a significant landmark around the world today. The possible outcome of these proposed amendments will directly affect the long term preservation opportunities for the Queen Mary.'",
        "'speaker_0': 'Also taking into consideration the mayor's newly formed Queen Mary Land Task Force, these proposed changes could interfere with national community preservation efforts of the Queen Mary. I gave a copy of this letter to each of you, and I'll hope that you'll take a minute to read it.'",
        "'speaker_0': 'Some of my points aren't directly related to this particular item, but I guess what my main concern is is we're in favor of option A. We would like the Cultural Heritage Commission to be as involved in the preservation of the city and the Queen Mary as possible, because right now we have no oversight or policy in place'",
        "'speaker_0': '. Anything can be done to the ship. Right now it's being done and the city and city council has allowed it. So I would just urge you to read the fine print. Thank you.'",
        "'speaker_1': 'Thank you. Sir. I Makaurau.'",
        "'speaker_2': 'Kill my secretary nonprofit Long Beach.'",
        "'speaker_1': 'While sitting here. I came up with a couple of questions.'",
        "'speaker_2': 'I just want the the council to consider and the staffers. You mentioned streamlining the process. The one question I has is let's not streamline history. Once you demolish history, it's gone. It's just gone. The the projected penalties and fees that you that you put into their proposal.'",
        "'speaker_2': 'I completely am in favor of that. Was there any.'",
        "'speaker_1': 'Projections made of what that revenue.'",
        "'speaker_2': 'Source would would create.'",
        "'speaker_1': 'To offset the costs, you know, the.'",
        "'speaker_2': '$70,000 that you mentioned? When you talk about property owners, does this include long lease, long term lease holders? Let's say if somebody has a 20 year lease, 50 year lease.'",
        "'speaker_1': 'Does that fall into that.'",
        "'speaker_2': 'Category as as a property owner? We're obviously in favor of version A. You mentioned trust. That's a tough one to swallow sometimes. So. I would I would trust the CHC on their opinions more than anything right now because they they've been they've been the constant with preservation in Long Beach.'",
        "'speaker_2': 'So I would trust their opinion and their their recommendation. Thank you.'",
        "'speaker_1': 'Thank you. I take this back to the to the council. I know. Uh, Vice Chair. I'm gonna get back to you, Councilman Austin.'",
        "'speaker_6': 'Thank you. And let me tell you, I don't feel very strongly one way or another on this particular item, version A or version B, I got to tell you, I am a bit concerned about, you know, the ethics with property rights here in the conversation.'",
        "'speaker_6': 'They're seeing that this is not a time critical issue. I feel a lot better if we we have some time to talk to the Cultural Heritage Commission and the commissioners. I haven't had any meetings with anybody regarding this matter prior to reading it over over the last few days.'",
        "'speaker_6': 'It would it would make me feel a lot better if we would continue this item for for 30 days or so to allow us to study this a little bit more, because obviously this is a decision that is going to be a significant decision.'",
        "'speaker_6': 'I did so. So I'd like to put forth a substitute motion to continue this item for 30 days if there's any appetite or will or the council to do so. And. I don't hear any. So we can no motion.'",
        "'speaker_6': 'Okay. Well, you want to. That would be be something that I'd like for this council to consider this evening. I did have a question regarding the volume of applications for cultural landmarks or historic landmarks that we actually get as a city.'",
        "'speaker_6': 'And maybe that's more appropriate for staff. Can anybody answer that question?'",
        "'speaker_13': 'Uh, Councilmember, we have not had an active request for landmarking status in in the last several years. This conversation really started with our renewed partnership with Long Beach Heritage and their request for us to consider a potential list of properties to consider potentially landmarking.'",
        "'speaker_13': 'That list has maybe eight or 11 different properties on it, three of which are city owned assets. The commitment that we were talking to with Long Beach Heritage was that we would look at the city assets first because that would be easy since we knew the property owner and we wouldn't have to have the discussion, the difficult'",
        "'speaker_13': 'discussions with the property owners if they chose not to move forward with landmarking. So I'd say that in the next two years or so, there's probably a minimum of three, but upwards of maybe ten or 11 properties that we would look to be landmarking.'",
        "'speaker_13': 'I do want to correct something. For the record, we are not talking about imminent demolition of any buildings. We're actually not talking about erasing history when we're talking about improving the process. The ordinance, as it is currently written, is so incredibly cumbersome that I don't even know if we could actually landmark a building if we actually followed'",
        "'speaker_13': 'the process. And the criteria that is used for the city of Long Beach does not match the criteria that is used by the state. We would like our criteria to be simplified to actually match the state criteria, which we think would actually make it easier to landmark properties.'",
        "'speaker_13': 'So I just want to correct a couple of those issues for the record.'",
        "'speaker_6': 'So when was the when was the last time we actually did land a property?'",
        "'speaker_13': 'We landmarked a building that I don't know the name of it. You might remember it. It's the the emancipated youth facility on Anaheim.'",
        "'speaker_8': 'The Hotel Pacific.'",
        "'speaker_5': 'Hotel was on it.'",
        "'speaker_13': 'Council members who were not.'",
        "'speaker_2': 'Are you referring to the Palace Hotel?'",
        "'speaker_13': 'Yes, it's the Palace Hotel was landmarked in order to assist it in getting historic tax credits and in order to allow that building to be rehabilitated. I'm going to say that building was probably landmarked in, you know, 2005 ish, somewhere around there.'",
        "'speaker_13': 'And that was probably the last building that has been landmarked.'",
        "'speaker_6': 'And I'll just like in with the statement, again, I'd like to know more and learn more about this. But if I can recall, when there was a debate to build a new North library, there were several people who were in opposition to doing that because of the historic value of the theater there.'",
        "'speaker_6': 'And had we had this kind of provision in place, we may not have a north library under construction as as is today. Martin.'",
        "'speaker_1': 'Before we go on, I have a couple more council members. I just want to just remind everyone that I think it's really important. There's been a lot of work that's gone into getting us to this point. And I just want to be clear that the commission and staff agree on probably 95% of the document coming forward.'",
        "'speaker_1': 'And so there is a disagreement on one item, which is the notification piece. But I just want to also just refocus that on a vast majority of the items in that are in discussion. There is agreement. And so a lot of work has gone gone into it's important that we update our codes and our audiences here.'",
        "'speaker_1': 'So it's good to have a debate about this one issue. It's an important issue. But I also want to just make sure that that everyone knows that were generally in agreement on where on where this is going. Vice Mayor Lowenthal.'",
        "'speaker_11': 'Thank you, Mr. Mayor. I think you covered it for the most part and misspoke. I want to thank you for correcting some of the misnomers that were stated here. I think typically. We would like to have a suspicion that the city and municipal government are not interested in preserving history, but that's an anathema to who we are'",
        "'speaker_11': '. I think that is exactly who we are in Long Beach and we are not raising history or demolishing anything. If anything, I think the staff's work and the Cultural Heritage Commission's work leads us down a path where we can actually landmarked something.'",
        "'speaker_11': 'So, Miss Burdick, if if you could give us some examples, for instance, of the 8 to 10 potential properties that were mentioned and what the ownership would be, I would appreciate that.'",
        "'speaker_0': 'Certainly one of the ones that come up.'",
        "'speaker_13': 'Off the top of my head is the Alamitos Branch Library on Third Street near Cherry. It is a city owned facility that is a beautiful Spanish Mediterranean facility that is very qualified to be a landmark but has not been considered as a landmark.'",
        "'speaker_13': 'An example of a potential private property is a beautiful craftsman, a two storey single family home in Virginia Country Club that was constructed by famous architects Green and Green Brothers. That is a private property that the property owners have spent an incredible amount of money restoring to the version of the Green and Green Brothers that that it'",
        "'speaker_13': 'was originally intended to be viewed as. But that house is not a landmark. And so, you know, one of those could potentially be a landmark. Another one is the community center at Highland Park. We've had discussions with Councilmember Richardson about that.'",
        "'speaker_13': 'It is not designated as a landmark now that the has the Long Beach Heritage Association pointed out their concerns, along with the Cultural Heritage Commission, that the building was not landmarked and may be potentially considered for demolition in the Highland Park master planning process.'",
        "'speaker_13': 'We talk to the council member, we talked to the city manager, we talked to Parks and Rec. We made it clear that it had value as a resource. They all agreed and that building will not be subject to demolition as part of the master plan, but will actually be incorporated as a master plan even though it is'",
        "'speaker_13': 'not landmarked today. So I think that in particular shows that we have a willingness to work with the preservation community to meet their preservation needs while still meeting our facility needs, particularly on city property, and that we are willing to have those conversations and not just consider demolition.'",
        "'speaker_11': 'I appreciate that. So also. So for the most part, I think it's safe to say we will have examples where the city of Long Beach is the property owner. And I should have clarified earlier when I made the motion to support version A that I do believe for the most part we would be the property owners.'",
        "'speaker_11': 'And so and I think when there is a private property owner, you will find an example such as the one that Ms.. Murdock elaborated on with the green and green home. You have invested owners who are already investing in preserving the historic aspects of their home.'",
        "'speaker_11': 'And a landmark status process is not cumbersome. And Ms.. Burdick, remind me, when we were working on activating the Jurgens tunnel, the Jurgens Trust at one point was on some registry, and we had looked into opportunities to possibly designate the tunnel as a landmark status.'",
        "'speaker_11': 'Is that something that the Cultural Heritage Commission has looked at?'",
        "'speaker_13': 'The Cultural Heritage Commission has not looked at any of these properties. We haven't gotten that far in the process. I don't believe the Jurgens tunnel was on the initial list that the Long Beach heritage provided to us, but we can certainly look at that as an option.'",
        "'speaker_13': 'Related to the initial list, I would say it's somewhere around eight or ten properties in length. I can recall three properties at a minimum were city properties and the others were private properties.'",
        "'speaker_11': 'Okay, thank you, Miss Burdick. So I recognize and understand that there might be some interest in delaying this item. But what I don't want to do is call the good men and women of our community to participate on our commissions and have them spend an exorbitant amount of time doing so and staff putting that work into it'",
        "'speaker_11': 'and cause unnecessary delays on our part. I'd like to emphasize to my colleagues that the motion I had made for version A is one that is fully vetted by the commission that we charge with these with these items.'",
        "'speaker_11': 'And it's also been vetted by the staff. And as the mayor said, it is identical. The two versions are identical except for the consent by the property owner. And for the most part, I think we can assure everyone that we would be the property owners city of Long Beach.'",
        "'speaker_11': 'And so with that, I urge my colleagues to support version eight. Thank you, Mr. Mayor.'",
        "'speaker_1': 'Thank you, Councilman Andrews.'",
        "'speaker_7': 'Yes, thank you, Mayor. You know, I want to thank the staff for their hard work on this item, but I also want to acknowledge the success. A resident emailed me on this concerned about this item. You know, as we have presented these two choices today, I can see that there may be a chance of losing some of'",
        "'speaker_7': 'our city heritage, which makes Long Beach a very unique place. And I just have a question that I'd like to ask Mrs. A anybody. I have a question for the staff. If it goes to option B and the property owner decides not to sign off on the property to become a landmark.'",
        "'speaker_7': 'Which option is there for the public to pursue landmark status?'",
        "'speaker_13': 'So in option B and the city, you know, we approach a property owner. The property owner says that they're not interested in landmarking the property and they're not interested in doing anything with the property at this point in time.'",
        "'speaker_13': 'The public frankly, it the property stays in in situ. It just its status stays current. However, what is known is that it has a it is a potential resource. It gets logged in to our system as a potential resource and a demolition permit or an adaptive reuse permit or a building entitlement permit will not be issued on'",
        "'speaker_13': 'that property until we have that discussion. Two years go by, three years go by, the property owner decides to sell or the property owner decides to do improvements to the property. At that point, we can then have the discussion with them about potential landmarking, particularly if the property owner is interested in receiving discretionary entitlements.'",
        "'speaker_13': 'We do have the ability to make it a condition of approval at that point in time that that they are required to landmark it. So we do have the opportunity to do that. And Option A does not wipe that opportunity off the map.'",
        "'speaker_13': 'Or option B excuse me, option B does not wipe the opportunity to landmark off the off the charts, I should say.'",
        "'speaker_7': 'Okay. Thank you. Thank you. You know, I'm kind of inclined to think that time is of essence really with this. And I would like to kind of I would like to see a little more time because I really haven't had that much time to really go.'",
        "'speaker_7': 'And I think 30 days or 60, what it would take in order to get this right, because this is something that would be extremely unique for the city and for, you know, people who in the city of Long Beach, when we talk about historical, you know, venue.'",
        "'speaker_7': 'So I would really like to kind of wait. And if we could get that, I would like to you know, if Mr. Armstrong is willing to make that motion, I don't know what it would go, but I would go with it.'",
        "'speaker_7': 'Yeah. You want to for any emotion, I like to ask, could we get it from the emotion to maybe for 30 days or more?'",
        "'speaker_1': 'I think the the friendliest asked the maker of the motion to move this move this a 30 days.'",
        "'speaker_11': 'I decline that.'",
        "'speaker_7': 'Okay. Okay.'",
        "'speaker_1': 'Okay. Councilwoman Mongo.'",
        "'speaker_3': 'I think that first, I want to thank so many people that worked so hard on this. And again, I know I say this often, but not each and every person is here every week. I really appreciate the written testimony that comes in in advance because it gives us an opportunity before Council to really go through the deep'",
        "'speaker_3': 'questions. And I think that the part that has had some concern with neighbors and I think that Ms.. Bodak and Vice Mayor Lowenthal, you've done a great job of really outlining some of the details, is that there's a fear from property owners that they will be forced to be a landmark.'",
        "'speaker_3': 'And the current document that I read from President Perry related to that the record owner may petition to withdraw from designated status. Really seems reactionary to me more than proactive in in reaching out to them. And so I'd be open to maybe instead of prolonging it 30 days to just give a direct result that it meets the'",
        "'speaker_3': 'concerns that I've heard, which would be that before. That the owner is involved before designation.'",
        "'speaker_1': 'Can can Steph maybe weigh in on that?'",
        "'speaker_13': 'We thought we had done that with version B. So we version B does not require the property owner to come before the city council after the property has been designated and ask for that designation to be withdrawn.'",
        "'speaker_3': 'So I think I'm asking for something slightly different. I think what I'm asking for is before it becomes designated that the property owner is reached out to and given the opportunity to speak with their council member to potentially prevent it from becoming designated.'",
        "'speaker_3': 'If they feel that they have cause. To maintain its current status.'",
        "'speaker_11': 'Vice Mayor. Mr. Mayor, if. I could. Understand this a little bit better. I think what Councilwoman Mungo is asking us to consider is more along the lines of the level of involvement we're. Yes. So Maverick, while version B approached it from that aspect, I do think there's an opportunity in version A to keep that in tact, but'",
        "'speaker_11': 'ensure that the property owner has the opportunity for a greater level of involvement in the process so it doesn't appear or in reality feel as though they are not in control. And again, I have to reiterate, for the most part, almost always there is cooperation because it is in everyone's best interest to go through this process.'",
        "'speaker_13': 'So if I could get some direction from the city council, that would be greatly appreciated in understanding it. At what point in the process would the property owner involvement be required? Would it be before it goes to the Cultural Heritage Commission, or would it be after the Cultural Heritage Commission has made an initial recommendation, but before it'",
        "'speaker_13': 'gets to City Council, or is it at the City Council?'",
        "'speaker_3': 'So my friendly would be that it would be before it goes to the Cultural Heritage Commission so that the owner could be there and present and present information should they request not to not receive that designation. And I think that it's important, again, a majority of the properties that are currently under consideration are owned by the city'",
        "'speaker_3': 'and are all in agreement. But when we legislate at this level, we really need to think of the potential unintended consequences 30, 40 years from now. And so if we could out of friendly that the property owner would be notified in advance of it coming to the Cultural Heritage Commission that would give them the opportunity to be'",
        "'speaker_3': 'present and a part of that process.'",
        "'speaker_1': 'Vice Mayor.'",
        "'speaker_11': 'I would accept that.'",
        "'speaker_1': 'Okay. So there's a motion on the floor with a friendly amendment.'",
        "'speaker_6': 'Councilman Austin I'm satisfied with that.'",
        "'speaker_1': 'Okay, then.'",
        "'speaker_13': 'Mr. Mayor, may I just ask one clarifying question, which is important to us, that this would occur before it was even scheduled for CHC hearing, or would it be at the CHC hearing?'",
        "'speaker_11': 'Before.'",
        "'speaker_13': 'Before. Excellent. Thank you. Thank you. We're very satisfied with that resolution. We do think it still balances A and B. So if that's the will of the city council, we would be pleased to implement that. Great.'",
        "'speaker_1': 'And before we go to a vote, I just want to because I've been hearing some of the I've been getting the emails and the had had some conversations. I just want to also just say that there is no question that when the city had a recession and an economic downturn, that there was definitely the level the level'",
        "'speaker_1': 'of commitment the city had to start preservation as far as having a dedicated staff member. There's no question that that suffered. I think everyone on this council recognizes that. Well, I think everyone has in their hearts wants to preserve and want to preserve our history.'",
        "'speaker_1': 'I think the city did slip a little bit when it came to having a commitment that was consistent. And so I think I want to I think it's important that we recognize that and the community understands that. But I'm also hopeful that now we can all move forward together, realizing that we have great new, new planning staffs'",
        "'speaker_1': 'on board that has this expertize, new historic preservation planner and new director of planning in Ms.. Tatum, and that we move forward with trust because we're all on the same page. We're all on the same team. We want to preserve our buildings.'",
        "'speaker_1': 'We want to make sure that there's trust that's there. And certainly that to me is important, I think, to this to this council and certainly to staff who's working very, very hard to ensure that we have a strong historic preservation program.'",
        "'speaker_1': 'And so with that, there is a motion on the floor. Please cast your votes.'",
        "'speaker_3': 'Motion carries eight zero.'",
        "'speaker_1': 'Thank you. I'm going to go. We're a little bit behind on doing the budget, but there's there's been a request to hear Ms.. Ridder. So I think Kimberly Ridder here in the audience, if we can have Ms.. Ritter, please come forward and know she has a few folks here in the room to go straight to the budget'",
        "'speaker_1': 'so we can have the budget. Folks, please start setting up. We're going to go into the budget after this.'"
    ],
    "Recommendation to request City Manager to provide an update to the City Council on the recently completed Downtown Parking Study which was requested at the November 11, 2014 meeting.": [
        "'speaker_3': 'Item number. Item number 22 Communication from Councilwoman Lena Gonzalez recommendation to provide an update on the recently completed downtown parking study, which was requested at the November 11, 2014 meeting.'",
        "'speaker_1': 'Councilman Gonzales.'",
        "'speaker_0': 'Yes. We'll start with a staff report from Public Works, please.'",
        "'speaker_1': 'Great step.'",
        "'speaker_8': 'Our director of Public Works, our Malloy, and we'd be happy to make this presentation.'",
        "'speaker_10': 'Thank you, honorable man Ann Arbor Council members. Good evening. It is my pleasure to provide an update update on downtown parking since the department's initial report to the city council in June. As you're aware, the City Council requested a comprehensive assessment of downtown parking at the end of last year.'",
        "'speaker_10': 'The department provided a parking study after months of data collection, outreach with downtown stakeholders and rigorous review of existing practices. This present presentation today summarizes those findings and provides an update on the action items described in the report.'",
        "'speaker_10': 'Tonight's presentation will provide a background of the issues, discuss the changes to parking facility management practices in downtown, including the principles which guide our management practices, cover important next steps we are undertaking to further enhance the experience of residents, businesses and visitors.'",
        "'speaker_10': 'As always, it's my pleasure to take any questions at the end. The city owns 14 public parking structures in downtown Long Beach. The largest of these facilities include the city place garages located on third, fourth and fifth streets, and, of course, the Civic Center garage on Broadway.'",
        "'speaker_10': 'In total, all 14 facilities provide 4151 parking spaces for residents and visitors while the city owns these facilities. The city has standard parking plus formerly central parking, operates and maintains this facilities. The City Council approved this contract in 2013 and the contract will expire at the end of the March next year.'",
        "'speaker_10': 'This section will highlight the changes to parking facilities and in light of face feedback we received from various stakeholders in downtown Long Beach. Our commitment is and will always be to be responsive to the concerns raised by residents, businesses and visitors in a timely manner.'",
        "'speaker_10': 'To that end and to fulfill that commitment, we have three established principles that guide our approach to managing the parking assets in downtown. The first is to ensure safe parking facilities where residents, businesses and visitors feel welcome to park in downtown.'",
        "'speaker_10': 'The second is to provide well-maintained facilities that have operational elevator elevators, light and other amenities. And finally, we endeavor to provide guidance to and from parking facilities to ensure that motorists safely identify and travel to parking facilities that best meet their needs.'",
        "'speaker_10': 'With the first principle. We have accomplished the following. Since issuing the June report, public works crews have replaced and added new lighting fixtures to to enhance security, installed new high definition cameras and recording systems to cover key entrances and exit points.'",
        "'speaker_10': 'And finally, enhanced security patrols and measures at the garages. We have also enhanced the parking experience with key infrastructure improvements. For example, a persistent issue was nonfunctioning elevators in some of our garages. Our crews identified the issue as overheating in elevator equipment room and invested in new cooling systems to keep the elevators operational.'",
        "'speaker_10': 'We have also worked with local businesses to enhance the timely removal of shopping carts, and city staff are prepared to intervene and remove the cars quickly if the business is unresponsive. Having excellent well-maintained parking facilities provide little if our visitors don't know how to get to them.'",
        "'speaker_10': 'We have made strategic changes and parking guidance, including researching and selecting through the RFP process a candidate for an advanced parking guidance system working with the City Managers Special Events team. Public Works is making progress in designing electronic message boards to direct motorist to open and available lots.'",
        "'speaker_10': 'This project would also include occupancy detection devices to convey the number of open parking spaces available. The project is funded by grants received from Metro. We broadly categorize these next steps into the following. Parking management, community collaborations and innovation.'",
        "'speaker_10': 'Parking management. Many of the discussed changes came as a result of a change in parking management early this year. We consolidated our parking operations under the Public Service Bureau, Uniting or parking management with our parking maintenance due to hard work of Public Service Bureau.'",
        "'speaker_10': 'We drastically improved our responsiveness to many of the issues brought to our last brought to the to you last year. We continue to advance and make more management practices, recognizing the complexity of the breadth of the city's parking operation.'",
        "'speaker_10': 'The city manager presented a budget to the city council that would add a citywide parking manager for our parking operations, both downtown and along our coastline. This position is offset by other reductions. Our committee members are our partners and our boots on the ground for delivering feedback to us.'",
        "'speaker_10': 'Our parking staff have embarked on extensive community outreach, having walked the garages with stakeholders and work with them to identify challenges and potential solutions. Since our last report, we have worked with DDR to offer free validation for parking at the park with the opening of the outlets.'",
        "'speaker_10': 'We have closely monitored and solicited feedback about the first five free program for the on street meters. And as we saw, public works rapidly responded to the decision to have a meter holiday. In the wake of the power outages by efficiently changing the meters after authorization from city manager West will remotely change the parking meters so the'",
        "'speaker_10': 'residents and visitors could support our downtown businesses. We will continue these efforts to ensure a partnership with our community. Last, but certainly not least. We answered the mayor and City Council's call for innovation by thinking strategically about how to use technology to further improve the parking experience.'",
        "'speaker_10': 'We're working to further centralize parking information already consolidated at w w w that long beach topgolf slash parking. We're looking into technology that would provide real time street parking meter and parking structure, occupancy data and to motorist more mobile apps.'",
        "'speaker_10': 'And with this new data, we're examining data strategies and analyzing of real time data. The current example of how our embrace technologies are smart parking meters that were installed in April. Since then, we have collected valuable data. And I would like to share with you some some briefly tonight.'",
        "'speaker_10': 'Credit card usage has grown by eight percentage points since the meters were installed citywide. That translates to 34% of users are paying by credit card. The park in particular has seen remarkable success, with over 50% of users paying by credit card.'",
        "'speaker_10': 'And our business friendly approach with the first three five program is popular as well. In July alone, we have over 41,001st five free initiations. This translates to over 250,000 free minutes. Over 3403 hours. Or over 142 days of free parking.'",
        "'speaker_10': 'While we have made significant progress within a short time frame to implement important changes to better improve the facilities, it is our philosophy to proactively identify next steps to further improve the experience. I would like to share with you the next steps we're taking to further fulfill our commitment to our parking principles.'",
        "'speaker_10': 'We're continuing our continuing work on the parking guidance system and wayfinding. We're awaiting the decision of another metro grant that could fund additional projects. We have obtained coats for painting and Spaulding, which is the process of repairing daily wear and tear on the parking structures.'",
        "'speaker_10': 'We seek to standardize parking signage. We will prepare to review data with stakeholders as we reach our six month anniversary. And we will continue to proactively work with our community collaborators to identify projects for other improvements funded by the parking meter revenue collected above baseline projections.'",
        "'speaker_10': 'Thank you for this opportunity to present. I'm happy to answer any questions you have.'",
        "'speaker_1': 'Thank you. Councilwoman, another vice mayor?'",
        "'speaker_0': 'Yes. If there's public comment, I'll take that first before we get into. Okay.'",
        "'speaker_1': 'Is there any public comment on the item saying no public comment. Councilman Gonzales.'",
        "'speaker_0': 'Okay. So I have a I want to thank you, Ari, for putting this together. As you know, as many of us know, downtown parking is like the hot topic item in downtown for both the first and the second district.'",
        "'speaker_0': 'And, you know, putting this together was I'm I'm certain, very difficult on your part because it was a lot of there are a lot of nuances. And so I just thank you for putting this report together. But I still do know that we have a long way to go, especially as our downtown is thriving.'",
        "'speaker_0': 'It's getting better. The development around it is is certainly looking better esthetically. But also there's just more interest in the downtown. I see that there's a lot of potential that we have. So I have a few questions related to your presentation.'",
        "'speaker_0': 'So you had mentioned I have seen some enhancements to security and maintenance, but I still don't think it's enough at this point. So I would like to ask you, what more will be done for security and maintenance? You said, you know, enhanced security patrols and rigorous maintenance schedule.'",
        "'speaker_0': 'And then related to that. I know there's been some issues in some of our city play slots specifically. And I know the calls for service were pretty high. So how much is the in addition to that, how much is the maintenance and security costing us?'",
        "'speaker_10': 'Thank you for that question. It's kind of a complex question, but I will try to answer that as coherently as possible. So Central Parking has a contract with the city to provide the maintenance and the security. They, in turn are in contract with Platts security to provide security for these parking structures.'",
        "'speaker_10': 'From my understanding, they are paying 30,000 a month to Platts security to provide security in all our parking structures. And that translates to 312 hours on a weekly basis. So what the city has done in addition to that, we have increased or work asked Platts security to increase about 264 hours per week of additional parking security in'",
        "'speaker_10': 'those facilities. So we have total of 576 hours of weekly security that's provided. So we've kind of doubled the security that existed in addition to what was in their contract. So that was the basis of the original contract.'",
        "'speaker_10': 'Now we have practically doubled as far as the security is concerned, similar questions in regards to maintenance. The existing contract, which will expire next March, has provisions for maintenance. The city is also adding maintenance to these parking structures since we have reorganized our parking operations as of the beginning of this year.'",
        "'speaker_10': 'So you have kind of added our personnel working and doing maintenance issues in the parking structures. So we we sometimes will reimburse central parking for the maintenance cost or we will do it ourselves. But we I can say that practically we have doubled the amount of maintenance that's going on in those parking structures.'",
        "'speaker_10': 'And I have to say that I've personally walked the parking structure and I'm aware of every single issue. I spent close to 3 hours with our business partners and our staff looking at what opportunities we can have to increase.'",
        "'speaker_10': 'And that's that's where the list of improvements came from. We are adding or we added more lights, we're adding more signage that there are security cameras. We fixed the elevators that were not functioning properly all the time. We have done power washing.'",
        "'speaker_10': 'We have re stripe the parking structures as far as refreshing the stripes so that the users can see the existing spaces. And we have much more potential enhancements to the parking structure that that will give a better experience to to our customers.'",
        "'speaker_0': 'So when do we think that all of the main you know, all of the issues that are still existing, when will those be completed?'",
        "'speaker_10': 'So part of, as you can understand, the parking structures are 2 hours free, so they're practically not making any money for every transaction. There's a $0.14 that the city gets on every ticket that's sold. So that's part of the challenge.'",
        "'speaker_10': 'Fortunately, we have a business partner that has purchased a tremendous amount of parking spaces and one of the parking structures, and that's really giving us a good source of income to to to enhance the, the the security issues and also the the maintenance issues.'",
        "'speaker_10': 'Part of our parking meter installation was that with collaborations with the LBA, we have a baseline. So any time finances or the income exceeds that baseline, we're going to use those funds to improve our parking structures. So we're still in for two years.'",
        "'speaker_10': 'We are basically at, you know, in four months or 15 months of our parking meter installation. So we have not seen that revenue yet. But when we see that revenue, we will definitely use those monies for two years to enhance our parking structures.'",
        "'speaker_0': 'When we're going to see that fact. Was that after six months or how how long was that time frame to realize the revenue coming back from the smart meters?'",
        "'speaker_10': 'I think in six months as part of the installation, if you recall, it was recommended by city council and staff agrees that we're going to come back to city council and give you a report on the status of the parking meters and how it compare to our previous baseline.'",
        "'speaker_10': 'So we have data from previous years. What was the income at that point per month? And then when we complete that six months of installation, we will come back to City Council. I think that's a good point to discuss.'",
        "'speaker_10': 'If the revenues are up or not, I would say in October would be a good, good opportunity.'",
        "'speaker_0': 'For us to come back. So we'd get a report basically next month and see about how much above we're above our baseline and how much could be allocated potentially to the downtown.'",
        "'speaker_10': 'In October.'",
        "'speaker_0': 'In October. Next month. Right. Well, I'm sorry. September. I think we're in September.'",
        "'speaker_10': 'I wish I wish we had passed the budget.'",
        "'speaker_0': 'So I know.'",
        "'speaker_10': 'It would be in October, but I will definitely in October.'",
        "'speaker_0': 'Welcome back, because that's kind of my next point. So I know that in relation to receiving more funds or more revenue from the parking, you know, for instance, we didn't get an online payment system for the parking structures at City Place until, I think earlier this year.'",
        "'speaker_0': 'So I think we need to rework our marketing and we really need to remain committed to that. I think it's very important that we have residents, you know, I use well, I live across the street, so we were able to pay for parking, but we had to go in this dingy hallway and it was just such a'",
        "'speaker_0': 'nightmare. So people don't want to do that. They want to be able to have something at their fingertips, pay online. I think that would be more beneficial, of course, to the city in receiving revenue that way. But as far as marketing as a whole, I would really like to look at receiving information back from you in October'",
        "'speaker_0': 'about the smart meter revenue and seeing how that could be. How that could work for our marketing. And aside from that, were we looking at any other funds to be able to use for marketing for this or what was the thought?'",
        "'speaker_10': 'Honorable Gonzales. Let me go back to the first issue that you raised. Currently, customers can go online and purchase their their parking passes, they can go to WW dot, SPL, USA dot com, or they can go to Long Beach dot parking guide dot com.'",
        "'speaker_10': 'So we have two sources that customers, visitors, residents and businesses can purchase parking online so they don't have to physically go into a space. If some residents want to go to if they want to pay cash, they need to go physically to the office at 275 East Fourth Street.'",
        "'speaker_10': 'That's where a central parking office is located. They can do that. After they do that, the first time they can renew online, they can also choose to have to pay continually, automatically. Or they can go to month to month.'",
        "'speaker_10': 'So. So there are definitely options and we will try to communicate that information since we have a new website. We could probably put that on the website to show that information that which is available to us.'",
        "'speaker_0': 'It would be good to have a one stop shop, you know, so it's not you have to go to HPD, you got to go to Long Beach parking slap, hash tag or slash parking. It's just a one stop area.'",
        "'speaker_0': 'So maybe I'm not clear where we're going to pay for. How are we going to pay for marketing? As far as you know, I mentioned a smart app in the original agenda item in a wayfinding signs are in the in the work so how is that all going to come together and be paid for by the city'",
        "'speaker_10': '? Well, the wayfinding is a completely separate project that we have. We were successful in getting a $1.2 million grant from the MTA that will help us with the wayfinding and also identification. How to get to the parking spaces, which is which is a large project as far as marketing we can come back to in October and come'",
        "'speaker_10': 'up with a program. I'm hoping that we'll do that next month before we get to to October. We'll probably accomplish that via communication with our business partners and the LBA and homeowners associations that are our community partners. We can provide that information via a flier or we can tweet or a bunch of technologies that's available right now'",
        "'speaker_10': '. We can do that.'",
        "'speaker_5': 'And Councilmember, if I may, just to add.'",
        "'speaker_2': 'We're really looking at three different.'",
        "'speaker_4': 'Areas where you can invest here. One of them would be the grants that we talked about. MTA has specific grants that can help with some of the signage and the message count or the the automatic counting. So that's.'",
        "'speaker_2': 'One. We also do have a stream of revenue.'",
        "'speaker_4': 'Coming in that we can and we have a budget for some maintenance. And so that's that's an ongoing program and we'll continue to have that. And then really, we wanted.'",
        "'speaker_2': 'To have the money coming.'",
        "'speaker_12': 'Back from the parking meters.'",
        "'speaker_2': 'That was a commitment to reinvest that into the downtown area for two years is, as Mr. Bohan said, that's a couple of hundred thousand dollars.'",
        "'speaker_5': 'And so that'll really.'",
        "'speaker_2': 'Be for the extra services, the parking app.'",
        "'speaker_4': 'The excuse me, the parking app.'",
        "'speaker_2': 'The we could do painting all of that additional maintenance marketing program.'",
        "'speaker_4': 'That really was envisioned for that, a dedicated funding source.'",
        "'speaker_0': 'Well, I was hoping to find that in this presentation. So is so I guess now we can go back to, I guess, directing you in October to come back with that information, like detailed information on how we can formulate the smartphone app, if possible, maybe a one stop website, more emphasis on on on all of those components'",
        "'speaker_0': 'that Tom had mentioned. And then last question is for the parking manager. What will be the role of the parking manager? If it is approved.'",
        "'speaker_10': 'If you're kind enough to approve that position, that person will be dedicated to managing all the parking facilities within the city and also all the parking lot. So it's it's all the parking in the city will be under that the purview of that parking manager.'",
        "'speaker_0': 'Okay, but what would I mean?'",
        "'speaker_10': 'And then that person will be managing, doing our piece for the for the maintenance or for the new. If we did, they will they will manage the contracts. They'll be focused on marketing and focused on bringing new technologies.'",
        "'speaker_0': 'Okay. And so from now until October, can we make a good effort in ensuring that central parking is stepping up their maintenance and security? I really I can't stress that enough. Currently, as it stands, we still have complaints of.'",
        "'speaker_0': 'Shopping carts. We still have complaints of trash. We have complaints all over the place. And I just don't think that there's enough being done. So from now until October, I would love to see a commitment on our part to meeting frequently with our with our stakeholders and then also ensuring that we're I don't know if someone has'",
        "'speaker_0': 'to be there every single day until the issue gets better, but we really need to remain focused on this. There's a lot of folks in the area that have invested both businesses and both residents, and I just think we need to make that commitment to our stakeholders here and our residents and business owners.'",
        "'speaker_10': 'Well, do.'",
        "'speaker_1': 'Bison really want for?'",
        "'speaker_11': 'Thank you, Mr. Mayor. I'm. Did we have any public comment on this? We did.'",
        "'speaker_0': 'No, didn't.'",
        "'speaker_11': 'They didn't speak. I concur with Councilmember Gonzalez's. Issues that she raised. I don't I'm not going to reiterate them. I think staff's done a great job in getting us this far with this study update. And I'm pleased with the report and progress on downtown lots such as City Place.'",
        "'speaker_11': 'I know Councilwoman Gonzales spoke to it very much. These are the complaints that she had expressed are really coming from our property owners, residents and visitors, especially when you have our parking assets adjacent to condominiums and apartments. So that impact does transfer over to our residents.'",
        "'speaker_11': 'So the increase of security by doubling the hours, I believe you said, is something that's that's critical. Mr. Malloy, if I can ask you, I know you said a few sentences or expressions regarding the parking position. What's the title of that position?'",
        "'speaker_11': 'Please remind me.'",
        "'speaker_10': 'It's in the proposed budget as a parking manager.'",
        "'speaker_11': 'Is that the same position that Mr. Maldonado held until two years ago?'",
        "'speaker_10': 'I believe so.'",
        "'speaker_11': 'Okay. So I know that my office and certainly Councilman Gonzales, his office has spoken to you and your staff, I hope, regarding some of the challenges that we had when Mr. Maldonado was here. And that probably could have been the mayor's office at the time.'",
        "'speaker_11': 'It was the mayor and I Mr. Maldonado, did a fabulous job. But I think we were not prepared to establish the type of authority for parking and parking management that we seem to be today. And you were not here.'",
        "'speaker_11': 'So I'm not directing any of this as responsibility for you. But we had an immensely talented individual with the best of intentions and the greatest of skill to manage our surface lots and as well as our other parking assets.'",
        "'speaker_11': 'And we were, as I said, ready for that. I'm comforted in knowing that through this study and through your work, that I think we're in a different place as a city. And if I can hear from you that you feel confident that we are bringing someone else in to ostensibly be a parking authority for us of sorts'",
        "'speaker_11': ', not only to be able to manage parking and do it demand based and probably get us into a place where we can think of managing demand through price, all things that we think can be done with parking, aside from ensuring that the facilities are safe.'",
        "'speaker_11': 'Do you feel confident that we can do that, that we're in that place here in the city today?'",
        "'speaker_10': 'I would definitely would like to have that discussion. And maybe since we don't have the position and we haven't finalized the job description, that could be the qualities that we could ask for the next parking manager to have.'",
        "'speaker_10': 'As I said, this this person will be dedicated to providing that and depending on the policies that the city council directors will will implement those. So the answer yes, and I wish that we could have more specific job descriptions that or skills that you require from this individual we can seek in our recruitment if the position was'",
        "'speaker_10': 'approved.'",
        "'speaker_11': 'So if the position gets approved through our budget process, I think we can certainly help you with the attributes for the candidate. I think I was more speaking about our own attributes in terms of supporting that position, and Mr. West is aware the city manager, West is aware that it's one thing to have great talent on hand'",
        "'speaker_11': ', but if we don't support or empower that that particular position, it accomplishes very little. And so that's really what I was getting to. Not so much of the candidate's qualifications. I'm I'm pretty certain you are immensely qualified to determine what those qualifications are.'",
        "'speaker_11': 'I'm talking about our own qualifications. And maybe I should have asked the same question of Mr. West since he has that history. So I think I've made myself clear. I think possibly. So with that, Mr. Mayor, I do want to express my optimism about this report and the progress on downtown lots and staff is to be commended'",
        "'speaker_11': '. Absolutely commended. I couldn't. Now, I do have to say I couldn't help but notice the mention of the community parking program on page five of the report. I would have to. I would be remiss if I wasn't a little cheeky about this.'",
        "'speaker_11': 'So I do question the characterization of the online program being new, since, if you recall the second district's involvement we originally created and offered it in 2007. But I'll say that I am pleased nonetheless to see its inclusion in the report as phase two of the implementation.'",
        "'speaker_11': 'Maybe that was your passive way of allowing me authorship of Phase one, but I'll thank Councilmember Gonzalez and Mayor Garcia for their work on this. And as they know, the use of an online parking program was and remains an important resource for residents inside and outside downtown to fight find overnight parking in our parking impacted area.'",
        "'speaker_11': 'It's also important for property owners. During the first iteration, which my staff and I worked on, the community parking program created in consultation with I Park. It enabled property owners to manage the administrative portion of overnight parking online, which was a great tool for them, and leverage for our efforts to convince more businesses and churches to participate'",
        "'speaker_11': 'in the program. And for those of us who were here during that time, that required a lot of door to door walking and footwork and and really physical exertion to to get those arrangements in place. I'm wondering if that component would still be offered the business component.'",
        "'speaker_10': 'Yes, ma'am. Unfortunately, I Park decided not to be a partner with the city. That's why that darn application went away. We're in process or central parking is in process of creating a very similar application, and that would be in our total package.'",
        "'speaker_10': 'As we discussed, we're kind of expanding this. The first application would be for on street parking. So when we have completed that, it will get into the parking structures that the city owns and operates. And thirdly, we can expand that to all possible parking and parking lots.'",
        "'speaker_10': 'And I have to acknowledge that this was before my time and also acknowledge that that something that I learned my with my briefings with Mr. Brock Calvert that this was your program. So I appreciate that. And your your thought process behind that.'",
        "'speaker_10': 'Unfortunately I decided not to participate with would continue that business with the city and it was a proprietary program that they used. They used.'",
        "'speaker_11': 'You're right, I. It was too bad that they left. Thank you. I don't know that you'll find too many people that are enamored with parking and managing parking as our offices. So, finally, timeline for completion of phase two.'",
        "'speaker_11': 'Do we know?'",
        "'speaker_10': 'We're waiting to complete the RFP for for that component. I think we should get the results back by the end of this month. The on call for that consultant and then. Yeah. And we can get back to you on that.'",
        "'speaker_10': 'As far as when that RFP is approved and contract is awarded.'",
        "'speaker_11': 'Okay. Thank you. I am looking forward to it. Thank you, Mr. Mayor.'",
        "'speaker_1': 'Councilman Gonzales.'",
        "'speaker_0': 'One more thing I failed to mention. I know we talked about this aura was the parking around the courthouse. And so I know the courthouse is a major impact for residents and businesses there. So in studying that, perhaps that could be something that would come back as well in October, just a preliminary study of the area and'",
        "'speaker_0': 'what the impacts are. And I know we've talked about parking meters in that area that might make more sense. So, yes, we'd love you to do that. Thank you.'",
        "'speaker_10': 'Absolutely. As we discussed, we had reviewed the parking, the residential impacts from the courthouse parking. We have discussed about the possibility of having a preferential parking district. That's going to be difficult to justify. But we will discuss or try to come out with any out of the box thinking and try to come up with some solutions for'",
        "'speaker_10': 'that residential district, for sure. So my staff and I will be discussing this in our next meeting, and it's on my radar for sure.'",
        "'speaker_0': 'Thank you. I appreciate.'",
        "'speaker_10': 'That.'",
        "'speaker_1': 'Thank you. I'm going to just make a couple a couple comments and then we'll go to the vote first. Mr. Miller, could you say also make sure in the future that we're at least thinking about how we're going to manage or work with the private lots?'",
        "'speaker_1': 'I know that there's a different relationship, obviously, but if you go to the private parking lots throughout downtown, there is there are some inconsistencies or upgrades that need to be also completed. And I think I don't know if sure were encouraging that some of the private lines but that could be could be helpful as part is part'",
        "'speaker_1': 'of the future phases and many private lots that are not that don't have a relationship with the city. So for example, one of the lots that's right off of Pine Avenue adjacent to the promenade is one of those lots where I think that there could be some they still have, but they just installed the the coin, the'",
        "'speaker_1': 'credit card machine, for example. They still have the old, you know, stick a dollar in machine right next to it and some of the old machinery that needs to be removed or updated. And so just some thought about some of the future lights would be would be great.'",
        "'speaker_1': 'And I just want to just add to what the vice mayor and the councilwoman said. I think the the truth is, is that the reason why we're not able to do all this stuff, because the lots aren't paying for themselves.'",
        "'speaker_1': 'And so I think we're at a point where we have to and I don't know that you didn't say that, but the truth is that we haven't budgeted these lots to where we would like to see them be.'",
        "'speaker_1': 'And I think that's just the fact. And it should be should we be receiving better service from the the vendor and that's operating? Absolutely. Are the lots a mess? Absolutely. They're twice or three times as bad at night.'",
        "'speaker_1': 'I mean, there there's trash everywhere. There's shopping carts all over the place. It's not something that we should be proud of as far as a service as being city lots. So I'm certainly not satisfied with the service. But we also, I think, should recognize that long term we have to think about what the investment that needs to'",
        "'speaker_1': 'be made to actually get those lots to where we want them. I think we've been trying to operate on a system of we we invest what we're getting in return for the actual lots and we try to balance out that we only spend what we are actually making.'",
        "'speaker_1': 'The truth is that what we're actually making is not enough at this point to actually fix the lots to where they're actually appropriately funded. So we have to have that conversation, I think, broader in the future. So I appreciate that.'",
        "'speaker_1': 'And with that, we'll go and go to go to a vote.'",
        "'speaker_3': 'Motion carries six zero.'",
        "'speaker_1': 'Okay, go ahead. Let's start the budget presentation.'",
        "'speaker_3': 'Item number one. Report from City Manager Financial Management Recommendation to conduct a budget hearing to receive and discuss an overview of the proposed fiscal year 2016 budget.'",
        "'speaker_1': 'Actually, you know, Madam Clerk. There's only, I think, four public public comments for the speakers lesson. It's getting late and I want to make sure we do them before it's too much too late. So why don't I just do this real quickly and then we'll go to the budget presentation.'",
        "'speaker_1': 'So I have please come forward. Elizabeth Andrew. Mary Rau. A rate goblets. Please come forward. Please go ahead.'",
        "'speaker_0': 'Hi there. Good evening there. Council. I'm Elizabeth Andrew. My address is on file. I reside in Long Beach on seventh July 7th, six of you voted to study an international expansion at Long Beach Airport, a calculated response to JetBlue's quest.'",
        "'speaker_0': 'Nothing about the study is being released to the public regarding who, when, the cost and how the study is being designed. Research is a guided activity and it is easy to omit facts, insert half truths and skew results.'",
        "'speaker_0': 'Denying community input and access to the study is extremely alarming. We suspect JetBlue and the fourth, which is the fourth largest airline, is the authoritative voice behind the scenes. They are the driving force for expansion. JetBlue secretly has worked with the city since 2013 on this project, when collusion between JetBlue and city staff was leaked.'",
        "'speaker_0': 'The precise words from city staff and I quote, I guess the cat's out of the bag. End quote. This statement is a hallmark of corruption. Now the city is having a study that's secret councils, providing no mechanism to ensure the study is fair and guided with the best interests of the public.'",
        "'speaker_0': 'Railroading the public with a study like this. Hmm. Interesting. At the February 2015 study session, both the city attorney and the city prosecutor's office explained the costly legal ordeal that we fought to have the airport protective noise ordinance today.'",
        "'speaker_0': 'Our municipality insures a rare asset that maintains a quality of life in neighborhoods and schools across Long Beach because of the U.S. Congress. Virtually no other municipality in the U.S. has this remarkably unique airport noise ordinance protection for our neighborhoods in schools.'",
        "'speaker_0': 'The grave risk is losing it by changing Long Beach Municipal Airport to Long Beach International. No one's talking about this. That in addition to JetBlue's international flights, this is opening the entire city to unlimited international charter, unlimited international, private and cargo jets.'",
        "'speaker_0': 'That thwarts the very point of protecting neighborhoods and schools will not be just a few friendly flights. And JetBlue going on vacation destinations. We're talking 747 Airbus large aircraft flying over us. I read in a Long Beach newspaper, quote, International flights and the noise ordinance are separate issues, end quote.'",
        "'speaker_0': 'Wrong. Intentionally misleading and irrelevant. Statements like that one horrified the community emissions of the irrevocable negative consequences of unlimited international charter, unlimited international, private and cargo jets can catastrophically destroy your neighborhoods, your constituents neighborhoods and their children's classrooms.'",
        "'speaker_0': 'For the public record, the City of Long Beach must have meaningful dialog. Staffs already kept a secret from the community for two years. You must give a voice to the neighborhoods on this study.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Hello again. First of all, I want to thank you guys for passing a version. It's very good news. I gave everybody a copy of some of the comments I want to make. But basically, my ass before I start speaking is I just want to know what a community nonprofit needs to do to speak to the mayor about'",
        "'speaker_0': 'something very important. I don't understand why it takes a year and a half. I don't understand why I have to be here to ask is not getting it.'",
        "'speaker_5': 'So.'",
        "'speaker_1': 'Ma'am, I know that you've had a chance to meet with members of my staff, as well as multiple conversations with my staff. And so we try the best that we can with the schedule. But if you want to continue with the comments, go ahead.'",
        "'speaker_0': 'Okay. Well, I haven't actually met with anybody from your staff.'",
        "'speaker_1': 'So that's how you met with Sharon Weisman, who's in the room?'",
        "'speaker_0': 'I've never met with Sharon.'",
        "'speaker_1': 'Okay, go ahead.'",
        "'speaker_0': 'Um, so QMI formed in 2012 and we met with then Councilmember Lowenthal, his office eight times over the course of a year. Um based Vice Mayor Lowenthal attended one of those meetings. During our last meeting, two of the staff members basically told QMI that because of direction they've gotten from the city attorney's office that they could no'",
        "'speaker_0': 'longer support us as possible ambassadors for the ship and that we needed to continue our conversation with the ship leaseholder, which we've diligently tried to do for a year and a half. What we're being told now is that all of our preservation objectives have to be put on hold due to the new direction that you're taking with'",
        "'speaker_0': 'the Queen Mary task force. We're trying to understand how they're linked, because it's my understanding that the new task force is going to be focused on the surrounding land and not necessarily the ship. And as a nonprofit, we don't understand why all of our efforts to help are being ignored.'",
        "'speaker_0': 'So that's my question that I'd love to hear any comment or suggestion from any of the council members or the mayor.'",
        "'speaker_1': 'Thank you. You're done?'",
        "'speaker_0': 'I guess so.'",
        "'speaker_1': 'Okay. So, ma'am, after the meeting, we'll be in touch that I think you're referring to the Queen Mary task force, which has nothing to do with whatever's happening currently on the ship. So I can't speak for for garrison or evolution, but they're the ones that are managing what's actually happening on the ship as far as a historic'",
        "'speaker_1': 'preservation piece that I think you're referring to. I think that, you know, John Thomas, who is the historic preservation officer on the ship, is the one that manages that portion. The city refers to historic preservation when it comes to the ship through John Thomas.'",
        "'speaker_1': 'And so I know that some of that we refer, or at least my office referred you to, to speak to. And so that is kind of what who is managing the historic preservation piece as far as the ship and as far as what they're what they do and Garrison does.'",
        "'speaker_1': 'That's I mean, that is that's what they're doing.'",
        "'speaker_0': 'So my question to you that.'",
        "'speaker_1': 'Well, we can so that public comments are probably happy to talk to you offline. Okay, we'll talk. Well, it's a.'",
        "'speaker_0': 'Promise.'",
        "'speaker_1': 'That we will talk to you offline. Thank you very much.'",
        "'speaker_0': 'Ray Gavlak, eighth District resident. On July 7th, six council.'",
        "'speaker_13': 'Members voted to proceed with an RFP to further study.'",
        "'speaker_0': 'Items.'",
        "'speaker_13': 'Related to for approving a customs facility at Long Beach Airport.'",
        "'speaker_0': 'Austin, Urunga and Superdome. Voted against opening this Pandora's box, since it has the ability to compromise some of the most successful.'",
        "'speaker_13': 'Neighborhoods within our city.'",
        "'speaker_0': 'Your RFP requests include planning and design for a customs facility. Isn't that premature since the decision has not yet been made, at least publicly, to support this enhanced service to our municipal airport? Will project plans not add to the costs associated with this study and move closer to clearing this project for takeoff?'",
        "'speaker_0': 'Councilwoman Mango, you initiated the desire to gather the.'",
        "'speaker_13': 'Facts, yet there is yet to be a public discussion.'",
        "'speaker_0': 'On the studies that were already completed. In addition to the process, a study of November 2013 that is still viable today. That was a there was a January 2014 request made to Cal State Professor Joe Maga Dino to do an economic impact study.'",
        "'speaker_0': 'The cost of this study was $12,300 on January 29th. Professor Maga Dino stated the following. The main question appears to be the impact of new visitors on the Long Beach economy. We deliberately left it out of the proposal since we believe the impact.'",
        "'speaker_13': 'Of visitor expenditures on the.'",
        "'speaker_0': 'Long Beach economy will be small. He attached the following reasoning that most of the anticipated 15,000 travelers will be leisure travelers, a large number of them will be U.S. citizens and live within the region having little impact on expenditures beyond those.'",
        "'speaker_13': 'Within the airport facilities. Foreign travelers are likely to use the airport as.'",
        "'speaker_0': 'Entry into Southern California rather than visiting Long Beach per say. Since foreign passengers are leisure travelers, their destination is not a convention hosted in Long Beach. And as for flight crews, the numbers were not included since the proposal.'",
        "'speaker_13': 'Is to add foreign flights and to reduce domestic.'",
        "'speaker_0': 'Flights. Since this economic study was never finalized, I will assume direction was given to not complete it, given that the opinion of the independent expert did not produce the desired outcome. We will continue to use this platform to further educate Long Beach residents and ask them to visit LP Neighborhoods First AECOM to join the movement to put'",
        "'speaker_0': 'our residents ahead of corporations. Council members.'",
        "'speaker_13': 'Your industry expert will give.'",
        "'speaker_0': 'You what you ask for your two community meetings. Allowing residents a brief three minute comment is not sufficient to gather the concerns from thousands of citizens.'",
        "'speaker_13': 'Please do your due diligence on materials available today.'",
        "'speaker_0': 'Host your own district meetings or attend a meeting held in airport impacted communities. Identify the unattended consequences that could be related to this venture and then vote with your elected elected conscience to receive and file when this returns for your votes.'",
        "'speaker_1': 'Thank you. Gabriela Hernandez, please. It's Gabriela Hernandez here. Okay. Jerry Thomas, is Jerry Thomas here? Please, sir.'",
        "'speaker_5': 'I just want to make a quick.'",
        "'speaker_4': 'Comment that I think it's a great idea that.'",
        "'speaker_2': 'Now we step forward.'",
        "'speaker_7': 'And.'",
        "'speaker_6': 'Make a statement.'",
        "'speaker_2': 'To the world.'",
        "'speaker_6': 'I raise.'",
        "'speaker_5': 'Minimum wage for nine months.'",
        "'speaker_1': '$9 an hour to $15 an hour.'",
        "'speaker_2': 'Make sure you are at.'",
        "'speaker_4': '3% payroll tax.'",
        "'speaker_10': 'Bearing.'",
        "'speaker_6': 'Tax.'",
        "'speaker_2': 'So you got a nice.'",
        "'speaker_5': 'Tax base on that. And and that that.'",
        "'speaker_2': 'It's our chain reaction.'",
        "'speaker_6': 'Is election.'",
        "'speaker_5': 'Year.'",
        "'speaker_7': 'It might make a big difference that you're in make.'",
        "'speaker_1': 'Thank you, sir. That because the public comment. Mr. West start with the budget presentation.'"
    ],
    "Recommendation to conduct a Budget Hearing to receive and discuss an Overview of the Proposed Fiscal Year 2016 Budget for the following: Harbor Department; Water Department.": [
        "'speaker_2': 'We will be doing our budget presentation and first we will be hearing from our police chief and his team. Then we will be going to the fire.'",
        "'speaker_12': 'Department and then we will be hearing from.'",
        "'speaker_2': 'Disaster preparedness and emergency communications. And with that, I'll turn it over to chief unit. Good evening, our mayor Garcia and members of the city council. As you know, our public safety efforts in Long Beach are a true partnership.'",
        "'speaker_2': 'So I would like to start with some acknowledgments. First of all, I want to recognize the men and women of the Long Beach Police Department who work every day under very difficult or work very hard every day under very difficult circumstances to keep our community safe.'",
        "'speaker_2': 'I would also like to thank our city departments and the community for their partnership in making this city a safe place for all people. Finally, thanks goes to the city manager and the City Council. Your ongoing support is very much appreciated.'",
        "'speaker_2': 'You are familiar with our core services. These services are guided by our recently developed strategic vision, which closely aligns with the Law Enforcement Code of Ethics and Sir Robert Pils nine Principles of Policing. Our goal is to make Long Beach a safe place for all people.'",
        "'speaker_2': 'And our mission is simple, yet effective public safety through partnerships. Our core services include safeguarding lives and property in our community, providing law enforcement services in a constitutional manner, responding to calls for service, thoroughly investigating crimes, and proactively seeking to build partnerships with our community.'",
        "'speaker_2': 'This slide addresses some key accomplishments. In FY 14, officers were dispatched to nearly 170,000 calls for service on an average day. This translates to officers responding to 487 calls for service. They proactively initiated contact with our community over 1100 times and made approximately 63 arrests again.'",
        "'speaker_2': 'This represents activity on an average day. In addition, our daily workload includes COPS projects, which are special projects for long term problem solving, handling special events and high profile incidents incidences. And we also address many council requests for services.'",
        "'speaker_2': 'Many of you well know when you dial 911 in an emergency situation, officers are arriving on scene on average within 4.8 minutes. That is an incredible accomplishment. We also continue to place a strategic focus on gang suppression efforts through various investigative methods, including working with our city prosecutor, Doug Halbert.'",
        "'speaker_2': 'To conduct citywide enforcement on gang court orders that encompass several gangs. Partnerships with other agencies to address gang crimes. Gang detectives and a probation officer assigned to the gang enforcement section to help augment the work of our officers in the field and to highlight some of our enforcement.'",
        "'speaker_2': '90% of our human trafficking arrests. Led by our vice section, are gang members and an estimated 50% of compliance checks for subjects released pursuant to AB 109 involve gang members. In the past two fiscal years, the use of discretionary overtime and non-recurring funds approved by the City Council have helped us to focus or help us to focus'",
        "'speaker_2': 'our efforts on certain crime trends. You may remember in 2014, we received nonrecurring funds to combat human trafficking and conduct prohibitive possessor enforcement. Both operations proved extremely successful in FY 15. So far, we have been successful in reducing residential burglary by 19 4%, which equates to 218 crimes citywide.'",
        "'speaker_2': 'When it comes to our approach in addressing crime today, we devote our resources in a data driven, focused manner, as opposed to using more traditional police sweeps, which has a common which was a common enforcement tactic used in the past.'",
        "'speaker_2': 'In our efforts to increase the level of community engagement, we will continue to seek expanded partnerships with our community. This will enhance communications and information sharing. Some of our key partnerships include the Ministers Alliance and the organization. Why'd you stop me?'",
        "'speaker_2': 'We also work closely with other city departments, community based organizations and our community on the public safety continuum. The safe Long Beach violence prevention plan and to provide safe passage to our students. We are also looking forward to working with the city's new innovation team.'",
        "'speaker_2': 'We are grateful for our continuing academy classes because they are allowing us to replenish police officer positions as a result of attrition. Academy class number 87 graduated 24 recruits in December of 2014. Class 88 started in May of 2015 with 45 recruits and will graduate in November of this year.'",
        "'speaker_2': 'Testing for Class 89 is currently underway with an expected start date in May of 2016. Lastly, we also want to highlight that over the past 15 years we have improved most substations in the city and are close to completion of our substation.'",
        "'speaker_2': 'We anticipate moving in in early 2016. As you see, most of the police department budget comes from the general fund. In FY 16, there are no changes in our sworn full time equivalents. However, we are transferring civilian employees to another department, which I will explain later in my presentation.'",
        "'speaker_2': 'Grant funding is an important resource for our department in FY 14. The police department was awarded 15 grants totaling $4.8 million in FY 15. The police department continues to receive both allocation and competitive grants. There are some key changes in the FY16 budget.'",
        "'speaker_2': 'One of the most significant changes is the creation of the Community Engagement Division, which will increase our ability to build stronger relationships with our community. This is very important or this is a very important part of our ongoing effort to build public trust.'",
        "'speaker_2': 'This division will continue to explore community partnership opportunities, social media communications, manage our youth explorer program and volunteers, as well as develop a more robust internship program. Through $150,000 in nonrecurring funds. The department will continue to train officers in the areas highlighted in the president's 21st Century Task Force report.'",
        "'speaker_2': 'These topics include mental health issues and homelessness. Verbal de-escalation. Fair and impartial. Constitutional policing. Cultural diversity. And alternatives to arrest. In this proposal, the department has been allocated $2.2 million to fund overtime for prevention, enforcement and investigation of violent crime, as well as to address other emerging crime trends.'",
        "'speaker_2': 'The Academy lieutenant position will focus on new training initiatives, developing the lateral process and recruiting. We will continue to partner with civil service to identify law enforcement recruiting opportunities in an effort to hire people who best reflect the diversity of our community and who will uphold the high standards of our police department.'",
        "'speaker_2': 'Another change is the upgraded criminalist positions, which will provide a higher level of sophistication for investigative assistants and managing evidence collection. Because we have a large general fund budget and many grants to manage the financial bureau will be enhanced.'",
        "'speaker_2': 'By the addition of an accounting technician, financial services officer and an administrative intern. Lastly, as I alluded to earlier, 65 public safety dispatcher positions will be transferred to the Department of Disaster Preparedness and Emergency Communications. The demands, expectations and the level of accountability placed on our officers have never been higher.'",
        "'speaker_2': 'Today, our officers are more carefully chosen, more diverse, better educated and carefully trained, and more technologically and tactically sound. In these next two slides outlining significant issues and opportunities, you will see a common theme in our efforts to build trust, increase capabilities, and have a more strategic focus.'",
        "'speaker_2': 'Part of that strategic focus includes our communications plan, which will involve assistance from communication professionals to better shape information about the police department with our community today. There are many emerging technologies for use in law enforcement. We have been working on several new and innovative technologies such as online reporting, a new personnel scheduling system.'",
        "'speaker_2': 'Our mobile AI camera platform. And we are exploring E-Ticketing, which will reduce time spent on data entry of citations. In addition, our department is in the selection process of a vendor for our body camera pilot program. The pilot program will provide the department with a better understanding of resources needed to operate this initiative.'",
        "'speaker_2': 'We need to point out that this program may require additional resources as the pilot progresses and as we prepare for full implementation. It is important that we employ a data driven approach to our enforcement strategies to maximize our limited resources.'",
        "'speaker_2': 'As part of the mayor's proposal, non-recurring funds may be added in the FY16 budget for a new gang analyst to augment violent crime strategies. We are all concerned about the violent crime increases we have seen this year, and we will continue to make focused enforcement a priority.'",
        "'speaker_2': 'While the city achieved the lowest reported number of violent crimes in 2014, this year, overall crime has increased by 6.3% based on a five year average. And since the beginning of summer, there has been a spike in violent crimes.'",
        "'speaker_2': 'I recently attended a violent crime summit convened by the Major City Chiefs Association in Washington, DC. The preliminary findings of the summit among 35 participating cities were very revealing. On an average homicide increase, 19% this year. 62% of the cities have had increases in nonfatal shootings.'",
        "'speaker_2': '40% of the cities are reporting crime scenes with shootings using multiple firearms. Almost half of the agencies report an increase in gang retaliatory violence. Synthetic drugs have reached have not reached all cities yet, but 30% reported increase in violent crime where the offender is under the influence of synthetic drugs.'",
        "'speaker_2': 'I would like to reiterate that these preliminary findings after polling 35 major cities nationwide. In FY16, the department will focus on improving the quality of existing resources and equipment. As I mentioned earlier, the police substations have received improvement over the last 15 years.'",
        "'speaker_2': 'However, other infrastructure, maintenance and repair needs have been identified. These issues these issues will require attention in future years. It is essential to provide a clean, safe, functioning work environment for our employees to enhance employee performance and morale.'",
        "'speaker_2': 'In addition, the Department is expanding the procurement of projectile launchers and munitions to be more readily available to police officers in the field for improved alternative moderate force options. The Police Department is grateful that FY16 will afford our organization an additional year of resource stability with minimal impacts to our current level of service.'",
        "'speaker_2': 'We have implemented many new programs and efficiencies with a budget neutral impact to the general fund. In closing, the police department will approach FY 16 as a year of transition. We will diligently reevaluate the department's structure, along with citywide priorities and emerging crime trends, to identify the most optimal way to guide the department through the budget limits'",
        "'speaker_2': 'forecasted for FY 17 and f y 18. As part of our many strategies, a police department will continue to actively seek available grants, explore technology that streamlines administrative functions. And we will continue to work with our internal and external partners to develop comprehensive programs that maximize city resources to address public safety.'",
        "'speaker_2': 'This concludes our presentation, and I believe we're going to do the other departments first, and then I will be available to all of you for any questions that you may have.'",
        "'speaker_1': 'Okay. Let's move on to fire.'",
        "'speaker_8': 'Good evening, mayor garcia and members of the city council. This evening, I will be giving you a brief overview of the Long Beach Fire Department's fiscal year 16 proposed budget. My presentation will also touch upon the services provided by the Fire Department some of our key accomplishments for the current fiscal year.'",
        "'speaker_8': 'Significant changes in fiscal year 16 proposed budget and some major issues and opportunities for fiscal year 16. The Fire Department delivers fire rescue, emergency medical services, hazardous materials response and non-emergency response services to residents, businesses and visitors of Long Beach.'",
        "'speaker_8': 'We provide a 24 hour operation for which all first responders must be prepared at all times. A primary goal of the fire department is to reduce the number of fires in the city through our fire prevention efforts. These include services such as fire inspections and code enforcement, investigation of suspicious fires to our fire investigation and arson detail'",
        "'speaker_8': ', the implementation of environmental safeguards and efforts to reach out to the community with fire prevention and safety messages and related information. Additionally, are training division provides essential services to the entire department. They prepare entry level fire recruits to be effective firefighters through our fire academy.'",
        "'speaker_8': 'And equally important is their work in ensuring that all of our first responders receive the continuing education needed to maintain skills and stay current with their knowledge of firefighting and emergency response tactics. I would like to outline excuse me, I would like to outline some of the fire department's accomplishments and highlights for our current fiscal year.'",
        "'speaker_8': 'Over the past 12 months, the Long Beach Fire Department has responded to 62,000 fire, emergency medical services and other emergency incidents. This equates to more than 130,000 unit responses. We have been and will always remain a very busy fire department.'",
        "'speaker_8': 'Included in this number is over 45,000 medical calls and over 5000 fire calls. This number also includes hazardous material responses, airport responses, marine safety responses and other non fire responses. Earlier this year, 20 new fire recruits graduated from our fire academy.'",
        "'speaker_8': 'It's our plan to continue running annual academies to keep up with attrition and ensure adequate staffing levels at all times. And as you know, last year, on July 10th, the fire department implemented the Rapid Medic deployment or RMD program throughout the city.'",
        "'speaker_8': 'The program has been in place for one year, and I'm pleased to report to you that the data that we have submitted to the Los Angeles County Emergency Medical Services Agency and the Data Safety Monitoring Board has shown has been shown by them improvements in response times and patient care.'",
        "'speaker_8': 'We continue to have a very active Community Emergency Response Team or CERT program. This year was unique in that we conducted the city's first ever Spanish language cert class. It was. We also conducted a teen cert program. CERT classes provide community members with practical hands on instruction and demonstrations of how to respond to emergencies.'",
        "'speaker_8': 'And we continued to effectively utilize federal homeland security grant funds. This year, we were able to secure funds to continue to improve our response capabilities and to improve our effectiveness in working with neighboring agencies to manage large scale regional emergencies.'",
        "'speaker_8': 'The proposed fiscal year 16 budget for the fire department is just over $98 million. We have a total of 485 budgeted full time equivalent staff consisting of 364 sworn muftis in the fire ranks. Another 26 full time year round marine safety first responders, over 160 seasonal lifeguards and 33 full time ambulance operators.'",
        "'speaker_8': 'Additionally, the fire department is supported by civilian staff in fire operations, support services, fire prevention and administration. The bulk of our budget, over 70%, is in the general fund, which supports most departmental activities. The proposed FAA 16 general fund budget for the fire department is just over $72 million.'",
        "'speaker_8': 'Additionally, Tidelands Funds supports marine safety activities as well as our fire operations in the Port of Long Beach. The Harbor Department provides cost reimbursement for the services provided to the port, and that is included in the $23 million Tidelands Fund budget for fire prop fund.'",
        "'speaker_8': 'Funds from the oil production tax continue to provide additional support for fire staffing in the amount of nearly $1.8 million per year. And along with the Health Department, the fire department provides environmental protection services that are supported by the Cooper Fund.'",
        "'speaker_8': 'The stands for Certified Unified Program Agency and through permit fees, it provides funding for inspection services and businesses emergency plan reviews to ensure hazardous chemicals are handled, stored and transported in accordance with current state and local standards. The Fire Department's proposed fiscal year 16 budget includes several changes that I'd like to highlight.'",
        "'speaker_8': 'First, as you are aware, the city has been transitioning to a consolidated and public safety communication center for the past several years. The next step in this process is to transfer the fire department's dispatching staff and associated budget to the Department of Disaster Preparedness and Emergency Communications.'",
        "'speaker_8': 'A second budget change reflects the need for additional staff to provide administrative oversight and planning for the fire department. The professional administrative staffing level in the fire department is very low for a department of our size and complexity.'",
        "'speaker_8': 'Therefore, we are proposing the addition of an administrative officer who will be responsible for managing the department's personnel safety contracts and many other administrative functions. We are also proposing the addition of a part time clerical position to assist with the many Public Records Act requests we have been receiving.'",
        "'speaker_8': 'This will partially replace a full time position that was dedicated to providing these services, but was eliminated from our budget in fiscal year 2008. Additionally, the proposed budget provides ongoing funding for a CERT coordinator. We have had an increased support for the CERT program over the past couple of years, first with grant funds and then with additional'",
        "'speaker_8': 'one time funds for cert enhancements. The short term commitment of funds has allowed the CERT program program to grow, giving us an opportunity to train more adults and teens. The addition of the budgeted CERT coordinator will allow us to support the current level of CERT program activity on an ongoing basis.'",
        "'speaker_8': 'The CERT coordinator will be responsible for coordinating the activities of the City CERT Program under the direction of the Deputy Chief of Fire Prevention. Duties will include recruiting and training volunteers, developing lesson plans and conducting training and drills.'",
        "'speaker_8': 'The CERT coordinator will also assist sworn fire staff in the Community Services Division by planning and attending CERT program meetings with CERT team leaders on topics related to emergency preparedness under direction from the Deputy Chief of Fire Prevention.'",
        "'speaker_8': 'The position will also help coordinate the department's social media and website efforts, and the CERT Coordinator will have a strong, analytical, organizational, strong communication skills as well as experience working in a public safety organization. The next change in our budget is to realign the number of budgeted, total sworn positions to reflect our actual staffing levels.'",
        "'speaker_8': 'The Department will eliminate 24 budgeted positions that were kept on the books as overstaffed positions to reduce budgeted overtime. However, these positions had never been filled. Therefore, there will be no effective reduction in staff. The net effect of this change is a savings of $200,000.'",
        "'speaker_8': 'The final change in the budget is in the Tidelands Fund. This is a reduction in marine safety staffing. We are proposing the reduction of one vacant marine safety sergeant rescue boat operator position. Looking forward to fiscal year 16, the department has several significant issues.'",
        "'speaker_8': 'The first is to conduct a thorough analysis of all potential cost savings efficiencies and cost recovery mechanisms in an effort to maintain staffing levels for fire suppression and emergency medical services. The fire department has reduced our budget over the past seven years by eliminating four fire engines, one fire truck and one paramedic ambulance.'",
        "'speaker_8': 'Therefore, we'll be looking at all options for maintaining our service. Another challenge is to continue our multiyear multiphase plan to address workforce privacy issues in our fire department facilities. The Fire Department and Public Works Department have made great strides over the past several years to ensure that our facilities foster a positive work environment and provide privacy for'",
        "'speaker_8': 'all our employees. Our facilities are unique in that our employees utilize them on a 24 hour basis. Therefore, it is essential that all facilities offer private dormitories, changing areas and restroom facilities. Fire and Public Works will utilize existing capital improvement fund appropriations to conclude these workforce privacy projects.'",
        "'speaker_8': 'And finally, the Department will begin implementing the first responder fee, which was approved by City Council on July 21st. In conjunction with financial management, we will determine collection rates and the amount of revenue received. This information will be essential in determining the level of funding available from this new revenue source in fiscal year 17.'",
        "'speaker_8': 'And with that, that concludes my presentation, and I'll stand by to answer questions after Mr. Harrison.'",
        "'speaker_1': 'Thank you. And now we're going to hear the last part of our presentation from Emergency Preparedness Management.'",
        "'speaker_10': 'I hear. Mere members of the City Council. It is my pleasure to present the first budget for this new city department, the Department of Disaster Preparedness and Emergency Communications. I am joined in this presentation by the Fire Chief, Mike Derry, and by our police chief, Robert Luna.'",
        "'speaker_10': 'As we join, as we become a part of the city's continuum of public safety. This new department was created in fiscal year 2013 to centralize and bring greater focus to disaster preparedness and emergency communications functions throughout the city.'",
        "'speaker_10': 'This reorganization was implemented to better align Long Beach with a growing demand for integrated public safety services and strengthened collaboration between city departments, county, state and federal resources with responsibility for disaster. Prepare, preparation, response, recovery and mitigation.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_10': 'In terms of our core service. Long Beach is fortunate to have miles of waterfront coastline that attract tourists and visitors from across the world. We operate our own airport gas utility and the second largest deepwater port in North America.'",
        "'speaker_10': 'These are great amenities for the city to have, but they also make Long Beach a complex city in terms of disaster preparation. Earlier this year, the City Council approved the updated Natural Hazardous Mitigation Plan that identified and provided mitigation measures for many of the risks we have.'",
        "'speaker_10': 'Therefore, our plans, exercises, training events are all designed to be flexible enough to adapt to all hazards as well as natural disasters, biological incidents, and that and national security emergencies. While an earthquake is the most probable natural disaster for Southern California, we can see from the recent power outages that a disruption of significance to our quality of'",
        "'speaker_10': 'life for a prolonged period can have detrimental effects on a community. We also we also administered a Homeland Security Grant program to provide training and equipment acquisition for our first responders and disaster preparedness organizations. And integral to the department is the provision of 911 Emergency Communications Services for Police, Fire and Emergency Medical calls for service during a'",
        "'speaker_10': 'disaster. The call center would activate a mass notification system to alert residents of the status of a pending or actual major emergency. The call center would also provide updated information to first responders, information that we receive from the public.'",
        "'speaker_10': 'Thanks. The new department hit the ground running in terms of accomplishments for five days beginning July 15 through July 19th and again on Friday, July 30th through August the first. The city suffered its first major power outage since the 1950s.'",
        "'speaker_10': 'The power outage was caused by fires in Southern California, maintained utility vaults at the height of the power outage. Approximately 30,000 residents were affected. The city responded by activating its EOC emergency operations center at its highest level for a sustained period to assist police, fire, public works and other staff to manage city resources to restore power to'",
        "'speaker_10': 'the affected area. This was the first activation at this level since the 2004 Verizon service interruption. And we will and we will report on this interruption in greater detail at the September 1st City Council meeting. But I'd also like to say, Mayor, City Council, as you are aware, the city's response was matched 141 by this by our'",
        "'speaker_10': 'residents response as well to this major disruption of our quality of life and services to our residents. We had just an outpouring of support from residents, nonprofits, the business community, just resident two resident camaraderie and mutual respect helped us to manage this major disaster and move forward.'",
        "'speaker_10': 'There were no increases in crime and criminal activity during this period of time, and there were no major accidents during this time. Our response was aided by almost 300 city staff and community partners that we trained throughout the year through our whole community approach to disaster preparedness.'",
        "'speaker_10': 'Many of those staff responded to the incident or to the D.C. Department Operations Centers or at our EOC or at the emergency shelter and food distribution points went through that training during this past year. I spoke earlier of the probability of an earthquake affecting Long Beach, and I'm really proud to state that Long Beach is one of'",
        "'speaker_10': 'the few cities nationally to participate in the earthquake early warning system to provide seconds or minutes of warning before an earthquake might strike. We are beta testing this technology to see how departments could use 20 seconds, 40 seconds, a minute of warning before disasters strike to put in operational changes that would save lives and property.'",
        "'speaker_10': 'We oversaw a $9.1 million in Homeland Security grant funds to provide training and equipment acquisition for disaster preparedness and response activities. With this equipment activities, with this equipment acquisition. We're not talking about militarizing our police department. There are no armored personnel carriers associated with this acquisition.'",
        "'speaker_10': 'But rather, we we emphasize our acquisitions on communications, the provision of generators and training for all hazards. Not yet. The 911 center received over 700,000 calls for service last year and exceeded state requirements for answering 90% of those calls within 10 seconds.'",
        "'speaker_10': 'And finally, we reduced overtime for our public safety dispatchers by 30% by recruiting and training 22 dispatchers, reducing the fire public safety vacancies to one position and reducing the police public safety vacancies to three positions. No. Our budget is made up entirely of the city's general fund.'",
        "'speaker_10': 'It is cost neutral to the city. As you heard, the two police chiefs before me indicated the transference of public safety dispatchers from police and fire to this new department. There is a net zero budget impact from this transference of staff.'",
        "'speaker_10': 'Major changes. As I stated earlier, the next step in a transition of the consolidation of the police and fire dispatch is duties as the transference of the dispatch staff to the new department. This will facilitate the ongoing consolidation and cross-training program to improve services to residents requiring police, fire and emergency medical services.'",
        "'speaker_10': 'We will, if approved, upgrade a public safety dispatcher to communications and center coordinator to provide oversight to the communications in our operations. And we will add, in addition, an administrative analyst one to provide support to city departments and community partner organizations in developing their development preparedness plans.'",
        "'speaker_10': 'This slide provides you with an update on the emergency communications consolidation and cross-training program through a phased approach. We are across train police and fire department dispatchers to improve customer service, eliminating the transfer residents calls and realizing economies of scale through staff performing similar work.'",
        "'speaker_10': 'Consolidation will also position the call center to handle next generation 911 technology, including receiving texts and pictures to 911, which we are currently not able to provide this service to the public. Phase one is to cross-train staff to eliminate the transfer of resident calls from police dispatchers to fire dispatchers.'",
        "'speaker_10': 'Phase two is to cross-trained staff, to provide dispatch services to police, fire and emergency medical calls for services. The next steps are to complete the Animal U with police and fire that address operational protocols, create consolidated policies and procedures, and continue recruitment and training successes.'",
        "'speaker_10': 'And then finally looking forward, our significant issues and opportunities are to maintain emergency communication staffing levels to facilitate cross training program. Continue to implement emergency operation plans that benefit the whole community and maintain training programs for all hazards response teams.'",
        "'speaker_10': 'With that may remember City Council, this concludes our presentations and we are available to answer questions that you may have.'",
        "'speaker_1': 'Thank you. Thank you. We're going to go now to questions of the council for the department heads. So I'll start off with Councilman Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I want to I want to thank thank our city departments for those presentations. I want to thank Reggie Harrison for that presentation. I think that's fair. This new department is really one of the core roles of government, and I think it's smart that we aligned some of this duplicative services of services that are'",
        "'speaker_2': 'already taking place in fire and police department in those. I want to start with some just some comments on our police department for our chief. So so first I want to I want to just applaud a number of things in this in this budget.'",
        "'speaker_2': 'And so so first, I want to applaud the establishment of the community engagement division. And I think with the establishment of our community watch programs, you know, innovative things we're doing, like with the Security Committee on on the Atlantic Avenue in North Long Beach.'",
        "'speaker_2': 'I think that's that's really creative. Could you span just a moment on the role of this division? The Community Engagement Division. Yes, Councilman. And happy birthday, by the way. Thank you. I'll try to get out of here quickly.'",
        "'speaker_2': 'This division is going to be focused on making sure that we have partnerships with everybody in the city, collaborate with not only our community on a consistent basis, but to make sure that we're communicating the right way, the right message to everybody involved, and then looking for any opportunities to get better at what we're doing from a'",
        "'speaker_2': 'partnership perspective through the media. Just to give you an example, that division is already training a lot of our lieutenants and is going to be training our sergeants in how to give more and more rapid information to the media out at the side of events, which is going to to help us a lot in the perspective that'",
        "'speaker_2': 'our community has with the. So that's just one example. I could go on for a long time. They're going to be doing some great things for us. Sure. And I also want to applaud the the conversation about the 21st century policing.'",
        "'speaker_2': 'I've I've read the president's report. A number of the president's recommendations were were received as controversial in the law enforcement community. So I'm very proud that you're embracing it and that there are there's a proposal in this budget to actually train our police department on it.'",
        "'speaker_2': 'So I just want to acknowledge that next, I have sort of an anecdotal statement. You know, I've personally seen a, you know, a lot of human trafficking activity and increase personally. I don't know if that's justified or if that's represented statistically, but I've seen an increase there, but a decrease in gang activity.'",
        "'speaker_2': 'There was, in my opinion, more activity last year than this year. And could you just sort of elaborate a little bit on have we sort of placed more of a focus on one and taken taking a lesser focus on the other?'",
        "'speaker_2': 'Because I it's sort of getting disproportionately to one side. I'd love to not have either of them, but but human trafficking is is really a it's stepping up in North Long Beach this year. So what can you tell us about that?'",
        "'speaker_2': 'Human trafficking is an awful crime. And I'm proud to say that our department, specifically our investigations bureau, our vice unit, is a leader in the nation. They are going out and not only enforcing or suppressing the crime, but they're actually working in collaboration with many community based organizations in arresting the individuals who are involved, but getting assistance'",
        "'speaker_2': 'to what we formerly saw as prostitutes, but now we see as victims and connecting them back with their families. From the gang perspective, our strategies for this department have really changed over the last several years where everybody is focused on gang suppression.'",
        "'speaker_2': 'So for example, under the human trafficking example, our vice unit leads the efforts and gets other specialized units involved around the department. And we make these arrests. And 90% of these arrests we find are gang members that we're taking off the street for many years at a time.'",
        "'speaker_2': 'So they are not victimizing other people because we find that they're not only doing human trafficking, but they're dealing narcotics. They're suspects in shootings at times are victims in shootings. So all in all, it's it's a strategy that I think will make this city safer as time goes on.'",
        "'speaker_2': 'Well, I would just say that we're seeing more victims of human trafficking on the street. So maybe we can have a conversation off line about some of those hotspots. Absolutely. Many more victims. Whereas I can tell you, you know, I was skeptical about the cross-training approach of sort of eliminating the gang unit, but cross-training, training.'",
        "'speaker_2': 'Everyone and I expressed this last year, but I have to give it to you. I've seen the statistics in District nine. I've seen the direction their head and I've seen the, you know, the the arrests that have been made, the high profile arrests have been made and the lack of activity this coming summit, this past summer, this'",
        "'speaker_2': 'current summer, it's I've seen an improvement. So I have to I have to hand that to you. So the next the next thing is, are we at the same level of the exact same number of sworn officers? Are we at the same staffing levels this year?'",
        "'speaker_2': 'Last year, we have 806 budgeted. And yes, we're at the same level we were flagged. Yes. And I wanted to clarify something you said in your earlier statement that we had gotten rid of our gang unit. We actually still have a gang enforcement section which investigates gang crime on the vice side, right?'",
        "'speaker_2': 'No, no. We have a vice section that investigates ABC prostitution and does human trafficking and a couple of other things. But we also have a gang enforcement section that specifically is assigned all of our gang cases in the city.'",
        "'speaker_2': 'That section also has a very good intelligence portion of it. What we eliminated due to budget reductions in the last several years was the field enforcement portion of that gang section. No, I get it. I understand that the gang field field team was what was eliminated.'",
        "'speaker_2': 'But, you know, it seems that you're on the same same level of staffing. Is that from last year to this year, have calls for service increased across the years? We do have a slight increase in the calls for service that we're handling.'",
        "'speaker_2': 'And I know that the trend we commonly see every year, there's an increase in calls for service, not necessarily. In the past, we have seen a decrease. We've seen a decrease because in the way we approach work, especially through our patrol bureau, is we do more problem, long term problem solving and we work with the public safety'",
        "'speaker_2': 'continuum. So, for example, when we get dispatches, instead of going back to the same place over and over and over, we figure out different ways to approach it to eliminate the problem. So we're not going back. That being said, in the last year we have seen an increase in dispatches, which is a little different from the previous'",
        "'speaker_2': 'years. Okay. So in I'm a believer in the public safety continuum. If we're if we continue to see increases, I think it's unfair to expect your department to continue to do perform at this level without having a conversation about increasing staffing levels.'",
        "'speaker_2': 'I think that's unfair. I think you've done a great job and you're doing a great job this year, but I really want to watch that closely. The next thing is our our academies. So we have academies schedule and they are how many people are going to be in this year's academy?'",
        "'speaker_2': 'We currently have an Academy class that's about halfway through and we have 37 police recruits who are left in that class. We are currently we have recruited and we're in the process of hiring for the next class. And Mr. West has made it very clear to me that he wants us to over hire to make sure that'",
        "'speaker_2': 'we don't run into vacancy. So we're currently assessing that within our police department to see what we can maximize as far as taking on a larger class that I'm glad to hear that. I know that there's a attrition rate in the class and there's a attrition rate in the department.'",
        "'speaker_2': 'So we want to make sure those are actually level. And then so finally, I've learned a lot over this last year about just all the resources that the federal government has for us. And I'm glad that you are engaged in the like the National Forum on Youth Violence Prevention and a number of other things.'",
        "'speaker_2': 'I think we should we should continue to place a focus on identifying grants that could support us. I know that Office of Justice Programs and the Department of Justice, they have a cops hiring grant that we. It was my understanding that we are you know, we haven't pursued those because of certain contingencies related to if we hire'",
        "'speaker_2': 'someone, we have to keep them on our on our roster for a certain period of time. I think we should. Can you tell me have we gone after that? Has that changed? Have we gone off of the cops hiring grant in recent years?'",
        "'speaker_2': 'So this is the grant that covers three years of staffing. It's a federal grant that helps departments hire or rehire police sworn officers. Yes, sir. We have looked at that, but we did not pursue it because were we as a city are not in a position to go out and hire more police officers because we can't just'",
        "'speaker_2': 'look at our budget for this coming year. But we're in the forecast, which are very well aware of in the next 2 to 3 years. I don't want to be in a position where I'm recommending to the city manager that we're hiring more officers and then we have to maybe lay them off.'",
        "'speaker_2': 'We will continue to pursue every angle on every grant and if at all possible. I don't think there's anybody in the city that doesn't agree that once we can afford it, we would like to have more police officers, but we have to be fiscally responsible when we're recommending those things.'",
        "'speaker_2': 'And I would expect that you do. You do just that. My thought is that if for some if there are conditions on these grants that make them not suitable to our city, then we should take a legislative approach and make sure that the next round is crafted to where cities like Long Beach can take advantage of.'",
        "'speaker_2': 'Because we are hiring. We we've done an academy for, you know, the last few years, and those are all new recruits. So I would love to see if we can offset some of those costs with federal grants. So I'd love to have that conversation perhaps at the Fed Ledge Committee.'",
        "'speaker_2': 'It's a an idea. Thank you. I'm sorry. It's a great idea. Thank you, sir. Certainly. Next the next one, just to mention, there's a community police community policing development grant which provides one time funding for things like our our community engagement division or the our training.'",
        "'speaker_2': 'So that's something that's closed this year, but that's something that I encourage we continue to look at. And then there's the, the, the OJP anti-gang initiative grant, which seems like we're doing innovative stuff around there. We should, we should look at those if we haven't already.'",
        "'speaker_2': 'So those are just comments. I want to thank you and all of your the members of your department for the tremendous job that you're doing. Thank you, sir. Thank you. So. So I just want to I have a couple questions for our fire chief.'",
        "'speaker_1': 'Okay. So, Councilor Richardson, there's been a request to see if we can do any of the PD questions first so they don't have to keep switching. Do you mind if we do that?'",
        "'speaker_2': 'He's up there now. I'd rather just knock it out so I don't have to speak twice.'",
        "'speaker_1': 'Okay. This was a request from me. Know from Fire PD. Would you mind if they. They want the command staff up.'",
        "'speaker_2': 'They're just doing one. Everyone else remember to talk twice.'",
        "'speaker_1': 'I'm just. This is a request from PD and fired.'",
        "'speaker_2': 'I would.'",
        "'speaker_1': 'Do you want to go ahead and go ahead and just go ahead. Gunfire. Go ahead.'",
        "'speaker_2': 'Because that's the question that everybody's asking questions. Okay. Thank you. Thank you, Chief. So. So I wanted to first ask about the implementation of the fire fee. How's it coming?'",
        "'speaker_8': 'Councilmember the we are currently working through the process of when and how will implement that fee with the director of financial management, John GROSS and his staff. And we expect to issue some some type of memo to this council that will outline how and when that will go live here in the near future.'",
        "'speaker_2': 'Okay. You have an idea of a timeline.'",
        "'speaker_8': 'As of right now. I don't I can't give you a specific timeline, but I can tell you that between the fire staff and financial management staff, we're working diligently and trying to make this thing come online as quickly as we can, but we want to make sure it's right in the process.'",
        "'speaker_2': 'Great. And is there I see I'm looking at the memo from Long Beach firefighters 372 and it says that there's a proposed elimination of 24 vacant positions. Is that true? Can you elaborate on that?'",
        "'speaker_8': 'Councilmember The the budget solution that we put in place this year eliminates 24 vacant positions. If you go back to 2008, when we first started, when during the Great Recession, we went through a series of daily engine reductions.'",
        "'speaker_8': 'It started with one where we would have the engine in a station but not staff it. And then the following year we went into two engine reductions where we had two engines without that were there, but we weren't staffing them.'",
        "'speaker_8': 'And since that time, we've carried these budgeted positions that have been unfilled in our budget since 2008. So basically what this issue does is it makes our budget actually reflective of how we deploy in the organization every day.'",
        "'speaker_8': 'It makes our budget reflective of reality.'",
        "'speaker_2': 'So these positions haven't been filled in. How long?'",
        "'speaker_8': 'No, sir. Since 2008. Prior to fiscal year, 2007.'",
        "'speaker_2': 'So none of these have been filled since oh seven?'",
        "'speaker_8': 'That's correct.'",
        "'speaker_2': 'And and I would just be concerned about that's a cut. I would be concerned about that moving forward. So I'm going to I'm going to continue to look at that. Next, I know that last year we had the conversation about R&D, and I'm going to bring it up again.'",
        "'speaker_2': 'I know that we are still dependent on L.A. County EMS to approve or deny this this program. And so the question is, now that we have a fire fee, are we? If in the event that the county were to reject this program, what will be our contingency plan to make sure that there's no loss in service to'",
        "'speaker_2': 'our residents?'",
        "'speaker_8': 'Councilmember. I don't have any indication that the county would step in, given the data that has been submit to them over the past year and given the data safety monitoring boards letter that they submit to the full EMC Commission, I don't have any indication that the agency would not look at that data and see clearly that the'",
        "'speaker_8': 'program is effective based on the data. If the if the committee or excuse me, if the EMC agency through the commission came back to us and said, for whatever reason they were going to shut down our pilot program, we would then be required to revert per the four or seven guidance policy, revert back to the system we'",
        "'speaker_8': 'had in place with regard to how we deploy our paramedic rescue ambulances. But that would force us in fire management to take a very hard look at the overall system, the organization that would support those paramedics in their work.'",
        "'speaker_8': 'And it would require it would require probably a month or longer for us to put together a plan that I can articulate to you to tell you exactly how we would minimize the impact of that.'",
        "'speaker_2': 'Okay. Well, thank you so much. That satisfies my my questions.'",
        "'speaker_1': 'Rosemary Lowenthal.'",
        "'speaker_11': 'Thank you, Mr. Mayor. I have. I have a few questions. I'll start with fire. Since you're sitting there, I. And then I will ask a few questions of police as well. Chief Terry. And I know we've discussed this in briefings and in other meetings, but if you can share with us when we expect to hear back from'",
        "'speaker_11': 'L.A. County, the EMS agency, regarding our pilot R&D program.'",
        "'speaker_8': 'Councilmember the the pilot program when it was approved, when it started on July 10th, 2014, it was initially established as a two year pilot program. So we have standing a plate standing placeholder at every EMS commission meeting where the commission is given an update from the Data Safety Monitoring Board or EMS staff on an on the Long'",
        "'speaker_8': 'Beach paramedic program. So if anything comes up, that's where they would address it. So as it stands right now, we're still in the middle of our pilot program, although we had the Data Safety Monitoring Board submit a letter to the EMS commission at their last meeting with a report that that basically said that they felt the data'",
        "'speaker_8': 'that was being submit to them was coming in on a timely basis. It was stable, and it showed across the board some that they said they had no issues with regard to patient care or quality of service. So they the Data Safety Monitoring Board made a recommendation to the for EMS Commission that we stopped submitting the data'",
        "'speaker_8': 'to them. We then went back to the EMS agency, the director, and said, okay, well, what are our next steps? And so basically what she told us was they don't they don't know exactly what the next steps are, what the process is from here.'",
        "'speaker_8': 'But we're just going to stay in the pilot program for now while the county works out whatever the next steps are going to be.'",
        "'speaker_11': 'So are they giving us any feedback on our response time parameters or anything like that?'",
        "'speaker_8': 'So. The data set. I'm going to let Deputy Chief Sergeant weigh in on this, because I believe you're referring to the letter that was submit to the boss potentially by the Firefighters Association, where they call out a specific.'",
        "'speaker_8': 'Yes. And we'll let Deputy Chief Sergeant talk about that. He's got more knowledge on that.'",
        "'speaker_2': 'In regarding the two reference.'",
        "'speaker_4': '407 there was one section that stated during the pilot study the time difference between the arrival of the first paramedic.'",
        "'speaker_2': 'And the second paramedic should be within 3 minutes.'",
        "'speaker_4': '95% of the time.'",
        "'speaker_2': 'When we looked at the data prior to R&D, we achieved that goal 79 to 80% of the time after initial start of the R&D. We were remained at the same amount, 80%. That issue was discussed at one of the IMS Commission meetings.'",
        "'speaker_2': 'We made some changes and have improved that time difference down to meeting at.'",
        "'speaker_4': '84% of the time. We relate.'",
        "'speaker_5': 'To them our.'",
        "'speaker_2': 'Discussions as far as the ability to meet that. And they stated they they believed that it was not a realistic timeframe or time goal and that there would be no penalty for not meeting the 95%.'",
        "'speaker_4': 'They would continue to look at it for the remainder of the the pilot program. We would continue to try and improve the time on the timeframe.'",
        "'speaker_2': 'Within 3 minutes. And if there is any sign of any patient degradation that they would look at again, other than that, they considered it an irrelevant mark, unable to achieve and they would just continue with the pilot program.'",
        "'speaker_8': 'And Vice Mayor, if I can just add on to that. So this time differential, this get the second paramedic on scene within 3 minutes of the first was an issue that was put in through a subcommittee of the EMS commission as we were ramping this program up.'",
        "'speaker_8': 'We had no knowledge of it. The reality is there is no agency of the 31 fire departments in L.A. County. There is no agency in L.A. County that is held to that standard. We weren't held to that standard prior to the information implementation of our M.D. There is no agency in Los Angeles County unless they have a'",
        "'speaker_8': 'firefighter, paramedic or a paramedic standing on every corner that could meet that time standard. So when, as Deputy Chief Sergeant said, when we went back to the EMS commission, we said, this is an unrealistic standard that's not applied to anybody but us.'",
        "'speaker_8': 'It wasn't applied to anybody pre or M.D. So why are you applying an unrealistic standard that you can't validate with any sort of justify in any way? And the EMS commission unanimously agreed. They said, you know what? We agree with you.'",
        "'speaker_8': 'It's not applied to anybody else. It is an arbitrary standard, and we're going to keep it in the policy. But there will be no penalty if you don't achieve that. The 95% of the time they said continue to work on it.'",
        "'speaker_8': 'We want you to constantly try and strive for better, but there is no penalty. I think the most important thing on this, though, is that what we do know with the data is that we are getting a paramedic on scene faster today than we were prior.'",
        "'speaker_8': 'And I think that's the most important thing for our community.'",
        "'speaker_11': 'And I agree with you. I think that is paramount here based on what you said. I'm just curious what criteria they end up using to evaluate our pilot program or our or our R&D pilot program if there is no other example.'",
        "'speaker_8': 'Well, so this was a this three minute time standard was a unique thing. As I mentioned, they got kind of kind of put into the policy at the very end of the preparatory period before we went live. And we on it, candidly, we didn't even know that discussion was happening until it was too late.'",
        "'speaker_8': 'The Data Safety Monitoring Board of the EMS agency has asked us to send them 32 specific data points every single month. So they range from response times to times for specific treatment modalities, like how long does it take to do an EKG or how long, you know, electrocardiogram, or how long does it take to defibrillate a patient'",
        "'speaker_8': 'or how long to start an I.V. or what's? Our ROIC is a big one. Return of spontaneous circulation. What's what's how in a percentage? How many of your patients do you find in the field that are pulseless, not breathing?'",
        "'speaker_8': 'But by the time they get to the emergency department, have a pulse. So there's 32 data points that the Data Safety Monitoring Board looks at every month. And they're primarily they had been primarily looking at the data to determine whether or not anything that we were doing constituted either a degradation of care over the previous system or'",
        "'speaker_8': 'constituted anything that would pose a safety risk. The letter that they sent to the EMC Commission in May said clearly that the data was stable and poses no risk.'",
        "'speaker_11': 'Thank you. And, Mr. Mayor, that's all I have for fire. I have a few questions for police, if that's okay to chief. Thank you, Chief. Lana, I have a few questions from Councilwoman Pryce, who is not here today, but she did have very specific questions and hope that we could address it this evening.'",
        "'speaker_11': 'So for police, she wanted us to ask which officer position is being moved into prop age funds, thus reducing a motor officer? So that would be a reduction by the $74,000.20 $3.'",
        "'speaker_0': 'Item five Palo Alto. In NY 11, we had ten motor officers assigned to the prop fund due to reductions in revenue at that time. Half of an FTE was moved over to the general fund. This particular employee split his time between the Violent Impact Motor Fund and General Patrol functions on the motorcycle.'",
        "'speaker_0': 'Given that we do have funding sources for this upcoming year for the bridge fund, we're moving that 0.52 FTE back into Prop H to be funded.'",
        "'speaker_11': 'Okay. That's that's great. The second question we have is why does it state only 0.96 position is added when the description states that three positions will be added. Will this end up adding more officers on the street? That is an item that's required.'",
        "'speaker_11': 'It's quantified as $159,312.'",
        "'speaker_0': 'Vice mayor that's related to the addition of an admin intern over the hours related to adding interns that equates 2.967 FTE.'",
        "'speaker_11': 'Okay. We. I appreciate that clarification. And then an item for $210,000. What is the total fiscal year 14 budget for the red light camera program? And this program was eliminated several years ago. Therefore, what costs are remaining in FY 15 and beyond?'",
        "'speaker_0': 'Vice Mayor Currently we are in the process of removing that equipment from the traffic signals. I'm sorry, I don't have the exact amount of what that would cost us. I think we're anticipating that exact cost from the vendor.'",
        "'speaker_11': 'Okay. And that's fine. We can we can get that for me at another time. And then I wanted to go back to the. Motor officer conversation. And over the years there's been ups and downs in that area. And depending, depending on what specific crime needs exist in the city, throughout the city, we do have other quality of'",
        "'speaker_11': 'life issues that motor officers were assigned to, for instance. They're they're high profile issues. And then there are just simply quality of life issues that end up degrading one's peace of mind. And so if I could know how many motor officer positions currently exist or are proposed for FY16, if you have that.'",
        "'speaker_2': 'Mars. Look in that up right now, usually with our motor section, the majority of homework traffic complaints throughout the entire city on two different shifts. For example, a lot of them address issues or challenges, traffic challenges around schools.'",
        "'speaker_2': 'And then we have a separate unit on motors with what we call Impact Motors that specifically addresses violent crime and any hotspots in the city.'",
        "'speaker_11': 'You know, I appreciate that because I did not know that I thought that they were interchangeable. So you have a separate. Subsection of motor officers that address violent crime. They're not used interchangeably.'",
        "'speaker_2': 'Generally, that's the case. But if if we need to move people around for one reason or another or say hypothetically, they're working a special event in the city which may be on overtime, that's apart from what they normally do.'",
        "'speaker_2': 'So they may be shifted to that specific mission for that day.'",
        "'speaker_11': 'Okay. So I think therein lies the challenge is some of the things surrounding major events or noise issues along our major corridors. That ends up being an overtime assignment generally.'",
        "'speaker_2': 'Yes, ma'am. And we're we are very supported by the Office of Traffic Safety in getting grants to specifically address issues surrounding motorcycles. And I know that over the past several years, I have gotten many phone calls and emails from you about concerns about motorcycle issues in and around the second District.'",
        "'speaker_2': 'And our officers do periodically run operations and make it clear to people in this area that we don't want, for example, very loud muffler noise waking people up at all hours of the day. So we do enforce those sections.'",
        "'speaker_11': 'Thank you. And since you raised that, I'll ask openly. We know that there are fixed events that come to Long Beach. We have an editorial calendar through the CVB or any special events actually would be probably the best place to be.'",
        "'speaker_11': 'A sign for weekend support. You know, when we experience the influx of visitors, do we pointedly assign those officers for that time period?'",
        "'speaker_2': 'Generally, we do.'",
        "'speaker_11': 'Okay. I appreciate that.'",
        "'speaker_0': 'Vice mayor that in addition to the ten impact motors that we have budgeted in Prop eight, we have 21 traffic motors for General Traffic patrol and that includes police officers all the way to the rank of lieutenant.'",
        "'speaker_11': 'Okay. Thank you. That's it for me, Mr. Mayor.'",
        "'speaker_1': 'Thank you, Canterbury Ranga.'",
        "'speaker_4': 'Thank you, Mayor. And since police is up right now, just go ahead and start with police. First of all, before I begin, I want to compliment my my colleagues for asking many of the questions that I had. So I guess it shortens my level of questioning, but it also we all have interests.'",
        "'speaker_4': 'And, you know, my interest is obviously with with people. Obviously, we're only as good as the people we hire and the people we recruit. So and having been the former recruitment officer for the city, obviously, I'm very much interested in how we're going to go about finding these new recruits that are going to be filling these new'",
        "'speaker_4': 'academies coming up. I didn't see it in your budget where you had anything budgeted for recruiting. How are you going to make those assignments, if at all, if you're going to be assigning police officers or or are you going to create a a recruitment task force of of a sergeant or a lieutenant with police officers to go'",
        "'speaker_4': 'out to these community colleges and police academies to to find these diamonds in the rough, to join to join the Long Beach Police Department. I don't see civil service here, so I'm not sure if it's if it's through them that you're looking at, that the fund is going to come up from budgeting those kinds of events.'",
        "'speaker_4': 'I know it costs money. It sometimes it costs an entry fee to go to a job fair or or to just the time used to commit the time to to go to these events. Can you I appreciate you will probably don't have an extended plan at this point in terms of how that's going to what that's going'",
        "'speaker_4': 'to look like. But you have to have at least an idea as to what you foresee in terms of recruiting for the next year, for the next couple of academies.'",
        "'speaker_2': 'Recruiting a diverse workforce and one that meets the standards of that we have in this police department is one of our top priorities. Civil service is the primary department that is responsible for recruiting, and I think they do a fantastic job.'",
        "'speaker_2': 'I know that Deputy Chief Beckman, who's sitting in the audience, has been working very hard lately with Candace, our civil service director, and always looking at new and innovative ways of bringing people on board. As a matter of fact, one of the things that we've changed is the entry level test for police officer, where we looked at'",
        "'speaker_2': 'the city of San Francisco and we looked at the fact that they were they came up with a different test model. And so we're going to be testing it or we did test it this way around. So we're going to see how that helped us.'",
        "'speaker_2': 'Will Consistently, we do not have an internal budget to recruit. So we use moneys that we're giving. We're given to train and to hire from the academy to fulfill that mission. We have people who who have full time jobs, and then we will hire them on overtime to go out and do it.'",
        "'speaker_2': 'And we try to find the right personalities to fit that mold. And I think we're doing a very good job, but we can always be doing better. And and a lot of that goes back to the public trust and the community collaboration efforts that we're going to do, our community engagement efforts we're going to be conducting to'",
        "'speaker_2': 'make sure that we get more people who want to apply for police officer. So a lot of things going on in this profession right now where people are kind of shying away from it and we just got to do a better job of bringing them in the fold and making them realize that they can become the change'",
        "'speaker_2': 'they want to see if they join us.'",
        "'speaker_4': 'Okay. Well, are we are we going to be hearing civil service at all during these budget presentations?'",
        "'speaker_1': 'Mr. West. We Civil.'",
        "'speaker_8': 'Services ready to.'",
        "'speaker_1': 'Make a presentation of the.'",
        "'speaker_2': 'Counsel requested.'",
        "'speaker_4': 'The only reason I'm asking is because obviously if the commitment is for diversity and for recruiting the best and the brightest and the ones who want to get here, we have to. We have. The only way we're going to show that commitment is by budgeting for it.'",
        "'speaker_4': 'And I'd like to see that we have a budget for recruiting. That's that we have to put our money where our mouth is in that respect. But it's not. I don't need an answer now, but I certainly want to see something in there that shows the city's commitment.'",
        "'speaker_4': 'To hiring a diverse police department and getting the best and brightest. And I want to say the same for the fire department as well. I want to see that kind of commitment. I don't see it here in tonight's budget presentations, but I certainly want to see that commitment somewhere being presented to city council.'",
        "'speaker_4': 'That that you are committed to that.'",
        "'speaker_1': 'Well.'",
        "'speaker_2': 'Councilmember Mayor.'",
        "'speaker_1': 'Both the fire department and the police.'",
        "'speaker_2': 'Department are definitely committed to that.'",
        "'speaker_1': 'And you can see that when you look at.'",
        "'speaker_8': 'The folks that are in the academy. But we'll talk to the civil service and.'",
        "'speaker_1': 'Get back to you on what the budget is.'",
        "'speaker_2': 'And civil service to facilitate the.'",
        "'speaker_1': 'Attraction of the best and the.'",
        "'speaker_4': 'Brightest. Not good. Another thing that last year I did not see in the civil service budget is a recruiting component either. I mean, it was the recruiting division that was there is gone. So the. I'm just curious as to how you're going to go about doing this without having a specific fund going towards recruiting.'",
        "'speaker_4': 'So you certainly think about like I said, I don't need an answer now, but I'd like to to have the city have a a stated commitment towards diversity, towards recruiting and and getting the best that we possibly can.'",
        "'speaker_4': 'I appreciate that. Thank you. The other question I have for police is that the transfer of these 65 dispatchers that's going to go from there, going from police to disaster preparedness.'",
        "'speaker_2': 'From police and fire to the dispatchers assigned to police. And the fire department will be transferred to the new division.'",
        "'speaker_4': 'And in doing that, I notice that in the in the disaster preparedness component on page 21, I guess it was talking about. Also recruiting efforts in that. In that respect, I know that the dispatching is a very difficult job, very stressful.'",
        "'speaker_4': 'The people who answer a911 calls are are doing God's work. When you're thinking about it because you're answering to a person, a person's call who's under distress, and that person has to demonstrate a high level of of tolerance and understanding to be able to respond to those calls.'",
        "'speaker_4': 'And you're talking about this cross training of of dispatchers in police and fire. Is it to understand the different protocols in regards to how you respond to a police response or how you respond to a fire as opposed to a fire type of call?'",
        "'speaker_4': 'I really didn't mean for you to do that. But you're there.'",
        "'speaker_10': 'As councilmember, I appreciate the question and in your description of the difficulties, the challenging work that these dispatches have, I often describe it as multitasking on steroids while they are listening to a resident describe what is, in most cases, the worst day of their lives, and simultaneously putting that information into a computer, a computer aided dispatch systems'",
        "'speaker_10': 'or into some technology. But our focus in phase one, as you described, is to eliminate the transfer of that call when that resident is in that heated moment describing the worst day of their lives, and then to have to momentarily be put on hold and transferred over to the other dispatchers there, we see this as a service'",
        "'speaker_10': 'improvement. We've been working at this for a couple of years now, just working on the protocols primarily and some cross training with our supervisors so that we can understand how we'll be able to accomplish this. But the major hurdle for us has been up to this point, the vacancy factors.'",
        "'speaker_10': 'And if council members who are part of the Public Safety Advisory Committee recall back in November when I reported out we had vacancy rates at about 30% and overtime in excess of a of $1,000,000. And so we could not begin across training program until we impacted both of those areas.'",
        "'speaker_10': 'And and we have our vacancy factors known as I reported earlier, are at 3% and 5% respectively. And we have reduced overtime by 30%. And over the course of the next month, we will reduce that even further as more and more of these trainees are coming out of the academy.'",
        "'speaker_10': 'So we're approaching this cautiously. We're being diligent in our in our in our in our approach. And we have oversight them working with us in terms of police and fire to ensure that no operational protocols are violated as we move forward.'",
        "'speaker_4': 'Okay. Thank you for that for that response that you said it's going to be it's so hard work in some of these consolidations. Is there any opportunities for. Well, maybe not opportunities, but any impacts on positions that would would require putting that many people into a into a different.'",
        "'speaker_4': 'I'm guessing there's a there's a there's a there's a transfer not only of of the positions from one department to another, but also a transfer of positions from one location to another. I think I know we used to have a dispatch center here in the in the in the basement of City Hall, which was fire with police'",
        "'speaker_4': '. And then we had fire in a different, different location on the community. Is that what we're talking about as well in terms of putting them in one location?'",
        "'speaker_10': 'We currently the dispatchers are co-located in the emergency operations center. And that second floor level, they're they they've been co-located since that building was established about 12 years ago. Co-located, but separate on that second floor, they're separated by a wall between the two disciplines.'",
        "'speaker_10': 'We do not anticipate position eliminations as a result of of consolidation and cross-training. All of the skills that are currently being provided in the center will continue to be provided through the cross-training program. And as I said, it's a phased approach.'",
        "'speaker_10': 'So those those those staff that we have invested a considerable amount of training in will continue to be valuable assets to us on a go forward basis.'",
        "'speaker_4': 'Okay. Thank you. In terms of police and you still there, Chief? Yes, we have a what we have had in the past. And I see that we continue to have an agreement with Long Beach City College and providing them with the security services.'",
        "'speaker_4': 'Has there been any changes in that contract at all? Has there been any increase? A decrease is what what what's that looking like right now?'",
        "'speaker_2': 'As far as sworn officers, there has not been a change in that service that we provide to Long Beach City College. I believe if you've seen any changes. It's for the dispatching department.'",
        "'speaker_4': 'Have we made any changes to the contract amount? Has it gone up or down the last? Couple of years. Always remain flat.'",
        "'speaker_2': 'As far as I know, it's remained flat, but we'll research it. And if that's not the case, we'll get back to you on that.'",
        "'speaker_4': 'I mean, not that I would want to increase the fees for City College, but, you know, if it if we're making these changes in terms of staffing and and in our dispatching, that's a cost. And and there's some opportunity to recover some costs.'",
        "'speaker_4': 'I would certainly want to to explore that opportunity if if it exists. If not, that's fine.'",
        "'speaker_2': 'Yeah. And there should be. From my notes here, there should not be any changes. Changes in the last several years.'",
        "'speaker_4': 'My questions regarding the R&D have been, uh, have been addressed. I'm not going to ask any more on that one. The last question that I have is, uh, in the. Well, actually, I think I think I'm done. I think I know what's been asked for.'",
        "'speaker_2': 'And if I may clarify one of your earlier questions about recruiting. In looking at our numbers, the council mayor were generous enough to give us $1.5 million to hire the last class in this upcoming class. Part of the cost or the charges that we take from there are recruiting.'",
        "'speaker_2': 'That's part of it. Civil service still primarily is involved with recruiting, but that's how we pay overtime for officers, a special group of officers who are trained to go out and specifically recruit for us.'",
        "'speaker_4': 'I appreciate that. That's wonderful. I did find my my last item here. That was with the fire I looked at was asked already by one of my colleagues. But in terms of the implementation of the first responder fee and you're you're.'",
        "'speaker_4': 'Ability to try to implement it as soon as possible. There was a concern raised by the Council in regards to making it not as cost prohibitive for members of the community who may not be able to afford those fees.'",
        "'speaker_4': 'How well are we going with that? We look at.'",
        "'speaker_8': 'It. Council member. Thank you. The part of the work that we're doing with with Mr. GROSS and the financial management team and the fire department folks is working on the hardship waiver and the process by which a member of our community, should they be able to demonstrate a financial hardship, would be supported by the city through existing'",
        "'speaker_8': 'policies or or other other means. So that will be part of the report or the two from four.'",
        "'speaker_2': 'Or the.'",
        "'speaker_8': 'Letter that we will issue you prior to implementation.'",
        "'speaker_4': 'Yeah. I also asked about the possibility of a a user fee that would go into the. The building system.'",
        "'speaker_8': 'I'm sorry. Yes, Councilmember, the council did ask us to you did ask us to look into the possibility of a subscription fee. There are a number of agencies in the Southern California region that have implemented subscription fees to varying degrees of success.'",
        "'speaker_8': 'And that also that information and our research will be included in that in that communication back to council as well.'",
        "'speaker_4': 'Yeah, I appreciate that. Thank you. That's all I have.'",
        "'speaker_1': 'Councilmember Austin.'",
        "'speaker_6': 'Yes. I'd like to also thank our department heads, our chief fire chief police chief and our new chief of Disaster Preparedness Emergency Management. Mr. Harrison, for great presentations. This has been a very informative and I like Councilmember Urunga.'",
        "'speaker_6': 'I'm short on questions because many of the questions that I had, I have already been asked. So I will do my best to be brief. In the 2014 budget. Chief Luna, we we appropriated, I think, $250,000 or so somewhere around that to work toward getting guns off of the streets from those who are classified as prohibited possessors'",
        "'speaker_6': '. Does this budget address that category or do we have any specific plans in there for 16 to to attack that issue? I think we had some success was just just researching and found a press release so that we we actually took a significant amount of guns off the street through that that program a couple of years ago'",
        "'speaker_6': '. Um, and I will give you credit for, for giving me that suggested a few years ago to, uh, to look at that area. Well, during our first gun back buyback program, are we working to. To eliminate prohibited possessors from having guns.'",
        "'speaker_2': 'In and you're right in FY14, we had additional funding that the council was generous enough to provide to us where we formed a specialized unit temporarily to address some of these issues. And just a quick recap on some of those stats.'",
        "'speaker_2': 'We had 30 arrests, 26 felonies for misdemeanors, 55 firearms recovered, which included six assault rifles, three rifles, four shotguns, 42 handguns, ten search warrants, 86 probation searches and 42 searches with the California Department of Justice. So it was successful.'",
        "'speaker_2': 'We do not have immediate plans to take it to that level. We are going to try and utilize as much of the 2.2 million in in regards to doing this part time, if we can, as staffing allows.'",
        "'speaker_6': 'Well, I'd just like to just comment on that and say kudos to LV PD. It shows that when we as the City Council make a commitment to to public safety in a targeted fashion, that we can have success.'",
        "'speaker_6': 'And and I like for this Council to give strong consideration to maintaining our commitment to to getting guns off off of the streets, that that program, I think, proved successful and would merit our attention in terms of redirecting or finding new resources.'",
        "'speaker_6': 'And is this budget to do that? I would I would venture to say that lives were likely saved as a result of that effort and the commitment of the city council. So I know that we'll be talking about this budget over the next few weeks.'",
        "'speaker_6': 'Certainly, I would ask that my colleagues take note of that and as well as our police chief and city manager. So. Thank you, Chief. That was the question I wanted to ask to the fire chief. You feel? I think much attention has been given to the R&D pilot model and I guess the jury is still out.'",
        "'speaker_6': 'We are moving forward with budgeting. We're making decisions based on assumptions that it will be maintained and successful. But I was curious to know noticed that you said that 21 positions were eliminated. How many of those were were identified as sworn positions?'",
        "'speaker_8': 'Councilmember, if you're referring to the budget presentation that I gave there, there is a section in there where we talked about some of the changes we made this year. It was 24 vacant positions that were basically not filled since 2008.'",
        "'speaker_8': 'We've been carrying those positions in our budget, but they haven't been filled since 2008. So it doesn't actually affect any person. It's basically making our our budget reflective of how we actually deploy every day, if that makes sense.'",
        "'speaker_6': 'Okay. So maybe maybe it's semantics that I said 24, 24 positions eliminated, but they were they're no longer going to be there, right?'",
        "'speaker_8': 'That's true. That is a true statement.'",
        "'speaker_6': 'Yesterday emanating from your budget. How many of those positions were sworn positions? And was there any is there a correlation with the R&D program in terms of your staffing?'",
        "'speaker_8': 'Councilmember All of those positions would have been our would be sworn positions. They would have all been firefighter positions. So as I mentioned during my presentation in 2008 where we did the daily engine reduction, then we went to a second daily engine reduction.'",
        "'speaker_8': 'We basically had the positions budgeted, but because we weren't filling them, we realized the savings. And so they just kind of lingered in our budget up until this point. So because we needed to realize about a $200,000 savings, this was a way to make our our actual deployment model reflected in our budget.'",
        "'speaker_8': 'So it all lined up and at the same time saved $200,000, which means they didn't have to impact any of our existing operational capability this year. Had we not done this, then I would have had to realize an operational efficiency and some way to get to that $200,000.'",
        "'speaker_6': 'So we're talking 24 positions. And forgive me if my my math is fuzzy right now. It's getting late, but that seems like it adds up to way more than $200,000 savings.'",
        "'speaker_8': 'Well, so it's it's a and I'm going to let my administrative bureau chief David Honey handle this. So the way this the way this works is we back the positions out, and then we have to put the value of the overtime back into our budget and it nets out to 200,000.'",
        "'speaker_8': 'But David can't answer the specific budget part.'",
        "'speaker_2': 'That's essentially it council member US and the way chief explained it when we did keep these positions budgeted in what we would call an overstaffed model, those positions at least budgetary reduced callback over time in our constant staffing model.'",
        "'speaker_2': 'So as we return these or as we would delete these positions that are or have always been vacant, the callback over time would at least budgetary would increase, but it would the increase would be less than the cost of those positions that were being reduced.'",
        "'speaker_6': 'Okay. So I guess I'll just just comment that, you know, I have some concerns about the elimination of positions. We still have uncertainty with this this pilot program that we are involved in. I mean, I know you feel confident that that it will will be supported and ultimately be adopted by your Ms. the county of your agency'",
        "'speaker_6': '. But I think we the jury is still out. And I think it's a risky call. It just that's just my, my, my comment on that. Um, Mr. Harrison, thank you. The B and again I said I'd be sure.'",
        "'speaker_6': 'See? The cross-training Mr. Wanga or Councilmember Baraka touched on. Actually, part of my question, and that was the the cross training between the fire and police dispatchers. And from my experience, just working with other public agencies, I know you have a high turnover rate.'",
        "'speaker_6': 'Right now. You said the the the vacancy rate is only 3 to 5%. Is that correct?'",
        "'speaker_10': 'Correct.'",
        "'speaker_6': 'Well, kudos to correct. And the civil service and recruiting process for for turning that around. I mean, it's been absolutely a month or so since we've done that. And so that's good news. I'm curious to know with what the retention rate is for for for those employees.'",
        "'speaker_10': 'So retention. Thank you very much. I know you're you were present when we made the presentation back in November to the Public Safety Advisory Commission. And we talked about the challenges that we were facing at that time. And working with police and fire, civil service and others.'",
        "'speaker_10': 'We in a city manager's office very supportive. We implemented some efficiencies in the recruitment in terms of bringing in new public safety dispatchers. That has paid benefits, obviously, to us. Retention is very high in this in this workforce.'",
        "'speaker_10': 'The the difficulties in the early years of employment where you really mastering learning this task. But once that's been overcome, we have dispatchers that have we have a number of dispatchers that have been in the center for 30 years, which gives me some concern, because some of those are going to be retiring.'",
        "'speaker_10': 'But but you can see you have dispatchers with five years of experience and it is a huge jump to dispatcher the 15 to 20 years of experience. So retention levels are pretty high once they get through the training.'",
        "'speaker_6': 'And just forgive me, the cross training, is it the ultimate goal to have a dispatcher be able to answer any call at any time from fire or police?'",
        "'speaker_10': 'That's correct. We'd like to have a dispatcher be able to when they pick up that phone, they're able to initially take the call from one of four from a resident requesting police, fire or emergency medical services. Currently, fire department employees provide emergency medical dispatching, and we will continue to provide that service to our residents.'",
        "'speaker_10': 'So we're going to phase in we're going to work at the call taker position first. We understand that and be able to implement that piece of the of the program at a much later date. We'll look at the dispatching operations.'",
        "'speaker_6': 'All right. Thank you very much. Great work.'",
        "'speaker_1': 'Councilman Hughes.'",
        "'speaker_7': 'Mr. Harris, you can stay right there. Don't go anywhere. You guys can tie mine any more than 30 seconds. Cut my mike off.'",
        "'speaker_10': 'I like that.'",
        "'speaker_7': 'We're going home now. Real quickly. I just have one question, Mr. Harris, and that is, how do you educate the general public on disaster preparedness?'",
        "'speaker_10': 'The question is how do we how do we educate that? So we take a whole community approach on educating the public. We talk often about police and fire, and of course, they have a substantial role that they play.'",
        "'speaker_10': 'But our entire community plays a role in disaster preparedness, including our houses of worship, nonprofits, all of our residents, the American Red Cross, they all play a role. And so opportunities like coming out to council district offices and making presentations to the community on September the 12th, we have a large resource fair, really Long Beach.'",
        "'speaker_10': 'We also participated recently in resource fairs and District seven and two as well. One as well recently. We provide outreach, education opportunities in a variety of ways. On the 27th, if I may plug this one, we have a an outreach or training program that is specifically targeted to those areas of the community that was impacted by the'",
        "'speaker_10': 'power outage recently. We really want to get into those those those communities. They help them to better understand how they can sustain themselves for five days in a cost effective manner.'",
        "'speaker_7': 'Thank you. And I really wanted to let everyone know that just goes to show you how you guys jumped into service and really helped an awful lot of people during that time. Next, I'd like to have our. Thank you, Mr. Harris.'",
        "'speaker_7': 'You can sit down now. Now, the fire department, what percentage of the fire department, you know, calls for medical. So what percentage?'",
        "'speaker_8': 'Councilmember Right now, we trained about 84% of our total annual call volume is for emergency medical service.'",
        "'speaker_7': 'Thank you. And please.'",
        "'speaker_2': 'Yes, sir.'",
        "'speaker_7': 'What is the plan? What is the police doing to replace the officers that are, you know, retiring?'",
        "'speaker_2': 'Our normal attrition rate. Each year between 25 and 35 officers. And this year, we expect about the same. And again, all of your support and allowing us to recruit and hire and train new police officers with the current academy.'",
        "'speaker_2': 'And then the one that we plan on having for this coming year will hopefully keep us up or keep up with attrition that we're losing, the officers that we're losing.'",
        "'speaker_7': 'Very simple. Thank you very much, Chief. And I want to thank our yes for coming up and giving us your input on the things that we need here for the city of Language. Thank you again.'",
        "'speaker_1': 'Councilman Gonzalez.'",
        "'speaker_0': 'Okay. Look, they're all staring at me like, who's next? We'll start with P.D., Chief, since you're right there. I first want to thank all three of the departments because the work has just been tremendous for many years, but just as of late, because of the power outages and so much that has happened just lately, especially in the'",
        "'speaker_0': 'first in certain areas with gang activity and just shootings that have happened, although we're not at the levels we'd like to be, I think the commitment to using discretionary funding for gang suppression for me is, is, is tremendous.'",
        "'speaker_0': 'So thank you for that. Also the community engagement. Chief, I think your yourself your staff has really remained committed to that. The events, the the community policing has just been it's been great. And I've seen the the big impacts it's made.'",
        "'speaker_0': 'I have a couple questions. So some retirements and people just leaving the police department, has that impacted us at all? Has that been a big contributor to our vacancies and our staffing levels?'",
        "'speaker_2': 'It consistently is. It's a constant challenge to keep up with attrition. But again, the support that all of you have given us financially and we have a great team that continuously is recruiting and hiring and training officers and we are now in our third straight academy, about to hire a fourth.'",
        "'speaker_2': 'So I'm very hopeful that we can keep up, continue to keep up with the attrition rate that we have.'",
        "'speaker_0': 'Okay. Great. And thank you. And I know you mentioned that. And also, let's see here, I think there are a few things are already answered. Um, I feel like there's another question, but I'll ask this question is just, I'm just curious how many police division officers do we have?'",
        "'speaker_0': 'How many do we have currently?'",
        "'speaker_2': 'I'm having Mara right to my right. Look at that. I want to say it's in the area of about 20 something. Give me a quick second and we'll we'll take a quick look. We have 34.'",
        "'speaker_0': 'Cores.'",
        "'speaker_2': '35.2 assigned to the port.'",
        "'speaker_0': 'Okay, well, we'll keep 35. How about that? Okay, wonderful. I think everything else had been answered. So. Thank you, Chief. Appreciate it. Thank you for your work.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'And I'm our chief of fire. Chief, my three. I also want to thank you for your work and all of your especially the efforts with CERT. I think I saw them firsthand with the power outages and just seeing what they do day to day as it was.'",
        "'speaker_0': 'It was just great. I have a question. As far as the first responder fee, I know that when we had talked about this the last time, the first responder fee, you had mentioned it, coming back conservatively for collection rates at 50%, which is still pretty low.'",
        "'speaker_0': 'What are we looking at as far as improving our. I know we're looking at that, improving our collection rates.'",
        "'speaker_8': 'Thank you, Councilmember. When we gave our our presentation on the first responder fee, our estimation or our numbers were predicated on a 20% rate of return, which which is a very conservative estimate, given our historical perspective in that arena with regard to collection rates, that I guess that is a question that would be better posed towards our'",
        "'speaker_8': 'Director of financial management as that the billing folks fall under his shop. But I can tell you that we do everything we can to work with them, to submit the necessary reports to them in a timely manner so we can have the opportunity to build.'",
        "'speaker_0': 'And now as part of it, also part part of my question too is some of it in-house and then outsourced? How does that work?'",
        "'speaker_2': 'The collection rate for ambulance billing is a bit difficult and may be misleading. A lot of the ambulance bills are.'",
        "'speaker_8': 'Paid by.'",
        "'speaker_2': 'Medicare and medical at less than 100%. And when you make that calculation, you end up with a low collection rate when in fact the collection has been made at the authorized level. So Medicare and Medicaid only pay a small percentage of the total bill.'",
        "'speaker_2': 'So that has an impact in determining the collection rate. And it's pretty standard across the country, I don't think. I suspect our rate is probably a little better or certainly at least the same as other people. We do not have a low collection rate.'",
        "'speaker_2': 'To further answer your question, that in in Long Beach, we have a lot of collections from insurance. We have a lot of collections from Medicare and Medi-Cal or as but as I said, it's at a lower percentage because that's what the law is.'",
        "'speaker_2': 'We also have a lot of buildings that have no address and there's no opportunity to make those collections and there is no process or procedure that we can use. And I think it might be better to say, nor should we use to try to collect that money.'",
        "'speaker_2': 'So overall, we use the normal set of collection procedures. We send out bills. We do go where it's appropriate to a collection agency, and after an appropriate time, we write these bills off again. Our collection rates are, at the very least, pretty normal.'",
        "'speaker_2': 'My guess is that they are better than normal.'",
        "'speaker_0': 'And we and just to clarify, so it's all through a collection and outside collection agency, not through. Our.'",
        "'speaker_2': 'No. I know most of our collections are done in-house and most of our bills are paid in-house. It is only at the very end of the process do we turn it over to a collection agency, and we will be in the process of reevaluating and going out an RFP with it for a new collection agency within the'",
        "'speaker_2': 'next year.'",
        "'speaker_0': 'Okay, great. And then my last question is the marine safety position. What was what is the role of this vacancy exactly? And then the amount?'",
        "'speaker_8': 'Councilmember it's a it's 150,000 $145,000 a year that our target there that we're trying to get back to. Historically, over the past number of years, this position has been called a vacation relief spot. This position, although it's been vacant for some time, it has allowed our Marine safety chief the flexibility of staffing the organization with a 24'",
        "'speaker_8': 'hour dove capability and having this position filled either with overtime or other other personnel work on our rescue boats and peak load staff in certain areas throughout the summer. So currently, although we say it's vacant, there's not a body assigned to that position.'",
        "'speaker_8': 'The Marine Safety Chief has effectively utilized that position for operational needs.'",
        "'speaker_0': 'Okay. Great. Thank you. And then I'll have Reggie come up. Reggie, and thank you also for all of your work. Just real quickly, one question. So I see that over about 250 employees received emergency response. Preparedness, I guess training.'",
        "'speaker_0': 'What type of training was it or what was.'",
        "'speaker_10': 'So we we trained to a FEMA standard. So when you when you've seen some of the national report, I was like at Hurricane Sandy or the Boston Marathon and you've seen where they've called upon the logistics section leader who to come out to talk about what are their priorities?'",
        "'speaker_10': 'Are you seeing the finance section chief or planning those kinds of sections? So we we we train to those kinds of standards. First of all, they put us in the best position to be able to manage an incident because we do them to standards.'",
        "'speaker_10': 'We manage the incident. The other thing is that by doing it to this standard, it puts us in the best position to be reimbursed for expenditures as well. So incident command structure is very, very important to us and we certainly roll that out and fell into that role as a part of our recent power outage management team'",
        "'speaker_0': '. Okay, great. Thank you very much. That's all for my questions.'",
        "'speaker_1': 'Counsel for Super Now.'",
        "'speaker_2': 'Thank you and thank you to all our presenters tonight. Great job. I just had a one question. Most of the questions have been asked and answered, but I just wanted some clarification from Chief Luna on the. A follow up on Councilman Richardson's question about the field gang enforcement unit.'",
        "'speaker_2': 'I guess the clarification I'd like is. I think we're talking about the difference between a unit or section that exists versus the function they perform and where you no longer have the field gang unit, someone is performing that type of function still with the police department, correct.'",
        "'speaker_2': 'We have a variety of specialized units in the field that have taken on that responsibility because we don't have the the field unit to do that any longer. Okay. I just want to make that. It's like the unit goes away, but the function is still being performed.'",
        "'speaker_2': 'So I just, you know, violent crime and gangs is still one of our priorities and we're addressing it with every man and woman we have. Okay. Thank you. And the only other comment I want to make is just my enthusiasm over the community engagement division for communications.'",
        "'speaker_2': 'And just an anecdote on that, how important that is. This past early Saturday morning, 1 a.m., we had a power outage in the in the fourth District. And right away, within the hour, I got it. And I'd like to name these guys because they did such a great job from the fire department, battalion chief Espino and from'",
        "'speaker_2': 'the PD Lieutenant Bergen Camp both contacted me within that hour and we were able to get that information out to the public through social media. So I think that's one of the real keys. So I know this is under police for the community engagement, but I'd sure like to see fire and everyone involved in that because I'",
        "'speaker_2': 'look like the hero when I put all the information out and all the credit goes to fire police in that case, in fact, someone comment on on social media that the fourth district councilman was faster than the SC website.'",
        "'speaker_2': 'I'm not sure if that's a high bar or not, but I was glad to take that credit. So in fact, if police and fire can do that directly, I happened to be up at 1:30 a.m. studying the budget, of course, and but if that could go directly out from police and fire to the community, I think that's'",
        "'speaker_2': 'ideally where we want to be. So thank you.'",
        "'speaker_1': 'Thank you. And Councilwoman Mongo.'",
        "'speaker_3': 'Thank you. Well, so much of what we've come here to discuss has already been been answered. A couple of quick compliments to our police department since you're in the hot seat. First and foremost, I've really appreciated the embracing of the Department of Justice best practices with recruitment in regards to involving the community.'",
        "'speaker_3': 'And a lot of the neighbors of the fifth District have really enjoyed being a part of the team that has evaluated the two prior classes of of officers. And I think it's an eye opening experience for neighbors to sit in a room with people who would like to give their life to service and and become police officers'",
        "'speaker_3': '. And it really gives you a taste of the kinds of individuals that you're bringing on. And I think you're doing an excellent job. I know that it's hard to lose members of the Academy class, but above all else, I appreciate that the number one thing that we're looking at is the standards.'",
        "'speaker_3': 'If someone's not cutting it, we cannot put them on the streets. Our community is just too important and our community's safety is too important. So thank you for that. I have some questions about your detectives bureau. How many members are currently in the Detectives Bureau?'",
        "'speaker_2': 'Is looking that up for me to give you a specific number.'",
        "'speaker_3': 'So anecdotally, what I'm hearing is that a lot of those individuals are very passionate about what they do and they stay in that division for a really long time, which is great because the quality of service that we're getting.'",
        "'speaker_3': 'My main concern, though, is as as some of our most regarded detectives and professionals are are retiring. What is our plan to bring in new talent in that area over time and. I don't know the specifics of how to say it, but almost everyone in that unit is of the same tenure, and that timeline is getting close'",
        "'speaker_2': '. That is something we consistently concern ourselves with. And by the way, that number is 142 and it you do lose experience when people do retire. And our best estimates are that that we probably will have probably on the higher end maybe 35 retiring not all our all out of investigations of course it's throughout the department but at'",
        "'speaker_2': 'the same time, it gives younger officers an opportunity to go in and and learn a new job and eventually bring in that enthusiasm and passion that everybody before them once had. The only thing from a department perspective that we continuously focus on and are deputy chiefs and commanders do an excellent job, is that we will rotate people'",
        "'speaker_2': 'through some of these assignments. If somebody out there is doing an excellent job, we may rotate them into violent crimes or robbery or burglary, and they gain extra experience. We also focus a whole lot on training, both internal training of the department and external training opportunities.'",
        "'speaker_2': 'The city manager's office really supports us in sending people out of town to very valuable training, and we realistically are keeping an eye on the future and making sure that we're we're training our employees for for the future.'",
        "'speaker_3': 'Well, I appreciate that. I know that when you have a team of bad guys in a community, they can have several victims. And unless the detectives and the investigations are really going forward and we have the resources to go out and fingerprint in those areas and do the things we need to do.'",
        "'speaker_3': 'Catching those guys can take longer and more victims can happen. And so I really appreciate the work they're doing. I know our interactions with that team has been fantastic and so thank you for what you're doing with that.'",
        "'speaker_3': 'I understand this is a status quo budget, which means that should. The Council bring forward a marijuana ordinance that we would be looking to allocate significant additional resources to your department that we don't currently have available. That is an accurate statement.'",
        "'speaker_2': 'Yes. When it comes and I've I think I'm on the record saying this, that history has shown us that having these clinics both operating. I'm not going to say legally because I don't know if that's even the appropriate term.'",
        "'speaker_2': 'But operating in the city, we had a lot of citizen complaints about the activity in and around these locations which increase our workload. So obviously with these clinics coming in, based on our past experience, it would increase the workload of our men and women on the street, which is going to impact our service overall negatively.'",
        "'speaker_3': 'Well, that's a big concern for me. I know that we've talked a lot, specifically with my East Division commander, about the quality of life issues that we're really lean on being able to address. And I know Commander Griffin and your team have gone above and beyond to increase the safety in our parks and to look at our'",
        "'speaker_3': 'our traffic issues that we have from neighbors who visit through the community without regard to our are our street signs that tell very clearly posted speed limits. And so as as resources, then I would be concerned about additional funding that would result from a potential ordinance of such.'",
        "'speaker_3': 'And I would want to be sure that should we move in that direction as a council, that you have more than adequate resources available to ensure that the safety of our neighbors is our number one priority. Because in this district we've had several drug issues already this year that I think you and your team have done an'",
        "'speaker_3': 'excellent job addressing. And I also want to give credit to code enforcement, because code enforcement and PD had to work really closely on some of our more conspicuous neighbors that needed to be moved along. So thank you for your work on that.'",
        "'speaker_3': 'I know that some neighbors have reached out recently that one of our our neighborly criminals has recently gotten back out of jail, but that I hope that we're back on the case and working hard with the investigative team again.'",
        "'speaker_3': 'And so thank you for coming out to neighborhood night out and keeping the neighbors up to date on what's going on, because it's really important that we know where we stand and to protect our community. With that, we move on to fire.'",
        "'speaker_1': 'Chief.'",
        "'speaker_3': 'Chief, first and foremost, thank you for what you've done on the East Side in the last year. Our response times that I've been reviewing have been fantastic. I heard from a neighbor off of Bellflower and Wood Wardlow that had the fire department been there, any leader, any leader at all, she doesn't think that her husband would have'",
        "'speaker_3': 'survived. And so to the great to the great work of your community, every life is important. Could you specifically communicate the reduction in mutual aid? The fifth District borders several other cities, and we used to rely so heavily on mutual aid.'",
        "'speaker_3': 'And this year you've done an excellent job ensuring that the the dispatch has been able to accommodate each and every call from the Fifth District at a significant reduction. Could you get us those numbers?'",
        "'speaker_8': 'It comes from I don't have the the exact numbers off the top of my head, but I'll do my best to go back and summarize what we found over the past year. We used to rely on the fifth District borders, Orange County Fire Authority primarily, and a little bit of Los Angeles County Fire Department.'",
        "'speaker_8': 'Orange County Fire Authority a year ago, over a year ago, would typically respond into the east side of Long Beach about 17 times a month, if I recall that correctly, about 17 times a month. And starting last July with our new program, we put in place because we have more apparatus available to respond on medical calls, which'",
        "'speaker_8': 'is primarily what we do. We we lowered that number down to one or two times a month from Orange County Fire Authority and the L.A. County side of things in North Long Beach and the northern end of the fifth District, we saw a more dramatic reduction in our reliance on mutual aid.'",
        "'speaker_8': 'And I don't have that number off the top of my head. And I wouldn't I don't want to make it up, so I'm happy to provide that to you. But we did see a more dramatic reduction in mutual aid requests from L.A. County Fire.'",
        "'speaker_3': 'We've reviewed those reports and we think that it's fantastic having our trained Long Beach Fire Department deployed regularly. The men and women that are at the stations that serve those neighbors regularly specifically, we have a few of our senior neighbors who call on the fire department often.'",
        "'speaker_3': 'And it's so important that our officers respond because they know those neighbors and the concerns more intimately. So the fifth District has really benefited from that. And we really appreciate it. Thank you. That's all I have.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Councilmember Ranga.'",
        "'speaker_4': 'I would be remiss if I did not thank the police and fire departments for their fire. 101 police went on that you gave what you put us through the training, put it put us in the in the heat of the fire and in went with the fire department and got the feel of the the equipment and the'",
        "'speaker_4': 'heat that that our firefighters go through. And, of course, the the orientation that we got from the police department and and how difficult the job it can be and how easily a simple police stop of a traffic stop can escalate into something horrible.'",
        "'speaker_4': 'And I really want to thank you for giving us that orientation and exposure to see that it helps us in terms of orienting us in terms of what the what an important job you do. And I really and I really want to thank you for that.'",
        "'speaker_1': 'Thank you. And in chief, as you as you closed, I just want to reconfirm something. I know there's been some some questions in the community. While I know that we've been taking the five year average for for violent crime, and we're monitoring that.'",
        "'speaker_1': 'It's my understanding that on the on the very important number of of murders, which right know we track very closely citywide as of today, from what I understand, there has not been an increase in murders. It's about the same as last year.'",
        "'speaker_1': 'I mean, maybe give or take one or two. I mean, everyone obviously is is is an issue and we should take seriously. But I believe it's about the same as last year. Is that correct?'",
        "'speaker_2': 'Yes. Currently, we stand at the same level of murders that we did at this time last year.'",
        "'speaker_1': 'Which at which as last year was a historic low.'",
        "'speaker_2': 'It was.'",
        "'speaker_1': 'So we're still at that same from a murder point of view. We're still kind of facing a historic low number. And obviously, we're very hopeful that the fact that that trend continues clearly.'",
        "'speaker_2': 'Yes. And just as I stated earlier, if you look across the country, at most of the big, big cities across the country, they're experiencing significant increases. So we're we struggled a little bit this year, but our men and women are doing an extraordinary job.'",
        "'speaker_2': 'And and we'll keep on working and chipping away at it.'",
        "'speaker_1': 'And from from my understanding of listening to what's happening in some of the other urban cities, the increase in the murder rate has not just jumped, but dramatically jumped in many cases in a lot of urban centers.'",
        "'speaker_2': 'That's correct. I think the average was about 19% across the country, especially on the East Coast.'",
        "'speaker_1': 'So I think as far as for for Long Beach is concerned, to to see that level of consistency, while certainly, you know, murders, we know we want we don't want any to happen, obviously, in our community. But to have that historic low, I think stay stay the same is not just a testament to the work that the'",
        "'speaker_1': 'men and women of your department do, but also to the really continuum of public safety practices that we have. I think the work that's happening in the parks, in our schools, through our health department, through our non-profits, it just goes to show, even with all the additional pressures, that you guys are just doing an incredible job.'",
        "'speaker_1': 'So thank you for that.'",
        "'speaker_2': 'You're very welcome. And if I could just make another comment, there is is community support, because when we get these crimes, we need people to call us if they see something, they need to say something. And when we do get a shooting or a homicide, for people to come forward and be witnesses is a tremendous help and'",
        "'speaker_2': 'helps prevent further crimes in the city. And we've been getting that and we're very fortunate as a city.'",
        "'speaker_1': 'Well, thank you, Chief. We'll obviously keep watching all these numbers with interest. So thank you. There's a motion and a second on the floor. Any public comment on the budget hearing? Please come forward.'",
        "'speaker_2': 'Good evening. I'll try and be brief though. I don't know if I'll match. Kelsey, my brother Andrews. My name's Erin Fletcher on the president of the Long Beach Lifeguard Association. Thank you very much. Honorable mayor and council member for the time and leading da.'",
        "'speaker_2': 'Thank you, Councilwoman, for bringing up a larger than my point. The $150,000 that we're talking about coming from the Marine safety budget isn't money that's just sitting there not used. Our chiefs been able to use it to enhance the dove response for the 24 hour capabilities.'",
        "'speaker_2': 'So if we do can't cut that vacant position, we do lose service. It impacts the service model that we're providing to the community right now. The good news. And what I saw tonight is that the two vacant Marine safety officer positions that we have are should be slated to be filled.'",
        "'speaker_2': 'And so I'm hopeful that Chief Medina will be contacted very soon by civil service to be allowed to fill those requisitions that he said he's put in for as well. For that. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please. Thank you.'",
        "'speaker_12': 'Hello. Good evening, City Council. I know it's really late. I feel like we're all watching the countdown. Right? What time will we get out of here? So I'll make this as fast as I can. My name is Jen.'",
        "'speaker_12': 'Victor Anderson. I am with ECI Communities for Environmental Justice, and also I work with the Long Beach Language Access Coalition. In light of this budget hearing, you know, we're talking about the Long Beach Police, Fire Department and even the emergency preparedness with all the different the the blackouts that have happened, the issues have been going on in'",
        "'speaker_12': 'the city. And so we're here as a Language Access Coalition to talk about the importance and the need to continue to advocate for language access here in Long Beach. We want to recognize the progress that the the city has done with language access on translating documents, recognition across various departments as well as the continued funding that's been'",
        "'speaker_12': 'approved. I know we mentioned it in the Budget Oversight Committee to the I believe it's 80,000. It's approved for next year. Still, we do grow concerned that from the previous fiscal year out of the $250,000 that was allocated for language access, $70,000 was unspent.'",
        "'speaker_12': 'And it's important to note, because the community is waiting for through language access to be implemented here in the city. And while we're waiting, we wonder why was the money not spent? What were the parts of the language access policy for fiscal year 15?'",
        "'speaker_12': 'Where was the money spent and how are we making sure the residents from all across the city are getting access to various resources and various aspects of city? We asked the City Council to continue to fund language access, but also to prioritize public display and signage, phone lines and voicemails, front stop or alley languages.'",
        "'speaker_12': 'And also we wanted to note that the with the mere suggestion for a single phone line for next year's budget, we hope that this phone line also includes Latin language accessibility for people that don't necessarily speak English. We want to ensure that language access is incorporated in budgeting and planning.'",
        "'speaker_12': 'We ask the language access in future years is be integrated and itemized in every department. The budget has on an ongoing priority. For instance, the mayor has directed parks, synagogues and other departments to integrate funding for future years of the B.C. Youth Program.'",
        "'speaker_12': 'We believe the same can be done for language access. And finally, we asked the city to schedule development services in one of the upcoming budget hearings that the issue of language access can be further discussed. Thank you for your time.'",
        "'speaker_1': 'Thank you very much. Seeing no other public comment, there's a that was a hearing the motion on the floor to receive and file the hearing. Please cast your votes.'",
        "'speaker_3': 'Well, she carries eight zero.'",
        "'speaker_1': 'And we're going to go to 28 who actually was not aware that there's actually a group here for 28. So now I am so we're here 28 now and.'"
    ],
    "Recommendation to adopt resolution amending and restating the City of Long Beach Healthy Snack Food, Beverage and Vending Policy. (Citywide)": [
        "'speaker_3': 'Item number 28 report from Health and Human Services Recommendation to Adopt Resolution Amending and restating the City of Long Beach. Healthy snack food, beverage and vending policy citywide.'",
        "'speaker_1': 'Case staff. Do you want to give a staff report?'",
        "'speaker_8': 'We have Kelli Collopy, our Health and Human Services director.'",
        "'speaker_5': 'Good evening, Honorable Mayor and members of the Council. The March 10th, 2015 meeting, the Council passed a motion to amend the current healthy snack food and beverage policy and the Healthy Beverage Policy. The motion expanded the existing snack policy that was previously focused only on youth to include all snacks served at city sponsored community meetings, ground breaking'",
        "'speaker_5': 'and ribbon cuttings. It also added to the vending policy that at least 50% of snacks sold in vending machines on city property will meet the nutritional standards. And 50% of beverages sold in vending machines on city property they're not accessible to public will meet nutritional standards.'",
        "'speaker_5': 'The policy for beverages and vending machines that are accessible to the public will remain at the same at 100% of healthy options. The policy before you combines the two previous healthy snack food and beverage policies and simplifies them.'",
        "'speaker_5': 'The nutrition standards for this policy are outlined in Exhibit A on page three and reflect the Federal Food, Nutrition and sustainability guidelines for concessions and vending operations and are consistent with the 2010 USDA Dietary Guidelines for Americans. The resolution allows for updating the policy to reflect revisions in the USDA and vending guidelines as they become available.'",
        "'speaker_5': 'It also requires a specific language to compliance to these standards be included in vending contracts and that by by 1201 2016, all vending machines meet Section 40 zero five of the Patient Protection and Affordable Care Act, which requires that total calorie content is displayed for each item.'",
        "'speaker_5': 'There are some exceptions to the nutritional standards, which include fruits and vegetables, nuts and seeds, including nut butters and peanut butter plant based spreads such as hummus, guacamole and pesto and low fat cheeses. It also focuses only on snacks and beverages, not food served as meals.'",
        "'speaker_5': 'It does not include city events that require special permit or city celebrations. It does not include donated food or food purchased by individuals. And it does not include during times of emergency is declared by the authorized city safety personnel.'",
        "'speaker_5': 'As you can see on pages four through nine of the Exhibit A, the list of snacks that fit the criteria is long, provides many appealing options. It's not exhaustive, but it provides a sample of snacks that meet the nutrition guidelines as outlined in the policy.'",
        "'speaker_5': 'We believe this policy is an important next step supporting health within our community, ensuring that all people visiting city property have access to healthy and nutritious options. Thank you. That concludes my report and I'm open for questions.'",
        "'speaker_1': 'Okay. There's a motion in a second. Councilman Austin.'",
        "'speaker_6': 'Yeah. Thank you, Mr. Mayor. And thank you. Ms.. Culpepper, for your report and for bringing this back to the council. I also want to thank Council Member Richardson for his efforts on this. This this item as well. I have been working in close contact and with some members of the community on on this issue for some time'",
        "'speaker_6': ', along with the community partners like the American Heart Association. And I am pleased to see this motion before us to this item before us. You know, Long Beach has long been a leader in promoting healthy choices in a number of settings.'",
        "'speaker_6': 'Since 2011, the City of Long Beach has required strongly nutritional standards for public spaces, vending machines and youth settings. Earlier this year, the Health Department gave a presentation on the origins of the City Health Healthy Snack Food, Beverage Vending Policy.'",
        "'speaker_6': 'The policy has been a success. The community members are satisfied by the selection of the healthy options. However, today we have an opportunity to really strengthen the nutritional standards to cover all see vending machines and food served at city public events.'",
        "'speaker_6': 'And for this reason, I like to introduce the motion for and support this motion. But I'd like to to amend it to actually include 100% sodium and 100% trans fat nutritional standards recommended by the USDA Dietary Guidelines for Americans and the Health and Sustainability Guidelines for the Federal Concessions and Bidding Machines.'",
        "'speaker_6': 'I think it's very important that we do this to have a real policy that that that really addresses the health of our employees and those in the public, that that will come in contact with any machines and and events sponsored by the city of Long Beach.'",
        "'speaker_6': 'I would love to get a second on that amendment.'",
        "'speaker_1': 'Because that well Constable Richardson had seconded the original motion.'",
        "'speaker_2': 'And that.'",
        "'speaker_1': 'Is. It does so. So Councilman. So yeah. Well actually then you need to not second that's the motion that councilman is making.'",
        "'speaker_2': 'So a second the staff recommendation. It is a different.'",
        "'speaker_1': 'It's a different it's a different motion. So you should remove that motion. Councilman Okay.'",
        "'speaker_6': 'So I will. I'll go with the staff recommendation. We don't go forward with that, but I think we should definitely talk about enhancing the staff recommendation as well. I don't I don't know see any good reason why my colleague would would not support a stronger policy.'",
        "'speaker_6': 'But I'll leave it to him to explain that.'",
        "'speaker_1': 'Okay. So then so Councilman Austin, that you're just to be clear, so you're back to just making a motion on the staff recommendation, is that correct for right now? Okay. So can someone second that. Okay. The second on that.'",
        "'speaker_1': 'Councilman Richardson, you're cued up. Do you want to one offs or are you done or you want to do anything else?'",
        "'speaker_6': 'Well, I have a new seconder on a motion.'",
        "'speaker_1': 'Councilman Tharanga.'",
        "'speaker_6': 'And so I'm asking council member your angle would you second the motion to add the the include 100% sodium and 100% trans fat nutritional standards recommended by the USDA and the American Heart Association. Yeah. Okay.'",
        "'speaker_1': 'There's a motion on the floor. Second category, Ranka, do you have any additional comments? I want to go on to the speakers list.'",
        "'speaker_6': 'I'll let my colleague speak.'",
        "'speaker_1': 'Summary Ranga, you're you're. You're the second on this motion. Did you want to make an additional comment?'",
        "'speaker_4': 'I mean, I agree that the amendment is an important one. We should also look at salt intake and and.'",
        "'speaker_1': 'Okay. Councilmember Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. So. So I'm a little disappointed just at the tone that this is taking. So first I'd like to ask Miss Colby, who led on this item, bringing this the City Council for Adoption, which council members signed on to that item?'",
        "'speaker_5': 'In the original Councilman Richardson.'",
        "'speaker_2': 'Was Councilmember Austin a member of that item?'",
        "'speaker_5': 'In this pattern in March or when it came to item.'",
        "'speaker_2': 'This item that prompted you to make this report.'",
        "'speaker_5': 'Councilman Richardson, you brought this to the table. I'm sorry. Councilman Richardson brought this to the table. The councilman out into office, worked very close, was working also very closely with the American Heart Association.'",
        "'speaker_2': 'And when this item came to city council in 2011. In 2011, which members of the City Council are still on the City Council today? I would I would think is probably Councilmember Lowenthal and Andrews are the only ones that were on the city council at that time.'",
        "'speaker_2': 'So traditionally when a concept comes to city council, we like to see those things from start to finish. And that means do the work in our community to include folks like the Coalition for Healthy North Long Beach, who's been really at the forefront of really determining and developing health policy in North Long Beach, but also citywide.'",
        "'speaker_2': 'I think it's not only is it disrespectful, but it's bad tact and not very politically astute to to step in on a motion like this, that should be a relatively positive thing. That should get relatively unanimous support at the city council.'",
        "'speaker_2': 'I would love to make our health policy stronger. We began in 2011 and it was significantly watered down. We took steps to make it stronger. We took additional steps last year to make it even stronger since then. And tonight I had a motion here to make it even further, even more strong, that I worked with the Coalition'",
        "'speaker_2': 'for Healthy North Long Beach and a number of people here. But I was I wasn't given that opportunity. So tonight I'm going to offer a substitute motion and to to go back to the original policy and to come back with some recommendations on how to make it stronger by taking a look at trans fat and some of'",
        "'speaker_2': 'the other recommendations from the American Heart Association. And that's my motion.'",
        "'speaker_1': 'Is there a second to the substitute? So I think, councilwoman. Councilman I think Councilwoman Gonzalez or Councilman Mongo Lowenthal OC Vice Mayor Lowenthal is the one that's in there. So that is there's a substitute motion by Councilmember Richardson to go with staff's recommendation and then to return with additional measures to make the to make it stronger.'",
        "'speaker_1': 'So that's the motion currently on the floor.'",
        "'speaker_4': 'Of a point of order, I guess, in terms of this is already an audience. Is that what it is?'",
        "'speaker_1': 'Yes. This is an this is this would be an update to the policy.'",
        "'speaker_4': 'Okay. So if the original motion is not adopted and we accept the the substitute motion that's proposed by Councilman Austin, it basically changes what we can't do.'",
        "'speaker_1': 'Councilman Councilor Richardson. It would it would update the policy and then it would return with additional amendments to that policy. At some point in the future, it would still update the policy.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Is that correct? I think that's that's correct. Okay. Vice Mayor Lowenthal, you want to speak to your second?'",
        "'speaker_11': 'I concur with Councilmember Richardson. This is something that started some time ago. I believe that it was Councilmember Neal and I either were the original sponsors of this, which does not mean, of course, that there is no opportunity for others to weigh in.'",
        "'speaker_11': 'So hopefully in the time that staff will take to come back with the item, the issues that Councilmember Austin has raised will be addressed and also the issues of working with the community. I do think every time something comes before the council, we do have an opportunity to make something better and hopefully that's what supporting this motion'",
        "'speaker_11': 'will do. Councilmember Richardson's motions make it better.'",
        "'speaker_1': 'Thank you. Councilman Andrews?'",
        "'speaker_7': 'Yes, Mayor. I'm sure that I was one of the original, you know, of this you know of this policy back in that time. Because I because I can say without a doubt, the policies has been great for our city.'",
        "'speaker_7': 'But I also tell my staff and kids that, you know, I teach that your your health is all you have. You know, and once it's gone, it's gone. And so if you have to do it what you can while you can still keep your body healthy.'",
        "'speaker_7': 'And this is definitely I'm in favor of this because the fact that this is what we're seeing every day is no doubt about it in our schools and even in our walk of life, you know, diabetes, high blood pressure, overweight.'",
        "'speaker_7': 'These are things that we really going to have to get ourselves more in line with because we don't you know, we're just running the risk of just losing a generation here. So I'm actually in favor of anything we can do to help, you know, make this even better.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'First question, I want to back on the coolest that you have know. Okay. Councilman Austin.'",
        "'speaker_6': 'Yes. Yeah. I thought this would should be a pretty pretty much a no brainer in terms of the getting support from the council. The the substitute motion on the floor, I think, essentially seeks to do what the original motion will do.'",
        "'speaker_6': 'But as time and you know, in terms of I won't address the the comments made earlier about political correctness, I think this council is here and I think all every body up here is is committed to promoting promoting health and safety in our community.'",
        "'speaker_6': 'That is or should be our number one charge as it is a city council. I wasn't here in 2011, but I was here in 2012 before most of the members of this council. And no, I wasn't a part of the original motion and I wasn't on staff for anyone who brought this original motion forward.'",
        "'speaker_6': 'But it doesn't any way, in any way diminish my commitment to the health of our residents, the health of our employees, the health of our community as a whole. And so I'm committed to that. Diabetes is real. Hypertension is real.'",
        "'speaker_6': 'These are real factors that that that impact the our communities, particularly in the lower income areas where people have less access to quality food. And to the extent we as a city council can make a good decision tonight to improve this policy, but include the the amendment that put forth in the original motion.'",
        "'speaker_6': 'I encourage us to do that because it's the right thing to do. I don't think we should get into ego trips up here in terms of who brought what first and and protocol because protocol has been. Broken on many occasions in my my three plus years on this council.'",
        "'speaker_6': 'For the most part, we try to get it right. We try to work together to do the right thing. So the original motion put forth by myself and seconded by Councilmember Urunga, I think is the right motion. It addresses a healthy building policy and we move forward with including trans fats and sodium.'",
        "'speaker_6': 'Based on the standards recommended by our our national or our health, federal government and the American Heart Association. I love to hear public comment on this.'",
        "'speaker_1': 'Okay. That concludes Council on the cued up right now. So we're going to get a public comment so we can hear of members of the public. Please come forward.'",
        "'speaker_7': 'Come on.'",
        "'speaker_0': 'Good evening, Mayor. Council members and staff. I'm really excited to be taking a look at amending the snack food and beverage policy. And I hope that we can come to a strong conclusion to make sure that the standards are as strong as it can be.'",
        "'speaker_0': 'My name is Violet Ruiz, and I'm the government relations director for the American Heart Association in Los Angeles County. And first, I would like to begin by thanking the leadership and the council members that we've been working with on this issue.'",
        "'speaker_0': 'I would like to thank Council Member Rex Richardson and Council Member Al Austin for your leadership in leading efforts to improve nutritional standards for snack beverage vending machines and food served at city and public events. The American Heart Association has worked with several community partners on improving nutritional standards for the past year, which include Long Beach Fresh'",
        "'speaker_0': 'Long Beach Alliance for Food and Fitness, Cambodian Association of America Building, Healthy Communities Center for Latino Community Health and Long Beach. Latinos in Action to name a Few. The American Heart Association is in strong support of the proposed changes to the city of Long Beach healthy snack, food, beverage and vending policy.'",
        "'speaker_0': 'While this is a step in the right direction, the American Heart Association is requesting to amend the policy so that all food served in Long Beach vending machines meet 100% of the sodium and trans fat nutritional standards recommended by the USDA Dietary Guidelines for Americans and the Health and Sustainability Guidelines for Federal Concessions and Vending Machines.'",
        "'speaker_0': 'Diets high in sodium and trans fat are the leading contributing factors of heart disease and stroke. And to illustrate this issue, 77 million Americans have high blood pressure, which is the leading risk factor for death in American women, resulting in 200,000 deaths per year.'",
        "'speaker_0': 'Long Beach has the opportunity to continue being a leader in the region, state and nation by providing solutions in healthy food access as a means of public health prevention and health equity. Other cities have established strong vending standards, which include El Monte, Baldwin Park, Santa Clara and Pasadena, which are similar to Long Beach as it has a'",
        "'speaker_0': 'city run Department of Public Health, which is one of three in the entire state of California. And furthermore, Long Beach has the opportunity to really level the playing field for nutrition standards so that they are the same for youth, employees, residents and visitors.'",
        "'speaker_0': 'The American Heart Association respectfully request your support in amending the city of Long Beach food, beverage and vending policy to not only include the amendments from the Department of Health and Human Services, but also to include 100% sodium and trans fats standards to really make access to healthier options available to everyone in the city of Long Beach'",
        "'speaker_0': '. Thank you.'",
        "'speaker_1': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Good evening, Mr. Mayor.'",
        "'speaker_12': 'And members of.'",
        "'speaker_2': 'Staff and members of Council. Huge.'",
        "'speaker_12': 'Thank you to Kelly Collopy and the Department of Health for continuing to be leading pioneers in health policies. And to council members Austin and Richardson for their leadership as well. My name is Tony D'Amico and I represent.'",
        "'speaker_2': 'Long Beach Fresh, and I'm also on the executive committee of the Long Beach Alliance for Food and Fitness and a member.'",
        "'speaker_12': 'Of the Building Healthy Communities.'",
        "'speaker_2': 'Neighborhoods Work Group. I stand.'",
        "'speaker_12': 'Here to support restating the city's healthy vending policy with the proposed change that the recommended guidelines for sodium and trans fats.'",
        "'speaker_2': 'Would be applied to all vending machines, not just 50%.'",
        "'speaker_12': 'So it's 100% of the standards applied to all.'",
        "'speaker_2': 'Of the machines. As a local food systems collaborative and an active member of the California Food Policy Council, Long Beach Fresh believes that our local government plays a critical.'",
        "'speaker_12': 'Role in tipping the scale toward healthy living, especially with nine in ten Americans eating too much sodium and 75% of that sodium coming from.'",
        "'speaker_2': 'Package and processed food. So I urge council to show a deeper commitment to preventing deadly illness by making the healthy choice the standard in Long Beach. And again, commend you for.'",
        "'speaker_12': 'Your efforts and stand today with the American Heart Association Building Healthy Communities, Long Beach, Long Beach Alliance for Food and Fitness and.'",
        "'speaker_2': 'Respectfully requesting.'",
        "'speaker_12': 'That you are vote for the.'",
        "'speaker_2': 'Proposed amendment by Al.'",
        "'speaker_12': 'Austin.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. And Speaker, please.'",
        "'speaker_0': 'Good evening. Mayor. City Council and staff. My name is Erica Bonia. I work at the Center for Latino Community Health at Cal State Long Beach, and I am also a resident of District seven. Thank you for the opportunity to just be able to share with you tonight.'",
        "'speaker_0': 'I am in strong support of amending and restating the city of Long Beach, healthy snack food, beverage and vending machine policy. As we know, there are many chronic conditions that affect our communities. Diabetes being one of them. And it's as we've seen, it's one of the leading causes of death here in Long Beach.'",
        "'speaker_0': 'So I respectfully request the amendment so that all food offered in Long Beach snack vending machines meets 100% of the sodium and 100% of the trans fat nutritional standards. And, of course, any amendments to further strengthen the policy.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Speaker.'",
        "'speaker_5': 'Good evening, Mayor. And the city council members and our staff. My name is Jan to you. I'm working with Cambodian Association America. I'm a program specialist and I live in the eighth District. And I would like to thank you, the council member, Al Austin and Council and Richard Richardson, for your leadership and your support in the strong'",
        "'speaker_5': 'support of the amendment of the city of Long Beach for healthy snack food, beverages and vending machine policy. I respectfully requested an amendment so that all the food offered in our Long Beach snack vending machines meet 100% of the sodium.'",
        "'speaker_5': '100% of the meat of the. The transfer nutritional standards to meet the federal guidelines. Thank you very much. And good night, Don.'",
        "'speaker_1': 'Thank you. Thank you for being so patient tonight. We're going to go and go back to the council and to a vote. I just want to restate the motion on the floor, which is to recommend to adopt the resolution amending and restating the Long Beach healthy food sack policy and to work with the community and come back'",
        "'speaker_1': 'for additional amendments to the council. This is a motion by Councilmember Richardson. And secondly, Vice Mayor Lowenthal, Councilmember Austin.'",
        "'speaker_6': 'Yes. And can you state the original motion? I would just ask that the the the council reject this this amendment or the substitute motion it seeks to actually accomplish what the original motion does. The original motion will accomplish that tonight and without delay.'",
        "'speaker_6': 'And so I think we send a strong message that we are serious about promoting healthy vending here in the city of Long Beach for and our vending machines and our in our our public events tonight. So let's let's let's reject the substitute motion and and support the original motion on the floor.'",
        "'speaker_1': 'So okay, so that was a restatement of the wisdom of the original motion. So we're right now we're on the substitute motion. And good. Gordon Cashman wants a counteroffer. And you restated the original version, correct? Okay. So I want to make sure that.'",
        "'speaker_1': 'So I take it please vote now on the subsidy motion by Richardson and Lowenthal.'",
        "'speaker_3': 'Motion carries five three motion carries.'",
        "'speaker_1': 'So the motion passes and the Health Department will work back with the community and come back for additional amendments. So, Madam Clerk, let's go ahead and go back to. Believe it will be now. Item 25.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Thank you.'"
    ],
    "Recommendation to adopt Specifications No. ITB FS15-125 and authorize City Manager to execute a contract with Worthington Ford, of Long Beach, CA, for the purchase of 11 compressed natural gas-fueled, Ford F-250 service trucks, in a total amount not to exceed $660,235 inclusive of taxes and fees.  (Citywide)": [
        "'speaker_3': 'Item number 25, report from Financial Management Recommendation to adopt specifications and execute a contract with Worthington Ford for the purchase of 11 compressed natural gas field service trucks in an amount not to exceed 660,000 citywide.'",
        "'speaker_11': 'Is there a staff report?'",
        "'speaker_1': 'Fleet manager Dan Bernbach.'",
        "'speaker_2': 'Good evening, mayor Garcia and members of Council City departments use work trucks such as this three quarter ton utility body trucks to transport tools and materials to job sites throughout the city. These 11 trucks have come due for replacement as they have aged considerably, causing a rise in maintenance and operational costs as well as increased downtime that'",
        "'speaker_2': 'affects operations. These trucks come equipped with compressed natural gas engines, enabling significant fuel savings compared to petroleum based fuels. Additionally, use of compressed natural gas supports air quality improvement to reduce their emissions. The additional cost of the CNG equipment is covered by grant funding.'",
        "'speaker_2': 'This purchase was competitively bid with extensive outreach to ensure best pricing for the city. And that concludes this brief presentation. I'm available to answer questions.'",
        "'speaker_11': 'Okay. There's been a motion and a second councilwoman manga. Would you like to speak to your motion?'",
        "'speaker_3': 'I just want to thank Fleet Services for doing an excellent job for outreach to the community. I know that Long Beach vendors can't always win, but it's great when a Long Beach vendor can win and that sales tax stays right here to fix our streets and sidewalks and things like that.'",
        "'speaker_3': 'So thank you so much for the additional outreach you guys have done over the last year. It's been really impressive.'",
        "'speaker_2': 'Absolutely.'",
        "'speaker_4': 'Councilmember Urunga just want to congratulate the city in continuing its efforts to going green.'",
        "'speaker_11': 'Thank you. Is there any member of the public that wish to address council on this item? Item 25? Seeing none. Members, cast your vote.'",
        "'speaker_3': 'Motion carries eight zero.'",
        "'speaker_11': 'Item 26.'"
    ],
    "Recommendation to adopt Specifications No. ITB FS15-126 and authorize City Manager to execute a contract with FFBH Motors, LLC, dba Frontier Ford, of Santa Clara, CA, for the purchase of 31 Ford Interceptor Utility vehicles, in a total amount not to exceed $1,173,950, inclusive of taxes and fees.  (Citywide)": [
        "'speaker_3': 'Item number 26. Report from Financial Management. Recommendation to adopt specifications and execute a contract with Frontier Ford for the purchase of 31 Ford Interceptor Vehicle Utility vehicles in an amount not to exceed $1 million citywide.'",
        "'speaker_11': 'Mr. City Manager.'",
        "'speaker_1': 'Mr. Berlin Bach again.'",
        "'speaker_2': 'Yes. Mayor Garcia, members of council. Much of the city's police patrol fleet has come due for replacement, and there are significant changes in store as we move to a new model of police vehicle. The current fleet is aging and this is causing a rise in maintenance and operational costs as well as increasing downtime.'",
        "'speaker_2': 'The city's patrol vehicle of choice for years was the Ford Crown Victoria, a model also used by the majority of police fleets across the country. However, after 30 years of production, Ford discontinued the car in 2011. At that time, the city purchased 130 new 2011 models, stockpiling them until a clear replacement could be identified.'",
        "'speaker_2': 'We are just now placing.'",
        "'speaker_4': 'The last of those 2011 models into service.'",
        "'speaker_2': 'It was a fortuitous decision to stockpile cars in 2011, as the market has seen new models from Ford, Chrysler and General Motors. The model that's emerged as the market leader is also the choice of the Long Beach Police Department and the Fleet Services Bureau, and that is the Ford Interceptor Utility.'",
        "'speaker_2': 'This vehicle is built on the Ford Explorer platform, but significantly upgraded for police, patrol duty, engine suspension, interior ergonomics. All have been fine tuned for police use. Fuel economy is also improved and emissions reduced in the recommendation for award in front of you.'",
        "'speaker_2': 'The Vehicle specifications where the product of extensive research performed by the Long Beach Police Department and the Fleet Bureau initiated in 2014. In this first round of anticipated awards, these 31 vehicles will replace not only patrol vehicles, but also K-9 airport security and park rangers.'",
        "'speaker_2': 'We will shortly initiate another bid process and expect to return to city council, where the recommendation for additional vehicles in FY 16 as well. This purchase was also competitively bid with extensive outreach to ensure a best price. That concludes my presentation and I am again available for questions.'",
        "'speaker_11': 'It's been moved by Councilmember Yarrawonga and seconded by Richardson. Councilmember.'",
        "'speaker_4': 'I understand that these utility vehicles offer greater comfort to for arrestees. Wonderful.'",
        "'speaker_11': 'Excellent. Councilmember Richardson, did you want to speak to the motion? All right. There's been a motion and a second on item 26. Is there any member of the public that wish to address council on this item? CNN members cast your vote and members if he'll indulge us.'",
        "'speaker_11': 'I think we have some folks in the audience for item 35, if we can take that one up first.'",
        "'speaker_0': 'Councilman Andrew, can I ask you to vote, please.'",
        "'speaker_7': 'After the work? Yeah.'",
        "'speaker_11': 'Councilmember.'",
        "'speaker_3': 'Motion carries eight zero.'",
        "'speaker_11': 'Item 35.'"
    ],
    "Recommendation to authorize City Manager to allocate Public, Education, and Government (PEG) fee revenue equally among the three categories of cable access providers, each receiving one-third of the total available; and increase appropriations in the General Services Fund (IS 385) and the Department of Technology and Innovation (TI) by $1,026,288.  (Citywide)": [
        "'speaker_3': 'Item number 35. I can get their report from Technology and Innovation recommendation to allocate peg fee revenue equally among the three categories of cable access providers and increase appropriations in the Department of Technology and Innovation by $1 million citywide.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_11': 'It's an emotion by Councilwoman Gonzales and a second by Councilman Austin. Councilwoman Gonzalez.'",
        "'speaker_0': 'I guess I just wanted to thank our Technology and Innovation Department and as well as our I know patent is here and they do tremendous work. So this, I'm sure, will be a great benefit. That's all I have.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_11': 'Councilman Austin, did you want to comment?'",
        "'speaker_6': 'I'll get this. I support this as well, Pat. That community television is a very important to community education and engage in our community and what's going on throughout the city. And so we should support this.'",
        "'speaker_11': 'Great. Thank you. Is there any member of the public that wish to address this item? Oh, Councilmember Monga.'",
        "'speaker_3': 'I, too, wanted to thank all the great work that Patina has done. They've really done a lot of outreach in the community and been a staple that all of our neighborhood organizations can really rely upon along with. Now some of your business partners that you've really worked with.'",
        "'speaker_3': 'We appreciate the hard work that you've done. Thank you for the outreach outside of your your geographic area and going citywide. We appreciate that.'",
        "'speaker_1': 'Okay. With the motion on the floor, is there any public comment on this item going forward?'",
        "'speaker_10': 'Good evening, Mr. Mayor, and members of the Council. Derek Simpson, executive director of Long Beach Action Partnership and Patent TV Eastern Match. Mr. Mico We also operate our public access television program and make sure that it does provide the great service that you have all acknowledged this evening.'",
        "'speaker_10': 'I just want to say that long acting partnership continues to make a great investment of our resources to ensure that it continues to be a stellar operation. In fact, we remain the only public access operation to come back since the difficult legislation was passed.'",
        "'speaker_10': 'And we're doing that now only through the original grant that was written to the Knight Foundation, which this council supported and bringing back net back and public access back. But we're also doing it to the tune of $200,000 of our own agency funds to offset the capital investment of the funds that we look forward to improving tonight'",
        "'speaker_10': 'to ensure that the operational side of the House is taken care of. And that's just 200,000 of the total of 300,000 that it takes to actually operate pad net. So you can be assured that you can be very proud of that.'",
        "'speaker_10': 'In fact, tomorrow we interview Congressman Lowenthal for one show. We look forward we on on the council. We've had everyone there except our vice mayor. We look forward to having you sometime soon. And our new councilperson, Mr. Super Now.'",
        "'speaker_10': 'And we also interview John and Michelle Molina on one show tomorrow. It's a big day for us tomorrow. So we continue to do good work and we appreciate your support. Lisa is going to give you just an idea of some of the numbers that we've been able to generate with pay net recently.'",
        "'speaker_0': 'Thank you, dear. Yeah. Not only do.'",
        "'speaker_11': 'We produce content.'",
        "'speaker_0': 'And it produces content, but of course, our our goal is to serve the community.'",
        "'speaker_13': 'And give them the tools and resources.'",
        "'speaker_0': 'So we currently have 178 members, which includes 38.'",
        "'speaker_3': 'Groups, which are nonprofits and businesses, 142 individuals, which includes seniors, students and youth. Since 2013, when NET came back, when our public access station, after four years of absence, came back on the air, we've trained 331 people in basic production.'",
        "'speaker_0': '317 and full production, 202 and final cut pro editing 332 in.'",
        "'speaker_13': 'Studio production.'",
        "'speaker_0': 'And since 2013, our field cameras have been checked out. 1172 times members have spent 928 hours editing and members have spent 1700 hours producing in the studio. The content they've produced is about 826 shows, which includes about.'",
        "'speaker_3': '756 hours of content. So that's amazing after having been dark for four years.'",
        "'speaker_10': 'So Mr. Mayor, we currently have four interns and we would love to have a lot more if they're interested in video production. We're the place to be and we support your internship program citywide. Thank you.'",
        "'speaker_1': 'You guys are doing great work over there, obviously, and the facility looks great and keep up the good work. Very nice. Thank you. So there's. There was that was a any more public comment on this item saying non there's a motion and a second to it please cast your votes.'",
        "'speaker_3': 'Motion carries, etc..'",
        "'speaker_1': 'Next item, please.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7007 for improvements of Easy Avenue between 27th Street and Spring Street, and Pacific Avenue between Pacific Coast Highway and Willow Street; award the contract to Sequel Contractors, Inc., of Santa Fe Springs, CA, in the amount of $1,486,210, and authorize a 10 percent contingency in the amount of $148,621, for a total contract amount not to exceed $1,634,831; and authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto.  (Districts 6,7)": [
        "'speaker_1': 'Item 34.'",
        "'speaker_3': 'Item number 34 and report from Public Works and financial management. Recommendation to Adopt Plans and Specifications for improvements of Easy Avenue between 27th and Spring Street and Pacific Avenue between PCH and Wall Street. Award the contract to school contractors in the amount not to exceed $1 million 640 331 to authorize city manager to execute all documents necessary'",
        "'speaker_3': 'into an enter into the contract districts six and seven.'",
        "'speaker_1': 'Yes, there's been a motion. Can I get a second? No. There's a motion in a second as there any public comment on the item. See none. I'm sorry. Did I hear you counseling your anger? You wanted to say something?'",
        "'speaker_1': 'Is that what you were saying? No. Okay. All right. Great thing. Please cast your votes.'",
        "'speaker_3': 'Councilwoman Gonzalez. Motion carries a zero.'",
        "'speaker_1': 'Thank you. And a piece. Pacific is looking great. I mean, after this section is going to look even better. So that's great to see. 35.'",
        "'speaker_3': 'Item number 36, I believe we've already voted on 35.'",
        "'speaker_1': 'You're right, I'm 36.'",
        "'speaker_3': 'Report from Technology and Innovation in Long Beach. Gas and Oil. Recommendation to adopt resolution and execute a contract with Ernest Young for as needed technical support and integration services related to the city's customer care and billing, mobile workforce management and advanced metering infrastructure systems in an amount not to exceed 585,000 and increase appropriations in the Department of'"
    ],
    "Recommendation to request City Manager to provide a public briefing to Council on how the July 15th (and subsequent July 30th smaller event) major power outage was managed along with the types of communications received from SCE and also to provide updates to be discussed at the September 1st Council meeting.   The briefing should include the following:   \t The City's current plan - Natural Hazard Mitigation Plan - 2014;  \t Overview of Council and City department roles and  \t  responsibilities in a crisis, emergency or disaster;  \t Exploration of City and legislative staff emergency  \t  response training (ex. CERT, Search and Rescue, etc.)  \t  other than what is written in the City Manager's Emergency  \t  Contact Booklet and the City employee online emergency  \t  training; and  \t Technology and outreach - current protocols and possibilities  \t  for future improvements.": [
        "'speaker_3': 'New business item number 38, communications from Councilwoman Leena Gonzalez, Mayor Robert Garcia, Vice Mayor Susan Lowenthal and Council member Roberto Ringer. Recommendation to request City Manager to provide a public briefing on how the major power outage was managed, along with the types of communications received from SC.'",
        "'speaker_1': 'Councilwoman Gonzalez.'",
        "'speaker_0': 'Yes, I wanted to thank my council colleagues for joining me, Vice Mayor Sujatha Lowenthal and Councilmember Ranga and Councilmember Andrews as well for being a part of this. This, as many of you know in the city, was a significant event that we encountered.'",
        "'speaker_0': 'And although we will have a town hall this Saturday with some of our legislative representatives, I thought it was also important to bring something forward here at the city council level to understand the magnitude of what happened and also understand our current plans as it stands.'",
        "'speaker_0': 'So again, this is to review our natural hazard mitigation plan, an overview of our department roles as city council people, as staff members. You know, many of us have badges that say that we if a natural disaster, something happens, you know, we are the first ones that would be able to respond.'",
        "'speaker_0': 'So like some clarity on that and also exploration of, you know, some some of our amazing training opportunities that we already have and available. So cert, search and rescue and perhaps other training opportunities that our city staff could partake in, as well as technology and outreach.'",
        "'speaker_0': 'I think we did a great job on our end of getting out the information, but it'd be great to know what that is, you know, streamlined and all in one place, whether it's Twitter or our Long Beach city of Long Beach Facebook account.'",
        "'speaker_0': 'Nicole, how are our residents getting this information and how can we make it a little bit easier for people that may even not have technology so far through hotlines or anything else? So that's my information. I look forward for it to be coming back with with great information on how we can better serve our residents in this'",
        "'speaker_0': 'process. And I just want to thank our city staff again for everything that they've done. I received many phone calls through the extent the first district was hit the hardest, I think the worst in downtown. And so I just want to thank them for their diligence and their commitment to keeping us connected.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman, your anger. You second that motion.'",
        "'speaker_4': 'Yeah. I want to thank Councilmember Gonzalez for bringing this forward and look forward to the report.'",
        "'speaker_1': 'Vice Mayor Lowenthal.'",
        "'speaker_11': 'Thank you, Mr. Mayor. And I want to thank Councilmember Gonzales, Councilwoman Gonzales, for. Bringing this item forward and raising the topic. I think she said it best. The recent outages were extreme, extremely difficult for our residents and our businesses.'",
        "'speaker_11': 'And it I, I know none of us have seen anything like this before. What I can say is that it offered us a glimpse into the necessity for our city team and community partners to review our protocols against what really happens in a time of crisis.'",
        "'speaker_11': 'I am oddly, it's rather awkward to say how proud I am of our city staff because these are not circumstances that we want to ever experience. But having had that glimpse and having seen what what takes place, I know that I know what our team state is capable of.'",
        "'speaker_11': 'And I think we all recognize and acknowledge that we're fortunate that this was not a crisis brought about by a natural disaster. So is this one of those opportunities where we don't squander a crisis, where we look at this and figure out a way to do better?'",
        "'speaker_11': 'We know there's room for improvement, and from our conversations with Edison management, this experience has affected their own set of protocols and communications. And I think they've learned that our community expects different things and expects more and certainly expects communication.'",
        "'speaker_11': 'And that's not to say I'm less than proud of our overall effort. Our residents were tremendous. I think Councilwoman Gonzalez and I and others can attest how our residents have changed have come forward. The city team, the residents, your collaboration, persistence and use of social media to communicate with a broader community.'",
        "'speaker_11': 'I don't think I've ever seen us operate like this, and thankfully I didn't have to because of a crisis. But I'm I'm glad that we were able to demonstrate that level of organization. But having gone through this experience with constituents and the city staff alike, I'm really interested in hearing not only from staff, but also a city'",
        "'speaker_11': 'manager charged with disaster and emergency preparedness about what we did right and how we can improve on things that didn't go so well. I know we had daily conversations throughout the time of the outages and now that that is behind us, hopefully behind us, we can take this opportunity to review those and improve where we can.'",
        "'speaker_11': 'Thank you, Mr. Mayor.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_3': 'I, too, want to thank Councilwoman Gonzales for bringing forward this important item as a designated disaster service worker for ten years. And we take those responsibilities very seriously, and and we get a lot of online training for those opportunities should they arise.'",
        "'speaker_3': 'But to be able to also look at what which of those online trainings that are given to staff members throughout the region are available for the community to take free of charge. Or I know that through some of our library card opportunities and the new mobile app with Overdrive Media, there's been a lot of connectivity in those'",
        "'speaker_3': 'trainings being able to be given online through our library card holders. And so I think that those are some opportunities that technology has recently brought us that I hope that will come forth in this study. So thank you for bringing this forward and I look forward to the report.'",
        "'speaker_1': 'And thank you, Councilman Andrews.'",
        "'speaker_7': 'Yes. Thank you, Mayor. I also would like to thank Councilwoman Mina for bringing this forward and the other colleagues who signed on with it. I think this is just to give a chance to show our city how well we are equipped when things really kind of go a little bad and that was going bad.'",
        "'speaker_7': 'So thank all those individuals who jumped in and made Long Beach Finest what they're supposed to be doing. Thank you guys again. And thank you again, Lena, for bringing this forward.'",
        "'speaker_1': 'Thank you. And just to be clear, I'm very supportive of this. This is great. This will a report will come back from staff on the response that we a public report to the council. Per the item on September the first.'",
        "'speaker_1': 'And then it's also my understanding and I just want to make sure this is clear that the staff the council retreat that we're going to have in a few a month or so, a large chunk of that is going to be about disaster preparedness and emergency response citywide.'",
        "'speaker_1': 'And so I'm assuming there are things we discuss, a large chunk of that would be included in the retreat, but we would also have an update on the steps to the council. Is that is that correct?'",
        "'speaker_0': 'Yes. From what I understand, there will be some information at the retreat. I know myself I cannot attend. So that might be a little bit of a problem for me. But I mean, nonetheless, of course, the council can.'",
        "'speaker_4': 'Okay. Well, we'll get information.'",
        "'speaker_1': 'All right. We'll coordinate that then. Okay, great. Any public comment on the item? Please cast your votes.'",
        "'speaker_3': 'Motion carries, etc..'"
    ],
    "Recommendation to request City Manager to direct the Long Beach Health and Human Services Department, in partnership with the Police Department and other applicable departments, to create a citywide prescription drug stewardship program.": [
        "'speaker_1': 'Next item, please.'",
        "'speaker_3': 'Item number 39 Communications from Councilwoman Staci Mango, Councilwoman Lena Gonzalez, Council Member Darryl Supernova and Council Member Roberto Ringa. Recommendation to request city manager to direct the Long Beach Health and Human Services Department in partnership with the Police Department and other applicable excuse me departments to create a citywide prescription drug stewardship program.'",
        "'speaker_3': 'Yes. They had the great fortune of working closely with some of our neighboring public safety organizations that are volunteers. And there are a number of places throughout L.A. County where you can donate your prescription drugs that are expired or not expired, but not used.'",
        "'speaker_3': 'And with the research related to drug addiction and drug usage of individuals whose it's not their prescription and the success of previous drug drug donation drives where people can clean out their medicine cabinets here in Long Beach. I mean, it would be great if we had a more permanent location and to have those throughout the county, at'",
        "'speaker_3': 'sheriff stations and a few other locations, we we are starved for those locations here in Long Beach. And so I look forward to seeing the report back from the Health and Human Services Department with our police department to ensure that our neighbors have a constant place where they won't have to wait for the next annual cleanout, your'",
        "'speaker_3': 'medicine cabinet drug drop. Because as we all know, drug addiction is a major issue in the United States. And we need to do what we can to ensure that young people and those who are not intended to have prescription meds don't have access to them.'",
        "'speaker_3': 'So thank you very much for this and thank you for the colleagues who signed on. I'm really passionate about this issue, and I think it's it's a cornerstone of our our youth and their safety.'",
        "'speaker_1': 'Thank you. Is there any public comment on this item? Seen on the second day with Councilman Gonzales. Any comments or.'",
        "'speaker_0': 'Just wanted to say thank you, Councilman Mongo, for bringing this forward. This is really important for our seniors as well. So thank you.'",
        "'speaker_1': 'Please cast your votes.'",
        "'speaker_3': 'Councilman Austin. Motion carries seven zero.'",
        "'speaker_1': 'Okay. Now we're going to be going up for announcements. Is there any let me do the second public comment period here. Anyone that had a public comment for the second period. Please come forward. Go ahead.'"
    ]
}