{
    "Recommendation to:\n\n1.\tRequest the Health Department to lead an effort to meet with \n\tvarious stakeholders, including but not limited to, the Board of \n\tHealth and Human Services, marijuana business owners and \n\tcollective representatives, City Council offices, educational \n\tinstitutions, such as LBUSD, LBCC and CSULB, the Office of \n\tTraffic Safety, and any other interested agency to develop an \n\toutreach and education campaign to educate (1) Long Beach \n\tyouth on the consequences of youth marijuana use; (2) drivers \n\tregarding marijuana-impaired driving risks and consequences; \n\t(3) customers of the licensed marijuana dispensaries about the \n\tconsequences and risk of reselling or distributing medical \n\tmarijuana to minors or other individuals; and (4) parents on the \n\tsignificant role they play in effectively teaching their kids about \n\tmedical marijuana safety; \n\n2.\tRequest that the Business License Division work with the Health \n\tDepartment to develop best practices in terms of requiring an \n\teducational component for licensed marijuana dispensaries \n\tsuch as, \n\n\ta.\tCreating a st": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you. Item number 12, please.'",
        "'speaker_0': 'Item 12, Communication from Councilwoman Price. Councilwoman Gonzalez. Councilman Austin. And Vice Mayor Richardson. Recommendation to develop develop an outreach and education campaign regarding youth marijuana use and drug impaired driving.'",
        "'speaker_1': 'Councilwoman Price.'",
        "'speaker_10': 'Thank you, Mr. Vice Mayor. So I want to first thank my colleagues for signing on to this item with me. I believe this is a very important item because it's not going to allow the city to be very proactive in establishing some best practices moving forward.'",
        "'speaker_10': 'And I think it gives the city of Long Beach an opportunity to be a leader in the region in terms of partnership and collaboration between policymakers, law enforcement and leaders in the marijuana dispensary businesses. When we look at some of the outreach and education components that we've seen in other industries, let's say with alcohol, we see that'",
        "'speaker_10': 'a lot of the major manufacturers and and bars and places where alcohol is served have partnered in this concept of outreach and education by sharing messages, encouraging people to drink responsibly, being aware and mindful collectively that there are negative consequences associated with misuse of certain products and really coming together to come up with outreach and education that'",
        "'speaker_10': 'addresses those issues. So I think where we are with with marijuana, especially in the state of California and in the city of Long Beach, is is very much in its infancy stage in terms of outreach and education, in fact, at a statewide level.'",
        "'speaker_10': 'There are requirements with the passage of Prop 64 that there be outreach that come directed from the state in regards to requirements for the industry to have warnings for the youth and things of that nature that are contained in the health and safety code.'",
        "'speaker_10': 'And so those changes are coming. But to my knowledge, there have been no local jurisdictions, no municipalities that have taken a proactive approach to the issue of outreach and education. And that's the intent behind this item. The item isn't to be intrusive or force anyone to do anything.'",
        "'speaker_10': 'It's really an opportunity to extend the olive branch and say, can we work together to meet our common goals? And I say that with with full understanding and fully admitting that I have had and continue to have some concerns regarding the impact, if any, that rolling out this industry will have on our existing city resources, our ability'",
        "'speaker_10': 'to enforce license, etc.. Those remain concerns of mine. Having said that, I fully respect and appreciate the outcome of an election. And in fact, when residents have called me in the last weeks to say, is there going to be a dispensary on my street?'",
        "'speaker_10': 'As I've heard what I say to them, as this is what was voted into law. And I think we all need to be mindful that our new reality is one that came about as a result of the vote of the people.'",
        "'speaker_10': 'And I fully respect that. I think when there are differences of opinion on controversial issues, it's very, very important. And I make it my personal mission to try to find areas of commonality. And one thing I have found in studying this particular industry is that the owners of the businesses, the folks that are legitimate business owners who'",
        "'speaker_10': 'are attempting to operate within the law, understand, respect and appreciate the goals of being proactive when it comes to drug impaired driving education and youth access. I think those individuals have shared with me repeatedly that they want to partner with the city in those efforts and in those endeavors and from the states that have participated in legislation'",
        "'speaker_10': 'that has decriminalized marijuana, Washington and Colorado. In my conversations with law enforcement officials in those states and staff who works for the Department of Transportation in those states. One of the things that I've been told repeatedly is that the one lesson that they learned that they wish they would have done differently is come to the table earlier'",
        "'speaker_10': 'with the marijuana industry to establish best practices. One example is that, you know, the state of Colorado, the Department of Transportation, came up with a series of public service announcements and they started broadcasting them, and they did so without coming to the table with the other stakeholders, namely the marijuana business owners.'",
        "'speaker_10': 'And one of the ads was found to be very offensive to users of marijuana. The portrayal and you can see it on YouTube, just marijuana, barbecue. Those are the keywords that you can type in to YouTube and you can see it.'",
        "'speaker_10': 'But there was a. Portrayal of a man attempting to, you know, basically fire up a barbecue under the influence of marijuana. And the gist of the PSA was, you know, trying to barbecue your food under the influence of marijuana is legal.'",
        "'speaker_10': 'Driving while under the influence of marijuana is not. And what happened with that ad is it was very funny, but the marijuana industry and the users found it to be very offensive. They felt that it portrayed the users in a very negative light.'",
        "'speaker_10': 'So the state actually had to pull back that ad and had wasted a lot of resources in creating the ad and marketing the ad. So my hope is that this is not one of those functions. There are several functions that the state has that are exclusive to the state.'",
        "'speaker_10': 'A regulatory functions that are exclusive to the state. Education and outreach in the area of marijuana use is not something that is. Limited to the state. Local jurisdictions can get involved in establishing best practices for the marijuana industry.'",
        "'speaker_10': 'And so the intent behind this item is for us to work with our health department. And I know that Kelly Collopy is here. I see her in the audience. I've talked with her quite a bit about this item.'",
        "'speaker_10': 'I think she understands the intent behind it, and I'm happy to answer any questions about the intent. But the intent is really to bring everybody to the table, make sure that everyone is on the same page in regards to the content of education and outreach for two simple objectives.'",
        "'speaker_10': 'And the first is to try to encourage educate the youth about the chronic use of marijuana on the developing brain, the adolescent brain, and and also to encourage their parents or teach their parents safe access. If marijuana is being used or disseminated to the children for a drug or medical drug and to educate people that driving under'",
        "'speaker_10': 'the influence of marijuana can be dangerous and can have negative effects. The state of Colorado has seen its pre the passage of recreational marijuana. 15% of drivers that were stopped at a roadside checkpoint were found to be under the influence of marijuana.'",
        "'speaker_10': 'Now that number is between 35 to 40%. So they've definitely seen a rise. And when you ask them, what would you have done differently, they would have said we would have come to the table earlier with the marijuana industry to figure out how we can do a better job of educating and providing warnings.'",
        "'speaker_10': 'So that's the intent behind the item. And I'm one of the things that I've heard is since I introduced the item, I did reach out to the Long Beach Collective Association, who has honestly been fantastic. They gave us some recommendations for how we can improve the item and we included some language in there specifically at their request'",
        "'speaker_10': '. And I am told that they're actually working actively with the city right now to help the city become to help the city with potential opportunities for education and outreach in regards to future funding. So for any marijuana business owners who, you know, have not been part of that discussion, who are out there either listening to this or'",
        "'speaker_10': 'in the audience, please let us know if you haven't been part of that discussion, because we would like you to be part of that discussion as we develop the content and the outreach. And that's basically the the intent behind it.'",
        "'speaker_10': 'As our city manager often says, this item is not meant to be a contentious one. It's motherhood and apple pie because it's designed to talk about how we can do a better job working together to address common goals that we all have, which is safe access, education, and fewer DUIs.'",
        "'speaker_10': 'In terms of what we can control here as a local municipality. So again, I want to thank my colleagues for signing on to this item with me. What I would like to see when staff comes back in regards to an update is, is on behalf of the city attorney's office to what is permissible in terms of the'",
        "'speaker_10': 'city's working in partnership with the dispensaries to develop guidelines and practices. If we were to provide these items together and they voluntarily disseminated them at the dispensary, certainly that would be allowable. Can we request that? Can the state of Colorado and I'm not sure if the state required this or if the dispensaries agreed to do it, but'",
        "'speaker_10': 'the dispensaries have really partnered with the local government in terms of outreach and education. They have, for example, in one situation there's a video game that plays a short video about drug impairment. And if the player of the video game answers the questions that come along with that message correctly, then they get a free video game.'",
        "'speaker_10': 'It's actually a video game machine in the dispensary. To what extent that's feasible in our dispensaries, really? I guess that depends on the dispensary, the size of the dispensary, the willingness of the owner to partner with the city.'",
        "'speaker_10': 'But I can tell you as one policymaker here in the city that efforts to partner with the city on things that are important to all of us goes a long way. And I'm certainly hopeful that the people who plan to operate in the city take the responsibility that we all have for public safety very seriously and partner'",
        "'speaker_10': 'with us to the extent possible in terms of outreach and education. So that's the intent behind the item. And and finally, it's going to take a little bit of seed money to start this. I know that our health department is going to be pursuing a grant, and I'm hopeful that they get the grant.'",
        "'speaker_10': 'But I think that a successful education and outreach campaign that can last the city many, many years can be done from with 50 to $100000. And so I would ask as part of this motion that the city manager identify one time funds that can be used for education and.'",
        "'speaker_10': 'Outreach that can be used for years to come in the area of drug impaired driving and youth access or adolescent use of marijuana.'",
        "'speaker_1': 'Thank you. I'll add my comments here and and go through the list. But Councilwoman Pryce, I just want to say thank you for asking me to come join you on this on this motion. And, you know, on this issue, we've seen a lot of, I don't know, conflict on the council about the right thing to do.'",
        "'speaker_1': 'But on this specific issue, I agree with you 100%. As as we move forward, new new terrain, new territory. And I know we've seen different iterations of medical medical cannabis in Long Beach. What hasn't changed is everyone's commitment to youth and to and to public safety.'",
        "'speaker_1': 'And in our conversations with the proponents, in our conversation with staff and public safety, it's always been guided from a lens of how do we protect our kids? How do we protect public safety? And I do believe education is the key.'",
        "'speaker_1': 'I think, you know, and I've said this before, I do believe in collaboration and leadership. And I'm asking, you know, that, you know, the the industry really step up here. And and I know that they will and step up.'",
        "'speaker_1': 'And we're looking for more collaboration and more leadership, particularly on this issue. And I know that with the measure in May, the council supported a measure that was, you know, in in the language. We encouraged that that funding to be directed to the health department with, you know, one element of that would be education.'",
        "'speaker_1': 'So we certainly want to make sure that that happened. And I know that our health department has already taken some steps to begin crafting and scoping what that could look like. I like the part of the recommendation about funding to get started one time funding.'",
        "'speaker_1': 'I see it a little bit differently. I see it more so as like gap funding until gap funding until the measure m a funding comes together. But I think the best thing to do is just look at how the city manager look at where those options are and to have the health department continue what they're already doing'",
        "'speaker_1': 'in terms of education. But but I'll say I think you're on the right this is the right direction, and I wholeheartedly support it. Councilman Austin.'",
        "'speaker_9': 'Thank you. And I want to speak and my support to this item as well. And I think thank you, Susan Price, for for bringing this forward. As chair of our public safety committee with somebody who is also somebody who's very, very astute and attuned to to this issue from a public safety perspective, this is a new day'",
        "'speaker_9': 'in the city of Long Beach and in the state of California. The voters have spoken loud and clear on a statewide level, as well as the local level. And I'm I'm glad. I mean, we mentioned that there was a lot of disagreement in terms of how we get there on the council, that sometimes the residents get it'",
        "'speaker_9': 'right for us. And so I'm glad that that that item actually went to the ballot. And we have clear intent of the voters. This is a no brainer for me. This is a proactive this is a responsible approach.'",
        "'speaker_9': 'We have done proactive, responsible public policy and governance around all kinds of issues, similar through Matt and other campaigns, to discourage youth from smoking and drinking and doing things that are going to harm them. And so this is, like I said, a very, very much a no brainer.'",
        "'speaker_9': 'And it should be done here on a local level because we have a local ordinance that that that that went to the voters. And so I will be supporting this wholeheartedly. I think the intent is to we don't know what the best practices are.'",
        "'speaker_9': 'And so this is an opportunity for Long Beach to establish some best practices in governance and, you know, be a leader in the state. And so I'm supportive of this idea. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_4': 'Yes. Thank you. I'll also be.'",
        "'speaker_10': 'Lending my name to support this as well. I think if anybody knows.'",
        "'speaker_4': 'This arena, I would say.'",
        "'speaker_10': 'Councilwoman Pryce certainly does.'",
        "'speaker_4': 'And what's great about this, as we've talked.'",
        "'speaker_10': 'About, is that we can be collaborative in a sense, to educate our, you know, the public to ensure that they.'",
        "'speaker_4': 'Are well informed with the the.'",
        "'speaker_10': 'Risks.'",
        "'speaker_4': 'And also just educate educated about what to do here in the city of Long Beach, especially.'",
        "'speaker_10': 'When it comes to our.'",
        "'speaker_7': 'Youth.'",
        "'speaker_10': 'And so I look forward to hearing more about.'",
        "'speaker_4': 'What specific grants we could obtain. Also, just clarifying, because I know some of the language is already.'",
        "'speaker_10': 'Already in the measures. So I know this emphasizes and reemphasize is what will we'll be doing in terms of awareness.'",
        "'speaker_4': 'And I look forward to hearing more in the next six months. Thank you very much.'",
        "'speaker_1': 'Thank you, Councilwoman Pierce.'",
        "'speaker_5': 'Yes. Thank you so much, Councilmember Price, Richardson, Gonzalez and Austin for putting this together. Of course, it's a no brainer. We want to make sure that we're working really hard to engage as many people as possible in educating them on safe practices.'",
        "'speaker_5': 'And so I commend you, Susie, for all the work that you've done on this. You guys have done a lot of research on here. Can you guys hear me? Yeah. Okay. So I did have a couple of I appreciated your comments and wanted to just clarify with the city attorney on a couple of things.'",
        "'speaker_5': 'You had mentioned, Suzy, that you had said that you didn't want this to be a requirement laid on top or something, forcing them to do this. It's the way that it's written right now. Is that a requirement or would I need to clarify if we wanted to tease out having this to be a incentive program?'",
        "'speaker_11': 'Well if mayor members of council Councilmember Pearce the I think what the council member Pryce mentioned is correct, that this was a voter initiative. And if you make it or attempt to make it a requirement, then I think you run afoul of trying to amend the ordinance as adopted by the voters.'",
        "'speaker_11': 'And so the way I understand the intent of the motion, not that this would be a collaborative effort in working with them to get those items that we can agree on in that they will voluntarily do. There would not be an enforcement mechanism coming out of this policy, if I understand the motion correctly.'",
        "'speaker_11': 'So it would be it would be to work with them on education, which clearly the city could do with or without the dispensaries. They could put it on the website, they could put out educational material. And then that other component that was discussed on working with them would be a voluntary component.'",
        "'speaker_5': 'And if there were dispensaries that participated in an education drive, would there could we add a a page on our website that says these dispensaries are participating in the city drug education component?'",
        "'speaker_11': 'Yes, you could certainly look at that as part of the program or some sort of an incentive program and bring that back at any time. That's correct. But that's not a part of this motion.'",
        "'speaker_5': 'That's not a part of this motion. Okay. That's helpful for me. The second part I wanted to address is just the fact that it says that, you know, creating a sticker and that already is in. Mm. So we an incentive sticker maybe it would be an opportunity for us to say here's the top folks that are participating'",
        "'speaker_5': '. And the second piece is the training session video. I would love as we're exploring best practices with, you know, some of the alcohol education drives, including our parks and rec people that are engaging with our youth at our parks.'",
        "'speaker_5': 'I know Bixby Park, we have hundreds of kids in there every day ensuring that it's not just on parents or teachers, but people that they interface with on a regular basis would be something that I'd want to ensure we look at.'",
        "'speaker_5': 'And then I just wanted to flag one other thing. When we look at the studies that were pulling this out of I know that there isn't a best practice yet for marijuana education, but there are best practices for alcohol, for narcotics and everything else and really trying to pick the best of the best.'",
        "'speaker_5': 'I believe one of the studies that's mentioned in here is the Every 15 minutes program, which there's several studies that came out afterwards saying that while it raised awareness, it didn't it wasn't rooted in changing behaviors. And so as we're looking at best practices, if we can really make sure that we're looking at education programs that help'",
        "'speaker_5': 'change behaviors. So it's not just a a feel good we spent all this money on education, but that we're reducing the amount of drug intake or we're actually reducing the amount of people that are driving under the influence.'",
        "'speaker_5': 'So with that, I would like to make a friendly amendment. If council member will accept it to direct staff, to look at a incentive program that would say that if they participated in this program, everything from the videos, the trainings, that we would then create a sticker that they could put on their door, their window to say'",
        "'speaker_5': ', we also participate in educating our youth, or we're a member of the Long Beach City Education Drive and that those businesses be listed on the city website so that we can really highlight those that are trying to go forth and and do one additional step.'",
        "'speaker_5': 'Would you accept.'",
        "'speaker_4': 'That? Absolutely.'",
        "'speaker_10': 'I think that's fantastic.'",
        "'speaker_1': 'Fantastic. Thank you. Councilman Andrews?'",
        "'speaker_3': 'Yes, fine. Thank you. My summer, I think, for the first time that Susan and Mrs. Price, you know, I listen to a lot of things that I know it's going to take a long time. But this time I didn't mind taking the long time because you hit it.'",
        "'speaker_3': 'I think you hit this you hit this one on the nose, Mrs. Price, because the fact that you're working with the collaborators on this and, you know, you didn't just go out there and just down the cross by yourself, but you have people behind you on this.'",
        "'speaker_3': 'And I think everyone needs to be educated when there's a project going. That's a situation where we need to be educated and you let us know that we can work together. And by doing that, I think the people that we're going to, you know, be working with, with these are the dispensaries.'",
        "'speaker_3': 'I think that they're in agreeance also because, you know, I don't care how much education you we basically do with our kids or anyone else. You know, education basically to me, I think comes from the home. You know, we can tell our kids anything we want to tell them.'",
        "'speaker_3': 'But, you know, it starts at the home. And I think you guys, you have to understand this. This is great that you have this. And I think this is going to be good for all of us. But I think now we decided we're going to work together.'",
        "'speaker_3': 'And this is the first time I've ever seen you up here doing this and I think is going to work and we're going to get this thing moving forward and get it out of the way. Thank you, Mrs. Price, for not even asking me to be on this, but I put myself on it.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_10': 'I think that was a compliment. I'm sure I will say I have no problem dying on the street if I think it's the right thing to do. So that is my personality. But with this issue, I again, I think finding where.'",
        "'speaker_1': 'You have the floor. So go for it.'",
        "'speaker_10': 'Yeah, sorry. I saw that I was up, so.'",
        "'speaker_3': 'It's.'",
        "'speaker_10': 'Fine. I think that on this one where we can find commonality on a controversial issue, that's a win win for everyone. I will say I really like the recommendation that Councilwoman Pearce just mentioned about the incentive program. You know, one of the things that this is a little bit analogous to is some of the efforts of our'",
        "'speaker_10': 'bar owners to collaborate. So I know that we have informal groups of bar owners on Second Street, for example, who set expectations and standards on themselves above and beyond anything the city would ever ask them to do. For example, they have a dress code policy.'",
        "'speaker_10': 'They have they will sign up their employees to take a class through ABC for responsible service of alcohol. And these are things the city doesn't require them to do, but they do it anyway. And I know they do it because they tell me they do it because they're in my district and they want me to know that'",
        "'speaker_10': 'they are taking efforts to to address public safety. And so so I like that and I'm looking for things like that in the spirit of collaboration, if we're requiring somebody to say, you know what, driving while impaired under the influence of a drug can be dangerous, and they're only doing it because they're required to do it.'",
        "'speaker_10': 'Then I think it's really disingenuous for them to say they're partners with the city. I mean, honestly, if you really if you're going to get in this business, then let's do it responsibly. Let's do it together. And let's not be in a situation where Colorado has been where they've seen their DUI numbers double because they weren't proactive'",
        "'speaker_10': '. So let's do that. And in regards to every 15 minutes I participate in every 15 minutes. I've been doing it for 11 years now and every quarter I participate in every 15 minutes. And I can tell you, if we were able to develop an educational campaign like every 15 minutes for alcohol, it would be very, very impactful'",
        "'speaker_10': '. I can't tell you how many kids write me letters after I do an every 15 minutes program and tell me that the presentation changed their lives. So I don't know what studies Councilman Pearce is referring to, but the California Office of Traffic Safety has been funding the every 15 minutes program for two decades.'",
        "'speaker_10': 'And my personal experience, I'd love to see the studies, but my personal experiences, I do it four times a year, have been doing it four times a year for over ten years, and it's incredibly impactful. The kids often say that it's changed their lives forever.'",
        "'speaker_10': 'So if we could do something like that for marijuana and and really get the staffing together to do it or get law enforcement agencies in the region to participate in it, I think it would be fantastic. And that's kind of what I was thinking of when I came up with the with the idea.'",
        "'speaker_3': 'So thank you, Mrs. Price, for taking and carrying it on. I just thought maybe that was my idea, but that's okay. That's it, right? That's it.'",
        "'speaker_1': 'All right, let's get back some control of this meeting. Councilwoman Mongeau, please.'",
        "'speaker_4': 'So just a thought I may have misunderstood. So maybe, perhaps Councilwoman Pearce could give me a lift. We want.'",
        "'speaker_7': 'To.'",
        "'speaker_4': 'Put a list of marijuana dispensary owners on the city website. If they meet a criteria. I would like us not to put any marijuana dispensary businesses on our website. I don't want to. I know that there are lots of businesses in my district that do a lot in the compliance.'",
        "'speaker_5': 'Area, whether they're dry cleaners.'",
        "'speaker_4': 'Who work out into the community to clean up the community and so on and so forth. And I just would love to not pick one industry to feature on the city website.'",
        "'speaker_5': 'So what my item, what my friendly is asking them to come back with an incentive proposal. Okay. So it might not be that that item hopefully will be listed as an option and we can have a discussion in the next six months about what an incentive program looks like for Long Beach.'",
        "'speaker_5': 'Okay. You know, I was toying with the idea like it's a business license is like, how do you get businesses to step up and do something more? You know, and part of that is saying, here's somebody that and I know, you know, having had lots of conversations about what education looks like, what a big what a good'",
        "'speaker_5': 'business owner in this industry looks like. And it's one that goes to neighborhood association meetings. It's one that participates, that participates with startup and everything else. And so how are we really creating an additional thing where if we are asking parents to be educated on safe use and we are asking youth and teachers to be educated on'",
        "'speaker_5': 'safe youth use, I would rather direct them to somebody that has had their staff trained in those areas than one that hasn't. And so how do we you know that that's part of the discussion.'",
        "'speaker_4': 'It's a balance. So I appreciate that. I look forward to the discussion when it returns. I want to be mindful that we are working really hard to put together an incentive program for good landlords. We're looking to put together an incentive program for a lot of things, and our city website is one that is already.'",
        "'speaker_4': 'According to neighbors, difficult to navigate sometimes not because it's not well laid out. Our new website is very well laid out. This is just a very large city with a lot of information and a lot of businesses and a lot of city departments and a lot of people to reach out to.'",
        "'speaker_4': 'So I just want to be mindful of if we're going to go down this route with one business, let's make sure there's a best practice or a business industry. Let's make sure there's a best practice related to it because you could get into the same types of things with here are the shopping centers that have more safe'",
        "'speaker_4': 'parking than others. And here, I mean, it just could go a long way. So just to keep that in mind for the staff's perspective. Thank you. And I'm excited to support this item.'",
        "'speaker_1': 'Thank you. What a great conversation. Let's open it up to the public. Public comment. Is there any public comment on this item? Just go ahead and line up and we have 3 minutes. Go ahead, state your name and you have 3 minutes.'",
        "'speaker_9': 'My name is Victoria Marshall. First gave an honor to God. I'm a medical marijuana patient and I use marijuana because I had a car accident that I had to get my jaw. Basically, I had to have orange bars put on the air to realign my jaw and different things of that nature.'",
        "'speaker_9': 'And they provided me with narcotics that made me more impaired where I could not take care of my child physically. So I turned towards marijuana to help me with that. Now, a couple of years back, Long Beach had Miracle Metal medical marijuana dispensaries here.'",
        "'speaker_9': 'But you guys start right now, for whatever reason, saying it was federal, state, whichever reason. But in that way, patients and people that was working there were getting arrested, getting brought up on charges, having to flee out or whatever the case may be.'",
        "'speaker_9': 'So how is it that the dispensaries and also the patients supposed to trust a city that they said will protect us but also use it against us? So I don't want to be one of them, one that is inside the dispensary.'",
        "'speaker_9': 'When you guys turn around and say, okay, we don't want you guys in our city no more, we're going to say that we don't recognize you as a business. And then when they get raided. You guys turn your head.'",
        "'speaker_9': 'But you know, the patients are being arrested behind is. So are you guys going to turn around and say, we're for it one minute and then against it? Because you're not liking how the dispensaries are running their dispensary because it is optional, like you guys said.'",
        "'speaker_9': 'But if they're not complying with certain things that I feel are, you know, educational, would you guys turn around and say, okay, we're not going to recognize you as a business anymore? Those are things that maybe also you need to look at because I'm concerned as a patient that I could be incarcerated for wanting to get my'",
        "'speaker_9': 'medication that helps me with my severe pain that I will have for the rest of my life. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Hello. My name is Joanne Freeman and I have a comment. Okay. I understand that the marijuana is being used for medical purposes. What about the issue of when I'm sitting at the bus stop or.'",
        "'speaker_8': 'When I'm.'",
        "'speaker_7': 'Over? Just throwing this out here as an example. Visiting. Okay. A friend of mine's that apartment. It doesn't happen in my complex. Sometimes it does. You smell it? Okay. You know, just like secondhand smoking is not good for you.'",
        "'speaker_7': 'What about that? What about the second hand smoke of smelling the marijuana and and having to go to another bus stop or or go to another train station because it's there in your face? I would like you all to look at what to do and come up with some kind of, I don't know, idea about ordinances or'",
        "'speaker_7': ', you know, cameras or I don't know. It's it's just awful if you do not. And these are some of the some of the people who are doing this are minors. You know, they're just sitting there rolling it up, you know, and it's just just trying to nip the but, you know, before it gets really, really out of'",
        "'speaker_7': 'hand. Thank you.'",
        "'speaker_1': 'Thank you. We're all trying to nip the but. Next speaker, please.'",
        "'speaker_7': 'How did that about?'",
        "'speaker_8': 'Very good. I go back to what I've always said in terms of medical marijuana. First of all, the medical marijuana card is as easy to get as a promise from an electric, you know, politician and during election time period.'",
        "'speaker_8': 'If we're going to have medical marijuana, we have one location for that. And that location is on the top floor of the Long Beach Police Department. Period. All right. If there are that many people that want to try it.'",
        "'speaker_8': 'What it tells me, aside from the medical marijuana issue. We don't have, although the city has a number of them, we need to triple the number of sports programs, period. I interface with very large numbers of people in various different sports.'",
        "'speaker_8': 'From. Junior high all the way up to college and beyond. I've never come across any of them involved in that. And so of course there's an is a life issue there and something's drastically wrong if we need that much, if our marijuana demand is so great that we need a a marijuana shop on every other corner.'",
        "'speaker_8': 'Secondly. What I'm going to suggest is that to control the. Use of it. Is that? The. Permit only be issued to people. That are in buildings. That have a positive track record and you have not had a record of attracting bad elements, period.'",
        "'speaker_8': 'And go after the landlord. And I'll use the specific example of the one that owns the grinding exit and the building next door. It's my understanding that they want to. I've heard from credible sources what I think is credible source that they the vacant building wants to be used as a medical marijuana place.'",
        "'speaker_8': 'Absolutely not. They've demonstrated with absolute clarity that they are not responsible landlords, period. And I'm sure we might find other people. So that's a litmus test that you use on this very face period. A again, to go back, we have one dispensary and that's on the top floor, the longest police department.'",
        "'speaker_8': 'Two. Let's double the number of sports programs and three. Under no circumstances give a permit to a property owner who has leased it out or owned a building that has never been notorious in terms of problematic. In other ways.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. Next speaker, please. If all the speakers could line up so we know how many speakers we have, please go ahead and continue.'",
        "'speaker_8': 'Hi, my name's Stephanie Morrison Sewell, second district resident. The specific educational components suggested by Councilwoman Price in this measure are all presently covered in the dispensary application process for Measure. Mm. I know this because I'm presently working on two of them down to the stickers, down to the youth interdiction programs.'",
        "'speaker_8': 'Those are all outlined specifically, and we'll be awarded points if they if the applicant cannot display them in their operating plan and security plans. That this leads me to believe within my professional opinion that Councilwoman Price is instead trying to use this legislation in order to find it legal, in order to establish a legal finding either for'",
        "'speaker_8': 'nuisance activity or, as the present is, marijuana establishing marijuana as a direct threat to public health. Something now for a form is a first step towards future targeted regulations against dispensaries. This is the same legal strategy of using land use policies that opponents of abortion use at collaterally tax clinics after their constitutionality was established by the Supreme'",
        "'speaker_8': 'Court. The findings of councilwoman it is attempting to use are themselves this or the are themselves a discriminatory and reprehensible policy by declaring, despite evidence to the contrary, that marijuana duties are an immediate threat to public safety. She's laying down the legal and political precedent needed to justify an increase in staffing levels to the police, as well'",
        "'speaker_8': 'as further use of racially discriminatory checkpoints, all under the pretext of preventing DUIs. The studies cited by Councilwoman Rafael Price, within the context of this particular measure, actually show a decrease in teen use in legal states. This has been done both by the National Drug and after the NRA, as well as the Colorado state government.'",
        "'speaker_8': 'Within that defined some of the more recent findings, marijuana use in the past month among eighth graders has dropped significantly in 2016, from five down to 5.4%, from 6.5% in 2015. Daily use among eighth graders has dropped in 2016 2.7%, 4.11%.'",
        "'speaker_8': 'And in 2015, among high school seniors, 22.5% reported marijuana use in the past month and 6% daily use. Both measures remain relatively stable and legal states from 2015 rates of marijuana use in the past. Use among 10th graders also remain stable compared to 2015, but are their lowest level in over two decades.'",
        "'speaker_8': 'What we're finding out is that marijuana use in legal states, marijuana use is remaining flat. Meanwhile, tobacco use and alcohol use to actual deadly drugs are falling down in that in the same in those same respects. That could be, again, a collateral, a court and correlative effect.'",
        "'speaker_8': 'But if anything, if there is a cause and effect right now, perhaps licensing more of these establishments would be a good idea. Frankly, if we want the Health Department to be taking a more proactive use of this, I highly recommend that they actually start issuing the county cards to provide medical marijuana for medical marijuana patients.'",
        "'speaker_8': 'As this right now, this provides me as a parent, parental rights prevents the district attorney from taking away my child or anybody else on the basis of purely being a marijuana user. Thank you. If you want many.'",
        "'speaker_1': 'Parents, thank you. We have to be respectful of the line. But thank you. I think, Diana, you were the next. Okay. All right. Let's continue, please.'",
        "'speaker_8': 'Hi. My name is Nick Moreau. I'm a retired deputy sheriff and narcotics detective. I'm a resident property owner in the fourth district. I'm a court qualified expert witness dealing with drugs, drug use, DUI, cannabis, both illicit and medical.'",
        "'speaker_8': 'I'm on a National Institutes of Health study, a National Institute of Drug Abuse study on cannabis health, young adults, and a lot of the information that that gets put out. It's a five year study that we're about to renew.'",
        "'speaker_8': 'We're talking about education. We're talking about training. What we need to do is we need to keep the emotion, keep the agenda, and keeping the old inaccurate information out of the training programs. Law enforcement has had problems with training being decades old and not built upon.'",
        "'speaker_8': 'We've had a lot of a lot of studies. We talk about Colorado, Colorado, before they legalize marijuana. They did a they basically buried the community in. Field sobriety, checkpoint warnings, public public service announcements. They let the entire population of Colorado know that they were going to come after them.'",
        "'speaker_8': 'Law enforcement was going to be trained better. Law enforcement was going to be out there looking for it. And the results of that 2014 to 2015 were 1000 fewer DUI arrests overall, with nine additional from the previous year marijuana, DUIs.'",
        "'speaker_3': 'That's an that's an amazing achievement. Now, the population.'",
        "'speaker_8': 'Of Colorado fits neatly into the county of Los Angeles. So if we had a program in the city of Long Beach that was as effective as the Colorado thing, we would be shown as the forerunner. With that training, with those policies.'",
        "'speaker_8': 'What what I'd like to urge the council and urge anybody that's involved in the training is please any information that's over five years old. Please throw it in the trash can and start learning. The National Institutes of or the National Academy of Sciences just released a 300 page report that went over 10,000 different study, different scientific studies'",
        "'speaker_8': ', and came up with a whole lot of conclusions that are exactly opposite of what we're teaching our police officers, what we're teaching our kids in school. So I'm offering my services. I was also on the Medical Cannabis Task Force, actually, both of them my my offer to to use my expertize or the resources that I have at'",
        "'speaker_8': 'my disposal. I would love to be involved in this training program and really not pay lip service to doing to making Long Beach a focal point. I'd really like to have Long Beach be the example that the rest of the state follows with responsible regulation.'",
        "'speaker_8': 'We've been screwing it up for the last decade, and the reason why the voters voted for what they did is because the people that stood up here failed them. And that's why we have the situation we have today.'",
        "'speaker_8': 'That's why Prop 64 passed. That's why MRC was put into effect. So that whole momentum is moving towards. Thank you, sir. So thank you much for your time.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Thank you. That we are having this discussion in an academic. Way that we having this discussion in this chamber. Is a testament of the darkness that is covering this world in this city. I'm looking at, ladies and gentlemen, who are who have been given by your voters, your constituents, voice, voice and legal authority here.'",
        "'speaker_7': 'But I'm also speaking to those with ears to hear, because you belong to the body of Christ in the church of Jesus Christ. Listen to me. If you have an ear to hear. It's getting dark now. Now we are discussing a way to make money.'",
        "'speaker_7': 'After the very, very thing that when Ronald Reagan, Reagan Democrats or Republicans, if you're in the House and Nancy said, just say no. We all nodded our heads and approved with her. And now we having this discussion. And I sat in front of a 21 year old whose mother, L.A. County deputy sheriff, sat in front of me'",
        "'speaker_7': 'and said marijuana was the gateway to now I'm a heroin addict now and I cannot help myself. Now we're having this discussion. If some of you your conscience just don't bother you yet. And darkness is covered. You now.'",
        "'speaker_7': 'And I understand. Some may still believe that there's a separation of church and state. But there is no separation. Some of us know it. And Jesus says, When I return, will I find faith anywhere in the earth? Will there be any faith anywhere in the earth?'",
        "'speaker_7': 'When I return. And the darkness is covering us now. When we can't open a shelter for the homeless. But we can sit here tonight and discuss ways, implementing stickers and tags on the windows, bumper stickers. The money that we are willing to pour into this immediately.'",
        "'speaker_7': 'And you can help your homeless. Don't you see the darkness is covering? Can you not see it? Do you not feel it? Hebrews says there is no authority accepted be given of God. And our chief said out of his own mouth that we don't have the officers to cover when those who are don't mean us any good'",
        "'speaker_7': 'start opening their own shops. We can't cover it. We don't have the officers. But we went over his head and we're doing it anyway. It is a testament against us as a city.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Adam Giles I'm.'",
        "'speaker_6': 'With the board of directors for the Long Beach Collective.'",
        "'speaker_3': 'Association. Good evening, Honorable Vice Mayor. City Council and City Attorney's Office on behalf of the Long Beach Collective Association. We wanted to thank you all and Councilwoman Price for bringing this educational item forward.'",
        "'speaker_8': 'We are taking proactive steps on an educational campaign to the public as a whole.'",
        "'speaker_3': 'Especially as the laws are being implemented and safe access is being restored in Long Beach.'",
        "'speaker_8': 'We are excited to work with the City Health Department and other stakeholders to.'",
        "'speaker_3': 'Roll out this program. We're in complete support of this item and if there are any questions or concerns were available to help answer those questions at any time.'",
        "'speaker_8': 'And once again, we want to thank you guys for this item.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Hi. My name is. My name is Ramon. I'm in District five. I have very little knowledge of this subject. I have not smoked any of this stuff. One guy up there. He wanted me to say that something about there's a county card and that people should issue the county card so parents can so parents can have parental'",
        "'speaker_8': 'rights. I don't know what that means, but you have that. I've I've worked all my life in the the black world, the top secret world, all that type of stuff. And I've never had an opportunity to do all this stuff.'",
        "'speaker_8': 'I've also been an athlete, never had an opportunity. Every time I get drug tested, so it's impossible. So I'd just like to have everybody else have the opportunity that I never had. But one of the important things, I have a lot of friends who are police officers and in intelligence, and I would really they have a lot'",
        "'speaker_8': 'of knowledge in this area, believe it or not. And I would like to at least give them a little kudos to hopefully get them involved with some of the. Any mentoring programs or learning programs that you have? I'm really high on police officers and and getting them involved as well because they know.'",
        "'speaker_8': 'Trust me, they see all these guys all the time. The next recommendation I have, I have this friend, Tony. He's like a walking laboratory. He can tell you anything that he wants. He's way better than any psychiatrist. I know that.'",
        "'speaker_8': 'I'm just joking, but. Miss Pierce. Great. It looks like it's a great thing, you know, whatever you have here. So I support it. I think, you know.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening again. Diana la logins. First of all, I would like to applaud your transitioning here from a very failed criminal issue to the Health Department. My concern in the first area is you're saying owners, collectives, you know, health department, etc..'",
        "'speaker_4': 'But again, you're not involving anyone that's actually a patient. You know, they're here. They're more involved than just about anyone. So that does need to be be included. So I would appreciate that. The the thing that concerns me the most is it it tends to continue the demonization of marijuana instead of there's a whole lot of statistics'",
        "'speaker_4': 'out on how many of the other, shall we say, drugs are available, create deaths. Alcohol creates 88,000 deaths per year. Opioids, 27,000 deaths. All total. Pharmaceuticals, 55,000 deaths. Tobacco is the worst one of all. 48 excuse me, 480,000 deaths per year.'",
        "'speaker_4': 'But yet we're just focusing on marijuana. Now, I think I agree. I think there should be some some education in this. So I'm I'm all actually, I'm on board here. However, I think it needs to be across the board.'",
        "'speaker_4': 'Let's include all of these people because, you know, liquid drugs is is far more dangerous. And there have been no deaths, no known deaths from marijuana. So I would suggest that you get over the reefer madness and address the entirety of the situation.'",
        "'speaker_4': 'And I would like to see all of the entities that, you know, whatever it happens to be, whether it's cigarets or whatever, it should be all inclusive. It's not just and I and I can understand how, you know, how education can help in many, many, many areas.'",
        "'speaker_4': 'Okay. And I do believe that because I've been working on this for 20 years to and and, by the way, to address this young lady who was speaking about God, God doesn't make mistakes. No one should go to jail for a plant.'",
        "'speaker_4': 'And in that vein, the PD does need a little attitude adjustment attitude adjustment classes on the the issue. And so perhaps if you could include that, that would be a big help to everyone. Thank you very much. And I do support this with a few additions.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Seeing no further public comment members, please cast your vote.'"
    ],
    "Recommendation to adopt resolutions authorizing City Manager, or designee, to submit two grant applications to the California Youth Soccer and Recreation Development Grant Program, offered by the State of California Department of Parks and Recreation, Office of Grants and Local Services, for the Seaside Park Artificial Turf Sports Field Conversion Project (Seaside Park Project), and Phase 2 of the Ed Pops Davenport Park Sports Field and Recreation Project (Davenport Park Project); accept, if awarded, California Youth Soccer and Recreation Development Grant Program grant funds for up to $600,000 for the Seaside Park Project, and up to $1,000,000 for the Davenport Park Project; and, execute all documents necessary to accept the funds and implement the projects.  (Districts 1,8)": [
        "'speaker_4': 'Motion carries.'",
        "'speaker_1': 'Thank you. We will have item number 13, please.'",
        "'speaker_0': 'Item 13 is a report from Parks Recreation, a marine and public works recommendation to adopt a resolution authorizing the city manager to submit to grant application to the California Youth Soccer and Recreation Development Grant Program for the Seaside Park Project and Phase two of the Davenport Park Project, District one and eight.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_4': 'Yes. Can we hear a staff report, please? Hi, Marie.'",
        "'speaker_3': 'Sure can.'",
        "'speaker_11': 'Marie Knight, our director of Parks, Recreation, Marine, will deliver a staff report.'",
        "'speaker_5': 'Good evening, Vice Mayor and members of the Council. The item before you tonight is to adopt resolutions authorizing staff to submit to grant applications to the California Youth Soccer and Recreation Development Grant Program, the California Youth Soccer and Recreation Event Development Grant Program, funded by the California Clean Water, Clean Air, Safe Neighborhood Parks and Coastal Protection Act'",
        "'speaker_5': 'of 2002 provides funds to acquire and develop neighborhood, community and regional parks and recreational areas for land, air and water conservation programs. The departments of Parks, Recreation, Marine and Public Works are requesting authorization to submit a grant application for $600,000 in grant funds to be used for Seaside Park Project and a grant application for $1 million in'",
        "'speaker_5': 'grant funds to be used for phase two of the Davenport Park Project. The Seaside and Davenport Park projects were identified as being the most competitive projects at this point for this grant funding source. Both of these projects meet the grant criteria of creating new opportunities for youth sports in underserved areas.'",
        "'speaker_5': 'They are both shovel ready.'",
        "'speaker_10': 'And have matching funds for non.'",
        "'speaker_5': 'Construction costs and include.'",
        "'speaker_10': 'A water conservation.'",
        "'speaker_5': 'Measure as part of the project. The Seaside Park Project.'",
        "'speaker_10': 'Well, convert.'",
        "'speaker_5': '0.4 acres of existing unsafe dirt sports fields.'",
        "'speaker_10': 'Into an artificial.'",
        "'speaker_5': 'Turf sports field.'",
        "'speaker_10': 'While the city council approved.'",
        "'speaker_5': 'Funding in the fiscal 2014 year and fiscal year, 15 adopted budgets is.'",
        "'speaker_10': 'Anticipated to be sufficient.'",
        "'speaker_5': 'The additional grant funding will supplement the Seaside Park project. Phase two of.'",
        "'speaker_10': 'The Davenport Park.'",
        "'speaker_5': 'Project.'",
        "'speaker_10': 'Includes a multi-use.'",
        "'speaker_5': 'Sports field perimeter walking path with exercise equipment.'",
        "'speaker_10': 'A shaded.'",
        "'speaker_5': 'Outdoor assembly area, space for necessary parking.'",
        "'speaker_10': 'And a new alignment and park entry off.'",
        "'speaker_5': 'Of 55th way. These two projects are in response to increased demand for soccer, football, baseball and softball programing in our community. And we're here to answer any questions.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_4': 'Yes. Thank you for the staff report, Marie. I have.'",
        "'speaker_10': 'A couple of questions and.'",
        "'speaker_5': 'I'm glad we are going.'",
        "'speaker_4': 'After as many grants as possible, especially in these two areas. So thank you for your work on that.'",
        "'speaker_5': 'Very quickly, I wanted to ask the supplement.'",
        "'speaker_4': 'This will supplement what has.'",
        "'speaker_10': 'Already been.'",
        "'speaker_4': 'Allocated. In what way will it supplement this scope of work?'",
        "'speaker_5': 'So we've had in the.'",
        "'speaker_10': '2014 fiscal year.'",
        "'speaker_5': 'There were a total of three soccer related projects that were.'",
        "'speaker_10': 'Partially funded. And so.'",
        "'speaker_5': 'As we look to build the first two, which.'",
        "'speaker_4': 'Are Seaside.'",
        "'speaker_10': 'And Admiral.'",
        "'speaker_5': 'Kidd, those will actually be coming to the council in a several weeks for award of that. Those projects.'",
        "'speaker_4': 'We looked at.'",
        "'speaker_5': 'Being more competitive with these grant funds. And so the funding.'",
        "'speaker_10': 'That is currently available, we utilize that as.'",
        "'speaker_4': 'Matching funds to supplement what the request was. Okay, great. I just wanted to make sure I was clear on that. And then the scope of work is just for the artificial turf. I know at some point we had.'",
        "'speaker_10': 'Talked about adding lighting. It's not for any of that.'",
        "'speaker_4': 'Would it just be the turf? Is that.'",
        "'speaker_10': 'Correct? Correct. The two grants themselves are for the fields, the athletic fields. They're not for anything.'",
        "'speaker_5': 'Else to do with either the two projects.'",
        "'speaker_10': 'Fields. Perfect. Thank you very much.'",
        "'speaker_4': 'Welcome.'",
        "'speaker_1': 'Thank you, Councilman.'",
        "'speaker_9': 'Thank you. And I wholeheartedly support this this motion. I want to congratulate and thank Parks, Recreation and Marine for their efforts in identifying this grant. And Prop 40 has been very, very generous, particularly to urban areas throughout the state.'",
        "'speaker_9': 'I can recall working on that several years ago, phase two of Davenport Park. We're very excited about the possibilities there. I want to commend our city staff for their efforts to get us in a position that we are now shovel ready to to fulfill a promise that has been made for several years to the residents in a'",
        "'speaker_9': 'district in North Long Beach to complete phase two of Davenport Park. And so $1,000,000 will take us a long way, I think looking at Craig Beck, that will get us a park develop there. And we are now shovel ready, very close to getting there.'",
        "'speaker_9': 'And so this is very, very encouraging. So you have my full support and if I need to write a letter of recommendation or support, I'll be happy to do so as well.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. I'll just add a comment that, you know, congratulations to both the council members on even embarking on this and to staff because both of these are in some of the most open space, disparate areas of town, and it's going to go a long way.'",
        "'speaker_1': 'Should these grants be awarded so best? Best of luck to both the council members and to the community. Is there any public comment on this item?'",
        "'speaker_4': 'Hmm.'",
        "'speaker_7': 'My name is Latoya Marcia.'",
        "'speaker_9': 'I come in as a concerned parent. I see a lot of funding going into these parks and recreation, all the grants to, you know, for the youth and none of the money gets spent the way that it's supposed to be spent.'",
        "'speaker_9': 'Yeah. I want $1,000,000 to do turf for a part. But you know, the.'",
        "'speaker_5': 'Community.'",
        "'speaker_9': 'The taxpayers, we all.'",
        "'speaker_4': 'Say, yeah, we want this.'",
        "'speaker_9': 'Because our kids are at these parks. But then when we go to these parks, we don't see new turf. We don't see new skyline. We don't see many of the things that the grants are supposed to be used for.'",
        "'speaker_9': 'I you know, I resided by Martin Luther King Park, and it was funding as opposed to went towards the Martin Luther King Day Parade all the way down to carnivals for the kids. And when Martin Luther Day Parade came, they didn't have anything at all for the youth or for the kids.'",
        "'speaker_9': 'So how is it that you guys, you know, make these suggestions every then you don't really even check in and see if these findings are going towards the place that they should be going. It seems like whoever is in his district.'",
        "'speaker_9': 'Is using the money or the finding for their own advantages, and it does not go to the community. So if we say, Oh yeah, go ahead and give these guys $1,000,000. What happens when the funding is not being placed in the parks, in the community like it's supposed to be done?'",
        "'speaker_9': 'Because you guys do not seem like you are being accountable for anything that I do. Regardless if you are covering the grants or not, it still should fall in your hands because you are supposed to be the ones that oversee the things and you do nothing about it.'",
        "'speaker_9': 'You are overlooking. They are just going on to the next agenda. If you are for the people, start being for the people, not for the money.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'I'd like I'd like to reintroduce Ms.. Marshall to you. She is a former Wilson High student, graduate of the Honor Roll two times honor roll student at Wilson High School. Before the tragedy struck, when she her mother passed and at a series of tragic events can happen.'",
        "'speaker_7': 'And you look up and you wonder if you can even remember your last name. So before we dismiss her, she is a Wilson High former student who is now speaking as a homeless citizen, still a part of Long Beach.'",
        "'speaker_7': 'And I agree. I didn't know what she was going to say, but I agree. If you can find money for the youth. The youth will one day be 30 years old and statistically speaking. A percentage of your youth will be homeless.'",
        "'speaker_7': 'How can you not have done more? To make sure that the city has an ongoing 24 hour a day, seven day a week, 2365 day a year homeless intervention program. How can you not have that when the money has been given since 2007 forwarding to 2000 to 2017?'",
        "'speaker_7': 'But the money, I understand it's coming from another grant program, but that same money that's coming from another place is similar to the money that you have received for the homeless for years. The Long Beach Rescue mission is no longer doing the services for the homeless that it used to do.'",
        "'speaker_7': 'Now you are without a standing hallmark that used to work for the homeless you have before you are proposing now. What is it about that proposal that does not allow you to see that we can implement this? Because the youth, some of the same youth that would be kicking the soccer balls are going to be homeless.'",
        "'speaker_7': 'These same youth are going to be homeless now. Some of them are wandering around that very park. Now unwelcomed. Several of the homeless people had children whose children were taken from them at MLK Park, at Lincoln Park. Taken from them and put into foster care.'",
        "'speaker_7': 'Because their parents had no homeless housing. So you took the children and left the parents on the street. I'm what I'm trying to do is just to get us to connect the dots. We have got to begin to connect the dots.'",
        "'speaker_7': 'And you may say this doesn't it's irrelevant. What you're saying is really relevant. Just connect the dots.'",
        "'speaker_1': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'My name is running.'",
        "'speaker_1': 'I'm okay. Go for it. Thank you. It's fine. Continue.'",
        "'speaker_8': 'Proceed, please. My name is Roman. I'm from District five, and I'd like to compliment Councilwoman Staci Mongo for her efforts in this area.'",
        "'speaker_1': 'Are you happy we're speaking to the grant application?'",
        "'speaker_8': 'I understand, but for El Dorado. Okay. With respect to the grant, the. With respect to the grant, there are three artifacts that I would like to address. One is the request for status that Councilwoman Mongeau issued on about a year ago and a staff report that was done by the Park and Recreation and approved audit report that'",
        "'speaker_8': 'was done a short time ago, not too long ago. One of the problems that we were having this this this issues of grants and everything has a lot of history behind it. Three city officials have been fired from their jobs because of this.'",
        "'speaker_8': 'And some of the information that residents have received has been incorrect, actually deliberately manufactured. And the city, the residents have known it for a long time. They brought it up to the city. We have a lot of mistrust, at least the residents have.'",
        "'speaker_8': 'And one of the purposes that, um, that the residents were trying to get when Stacy, when Councilwoman Mongo issued the request for status, was transparency. We're trying to get that. But one of the problems that we're seeing is we keep seeing the end around and people trying to go directly to adding more parks and getting more money'",
        "'speaker_8': '. I have I really love the way that Maria is doing her work. Know what I trust more with the parks? Right now, I'm just nobody. And so all I'm trying to say is that one of the main things that that I'm concerned about is the funding that is necessary for for District five parks.'",
        "'speaker_8': 'We are about, what, $8 million under sustainability already? Right now, we can't even water our parks. And so I'm hoping that that whatever you end up doing here with with the city money, that's going to be I guess matching doesn't come out of the District five funds.'",
        "'speaker_8': 'Okay. If it doesn't, then I'm cool. You know, I'm actually like to have grass if I can. And I'm I'm working with the sir.'",
        "'speaker_1': 'We're talking about a grant application. I understand. District one in district eight.'",
        "'speaker_8': 'I understand. I prefer grass. Thank you. Okay. I prefer grass. I work with the. The soccer leagues, and they prefer grass as well. So you should know your audience as well, although you're trying to do these type of things.'",
        "'speaker_8': 'Understand that the players also prefer grass as well. We know where the statistics come from. 34%. Because I'm in touch with all of the the people. Thank you for we'd like to work more closely with the parks.'",
        "'speaker_1': 'Thank you for your time, Councilman Austin. Thank you. Is there any other speakers here on this item? Okay. Final speaker. Thank you. Okay.'",
        "'speaker_4': 'Karen reside. I reside in district one. And I also want to specify that I've been a volunteer for Partners of Parks for almost six years now, and I'm a part time staff person the last six months. I just want to.'",
        "'speaker_7': 'As I see.'",
        "'speaker_4': 'How hard the Parks and Rec staff and what a fabulous job Mary Knight has done to really move forward initiatives that the community wants in terms of park expansion. I came before the city council about four years ago and talked about grants and how the city didn't apply for nearly enough grants that they were qualified for.'",
        "'speaker_4': 'And I'll tell you, Department of Health and Parks and Recreation has really gone and put forth a tremendous effort to go after more grants, and we're beginning to see the fruits of that. When department applies for grants, that grant has to be specifically laid out how it is going to be spent.'",
        "'speaker_4': 'There's very little deviation from that process. There are also audits over in on any grants that are over a specific size. And I have not seen any ill conceived behavior from any city employee, and I've done.'",
        "'speaker_7': 'Work with several city departments.'",
        "'speaker_4': 'So I trust implicitly the city staff to handle and manage these grants really well. And I commend all the city departments and how they handle their grants. They do an excellent job.'",
        "'speaker_1': 'Thank you, Councilman Austin.'",
        "'speaker_9': 'Yes. Oftentimes we sit quietly and we allow public comment, but I don't I think we need to address the misinformation out there from time to time as well. And I want to commend the last speaker, because I want to, first of all, say that our Parks and Recreation Department is is recognized nationally as one of the best'",
        "'speaker_9': 'in the nation. I think some of the comments were, we're misinformed about how park dollars are being spent for projects. There is accountability, as was stated, built in from the granting agencies. Oftentimes our public agencies, the state of California and the various departments or agencies within the state.'",
        "'speaker_9': 'Our city auditor audits our Parks and Recreation Department. Public information is there. You can research it on a comprehensive annual financial report to see how dollars are actually being spent. You pay attention to our budgeting process because we budget dollars that go specifically toward park projects and programs.'",
        "'speaker_9': 'And then I would invite you and encourage you to attend your parks, recreation and Marine Commission meetings, because the commissioners are working on parks issues all the time. Ask for phase two of Davenport Park. I can't speak about every project and every park in the city, but I know we have great professional staff that keeps each and'",
        "'speaker_9': 'every one of these council members very well informed and up to speed. And we're briefed sometimes monthly or twice, more than twice monthly on current projects that are going on. And I have quite a few going on in my district at this time.'",
        "'speaker_9': 'I know we have allocated or secured about $1.6 million prior to even discussing this grant for Davenport Park Phase two. And that money has been allocated toward planning and development and some environmental cleanup and also for accountability. Ms. Knight, can you explain how the money to be spent thus far specifically, or do I need to call public'",
        "'speaker_9': 'works down here for that?'",
        "'speaker_10': 'I'm going to ask my colleague.'",
        "'speaker_4': 'Craig Burke, who took.'",
        "'speaker_10': 'The lead on.'",
        "'speaker_5': 'That for the Phase.'",
        "'speaker_10': 'One project to explain that.'",
        "'speaker_9': 'Phase to.'",
        "'speaker_3': 'Two. Good evening. Council Member Austin and City Council. Specifically to your question this the city's been working to do a landfill closure at Davenport. So there's a couple of components to the Davenport, the overall Davenport effort. First, I guess we could call it phase one, which was a project completed by the redevelopment agency some years ago in'",
        "'speaker_3': 'advance of prepping the site for phase two, which is the subject of discussion tonight and is exactly what the proposed grant funds would be used for. The city has gone through a landfill closure process with the state. We are in the final stages of getting that certified, getting that closure certified and completed and once, once done will'",
        "'speaker_3': 'be, as you indicated earlier, shovel ready for the development of the park project to provide more space for the community in that area.'",
        "'speaker_9': 'Thank you. And have we all or spent the money, as was intended to spend the grant money that we received thus far?'",
        "'speaker_3': 'As with all our grants, as you mentioned, there is a lengthy financial process that we go through. And the short answer is yes, we have spent the money as indicated in the budget and and for the purpose identified.'",
        "'speaker_9': 'Thank you staff for that that clarification. And I just again wanted to clarify that misinformation out there. Thank you.'",
        "'speaker_1': 'Thank you. And seeing no further public comment, members, please cast your vote.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an amendment to Contract No. 34308 with Safeway Sign Company, of Adelanto, CA, for the purchase of additional signs specifically required for the Street Sweeping Sign Replacement project and to increase the contract amount by $800,000, for a revised total contract amount not to exceed $3,274,000, for a period ending June 30, 2018.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Fantastic. We have item number 14, please.'",
        "'speaker_0': 'Item 14 is report from Public Works recommendation to execute an amendment to contract with Safeway Sign Company for the purpose for the purchase of additional signs specifically required for the street sweeping sign replacement project and to increase the contract amount by 800,000 citywide.'",
        "'speaker_1': 'That's pretty straightforward. Is there a second? Okay. Okay. Councilman Pryce, would you like to speak to this? No Council on the mango.'",
        "'speaker_4': 'Could the staff let us know what the cause of the increase was? That's a pretty significant increase from the original budgeted amount.'",
        "'speaker_11': 'It's for our streets. We've been signed, so.'",
        "'speaker_4': 'I'm familiar what it's for. But didn't we have a quote?'",
        "'speaker_11': 'We had a quote. I think this is to complete the rest of the signs. Here comes Mr. Beck.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Yes. Councilmember Mongo, this is part of our citywide contract. This is an ongoing, I guess, as needed contract that we asked council to approve. So when we need signs, we have them in place. As you know, we have started a citywide effort to eliminate all four E.M. sweeping times.'",
        "'speaker_3': 'And the majority of this contract has been used to purchase new street sweeping signs as we go through that updating process.'",
        "'speaker_4': 'So it's not. More money for the same number of signs of the second phase of the project.'",
        "'speaker_3': 'Correct. We have just finished what I've called. I mean, it's an ongoing project, but we kind of just finished phase two and we're now moving into phase three. So we started in our parking impacted neighborhoods and are kind of working our way clockwise around the city.'",
        "'speaker_4': 'Perfect. Thank you so much. Just making sure they didn't raise the price on us.'",
        "'speaker_8': 'That's correct.'",
        "'speaker_1': 'Thank you. Is there any public comment on this item saying nonmembers, please cast your vote?'"
    ],
    "Recommendation to receive and file a report and presentation on DataLB, the Citys new open data portal.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you. 15, please.'",
        "'speaker_0': 'Item 15 is a report from Technology and Innovation recommendation to receive and file report and presentations on data LP, the city's new open data portal citywide.'",
        "'speaker_1': 'Thank you. Their staff report here.'",
        "'speaker_11': 'Yes. This is the receive and file to talk about data. Long Beach, which is a new, fantastic program that we're launching. I'm going to turn this over to our technology innovation director, Brian Stokes and his new bureau manager, Jasmine Frost.'",
        "'speaker_6': 'Honorable Vice Mayor and members of the City Council. On December 20th, 2016, the City Council adopted an open data policy. And last week, in fact, two weeks ago we launched our new data portal data MLB. This allows us to offer opposite.'",
        "'speaker_6': 'I can never say that word. Operationalization lies the city's open data policy to allow for new public information to be represented geographically and for the exploring and visualization, downloading the data for everything that we make publicly available. Long Beach is one of the first cities to embrace open data in a more interactive way, and this portal allows'",
        "'speaker_6': 'the users to analyze and combine open data layers using map viewers. In addition, users may create their own web maps applications with the data that we provide online. So providing data online is not a new concept in government.'",
        "'speaker_6': 'However, the City of Long Beach wants to drive beyond presenting just data online. And our Data Lab portal is an innovative approach which allows the public just that access to use it in a more effective way and committed to the city's commitment to transparency.'",
        "'speaker_6': 'It's a new way of thinking about deploying open data, and the city developed LWB as a civic engagement platform and extended these systems to the whole community. And with that, we'd like to present you a short video. Want to know what's going on in our city.'",
        "'speaker_6': 'Like to know where Missouri funds are being spent. Want to know what's being done to make Long Beach more livable? Need local data to make business decisions or even design a new killer app to answer these and hundreds of other questions.'",
        "'speaker_6': 'We all need access to information, but not just raw data, but data that is organized in a way that helps us quickly see patterns and tell a story. Now with Data, MLB, the new portal developed by the city of Long Beach.'",
        "'speaker_6': 'All this and more is possible. The City of Long Beach is one of the first cities in the country to embrace open data in a more interactive way, with data lby the data sets published by the city will be centralized in one location.'",
        "'speaker_6': 'But then, instead of just giving users the ability to access this information online data, MLB provides an engaging environment where the data can integrate with maps, charts and more that quickly tells a story. And the best part is that data LWB also brings together regional and global data as well, providing even further insight and fostering more collaboration'",
        "'speaker_6': '. Think of it as layers of information. For example, use the measure a data set to map the precise locations where projects will be funded then by clicking on any specific site. A deeper, more detailed set of data is revealed.'",
        "'speaker_6': 'Having all this at our fingertips allows us to see our government in action and better understand what is being done. The added bonus is that data LBE also provides various application programing, interfaces or APIs, which allows business owners, community members and entrepreneurs linkage to data that can become the building blocks they need to develop new applications.'",
        "'speaker_6': 'Those are just two examples of the hundreds of ways this versatile portal will help us explore. Visualize, build and share data so we can create meaningful dialog, encourage public engagement and drive innovation. To get started, all you need to do is go to the data lab portal.'",
        "'speaker_6': 'So this deployment was not just solely lbe did. We had a great partnership with our Technology Innovation Commission as well as our partner Ezri. And Mike switches here from Azeri just to talk about a little bit of our engagement.'",
        "'speaker_8': 'Thank you, Brian. Thank you, Vice Mayor Richards Council. What I really wanted to speak briefly on tonight is really to kind of bring home and qualify how proud we think as we add as we think Long Beach should be about this.'",
        "'speaker_8': 'This is not any old open data portal. The back story on this is a couple of years ago we had Ezra who, you know, we have over a thousand cities using our open data system. Our founder wanted to take kind of a different approach and start working on the next generation of open data.'",
        "'speaker_8': 'And to do that, we thought out some of our partners that we've worked with closely throughout the years. In fact, we've worked with Long Beach since 1982. So we started working on this on this idea. So 11. is that Long Beach is actually only the second city to actually do what we call a hub.'",
        "'speaker_8': 'That's the our term for this next generation open data. And I'll talk very briefly in a second on, you know, what we think that is. And Brian hit on it already. But in doing this, what you've seen here, Long Beach is really the first city to kind of do everything that we think a next generation open data'",
        "'speaker_8': 'city should do. And a testament to that was that last week we had a press conference that the mayor did. And immediately afterwards, I was inundated with emails and social media posts from Rio de Janeiro, Toronto, Dubai, New York and several others.'",
        "'speaker_8': 'Because they were all watching, because they're going to be the next hub of next generation open data cities as well. So they were all watching it. It wasn't just something that Long Beach did. You really are kind of a bellwether that people are are watching.'",
        "'speaker_8': 'So we wanted to be sure that council was was aware of this. And just so you know, kind of, you know, what makes it different. Brian mentioned one of the key things is this idea of sometimes open data is thought of as, you know, kind of a passive thing where you say, here's all of our data.'",
        "'speaker_8': 'There you go, have fun with it. Next generation open data is all about being kind of operational and active where you create applications that tell the story so that when someone comes to the site, you know, wanting to know the answer to something, you kind of package it in a way that's going to be best for them'",
        "'speaker_8': '. The other thing that's very important about this is the bringing in of the broader community. So we see it as kind of an open data, not just for the city of Long Beach, but for the municipality or the whole community, I should say, of Long Beach.'",
        "'speaker_8': 'And we've already started working with Long Beach State, Long Beach City College and many other kind of regional entities as part of all this. So that that. Thank you.'",
        "'speaker_6': 'So with that, that's the end of our presentation. I want to thank you and we're open to any questions.'",
        "'speaker_1': 'Thank you. And what a great presentation. Thank you for that. I just have a couple comments on my own. I would say, you know, the video was fantastic. The open data platform, I looked at it on my phone, looked at the mobile version.'",
        "'speaker_1': 'And when I think of open data, I don't necessarily just think of it's, you know, just a platform for developers or to show how great things are. I think, you know, I want to see staff using this. I want to see community groups using this.'",
        "'speaker_1': 'I want us to be open and transparent about even data that we're not too proud of. You know, I'd like to see, you know, how we can use this as a platform to really change the narrative on the whole tale of two cities.'",
        "'speaker_1': 'Right. We just you know, we went forward over the last couple of years on the My Brother's Keeper initiative, and our health department is moving forward on equity. And I want to make sure that that's featured in this in the next iteration, the same way that measure is featured here.'",
        "'speaker_1': 'So I don't want to just see the good things. I want to see the areas where we do need work. And and I think and I'd like to see our city staff actually be and you know, it's heading that direction.'",
        "'speaker_1': 'But I wanna see our city staff continue to be more data driven. So that's just my thoughts on this. Councilmember Pearce. Oh, I'm sorry, Councilwoman Gonzales. I didn't see you.'",
        "'speaker_10': 'That is okay. I think this is fantastic that we're at this point, that we.'",
        "'speaker_4': 'Have.'",
        "'speaker_10': 'Started open data and the dialog around that.'",
        "'speaker_4': 'I would also like to see I don't know if this.'",
        "'speaker_10': 'Is already happening, especially with your interactions with LBC and Cal State, Long Beach, but some education.'",
        "'speaker_4': 'On how to visualize data and how to do it effectively for a specific industry, whether it's real estate or.'",
        "'speaker_10': 'Economic development, because oftentimes we don't want it to be passive.'",
        "'speaker_4': 'We want people to be able to maximize that data as much as possible, but they have to learn the tools. And that sometimes is a little difficult for for novice beginners utilizing data.'",
        "'speaker_10': 'But thank you very much. This is fantastic.'",
        "'speaker_4': 'Thank you for your work and for coming to council.'",
        "'speaker_1': 'Thank you, Councilman Andrews. Councilmember Pearce.'",
        "'speaker_5': 'Yes. I wanted to also think the staff and everybody that's worked on this. I think that you guys made a lot of great comments about data can be used to be passive. It can be engaging our city. We do have a tale of two cities and we do need data to tell that story.'",
        "'speaker_5': 'And when we started, the people say the city where we now have about 500 people that come and have a presentation from community members, it's data that we try to find on Long Beach, and we have not we've struggled in the years to try to find the right data and everything from greenspace in our city to, you'",
        "'speaker_5': 'know, how many calls for service we get everything with PD or fire, all of that. The more that we can be including that in this, the better city we're going to be. Because when we're transparent, we're able to be held accountable and we're able to to build on that.'",
        "'speaker_5': 'And so I'm really excited that Long Beach has really spent the last two years talking about transparency, accountability in data. And so everything from, you know, the Committee on the Elimination of Discrimination Against Women, which we tried to get out there to Cal State, Long Beach to get some data on.'",
        "'speaker_5': 'We have the data. It's about pulling it together. And so I hope that we can use this platform as an opportunity to try to get some things that we've tried to outsource in the past. So, again, thank you, everybody.'",
        "'speaker_5': 'I'm really looking forward to what is going to come.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Austin.'",
        "'speaker_9': 'Thank you. And I appreciate the colleagues my colleagues comments on this. I don't disagree with any of them, but I would like to take this opportunity to congratulate and applaud the the team in the innovation and technology department for getting us to this point.'",
        "'speaker_9': 'Not many cities are even here. And so this is, I think, pretty pretty significant in terms of a giant leap for for Long Beach. And again, we're setting the standards in terms of data and what's possible. I think the the the options are or the possibilities are limitless in terms of what we can get and learn from'",
        "'speaker_9': 'from our city. And so the suggestions made here, I certainly hope, are taken into serious consideration. I'd like to to just throw this out here. I'd like to host a community meeting and to Councilmember Gonzalez's point, maybe a workshop on how to utilize this new data portal for for our residents who may have an interest in learning'",
        "'speaker_9': 'more about this. And so I'll certainly be talking to our I-Team in our city management about setting that up as well. So congratulations. And, you know, like I said, the possibilities and the the information is really limitless in our future.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I'm very excited about the Open Data Initiative. I look forward to seeing much more data incorporated into the platform. I also look forward to a significant increase in the amount of interchangeability between us and the neighboring cities and the county of Los Angeles as a whole, so that our residents and our media sources and everyone can keep'",
        "'speaker_4': 'us accountable by knowing the facts. So this is a great first step. But I'd like to see an aggressive next 12 months. And I think those community meetings that my colleagues have mentioned are a step in the right direction.'",
        "'speaker_4': 'So I look forward to helping in those opportunities and watching to see what IT team says.'",
        "'speaker_1': 'Thank you. Is there public comment on this item?'",
        "'speaker_9': 'Roy Moore. So again, you guys talk about data and being accountable for you guys. Action. I came here almost three months ago and told you guys that I had been involved in the housing authority, the multipurpose center. You know, things were said to be Andrews that was falsified.'",
        "'speaker_9': 'And you guys said, okay, we're going to look into that. It's been months. I have not heard anything where y'all are standing accountable for the things that they're doing. So how is it that the data is going to be represented on all levels, meaning the community and you know, the different resource centers are regardless of whatever is'",
        "'speaker_9': 'going on, how are we able to see what data is, you know, smeared or not, what is in it? Because certain people don't want to say, hey, I did wrong or I overlooked something or I was wrong. So who's to say that they're going to be truthful on their statistics are on their numbers are saying they do'",
        "'speaker_9': 'a survey just to find out have any homeless people are out here and they come back saying is only a couple of hundred when it could be thousands out here. I mean, will someone look over that and audit that person or how would that, you know, really show that you guys are really standing firm and the mistakes'",
        "'speaker_9': 'you do make, you know, you are human just like us. We're not saying that you guys are perfect, but it seems like when your guys make an error is overlooked or easy, race is never brought to the front page.'",
        "'speaker_9': 'Hey, look, we did do it. Is it in or we gave this fine thinking that it was going to do one thing and unfortunately, funds went somewhere else where we apologize for this. I mean, I feel that the city has every right to know what's going on, how it's going on, and how certain, you know, services are'",
        "'speaker_9': 'mistreating the people that come in for these type of services or whatever and then give shine away or told we came as issue are be really insulted where a person feels like, hey, now I don't even want to go to certain offices that I need to go to to have these resources because I'm being mistreated.'",
        "'speaker_9': 'So I think you guys really need to look at who's doing these data report, and maybe that's why you guys are not coming out with the right numbers because they're trying to hide the truth that they're messed up or they used it for they own benefit at the end of the day.'",
        "'speaker_1': 'Thank you. Seeing no further public comment. Members, please cast your vote.'"
    ]
}