{
    "Recommendation to receive and approve appointments to the Transactions and Use Tax Citizens' Advisory Committee.": [
        "'speaker_0': 'I'm taking two items. First, which is item 12 and 24, and then we'll move on to the regular agenda, item 12. Madam Clerk.'",
        "'speaker_2': 'Communication for me or Garcia recommendation to receive and approve appointments to the transactions and use tax Citizen's Advisory Committee.'",
        "'speaker_0': 'Thank you. In front of you, you have five appointments to our measure a citizen's oversight committee. I particularly want to thank Councilmember Darrell Supernova. I want to thank Councilwoman Stacy Mongeau, who led efforts. I know that Councilwoman Pryce and others also are very supportive of this, but particularly to Darrell and and to Stacy.'",
        "'speaker_0': 'Thank you for for leading efforts in getting us moving this forward. I also want to thank the five members. I think we have an All-Star group of people, many of whom were on vacation. But I do see Judy Ross, who's who who was here in the audience or maybe one or two others in the audience, or they're'",
        "'speaker_0': 'on their way. But I want to go ahead and mention a little bit about them. We have a Jane Netherton who, as we know, has been a banker in Long Beach for over 25 years and formerly the CEO of International Citibank and who's been involved on the Long Beach State Foundation in a variety of organizations.'",
        "'speaker_0': 'And she brings incredible decades of experience in finance. We have Judi Ross, who is here, who's a former executive director of the Long Beach nonprofit Partnership. She also has worked for the United Way and a variety of other organizations, and she's been involved in every possible community group you could think of across the city of Long Beach'",
        "'speaker_0': '. And she is here, and we're very thankful for her service. We also have Steven Neal, who currently serves as a civic engagement advocate at Molina Health Care. Steve is a North Long Beach resident and formerly a council member on this body, and he's been involved in the Pacific Gateway Investment Board in a variety of programs across the'",
        "'speaker_0': 'city. We have Mary Stevens. Mary is the vice president of finance and administration at Cal State Long Beach, where she manages the entire finance and real estate portfolio. She's also been the vice president of business and finance at Cal State.'",
        "'speaker_0': 'Stanislaus is involved, is on the board of Adobe and again, very active and is a downtown Long Beach resident. And finally, we have Joel Yuhas, and Joel is the CEO and chief executive at St Mary Medical Center here in Long Beach.'",
        "'speaker_0': 'He was the CEO before. They're managing a variety of issues, including budgets and finance. And he serves on the board of the Chamber of Commerce, as well as the Hospital Association of California. And they live in East Long Beach and are from Long Beach as well.'",
        "'speaker_0': 'Him and his partner. And so I want to congratulate all five members. I see. Judy, if someone else is here that I didn't see. Let me know. Oh, and I see Steve over there. Thank you. Thank you, Steve, for being here.'",
        "'speaker_0': 'And with that, I'd like a motion any second, please. I just need. I just need a second. It was Vice Mayor Richardson.'",
        "'speaker_8': 'Just wanted to chime in and say how proud I am that we are making up this commitment to our residents by putting forth a tremendous committee. When I saw this list of names, I couldn't be more proud. You've got folks representing nonprofit sector, business sector, former government leaders.'",
        "'speaker_8': 'And I do want to take a moment just to acknowledge my friend Steve Neal, who is in the audience, who's being appointed tonight. And this is tremendous, as you know. This is you know, I know that he's going to do a good job.'",
        "'speaker_8': 'Let's just say I know the guy. And and so those are my those are my comments. But I think this is a tremendous committee. So so, Mayor Garcia, good job on making these appointments. Thank you.'",
        "'speaker_0': 'Thank you. And Councilman Mongo.'",
        "'speaker_2': 'I'm just so excited that this came to fruition. I know it just started as a dialog and behind the scenes of what we could do to ensure that taxpayers know that we're going to be held accountable. And this oversight committee is an exemplary group of individuals that I'm proud to know and support, and I look forward to'",
        "'speaker_2': 'hearing from them throughout the next several years. Thank you.'",
        "'speaker_0': 'Thank you. Any public comment on this? Please come forward.'",
        "'speaker_6': 'Oh. Good afternoon. Warmed Lisowski Long Beach resident. I was reading the Grozny Gazette the other day and Henry Salts Graves's article. He wrote that such appointments are seldom challenged. Well, I suppose that he must mean today, because I'm here to challenge these appointments.'",
        "'speaker_6': 'As a Long Beach resident and taxpayer, I specifically object to each and every one of these appointees. Why? Because while each of these five people seem like fine, upstanding citizens, they are not the people being affected by measure sales tax.'",
        "'speaker_6': 'Let's look at their job titles and roles. Council Member. Community Lobbyist. Chairperson of the Board. CEO of a National Bank. University Vice President, Mr. Mayor. And Council Members. CEOs and presidents are not affected by measure sales tax increase.'",
        "'speaker_6': 'The poor and working people are most affected. And Mr. Mayor, you have neglected to put a single member who is a poverty advocate, a poor children's advocate, not one representative of the citizens and the residents most affected by the sales tax increase.'",
        "'speaker_6': 'I find this arrogance indicative of your overall attitude towards the sales tax increase and the business as usual attitude of this mayor in this council. The measure. A sales tax is the most regressive type of tax. Let me cite the Internal Revenue Service website.'",
        "'speaker_6': 'Understanding taxes for students quote. How does a regressive tax impact lower income groups? Question A regressive tax takes a larger share of income from low income groups than from high income groups. A regressive tax may at first appear to be a fair way of taxing citizens because everyone, regardless of income level, pays the same dollar amount.'",
        "'speaker_6': 'By taking a closer look. It's easy to see that such a tax causes lower income people to pay a larger share of their income than wealthier people pay. So, Mr. Mayor, even according to the IRS, the measure, a sales tax that you so proudly trumpeted is a penalty on the poorest Long Beach residents and children.'",
        "'speaker_6': 'So when those kids are hungry, you can thank yourself for making it just a little bit harder for their parents to put food on the table. That's why I object to all these appointments.'",
        "'speaker_0': 'Thank you, sir. And again, I want to thank the five. Larry, if you're going to be coming down, please. Anybody else, please? Okay, Mr. Goodyear. Good.'",
        "'speaker_1': 'Very good. Quick as the address. Unfortunately, the previous speaker just doesn't seem to get it. The people you spoke of. Don't contribute money. To Mr. Garcia. That's the only way you can catch their attention. All right. If you don't give them money, it's paid for by.'",
        "'speaker_1': 'All right. He could care less about the people that you referred to. All right. We need to understand that.'",
        "'speaker_0': 'Thank you. Any of their public comment? Seeing none again, Judy. Steve, thank you. And I know both of you personally are here. Long time advocates for the poor and those in poverty. So I want to thank you both for your work in that area.'",
        "'speaker_0': 'There's a motion and a second. Members, please cast your votes.'"
    ],
    "Recommendation to:   1.\tReceive and file a Medical Marijuana Initiative-Analysis report from City Manager regarding the proposed initiative petition entitled Regulation of Medical Marijuana Businesses;   2.\tAdopt resolution calling for the placement of a voter-petition initiative measure on the ballot for the November 8, 2016 special election to repeal the City's ban on medical marijuana businesses; adopt new regulations to permit and regulate medical marijuana businesses; to repeal the City's current recreational marijuana business license tax; and to reduce the City's current rate of medical marijuana business license taxes;": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. We're going to go and take item 24, please.'",
        "'speaker_2': 'Communication from City Attorney Recommendation two one received and filed a report from the City Manager regarding the potential impacts of the voter petition measure to adopt a resolution calling for the placement of the Voter Petition Initiative measure on the ballot.'",
        "'speaker_2': 'Three Adopt a resolution providing for the filing of primary and rebuttal arguments relating to the voter petition measure. Four Adopt a resolution calling for the placement of a tax measure on the ballot to amend and update the city's existing marijuana taxes.'",
        "'speaker_2': 'This will require a unanimous vote of the City Council pursuant to Proposition to 18. Five. Adopt a resolution providing for the filing of primary and rebuttal arguments relating to the city tax measure on the ballot to amend and update the city's existing marijuana taxes.'",
        "'speaker_2': 'Six. Adopt a resolution requesting the consolidation of a citywide special municipal election with a statewide general election on November 8th, 2016 and seven. Adopt a resolution requesting the Board of Supervisors of the County of Los Angeles provide specified services to the City of Long Beach relating to the November 8th, 2016 election.'",
        "'speaker_0': 'Thank you. And I know, Vice Mayor, before I call you up, I think there's going to be a staff presentation by Mr. Parkin who's going to kind of go over some some of the items here and we'll turn it over to to Vice Mayor Richardson.'",
        "'speaker_9': 'Thank you, Mayor. Members of the council before you this evening are a number of article, a number of items that we are going to be asking or were asked to prepare and bring back to you for your consideration.'",
        "'speaker_9': 'The first is is a report, and obviously the staff could city management could give a report on the proposed impacts of the Citizen Voter Initiative. The second item calls for and places the Voter Initiative on the ballot for November 8th of 2016.'",
        "'speaker_9': 'The third item requests argument ballot argument writers for and against the Citizen Initiative. The fourth item was requested by the City Council for the City Attorney to return with a placement of a tax measure on the ballot. The fifth item would call for the valid argument writers for and against that tax measure.'",
        "'speaker_9': 'The sixth asks the County Board of Supervisors to consolidate our election, our special municipal election with the statewide general election, and the seventh item request that the County Board of Supervisors provide specific services and includes our reimbursement to the county for those services for that election item.'",
        "'speaker_9': 'At that time, that concludes my report and staff is available to talk about the first item, which is the initiative petition if there's a desire by the body.'",
        "'speaker_0': 'Thank you. Before I turn this over to Vice Mayor Richardson, just as a as a reminder, I know that we we discussed this last week, and we have a series of motions to make. We'll take public comment as one which the city attorney said we're able to do.'",
        "'speaker_0': 'But then we've got to go through a series of motions, one of which is to actually needs a unanimous vote of the council to put the tax measure on the on the ballot. So we want to make sure that that's very clear.'",
        "'speaker_9': 'Thank you. She's correct, Mayor. That is the third item. And I would point out that the third item that the mayor just mentioned did have a revision that was just emailed to you. It was a change to the language of the actual ballot question that will be placed on the ballot.'",
        "'speaker_9': 'The fourth item was also I'm sorry. The third item was a call that was a change for the citizens initiative. We had a typo on there where we called it the City Initiative and it was the citizens, the Kelton measure.'",
        "'speaker_9': 'So we corrected that. The fourth item was an oversight, or we had a change in the what was presented to you as one of the drafts of the questions, and we corrected that. So that's the final question. And the fifth is that same correction in the call for ballot arguments.'",
        "'speaker_9': 'So the motion would amend those three resolutions to make those particular changes. And I'm available to discuss those or to answer any questions. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_8': 'Thank you, Mr. Mayor. And first, I just want to thank staff we it was a big ask that we made when we leveled this this motion. And there was a very stiff timeline. But it's been tremendous work and a lot has taken place.'",
        "'speaker_8': 'So I do want to acknowledge that. So we did ask for a lot and you delivered a lot. Secondly, I just want to remind the public that this is this measure is intended to ensure that we ensure a public benefit for our city, as well as recover the cost that we, you know, that we believe may be'",
        "'speaker_8': 'associated with, you know, any any ballot measure that might be adopted. So I want to move forward right now, and I move to adopt the resume, the recommendations that stated in the council letter, including a few slight amendments or revisions to the following resolution.'",
        "'speaker_8': 'So number one. Resolution number three, correcting the reference to the voter petition. As the city attorney just stated. Number two, resolution number four, which amended the ballot question for the city's tax measure. And resolution number five, amending the ballot question in the call for ballot argument writers.'",
        "'speaker_8': 'In addition, there's been a lot of discussion on how we can make investments should this tax measure pass. So I would like to request that the city attorney work with the city manager to prepare a non-binding resolution indicating the Council's intent to use tax revenues for public safety, public health, homelessness, and general services for regular for regulation'",
        "'speaker_8': 'and enforcement. And that is my motion.'",
        "'speaker_0': 'Thank you. Thank you. And just to clarify to vice mayor's motion, motion was essentially Mr. Parkin's motion. He just clarified those points. So there was no change there with the with the addition of the of the resolution, which will come back to council on a separate date.'",
        "'speaker_0': 'And so that we're not voting on tonight, we're voting on the attorney to prepare it, and then we'll actually have a discussion when that comes back. The second to that was Councilman Mongo.'",
        "'speaker_2': 'Thank you. I want to appreciate the staff for the amount of hard work it took to get us to this point. I think it's really important that as we see this. Ballot initiative through on two November that we have the city resources to ensure the health and safety of the community through whatever the new regulations may or'",
        "'speaker_2': 'may not bring. It's a very uncertain time, and I think that the way that we can provide that certainty is to make sure that we are able to fund public safety and homelessness and the other components that have been connected to public safety.'",
        "'speaker_2': 'So thank you for your hard work on this. I think it was remarkable. I know a lot of analysis was done.'",
        "'speaker_0': 'Thank you. And then we have Councilman Price. We'll go to the public and they will take a vote. Councilman Price.'",
        "'speaker_3': 'Thank you. I, too, want to thank staff. You've done a lot of work on this issue over a long period of time, and most recently, as a result of our action, after we voted to put the initiative on the ballot, we asked that you prepare a fiscal and basically citywide impact report and you did that.'",
        "'speaker_3': 'And I wanted to get a brief presentation from staff regarding what that impact would be, because I think that's relevant to the discussion on taxes.'",
        "'speaker_0': 'Absolutely. Can we please. Mr. West? Can you.'",
        "'speaker_9': 'Yes. Our budget manager, Lia Eriksen, will provide that response.'",
        "'speaker_5': 'Good evening, Mayor, and members of City Council. On July 12, City Council approved a motion requesting an impact report for the ballot measure that will appear on the November 8th election. If the ballot measure is approved by voters, it will require substantial city resources and staffing related to approving and regulating of the station businesses closing or moving'",
        "'speaker_5': 'into compliance, any unsanctioned businesses and dealing with the expected increase in public health and public safety service demands. If approved, staff members will need to immediately begin working on implementation of the ordinance as it goes into effect ten days after the results are certified by City Council, as detailed in the report.'",
        "'speaker_5': 'Staff expects 32 dispensaries. Our analysis includes a range of possible cultivation, manufacturing and other non-retail marijuana businesses, as the ordinance allows for an unlimited number of these business types. It is anticipated that city staff will use a team model for administration and enforcement.'",
        "'speaker_5': 'The initial licensing process does have tight timeframes and will require significant diversion of city staff and other one time cost. However, after that period, we do not envision there to be any major problems with enforcement of the sanctioned businesses.'",
        "'speaker_5': 'We do anticipate, however, a significant number of unsanctioned businesses. The actual number is unclear, so we included a range in our analysis. It is anticipated that it will take a long time and a team based approach to shut down the unsanctioned businesses or move them into compliance.'",
        "'speaker_5': 'On the revenue side, we estimate revenues from the ballot measure in a range, but the middle estimate is about 7.1 million. This includes gross receipts for dispensaries and a per square foot tax for cultivation, as well as sales taxes for retail sales.'",
        "'speaker_5': 'The measure has minimal taxes for the other medical marijuana business types and eliminates the recreational marijuana tax rates. It also prohibits the city from charging a regulatory fee to cover the cost to administer the sanctioned marijuana businesses. On the expense side, we estimate both the direct cost of administration and enforcement, along with potential related public health and'",
        "'speaker_5': 'public safety impacts. We have a range for that as well, with the midpoint being about 12.2 million. Based on those numbers, the net ongoing cost, which is expense minus related revenues, it's expected to be about 5.1 million. In addition, there are some onetime costs related to the startup, which at the midpoint is about 2.4 million.'",
        "'speaker_5': 'The actual cost and revenues to implement and enforce the the ballot measure, the Kelton measure, will vary from our analysis as our estimates are based on a set of assumptions that could and will likely change. Staff will be working with City Council if this is approved to fund any expected short falls, and it is noted that this'",
        "'speaker_5': 'could mean that we have to redirect funds for other purposes or potentially use the city's operating reserves. The Fiscal Impact Report contains more details on our analysis. This concludes the staff report and department representatives and I are available for any questions you may have.'",
        "'speaker_3': 'Okay. So just a couple of questions. The the impact to the departments. Was that figure derived from the department head making an estimate based on, you know, prior experience with this industry, these types of businesses and studying other cities?'",
        "'speaker_3': 'Or is that is it an arbitrary number?'",
        "'speaker_5': 'Councilwoman Price Using the set of assumptions that had a low number of both sanctioned and unsanctioned businesses, a medium number and then a high number and past experiences. Departments did do their best to to develop these revenue or cost estimates.'",
        "'speaker_5': 'And it included, as I mentioned, both the administration and enforcement and potential health and public safety impacts.'",
        "'speaker_3': 'And but for the tax measure, what would the funding source be to fund that gap in terms of our ability to meet the ongoing demands of this new business?'",
        "'speaker_5': 'So that and I should note the analysis I just said was the original Kelton measure before you today is a competing tax measure that would generate additional revenues, $2 million additional revenues for medical marijuana only at the middle middle point of the range, an additional 4 million at the max.'",
        "'speaker_5': 'And then if there was recreation, an additional 6 million at the midpoint and an $11 million increase at the max. So those those resources would be able to cover these costs, these estimated cost, if not for that competing tax measure, we would need to come to city council with some other options to fund the cost in 17'",
        "'speaker_5': '. And then we would have to build the shortfall directly into the 18 budget. And so it would be competing with other cost of general city services.'",
        "'speaker_3': 'So without the tax measure, what is our anticipated shortfall, the first year of operation?'",
        "'speaker_5': 'So for our first full year of operation, it's 5.1 million, plus an additional 2.4 million of one time costs.'",
        "'speaker_3': 'Okay. So we're looking at about a $7 million shortfall for the first year without the tax measure.'",
        "'speaker_5': 'That's correct.'",
        "'speaker_3': 'And that money would have to come from cutting from other departments and other services that we provide to our residents.'",
        "'speaker_5': 'That is correct.'",
        "'speaker_3': 'I have a question for the city attorney. Perhaps it's the city attorney. What is the feasibility? Or is it even feasible to have some sort of a call for service fee? So similar to, for example, people who have a home alarms.'",
        "'speaker_3': 'If the alarm goes off a certain number of times beyond what's allotted, then there may be an administrative fee that's put for cost recovery in terms of, you know, the fire department having to respond to your home, could there be something like that in regards to calls for service?'",
        "'speaker_3': 'So after ten calls for service, let's say there would be an additional that there would.'",
        "'speaker_2': 'Be a fee.'",
        "'speaker_3': 'A significant fee.'",
        "'speaker_9': 'Councilmember I'm shooting from the hip here a little bit, but the the initiative itself prohibits certain fees and it limits the ability to for the city to collect fees. But, you know, I don't think that it eliminates, you know, all fees or regulatory fees.'",
        "'speaker_9': 'But in this particular case, we'd want to take a look at that scenario. But as I read the Citizens Initiative, it prohibits those type of fees.'",
        "'speaker_2': 'Okay. Okay.'",
        "'speaker_3': 'Thank you. I have nothing further at this time. I'd like to hear from the public.'",
        "'speaker_0': 'Thank you. Council Member Pearce.'",
        "'speaker_5': 'Thank you. Thank you, staff, for putting together a dense and exciting report to read. I just wanted to clarify this and I think you guys just said it. This is a competing measure to the Kelton measure.'",
        "'speaker_9': 'It is qualify that as a competing measure. It conflicts only in the area of taxation. Both measures discuss and set taxes at different rates. The city has no regulatory portion to our ballot measure, so there is no competition or it does not compete in the area of the regulatory ordinance.'",
        "'speaker_9': 'So we have looked at this and believe that they would coexist and in the area in which it competes, the if the cities measure were to receive more valid votes than the Kelton Citizen Initiative, then the city's tax regulations would go into effect.'",
        "'speaker_9': 'And their regulatory ordinance, if it passes, is going to go into effect.'",
        "'speaker_5': 'Great. Thank you. And my second question is, in regards to coming back for a nonbinding resolution on the plans for spending the funds, what's that timeline to come back?'",
        "'speaker_9': 'That we could probably come back in a couple of weeks or so to come back with. It'll be a range or options, and I think what I'll be looking for is some direction from the council to see if those are the specific items that you would like to identify and then take your input.'",
        "'speaker_9': 'And if it's acceptable, they could move forward that night or if not, we would take it back and refine it until we have the what the council would look for.'",
        "'speaker_5': 'Great. So it's not a quick short timeline. Thank you. Appreciate that.'",
        "'speaker_0': 'Okay. Thank you. Public comment on this item. Please come forward. Please come forward. Everybody, if you can, just please line up. We're trying to be expeditious tonight. Just give your name for the record and begin.'",
        "'speaker_1': 'A good career as it is adamantly opposed to the concept of marijuana on its very face. And as a as everybody knows, a medical marijuana card is as easy to obtain as a political promise from a political pipsqueak during an election period.'",
        "'speaker_1': 'I was just informed that Washington, D.C. has something that. Might help. Prevent the disaster that would befall us if we move forward with this motion as it is that they have. There are only two to. Doctors. Which can issue the prescriptions and the medical marijuana.'",
        "'speaker_1': 'That is something we should follow. Absent that absent that, I would figure out whatever. The direction we need to go or whatever method to place a tax. On if it's measured in terms of grams or ounces. I do not know.'",
        "'speaker_1': 'But $500 a gram, $500 a year out, period. The. Criminal element, the cost in terms of enforcement and the crime that will ensue. Well, this city will not be able to absorb. So I think every single ounce of effort should be used to forestall saddling us with this disaster in the making.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Take your place.'",
        "'speaker_1': 'Stephanie Dawson, so a resident of Second District, previous to working in the marijuana industry, I actually was a legislative director for the First District, and as a result, I kind of gained an M, if you will, in looking through patois.'",
        "'speaker_1': 'Usual method of destroying legislation and programs in which he did not like. One of the main examples of which he would do this would be not providing comparable data from cities that would be more relevant to the piece of legislation in which he was actually being asked to discuss.'",
        "'speaker_1': 'In our particular situation, from the marijuana perspective, looking at other cities in California and Oregon who have property tax deregulated, this particular commodity would be far more relevant to Colorado, which as I see the sale older style of regulation, which was not going to apply inside this inside of the state.'",
        "'speaker_1': 'We have a healthy new supply chain that's going to be going that's going to be going throughout the entire state. Thus we're not going to be relying entirely on an indoor grows, especially from a local area. The other method that he would be using that uses frequently to destroy pieces of legislation he doesn't like would be adding'",
        "'speaker_1': 'maximum costs without any citations. An example of this can be found in the way that he basically glommed on nine state costs under the universal pre-K initiative, as well as a no no kill shelter initiative from 2015, which he somehow was able to price out beyond any sort of recognition it when it comes down to it.'",
        "'speaker_1': '20 additional code enforcement officers would actually be great for controlling the slumlord problem that we have inside of the city. But is a long term strategy or necessity for regulating the marijuana industry? This wreaks absolutely no sense and has no basis in reality.'",
        "'speaker_1': 'The reason that I bring this attention to you and frankly, you know, is because you you as legislators, regardless of where you stand on this issue, need objective information from a nonpartizan source. With no pit, with no reason to stand for it has an established record of of destroying targeting of this industry and lying to you, the'",
        "'speaker_1': 'legislators, about this specific issue. And it goes back to when Robert was on the council. The reason that the last ordinance failed was not because of the legislators on the dais, and it was because of a city bureaucracy that took it upon themselves with no direction from the city to be able to attack this industry at every'",
        "'speaker_1': 'single, every single part. That will cost the city billions in litigation fees that are unnecessary and puts patients in danger. Be careful about weed taxes before you before you know all the regulations. Say, for example, medical growers are going to be based in the city, of inner city, are going to be highly regulated from the state and'",
        "'speaker_1': 'federal authorities. The county recently withdrew their their their 10%, their homeless tax, which is going to be assisting us. But at the same time, we are still looking at businesses that with iris to 80 are going to be taxed in an effective rate from 50 to 80%.'",
        "'speaker_1': 'While I'm running out of time here, the issue of unsanctioned businesses, look at that data from L.A. and Santa Ana. Those are created by incomplete legislation where secondary were illegal. Secondary markets for manufacturing or growth were created simply because they were not included in the original legislation and there were not enough dispensaries meet adequate demand.'",
        "'speaker_1': 'Thank you and have a good day.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Evening, Mayor City Council. My name is Gary Hetrick. I reside in the fourth district. I want to speak just briefly to the nonbinding resolution. I want to put something on the table so that as we come back to this, I think this is an important issue.'",
        "'speaker_1': 'And I think the previous speakers sort of raised this. And this is building in a process of community engagement so that the residents of Long Beach themselves can can weigh in on in a decision making process in terms of how this this this new revenue is going to be spent.'",
        "'speaker_1': 'Rather than having that come from the council, I would like to see, for instance, participatory budgeting process, which we already use in Long Beach as a as a way to engage residents, assuming this goes forward in how they want to see this money spent, it may be spent along the lines that we're already thinking.'",
        "'speaker_1': 'It may not. But I think this is a way to really engage residents in a meaningful way around money that's going to be coming from the residents. And so I want to put this on the table. When we come back to the non-binding resolution, I would like to see some form of community engagement built into this.'",
        "'speaker_1': 'And participatory budgeting is something that's already been used. It's something that's sanctioned by or not even sanctioned, but identified as a best practice by the White House for HUD Community Development BLOCK Grant Program. So it's got a fantastic track record and creating a mechanism for residents to have meaningful decision making power over taxpayer money.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Yes, sir. Mayor and City Council. My name is Steve Updike. I was a drug addict. Marijuana was my gateway drug. And thank God to the Church of Scientology. They got me off dope. That's the only reason I'm here.'",
        "'speaker_1': 'I'm not dead. It's a true story. Go ahead and laugh. But it's true. Anyway, the truth of the matter is, you will never be able to get enough tax money or money for this problem of dope in our society.'",
        "'speaker_1': 'You're going to kill our people. You're going to be responsible for the deaths of people. You know, I know people laugh. I finally came out of the closet and said, hey, dope is for dope. Okay. And you're talking to a guy who was on dope, almost died from dope and got off dope, thank God.'",
        "'speaker_1': 'And the truth of the matter is, it's poison. A poison that screws up your mind. And that's the God honest truth. And you know it deep down. I know you like to get high people. I know you like to feel good.'",
        "'speaker_1': 'Sure. Have a drink, smoke some pot, do some dope. But you know what? It's temporary. It's not going to solve your problems. I know you're doing dope to solve your problems. It's not going to do it. What you're doing is you're killing yourself.'",
        "'speaker_1': 'And now we're going to. And you'll never make eye with the chief. You're never going to make enough money to fix the society when it goes into shambles. You think it's bad now? It's going to be a lot worse.'",
        "'speaker_1': 'And, you know, it really does kill people. I know I grew up at a time when my friends, the famous and others were dying as a result of dope, all kinds of dope. And so, you know, I was there.'",
        "'speaker_1': 'I did that. I know for a fact because I was there. I was one of those people who had a needle in his arm. It's not the way out, people. It's not going to help you. Dope is not the solution to your problems.'",
        "'speaker_1': 'You can sit there in your high and mighty positions and you can make your billions of dollars. And I know you're greedy and you want it, but it's going to cost you more than you can afford. And another lifetime from now, you're going to if you survive, you're going to find out the cost in public lives, the'",
        "'speaker_1': 'destruction of the minds of our children and our people and our our future. It's going to be a major problem. And you know that somewhere deep down in your soul, you know that drugs are a poison. I'm talking dope.'",
        "'speaker_1': 'I'm talking heroin, marijuana, anything that leads to getting high like that. People don't need it. They don't have to have it to survive. And it's poison. And this game you're playing with, Oh, we're going to make all this money.'",
        "'speaker_1': 'You're going to spend every penny you have and more than you can afford. And the lives are going to be ruined as a result of this dope is going to be you're not you have no idea what you're doing.'",
        "'speaker_1': 'You're like, it's a big mistake and you have a chance to turn it around before our society goes down the tubes. And that's exactly where it's going.'",
        "'speaker_0': 'Thank you, Mr. Next Speaker, please.'",
        "'speaker_1': 'Tough act to.'",
        "'speaker_6': 'Follow. My name's Larry King, the seventh District. I served on the Medical Cannabis Task Force. I helped on the Kelton initiative, and I was chosen by Mayor Foster to work with former Councilperson Chips Key to write the argument against in the 2014 tax measure in the election.'",
        "'speaker_6': 'I'm for taxing. I'm for regulation. I've worked as a consultant in other states. I was a legitimate operator here. There is no place in this country that does not bring in a good a lot more revenue than than the costs in medical marijuana.'",
        "'speaker_1': 'I mean.'",
        "'speaker_6': 'If this is going to be the same fiscal report that we're going to read that we received on the task force, it's a joke. It's based on the only thing accurate in it is that they say it's based on guesswork and it's based on bureaucrats who don't know anything about this business or this industry.'",
        "'speaker_6': 'And they don't have to look too far to see that it's worked in other places. So I'm looking for that report. But again, it's going to be more of the same. They hired a shadowy figure named The Revenue Whisperer to to base all their facts on.'",
        "'speaker_6': 'And we pretty much shot it down in a task force, but nobody was listening then. And I'm sure nobody is going to listen now. So this is going to be on the backs of the patients and the sick and the people who have been deserving and waiting for the last seven years to get this in our town'",
        "'speaker_6': '. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Price. You queued up and looked at the queue versus the next speaker, sir.'",
        "'speaker_1': 'Hi. Dave is Keith. I'm a resident here in Long Beach. And I just want to say that I oppose to this medical marijuana, let's call it for what it is is drugs, is dope pot. It is not good for our community.'",
        "'speaker_1': 'That's what it all boils down to. I work with kids and I and I work with high school kids, too. And it breaks my heart to have my kids come to my classroom and they're high as a kite.'",
        "'speaker_1': 'In much of it that they get is from the so-called medical marijuana, from their parents or whoever the situation is that they get access to it. It's no good for us. Just like the gentleman said back here in regards to.'",
        "'speaker_1': 'This drug ruining community and its pot. And the thing is, is that people are able to get access to it and there is nothing wrong with them. I'm not saying not all of them, but there are some people who get access to it and they go to the doctors, so-called doctors, and they get the prescriptions written up'",
        "'speaker_1': 'and then they're able to get access to it. I know of a person who was Muslim. Absolutely nothing wrong with them. But he smokes weed every day. He had a problem getting it. He was buying it on the streets.'",
        "'speaker_1': 'Well, he figured out that he was able to go to a doctor and get a prescription. And he did. And now he smokes weed every day and he gets it legally. But there's absolutely nothing wrong with them. And I told him, I said, Man, you're Muslim.'",
        "'speaker_1': 'You're breaking all the rules. So I'm just going to advise you guys to think of this long and hard. Where I live in Long Beach, Oliver Chestnut on the third floor, I look over my balcony and I see some of the people because I'm right next to an alley.'",
        "'speaker_1': 'Hiding in a corner. Getting high. Doing drugs. And that happens maybe about once a week. Just footsteps away from the police department. Think about it. It gets into the hands of the kids. Even if the the dispensary is miles away from the schools and the parks, trust me, it doesn't mean that it can't travel back to the'",
        "'speaker_1': 'neighborhood to where the children are. If any of you guys have children, think about it. Because your child can be a victim. Thank you.'",
        "'speaker_0': 'Thank you. Any other speakers, please? Looks like it's our last speaker. Last one. Okay, I'm closing the speaker's list, then back to the council. Please.'",
        "'speaker_2': 'Good evening. Diana la genes. I would like to answer just a couple of things. I noticed the last gentleman was talking about the access that people have to it now. Well, yeah, because it's a black market. It's easy for kids to have access now, but it is much more difficult for them to have access when it's regulated'",
        "'speaker_2': '. Take a look at alcohol. Same kind of thing. It is harder for them to get alcohol than it is for them to get marijuana because it's regulated because nobody wants to lose their license over selling to a minor.'",
        "'speaker_2': 'So I'm just saying. And in the states where it's been decriminalized or legalized, teen use goes down. It is a fact. The irony and that's the irony of it. The other gentleman that was talking about his addictions thing is.'",
        "'speaker_2': 'I'm I'm sorry if he has an addictive being. But people that are going to be addicted to something are going to find something, whether it be opiates. In fact, opiates right now are the biggest are the most abused drug in the nation.'",
        "'speaker_2': 'Now, do we stop our prescription drugs because prescription drugs are the most abused drugs? No, of course we don't. And if we want to talk about that and saving money, we could talk about the alcohol in Long Beach.'",
        "'speaker_2': 'We have almost 900 liquor outlets in Long Beach. And yet I know just about every I've seen every single person on this council drinking liquid drugs. So if we're going to stop something, let's stop that. Okay. So I did pass out something regarding children and that is really important to me.'",
        "'speaker_2': 'And do I have children? Yes, I have three children. I have five grandchildren and I have five great grandchildren. Do I care about children? You bet I do. And I'll tell you what. I passed out something to you.'",
        "'speaker_2': 'It talks about a child who uses it to control her epilepsy. It has saved her life. And there have been many, many children who have died waiting in their state for it to become legal in their states. So if we're worried about the children.'",
        "'speaker_2': 'Let's make sure it's available. And to tax medical, I think is pretty sad. If you want to tax recreational, I don't have a problem with that. But to add to the burden to people who are sick, who really need it, who cannot go to their insurance companies and ask for their to be reimbursed, it it's really very'",
        "'speaker_2': 'greedy. And I hope, you know, again, recreational fine. But if you're taxing it where it becomes a burden on people who are truly sick and really need it, I think you better rethink it. Just remember, if Jesus was standing here, what would you really tell him and how do you think he would react?'",
        "'speaker_2': 'You're welcome.'",
        "'speaker_0': 'Thank you very much. That closes public comment will now go back to the counsel counsel woman price.'",
        "'speaker_3': 'Thank you. So I want to make a couple of comments to clarify a few things. First of all, I want to thank our speakers, especially those who spoke against the marijuana initiative. And the reason for that is sometimes it's very difficult to come in and speak, especially when I mean, I've been on this council for two years'",
        "'speaker_3': 'now, over two years now, and there are very few groups that actually will come in and heckle when they don't like what they're hearing. And unfortunately, this is one of those groups we have, you know, legitimate business leaders who will heckle because they don't like what they're hearing, which is a really unique way of fostering a long'",
        "'speaker_3': 'term relationship with the city entity. So I it's a strategy I've never really understood and calling out the, the city manager and everybody is as being, you know, crooked and, you know, not doing their work is just in my opinion, that's not really a spirit of let's do business together for the next few generations.'",
        "'speaker_3': 'The bottom line is that we as a so I appreciate the people who came forward and spoke tonight because I know that's very difficult to do. I will also say, however, that it is not this council that is initiating marijuana dispensaries in the city of Long Beach.'",
        "'speaker_3': 'This has come to us by way of a petition that was circulated, and they have earned the right to be on the ballot, and that is a right that they have earned. And that's a right that I respect.'",
        "'speaker_3': 'And we have voted to put the initiative on the ballot because we are in a democratic process and they have done the work to earn their spot on the ballot. And that is something absolutely I respect. It's part of our system.'",
        "'speaker_3': 'So when people come and, you know, I appreciate people coming and telling us the harms that this is going to cause on the city, I would say to them, watch the council meetings where this has been on the agenda for the last two years.'",
        "'speaker_3': 'And you will find very quickly that your concerns have been shared by some on this council. The concerns that I have is based on talking with the police department when we did have sanctioned marijuana dispensaries in the city and illegal operations showed up, some of my colleagues, some of whom are on this council, some of whom are'",
        "'speaker_3': 'no longer on this council, but were at that time were some of the most vocal demands of service by our police department, requiring them to do everything that they could to shut down those illegal dispensaries because they were having such a negative impact on the quality of life of the residents.'",
        "'speaker_3': 'And that's just the reality. I mean, you can heckle if you want, especially if you don't live in the city, especially if you don't take hundreds. Of calls and emails from residents every day you can roll your eyes and say it's stupid.'",
        "'speaker_3': 'But at the end of the day, when there's a medical marijuana dispensary that's not supposed to be there and it's impacting residents lives in a negative way, that's a real issue we have to deal with. It's not an issue that we can ignore.'",
        "'speaker_3': 'It's not an issue that we can say is silly. It's a real issue for our residents. And we, every single one of us is required to do everything we can to protect the quality of life of our residents, the children who are trying to sleep with the lines outside the door, the people who hear noises from the'",
        "'speaker_3': 'nearby businesses, whatever the business is, we have a duty and a responsibility to respond to the residents. So you can heckle all day long. You can be unhappy with the decisions that impact your interests in a negative way.'",
        "'speaker_3': 'But the bottom line is we have a duty to make decisions that are in the best interests of our residents. The medical marijuana industry is an uncertain industry everywhere. When people say, look to the you don't have to look far to find this and that, there are all sorts of statistics and data.'",
        "'speaker_3': 'I was recently at a nit's a study, I nit's a conference in D.C.. I sat next to the chief of police from a jurisdiction in Colorado. Trust me, you can find data everywhere that supports whatever you're trying to to convey.'",
        "'speaker_3': 'The bottom line is it is a drain on resources. And I want to give kudos to our city staff for doing their best to come up with the estimates. We can sit here and criticize it all day long.'",
        "'speaker_3': 'But you know what? They're not investors in this industry. They are not investors in this industry. So, yes, they don't have intimate familiarity with the inner workings of the industry, but they are looking around and and doing the research.'",
        "'speaker_3': 'And let's not forget, they're comparing the data to to what we experienced here in the city of Long Beach. It's not operating out of a vacuum. And their analysis shows very negative impacts, impacts of this measure. If it were passed, if the if the measure passes, it will be a substantial increase to our responsibilities and result in'",
        "'speaker_3': 'large decreases in our ability to function efficiently, effectively and safely. It's going to place an undue and unsustainable burden on countless city departments, from business licensing to code enforcement to the city attorney, the prosecutor's office to police to fire to our health department, and yes to our school district, because our school district unfortunately does not agree with'",
        "'speaker_3': 'Miss. Our last speaker in regards to the positive impact that this is going to have on our youth. In fact, they they conclude to the contrary. All of this means we're going to have less police response, a lower of quality, lower quality of life for our residents who may call and get a response from the police department'",
        "'speaker_3': 'that this is a low priority call and long processing periods for non marijuana related businesses. We are trying to be a business friendly city. The report explains in great detail the significant financial costs that the measure is going to cause and for both short and long term analysis.'",
        "'speaker_3': 'Although the goal that I'm sorry, although the stated goal of the measure is to allow patients with serious health issues easy access to medical marijuana, the effects of the measure go well beyond the issue of patient access. I think even patients undergoing cancer treatment would agree the multimillion dollar net losses the city is projected to sustain are'",
        "'speaker_3': 'bad for everyone. The increased demand for police response due to the huge number of illegal businesses and statistically likely crime that are associated with legal and illegal marijuana. Businesses are bad for our residents. Extended approval and permitting times for businesses and licensing is bad for our residents.'",
        "'speaker_3': 'And extending by weeks the ability of code enforcement to investigate code and safety violations is bad for residents. And when we say you don't have to look too far. The city of L.A. has 135 legalized medical marijuana dispensaries.'",
        "'speaker_3': 'They currently have over 1000 dispensaries operating in their city. That's not too far. And we're looking there. The measure provides for between 26 and 32 dispensaries to be open citywide. However, the measure goes much farther than just allowing for dispensaries, which would benefit patient access and includes allowing all marijuana related business types to operate in Long Beach'",
        "'speaker_3': 'with no limit cultivators. Testing manufacturing, distribution and transportation all have no limits on how many can be in the city. Additionally, the measure was poorly written with some ambiguous language that could result in legal challenges, which would place another burden on our city city attorney's office.'",
        "'speaker_3': 'This information is not based on some political ideology. I know it's easy to blow it off and roll your eyes and think that's what it is. But we have a thorough report that is provided to us as a decision making body by department heads who have come to the city through extensive searches with extensive backgrounds and resumes'",
        "'speaker_3': '. These are respectable, educated people who have been tasked with the purpose of trying to decide what resources they're going to need to live in this new reality. This is a cost benefit analysis that's put together by the city managers and department managers assessing the rational and likely result the measure is going to have by requiring more city'",
        "'speaker_3': 'resources and staff, time and energy and increased demands on our already stretched thin emergency response units. This assessment puts in clear numeric values the severe effect this measure would have on some of our most important city departments. Financial losses are one thing for a city to sustain, but a virtual guarantee that this will create an unmanageable burden'",
        "'speaker_3': 'on emergency response units that are already hugely understaffed. It is unrealistic to think that the city can shoulder the increased burden. This measure places on numerous departments and staff members without there being significant decrease decreases to responsiveness and quality of service at every level of the city of Long Beach.'",
        "'speaker_3': 'In terms of what we're able to provide, this is, in my opinion, a very detrimental measure because of the fiscal impact. That is why tonight, however, the measure has every right to be on the ballot. The voters have every right to to make that choice.'",
        "'speaker_3': 'The initiatives the authors of this initiative have earned that right. And I respect. That. But our voters need to have some options. This is why, from day one, I've been saying I want a competing initiative to give our voters options.'",
        "'speaker_3': 'I would have liked an initiative that allowed for patient access and didn't have all the other components that go well beyond access. But I did not prevail in that argument with my colleagues, and I appreciate that it's a democratic process.'",
        "'speaker_3': 'But at this juncture, we have the opportunity to recoup some of the costs associated with this industry. So I am in favor and I will be voting in favor of a tax measure tonight. However, I want to make it abundantly clear with my colleagues, in terms of my intent, our number one priority in any tax revenue generated'",
        "'speaker_3': 'should be cost recovery. Our police departments, our business licensing, our health department, our fire department. They need our city attorney's office. They need to recoup the money that they are going to be using from their departments to help fund this industry if it passes.'",
        "'speaker_3': 'Beyond that, I think we need to think about public safety as the number one and business licensing as the two big hits that we're going to be taking as a result of the analysis that was performed by our city staff.'",
        "'speaker_3': 'So so my position is this isn't this like slush fund? This money needs to be used specifically for cost recovery. And we need to ensure and make a commitment to our residents that that is what the money will be used for.'",
        "'speaker_3': 'And if if we have that kind of commitment as a council, then I am going to be voting for this tax measure. Thank you.'",
        "'speaker_0': 'Thank you. With that, we now have a motion and a second on the floor. We're going to take separate votes. We've done public comment for all of them. We're going to take separate votes. Again, let me just reiterate some of what was said.'",
        "'speaker_0': 'It's incredibly important for the city to have the the necessary revenue to be able to deal with both the public safety and the public health needs, particularly on the cost recovery of general services side for this measure. And so it's important that this moves forward.'",
        "'speaker_0': 'It's important that voters have a choice to be able to pass the city, at least the city piece of this, which is going to be one of the measures on the ballot on this item. And so I strongly recommend that.'",
        "'speaker_0': 'And with that, I support the vice mayor's motion. It's on the floor. Members, please cast your vote. First, going to take the first part of it, which is receive and file the medical marijuana initiative analysis. Please cast your vote.'"
    ],
    "Recommendation to request City Manager to have the LGBTQ Pride flag fly every day at city hall to show support for the LGBTQ community here in Long Beach and nationwide until the LGBTQ community has equal rights nationwide.": [
        "'speaker_1': 'So watch. Thank you, Mr. Gideon. Thank you. For those people that had been asking, that's the answer. Check to see. You know, thank you. That was a crime experience. But two years ago. Two and a half years ago.'",
        "'speaker_1': 'Thanks. Thank you.'",
        "'speaker_8': 'All right, Madam Clark, we're going to skip to item number 14. Could you please read on 14, please?'",
        "'speaker_2': 'Communication from Council Member Pearce recommendation to request the city manager to have the LGBTQ Pride Flag fly every day at City Hall to show support until the LGBTQ community has equal rights nationwide.'",
        "'speaker_8': 'Okay. So we have a motion council member. Is there a second to this? Councilmember Pearce, you want to speak to your motion?'",
        "'speaker_5': 'Thank you. I want to say I was really honored to put this item as my first item. Long Beach quickly became my home. Once I found a community at the LGBTQ center and I was, you know, raised by somebody that was part of the LGBT community in Texas.'",
        "'speaker_5': 'And so I know firsthand the struggles that people in our LGBT community face every day outside of of Long Beach and Long Beach, we've come a really long way in the rights of LGBT community, but we still have a long way to go.'",
        "'speaker_5': 'We have people in our community that are continually facing struggle turned away from establishments based on their sexual identity. We have people that are still struggling to find public accommodations, making sure that we have public education, where LGBT community would be protected from discrimination, and also making sure that our LGBT community has opportunities around federal funding for'",
        "'speaker_5': 'education and health care. And so here in Long Beach, we all stood outside City Hall, a group of us a little over a year ago to celebrate marriage equality. And what we said was that marriage equality was a great first step, but we still have a long way to go that we wanted to fight for equity.'",
        "'speaker_5': 'And so I propose raising the flag to celebrate our LGBT community here, but also at a national level. And I want to make two amendments because I know that there's been some discussion about why the LGBT community. So first, I would like to make an amendment to the item that we asked for a report back from city'",
        "'speaker_5': 'staff to include a report back on all of our flags. How many flagpoles do we have? What flags have been flown? What flags have been taken down? And what's the process for moving forward to raise one of these flags?'",
        "'speaker_5': 'I also want to make sure we include how many flagpoles do we plan to have at the Civic Center at our new civic center? My Second Amendment to this item is that we raise the flag starting as soon as we can, and that we keep it up until either this group decides that there's another process for how'",
        "'speaker_5': 'we raise flags or until the Equal Rights Amendment is passed at the federal level. So it's not a forever situation. It is a until we have rights at the federal level. But I'm open to some discussion about that.'",
        "'speaker_5': 'I know that there was some discussion about an interfaith flag, veteran's flag. And so I definitely want to make sure that we have an open discussion about how our city celebrates our diversity, but how we also whenever there is an opportunity to say people in the LGBT community in Long Beach should walk around feeling proud, and we'",
        "'speaker_5': 'should also have a symbol to say that we respect those rights and that while we are divided, sometimes the city as a whole values equality and equity. So thank you. I ask for your vote tonight.'",
        "'speaker_8': 'Thank you. Councilmember Pearce. Councilmember Gonzalez.'",
        "'speaker_7': 'Yes, thank you, Councilmember Pearce. I think this was a, you know, brought up a lot of good discussion. I, too, am a strong advocate for the LGBTQ community, like many of us here on the dais. I know Councilmember Pearce, his story and it's definitely something I know she she certainly believes in and I think many of us'",
        "'speaker_7': 'do here in the city of Long Beach. I would also like to see the process unfold to see exactly what we can do. You know, going forward with the new civic center, how many flagpoles we will have. There has been discussions.'",
        "'speaker_7': 'Maybe we raise the flag. I believe we have. The Purple Heart flag is one of them during November Veterans Month. And so there's a lot of discussions that have arise from this. I think although this was intended for one thing to begin with, it's really opened it up to a lot of other beautiful discussions for many other'",
        "'speaker_7': 'demographics. So I'm looking forward to hearing that first before we move forward. So thank you.'",
        "'speaker_8': 'Thank you, Councilmember Councilmember Price.'",
        "'speaker_3': 'Thank you. I want to echo the comments of Councilwoman Gonzales with, with one exception and rather than many of us behind the dais, support the LGBTQ community. I'd I'd say without a doubt, all of us on this council support the LGBTQ community, and we have done so not just in our actions and our words, but in both'",
        "'speaker_3': 'and everything that we do. So I don't think that I'm glad that we're asking for a study because for me, while I'm very supportive of the LGBTQ community and the pursuit for equal rights, I want to make sure that all residents feel represented and that we as a city are not giving special attention to one group or'",
        "'speaker_3': 'another. I would hate to be in a position where we're denying a request to fly a flag from an organization like the Veterans, for example, because that's one of the issues that we've gotten calls about over the last few days, is what about our organization?'",
        "'speaker_3': 'We'd like a flag to and every single person who and not just organizations, but that's probably a bad word. Like the veterans aren't an organization, but they represent.'",
        "'speaker_2': 'A group.'",
        "'speaker_3': 'Of people who live in our community who deserve to be recognized and protected. And it's to me, it's about inclusion. So I don't want to be in a position where we're not able to. I accept the requests that people make, and I do like the idea of looking at what the flagpole make up is going to be'",
        "'speaker_3': 'for the new civic center, because it may be that we have, you know, the the flags that are inclusive of all of us, the American flag, the state flag, the city flag. And then maybe we have another poll or a couple of polls where we can highlight additional causes, groups, individuals, anything that women's rights, you know, domestic'",
        "'speaker_3': 'violence, anything that we want to highlight, we can do so with some additional flags that are out there that give us an opportunity to say yes to everybody. That's important to me, to be able to include everybody and not have anyone feel that they're not involved as as residents and that they're not valued as much as others'",
        "'speaker_3': '. So with that, I do want to thank Councilwoman Pearce for bringing this forward. I think it's going to spur a really good discussion and actually probably prompt us to look at something that we hadn't looked at for the nearest civic center.'",
        "'speaker_3': 'I don't think we've even talked about that. So it's actually a great discussion for us to start having. So thank you.'",
        "'speaker_8': 'Thank you. Councilmember Price. Councilman Austin.'",
        "'speaker_10': 'Thank you. And I don't disagree with anything that any of my colleagues have mentioned thus far. This is a this is Long Beach and we know that here the city government certainly supports our LGBT CU community. I personally have worked to help elect the first gay male here.'",
        "'speaker_10': 'Dan Baker had the opportunity to work with Jerry Ships Key, the first lesbian, openly lesbian, a member of the city council and obviously our mayor this is this is a the LGBTQ community has a rich fabric in our community and deserves to be honored.'",
        "'speaker_10': 'And I think we do so quite frequently with the new Harvey Milk Park. We have a great gay pride parade in celebration and a month that we dedicate to that. I'm the I have one question because I know we have a number of flags flying right now.'",
        "'speaker_10': 'And there's two parts of her motion. The original motion was to do a study, which I certainly support. The other part is to to fly the flag until. So what comes down? In the interim. Is there a blank open flagpole now?'",
        "'speaker_5': 'It's my understanding that the last time we flew the pride flag is that it flew underneath our state flag. Or is that correct? State flag that it would be two on one pole. Yes. This is exciting stuff, guys.'",
        "'speaker_5': 'Exciting stuff.'",
        "'speaker_1': 'Wow.'",
        "'speaker_5': 'Sorry about that.'",
        "'speaker_1': 'There's. If we choose to fly.'",
        "'speaker_9': 'Below the state flag, that there's certainly room for that immediately.'",
        "'speaker_10': 'Okay. Thank you.'",
        "'speaker_8': 'Thank you, Councilman Austin. And I'll just I can't really queue up, so I'll just make my comments now. I would say thank you. Thank you, Councilmember Pearce, for for bringing this forward. And congratulations on your first city council item.'",
        "'speaker_8': 'I'll say that. And I would say that, you know, sometimes sometimes it is good to, you know, go ahead, allow staff to, you know, put it all together, look at it and come with a recommendation that, you know, the whole city council can support.'",
        "'speaker_8': 'I'm certainly going to support the proposal and what I heard and I want to make sure that this is in your motion. What I heard was you want them to take a look at the gate, the pride flag.'",
        "'speaker_8': 'You want them to look at the, you know, Purple Heart, Gold Star mothers. You know, those groups, the Gold Star Mothers had a flag and it came down to the process of the move as well as the interfaith flag.'",
        "'speaker_8': 'Yeah, those are the three you want to make sure are included in this study.'",
        "'speaker_5': 'I want to make sure that we include those and any others that might be down in the past. Certainly certain and correct me if I'm wrong, the flag come down.'",
        "'speaker_1': 'It's still there.'",
        "'speaker_2': 'All right.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_8': 'Thank you. Okay, councilman. Subpoena.'",
        "'speaker_6': 'Okay. I guess I would like further clarification. I thought Councilman Austin's point, I wasn't sure where you're going, but I guess I would make a friendly amendment in that if we're going to do a study, let's study it and not take any action right now.'",
        "'speaker_6': 'So how would you like to frame that in terms of that? Would that be a friendly amendment.'",
        "'speaker_8': 'A city, a city attorney? Could you just restate what you understand is the motion? My understanding is that, yeah, I think there's a little confusion here, but the my understanding is that staff is going to look at all the flags together.'",
        "'speaker_9': 'Yeah. My my understanding of the motion from the second District was that she had requested a report back to the city council on on the flags, the number of poles, what's flying on them, how how you determine a flag is placed on the pole and what is the procedure to do that?'",
        "'speaker_9': 'And then the second part of that motion was to fly the flag, the LGBTQ flag, until that study comes back. Way I understood.'",
        "'speaker_1': 'It.'",
        "'speaker_6': 'And that's what I heard also. I think we have a cart and a horse syndrome here. If we're going to do the study, let's do the study and find out how we proceed. So that would be my I want to call it a friend of the amendment this time.'",
        "'speaker_6': 'So. So looking for a second on that.'",
        "'speaker_8': 'Thank you so much. Well, there is no it will.'",
        "'speaker_9': 'Be a subsequent motion.'",
        "'speaker_8': 'Friendly, friendly amendment. So if it's not Councilmember Pearce, so you have a friendly to combine the study with the pride flag. Are you open to that?'",
        "'speaker_5': 'Let me think. Yeah.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Thank you. And I would just ask, what is your timing? Your timing considerations?'",
        "'speaker_5': 'You get that back in the next 30 days to shorten.'",
        "'speaker_1': 'We will certainly tell you.'",
        "'speaker_9': 'Where we are in 30 days, but we'll try to come back in 30 days.'",
        "'speaker_8': 'Just a recommendation, I would say. Try to bring it back after the budget. Give them a good 60 days so they actually have a report.'",
        "'speaker_5': 'Sure. If you could bring it back right after the budget, which is September 15th, that.'",
        "'speaker_9': 'Will come as fast as we can and give you updates. No worries.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_8': 'Thank you. Councilmember Price.'",
        "'speaker_3': 'Just one quick question. Do we have a flag policy? And if not, can we look at creating one so that in the future, if a group comes and says, we'd like our flag flown, we can have a policy that's kind of consistent and not arbitrary.'",
        "'speaker_1': 'Councilmember Pierson Members of the City Council. Price Scuse me. And Member City Council, we do have a flag policy.'",
        "'speaker_9': 'It's actually a.'",
        "'speaker_1': 'City manager administrative regulation that does spell out and we do have information on the flags. But one of the provisions.'",
        "'speaker_9': 'Of that policy is if any other flag wants to be added, then it's.'",
        "'speaker_1': 'There's a discussion at the city council that happens. So we're appropriately following that process.'",
        "'speaker_8': 'Thank you, Councilman Austin.'",
        "'speaker_10': 'And as a follow up to that policy, is there in that policy, is there direction on on taking the flag or removing the flag from our poll? Because I have my staff research all of the flags and there's at least one of them that gives me some some concern.'",
        "'speaker_1': 'Not having committed it to memory. I don't recall exactly about removing, but I don't believe it really talked about removing it talks.'",
        "'speaker_9': 'About the federal flag and how that should be flown because there are some protocols on the federal flag. It talks about the city and the other flags.'",
        "'speaker_1': 'We have a list of some others that have been added over the years. There are several flags that are flown every day.'",
        "'speaker_9': 'But we can certainly revisit the policy that's currently there.'",
        "'speaker_1': 'We'll talk about that in the report and then we can certainly look at how to remove flags. And again, I think all of that really does happen at the city council level.'",
        "'speaker_10': 'Okay. Thank you.'",
        "'speaker_8': 'Thank you. There it is. Thank you. So seeing no more council comic will open it up to public comment.'",
        "'speaker_1': 'Very good. You click as the address. I would suggest to the council person from the Second District that our energies should be focused 100% and trying to forestall. The bankruptcy that is facing this state, this city, instead of going off on a harebrained idea like this.'",
        "'speaker_1': 'We fly the American flag, the state flag, the city flag and the flag. And I don't know if the official policy is relative to the gold star that is connected with veterans. Military affairs. Buried. Any other flag can certainly be flown, but not here.'",
        "'speaker_1': 'At the city hall. What I've long suggested is we create and this and this is particularly true given well. Let me go back. I've suggested a couple of years ago. Three years ago. What we develop is that in our largest city park, Eldorado Park, we set aside a place where we call pandering park.'",
        "'speaker_1': 'And on the longest weekend of the year in the summer, starting at Friday till Monday, any group, whatever they are. Good, bad, whatever, good looking, bad looking, whatever group left, right. They can march over Hill, over Dale, over here, there and anywhere they want and get it out of their system period.'",
        "'speaker_1': 'And that is particularly true when we're talking about the. Gay flag and the Harvey Milk debacle, which was engendered by despicable conduct of a mayor that capitalized on the tragic death of two individuals. Neither of whom had any connection to whatsoever.'",
        "'speaker_1': 'But he thought he could make some political hay out of that. That. Will be eventually removed also over to and we can put it in pandering park. But the policies should be these three flags that are flying their.'",
        "'speaker_1': 'In addition to the other flag that was referenced dealing with veterans. Period. Otherwise, what we've got is every Tom, Dick and Harry with every group from Mickey Mouse. To the Boy Scouts. To the Klu Klux Klan. What about the group that was in here?'",
        "'speaker_1': 'Parties complaining about the massacres in their country? We start doing that. Stick with those three flags.'",
        "'speaker_8': 'And thank you, Mr. Goodhue. Thank you. Next.'",
        "'speaker_1': 'He's.'",
        "'speaker_2': 'Good evening again, Diana Le Gene. First of all, I do want to commend Councilwoman Pierce for her empathy and to her feelings about this particular issue. My my concern is, is that if you're going to represent one group, then you need to represent all.'",
        "'speaker_2': 'So one thing that could be considered is like the U.N. the U.N. has flags from all the different nations. So you could have in the courtroom in the area outside city hall, you could have a number of different flags and you could have a number of different groups represented.'",
        "'speaker_2': 'However, you're going to have to really use your judgment on which ones because you might want to have the veterans flags or what about Black Lives Matter? Or What about the Hispanics? Or. So, you know, you're going to be very careful to be inclusive.'",
        "'speaker_2': 'One of the things that concern me are that you're going to have to have a flag with a green cross on it because medical marijuana patients are also very underrepresented. So I'm just and I'm not saying that to be funny.'",
        "'speaker_2': 'I you know, they are legally persecuted. So. So I'm just saying, you might want to be very careful with them. And I do understand wanting to support people who are not being honored. And in that respect, what I have personally done is I will not stand up from this day forward.'",
        "'speaker_2': 'In fact, I started a couple of weeks ago to stand up for the Pledge of Allegiance because it ends with and liberty and justice for all. And that is just not true in this country. It is just not true.'",
        "'speaker_2': 'And until that happens and I don't care what it I don't care whether you're black, white, purple, green, medical marijuana patient or you're Hispanic. It doesn't matter to me. It should be liberty and justice for all. And so if you really want to object to that, then my suggestion is you do not stand for I love the'",
        "'speaker_2': 'country. I just do not appreciate the the the empty words of liberty and justice for all. So I'm just suggesting that if you want to truly object to it, sit down. Don't. You know, that's a great way of quietly objecting to the injustice in this country.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'My name is excuse me. My name is Lynn Roba. I've been a resident here for 36 years. I suggest that the lady before me might want to visit some other countries where there is no liberty and justice for all before she stops saluting our beautiful flag.'",
        "'speaker_2': 'When I found out about this item agenda, my first reaction was, I don't remember getting to vote on this. And so I decided to come down here and give my opinion. I've always bragged about Long Beach as being so racially diverse, and we have a lot of people that we know from other countries that we show around'",
        "'speaker_2': 'here, and we're so proud of Long Beach and its diversity. It's also diverse and backgrounds and cultures and religions and persuasions. I think it's a mistake to lift up one particular persuasion above another and to honor that persuasion with flying just their flag below these three flags.'",
        "'speaker_2': 'I think it's a mistake. We all have persuasions and we all are waiting to see our goals be realized. How many flags will there need to be to represent all of us in Long Beach? I recommend that we not approve this recommendation.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_8': 'Thank you. Next.'",
        "'speaker_6': 'Hello. I'm David Pope Grover, and I'm the pastor of Hope Chapel in Long Beach, and I'm a resident here the same time as my wife, Lynn, who just spoke. And I would like to say something about the American flag tonight.'",
        "'speaker_6': 'We saluted it.'",
        "'speaker_1': 'Together and we were in unity.'",
        "'speaker_6': 'And there's so much diversity here. But when we we see our flag, the the the red, white and blue. And we see ourselves as a nation under God. We're in.'",
        "'speaker_1': 'Unity.'",
        "'speaker_6': 'And this this flag protects all peoples. There. There should be liberty and justice and freedom for all. But I don't feel that it's a righteous act. To endorse what the Bible says is a sin. And we need to get to the root of the matter.'",
        "'speaker_6': 'We need to get back to the Bible and back to the Word of God. And so I'm here at Happy. To call you to repentance. And to come back to the truth because it's only the truth will truly set us free and make us find peace among ourselves.'",
        "'speaker_6': 'God bless you. I hope you'll consider that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Thank you. Next.'",
        "'speaker_1': 'My name is Daniel Cartagena. I live in the first district. I'm a veteran from the Korean War. I was in the first Marine Division from 1951 to 52 and Korea. And I was at the VA hospital yesterday when this discussion started about the flag.'",
        "'speaker_1': 'At first, you know, I was upset. Because to me, the American flag means a hell of a lot. I know many of you weren't even born towards the end of World War Two, but at the Battle of Iwo Jima.'",
        "'speaker_1': 'There were five Marines and one Navy corpsman that raised the flag on Mount Suribachi. And to me, that represented the strength of our country. I'm a very proud man to live in the United States. I did my service time.'",
        "'speaker_1': 'And so when this item came up, I wasn't too sure how hard to digest it. At first I was upset. But then I decided I wanted to come down here to. To find out more about it. And I don't have a problem talking about maybe a policy for flags.'",
        "'speaker_1': 'But I think I like to everybody to know that, you know, the American flag means a hell of a lot to a lot of us veterans. And I think that veterans should be included if there's going to be any input on any of this discussion.'",
        "'speaker_1': 'And I can I know several guys that would be more than happy to come down and discuss this whole issue. So that's my response. Thank you.'",
        "'speaker_8': 'Thank you. Next.'",
        "'speaker_1': 'Hi, Dave is Keith resident in Long Beach. I just want to say on this topic of the flag for the LGBTQ being flown. I feel that it's opening up a can of worms and you're going to get some pushback.'",
        "'speaker_1': 'And lastly, there is inclusion, inclusion, inclusion. The study must be done. Because other groups are going to come forward and say, hey, my flag should be able to fly as well. I agree with you, Suzy, and what you said, Jeannie, all of those things that you mentioned about the issues that the L, g, b, t q deal'",
        "'speaker_1': 'with, African-Americans are dealing with that. Almost since the beginning of time, and we still don't have equality. So if that is the case, the study must be done because the Black Lives Matter is going to come up and say, Hey, our flag should be flying up there too, because we've been dealing with the issue much longer then'",
        "'speaker_1': 'the pride community. That is what's going to happen. And this is a hot topic. As a former reporter for an ABC affiliate station. Trust me. It's going to be some pushback in the community and the news is going to grab on to it and you're going to be seeing a lot of stories going on.'",
        "'speaker_1': 'So I'm not saying that I'm against it. I'm not saying I'm for it. I'm kind of neutral right now. But if. The Council decides to move forward. Then you have to open it up for everybody. And on the topic of flying all year long until equality runs, until equality is achieved, rather then if that's the case, then'",
        "'speaker_1': 'it needs to be opened up to other groups to. For African-Americans and the Latino, Latinos and everybody else until equality is achieved. So there's a whole lot in there that needs to be considered. A whole lot. So think about it very carefully, because once again, it's going to open up a can of worms.'",
        "'speaker_1': 'If we move forward. If we go forward. This is Long Beach. Hey, more power to you, but it has to be open to everybody else. Thank you. And one last thing. I agree with the lady. I think she laugh in regards to the Pledge of Allegiance.'",
        "'speaker_1': 'And justice for all. We haven't got there yet because if we have, we wouldn't be having all of this push back and confusion going on in America.'",
        "'speaker_8': 'Thank you, sir. Next.'",
        "'speaker_1': 'Hello. Jim Hutchinson.'",
        "'speaker_0': 'Again and.'",
        "'speaker_1': 'Again. I just going to echo some of the same sentiments that have been articulated. I have appreciated the ethnic, cultural and demographic diversity of our city, but I am again convinced that we must put the brakes on this resolution for several reasons.'",
        "'speaker_1': 'Most of us agree that the American flag is a powerful symbol of unification, patriotism and shared values. However, the rainbow flag does not unify or reflect shared values. It exalts one group above the others, as has been said.'",
        "'speaker_1': 'And it's going to divide rather than unify. It sends the wrong message, although many will say that it invites inclusiveness, it's going to do the opposite. Many in our community believe the LGBTQ issues and lifestyles are not healthy on many levels, but we respect the community's right to choose as long as it doesn't promote itself above other'",
        "'speaker_1': 'cultures and values, which also have the equal right to expression. This is exactly the message you will send if you vote yes on this resolution. Cultural flags, in my opinion, are just not appropriate for government venues. Also, many of us feel.'",
        "'speaker_0': 'Our voices.'",
        "'speaker_1': 'On this issue are either not heard or ignored, and that politicians, by attempting to pass these.'",
        "'speaker_0': 'Kinds of resolute.'",
        "'speaker_1': 'Resolutions, confirm the sentiment and disregarding large segments of the city's citizens who believe traditional and biblically based relationships are the best for physically, emotionally, socially and spiritually. Please vote no on this resolution a proposition which is divisive rather than unifying.'",
        "'speaker_1': 'Let us continue to agree to pledge the allegiance to the flag of the United States of America. And yes, we do not have liberty and justice for all, but we're pursuing that. So thank you for the time. This time, I pray that you would consider our opinions.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Thank you. Next.'",
        "'speaker_2': 'Good evening. My name is Porter Dahlberg and I am the executive director for the LGBTQ Center of Long Beach. I am also an LGBTQ person. I am here in strong support of Councilmember Pierce's original agenda item. Last night I was in Las Vegas on vacation with my parents as a treat to my mom.'",
        "'speaker_2': 'I took her to see Terry Faders Puppet Show at the Mirage. After three incredibly demeaning jokes about LGBTQ people, including putting a male audience member in a dress and then proclaiming that he could now use any restroom he wanted, I left, holding back hot tears of anger.'",
        "'speaker_2': 'I complained to the manager as my mother, who I love deeply and who I know loves me deeply as well, and tries her best to understand who I am. Did not stand beside me, but instead waited down the hallway while I expressed my concern.'",
        "'speaker_2': 'The manager told me that he was sorry I didn't enjoy the show and gave me the email address of someone else to contact. A gay man interrupted my complaints to tell the manager that he was gay and wasn't offended at all and that quote unquote, we needed to learn to laugh at ourselves.'",
        "'speaker_2': 'I felt the tears of raw vulnerability, threatening exposure, so I did not get to ask him when the last time he was harassed and a restroom was. I knew his answer would have been never. But the memory of the last time this happened to me was quickly surfacing in my mind.'",
        "'speaker_2': 'When Caitlyn Jenner accepted her SB award last year, she said, If you want to call me names, make jokes, I can take it. But for the thousands of kids out there coming to terms with being true to who they are, they shouldn't have to take it.'",
        "'speaker_2': 'And I was one of those kids last night, childlike, full of insecurity, helplessness and doubt. And in that moment with the manager, I knew that I was all alone and no one was going to believe me or acknowledge my hurt.'",
        "'speaker_2': 'I did not feel safe in Las Vegas. Symbolism is important. When LGBTQ people see a rainbow flag flying at our civic center. They know we will believe and acknowledge them when they come to us with their hurt and pain.'",
        "'speaker_2': 'They will know that we are a city that cares enough about LGBTQ people and the messages we constantly receive that we are punch lines and punching bags are unacceptable. And they will know that we are a city that values, embraces and acknowledges how much farther LGBTQ people have to go in the world and among ourselves to live'",
        "'speaker_2': 'with safety and dignity and without shame. I deeply value the kindness and respect each of you has demonstrated towards the LGBTQ community. Our flag, our symbol of hope, is worthy of official acknowledgment more than once a year. And I strongly encourage you to honor the spirit of the original item and fly the flag for at least 30'",
        "'speaker_2': 'days. While this study is conducted, it will go a long way in mending many wounded spirits and broken hearts, including mine. Thank you so.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Our next speaker.'",
        "'speaker_7': 'Hi. My name is Dr..'",
        "'speaker_5': 'Elaine Villanueva.'",
        "'speaker_7': 'Bernal, and they reside in the fourth District and.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Support the study. And just so thank you just to and I.'",
        "'speaker_7': 'Want to share with you.'",
        "'speaker_2': 'With with this entire audience here that I am also a.'",
        "'speaker_7': 'Daughter of a Vietnam vet. My dad serve in Danang for two years from 1965 to 67. But tonight I am here to speak about the LGBTQ community.'",
        "'speaker_2': 'So I'm going to speak from a professional and professional.'",
        "'speaker_5': 'Professional and personal standpoint.'",
        "'speaker_3': 'And for.'",
        "'speaker_5': 'Those of you that know me, I teach chemistry, and I also teach with.'",
        "'speaker_2': 'Science education at Cal State Long Beach, and I'm faculty there for ten years.'",
        "'speaker_5': 'And while there has been great strides in.'",
        "'speaker_2': 'Promoting women, especially women of color like myself in STEM.'",
        "'speaker_7': 'We have a long way to go with the LGBTQ community. In my.'",
        "'speaker_5': 'Profession.'",
        "'speaker_7': 'From my experience being 15.'",
        "'speaker_2': 'Ten, 15.'",
        "'speaker_7': 'Years in the STEM community.'",
        "'speaker_5': 'In the profession, that science is pretty straight, very heteronormative.'",
        "'speaker_2': 'There was a recent study, Queer in STEM survey with 14 over 1400 participants, respondents where 40% of queer STEM workers reported that they have not come out to their colleagues and coworkers.'",
        "'speaker_5': 'And just to close this out in the last minute and a half, I want.'",
        "'speaker_2': 'To share one of my students stories. His name is Victor. He was one of my biochemistry students where when he came out to his parents, his parents kicked him out. And, you know, as far as the studies, it's like a tank.'",
        "'speaker_2': 'And on a positive note, fortunately, he returned home.'",
        "'speaker_5': 'Where while there's much conversation and healing that had to take.'",
        "'speaker_7': 'Place.'",
        "'speaker_5': 'He's one of our top student.'",
        "'speaker_2': 'Researchers now at Cal State Long Beach. So it's those things that I keep in mind as far as a symbolism that we need to show as a community and for the LGBT community.'",
        "'speaker_5': 'I think you.'",
        "'speaker_8': 'Thank you. Next.'",
        "'speaker_7': 'My name is Cynthia Newsom.'",
        "'speaker_2': 'I've been a.'",
        "'speaker_7': 'Resident in Long Beach for over 36 years.'",
        "'speaker_2': 'I just kind of want to give a timeline of. Our world. Our world was created by God.'",
        "'speaker_7': 'And when he made all the heavens and the earth and all the.'",
        "'speaker_2': 'Animals and everything, he made.'",
        "'speaker_7': 'Adam. And then he made Eve.'",
        "'speaker_5': 'His goal was to be a man.'",
        "'speaker_7': 'Woman marriage.'",
        "'speaker_2': 'So what has.'",
        "'speaker_7': 'Happened? You know, Adam and Eve ate the fruit and.'",
        "'speaker_2': 'Sin entered the world.'",
        "'speaker_5': 'Okay, so.'",
        "'speaker_2': 'So then we come to Sodom and Gomorrah. Well, God's view.'",
        "'speaker_5': 'Of homosexuality is.'",
        "'speaker_7': 'An abomination.'",
        "'speaker_5': 'And what you know, because they didn't repent. They were destroyed. And so we see throughout the whole Bible that. That God condemns it. So then we've we've got America. We've created America.'",
        "'speaker_2': 'Most of our founding fathers. Were believed in the Bible.'",
        "'speaker_5': 'They wrote all these wonderful.'",
        "'speaker_2': 'Things the Declaration of.'",
        "'speaker_5': 'Independence, the Bill of Rights, etc.. Okay. So, you know, I would say most of the citizens were God fearing people at the time. Well, our society has changed a lot.'",
        "'speaker_7': 'Now as far as marriage is concerned.'",
        "'speaker_2': 'If you look at all the states that have.'",
        "'speaker_5': 'Voted.'",
        "'speaker_2': 'For homosexual marriage, it's not been the people. The people have not voted on it. Here in California, twice we put on the initiative.'",
        "'speaker_5': 'To have a marriage between one man and one woman. And it got shot down twice. And so it's not that the people have voted for it. It's that our courts are judges, our legislators. Everyone has catered to. That lifestyle.'",
        "'speaker_5': 'And I when I heard that.'",
        "'speaker_2': 'All of you council people voted for same sex marriage, I was ashamed. I could not believe it.'",
        "'speaker_5': 'Well, yet I couldn't believe it because I know what kind of influence we have here. But. And then we've got the Supreme Court that totally went against God's law.'",
        "'speaker_2': 'I will say one thing that, you know, the Supreme Court, they can.'",
        "'speaker_5': 'Do.'",
        "'speaker_7': 'Whatever they want to.'",
        "'speaker_2': 'But marriage was.'",
        "'speaker_5': 'Created by God.'",
        "'speaker_2': 'And he's the only one that can change it. Thank you.'",
        "'speaker_0': 'Thank you so much. New speaker, please.'",
        "'speaker_1': 'Good evening. My name is James Sweitzer. I live in the third district resident. I actually was not planning to speak tonight. I came to catch up on emails after my four week absence. But I think in light of some of this conversation turning into all Flags Matter conversation, and I think a lot of the other commenters being'",
        "'speaker_1': 'the perfect example of why this item needs to be discussed and why we need to. I mean, I'm so proud of all of you for even entertaining. This, I think, speaks volumes to it. And I think that I want to let you all know personally.'",
        "'speaker_1': 'I'm trying without crying. What kind of message you're sending? I don't want to do that with the story. Sunday morning on June 12th, I woke up, um, actually very now when we sit back very early morning on June 12th, I was at a bar with some friends and waiting outside after the bar had closed at the entrance'",
        "'speaker_1': 'on the street and talking to people and enjoying the space and the freedom that I had there. And to wake up the next morning and find out that the same people who were doing the exact same thing I did were not alive at that same time.'",
        "'speaker_1': 'It was terrifying. And I remember I couldn't even consider going on social media. Friends that invited me to come out here and join the amazing community out here at Harvey Milk Park. And I honestly wasn't ready for that.'",
        "'speaker_1': 'As somebody who's gone through so much trials and tribulations and contemplating my own suicide at the age of 16 and struggling with my own identity, not only just as a gay man, as a gay man of color. It was terrifying.'",
        "'speaker_1': 'And the first time, two weeks after that night, going back to a gay bar and a gay bar because it's a safe space for me to be and be myself and seeing other people and especially people of color and seeing that rainbow flag.'",
        "'speaker_1': 'I cried. I cried. And to be able to see that and to know that I can look at the American flag and say, that's beautiful. Because as some of these speakers said, that represents everybody. Everybody, whether we're disabled, able bodied, whether we come from where people of color, whether we whatever, regardless of our income, that represents everybody'",
        "'speaker_1': '. But the message that you all are sending right now by saying whether it's until we have equal rights nationwide or whether it's just for 30 days to see that everybody is beatable. But right now, we need to care for the specific people in the LGBT community because they are hurting.'",
        "'speaker_1': 'And I agree with our speaker. If there is a Black Lives Matter flag, let's play that, too, because right now there is a lot of hurt and a lot of hurt right here, not just in our nation, in the world, but in our own community.'",
        "'speaker_1': 'And I'm so proud of all of you for entertaining this. And I would just encourage you so much. To you know, I know you're for the study, but to really consider this is a very important item for our community.'",
        "'speaker_1': 'So thank you.'",
        "'speaker_0': 'Thank you next week for please.'",
        "'speaker_10': 'Hi. And it's Tom Stout. Information on file. I'm not really.'",
        "'speaker_6': 'In favor of this ordinance. The bottom line, I think the three flags that are displayed there are what should be displayed at public buildings. Now.'",
        "'speaker_10': 'You do fly the pride flag. You see it all over Long Beach. It's flown during the Gay Pride Month.'",
        "'speaker_6': 'That's fine. But I don't think there.'",
        "'speaker_10': 'Are enough flagpoles for every group that wants to fly a flag at any public building. Maybe you should get one of the RDA properties that you're giving away anyway. And let's make it a flag park and you can fly whatever flag you want there with, you know, certain exceptions.'",
        "'speaker_10': 'So what do you think? Let's use an RDA proper. You're giving them away anyway. What the hell? All right. Thank you.'",
        "'speaker_0': 'Thank you. And the other public comment synonym closing public comment. Back to the council. Councilmember Pearce.'",
        "'speaker_5': 'First turn on my mic. I want to thank everybody. Literally everybody that came and spoke tonight. I want to be reflective. You know, we heard a lot about other community members that might have been left out of this this flag discussion.'",
        "'speaker_5': 'And to be clear, members of our LGBTQ community are members of every part of our community. They're veterans. They are Christians. They they're African-American. They are cover every single part of our community. But there are small minority still that still has been struggling every day.'",
        "'speaker_5': 'And I want to thank James Swasey for sharing where you were and how you were feeling when lives were lost. Since 2010, we've had over 150 hate crimes on the LGBT community that made national news. And that's not including what happens in our streets.'",
        "'speaker_5': 'That is not reported. And that is, again, one of the reasons why I brought this item up, thinking about the state of our country and the fact that we lost lives in Orlando, 49 lives, 53 wounded. It is a time that I think sometimes we feel that we have made a lot of strides, but we haven't quite'",
        "'speaker_5': 'gotten there yet. So I want to thank everybody for the fruitful discussion on the study, which I look forward to staff coming back, and I would like to ask that council members reconsider their friendly amendments. We had some requests from the audience around flying the flag for 30 days or some shorter period of time, preferably 30 days'",
        "'speaker_5': 'until that study does come back. Would you be open to that?'",
        "'speaker_0': 'Okay. So I wasn't here when the friendlies were done. So there's a motion in a second. Who was there? A friendly member. Okay. Council member. Supernova.'",
        "'speaker_6': 'Thank you. And thank you to the speakers, Elaine James and to Porter. I think Porter introduced the 30 day window and by my friendly amendment I someone used the word divisive and that's all I was trying to avoid.'",
        "'speaker_6': 'So we wouldn't have this here tonight. But it was inevitable to go to a study I think is is make sense. I guess what I had question was flying the flag and then tell the point we have a study and then what if the study has the wrong result, then you have to take the flag down.'",
        "'speaker_6': 'So I like the concept of having the flag up for a limited time. 30 days is fine and then it comes down and then we go to a study. So that's if, if I could revise my friendly, I guess that's what it would mean.'",
        "'speaker_5': 'Q Thank you.'",
        "'speaker_0': 'Okay. So the there's a, from what I understand, correct from wrong because it wasn't here. The friendly amendment is to do a study on the flags that are we currently have as far as inventory of what we fly with possibly looking at what we should be flying is that that right and then 30 days for the pride'",
        "'speaker_0': 'flag. Okay. Yeah. Councilwoman Price.'",
        "'speaker_3': 'So I really I appreciate the discussion that we're having. I'm a little bit I don't quite understand the 30 days. I mean, the idea of taking the flag down once we hang it to me seems. I don't know.'",
        "'speaker_3': 'I think I would have a really hard. If we're going to fly the flag, let's fly the flag. I don't I don't understand the concept of hanging it for 30 days and then taking it down. It's not even, in my opinion, unless I'm missing something.'",
        "'speaker_3': 'This 30 day period isn't even. Coinciding with anything else, a message or a reminder? I don't know. I just I feel like putting it if that is what will make people happy, that's fine. I just don't know the wisdom of that.'",
        "'speaker_3': 'Wouldn't it be better for us to establish a flag policy, determine what consistent methodology we're going to use to hang flags? And and I really appreciate James's comments. I mean, they they really they they're very touching. And he says, well, you know, if this organization wants it to hang their flag, too, that that's fine.'",
        "'speaker_3': 'I mean, I actually really like that philosophy is that I don't think we should be saying no to anybody. I mean, women I'm sure there's women who think we need equality. I'm sure there's people of color who think we need equality.'",
        "'speaker_3': 'And they might come in next week and say, you know what, we want our banner or we want some symbol of our fight and our struggle hung up there, too. And then we don't even have any sort of guidelines right now.'",
        "'speaker_3': 'We can't even justify what we would say is we're going to hang this flag for 30 days because our colleague brought the item forward and your request alone isn't enough. But if you can get a council person to bring the item forward, then we'll fly your flag for 30 days.'",
        "'speaker_3': 'I just I don't want to set that kind of precedent. I respect this honestly. The concern that I had when this came forward is, is how do I express my real concerns without it being misinterpreted? And I know a lot of my colleagues feel the same way.'",
        "'speaker_3': 'The concern is that tomorrow, if an organization comes and says, you know what, my husband's a veteran, and when I was talking about this item with him, he said, you guys should hang the you know, do you have something out there for veterans?'",
        "'speaker_3': 'And I said, gosh, I don't know. But it was like the slippery slope, like we could we could end up having 20 flags out there. If we are like I, I genuinely appreciate and love the diversity of my community.'",
        "'speaker_3': 'I love it. But we cannot be in a place where we're hanging everybody's flag because we just we can't we have to have some sort of limit. We represent everybody. And the most inclusive way to represent everybody is through the flag of the United States of America.'",
        "'speaker_3': 'That's how we represent everybody. So I'm not saying I'm not saying let's not hang other flags. I'm just saying let's have, you know, a method by which we decide. And, you know.'",
        "'speaker_2': 'If if.'",
        "'speaker_3': 'We've hung the flag before on multiple occasions, but they've always coincided to some sort of message. I just I'm missing the message. But again, I want to listen from my colleagues on this. If it's something that people feel strongly that that there's something to that 30 days, I will say I think that.'",
        "'speaker_2': 'Our.'",
        "'speaker_3': 'Our actions should mean something. In regards to our commitment to this community, I think our actions should mean something. I know that I represent a district that has in the past not been very active at all in these efforts.'",
        "'speaker_3': 'And yet for the last two years, I have participated in, supported, done everything that I can to support the community. And I don't want my concerns about allowing one flag because it opens the door for others to be misinterpreted, to mean something that it doesn't.'",
        "'speaker_3': 'I think our actions should mean something. We live in a beautiful, diverse city with a gay mayor. Turns out he's gay and he has done a great deal for to educate every single one of us, teach us about everything, include us.'",
        "'speaker_3': 'And so much he's been so inclusive in allowing us to be a part of his community. And I respect that and I appreciate that. It's made me a better person. I think we should be, as a city, judged by our actions.'",
        "'speaker_3': 'And the other concern that I have is the way that the agenda item was written. I respect it, I appreciate it. I don't think we as a government entity should be hanging flags or banners in some sort to send some sort of a political message for a fight for equality.'",
        "'speaker_3': 'Because there are so many organizations and and people that deserve equality. There are so many disenfranchized people in America. We live in a beautiful country. We have a land of opportunity. But we really should be we should be in a position that we say yes to every group that wants that fight for equality.'",
        "'speaker_3': 'And if we're going to do that, then it's it's we're opening it's a slippery slope. And that's my concern. So I just I have a concern. Yeah. It might be easier thing tonight would have been for me to say, all right, 30 days, let's do it.'",
        "'speaker_3': 'But. What? What is the meaning of the 30 days? I guess that's just what I don't understand. Why? 30 days? Because we were just told the report's not even going to come back for 30 days. So we're going to take the flag down and 30 days with no report.'",
        "'speaker_3': 'I don't quite understand that thinking, but if somebody can help me understand that again, I'm I'm I'm more supportive of the community and the message and the fight then, then I can express in my words. And if it takes me voting for a flag to go up for 30 days and come down in 30 days to prove'",
        "'speaker_3': 'that, then, then I'll do that. But I would hope that my actions would would mean more than putting up a flag for 30 days.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_8': 'Thank you, Mayor Garcia. And so I would I would say that, you know, I was I was I listened. It was my first first time in the hot seat. And I listened. I was, you know, front and center and listened to all of the testimony.'",
        "'speaker_8': 'And some stuff did stand out. To me, particularly, James, was those comments when he said, you know, a conversation about a single proposal turned into an all like all all flags matter conversation. And that did resound to me because before rushing to and I'm guilty of as well, I also, you know, I threw in the interfaith flag'",
        "'speaker_8': 'and all those things because I was approached with that over the course of the last week. But I think there you know, there is something to say there about when you step forward to say here is one community that has a certain circumstance and we are in the middle of a fight.'",
        "'speaker_8': 'Let's talk about this fight. Not all the fights right now. We can study and talk about all the fights that it may actually make sense to me. So if a colleague were to come forth and say, here's an issue that I sincerely care about, I want our council in our city to acknowledge it for a period of'",
        "'speaker_8': 'time. I also acknowledge all of these other things, and I'm inclusive of those as well. But I'm asking for a special acknowledgment. Hearing that and putting that perspective. I think the compromise proposal by Porter does make sense. Now, that came from public comment.'",
        "'speaker_8': 'Now, the distinction is what I heard. What I heard from from the public comment was, you know, acknowledge the request by flying it over the course of the study. It didn't say 30 days. It said over the course of the study.'",
        "'speaker_8': 'And that makes that make sense to me along the lines of, you know, the thinking that Councilmember Price said. So I could I could understand I could actually support that, because it does make sense. We're acknowledging the request, and we are also why we go through the process of evaluating our flag policy, looking at, you know, all'",
        "'speaker_8': 'the groups that made these requests because frankly, you know, certain issues, you know, it's very passionate to a lot of people. And we do have a job as a city who cares about tolerance and cares about diversity and values, differences.'",
        "'speaker_8': 'We do have a job to look at all of them. So I would just say I'm going to be supportive of the motion. I would hope that it actually just it just aligns with a study to where we fly it until we make a decision as the full council on what our flag policy is.'",
        "'speaker_8': 'So that's my hope. And it's not a friendly I'm just throwing it out there. That's where I think where where I think this conversation should go. Thanks.'",
        "'speaker_0': 'Thank you. Councilwoman Gonzales.'",
        "'speaker_7': 'Again, I'll just reinforce, you know, I think this was a really good, fruitful discussion. I think, you know, as much as we want to, of course, see what the flag study will bring, which is something that we will certainly do.'",
        "'speaker_7': 'I think that is very important knowing that we have a new civic center coming up. But I will agree, I think in the interim, there's always going to be there's always going to be a demographic that needs our our support.'",
        "'speaker_7': 'And I think that if there's any demographic here in the city, of course, certainly veterans I'm a granddaughter of a World War Two veteran. That doesn't make me any less caring for veterans. We fly the veteran flag. We fly the American flag.'",
        "'speaker_7': 'I have the American flag of my grandfather's grave sitting on on my in my mantle at my parents house, care much deeply about that. But I think also there's you know, if if there is a council member that is raising a concern.'",
        "'speaker_7': 'You know, we can't address it for that meantime. And so I think it's important that we at least address this. I don't think it's unreasonable to say that we will be flying this as council, as Vice Mayor Rex Richardson said for a short period of time, until we can decide what the flag pole study will bring and'",
        "'speaker_7': 'then hopefully bring a policy back that will be very solid. And so we can move forward from there and decide from there what we need to do. And maybe there's more flags that could come of it. Maybe we take some flags out.'",
        "'speaker_7': 'I don't know what that discussion will bring, but at least we'll have some sort of information. So I hope people can be a little bit more open minded. And, you know, the disrespect that I've been hearing out there, especially from Larry, you know, it's really it's really bad when you hear that type of disrespect, especially with such'",
        "'speaker_7': 'sensitive issues. It's really disrespectful. And I know you come here every every day, every Tuesday. But to hear things in light of, you know, what people have shown is concerns. I would just ask for your respect in that sense.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilmember Pearson.'",
        "'speaker_5': 'Well, first I have to say, I didn't think my first agenda item would be a flag. We were talking about flagpoles for an hour. So thank you guys for sticking out with us and going through this conversation. I want to just get some clarity because Vice Mayor Richardson, you had made a comment about keeping it up.'",
        "'speaker_5': 'Was that a. Because right now we have a friendly amendment for 30 days. Sure.'",
        "'speaker_8': 'So you're just point of order. You're in control of the motion. It's your motion to accept it, to recommend the friendly as a recommendation to change it. And I just simply said the recommendation from Porter, what he said was to go ahead and fly the flag through the course of the study that I think I would support'",
        "'speaker_8': '. It's ultimately in your hands there.'",
        "'speaker_5': 'What?'",
        "'speaker_0': 'Porter actually went second because the city attorney wanted to say something.'",
        "'speaker_9': 'Just a slight correction to the vice mayor. The motion now is the motion of the floor. It's been made in a second and it's been amended. And so anybody could make either offer a friendly or a substitute motion.'",
        "'speaker_9': 'At this time, it's not controlled by the maker anymore because it's now been accepted. And it's it's a motion of the floor.'",
        "'speaker_0': 'And do you want a city attorney? Do you want to read the motion on the floor just so that everyone's clear?'",
        "'speaker_9': 'As I understand it, the motion on the floor is to request city manager to conduct a study regarding the flags at the Civic Center and that the flag would fly for a 30 day period.'",
        "'speaker_0': 'Okay. That's the current motion on the floor. Back to Councilmember Pearce.'",
        "'speaker_5': 'Okay. So that's a commotion on the floor. I'd like to accept that motion. Yes. I ask for your support.'",
        "'speaker_0': 'And you mean you're going to. That's the motion that's on the floor that you support, right? Okay, perfect. Hey, everyone. Everyone has a first couple of weeks, so, you know, we got to make sure that we go over this stuff some time, so.'",
        "'speaker_0': 'Great. So just so just to be clear, Councilmember Pearce, is that there's a motion on the floor which is to do a study asking management and then to also fly the pride of flight for 30 days.'",
        "'speaker_5': 'Councilmember Pearce. Sorry, I want to get clarity how I think that I've heard from a couple of the council members that we don't want to be in the situation where we're taking the flag down. Sorry. We're we're in that process of taking it down with it.'",
        "'speaker_5': 'Require a vote. Could we? Is it only 30 days and then it removes that. Okay. It's only 30 days. Are you okay with that? I would prefer to stay up through the course of the study.'",
        "'speaker_8': 'That was that.'",
        "'speaker_1': 'Okay, let me just.'",
        "'speaker_0': 'Actually, no, no, no, no, no, no. Actually, hold on. The only person that has a flaw is cancer fighters.'",
        "'speaker_5': 'I would like to go ahead and request that the friendly amendments that we remove the friendly amendments. Yes, that.'",
        "'speaker_0': 'So who made this? Who made the friendly amendment?'",
        "'speaker_9': 'Council member.'",
        "'speaker_5': 'Anon, I remember you guys when you were first new to.'",
        "'speaker_2': 'Yeah, of course.'",
        "'speaker_0': 'That's okay.'",
        "'speaker_2': 'Still. Still?'",
        "'speaker_5': 'Yeah. So the original motion I would like to ask you withdraw the friendly Daryl Mr. Supernova council membership and all that way we don't have to be in a situation where we're taking the flag down.'",
        "'speaker_9': 'If the if the friendly is removed and the motion is to conduct a study in the flag would not be flown at this time.'",
        "'speaker_5': 'That's not what my original.'",
        "'speaker_9': 'Original motion said, that you wanted to fly it until there was, I believe, sorry, recognition at the federal level.'",
        "'speaker_5': 'Yeah. Okay.'",
        "'speaker_0': 'Okay. Actually, guys from the audience, please be respectful.'",
        "'speaker_5': 'Thank you. What I would like is the study to be done, and I would like for us to raise the flag until the study is complete.'",
        "'speaker_0': 'Okay. So there's a motion. There was a second on that motion, I'm assuming from my thing was Councilwoman Gonzalez, is that right? Okay. Is is. Is that fine, Dulles? Okay. So the motion is to go forward with the study.'",
        "'speaker_0': 'And until when the study is complete, we'll fly the fly the flag until the study is complete, basically.'",
        "'speaker_9': 'Thank you. And Vice Premier, that technically is substantive motion because the original motion has been now amended. There was no withdrawal the second.'",
        "'speaker_0': 'But. But can you substitute yourself?'",
        "'speaker_9': 'Yes, you can.'",
        "'speaker_0': 'Okay, great. That's. That's we learn something every day.'",
        "'speaker_1': 'Okay, so.'",
        "'speaker_0': 'So there's that. We have a substitute motion on the floor, which is to do do a study and to fly the flag until the study is complete. That's from what I understand where we are right now.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Okay, Vice Mayor Richardson.'",
        "'speaker_8': 'I'm good.'",
        "'speaker_0': 'Thank you. Okay. Okay. Not to throw everybody.'",
        "'speaker_2': 'Sorry, everyone.'",
        "'speaker_0': 'No problem. Okay. Councilmember Superman.'",
        "'speaker_6': 'I just have to go on record as saying that I brought forth a friendly amendment based on what the speakers said, and that is what has been rejected. Thank you.'",
        "'speaker_0': 'Okay. And I just want to make one comment before the vote. Not that I want to add more work to the city manager, but I know that and I wasn't here for the whole conversation. But something that that's important to me that other cities do is other cities, when there's actual private development that happens, they actually require'",
        "'speaker_0': 'the United States American flag to be flown on private commercial development or large developments. I don't think we have that in Long Beach. And it's something that I even believe the city of Los Angeles does, where you fly the American flag when there's other large private developments.'",
        "'speaker_0': 'So can we look at those those policies when it relates to the United States flag? Separate of this flag conversation. But for because I think that would be great if we could do that. Okay. Okay. Any other conversations about this?'",
        "'speaker_0': 'Okay. So there's a motion and a second on the floor. Members, please go ahead and cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Motion carries. Thank you. Next up, we're going to go ahead and do item number. 13.'"
    ],
    "Recommendation to request City Manager to have the Parks, Recreation and Marine Department and the Public Works Department review the list of trees approved for planting in parks, parkways, medians and other public properties and report back to council with a new list of approved trees.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please.'",
        "'speaker_2': 'Item 15. Communication from Council Member Pearce and Council Member Super Nan. Recommendation to request the City Manager to have Parks, Recreation and Marine and the Public Works Department review the list of trees approved for planting in public properties and report back to council with a new list of approved trees.'",
        "'speaker_0': 'Council member, Peter.'",
        "'speaker_5': 'Thank you. This item came up through the discussion of how many trees we were going to be trimming and possibly the trees that we would be removing due to the drought or just the fact that they're old and we have an outdated list of trees that we would like to ask for, a new list that includes drought'",
        "'speaker_5': 'tolerant, that also considers historical context and neighborhood context. So it's a simple request.'",
        "'speaker_0': 'All right. Motion in a second. Councilman Mongo. Okay. Councilman Price.'",
        "'speaker_3': 'Thank you. I want to thank my colleagues for bringing this item. I think this is a fantastic item. It's something that an issue that comes up all the time. I know that the city is currently undergoing a bike history policy.'",
        "'speaker_3': 'Is that right? The ficus tree policy.'",
        "'speaker_9': 'I'm not aware of that.'",
        "'speaker_3': 'I think, Mr. Beck of ficus tree policy.'",
        "'speaker_1': 'Councilmember Price, I think you're referring to a recent action taken by the city's tree committee relative to focus trees in the public right of way. And basically the committee took action that that looked at removing ficus trees from the right of way because of the damage that they caused to sidewalks and to storm drains and other utilities'",
        "'speaker_1': '. So I apologize for the interruption, but the Tree Committee basically felt that there are other trees that are more appropriate for the park, for the parkways, besides effects.'",
        "'speaker_3': 'Okay. Thank you. Well, that's a that's an exact makes my point. Exactly. We have a lot of trees that are planted in medians that later turn out to be visual obstructions or require too much irrigation for medians. And I know we have reoccurring issues on sidewalks, so I think this is a great agenda item.'",
        "'speaker_3': 'I want to commend my colleague, Council Member Pearce for bringing this item and Councilman Super now for signing on. I think this is some this is this should help guide us in the future when we're planning new park spaces and medians because we I cannot tell you how many calls our office gets about landscaping in the public'",
        "'speaker_3': 'right away. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_10': 'Yes. Thank you. A question for staff. Do we already have a list of what's released? That actually speak to this motion already?'",
        "'speaker_1': 'Yes, Councilmember Austin, there is an existing approved street tree list. It was last updated, to my knowledge, in 2012. So I think it would be worthwhile to look at it again. I don't have the number, the exact number in front of me, but it's somewhere in the neighborhood of 70 to 90 different species of trees.'",
        "'speaker_10': 'Okay. Well, our interns actually did did some research and came up with the list. And I think that's that's about accurate. But I think I see about, you know, at least 15 or so drought tolerant trees in California, native trees.'",
        "'speaker_10': 'Um, have there been new trees? Kind of. Created since 2012. That's the question.'",
        "'speaker_1': 'I don't have an answer to that. But again, as staff, we're more than willing to look at the tree list. And if there's updates necessary to bring forward, we'd be happy to do that.'",
        "'speaker_10': 'Okay, I'll make sure that my colleagues get a copy of this list as well.'",
        "'speaker_0': 'Councilman. Gringo.'",
        "'speaker_9': 'Thank you. The only one concern I would raise is that in my district, we have Christmas tree laying. And there are trees already in. Who have lived their their lives and are at the end of their longevity. And the neighborhood in that area, the association and the Wrigley Area Neighborhood Alliance, are very concerned about those trees.'",
        "'speaker_9': 'If they were to come down, what would they be replaced with? Obviously, there's discussion about replacing them with like trees, however, that those trees are highly, highly. High maintenance in respect to what they require. So if we do the study, I would want to include some kind of tree, if you will, as an alternate that would serve'",
        "'speaker_9': 'a purpose of a Christmas tree lane. Well, maybe not a a similar tree to the ones that are there now, but at least something that would provide the same type of environment and the type of of celebration that we have every year with the Christmas tree laying.'",
        "'speaker_9': 'Now, there is some discussion taking place in regards to funding for that type of tree. We know that it's going to be expensive and we're going to be looking at that. We've been in discussions with the staff at Parks and Recreation to look at what are our options and what are going to be some of the the'",
        "'speaker_9': 'costs involved. So not that I want to separate myself or separate the Christmas tree limb from from the study. However, I want to make sure that there is some kind of sensitivity to that particular stretch of street to ensure that we can continue to have the great celebrations that we've had year after year in the past.'",
        "'speaker_0': 'Councilmember Pearce.'",
        "'speaker_5': 'Yes. Thank you, Councilmember Yanga. In the discussion section, we talk about the historical context of trees, definitely recognizing Daisy Lane and the history that's there. And so we want to make sure that in this approved list of trees that we take into consideration those neighborhoods that might have some historical context.'",
        "'speaker_5': 'So definitely including that.'",
        "'speaker_0': 'Public comment. CNN members, please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Q I'm going to try to move that. I know we're trying to get the national night out, which is probably not going to happen, but I'll try. I will try my best, please, if we can. Item 23, please.'"
    ],
    "Recommendation to receive and file a report from the Health and Human Services Department on their outreach and response regarding the recent outbreak of Meningitis in Long Beach particularly with the Lesbian, Gay, Bisexual, Transgender and Queer (LGBTQ) community. The report should include statistics on cases in Long Beach and Los Angeles County, existing outreach and programming in Long Beach, specific outreach efforts with the LGBTQ community and next steps for reducing the number of new cases in Long Beach.": [
        "'speaker_2': 'Communication from Councilwoman Gonzalez, Councilwoman Price and Councilwoman Mongo recommendation to receive and file a report from the Department of Health and Human Services on their outreach and response regarding the recent outbreak of meningitis, particularly with the LGBTQ community.'",
        "'speaker_0': 'Councilman Gonzales.'",
        "'speaker_7': 'Yes, thank you. I want to thank Kelly for being so patient with us, and I'd like to request a staff report from you, if we could.'",
        "'speaker_11': 'Good evening and thanks for the opportunity to share with you our efforts around the meningococcal disease. Just a little bit of a background. So the disease is caused by a bacteria called Neisseria and it can be found in the nose and throat.'",
        "'speaker_11': 'And often people carry it and they don't even realize that they're sick. The meningococcal disease is transmitted from one person to another where there's direct contact either through or sorry saliva or through coughing or sneezing. Close contact, living in the same household or sharing utensils, food or drinks can really can spread.'",
        "'speaker_11': 'So if you're in large group situations like dormitories and other places like that. Your symptoms include things like high fever, bad headaches, stiff neck, nausea and vomiting, confusion, low blood pressure and just muscle pain. Anyone experiencing these symptoms should see their medical provider as soon as possible.'",
        "'speaker_11': 'It can be treated with antibiotics. And then we also encourage the vaccine. And the vaccine kicks in after about 7 to 10 days. What we've found so far in in L.A. County is that there have been 20 confirmed cases in the past few months in L.A., Long Beach and Orange County together.'",
        "'speaker_11': 'Seven of those cases are in Long Beach. And to put those in perspective, we've only had one between 2011 and 2015. So seven is a much higher number. Four of those seven cases have been identified as those among gay or bisexual males.'",
        "'speaker_11': 'And there were two deaths, both in Orange County, because of the disproportionately high prevalence of the disease among men who are gay or bisexual. It's now recommended that for all gay or bisexual men and anyone who is HIV positive, regardless of any individual other risk factors, that they should be vaccinated.'",
        "'speaker_11': 'Our efforts so far is we're really partnering closely with L.A. County and Orange County in our work and also with our community providers. We've collaborated with the LGBTQ center in Long Beach. We offer two Saturday clinics, free vaccinations, and we're able to give 122 vaccinations total between those two days.'",
        "'speaker_11': 'We're offering free vaccines at the health department so anybody who can come in, make an appointment and we'll provide a free vaccine. We've given out 139 total. Beyond that, the other places that are providing the free vaccine are also the AP Health and Wellness Clinic at Saint Mary's and Age founded Health Care Foundation on PCH.'",
        "'speaker_11': 'We're providing up to all of our health care providers so that they're like we're letting them know about the vaccine recommendations, guidelines, reporting and other outbreak information. And we're also working with local providers if they need to get ahold, if they need some vaccine, we're working closely with them to make sure that they have it.'",
        "'speaker_11': 'So overall, we're really we're tracking on this. We're partnering very closely. We're in conversations with the CDC, with the state public health and our partners, and really outreaching and educating as much as possible to make sure that people are vaccinated as appropriate.'",
        "'speaker_11': 'That's the end of my report if you have questions.'",
        "'speaker_1': 'Thank you. Oh.'",
        "'speaker_0': 'Sorry. Thank you.'",
        "'speaker_7': 'Councilwoman Gonzales, there's an echo in here. Thank you. Sorry. I just wanted to thank you, Kelly, for bringing this forward. I wanted to make sure that we had another educational forum for residents to learn about this meningitis and what they can do to prevent this disease.'",
        "'speaker_7': 'And I want to thank your staff and you for being so committed. Also working with the center to be able to provide vaccines to our communities. I have a couple of questions. As we've had this outbreak and I don't know if it's now titled as an outbreak, but what is our like how is our community outreach?'",
        "'speaker_7': 'I mean, what are we what is our normal process? I know you said you connected directly with the LGBT center, but are there any other outlets that you use for communication?'",
        "'speaker_11': 'Yeah. So at play and also the AIDS Health Care Foundation, we're reaching out through through those populations, through those organizations as well, as well as all health care providers. So anyone who goes in and is being seen and has concerns that they know about the vaccination and how that can occur.'",
        "'speaker_7': 'Okay. And then is there a point person at the health department in your shop that is working on this directly? Or who would that person be normally if there is something similar that would or if this grew for any reason, unfortunately.'",
        "'speaker_11': 'Yeah. So Dr. Marotta, who is our acting health officer and as well as Josh Jacobs, who is our clinical supervisor, the two of them are really participating in those outreach efforts. And then our epidemiology group, John Holguin, is leading the tracking and the investigation portion.'",
        "'speaker_11': 'So if someone comes in and is diagnosed, we do reach out to those who they've had contact with to make sure that they if they have the illness, that they're on antibiotics immediately.'",
        "'speaker_7': 'Great. And I would also just suggest that going forward, if we do have something similar where we can reach a specific demographic like the LGBTQ community, perhaps we can look at other areas. Like some, you know, the maybe billboards that we can put up that, you know, say, hey, get vaccinated, this is where you go here.'",
        "'speaker_7': 'Or some places like, you know, that maybe the LGBT community frequents a little bit more often. So I'm just thinking of those additional ways to to outreach. Yeah.'",
        "'speaker_2': 'But yeah, so.'",
        "'speaker_11': 'I just it just on our website, we do have frequently asked question pages. The L.A. County also has a very good website about different clinics that are offering the free vaccine and other information. If anybody needs additional information.'",
        "'speaker_7': 'Great. Well, I think 139 vaccines to our community is just tremendous. I want to thank you again your team. I want to thank Senator Laura. We had an event with also thinking council member Pearce for for being there and supporting.'",
        "'speaker_7': 'And I also want to thank my co-sponsors, Councilwoman Pryce and Mongo, for also being committed to to seeing this through. So thank all of you.'",
        "'speaker_0': 'Great. Councilwoman Pryce.'",
        "'speaker_3': 'I just want to thank Councilwoman Gonzalez for bringing this forward and Kelly for a fantastic staff report. Thank you.'",
        "'speaker_0': 'Yes, Kelly. Excellent. Always excellent work. Thank you. Public comment saying yes. Please come forward. Come on down. If you don't have a comment, line up, please.'",
        "'speaker_1': 'That was my jog down to get my 3 minutes started.'",
        "'speaker_2': 'So, Counsel, thank you very much. And thank you very much to the health department for taking this meningitis outbreak seriously. The LGBTQ center is incredibly proud to partner with the health department to offer free vaccinations. We are incredibly thankful to Senator Laura and Councilwoman Gonzalez for hosting an event along with Hamburger Mary's and Long Beach Lesbian Gay'",
        "'speaker_2': 'Pride that.'",
        "'speaker_1': 'Raised funds for our organization to be able to.'",
        "'speaker_2': 'Provide outreach from a community perspective. One of the things I can absolutely tell you is I have owners of our LGBTQ bars asking if the health department has capacity.'",
        "'speaker_1': 'To bring out mobile units.'",
        "'speaker_2': 'To provide vaccinations. While the center is.'",
        "'speaker_1': 'Always happy to provide space.'",
        "'speaker_2': 'To provide vaccinations, we're really fortunate we can provide vaccinations. They can provide vaccinations. The more we can get folks out in the community where they're congregating, where there's going to be an easy access point is going to be a win win to get folks.'",
        "'speaker_1': 'These.'",
        "'speaker_2': 'Vaccinations. So, you know, we're really looking to work with the health department on what we can do to increase that capacity to especially reach our gay and bisexual men who are most at.'",
        "'speaker_1': 'Risk for contracting meningitis.'",
        "'speaker_2': 'We are also here to serve as a partner.'",
        "'speaker_1': 'In order to.'",
        "'speaker_2': 'Share information. Heaven forbid there is another there's another outbreak of something contagious impacting our community or any community. We want to be there to be able to get information that is accurate, listing vaccination sites out as quickly as possible, especially with an illness that can be prevented by vaccination.'",
        "'speaker_2': 'It's not enough to provide information. It's critical that information on where folks can be vaccinated is included in those preliminary messaging and talking points that.'",
        "'speaker_1': 'Are sent out to communities.'",
        "'speaker_2': 'But we are again incredibly proud to partner with the health department to offer resources to our community. We're incredibly thankful of.'",
        "'speaker_1': 'The support.'",
        "'speaker_2': 'Of our city council on taking this issue seriously. And thank.'",
        "'speaker_1': 'You very much for.'",
        "'speaker_2': 'Your consideration and thinking about the meningitis outbreak happening right now.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Good evening. Miguel Gutierrez, health care consultant. Today, I'm speaking on behalf of an organization I work with, APL Health. The new federally funded health center has been seeing dozens of persons and vaccinating them, thanks to the effort of the Department of Health, the LGBT Center.'",
        "'speaker_1': 'And in addition to some of the outreach events that have been occurring, championed by Councilmembers Pierson, Gonzales and State Senator Latta, there's been a pretty good social media campaign going on as well. And again, those vaccination clinics were pretty effective.'",
        "'speaker_1': 'One of the things that I wanted to say is actually we're taking notice that even persons from outside of the county boundaries are coming in, taking notice of the lead that we have here in Long Beach on this issue.'",
        "'speaker_1': 'And I really wanted to commend the organizations for that. Know, as a consultant, I did speak to Kelly just very briefly. And one of the things I recommended was that, you know, the future report contains some type of correspondence.'",
        "'speaker_1': 'We have two large hospitals with EHRs as thousands of persons every year. We have several large physician groups that represent hundreds of physicians. And in addition to that, we have a health plan with multiple clinics here in the city.'",
        "'speaker_1': 'It would be good to get written correspondence from those organizations, considering they take care of thousands of Long Beach lives and just get an understanding of really what actions they're going to take with respect to outreach, notifying the patients that come through their doors, letting them know what the risk factors are.'",
        "'speaker_1': 'In addition to that, what are their plans for vaccination? Are they going to bring on vaccines or are they going to refer to a partner that carries some of the free county vaccine? Again, these are, again, some just recommendations, not a criticism at all.'",
        "'speaker_1': 'I just had a little more time to think about it over the last few hours. But again, I thank you again for your consideration.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening. I'm very impressed. You guys are all still with us at this point. And so congratulations. My name is Ace Robinson. I'm a new resident of City of Long Beach. I'm in the third district. I serve as the executive director of Care Program at Dignity Health in St Mary's Medical Center.'",
        "'speaker_6': 'For the past 30 years, as you may well know, CARE or the Comprehensive AIDS Research and Education Program has addressed medical and social needs of people living with HIV entities such as care that primarily serve people living with HIV historically and presently serve people who are often co-infected with other bacterial and viral diseases due to their compromised'",
        "'speaker_6': 'immune system. Therefore, diseases that are normally rare can often become more prevalent in their social communities, even if their friends or their loved ones are not living with HIV. Due to the recent outbreak of meningitis in L.A. County, inclusive for Long Beach Care's clientele must be highly diligent to ensure that meningitis is not, in fact, more people'",
        "'speaker_6': 'without hindrance. They not only rely on the care program, but also the mayor, the city council and the Department of Public Health of L.A. and our Health and Human Services Department to support them. HIV disproportionately impacts gay and bisexual men, thus to the high rates of co-infection of people living with HIV and meningitis also disproportionately impacts these'",
        "'speaker_6': 'same populations such as myself. In order to accomplish the shared goals of the Long Beach Department of Health and Human Services and the Memphis City Council. Care fully supports the Council members recommendation to receive and file the report outreach in response to the recent outbreak of meningitis, but also to strongly recommend a thorough review of the amount'",
        "'speaker_6': 'of culturally tailored.'",
        "'speaker_1': 'Outreach.'",
        "'speaker_6': 'To communities disproportionately impacted by meningitis. That includes people living with HIV, that includes gay and bisexual individuals. That also includes our street involved individuals, whether they're chronically or transitioning house and active drug users. We can't actually address all these preventive needs unless we have that tailored type of outreach and the resources allocated to deliver culturally competent and'",
        "'speaker_6': 'medically accurate information to communities at risk for meningitis. Of the 89 people that we delivered the vaccine to, I would say if I had to guess, maybe about 10 to 15 of them actually knew how meningitis could be transmitted and if they were at risk.'",
        "'speaker_6': 'And a lot of them had those types of questions as do I need to get a booster? Is this something I already had? So and so forth. So we need more information. And so finally cares. Committed to providing the competent, timely care to all of our populations.'",
        "'speaker_6': 'And I look forward to your support. Thank you for your type of time and attention.'",
        "'speaker_0': 'Thank you. See no other public comment. We're going to go ahead and back and take a vote. Councilwoman Gonzalez.'",
        "'speaker_7': 'I just wanted to thank all three of you, Porter and Miguel Ace, for being here and your expertize. And I know that Kelly and I are taking notes and we'll certainly work together to get some of those suggestions implemented.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Council member Pearce.'",
        "'speaker_5': 'Yes. I just wanted to say thank you, Kelly, for your report back and definitely want to encourage us to think about how we are being culturally sensitive and doing outreach to places that we might not typically do outreach to and say that I'm here as a resource for you all and any outreach that you guys might need'",
        "'speaker_5': '. Thank you.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_10': 'Thank you. I think this is a great item, is very responsible. I think that the last speaker actually made some some great points. And I'm not exactly sure that that that his points are actually codified in this language.'",
        "'speaker_10': 'Are we going to do outreach to the homeless and the street population as he he recommended? I think that that that is very, very important that we include that in this. Would you be open to a friendly amendment to do that?'",
        "'speaker_7': 'Oh, sure, absolutely. I think. Kelly, are we doing that at this point or I mean, I know it's. Kind of new. I don't.'",
        "'speaker_11': 'Yeah. Currently we have not been doing that as much, but I've taken notes on all that came through and we'll be going back to work with our team to address this, as well as with the other partners who are in the room that we've discussed and other partners in the community.'",
        "'speaker_7': 'Yes, absolutely. And thank you, Councilmember Austin. Thank you, Kelly.'",
        "'speaker_0': 'Thank you. With that, please take a vote.'"
    ],
    "Recommendation to adopt Specifications No. RFP EP16-120 for the purchase and development opportunity at 601-685 East Artesia Boulevard/6600-6620 Atlantic Avenue, Assessor Parcel Numbers 7115-003-901, -902, -903, -904, -905, -906, -907 (Subject Property);  Declare the City-owned Subject Property as surplus;   Authorize City Manager, or designee, to execute any and all necessary documents including a Purchase and Sale Agreement with Frontier Real Estate Investments, LLC, a California limited liability company, or affiliate, for the sale of the Subject Property in the amount of $2,100,000; and  Accept Categorical Exemption CE 16-165.  (District 9)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Next item is to 18.'",
        "'speaker_2': 'Report from Economic and Property Development and Development Services Recommendation to adopt specifications for the purchase and development opportunity at 6013 685 Estrategia Boulevard 6602 6620 Atlantic Avenue. Declare the city owned property a surplus and execute all necessary documents with frontier real estate investments for the sale of the property in the amount of 2.1 million District nine.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_8': 'I want to reserve my comments after the staff report, please.'",
        "'speaker_0': 'Mr. West.'",
        "'speaker_1': 'Mike Conway Mayor Garcia, Member City Council. This item relates to a future development.'",
        "'speaker_9': 'Property located at the northeast corner of Atlantic Avenue and Artesia.'",
        "'speaker_1': 'Boulevard.'",
        "'speaker_9': 'This property contains 2.14 acres and is undeveloped.'",
        "'speaker_1': 'An RFP was released and four submittals were received. The selection panel unanimously preferred the proposal submitted by frontier real estate investments. While the price offered for the property was slightly.'",
        "'speaker_9': 'Lower than the highest price, the total investment value.'",
        "'speaker_1': 'Was significantly higher. The developer proposals proposes to develop 13,200 square feet of commercial and retail buildings with proposed uses that are needed.'",
        "'speaker_9': 'Within the local community, including.'",
        "'speaker_1': 'A commercial bank. Staff request the council approve.'",
        "'speaker_9': 'The recommended action, and I stand ready to answer your questions.'",
        "'speaker_8': 'Thank you. I'll go ahead and give my comments now, Mr. Mayor. Okay. So I'm obviously thrilled to be approving this project tonight. Having worked, you know, as chief of staff to Councilman Neal, who's here in the audience and working in this community for four, six, seven years.'",
        "'speaker_8': 'This is the one project that, you know, people for decades have asked about when are we going to develop this vacant lot on Atlantic in Artesia? So so tonight, this is the second of three major ninth District successor, Regency Park properties that's moving forward and really anchors the corner of Atlantic as well as Artesia, the developer Frontier'",
        "'speaker_8': 'Real Estate Investments has extensive experience and experience in development construction. I was very impressed with the proposal that they submitted. They demonstrated a strong focus on community needs, and it was very responsive to community interests. They've committed to civic engagement, continuing civic engagement through the course of this process, setting a new design standard for for our community'",
        "'speaker_8': 'and helping us to achieve our goals that, you know, we've we've we've looked for for a long time a number of amenities that have been lacking in District nine and North Long Beach, namely a financial institution targeting a sit down restaurant and retail space spaces for the community to gather.'",
        "'speaker_8': 'And I want to borrow former Vice Mayor Lowenthal comment, the public living room, a coffee shop and a development that really anchors much of the other activities taking place on the Artesian Atlantic corridor. So this is this is pretty huge for for us here in North Long Beach.'",
        "'speaker_8': 'We're really excited about this. I'm confident that the developer will fulfill the vision of the site and look forward to the full development along the timeline. So thank you. And those are my comments.'",
        "'speaker_0': 'Councilman Ranga.'",
        "'speaker_9': 'I totally support this motion and I congratulate Richardson on a successful project.'",
        "'speaker_0': 'And I also want to congratulate Vice Mayor Richardson, but also staff. You guys worked very hard on this. Very, very hard. And I love all the development that's happening in Long Beach right now. I love it. I love this.'",
        "'speaker_0': 'I want to fill all these frickin open parcels with development. The more, the better. Come on down. Develop our city, the more. It's missing a couple flagpoles. But besides that. Any public comment? Please come forward.'",
        "'speaker_9': 'Yes. Josh Butler with Housing Long Beach. We two commend the city for being able to sell all these vacant lots and develop them as well. We just want to be sure and I know a speaker came to council recently to ask if we're following the Surplus Land Act, which requires that these properties be offered up for affordable'",
        "'speaker_9': 'housing development as well as perhaps parks space as well. This has been a major issue in other cities and including Oakland, which had to turn back around on the sale of many of their properties to provide opportunities for public space, affordable housing and given the amount of public land that we've been selling off on a regular basis'",
        "'speaker_9': 'here all throughout the downtown, and now we're seeing already a lot sell sold off in other cities. I just want to make sure that we don't come back and have to look at that. We did not follow the Surplus Land Act and if any council members have had any conversations about that at all.'",
        "'speaker_9': 'Thank you. We just want to go on record as at least questioning this and the sale of other properties as well. Well, Miami property, the Long Beach Boulevard property that was recently sold as well. Questions about whether or not affordable housing developers had an opportunity at purchasing that property.'",
        "'speaker_0': 'Thank you. We have addressed that question. Mr. City Attorney, do you want to comment on that?'",
        "'speaker_9': 'Yes, we have complied with the Surplus Land Act and that notice was sent.'",
        "'speaker_1': 'I think you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, Mayor. City Council and Staff. My name is Tasha Hunter with the Uptown Business Improvement District. And I want to say that we're very excited to have this development frontier come. The community has we've had some focus groups since I've been in the position as the business district manager and one of the common denominators and common'",
        "'speaker_2': 'things said was that the community wanted something to do, they wanted a place to go, and they wanted they wanted a nice sit down restaurant bank and as vice mayor said, coffee shop, different things. So we're very excited.'",
        "'speaker_2': 'The business district supports having Frontier there and we look forward to breaking ground. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_1': 'Good evening, esteemed Mayor. City Council. My name is Steve Neal. Address on file. And I would like to thank the city council and Councilmember Richards, Vice Mayor Richardson, for his diligence in this project. I can speak on behalf of the communities of North Long Beach and they are very excited about this development.'",
        "'speaker_1': 'This parcel has been sitting vacant prior to my term, going back into the term of my predecessor. So it is well overdue. So I'd like to commend you on your hard work and thank you for your diligence. Congratulations.'",
        "'speaker_0': 'Steve, I just want to tell you, we desperately miss you.'",
        "'speaker_1': 'I just getting your. Let me say something. After after sitting here tonight. I loved it while I was here. But you guys are doing a bang up job and continue to fight.'",
        "'speaker_0': 'I just get it. And congratulations, Councilmember, on the major appointment. Next speaker, please.'",
        "'speaker_2': 'Hi. Good evening. My name is Susan Doan and I'm a property owner in Long Beach. I'm also a broker and I really want to say thank you for letting me speak tonight. And Councilman Richardson, congratulation on your magnificent project.'",
        "'speaker_2': 'These RDA properties have been sitting vacant and unused long enough since the I guess the idea went away in 2011. I have one question. There is over a 500,000 shortage of housing in the state of California. L.A. County alone has 50,000.'",
        "'speaker_2': 'These are facts that you can substantiate. I also have a client in Long Beach who is an affordable housing developer, and he indicated to me on numerous occasions that Long Beach was unfriendly to to them as far as their developing.'",
        "'speaker_2': 'So they went out of the area and even out of state. My question is, can we use some of these RDA properties for affordable housing? That's it. Thank you.'",
        "'speaker_0': 'Thank you. And I do know that just just to clarify. So the way that these properties work, I believe we've actually had about over 200 parcels across the city that we're selling. And part of the process is that the city is also limited on what actually can be develop on the site.'",
        "'speaker_0': 'And so there's actually a state stamped, approved, approved process of what and how we have to sell these properties. And in many cases, in some cases, it's to the highest bidder. In other cases, it's a pre-development agreement with the city.'",
        "'speaker_0': 'In other cases, it's just a fire sale on the property. And so I just want to also clarify that with the city part of this process, the city lot has lost a lot of control in how to develop these parcels as well.'",
        "'speaker_0': 'But we have a motion in a second. And again, congratulations on this is fantastic. Please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please.'",
        "'speaker_2': 'Item 16.'",
        "'speaker_0': 'Let's go back to 17. I'm sorry, did we do it? I don't think we did. 17. So. Is there a 16 also? What is six? I'm sorry. Let me go back one more. Okay. Let me do 16, which I think is being moves forward.'"
    ],
    "Recommendation to adopt Specifications No. RFP EP16-129 for the purchase and development opportunity at Pine Avenue and Pacific Coast Highway (1814 Pine Avenue/101 East Pacific Coast Highway), Assessor Parcel Numbers 7209-016-900 -901 (Subject Property);  Declare the City-owned Subject Property as surplus;   Authorize City Manager, or designee, to execute any and all necessary documents, including a Purchase and Sale Agreement with Mkott Pich, LLC, a California limited liability company, for the sale of the Subject Property in the amount of $370,000; and  Accept Categorical Exemption CE 16-177.  (District 6)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. Item 17.'",
        "'speaker_2': 'A report from Economic and Property Development and Development Services recommendation to adopt specifications for the purchase and development opportunity at Pine Avenue and Pacific Coast Highway. Declare the city on property as surplus and execute all necessary documents with any court pick for the sale of the property in the amount of $370,000.'",
        "'speaker_2': 'District six.'",
        "'speaker_0': 'Mr. Kent Do you want to do that report first? Mr. WEST Because I'm hearing a few things from the audience, and please, we got to refrain from that. So, Mr. West, Mike Conway.'",
        "'speaker_1': 'Mayor Garcia, members of the City Council, this item relates to a future development.'",
        "'speaker_9': 'Property located at the northeast corner of Pine and PCH, formerly containing the recycling center known as Cache for cans.'",
        "'speaker_1': 'An RFP was released seeking proposals for the development of the property. Two proposals were received. Of the two proposals, the.'",
        "'speaker_9': 'Selection panel unanimously preferred the proposal submitted by Scott.'",
        "'speaker_1': 'Pitch, which proposal provides for the development of.'",
        "'speaker_9': 'A retail center containing.'",
        "'speaker_1': '5500 square feet.'",
        "'speaker_9': 'With that, staff stands ready to answer your questions.'",
        "'speaker_10': 'Councilman Austin Certainly I stand in support of this. Councilmember Andrews was wasn't able to be here. He had a he could be here. So he asked me to stand in support. Obviously, PCH is a critical area for economic development and this property has been vacant for a long time.'",
        "'speaker_10': 'And so this is progress for the sixth District right there, PCH and Pine. And so I'd ask for your support.'",
        "'speaker_0': 'There's a second by Vice Mayor Richardson. Is there any public comment?'",
        "'speaker_9': 'Once again, we have a sale of another of public land that's not necessarily being used here for a public good and it's not being used for affordable housing. We again questioning the Surplus Land Act by the state of California, which requires municipalities to, in good faith, provide opportunities for affordable housing developers to make bids on these properties'",
        "'speaker_9': 'and to develop them a priority for affordable housing. And again, we're just not sure that that's happening and it hasn't been happening with a large number of sales or redevelopment lots. And given the affordable housing crisis that we're facing in the city, with vacancy rates hovering at 2% and lower rents that are going up over 10%, the'",
        "'speaker_9': 'largest rent increases in the state of California, the second largest rent increases in the entire country. That with the shrinking housing stock, perhaps we should be looking at using these lots for affordable housing, or at least looking at if the Surplus Land Act would benefit us in using and using that to develop these properties for affordable housing'",
        "'speaker_9': '. I just want to go on record as housing lobby, questioning whether or not we're following the Surplus Land Act. Thank you very.'",
        "'speaker_1': 'Much. And may or may be a.'",
        "'speaker_9': 'Direct response to that. Sure. If Josh would like.'",
        "'speaker_1': 'To look at the towards the bottom of.'",
        "'speaker_9': 'Page three on both staff reports and compliance with government government code section.'",
        "'speaker_1': '54220.'",
        "'speaker_9': 'Chapter 621 Statutes of 1968. On June 1st.'",
        "'speaker_1': 'And December 8th, staff notified the state of California.'",
        "'speaker_9': 'That the.'",
        "'speaker_1': 'Successor.'",
        "'speaker_9': 'Agency was declaring all future development and sale.'",
        "'speaker_1': 'Properties as surplus.'",
        "'speaker_9': 'Yes. And it's a it's my question is, is what are our requirements with regards to how we go about selling the surplus property? Are we prioritizing affordable housing? Because that's my understanding of the Surplus Land Act. Surplus land requires a notification to the state, which we complied with.'",
        "'speaker_9': 'What about to the affordable housing developers that these sites are for?'",
        "'speaker_0': 'So, so. So. Thank you. So obviously this is not option for the back and forth. But what we are clearly there's some questions, Josh, that you might have about our process. So, Mr. Conaway, can you just make sure you connect with Mr. Butler offline and just tell him the process so what we do?'",
        "'speaker_0': 'My pleasure.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_9': 'I appreciate it. Thank you, Mr. Mayor.'",
        "'speaker_0': 'Sure thing. Okay. There's a motion to say and the other public comment saying non, please cast your votes.'"
    ],
    "Recommendation to adopt Specifications No. RFP PW16-131 and award a contract to United Storm Water, Inc., of City of Industry, CA, to provide storm drain routine maintenance and repair, in an annual amount of $276,000, and authorize an annual 25 percent contingency in the amount of $69,000, for a total annual contract amount not to exceed $345,000, for a period of three years, with the option to renew for two additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next up is item 19.'",
        "'speaker_2': 'Report from Public Works Recommendation to award a contract to United Stormwater to provide storm drain, routine maintenance and repair for a total contract amount, not to exceed 345,000 citywide.'",
        "'speaker_0': 'There's a motion and a second. Is there any public comment saying, please cast your vote, please come on down.'",
        "'speaker_6': 'Good evening, Honorable Mayor and City Council. My name is Ed Perry and I'm the president of United Strong Water and also United Pumping Service. We're a family owned business. And as I referred to, just the two of us, United, we're a family owned minority business, which next month will be celebrating 45, 46 years in business.'",
        "'speaker_6': 'We provide jobs for about 150 families, including quite a few families here in the city of Long Beach. We are the incumbent for this contract. We've been doing this work for the city of Long Beach for about ten years.'",
        "'speaker_6': 'And from all the feedback that I hear, we're doing a very good job. And if we weren't doing a good job, we would not have been given the the other option optional years winter at the time as we have been in the past.'",
        "'speaker_6': 'There was some protest by by the runner up ocean blue and and I just so I really don't know how that turned out. And that's why I'm here tonight, just to to speak up for our company. But our company is a much larger, much larger organization.'",
        "'speaker_6': 'And we have a lot more resources in the way of equipment of people. The contract that they brought up, a concern about response time. Our contract is principally a maintenance contract. And while there is some an R function, United is very much an air contractor.'",
        "'speaker_6': 'We've been performing emergency response since 1970, actually been delivering on various emergency response contrasting and since 1982. So although there has not been much of a need for the emergency emergency response part of the contract, which might happen if there was flooding due to all the droughts we've been having when that has occurred, we've been Johnny on'",
        "'speaker_6': 'the spot. We've been right there. Our project manager in charge of the contract actually lives in the area and he's actually often shows up on site before and his city employees to do search.'",
        "'speaker_0': 'Just just to let you know also that the recommendation is you're with United Storm Water. Yes, sir. So the recommendation is to award the contract to United Storm Water. And so there is no other thing we're we're looking at right now.'",
        "'speaker_6': 'Okay. Okay. In that case, to the sector, thank you very much for your patronage. All right. That was just good to the intimate. Thank you very much. No problem.'",
        "'speaker_0': 'Thank you for for what you do for the city. There's a motion. There was a motion in a second. No other public comment. Members, please cast your votes.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute contracts with Berg & Associates, Inc., of San Pedro, CA; Griffin Structure, Inc., of Irvine, CA; HDR Construction Control Corporation, of Long Beach, CA; Michael Baker International, Inc., of Irvine, CA; P2S Construction Management, of Long Beach, CA; The Alliance Group Consulting, of Los Angeles, CA; and Totum Corporation, of Long Beach, CA, as part of the list of firms for as-needed Public Works construction management and inspection services, under the same terms and conditions previously approved by the City Council under RFQ PW16-115 (three years, with the option to renew for two additional one-year terms, total aggregate authority of $39,000,000 for all firms).  (Citywide)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Item 20 Report from Public Works Recommendation to execute seven contracts for as needed Public Works, Construction Management and inspection services under the same terms and conditions previously approved by the City Council under RFQ. P.W. 16 Dash 115. Citywide.'",
        "'speaker_0': 'There's a motion and a second. Any public comment saying Please cast your vote?'",
        "'speaker_7': 'Oh, yes. Thank you to our public works staff. So Craig and Pat West and Tom and Charlie, I want to thank you for you know, I had mentioned it in the last meeting and the fact that we're able to add seven more businesses, three of which are from Long Beach, certainly, I think is is a step in'",
        "'speaker_7': 'the right direction. So I appreciate the work. Thank you.'",
        "'speaker_0': 'Thank you. Councilor Austin.'",
        "'speaker_10': 'Yes. I want to also thank staff for being responsive to the questions and adding local businesses and that with this staff report, I really especially appreciate getting the breakdown of companies with local employees and where they live and local jobs.'",
        "'speaker_10': 'It means a lot and it shows that that we are certainly looking out for for folks who are going to give back to our local economy. So thank you and thank you all Councilmember Gonzalez for for champion this issue.'",
        "'speaker_0': 'Okay. There's a motion in a second, please. Any public comment, please cast your votes.'"
    ]
}