{
    "Recommendation to direct City Manager, or his designee, to communicate the Citys support for House Resolution 5101 (CA-Hahn).": [
        "'speaker_4': 'Right. Thank you, Mayor. First of all, I want to thank the Congresswoman for being here this evening and to present this very important resolution regarding the National Freight Network Trust Fund for 2014. As you may be aware, the congresswoman established the very first port committee of the United States Congress.'",
        "'speaker_4': 'This committee was designed with the goal of developing a united solution towards maintaining goods, movement and productivity. Our nation faces a serious infrastructure crisis. I believe it is critical we support dedicated funding for the national freight system. It is my understanding that this legislation will not only create jobs here in Long Beach, but also serve as a'",
        "'speaker_4': 'vehicle for combining the economic downfall of infrastructure transportation that our nation has undergone. If we want our port to remain internationally competitive, I fear that the effective movement of our country's goods is key to our economic achievement. This bill gives us a long term fix by providing the necessary funding towards achieving our goal.'",
        "'speaker_4': 'Today, I urge my colleagues to join me in support of the resolution.'",
        "'speaker_0': 'Can you make the motion?'",
        "'speaker_4': 'I make the motion to please. I support the resolution.'",
        "'speaker_0': 'Okay. There's been a motion and a second by Councilmember Andrews. And with that, I'd like to invite one of our congresswomen here, one of our two members of Congress here in the city of Long Beach. Give her a round of applause.'",
        "'speaker_0': 'Congresswoman Janice Hahn.'",
        "'speaker_5': 'Thank you, Mayor Garcia. Members of the city council. Thank you, councilmember. You're Ranga for your motion and your leadership on this issue. I want to thank you for allowing me to speak regarding this resolution that's being taken up tonight, which supports my legislation, H.R. 5101, the National Freight Network Trust Fund Act of 2014.'",
        "'speaker_5': 'And as everyone here knows tonight, the port of Long Beach, along with the other port over the bridge port of Los Angeles. We are America's port and was glad to meet tonight. John Slater up the new executive director of your port.'",
        "'speaker_5': 'And here in Long Beach, we know that the port is critical to our region and to the nation. As home to one of the world's busiest seaports, leading international trade gateway and employer to over 1 million people annually.'",
        "'speaker_5': 'Ensuring the global competitiveness of the Port of Long Beach is integral to the success of the employees of small businesses, of corporations, of the health of Long Beach. And I know, Mayor Garcia, you have made the growth of the Port of Long Beach, one of your number one priorities for economic empowerment here in the city.'",
        "'speaker_5': 'It's a top priority for Long Beach because it is your economic engine, and that's what will fuel the economic growth for this entire region. But what we know here in Long Beach about the importance of the ports, I found out that members of Congress didn't always know.'",
        "'speaker_5': 'And so from day one, when I went to Congress, I worked to raise the level of discussion and education of what ports mean to our economy, what it means to commerce. So I started as Councilmember Ranga talked about the bipartisan Port Caucus.'",
        "'speaker_5': 'I now have 91 members of Congress, both Republicans and Democrats, who have joined the Port Caucus. Some of them don't even have a port, but they knew that this was going to be an important vehicle for the future of this country.'",
        "'speaker_5': 'I've worked in Congress to increase federal funds for the Port of Long Beach, and I know that's going to increase your global competitiveness and create local jobs. This year, Congress passed and the president signed into law legislation that increases spending for our nation's port infrastructure.'",
        "'speaker_5': 'I fought for the Harbor Maintenance Trust Fund to be spent rather than to be in our nation's bank account. And I fought for more money to go back to the ports that collect that tax, including the Port of Long Beach.'",
        "'speaker_5': 'And last month, I continued the fight when my bipartisan amendment passed the House overwhelmingly to increase funding for our ports by $57 million. And I'm not stopping there. President Obama called for $2.8 billion of freight infrastructure projects on our nation's highways and rail.'",
        "'speaker_5': 'However, the president did not suggest a way to pay for it. But I did. My legislation, the National Freight Network Trust Fund Act of 2014, pays for our nation's freight projects. Last year, I was selected to be on the panel of the 21st century freight transportation, and I brought other members of Congress to the Port of Long'",
        "'speaker_5': 'Beach. Some of these members had never even seen a port, and they did not understand what we see every day and why that matters. And from my work on that panel, I took the leadership role and figured out how to fund crucial infrastructure projects, including and like the Gerald Desmond Bridge replacement and the Demonstration Electric Truck Highway'",
        "'speaker_5': '. This legislation will take 5% of all Customs and Border Protection fees and places them directly in this freight network trust fund. And this will fund projects like dedicated truck lanes on our highways, better bridges, more on dock rail, the last mile coming into our ports across the country.'",
        "'speaker_5': 'Railway, highway grade separations and freight corridors. The most used routes that our freight travels on and across the country. We don't raise taxes and we add at least $2 billion back into the economy every year to create good paying jobs and keep America's port strong and globally competitive.'",
        "'speaker_5': 'Thank you for letting me speak tonight. I urge the council to consider my legislation and I and to offer your support for H.R. 5101, the Freight Network Trust Fund. I believe this is a win for the country, but this is a win for Long Beach.'",
        "'speaker_5': 'And your port. You. Will be the first official body on record as a city municipality that would endorse this. And I think the rest of the country will look to you as being a leader on this issue. Thank you very much.'",
        "'speaker_0': 'Thank you, Congresswoman. Do you have some some members that want to speak? Councilmember Austin.'",
        "'speaker_6': 'Thank you. And I'll be very short. I wanted to take the opportunity to, first of all, thank my colleague, Mr. Durango, Councilmember Durango, for bringing this issue forward. I've served on the 17 Oversight Committee for the City of Long Beach for the last two years.'",
        "'speaker_6': 'And I can tell you with the plans that we have moving forward with Caltrans MTA to improve the 710 corridor, this is a vital piece of federal legislation and we'll give hopefully when it passes, will give us the necessary funding to help move that project forward.'",
        "'speaker_6': 'I just wanted to also thank you for all of the work that you are doing in the district hands on grassroots. You've been meeting with constituents, utilizing our eighth district office, working with the ninth district. And I know tomorrow is your Congress on the corner, and I look forward to joining you there.'",
        "'speaker_6': 'Thank you very much. And I know that the region really appreciate your leadership in D.C.. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_7': 'Thank you, Councilmember Durango, for asking the ninth District and to sign on in support of this. I think it's a great step considering you're the chair of our 17 committee and I'm the chair of our Fed led committee.'",
        "'speaker_7': 'This is exactly what we should be working on. I want to acknowledge our congresswoman, Janice Hahn, who's who's really been hands on and involved in all parts of all parts of her district, which is very special to us.'",
        "'speaker_7': 'I look forward to welcoming you to the ninth District for the Congress on your corner at Fire Station 12 tomorrow. I think this is a great idea. I hope that we, you know, do all that we can to advocate in support of this bill.'",
        "'speaker_7': 'The last few years, we just heard a number of debates right here at the council about zero emissions and truck corridors, freight corridors. And and the fact that we're partnering with our local representative to advocate for a trust fund that can help to support local and regional governments, to fund projects like that is exactly the type of'",
        "'speaker_7': 'partnership here in Long Beach that we need. So I just wanted to chime in and say thank you, Councilmember Urunga, and thank you, Congresswoman Hart.'",
        "'speaker_0': 'Thank you. Councilor Andrews.'",
        "'speaker_8': 'Yeah. Yes. Thank you, guys. Thank you, Mayor. Well, I tell you, I won't get a chance to speak anymore. But, Congresswoman. Mrs. Hahn, I'll let you know that because of this, you know, all I could hear from you, the whole conversation was about jobs.'",
        "'speaker_8': 'And that was in my whole advocate about jobs. And I know how many jobs this will bring to the city of Long Beach. And I want to thank you not only Long Beach, but all over the, you know, city of Long Beach and L.A. Of course, we know the other harbor, but yet and still, you're doing a'",
        "'speaker_8': 'great job. Please keep up the good work. And thank you so much again.'",
        "'speaker_0': 'Thank you. Councilmember Gonzales.'",
        "'speaker_1': 'Thank you, Congresswoman. I just wanted to say we appreciate.'",
        "'speaker_5': 'Your tenacity.'",
        "'speaker_1': 'Always.'",
        "'speaker_5': 'And from San Pedro, my family's hometown.'",
        "'speaker_1': 'To here in the city of Long Beach. Thank you for keeping us on top of port issues. So appreciate it.'",
        "'speaker_0': 'Thank you. Is there any public comment on the item? KC None that we have a motion on the floor. Members, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Congratulations. Thank you, Congressman, for coming down. And this is actually a great Segway to our first presentation. And we have our we have with us today John Slinger Up, who is our new chief executive at the Port of Long Beach.'"
    ],
    "Recommendation to declare ordinance amending Ordinance No. ORD-13-0016 extending for six (6) months the temporary limitation (moratorium) on the issuance of entertainment permits and/or business licenses for businesses that operate with a Type 48 ABC License or related permit in the Downtown Dining and Entertainment District; declaring the urgency thereof; and declaring that this ordinance shall take effect immediately, read and adopted as read.   (Ordinance No. ORD-14-0011)  (District 2)": [
        "'speaker_1': 'Item one report from City Manager Recommendation to receive supporting documentation into the record. Conclude the hearing. Adopt an urgency ordinance amending ordinance number 13 Dash zero zero 16 extending for six months a temporary limitation on the issuance of entertainment permits and or business licenses for business with Type 848 ABC licenses in the Downtown Dining and Entertainment District'",
        "'speaker_1': ', Red and red adopted as red and laid over to the next regular meeting of the City Council for final reading, declaring the urgency thereof and declaring this ordinance shall take effect immediately. District two.'",
        "'speaker_0': 'If you asked.'",
        "'speaker_9': 'Our assistant city manager, Joe Martin.'",
        "'speaker_1': 'Mayor Garcia, members of the city council, Rachel Tanner with the city manager's office, has been working with a task force of downtown stakeholders and will provide a staff report. Mayor, members of the City Council. Good evening. The Downtown Dining and Entertainment.'",
        "'speaker_2': 'District Task District is an area bounded by Third.'",
        "'speaker_5': 'Street.'",
        "'speaker_1': 'And Ocean Boulevard on the north and south and by Pacific and Long Beach boulevards.'",
        "'speaker_2': 'On the east and west. It also includes the pike at Rainbow Harbor and Shoreline Village, as you can see here in the slide. The council piloted.'",
        "'speaker_1': 'The district in 2005 and established it on a permanent basis in 2008. The district establishes consistent hours and operating conditions for businesses requesting entertainment permits. Last August, the City Council initiated a one year moratorium against the issuance of entertainment permits in the district for businesses under a Type 48 ABC license.'",
        "'speaker_1': 'Type 48 licenses typically associated with a.'",
        "'speaker_2': 'Nightclub that his city council directed. The city manager to use the one year pause to.'",
        "'speaker_1': 'Conduct an evaluation of the policies governing permits in the district. Following council direction, the city manager assembled a task force of downtown stakeholders to participate in the evaluation and recommend changes. The task force includes owners and operators of entertainment venues in the district, as well as downtown residents and property owners.'",
        "'speaker_5': 'City staff and the task force met regularly seeking.'",
        "'speaker_2': 'To balance the needs of various users. In particular, the task.'",
        "'speaker_5': 'Force wanted to encourage both entertainment venues and residential developments to locate in.'",
        "'speaker_1': 'The district while minimizing any conflict between the different uses. Recommendations that will improve the.'",
        "'speaker_5': 'District have been developed.'",
        "'speaker_2': 'And the task force believes.'",
        "'speaker_1': 'That the recommendations must be vetted.'",
        "'speaker_2': 'By a larger group of downtown stakeholders before.'",
        "'speaker_1': 'Being presented to the City Council and codified. Therefore, the task force requests a six month extension of the moratorium to allow sufficient time to complete a public engagement process. That process includes a public forum taking place next week on the 21st of August, as well as.'",
        "'speaker_5': 'Opportunities to provide written comment via.'",
        "'speaker_1': 'Online or email. After gathering input, the task force will meet to consider how best to incorporate the feedback and will then submit the recommendations to the City Council for Approval and Referral to Planning Commission to amend Chapter 21 of the Long Beach Municipal Code.'",
        "'speaker_1': 'Following Planning Commission approval, the City Attorney will return to the City Council with an ordinance for adoption and as you can see by the anticipated dates in the slide. We do hope that we can complete this process quickly and hopefully expedite it so it can be shorter than the six months requested.'",
        "'speaker_1': 'This concludes my report and I'm available to answer any questions.'",
        "'speaker_0': 'Thank you. Turn this over now to Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I was wondering if I'd like to make the motion to move the item and also seek public comment before I make some remarks.'",
        "'speaker_0': 'Excellent. He's been in motion in a second by Councilmember Austin. We're going to turn this over to public comment on the item.'",
        "'speaker_9': 'Mr. Mayor, as vice mayor, on many occasions, I have had problems getting home. Oh. My name is Ben Rockwell. I live at 475 West Fifth Street here in Long Beach. On many occasions, I've had troubles trying to get home from events such as a Long Beach Symphony or the Long Beach Symphony Pops because of the fact that'",
        "'speaker_9': 'our sidewalks along Pine Avenue are so cluttered with people trying to get into some of the venues, they are blocking the sidewalks completely for pedestrian traffic and especially for those of us that use wheelchairs because we are not able to get by.'",
        "'speaker_9': 'And some of the people literally tried to push me off the curb out into the middle of the street because of our insistence that they have to have the sidewalk strictly for waiting to get into some of the entertainment venues, some of the night clubs along Pine Avenue.'",
        "'speaker_9': 'I find this abhorrent that we don't have more politeness for people that need to get through on their way from a venue to their home, which is also in Long Beach and fact in the downtown. I don't use public transportation to get from the symphony home because it's too short a distance and it takes longer to use'",
        "'speaker_9': 'a bus than it does from my home. So I appreciate having the moratorium so that we can have a better chance to make our city better. Thank you.'",
        "'speaker_0': 'Thank you. Can I get.'",
        "'speaker_9': 'I got pretty good. Good evening, Mr. Mayor. Members of the City Council. My name is Craig.'",
        "'speaker_7': 'Koch, and I serve as the president and CEO of the downtown Long Beach.'",
        "'speaker_9': 'Associates. I'd like to thank Vice Mayor Lowenthal and her chief of staff, Brock Coward City Long Beach Project Specialist Rachel Tanner, who recently assumed the responsibility as lead staff liaison for this project and the members of the Downtown Dining and Entertainment District Task Force, especially Miss Laura Cat Ivana, who also serves as a residential representative from Council'",
        "'speaker_9': 'District one on the DARPA Board of Directors for their contribution to this project based on the approaching deadline of the original 12 month moratorium, which I believe is today, and despite the initiative's delayed start and a limited options that are at this point that we have at this point, the DVA supports the recommended action presented this evening'",
        "'speaker_9': '. We look forward to working with Ms. Tanner and appropriate city staff, the task force members and the Downtown Staker.'",
        "'speaker_7': 'Stakeholders to.'",
        "'speaker_9': 'Expeditiously resolve any outstanding matters.'",
        "'speaker_7': 'That may exist before precede proceeding through the.'",
        "'speaker_9': 'Various public engagement and approval processes necessary to codify the proposed new.'",
        "'speaker_7': 'Ordinance. I'm hoping that we can get this done in a matter of 90 days.'",
        "'speaker_9': 'Perhaps 120, rather than a six months. I appreciate.'",
        "'speaker_7': 'Your support, and I thank again those volunteers.'",
        "'speaker_9': 'For their time to create a better downtown. And we look forward to working with everyone to get this.'",
        "'speaker_7': 'Get the business.'",
        "'speaker_9': 'Back on track.'",
        "'speaker_0': 'Thank you. Thank you. Next speaker, please.'",
        "'speaker_7': 'Good evening, Mr. Mayor, and city council members. My name is Eric Carr and I'm a resident at 133, the Promenade, which is right in the heart of the entertainment district. And I also had the privilege of being on the Entertainment District Task Force, and I just wanted to come in front of city council to let you know'",
        "'speaker_7': 'that since our first meeting, we have made considerable progress in this endeavor of coming to a resolution. This both beneficial for the business community and the residential community here in the downtown area. And at this point in time, we just feel that we really need to have some time to do the due diligence of getting that public'",
        "'speaker_7': 'feedback from both the residents and the business community before we move forward. We present to the City Council, so we just want to support the vice mayor, support a motion to extend this ordinance. Thank you.'",
        "'speaker_0': 'Thank you, Casey. No other public speakers on the item. Oh, you are your public speaker on this item. Yes. Oh, I didn't it. Please come.'",
        "'speaker_9': 'Forward. I'm sorry. I'm sitting down. This is about the entertainment. What's it called exactly?'",
        "'speaker_0': 'Please identify yourself for the record.'",
        "'speaker_9': 'Sure. Peter Rosenwald, my address is on file.'",
        "'speaker_0': 'The item is on an extension of. Of a moratorium for the dining and entertainment district.'",
        "'speaker_9': 'Yes. Concerning the dining and entertainment district, I have been taking note of the activities at 309 Pine Avenue. It's it's the city of Long Beach building, but it says Small Business Development Center and Center for International Trade. About three or four weeks ago, there was some stationery announcing some meetings of this particular organization.'",
        "'speaker_9': 'Different nights in June, I believe June and July. There was no phone number on the on this particular, the stationery, city stationery. The building appears to be deserted. I have reported this twice to the Long Beach City College, Long Beach Community.'",
        "'speaker_4': 'College District Board of Trustees.'",
        "'speaker_9': 'Stating that it's a disgrace to have a building such as this in a business district which is depressed as it is with so many empty storefronts. And I asked that at least the phone number and contact information for the Small Business Development Center and the Center for International Trade be posted on the building at the last community'",
        "'speaker_9': 'sorry, a community college district meeting. MZ The head of the the department, Lou Ann Bynum, came up to me after the meeting and she stated that it's not their building, but they do have meetings there. I don't understand how the city of Long Beach can have a building and right next to it, up until maybe ten days'",
        "'speaker_9': 'ago, there was a boarded up storefront at 311 Pine Avenue. It's now for lease. I don't understand how the city of Long Beach is trying to develop its business and entertainment success by having this poor. Representative of the business.'",
        "'speaker_9': 'Of business. Business development sitting right there and I have not been able to get any changes. Ms.. Bynum told me that she was going to take a look at it, but I had announced this also at a previous meeting of the board.'",
        "'speaker_9': 'Thank you. I see that you've just finish up the sentence approximately five weeks ago.'",
        "'speaker_0': 'Thank you. Okay.'",
        "'speaker_9': 'Thank you. I hope you can do something about it.'",
        "'speaker_0': 'Thank you. See you. Thank you. Time is up. Thank you. Okay. No more public comment on the item. There is the city attorney. Give a comment.'",
        "'speaker_10': 'Mayor Garcia, members of the city council. This action will require two separate votes.'",
        "'speaker_9': 'The first vote is on the urgency of the matter so that the audience can take effect immediately starting tomorrow, so that the moratorium will remain in effect.'",
        "'speaker_10': 'And the second vote is on the extension itself.'",
        "'speaker_0': 'Great. So we'll take the first vote. There's been a motion.'",
        "'speaker_2': 'Mr. Mayor. Garcia, I just wanted to make sure. I wanted to see how many of the task force members were in the audience. I know. I recognize one and two. There we go. Okay. I wanted to take this opportunity to thank you both, as well as the other task force members for your service so far and for'",
        "'speaker_2': 'attending tonight's meeting. It's been quite a commitment that all of you have put into this effort, and I know you are invested in it, and I know you're very busy just professionally and personally, but you've also been very busy over these last several months with this particular task.'",
        "'speaker_2': 'I appreciate everyone's comments that have come through the task force, the deliberation that's taken place, and then the speakers that came forward today to provide some comment. And it is important that we take this time for the task force to reach out to the different stakeholders and receive feedback and make changes to their recommendation.'",
        "'speaker_2': 'I think it's really very encouraging about that process and the deliberative process that you've taken is that you recognize that some additional time is needed. So for that, I thank you and for the honesty that goes into that in recognizing that something this important does take time.'",
        "'speaker_2': 'And while we initially thought we could take care of it in a certain time period, we realized that we couldn't just by going through it. So I appreciate you for that. And for those that are not here participating in this council meeting and that have served on the task force, as well as participated as members of the'",
        "'speaker_2': 'stakeholder community to support the task force and their deliberation, I very much appreciated. So with that, I'd like to make the first motion. I think we've already made that motion right there.'",
        "'speaker_0': 'We have the motion on the floor. And so with that and will be a second motion after the first vote. So the first motion that's on the floor has been made. Members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Okay. And then you take a second vote. Vice Mayor want to make that motion?'",
        "'speaker_2': 'I'd like to go ahead and make that motion. The second piece of it. I'm sorry, would you remind me?'",
        "'speaker_10': 'Second piece is to actually adopt the ordinance?'",
        "'speaker_2': 'Absolutely. So I'd make the motion to adopt the ordinance.'",
        "'speaker_0': 'Okay. There's been a second by Councilman Austin, and we had public comment for both, Mr. Attorney. So I think that that worked out fine. Good. And with that, please, members. Gordon, cast your votes.'",
        "'speaker_1': 'Motion carries eight zero.'"
    ],
    "Recommendation to conduct a Budget Hearing to receive and discuss an Overview of the Proposed Fiscal Year 2015 Budget for the following: Department of Health and Human Services, Public Works Department, and Water Department.": [
        "'speaker_0': 'Okay. Thank you. Moving on now to budget item I'm sorry, hearing item number three, which is a continuation of our budget hearing. So if we want to, Madam Clerk, read that.'",
        "'speaker_1': 'Item three report from the City Manager. Recommendation two to conduct a public hearing to receive and discuss an overview of the proposed fiscal year 2015 budget for the following departments. Department of Health and Human Services. Fire Department and Police Department.'",
        "'speaker_0': 'Thank you. And with that, I'm going to turn this over to the city manager and like the last hearing. We're going to go through the presentations and then we'll begin with the council questions. Mr. West.'",
        "'speaker_9': 'Yes. For the city clerk, we skipped item number two. So if we can come back to item two.'",
        "'speaker_0': 'But we're going back to him, too.'",
        "'speaker_9': 'Great. Absolutely. So this is a in a series of budget hearings that we've been presented at the city council. So this is the second phase of presenting department budgets to the city council. Tonight, we're going to hear from our fire chief, Mike Tarry, with a brief presentation followed by our Chief of police, Jim McDonald, with a brief'",
        "'speaker_9': 'presentation. So, Chief Terry, take it away.'",
        "'speaker_11': 'Thank you. Good evening, Mayor Garcia and members of the city council. This evening, I will be giving you a brief overview of the Long Beach Fire Department's fiscal year 15 proposed budget. My presentation will also touch upon the services provided by your fire department and some highlights of our current fiscal year, as well as significant changes in'",
        "'speaker_11': 'fiscal year 15 proposed budget and some major issues and opportunities we'll try and address in fiscal year 15. The fire department delivers fire rescue, emergency medical services, hazardous materials response and non-emergency response services to residents, businesses and visitors in the city of Long Beach.'",
        "'speaker_11': 'As you know, we provide 24 hour operation for which all first responders must be prepared at all times. A primary goal of your fire department is to reduce the number of fires in the city through our fire prevention efforts.'",
        "'speaker_11': 'These include services such as fire inspections and code enforcement, investigation of suspicious fires to our fire investigation or arson detail, the implementation of environmental safeguards and efforts to reach out to the community with fire prevention and safety messages and related information.'",
        "'speaker_11': 'Additionally, our training division provides essential services to the entire department. They prepare into entry level fire recruits to be effective firefighters through our fire academy. And just as important, however, is their work in ensuring that all our first responders receive the continuing education needed to maintain skills and stay current in their knowledge of firefighting and emergency response'",
        "'speaker_11': 'tactics. I would like to outline for you some of the fire department's accomplishments and highlights for the current fiscal year. Over the last 12 months, we have responded to over 53,000 emergency medical services and other emergency incidents. This equates to more than 127,000 individual unit responses.'",
        "'speaker_11': 'We have been and will continue to remain a very busy fire department. Included in this number is over 45,000 medical calls and over 5000 fire calls. This number also includes hazardous materials responses, airport responses, some marine safety responses and other non fire responses.'",
        "'speaker_11': 'For the first time in many years, we've conducted consecutive fire academies earlier this year. 28 new fire recruits graduated from our fire academy. And in the next couple of weeks, we will be starting another similar sized academy class.'",
        "'speaker_11': 'It is our plan to continue running annual academies to ensure adequate staffing levels at all times. As you know, on July 10th, 2014, the Long Beach Fire Department implemented the Rapid Medic Deployment Program or RMD throughout the City of Long Beach.'",
        "'speaker_11': 'Implementation of the R&D program was a culmination of over two years of planning and public meetings, which included City Council approval during the fiscal year 2013 budget process and the approval of the Los Angeles County Emergency Medical Services Agency and EMS Commission earlier this year.'",
        "'speaker_11': 'And as I indicated in my memorandum to the city manager and City Council last week, our preliminary data for the first month of the program are showing an improvement in response times over last year. In fact, I met with representatives from the EMS agency at Long Beach fire headquarters yesterday to discuss the RMD program, and we received'",
        "'speaker_11': 'some very positive remarks from them on its progress. We continue to have a very active community emergency response or CERT program. This year was unique in that we conducted the city's first ever Teen Cert program class. This class was comprised of 36 poly high school students who were given practical hands on instruction and demonstrations of how to'",
        "'speaker_11': 'respond to emergencies. And we continued to effectively utilize Homeland Security grant funds. This year, we were able to secure funds for citywide all hazards incident management team training, which has improved the city's capacity to manage large scale emergencies.'",
        "'speaker_11': 'The proposed fiscal year 15 budget for the fire department is just over $97.5 million. We have a total of 527 full time equivalent staff consisting of 388 sworn FTE in the fire ranks. Another 27 full time year round marine safety first responders, over 160 seasonal lifeguards and 33 full time ambulance operators.'",
        "'speaker_11': 'Additionally, the fire department is supported by civilian staff in fire operations, support services, fire prevention and administration. The bulk of our budget, over 70%, is in the general fund, which supports most departmental activities. As you can see, the proposed 515 general fund budget for the fire department is nearly $71.4 million.'",
        "'speaker_11': 'Additionally, the Tidelands Fund supports marine safety activities as well as our fire operations in the Port of Long Beach. The harbor department. Provides cost reimbursement for the services provided in the port, and that is included in the 29 point, not $22.9 million Tidelands Fund budget for fire prop funds from the oil production tax continue to provide additional'",
        "'speaker_11': 'support for fire staffing, an additional one time and ongoing needs that I will address in the next slide. Along with the Health Department, the fire provide fire department provides environmental protection services that are supported by the Cooper Fund.'",
        "'speaker_11': 'This stands for Certified Unified Program Agency and through permit fees, it provides funding for inspection services and business emergency plan reviews to ensure hazardous chemicals are handled, stored and transported in accordance with current state and local standards. The Fire Department's proposed fiscal year 15 budget includes several changes that I'd like to highlight.'",
        "'speaker_11': 'First, the fire department will be placing two new fire boats into service into fiscal year 15. The greater size and complexity of these boats warrants an increase in the daily staffing of the fire boats by three. I'd like to thank I'd like to take this opportunity to thank the Harbor Commission for their support not only for these'",
        "'speaker_11': 'new boats, but recognizing the need for staffing to accompany them. A second budget changes the need to extend our fire academy by two weeks to meet state mandates for EMT training. The additional costs of this training will be supported by the Prop eight fund.'",
        "'speaker_11': 'This fund will also provide nonrecurring support in the amount of $400,000 for the replacement of fire equipment and the purchase of emergency generators for our facilities. And the department also plans to utilize non-recurring ground emergency medical transportation or EMT funds to replace four fire engines with an estimated cost of $600,000 each.'",
        "'speaker_11': 'This will increase the reliability of our front line first responders apparatus by allowing us to replace these aging engines. Looking forward into fiscal year 15, the department has several significant issues. The first is to continue our multiyear multiphase plan to address workforce privacy issues in fire department facilities.'",
        "'speaker_11': 'The Fire Department of Public Works have made great strides in the past several years to ensure that our facilities foster a positive work environment and provide privacy for all employees. Our facilities are unique in that our employees utilize them on a 24 hour basis.'",
        "'speaker_11': 'Therefore, it is essential that all facilities offer private dormitories, changing areas and restroom facilities. Fire and Public Works will utilize existing capital improvement fund appropriations to conclude these workforce privacy projects. Another challenge is to ensure that our fleet of frontline public safety vehicles, ambulances, fire trucks, fire engines and other first responding apparatus remain reliable in their service'",
        "'speaker_11': 'to fires, medical incidents and other emergencies. In order to do this, we will continue to work with the Department of Financial Management to develop a comprehensive plan for the replacement of the department's aging fleet of vehicles. And finally, the Department has a need to enhance our public information and community relations functions.'",
        "'speaker_11': 'While the Department has been effective in this area. There are opportunities for increased effectiveness. With the many services and activities the Department provides on a daily basis. It is critical to ensure that these these are communicated effectively to our community.'",
        "'speaker_11': 'In the coming months, the Department will formulate both the short term and long term plan to meet this need. That Mr. Mayor. That concludes my presentation. With that, I stand ready to answer any questions.'",
        "'speaker_0': 'Thank you. Mr. West will go on to Police Chief McDonnell.'",
        "'speaker_12': 'Good evening, honorable mayor and members of the City Council. I want to begin tonight's presentation of our fiscal year 15 budget by thanking you for your ongoing support of the police department. I also want to thank the men and women of the Long Beach Police Department who risked their personal safety each day to protect our community.'",
        "'speaker_12': 'Our employees continue to find new and innovative ways to use the resources you have given us to drive down crime in our city to record lows. Of course, services to the community are first to safeguard lives and property.'",
        "'speaker_12': 'This includes reducing violent crime by 9% and property crime by 6.8%. Through June of this year. Second, to promote and protect the constitutional rights of all people to liberty, equality and justice. This goes beyond enforcing the law to include running a first class jail that protected the rights of nearly 15,000 prisoners last year.'",
        "'speaker_12': 'Third, to answer, respond to and investigate calls for service in a timely manner. In 2013, we answered over 600,000 phone calls and responded to over 176,000 calls for service. Finally, we consider it a core service to engage in partnership with a broad network of stakeholders to reduce crime and improve quality of life, as well as to ensure'",
        "'speaker_12': 'our homeland security. This includes coordinating with other city departments, regional law enforcement agencies and our community. For example, last year we partnered with small business owners in an operation where we arrested 71 organized shoplifters, burglars and gang members who were stealing from local businesses.'",
        "'speaker_12': 'We're extremely proud of what we've accomplished over the last year. Our partnerships have contributed to our achievements. For example, we've achieved an average citywide response time of 4.7 minutes to priority one calls for service when the national average is around 11 minutes.'",
        "'speaker_12': 'In 2013, the number of violent crimes in Long Beach was the lowest since 1971. And I'm happy to report that this year through June, we're trending down another 9%. To highlight this a little further. Murders are down 39%.'",
        "'speaker_12': 'Gang related murders are down 38%. Overall, shootings are down 35%. Gang shootings are down 52%. Robberies are down 27%. Fatal traffic collisions are down 60%. And officer involved shootings are down 71%. Our Gang Enforcement section strategies have been successful.'",
        "'speaker_12': 'We've used nonrecurring funding to extend shifts to investigate and solve crimes and made arrests that prevented additional crimes. As I discussed on the previous slide, these efforts have paid off in reducing gang related murders and shootings. Human trafficking operations resulted in the rescue of 18 young women, the arrest of 15 traffickers, and the referral of 41 cases'",
        "'speaker_12': 'to support services. We believe these services can change the course of lives. We formed a task force to address individuals who by law are not allowed to possess firearms, prohibited, possess or operations resulted in 80 investigative searches. The recovery of 46 guns and 27 arrests.'",
        "'speaker_12': 'As a result of realignment, the state provided limited funding to ensure compliance of early release prisoners within the city. Combined with city funding, we created our new public safety realignment team. The team conducted 582 compliance checks and made 172 arrests.'",
        "'speaker_12': 'In addition, many probationers were referred to resources in an effort to try and reduce recidivism. Academy Class Number 86 graduated new police officers that are now completing their probationary field training. Soon, they'll begin scheduled patrols on their own to help replenish the workforce.'",
        "'speaker_12': 'Lost to regular attrition. Academy Class 87 started June this year and will graduate in December, and testing for Class 88 is currently underway. As you can see, we made tremendous progress during the past year. The pie chart pie chart shows that our fiscal year 15 budget provides roughly 191 million in the general fund in about 18 million'",
        "'speaker_12': 'in other funds. The proposed budget includes increases in both the number of police officers and professional support staff. In particular, I want to thank Long Beach Transit for increasing the number of police officers by two. These officers will be dedicated to enforcing laws within our city's bus system.'",
        "'speaker_12': 'I also want to thank the harbor department after publication of fiscal year 15 proposed budget. The port security. You added net one sergeant to the workforce in fiscal year 15. We plan to do some restructuring, which I will expand on in in a moment.'",
        "'speaker_12': 'The restructuring, in combination with additional positions, will allow sworn personnel to focus more proactively impacting crime. We believe that together these changes will make the city of Long Beach safer. We've studied data and best practices for the purpose of reorganizing our resources.'",
        "'speaker_12': 'As a result, next year's budget has many changes that will make the city safer for residents and visitors. The major changes include transferring juvenile booking and detention activities to jail division so that detectives from juvenile investigations can assist with pressing cases in burglary, computer crimes, homicide and VICE will continue to dedicate detectives and school resource officers to'",
        "'speaker_12': 'work juvenile specific cases. We're adding 11 new positions and reorganizing professional support staff for assignments to the business desk, civic center, security in case filing duties to reduce overtime. And we're adding sworn officers through our security services contract with the Port and Long Beach Transit.'",
        "'speaker_12': 'An increase in property funding has allowed us to increase the number of budgeted police academy recruits and to add a nonrecurring $400,000 investment to the plans for the new East Division substation at Schroeder Hall. In addition, we're funding helicopter fuel in the acquisition of replacement undercover vehicles.'",
        "'speaker_12': 'Overall, the goal of the police department is to become more timely in our response, more intelligent in our approach and more engaged with the community we serve to make Long Beach a safer place for all people to get there now and in future years, there are significant issues and opportunities to address.'",
        "'speaker_12': 'First, we must sustain the intelligence, training and progress we have made in human trafficking, realignment, compliance and prohibited possessor enforcement. Through these efforts, we are able to rescue young victims, manage the influx of habitual offenders and prevent future tragedies.'",
        "'speaker_12': 'You'll see us continuing these efforts so that we don't lose momentum. Second, we must continue to invest our resources in the best technology and intelligence to maximize results. Criminals continue to become more sophisticated, so we must work to stay one step ahead of them.'",
        "'speaker_12': 'This means keeping pace with our technology and adopting best practices. It's important to maximize the capability of our employees. As we move forward, we must find ways to reduce administrative workload through better technology process improvement, and increase professional support staff so that we can optimize the use of trained, sworn personnel on the front lines of law enforcement'",
        "'speaker_12': '. We must continue to foster and grow our strategic partnerships with the community, city council, local businesses and nonprofit partners. We will be working to implement the city's violence prevention plan and continuing to promote Community Watch program as part of this collaborative effort.'",
        "'speaker_12': 'I have no doubt that the additional 2.2 million in non-recurring discretionary funds for overtime recommended by the city manager will help us accomplish these priorities. On behalf of the men and women of the police department, thank you for your ongoing support and commitment to make this safest city possible.'",
        "'speaker_0': 'Thank you, Chief, and thank you to both both chiefs and obviously all the rank and file members for just doing a great job with these budget presentations as well as all the all the work on the field every day.'",
        "'speaker_0': 'I will bring this back to the members, starting with Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I wanted to start with the police chief, and thank you for your presentation. And I just have a couple of questions. You have 18 potentially new position. Does the addition of these officers reflect new positions created for the graduates of the police academy, or are they unfilled positions currently?'",
        "'speaker_12': 'I'm sorry. I can't make out what you're saying on. On the question there was.'",
        "'speaker_2': 'I'm sorry. Was it not loud enough?'",
        "'speaker_12': 'Thank you.'",
        "'speaker_2': 'Yes, please.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_2': 'You know, these are grown up chairs. You have to, like, clean really fast. So the 18 new positions, or are they are you accounting for the academy graduates or are they unfilled positions currently.'",
        "'speaker_9': 'Which I call.'",
        "'speaker_13': 'Vice Mayor Lowenthal, members of the city council. Essentially, the net new positions that are being added to the budget are three on the sworn side. And the the 15.52 is, I think, what you're referring to, the total being 18.52.'",
        "'speaker_13': 'We're also reducing some positions as well. But essentially there will be three new budgeted sworn positions that will be filled by hopefully new officers as they come into the workforce.'",
        "'speaker_2': 'Okay. Thank you. And then on the overtime calculation, I was wondering how the city manager arrived at the amount. Does it just account for a certain number of hours or a certain number of positions? Could you tell us how that calculation works?'",
        "'speaker_9': 'That was more empirical data, what we've done in the past to work for overtime and what has worked in the department for the past few years.'",
        "'speaker_2': 'Okay. Thank you. And then I have questions for fire. Mr. Vice Mayor, did you want to instead of them getting up and down, do you want to go down the aisle to see if anyone else has questions for police and then come back to fire or do you want to go back and forth?'",
        "'speaker_0': 'I think if the chief, could you stand right behind these guys and kind of switch back and forth? That would be great. Like we did the last budget session.'",
        "'speaker_2': 'So I wanted to.'",
        "'speaker_0': 'Chief.'",
        "'speaker_2': 'Thank you. Fire Chief Terry, I have a few questions on. Thank you for your presentation. I have a few questions on R&D, primarily on R&D with the implementation of R&D. I've heard some folks talk about their belief that we're running out of rescues to respond to calls for service.'",
        "'speaker_2': 'And I wanted to hear from you if you've heard the same in terms of folks believing that that might be the case or there might be evidence to that being true. And I just wanted to know from you, how do you respond to that?'",
        "'speaker_11': 'Vice Mayor The short answer is no. We are not running out of apparatus or or response vehicles to respond to the calls for service in Long Beach. We have we have met the needs of our community with the apparatus that we have in place.'",
        "'speaker_2': 'Okay. Thank you. And then to your point about not to your point necessarily, but to our practice of relying on Los Angeles County or Orange County fire departments to assist us for calls for service. How many times would you say perhaps in the past month prior to armed, did we rely on them?'",
        "'speaker_11': 'Councilmember In the month preceding the implementation of Armed, the Los Angeles County Fire Department responded as part of the automatic aid system to to and from basically one month prior 24 calls for service for emergency medical calls in the city of Long Beach the month prior to Armed and Orange County Fire Authority, for that matter, responded to'",
        "'speaker_11': '32 calls for service in the city of Long Beach the month prior to implementation of Armed.'",
        "'speaker_2': 'Okay. I appreciate that. And then following the implementation of Armed, how many times have we used the automatic aid system to support our calls for service?'",
        "'speaker_11': 'Vice Mayor from July 10th, 2014, or the date we started armed, the Los Angeles County Fire Department has responded to zero calls for service in Long Beach, and the Orange County Fire Authority has responded to six calls for service in Long Beach and in the case of Orange County.'",
        "'speaker_11': 'Of those six calls, three of them appear to be traffic accidents on the 605 Freeway, indicating that they may have been dispatched to that call anyway anyway.'",
        "'speaker_2': 'Okay. And then from the cost perspective, what's our annual cost for an armed rescue versus the pre armed rescue?'",
        "'speaker_11': 'A vice versa. An armed rescue staffed with a firefighter, paramedic and an ambulance operator costs $723,305 per year, as opposed to $1,049,248 for a rescue ambulance staffed with two firefighter paramedics.'",
        "'speaker_2': '1,000,049.'",
        "'speaker_11': '1 million. 1 million, 50,000.'",
        "'speaker_2': 'Okay.'",
        "'speaker_11': 'Sorry.'",
        "'speaker_2': 'It's okay. All right. Thank you. And then finally, what would be your priority should funding become available in the future for apparatus restorations?'",
        "'speaker_11': 'Vice Mayor. Should. Should funding become available in the future? We should remain consistent with the memo we sent the Council over a number of months ago, and it would be because of because we implemented R&D, we actually restored the rescues that were listed on the memo that we sent to council.'",
        "'speaker_11': 'So we would focus on the engines and that would be engine eight would be our number one priority, followed by Engine 101 and Engine 17 would go right down that list. We have we haven't wavered off that as our priority.'",
        "'speaker_2': 'Okay. Thank you, Chief. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Andrews.'",
        "'speaker_8': 'Yes, thank you, Mayor. I would like to directly to the Chief Police Macdonell.'",
        "'speaker_3': 'Back to.'",
        "'speaker_8': 'Okay. First of all, Chief, I like to let you know that I'm very saddened to hear that you will be leaving us in November, but very excited to know that you're going to do a big and better, you know, situation.'",
        "'speaker_8': 'And congratulations.'",
        "'speaker_12': 'Thank you for your support, sir.'",
        "'speaker_8': 'But first, I only have one question, and that is that what has been the police department effort to deal with the the impact of the AB 109 realignment, the governor's plan to release state prisoners early?'",
        "'speaker_12': 'Thank you. We've done a number of different things. We have approximately 900 early release prisoners living in the city of Long Beach. Long Beach is about 6% of L.A. County's entire parks population, which is a big challenge. We found that a third of the addresses we checked or a team check proved to be inaccurate false reporting, late'",
        "'speaker_12': 'data entries or clerical errors or outdated info. But we had to work to be able to locate those individuals as well. We've had good success. Our stats in fiscal year 14 to date we've had 815 compliance checks, 265 citywide.'",
        "'speaker_12': 'PRC's arrests. Approximately seven and three quarters of all PRC's arrests in L.A. County were made in Long Beach. Offenses included narcotics, burglary, weapons violations, sex crimes, gang injunction violations and murder. The total cost to us was about 1.6 million.'",
        "'speaker_12': 'To be able to do this, 1.1 was allocated to us in nonrecurring funds for fiscal year 14 and 525,000 we were able to receive from the state to be able to supplement that.'",
        "'speaker_8': 'Thank you, Chief. I think the stats that we've heard this evening. Who wouldn't want to live in Long Beach? It's probably one of the safest cities in the world. And I'd like to congratulate your staff because of that.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_12': 'Thank you very much.'",
        "'speaker_8': 'Yes, I'm through with you now, chief.'",
        "'speaker_9': 'Thanks.'",
        "'speaker_8': 'Now, the fire department police chiefs are the chiefs deputy. Okay. I have two questions for you, Chief. And the first one is what percentage of the fire department calls are medical calls?'",
        "'speaker_11': 'Councilmember The percentage of medical calls of our out of our overall call volume annually is about 84.33%.'",
        "'speaker_8': 'Thank you. In the last question as to how the fire department had to rely on assistance from the Los Angeles County and Orange County, far more since we implemented the R&D IT councilmember.'",
        "'speaker_11': 'As I mentioned a moment ago, the answer is no. Since we implemented the RMD program, we have not relied on our automatic aid system to to run any emergency medical calls here in town. The system I just want to be clear on this.'",
        "'speaker_11': 'The system is designed to as we need help, we they provide us help. And as they need help, we provide them help. I think one interesting note along those lines is in the last months since we have implemented R&D, we've actually responded to 24 calls for service in Los Angeles County in their in their first in area'",
        "'speaker_11': 'since we implemented the RMD program. So I think the key here is, especially in the north part of Long Beach, where Rescue 12 was put back in service, has had a tremendous impact on the overall service delivery of EMS services in that part of town, which is what's kind of really drawn down our need to rely on'",
        "'speaker_11': 'Los Angeles County for help. But it's still good to know that that that system does exist so that in the event we have a system situation where we receive I don't know, on any given day, we receive 14 calls for service in a specified given period of time.'",
        "'speaker_11': 'We could easily potentially run out of units and rely on our automatic or mutual aid system, but we haven't had to do it yet.'",
        "'speaker_8': 'Thank you, Chief. And also, I'd like to thank you and your staff for doing such a great job. Thank you again.'",
        "'speaker_0': 'Thank you. And Chief, hang on right there. Councilmember Mongo.'",
        "'speaker_1': 'Thank you for answering a bunch of my questions through the previous two councilmembers. The fifth District is one of the most impacted by mutual aid, so we really appreciate that the system has reduced our reliance on other agencies.'",
        "'speaker_1': 'Specifically, I want to give you congratulations on your teen cert program. I know that as we move towards a more inclusive system where counties and cities are utilizing technology to rely upon people in the surrounding area to help provide services, the more teenagers that we have engaged in trained, the better we will be.'",
        "'speaker_1': 'So I look forward to supporting you in that in the expansion to maybe Millikan High School in our district. And for that, I'm done with fire. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. PD, please.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'I think.'",
        "'speaker_1': 'I want to say a special thanks for our shoplifting task force. And I hope that of the $2.2 million that we're setting aside for both the gang unit and the task forces and the other overtime necessary, that we can look at opportunities to expand that not only within our small businesses, but to our bigger businesses that are'",
        "'speaker_1': 'also being hit with some major shrinkage in our city right now. We've been talking to some regional directors of major box companies that are in the district, and we know that for businesses to be here, they need to feel safe.'",
        "'speaker_1': 'So thank you for that. The shoplifting task force that you mentioned, is it consistent or is it disband or how often does it come up? And can you give us a little bit about the logistics of that?'",
        "'speaker_12': 'Yeah, it's periodic. We'll do it will work with the.'",
        "'speaker_9': 'Let me get the proper attorney with the name of the group.'",
        "'speaker_1': 'Is this with the stay away orders that we're doing with the city prosecutors?'",
        "'speaker_12': 'There's a there's an umbrella group, Lorca, at the Los Angeles Regional Commercial Theft Unit, I believe, and I'm paraphrasing there. But we work with them. We have another one coming up in the next couple of months. So we'll continue to stay on top of this and work with our partners to be able to get the the most'",
        "'speaker_12': 'efficient use of our resources in this regard as well.'",
        "'speaker_1': 'And then one quick question for Deputy Chief Luna. A few months ago, you came over and talked about the community watch programs that have been popping up all over the city and the significant improvements that we've been having.'",
        "'speaker_1': 'Do you have any numbers on how significant we have, what kind of strides we've made? I know that Commander LeBaron made some comments related to the number of new community watch programs and the engaged citizenry that you guys have encouraged.'",
        "'speaker_9': 'But I don't have any specific numbers. Council Member Mungo but I can tell you that that all of you sitting behind the dais there have been really helping us out and really pushing the message. And that's our consistent message with our entire community.'",
        "'speaker_9': 'That brings in years. And it's so effective for us to reduce crime in the city, or I should say, prevent crime. If we continue this effort. So I ask not only all of you, but everybody out there in this audience and watching this on television to continue.'",
        "'speaker_9': 'If you don't have a community watch, go on in your neighborhood, organize one. You can get a hold of the police department. We'll do everything we can to help you out. I know several of you are doing that and we'll provide numbers for you as time goes on.'",
        "'speaker_9': 'But I have no doubt that with all of your efforts, we can probably at least triple the size by the end of the year. So thank you for your support on that.'",
        "'speaker_1': 'Well, thank you for coming out to our neighborhood night out and having all the impromptu front porch meetings. While I love having the front porch meetings, they are as a response to residential burglaries and I've significantly I've seen a significant decrease be as neighbors watch so thank you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you Councilmember Price Chief, you guys are there. They're going to ask you a question for PD Councilmember.'",
        "'speaker_9': 'Great.'",
        "'speaker_5': 'Thank you. I want to take a moment and thank Long Beach PD for the excellent work that you do. I want to take a special moment to thank Commander LeBaron, who is the commander that services my district, and I want to thank him for all the education that he has given the residents in my community regarding issues'",
        "'speaker_5': 'related to public safety. I want to start off by saying that I understand that these are tough financial times. They've been more difficult in the past. They're going to continue to be difficult in the future. But I firmly believe that if a city can't provide a safe place for its residents, then the city has failed.'",
        "'speaker_5': 'And in that regard, anyone who says that, you know, you can have the safest city in the world, but if you don't have all the other amenities that go with a great city, then what do you have? Hasn't talked to a victim of crime.'",
        "'speaker_5': 'They haven't talked to someone whose home has been burglarized or someone who's been assaulted in the street. And I really believe that when looking at the budget in the coming month and in the years ahead, I'm going to be looking at it with an eye towards how we ensure the safety of our citizens, both by the Long'",
        "'speaker_5': 'Beach Police Department and the Long Beach Fire Department. So in that regard, I want to talk to you about property crimes. I understand that the city of Long Beach is a large city and we have a lot of different needs and in terms of public safety and police services and that obviously there are violent crimes that take'",
        "'speaker_5': 'priority when it comes to investigation and focus. But I will say that in some communities within the city of Long Beach and specifically my community, which is where I have some expertize, the issue of property crimes and residential burglaries is one that continues to trouble the residents in my community and me included.'",
        "'speaker_5': 'And I would like us to think long term and strategically about how we are going to address the issue of property crimes. I fully support and our office has actually engaged in a community watch program challenge that we have undertaken as a result of Commander LeBaron leadership.'",
        "'speaker_5': 'I firmly believe that it's a partnership, but it's important for me too, to know that we as a city have a police department that has a strategic plan and has vested in determining what our long term options are going to be and resource allocation to the issue of property crimes.'",
        "'speaker_5': 'We will be having a public safety meeting on September the fifth and one of the items on the agenda will be looking at public safety in terms of property crimes and a strategic plan for the future. I've had a chance to talk with you, Chief.'",
        "'speaker_5': 'I know that you share my concerns, but if in fact. Additional moneys were available. Could you find a place to allocate them where there would be a focus on residential burglaries and property crimes?'",
        "'speaker_12': 'Absolutely. If if we're able to find additional funding and we earmark it, we can certainly focus on property crimes. Let me if I could just share a couple of things that we've done during this period are maybe one on I in our realignment compliance team is focused in heavily on property crime.'",
        "'speaker_12': 'So that's that's been a, you know, a big plus for us. And we've been able to clear up some some rings on that one as well. We've reorganized our investigations function, which increased career criminal investigators, our burglary investigators, computer crime investigators, vice investigators, as well as a community outreach piece as well.'",
        "'speaker_12': 'So we look at those things and those are helpful. But at the end of the day, our community watch that was touched on previously is a critical piece. When we take burglary reports over and over again, we hear that somebody left their doors unlocked.'",
        "'speaker_12': 'They left their windows unlocked. They left property in their car, in their vehicle unlocked. Those are the kind of things that we can all work together to keep each other in check to ensure that we we make it that target as hard as it possibly can be.'",
        "'speaker_12': 'And then the piece about getting to know our neighbors and to look out for each other and to make the call to the police department when you see somebody on your street knocking on doors that don't have a reason to be in the neighborhood, and it looks like they're looking around for opportunities.'",
        "'speaker_12': 'Call us, please. That's what we want to be able to go out there and and talk to that person and see what they're doing. Those are the type of things that they really don't cost any additional, but have tremendous dividends for everybody.'",
        "'speaker_12': 'So we look forward to working with you. We thank you for your support. We're doing what we can with the resources we have now. If we had more, we certainly could benefit from that. But I think there's a lot of things that we can do in the short term that that cost little or nothing more strategies than'",
        "'speaker_12': 'anything else.'",
        "'speaker_5': 'Thank you, Chief. I appreciate that.'",
        "'speaker_12': 'Thank you, Councilman.'",
        "'speaker_5': 'I do have a couple of questions for Chief Jerry. Good evening, chief. Special thanks to the Long Beach Fire Department for the work that you do as well. Your your firefighters are an amazing asset to the city. Every single one of them is a quality individual who offers so much to this city.'",
        "'speaker_5': 'So I want to thank you for your leadership and for getting them to the place where they are proud members of our city workforce. You did not talk about, but I wanted to highlight for a moment the great work of your lifeguards.'",
        "'speaker_5': 'They just finished Junior Lifeguard program for the summer of which the Price family was involved. And we commend those men and women for the excellent work that they do as well. You talked about R&D. R&D is a pilot program, is that correct?'",
        "'speaker_11': 'Yes, ma'am.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'Do we have any sort of plan in place in the event that the pilot program proves to either be not as efficient as we had hoped or proves to have a lower standard of patient care than what we were used to before R&D was implemented.'",
        "'speaker_5': 'And I understand we have one month of data, but looking over at time, what's our plan in case that doesn't prove to be all that we hope it is?'",
        "'speaker_11': 'Well, Councilmember, during the past two, a little over two and a half years, during the vetting process, as we worked with the county EMS agency, we were very clear that as we went into this, we were it's a study.'",
        "'speaker_11': 'It's a pilot study. So we anticipate, as did the county agency, that as we go throughout this study over the next two year period or at any point in the study, if we need to make subtle adjustments to the pilot program so as to make it more effective or ease the strain in one area or another, or'",
        "'speaker_11': 'basically do we need to do to kind of prove or disprove the hypothesis and the hypothesis being, could we staff our paramedic program differently than we had done in the past? The EMS agency is open to that as a study.'",
        "'speaker_11': 'The intent is to determine whether or not we can operate in an alternative staffing configuration to what we did prior. If to answer your question, if at some point during the study there is some sort of anomaly in the system or some sort of data that comes in that is egregious enough that we feel we need to'",
        "'speaker_11': 'stop altogether, then we will do that. We made a commitment to the EMS agency that we would stop the program if it was proven to be a degradation of patient care or if something happened that was significant enough that we felt that the the level of service we provide our community was at risk.'",
        "'speaker_11': 'So if we did that, we would immediately come back and either potentially revert back to the system we had in place prior and then try and realize the financial efficiencies in a different way. Or I'm sure as we got to that point, we would come up with a number of alternatives so as to restore the level of'",
        "'speaker_11': 'service that would have potentially been degraded. But I can tell you that, as you said, it's only a month and I'll be the first to say we don't hang our hat on a month's worth of data over a two year study.'",
        "'speaker_11': 'But so far, the program went into place in July. It's traditionally one of our busier months, and we're we haven't seen any sort of big kind of anomalies or any sort of big incidents happen that that gave us cause for concern.'",
        "'speaker_11': 'In fact, there's a lot of normal things happening within Long Beach Fire on a daily basis. We're still responding on structure fires on a regular basis. Last week we sent a five engine strike team to Northern California, which is something we we enjoy participating in the mutual aid system.'",
        "'speaker_11': 'So the things we normally do, we are continuing to do. And in some cases, like I mentioned, with the use of L.A. County Fire for calls for service in Long Beach, we've seen a decrease in the amount of reliance that we have on our partners.'",
        "'speaker_11': 'So we are not seeing anything yet that would we would consider an anomaly. However, we are watching very, very closely to ensure that's not not coming.'",
        "'speaker_1': 'I want to talk to you.'",
        "'speaker_5': 'And just a follow up to that. Is there anything at this point that causes you some concern or pause about patient care standards?'",
        "'speaker_11': 'Councilmember. No, in fact, yesterday we. Not yet. Yesterday we met with the EMS agency and we provided the preliminary data. We commit to provide data to the EMS agency on a monthly basis that evaluates I believe there are 38 set, correct.'",
        "'speaker_11': '36 different fields that they evaluate on a monthly basis. And we went through the preliminary data with them yesterday and across the board without being specific, because some of this is patient care stuff and I don't want to be specific on on some parts of that.'",
        "'speaker_11': 'But across the board, the time to deliver the treatment modalities that we use in the field is getting faster than it was in the past. The time to get a paramedic on scene is faster. So all in all, the EMS agency folks that came yesterday said they were very pleased with the one month look.'",
        "'speaker_11': 'And we don't see anything that's causing any sort of concern right now.'",
        "'speaker_2': 'You talked a little bit about.'",
        "'speaker_5': 'Engine eight being one of the priorities. Obviously, in the third district, we have the communities of Naples and the peninsula, Belmont Shore, all very dense communities that, in my opinion, are at risk by not having Engine eight in service.'",
        "'speaker_5': 'What would it cost to have Engine eight be put back into service?'",
        "'speaker_11': 'Council member. The current cost to restore fire engine eight is $2.2 million a year.'",
        "'speaker_5': 'When was the last time Engine Eight was in service?'",
        "'speaker_11': 'It would have been January of 2013.'",
        "'speaker_5': 'Thank you. I have nothing further.'",
        "'speaker_0': 'Thank you, Councilmember Austin.'",
        "'speaker_6': 'Thank you. And I'll start with the fire chief. Thank you, Terry. Terry, I'm sorry. And I think the men and women of the Long Beach Fire Department for the the excellent service that they provide to our city. I did have a few questions for you.'",
        "'speaker_6': 'As you know, I have been a strong critic of the R&D program or the pilot program. I think it's very risky to to to experiment with the city this size. But I'm glad to hear your early reports that it's working out during the the R&D discussions leading up to its implementation.'",
        "'speaker_6': 'You indicated that additional rescues would be employed during peak times. And I'm curious to know how often we are employing additional rescues since the Army program has been implemented.'",
        "'speaker_11': 'It councilmember the we haven't we haven't deployed any additional like armed rescues with a paramedic and an EMT on board since since implementation of the RMD program in week two of the program, we recognized that we were seeing a lot of basic life support level transports coming from a specific geographic area in the city.'",
        "'speaker_11': 'So we went to the contingency plan that we had developed during the two year kind of vetting process with the county and employed or deployed basic life support ambulances four days a week, Wednesday, Thursday, Friday, Saturday for 9 hours on those days to ease the ease the number of times that our A+ ambulances were going to the'",
        "'speaker_11': 'hospitals. So those those ambulances, peak load staffed ambulances that are staffed with two non-career ambulance operators, started taking some of our basic life support patients to the hospital. And that has proved to be a very effective addition to the program in that it keeps our ALS units available to respond to those calls that are a higher, higher'",
        "'speaker_11': 'critical need.'",
        "'speaker_6': 'Well, thank you. And you mentioned the basic life support system, but can you discuss what duties one paramedic can do on an ALS call versus what attest to paramedics on the scene would perform or could perform.'",
        "'speaker_11': 'The the solo paramedic or the one paramedic that's on an ambulance can do all of the functions covered under the L.A. County scope of practice for a paramedic assessment unit. So they can intubate, they can defibrillate, they can start an I.V., they can do advanced airways, they can push cardiac medications.'",
        "'speaker_11': 'They can do all of the things that a paramedic assessment unit can do. In a nutshell, basically, the big difference is that solo paramedic cannot provide some controlled drugs, a couple controlled drugs that we carry that have to be issued with with a partner on scene.'",
        "'speaker_11': 'But for the most part, not for the most part, they can do everything that's covered under the the paramedic assessment unit. Scope of practice for L.A. County.'",
        "'speaker_6': 'And so with that on, we understand with the one and one that in terms of transporting patients to the hospital, it requires an engine to accompany the paramedic rescue. Is that correct?'",
        "'speaker_11': 'Councilmember It only requires the engine to accompany the ambulance to the hospital should it be considered a Tier one patient, for example, a patient that is in full arrest, that prior to our M.D., we would have gone with the engine to the hospital as well anyway, only or possibly like a gunshot wound or a traumatic full arrest'",
        "'speaker_11': 'or a car accident, you know, of an unstable patient. We we say that we on a tier one, we call that a tier one. We want the second paramedic to get in the ambulance in a company to the hospital.'",
        "'speaker_11': 'For all intents and purposes, it is it should be exactly the same today as it was prior to the implementation of our M.D. as far as who's going to the hospital and when on on patients that meet 808 criteria or transport criteria to the hospital, but they are stable.'",
        "'speaker_11': 'They are allowed under the four or seven policy through the county guidelines to transport that patient to the hospital with one paramedic in the back of the ambulance and an EMT driving.'",
        "'speaker_6': 'So we won't see more the use of more engines at a at cause. Is that what you're telling me? They won't that won't be impacted by the R&D council councilmember.'",
        "'speaker_11': 'The the initial implementation of our MDO. I will tell you that there we did see an an increase in the number of engines that were going to the hospital. We consider that to be something. That's because it's a new program.'",
        "'speaker_11': 'And the captains were being diligent in trying to follow the new protocols and they were going to the hospital more. But we're starting to see that taper off a little bit now. And now they're following kind of the guidelines that were set forth in the R&D manual.'",
        "'speaker_11': 'The future we do we do not anticipate that the R&D program is going to generate more Type one calls for service or transports than it did in the past. And there should be no different.'",
        "'speaker_6': 'All right. Thank you. And a question for the chief of police there. A few.'",
        "'speaker_0': 'And as they're sitting, I know that we have a time certain as well for one of our items, which is the language access item. And so that will be heard right after we conclude the budget hearing and as close to the time certain as possible, which I know is initially 8:00.'",
        "'speaker_6': 'Thank you, Chief, for with all the work you and your the men and women of your department do, I'm always amazed at what you're able to do, and it seems you're doing more and more with less and less.'",
        "'speaker_6': 'I want to thank you especially for highlighting the work you're able to do on initiatives brought forth by the last Council to highlight prohibited possessors and go after those individuals who have been court ordered not to own guns and or possess guns as well as our work on human trafficking.'",
        "'speaker_6': 'This this year's budget is about $8.1 million budgeted for overtime for the department, and there's an additional 2.2 million proposed for one time with oil revenues. Is this $2.2 million going to be enough to help identify and deal with those special priorities, such as prohibited possessors and human trafficking?'",
        "'speaker_6': 'Or will all that money be needed just to cover the anticipated shortfalls in the regular overtime needed in the department?'",
        "'speaker_12': 'We we will continue with the priorities as we were able to set last year with the additional funding that the Council is able to allocate. If we get to a position made quarter year or mid-year where we're not able to sustain those efforts, we'll go back to the city manager and make a request for additional funding at'",
        "'speaker_12': 'that time to be able to continue to enhance our operation. But the things that the subjects that you identified, the human trafficking, the habitat possessors in particular are critical to the safety of the city. So we'll continue to prioritize those as we move forward.'",
        "'speaker_6': 'You know, I want to echo my colleague's concern on Councilmember Price, her concern regarding residential burglaries. We're doing a fantastic job with dealing with violent crime. The numbers are just astonishing. But we do see a rise in residential burglaries.'",
        "'speaker_6': 'When we go to our neighborhood meetings or community watch meetings, I'm trying to figure is there a nexus to the residential burglaries that you believe it to be a nexus to that in AB one or nine?'",
        "'speaker_12': 'Yeah, I do absolutely. That the we've been able to as best we can with the compliance teams we have and the resources we've been given to be able to monitor the individual individuals out on a be one or night.'",
        "'speaker_12': 'But we've seen on broader studies that there is an increase in communities that are heavily impacted by SB 109, particularly in Grand Theft Auto, the GTA category, but also in residential, commercial and and garage burglaries as well. So they are certainly a focus of our attention and we do the best we can to be able to monitor'",
        "'speaker_12': 'and then continue to let them know. We're watching them very closely.'",
        "'speaker_6': 'Well, that's something that we will be watching very closely as well. And as the chairperson of the the legislation committee, I mean, we will definitely be advocating for for support from Sacramento. Thank you. Can you please elaborate on more more on the proposed restructuring of the detective division to reassign 11 detectives from juvenile investigations, to work on'",
        "'speaker_6': 'homicide, narcotics, gangs and other high profile cases. And how do you believe this will affect caseloads in particular with juvenile crimes?'",
        "'speaker_9': 'Sure. We. I had that written.'",
        "'speaker_0': 'Councilmember Richardson. Get more information. Go ahead, Councilmember. Continue. I thought you were all wrapped up.'",
        "'speaker_7': 'He's responding.'",
        "'speaker_9': 'Thanks. No answer.'",
        "'speaker_12': 'Just a quick update on the the investigations reorganization. We're moving individuals around within that function to be able to focus on where we can get the most the most success from the people we have. We're increasing the career criminal investigation detail.'",
        "'speaker_12': 'We're increasing burglary investigation, we're increasing computer crime investigation, as well as vice investigation. So in looking at that, what we've tried to do as best we can as to be able as we have with gangs, to be able to make more of our officers, generalists, if you will.'",
        "'speaker_12': 'And detectives, there's when we talk about gangs, we focus on on gang members. But as we know that they do all sorts of crimes. So they're involved in homicides, shootings, burglaries, robberies. And so as best we can, we try and use the expertize of all of our detectives and officers to be able to deal more effectively in'",
        "'speaker_12': 'this realm. The issue, I guess, the cost to us is that we don't have as many people who are over many years experts in a particular gang. So that's something that we we try and remediate, but we want to be able to increase the level of expertize across the board of all of our folks.'",
        "'speaker_6': 'You know, part of that residential crime trend is that we see a lot of young people involved as well. And I'm concerned about the effects of truancy in our schools, especially with the rise in daytime property crimes that we're experiencing.'",
        "'speaker_6': 'What are the current resources allocated between the police department and school district to address truancy issues? Do you have any?'",
        "'speaker_12': 'We do, yeah. We meet regularly with the the command staff, if you will, of the early or Long Beach Unified School District. Well, as I mentioned, we've restructured our juvenile investigations section to improve process and balance detective caseload.'",
        "'speaker_12': 'We continue to be proactive to be able to address juvenile issues. As I mentioned, meeting regularly with Long Beach Unified School District, working with CCJ to implement a juvenile restorative justice program. And we're enforcing both truancy, loitering and curfew violations.'",
        "'speaker_12': 'So those are those are issues, too, that we know that if somebody should be in school and they're not during the daytime hours, then there there's somebody who potentially is going to get in trouble and involved in thefts or burglaries.'",
        "'speaker_12': 'Yeah, we we still have five school resource officers still involved. And they're a great resource for us, able to be able to develop a rapport within the the the campuses, but also to be able to obtain information, know who the kids that are most likely at risk and for us to be able to deal with those.'",
        "'speaker_6': 'So as I understand it, the way you are restructuring and the department, is it in a manner to become more more nimble and quasi utilizing officers in various capacities to address what.'",
        "'speaker_12': 'Exactly, sir? It's to be able to make all of our officers and detectives more able to be able to handle whatever comes their way.'",
        "'speaker_6': 'And we're going to see more officers on the street.'",
        "'speaker_12': 'We're hopeful. We're constantly it's we're constantly in a state where we're we're using the flexibility we have to be able to address the problems as they come before us. We we use crime analysis to be able to identify trends, patterns, clusters of crime and to be able then to use the resources we have in a way that'",
        "'speaker_12': 'we're as nimble as we can be to be able to have the maximum impact.'",
        "'speaker_6': 'Well, we appreciate it. Last last question on not only the police officers that are contractually obligated to other duties, such as airport, the city college, port, school district, how many budget budgeted positions do we currently have and how many of those positions are currently filled?'",
        "'speaker_9': 'You say? Yeah.'",
        "'speaker_12': 'We have 806 806. For fiscal year 15, the sworn officers budgeted. And if you if you back out the number of people that are contract positions that 70 sworn in 16 civilian positions to include school resource officers Long Beach City College, the port transit, the airport and Carlito's Housing Development.'",
        "'speaker_12': 'It brings us down then to 736.'",
        "'speaker_6': 'Okay. Thank you. And how does that compare to last year's numbers? I mean, we were.'",
        "'speaker_12': 'We're up by three over last year. We had 803 last year were 806 this year budgeted.'",
        "'speaker_6': 'Thank you, Chief.'",
        "'speaker_12': 'Thank you, sir.'",
        "'speaker_0': 'Thank you. Got somebody?'",
        "'speaker_7': 'Oranga Richardson.'",
        "'speaker_4': 'Well, don't last this time. Wonderful.'",
        "'speaker_7': 'Just give me a minute.'",
        "'speaker_4': 'You're your last.'",
        "'speaker_0': 'We've got two more.'",
        "'speaker_4': 'Up to our wonderful two sitting on, Chief. Thank you very much. Always. You do some wonderful work. I know with my experience, having work that's a recruitment officer for the city. I know the wonderful work that you and your staff do for the for the communities in the city of Long Beach and as well as the lovely'",
        "'speaker_4': 'City College. I was there when we changed from a community college law enforcement team to one that transitioned to the police department. And you're doing a wonderful job. I read the report early June regarding the statistics for Lombard City College and crime is also down there as well with limited guide.'",
        "'speaker_4': 'So good job.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_4': 'I also want to commend your officers. I've had a number of community meetings as well in my district, as well as having your officers consistently attend the neighborhood association meetings where they reinforce again and again the need for self-awareness, the need for knowing your neighbor, the need for locking up when they leave and not leaving anything outside'",
        "'speaker_4': 'or in their vehicles to prevent crimes of opportunity. Because we all know that that's what they are the crime to arbitrate. In regards to your staffing, you just answered the question that I had in terms of your budget and where you're at currently.'",
        "'speaker_4': 'The you have an item here where you get some money from general grants. What types of grants would those be?'",
        "'speaker_9': 'You you're talking with a council member.'",
        "'speaker_13': 'Your anger that we actually have a number of of homeland security grants that come from FEMA and the federal government that account for millions of dollars, actually, of equipment training, overtime expense. And then we also have law enforcement grants from various agencies, both state and federal, that focus on specific aspects of crime, whether it's our JAG burn'",
        "'speaker_13': 'grants, whether it's focused on crime lab work or perhaps their real estate fraud grants. So there's a range of different funding sources that focus on different issues that that face law enforcement.'",
        "'speaker_4': 'Are these grants time sensitive in regards to when your grants to your grants, are there any grants that you have that might be institutionalized and ongoing services?'",
        "'speaker_13': 'Yeah, actually, there's there's a number of grants that we we've been the recipient of for six or more years. And you'll you'll actually see some of those coming your way as council members over the next couple of months, as we are awarded each year, grants such as the Office of Traffic and Safety.'",
        "'speaker_13': 'That's a $400,000 grant that that amount will fluctuate year to year. But those are those are reoccurring for the most part. Other funding sources that come from the state, they'll actually come from the appropriation in the in the state's budget like our 8109 money.'",
        "'speaker_13': 'That amount will fluctuate year to year, but it's now a consistent source of revenue for us in our special revenues.'",
        "'speaker_4': 'And continuing along those lines, are there other grants out there available that might be able to that you might be able to go after, that would be able to improve the level of service that we receive?'",
        "'speaker_13': 'Yeah, we have we're very active actually, and have been very successful, particularly with the Homeland Security Grant Program that's managed by Deputy Chief Farinelli of identifying projects that are regional in nature. That's where we get the lion's share, the larger grants.'",
        "'speaker_13': 'But there's there's really an active ongoing process each year within the department to identify funding sources down at the operational level. We'll hear about opportunities from the front line of of grants they've either heard about through their various professional associations that focus on different aspects of crime.'",
        "'speaker_13': 'So we're actively seeking those opportunities. And whenever they come our way, we will present them to the city management, to the council, and then apply for them as they become available. The other source that I'll just point out is, is grants that come through other departments, and the police department sometimes is a matching partner.'",
        "'speaker_13': 'We provide some law enforcement aspects of some of the other inter-departmental activity, whether it's with the Health Department, Development Services, neighborhood based grants. So sometimes we just partner as the law enforcement match in those grants.'",
        "'speaker_4': 'And one final question then in regards to your staffing, a big concern in this in the seventh District, obviously, is the spike recently in gang activity and shootings on the seventh District. So that would be my concern in terms of being able to maintain a level of service in the seventh District that would address those issues.'",
        "'speaker_4': 'And along with that, it's you're you're budgeted for 800. Six, you currently have 736. I'm going to make an assumption that there's attrition that will be taking place within the next year or so. Would you anticipate that attrition to be next year since you're going to be you do want to put in an academy this funding, this'",
        "'speaker_4': 'current fiscal year. Let me rephrase it. The next fiscal year. Right. And with attrition, I don't see you making any advancements in personnel to reach that fully funded 806 officers unless you hold two academies. What's the plan?'",
        "'speaker_12': 'Yeah, we we attract generally between 34 and 40 out on a high year to regular retirements and other separations as we're going through the tough economic times that we've been going through. We didn't have an academy for five years, so we're happy now to be on in the selection process for our third academy and in the last'",
        "'speaker_12': 'three years. So we're moving forward with that. We're trying to maintain the level that we've we've been budgeted for as we move forward and hopefully the city gets healthier economically, we we would hope that we could increase the overall T.O. of the department.'",
        "'speaker_4': 'Thank you, Chief. Thank you. I'll take fire. He gave me a high saying, when you're there, Kathy, we're here, sir. Okay. Thank you. Again, my experience working in the fire department. You have some wonderful men and women there that work for the department and and providing some wonderful and great services to the to the city.'",
        "'speaker_4': 'One of the things that really stood out here was I was there during the time when we were looking at hiring our first female firefighters. And there was an issue regarding facilities. And I'm glad to see that you're addressing those, although albeit, you know, it's taking you 20 years.'",
        "'speaker_4': 'But I know you're making progress. I guess I know a lot of the questions that came up have been on the R&D and my questions are no different. I know that some of the questions are related to two levels of service, and I know it's all about patient care.'",
        "'speaker_4': 'And I and I don't really think that there's an issue with the level of patient care that that the citizens are getting when we have this while we're in this, a two year study of R&D. So that means that we're going to be going through, what, two 2016 with the state?'",
        "'speaker_9': 'Yes, sir.'",
        "'speaker_4': 'Okay. And during that two year period, you're going to be allowed to make adjustments, to be able to tweak the service, to ensure that you're getting the optimum level of service that you think the R&D can provide.'",
        "'speaker_11': 'Council Member We AS Yes, yes, yes. But with the caveat being that we will work with the EMS agency, the local EMS agency, to ensure that they're very much abreast of any sort of changes we need to make or recommendations we make to make it more effective so as to make sure that they know what we're doing'",
        "'speaker_11': 'with. At the core of this really is the Data Safety Monitoring Board, who is evaluating all the data points. We want to ensure that they know every step of the way what we're doing, so that way they can measure the effectiveness of the delivery model.'",
        "'speaker_11': 'So we'll keep them plugged in as well.'",
        "'speaker_4': 'And if I heard you correctly, 83% of your calls are EMS related.'",
        "'speaker_11': '84.33%.'",
        "'speaker_4': '84.33. When there is a response like that, let's say, for a fire, is it automatic that you send the a paramedic ambulance service out, whether it's an A+ or a B? Ellis.'",
        "'speaker_11': 'Go ahead. Sorry. Yes. Councilmember one a structure fire response in the city of Long Beach for a first alarm or that the initial structure fire response includes three engine companies, one truck company, one rescue ambulance and one battalion chief.'",
        "'speaker_11': 'So, yes, an ambulance does go on fire calls.'",
        "'speaker_4': 'Now, my experience with working with the fire department has been that when there is a response of that nature, it's all hands on deck. Everybody has a job. Everybody does something. In this model R&D, does the EMS have any technical fire related duties to put right there?'",
        "'speaker_4': 'Or what does he do?'",
        "'speaker_11': 'Because remember, the the if you're referring to the ambulance operator on the ambulance, they are non sworn not they're not firefighters. So they do not engage in the firefighting component of that evolution or that operation. So our policies call for them to be assigned to a location that is outside the area that is immediately dangerous to life'",
        "'speaker_11': 'or hazardous to health. So they would either be assigned to the command post, possibly with the battalion chief. They could be assigned to set up a medical group in a in a location far enough away from the incident so as not to be harmed.'",
        "'speaker_11': 'Or they could be assigned to some other functions so long as they're not performing firefighting activities on the fire ground, they're not they're not trained to do that.'",
        "'speaker_4': 'In a worst case scenario, let's say that this unit is assigned to a fire and there should be a real A-list type of emergency response elsewhere in the city. Would there be sufficient coverage to respond to that?'",
        "'speaker_11': 'A councilmember? Yes. Yes. The the system, as we have it in place now, and this is consistent with the way it's been for ever since I've been here over 20 years or longer, ever since we started EMS in the seventies.'",
        "'speaker_11': 'We do have sufficient resources to run subsequent calls that happen in the city while there's a structure fire happening. But going back to comments I made earlier that if for whatever reason we did have more calls for service come in than we had available units, which is possible, then we would rely on our automatic and mutual aid'",
        "'speaker_11': 'systems to backfill the city. Probably the best example of that would have been in 2006, when we had the Paradise Gardens fire in North Long Beach. We literally depleted every resource in the city of Long Beach to fight.'",
        "'speaker_11': 'That fire was a huge fire. We relied on our partners from L.A. County Fire, Orange County Fire and from the region to come in to Long Beach to run calls for service. So that system is available to us anytime we need it.'",
        "'speaker_11': 'But on a day in, day out basis, I mean, 2 hours ago when we started this council meeting, there was a structure fire response in. The city. We continue to run EMS calls concurrently while we handle that structure.'",
        "'speaker_11': 'Fire.'",
        "'speaker_4': 'Very good. In regards to the total service of of EMTs there. I understand. And I'm newly elected. I'm going to be able to say that for another couple of meetings. But I'm trying to get my arms around around this in terms of how this happened.'",
        "'speaker_4': 'From my understanding, there was a contract with a private ambulance service. Correct. That was providing this EMT service or BLS type of service where non-emergency calls and transportation. Is that no longer feasible? Is that the goal, basically to eliminate any kinds of contracts of that nature?'",
        "'speaker_11': 'Councilmember in 2005, the city of Long Beach and the Long Beach Fire Department took over the basic life support transport functions. Prior to that, we did have contracts with a couple private providers. At one point it was Goodhew, then they were bought out by Amer American Medical Response.'",
        "'speaker_11': 'And in 2005, we we felt it important to take over that transport function for a couple of reasons. Number one, we felt we could provide as good or better service to the community by doing it in-house. Number two, we would the city of Long Beach would recoup the transport revenue associated with taking people to the hospital.'",
        "'speaker_11': 'And number three, we looked at it as a great opportunity to bring young men and women into the organization that had had aspirations to be firefighters either in Long Beach or someplace else, and provide them front line, real world kind of training and exposure to to the fire service.'",
        "'speaker_11': 'And all those things have proven to be true. We are in fact getting the transport revenue. The Bliss program does provide good opportunities for young people trying to break into the fire service. And and it's been a very effective program for us since 2005.'",
        "'speaker_4': 'Great. Last question. I promise this time. Has there been an increase in costs for the community in regards to having a two paramedic unit to the transports, both to having an EMT paramedic transport? Was it less expensive before or more expensive now?'",
        "'speaker_4': 'What's what's the relationship? I mean, I'm trying to determine the community the community aspect of this in regards to their levels of service and what they expect and what they deserve. And, of course, doing it reasonably within their budgets.'",
        "'speaker_4': 'Because I I'll tell you, I had I had a response a couple of years ago when my son had an allergic reaction to Hanukkah because he tried to die. Is here let me rephrase that. His girlfriend tried to die here and he had an allergic reaction to it.'",
        "'speaker_4': 'His head swelled. He looked like that puppet that was here. And I mean, it was it was it was it was awful. I mean, I went home and I said, oh, my God, you maybe I could punch away a puncture and go back down.'",
        "'speaker_4': 'But of course, they've been dangerous. But the cost to me was a lot. It was it was it was very expensive to have him transported to a to an emergency hospital, I think it was memorial at that time.'",
        "'speaker_4': 'And is that still true? I mean, is there is there a big costs associated with this? And if there is, what would that be? And what effect does that have in terms of the services that you provide and what the community deserves?'",
        "'speaker_11': 'It? Councilmember There there is it's included in the city's master fee schedule. There is a cost for transport, both ALS and bills to the hospital that that number gets evaluated annually. We have in the city of Long Beach been tied to the county's cost for transport for a number of years.'",
        "'speaker_11': 'Last year we adjusted which it can be found in the in the master fee schedule. That number was adjusted incrementally with the cost of inflation that has there's no change there. With regard to the RMD program, an ALS transport, advanced life support transport still gets billed as an ALS transport and a bus transport still gets billed as'",
        "'speaker_11': 'a bowls transport. So there's no there's no real change there with regard to this particular service delivery model.'",
        "'speaker_4': 'Thank you, Chief.'",
        "'speaker_0': 'Thank you. And finally, we had Councilman Gonzales.'",
        "'speaker_9': 'Ben Ricks. Sorry about.'",
        "'speaker_0': 'Gonzales. Richardson actually let him go first. Okay.'",
        "'speaker_7': 'I mean, me and Councilmember Austin don't look that much alike. Thank you, Mr. Mayor. I'm going to try. I know that there's some folks here, so I'm going to try to be as as timely as possible with my questions.'",
        "'speaker_7': 'Chief, so the first I want to touch on is Sirte, the Sirte program. So me and my wife did the Sirte program. We think it's awesome. We've got a bunch of residents who are excited about it. And I know there was chatter about I know that we were able to fund the Sirte coordinator position through grants.'",
        "'speaker_7': 'And there was chatter this year about that grant expiring. So. Can you shed light on, you know, if that's the case? And if so, what would be our plan to continue the program? As folks are getting excited about it and ramping up.'",
        "'speaker_11': 'And Councilmember, thank you for that. Yes, I do. Our Sirte program is perhaps one of the best in the region, and it has continually grown year in, year out. We have offset the cost for our Sirte instructor through UAC grants, through local urban areas, security initiative grants and other available grant dollars that we're able to cobble together'",
        "'speaker_11': 'with our partners in Los Angeles County to offset the cost of that certain structure. And it is true. Last year, we, we, we came up close to a deadline on losing or having those grant dollars run out. But we were able, through the leadership of the city manager and putting our heads together and figure figure out a'",
        "'speaker_11': 'way to continue to fund that through the remainder of this fiscal year. Going into fiscal year 15, the Urban Area Security Initiative has awarded additional grant dollars for certain functions throughout the county. We will definitely be first at the table to go after some of those dollars, and we'll continue to work for long term sustainable funding options'",
        "'speaker_11': 'for the SIRT program in the future. We do value it and we do place a high priority on the benefit it's providing our community.'",
        "'speaker_7': 'Great. Thank you. So the next question I have is about the GMT funding. So I know it's been I know we've been burned once in terms of expecting that program to roll out a certain way to where we can expect a steady stream of funding.'",
        "'speaker_7': 'So my question is, quite simply, where are we now in that discussion?'",
        "'speaker_11': 'Councilmember if you'll indulge me, I'm going to have Director of Finance John GROSS weigh in on that. They've been in receipt of the funds.'",
        "'speaker_9': 'Coming in, so. Council member, we are expecting to continue to receive GM funds. There has been a delay in what we are expecting for this year. We are very hopeful that it will come in early next year at the amount we think it is the and that is scheduled to be used to buy fire engines if council'",
        "'speaker_9': 'approves. The ongoing funding from GMT is expected to be in the 400 to $500000 range and that's included in the budget substantially lower than we had originally anticipated. But it is anticipated to continue.'",
        "'speaker_7': 'So what we anticipate is 400 to $500000 annually ongoing?'",
        "'speaker_9': 'That is correct.'",
        "'speaker_7': 'Okay. Thank you. So the next question I have is, I mean, along the same vein is revenue for our fire department. I know that last year there was a motion by Councilmember O'Donnell and Councilmember Neel and a number of folks about potential reimbursement opportunities for public safety with the enterprise funds.'",
        "'speaker_7': 'And I see that you've taken great steps in in capitalizing on that with the fire boats and in the port of Long Beach. So the question I have are, well, what are other services that perhaps the fire department used to used to perform that they might not perform anymore?'",
        "'speaker_7': 'And what would those opportunities look like if we did look at other enterprise funds like gas and water?'",
        "'speaker_11': 'Councilmember The I don't know that I could speak specifically to anything that we've done with the Gas Department. One thing that has come up in the past with the on the water side of things is the annual hydrant servicing.'",
        "'speaker_11': 'We used to go out and throughout the entire city, all 5000 plus fire hydrants would get exercised by the fire department once a year. We go out and follow them and then report back to the water department on on those hydrants that were malfunctioning or not functioning to the standard we needed them to.'",
        "'speaker_11': 'But other than that, I don't know that we have anything specifically that we do for them.'",
        "'speaker_7': 'Was that like a major task if I mean, if we were to put a dollar sign on what we expended to do that? Well, what does that look like? Are we talking about this was, you know, something that Indian team took on and we just absorbed the cost and it wasn't insignificant.'",
        "'speaker_7': 'But if you were to put a number on it, what would that number be?'",
        "'speaker_11': 'Well, it it was a it was a fairly arduous task. And we go out in throughout the entire city, in the various response districts, those that front line company would go out and spend time over a period of a month, basically off and on, going out, exercising the hydrants to put it put a dollar amount to it'",
        "'speaker_11': '. I think I would need to I would need a little time to kind of sit and figure out what that looks like. But it's a big task and.'",
        "'speaker_7': 'That makes sense. I guess the point that I want to make is I think we should close the loop or expand on that loop about those opportunities. Now, I know that our water department might not be in the position to enter an agreement like that, and I mean, given what their plans are.'",
        "'speaker_7': 'But we can expect that you can or maybe city manager, you know, we can explore those opportunities within this budget just to see what potentially could be there with gas and water. Moving on. I wanted to just chat about the academies quickly.'",
        "'speaker_7': 'So during these academies, how many how many firefighters that we put into service? And just as a general answer, how many folks have we recruited? I know we have a long, expanded, long, arduous process. How many folks from Long Beach are getting hired?'",
        "'speaker_11': 'Councilmember I don't I off the top of my head do not have the answer to that. I can get back to you. I can tell you, we graduated a recruit class of 28 people was the last class. How many are from Long Beach?'",
        "'speaker_11': 'I can't tell you. But I can tell you that this class that we're putting together that's getting ready to start in the next couple weeks is is going to is going to have a number of people that are from the general, either from the city or from the very close region.'",
        "'speaker_11': 'And it's going to be it's going to be a very good academy class that's very representative of our community.'",
        "'speaker_7': 'Sure. And finally, I want to talk about armed. Now, I'm not going to belabor anyone's points. I think the council council's ask a lot of questions and has actually clarified a lot for me. But I have some I guess some quick questions for you.'",
        "'speaker_7': 'This is a cheaper system, correct?'",
        "'speaker_11': 'This deployment model is less expensive than the model we had deployed prior. Yes.'",
        "'speaker_7': 'Okay. So are we saving money today?'",
        "'speaker_11': 'Yes, sir.'",
        "'speaker_7': 'Okay. Have we anticipated how much we're going to save this year by utilizing this program?'",
        "'speaker_11': 'Councilmember The target budget savings is $1.4 million a year.'",
        "'speaker_7': 'Is. Is that okay, that budget savings, are that being utilized to put other things into service? Or is that at the end of the year we're going to be able to diminish the budget? Like how does that work?'",
        "'speaker_11': 'Councilmember No, that would be our target, that that number was our target reduction that we we needed to meet in fiscal year 2013. So that that number, if you recall, if you recall back, we were given bridge funding, if you will, or one time funding to get us through the implementation phase of RMD.'",
        "'speaker_11': 'So that number is reflective of a reduction from a couple of years ago that we are now just actually realizing.'",
        "'speaker_7': 'Great. Now I understand that now the pilot period is over. It's a two year period, right?'",
        "'speaker_11': 'Yes, sir.'",
        "'speaker_7': 'I've heard a lot of discussion tonight about putting additional resources into play. Would that not distort the baseline for measurement for how successful the program is? If we were to say, you know, put another paramedic in to serve another engine or a rescue in a service, would that not distort the baseline for evaluation of how successful the'",
        "'speaker_7': 'model is?'",
        "'speaker_11': 'Councilmember I don't know that it would distort the baseline for evaluation because if you look at the comparison, what we were comparing before was two paramedics on a rescue ambulance and nine paramedic assessment units as compared now to 11 paramedic rescue units and 17 paramedic assessment unit engines.'",
        "'speaker_11': 'So the the study what we're attempting to study with this or what the data safety monitoring board through the EMS agency is studying is whether or not there is a degradation of service, whether or not we're equal to more capable or less capable with an alternative deployment model and the number of apparatus in the system that really'",
        "'speaker_11': 'only helps with response times to issues or the number of transports per issue. The effectiveness of the individual paramedic rescue ambulance with one paramedic on it is what's being studied. Not so much how fast they're getting there, although we're doing that faster.'",
        "'speaker_11': 'So, so.'",
        "'speaker_7': 'Response times not value. That's not a factor in how we evaluate.'",
        "'speaker_11': 'It is it is one of the 36 components that they look at in the study.'",
        "'speaker_7': 'Okay. So when I said baseline, just to be clear, let's say the fire department spends $100 on paramedic program this year. And if we put more into service next year and we change that $100 to $120, that might affect the outcome.'",
        "'speaker_7': 'And that's my that's my logic here. So you're telling me that the way that we evaluate this system, no matter if we put into place a different set of resources, that that will not affect the impact that will not impact the way that we evaluate the system.'",
        "'speaker_11': 'That's that's correct. We're not we're not studying how many resources are in the system. What we're studying is whether or not one paramedic can function effectively in the system.'",
        "'speaker_7': 'Great. So I guess the final question and you keep mentioning this, who's the agency that that is monitoring this process?'",
        "'speaker_11': 'The Los Angeles County Emergency Medical Services Agency, Data Safety Monitoring Board.'",
        "'speaker_7': 'Okay. So that's the group that's. So when do they report back to us on how well it's going?'",
        "'speaker_11': 'Councilmember I don't know that they feel they have any responsibility to report back to you specifically on how it's going. I do believe that they're going to capture all of this data that we provide them over two years and actually publish this in some sort of medical journal.'",
        "'speaker_7': 'So we're going to wait two years before we hear a third party analysis on these qualitative things that when you report, we hear about response times in and in those things. That's the language we've we've been speaking. But we're going to hear back from this group after two years about the issues that the 32 points that we'",
        "'speaker_7': 'really haven't discussed that what the plan is.'",
        "'speaker_11': 'Councilmember I mean, I'm happy to go back to the EMS agency and ask if the the Data Safety Monitoring Board would be willing to share.'",
        "'speaker_7': 'Some periodic.'",
        "'speaker_11': 'Updates or something with the council. And certainly happy to do that.'",
        "'speaker_7': 'Thank you. And then I guess the last thing I have for you is I think in your budget, in terms of your FTE, you left one off because you left that ghost in Fire Station 12 and now my staff has to deal with it.'",
        "'speaker_7': 'You sort to move them over to the councilmember.'",
        "'speaker_11': 'So you we, we tried we we did our due diligence trying to capture that ghost and move him to the new facility. However, he seems right at home where he's at. And so we will make periodic visits over there to to say hi.'",
        "'speaker_11': 'But he seems right at home where he's at.'",
        "'speaker_7': 'Thank you very much, Chief. So I just have a few remarks for the chief of police. So just quickly, I just want to plot the way that you and the whole city management team has presented your your budgets as a continuum of of of public service, public safety.'",
        "'speaker_7': 'I think that you've hit the nail on the head in that our residents need to understand their role and continue to understand their role in that continuum. The more active neighborhood associations we have, the more block clubs, neighborhood community watches that we have, that's everyone has a part in this.'",
        "'speaker_7': 'And I really appreciate the fact how engaged your officers are at attending the ten neighborhood associations in the ninth District plus community watch. So, so I just wanted to begin by saying thank you for that. I wanted to just touch base and I know the gang units and the special investigative units stuff has come up a lot'",
        "'speaker_7': 'tonight. So I guess my question is, it seems like there's been a transition from, you know, we used to calculate, you know, we got this many people in the gang unit, right? It was in the p t in the Gazette this week.'",
        "'speaker_7': 'You know, we're not funding this many units in the gang, this many bodies in the gang unit. Right. But at the same time, I guess my question is, what is the approach we've got? I certainly support the allocation of one times to overtime.'",
        "'speaker_7': 'But what would be the approach to meet the needs of and you've mentioned it before, and I'm going to ask this again because I have a follow up question to this. But what is the approach to utilizing overtime to meet the needs of these special investigative units?'",
        "'speaker_7': 'Great.'",
        "'speaker_12': 'Thank you for the question. And going into the gang enforcement section, the strategies that have changed over the years, we've got a department wide focus where everybody works gangs. As I mentioned, the downside to that is we lose specific expertize about individual gangs.'",
        "'speaker_12': 'It's only achieved over time and in repeated contact addressing gang enforcement through other efforts. We're looking, as you mentioned before, human trafficking realignment, prohibited possessor. Many of the suspects from those kind of cases are also gang members. We look at long term problem solving and strategies, cops projects where we have repeat calls for service to two trouble'",
        "'speaker_12': 'locations. We look at that long term and try and bring all the resources we can to bear on that. And that includes partnerships with other departments. We have constant communication and coordination of resources to be able to address emerging trends.'",
        "'speaker_12': 'We have hotspot analysis. We increase forecasting and planning evaluation of resource deployment, whether it's debt teams, impact motors, the realignment team. We use the tools that best fit the problem. We use curfew and truancy checks, party calls, blue line enforcement.'",
        "'speaker_12': 'And then when we have a case, a relentless follow up where we roll back on search warrants, do parole and probation searches, we very effectively working with the city prosecutor's office to use gang injunctions to be able to impact the gang problem.'",
        "'speaker_12': 'We have patrol resource officers in each of our divisions that focus on the areas that are most challenged. We use technology as much as we can, leverage that to be able to give us, as we say, a force multiplier effect.'",
        "'speaker_12': 'Community watch we went into and again, that's a critical component, whether it's property, crime, quality of life or violent crime. The community getting engaged and being our eyes and ears and helping us know what's going on in their neighborhood is critical.'",
        "'speaker_12': 'Graffiti, reporting and removal and then participation in the city's violence prevention plan. All of these kind of coming together as a comprehensive approach to gang enforcement and and trying to use alternatives to incarceration where it's appropriate to be able to use education prevention, intervention, as well as then when somebody goes to prison and gets out as best'",
        "'speaker_12': 'we can, reintegration back into society.'",
        "'speaker_7': 'Thank you. So by not specifically carving out a special unit like the gang unit and putting them into a larger pool where all the detectives sort of work those sorts of cases or that type of work, how do we quantify or how do we measure whether there might need to be a change or something?'",
        "'speaker_7': 'I know that, you know, you've done great work with human human trafficking, right. As an example. And I thought my understanding was when you did that, you dedicated some officers to work specifically on that. Wasn't that the approach?'",
        "'speaker_7': 'There was.'",
        "'speaker_12': 'Overtime? A lot of.'",
        "'speaker_7': 'That overtime.'",
        "'speaker_12': 'Right. And then just a point of clarification, we do have a gang unit. We don't have the gang filled team that we used to have, but we still have detectives, working gangs.'",
        "'speaker_7': 'So. So just so you have detectives that use overtime to fill the role of the gang. Now the gang unit.'",
        "'speaker_12': 'Now we still have a gang unit. We just don't have the gang field team.'",
        "'speaker_7': 'You don't have the gang field team. What is the difference between the gang unit and the gang fueled team?'",
        "'speaker_12': 'The the gang field team would be in the field on a nightly basis, interacting with people who were involved in gang activity. We have other detectives who do intelligence work and work behind the scenes on. Failing in and and developing intelligence and sharing that intelligence.'",
        "'speaker_7': 'Great. So the numbers, the statistics you gave earlier, there's the impressive they're really impressive. But I think in terms of there might be just a little bit of education we should do as leaders in the city to educate the community on the new approach.'",
        "'speaker_7': 'Just, you know, it was two newspapers this week, but there is in general, you know, I attended a neighborhood meeting last night. And the perception is there that we've cut our approach to to addressing gangs. And, you know, while the numbers are impressive, I definitely think that there since we're dressed, since we're approaching this differently, we should'",
        "'speaker_7': 'place some value on education in terms of getting out this approach and assuring that the public is comfortable with the with the approach that we're doing that. So that would be all that I have for you. Yeah.'",
        "'speaker_12': 'Thank you. We're trying to be as flexible as we can with the resources we have. And on the gang front, gang related murders are down. Year to date, 26.7%, and gang related shootings are down 36.8%. So when using the, you know, the the the manner we've been deploying our resources, we've gotten pretty good results here.'",
        "'speaker_12': 'So we continue to look at it, continue to monitor it. And as much as we can try and share what we're doing with the community, too, and ask for the community's help.'",
        "'speaker_7': 'That's fair, Chief. Thank you.'",
        "'speaker_12': 'Thank you, sir.'",
        "'speaker_0': 'Thank you, Councilmember Gonzales.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Thank you both for your hard work. Your departments, you know, respectively, have worked so hard for our city. So thank you very much. Thank you. First police chief in the department. It's good to see that you're working on the tech, you know, technology grants.'",
        "'speaker_1': 'I know that we continually are really aggressive on that, so it'd be good to hear more about that. My next question is regarding the realignment.'",
        "'speaker_5': 'So how many do.'",
        "'speaker_1': 'We have in the task force.'",
        "'speaker_5': 'Or the team?'",
        "'speaker_1': 'And do you see any improvements? I know we're working really hard on that, but I often get questions about realignment. And.'",
        "'speaker_12': 'You know, we we it's a that's an evolving issue for us. It started October 1st of 2011. And we we basically have been responding to it since that time. As I mentioned earlier, we have about 900 people early release prisoners who live in the city of Long Beach, which is about 6% of L.A. County's entire realignment population'",
        "'speaker_12': '. It is a big challenge for us, the addresses we have when we try and ensure that we're monitoring compliance with their conditions. The addresses on about a third of the individuals are not good addresses. So we then have to go out and find them and be able to develop good, good addresses and be able to continue to'",
        "'speaker_12': 'to ensure that they're compliant with their conditions. I mentioned that we've had 815 total compliance checks, which resulted in 265 citywide arrests. And I mentioned the off the offenses they were arrested for include narcotics, burglary, weapons violations, sex crimes, gang injunction violations and murder.'",
        "'speaker_12': 'And so looking at how we do this, we've been able to get, as you mentioned, a grant or our share of the compliance money from the state, which was about 525,000. And we get that to some degree. There'll be variance in how much that'll be, but on an ongoing yearly basis and we were able to use 1.1'",
        "'speaker_12': 'million in nonrecurring funds to be able to help bolster our efforts in that regard. And and I attribute a lot of our success in being able to drive down the numbers for both violent and property crime, but property crime in particular, due to the efforts that the Council gave us the ability to be able to do last'",
        "'speaker_12': 'year with that money. Okay.'",
        "'speaker_1': 'Thank you. And then in relation to the 2.2 million for over time, does that is there any thought on the bike patrol? Because I know that's been brought up constantly with, you know, downtown residents, but I know there's also been issues with efficiency on that.'",
        "'speaker_1': 'So is that incorporated or included in this over time?'",
        "'speaker_12': 'They know the 2.2 million that we've been able to get this year for overtime will focus, will keep or maintain our ability to be flexible on that, using overtime to be able to deploy officers and detectives in the field on problems as they occur.'",
        "'speaker_12': 'If we see patterns, if we have shootings to be able to address those as well as then the potential for payback shootings, which dramatically reduces the number of people who are injured or killed, but the ability to look at patterns or trends or clusters of crime and be able to deploy people on an overtime basis to be'",
        "'speaker_12': 'able to address those issues to the degree that we can. We'd love to be able to go from violent crime to property crime to quality of life issues on that as well. Okay.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_7': 'Thanks.'",
        "'speaker_5': 'And then my next.'",
        "'speaker_1': 'Questions are for the chief. Fire chief.'",
        "'speaker_3': 'But.'",
        "'speaker_1': 'So, Chief, I only have one question related to R&D. We talked a little bit about reporting, but are we.'",
        "'speaker_5': 'How often are we reporting to the local EMC?'",
        "'speaker_1': 'Is it do we have a reporting requirement?'",
        "'speaker_5': 'And how often is that? And then how often will that be relayed to us?'",
        "'speaker_11': 'A councilmember. It's a once a month on the 15th of every month. We will provide them the first 15 days of that month and the 15 days of the month prior.'",
        "'speaker_9': 'The previous month of the previous month. Previous months.'",
        "'speaker_11': 'So once a month, we're reporting.'",
        "'speaker_1': 'We'll hear.'",
        "'speaker_11': 'Data to.'",
        "'speaker_1': 'Them. Okay. And then thank you for that. And then another question related to.'",
        "'speaker_5': 'I know you have made improvements and we have made improvements in the city related to homeless are homeless population. So can you speak.'",
        "'speaker_1': 'A little bit about that and what improvements have been made? And I don't know if there's any cost savings on our end related to that because I know I mean, we're primary health care providers for oftentimes for.'",
        "'speaker_2': 'These people so.'",
        "'speaker_11': 'It councilmember the Lumbee fire we do we have historically seen a fairly high number of calls that are related to our local homeless population, both in the downtown area and other places throughout the city, for that matter. For all intents and purposes, the emergency medical services of of the fire department and it's not just the Long Beach'",
        "'speaker_11': 'Fire Department, it's this is a statewide and a national issue have become, in some respects, the primary care providers for those who have no other option to seek medical care. So we have we've employed a number of things within Long Beach Fire to try and address that.'",
        "'speaker_11': 'One of which one of the bigger ones is partnering with our Long Beach Police Department, with their met team and with their quality of life folks. We've worked closely with our health department to try and find other avenues for people to get plugged in to local social services.'",
        "'speaker_11': 'And there's a couple of exciting things coming. We're we're going to try and utilize some technologies to identify people that could be considered high propensity users of the emergency medical services system and and get them plugged in to the various services that exist in the city so as to not have them require, you know, daily 911 to'",
        "'speaker_11': 'go to the hospital for something that could be handled through a routine doctor's visit. So it's something we're in a constant state of evolution and are trying to figure out how best to deal with that population. But it's something we think about frequently.'",
        "'speaker_11': 'Right.'",
        "'speaker_5': 'Thank you. And then my last question, which I know.'",
        "'speaker_1': 'Our friends here will really enjoy, but you talked about our our newest fire academy. And so I think you've defined it as the most diverse class. And so I think this is a great Segway as well. My last question, but.'",
        "'speaker_5': 'What is the composition of this class? Can you tell us?'",
        "'speaker_11': 'Well, Councilmember, I can't tell you just yet. We have it's not because I'm trying to withhold it just because we haven't completed background investigations on a number of sites. But I can't I don't wanna put the cart before the horse, but I can tell you, we put 72 people into background investigations.'",
        "'speaker_11': 'The backgrounds are steadily coming in. I am confident and this is the cream of the crop and this is the the first class off of a brand new list. I am confident that this class will be very reflective of our community.'",
        "'speaker_11': 'It will be a very both gender and racially diverse court class. It's going to be very reflective of our community. And I'm very excited to bring this this new group online. And my commitment to you is we will be sure and let the counsel know who are new classes as soon as we as soon as we see'",
        "'speaker_11': 'them. Great.'",
        "'speaker_1': 'Thank you. And sorry for putting that out there, but thank you so much. I appreciate it.'",
        "'speaker_0': 'Okay. Thank you. And thank you to both chiefs and departments. A lot of questions, good questions and amateur and open for public comment on the budget hearing. If you have a public comment, please come forward and line up if there are any.'",
        "'speaker_0': 'On specific to police and fire. Mr. Goodhew.'",
        "'speaker_9': 'Yes, very good. You correct the address on the police budget or the police dynamic, I think is one of the things we should take a look at. And notwithstanding the fact, I think obviously we have the best police chief this city's ever had and it's going to be a sad day when we lose them.'",
        "'speaker_9': 'Good for the county. There's a problem, though, in my view, having lived in this city since 1978, that every police chief has been saddled with, and that is a dispatch department that is too often problematic. And I think even George Meany would say there's a need for some changes, specifically when the police are called to respond to'",
        "'speaker_9': 'something that is not an emergency. And let let me also preface this by saying I share the chief's view and every law enforcement officers view that when a officer is dispatched, you never want to dispatch them into a blind situation.'",
        "'speaker_9': 'But the realities are in today's society dealing with what the police have to deal with an everyday basis. We get an increasing number of, shall we say, social related calls, vagrants, homeless. And this is not to say that there are not vagrants.'",
        "'speaker_9': 'There are not serious crime problems there and dangerous crime. But when you have calls day after day engendered by and people, vagrants are homeless day after day at the same location, engaged in the same illegal conduct. There is no need to convene the Council of Trent.'",
        "'speaker_9': 'It's a 10/2 conversation. If that period now there either has to be a retooling of the paradigm of the dispatch or seriously considering contracting that out to disciplines that have an understanding of that. Thank you.'",
        "'speaker_0': 'Next speaker, please and please speakers come forward so we can make this as efficient as possible.'",
        "'speaker_1': 'Hi there. I just want to thank Councilwoman Lowenthal.'",
        "'speaker_2': 'And Councilwoman Price can.'",
        "'speaker_0': 'Identify yourself for the.'",
        "'speaker_10': 'Record, please. Oh, sure. Sorry.'",
        "'speaker_2': 'Claudia Scow with Friends of Bixby Park. I wanted to thank Councilwoman Lowenthal and Councilwoman Price for their interest in inquiring about a park ranger budget. Today, I'm here on behalf of a small group of neighborhood associations who have a strong desire for increased public safety at our city parks, and would like to ask for your consideration for'",
        "'speaker_2': 'adding a park ranger program or a few park rangers to the budget, specifically to address some of the needs that we have at our parks. The following neighborhood associations would like to request your support. The Wilmore City Heritage Association in the First District.'",
        "'speaker_2': 'Washington Neighborhood Association in the First District. Friends of Bixby Park in the Second District. Craftsman Village Neighborhood Association in the First and Second District. AOC seven. Second District. Rose Park. Seventh District. North Alamitos Beach in the Second District.'",
        "'speaker_10': 'East Seventh Street.'",
        "'speaker_2': 'Corridor in the Second District. Harvest Farmers Market in the second District. To end in the third District on Broadway Business Association in the second and third District. Bluff Park Neighborhood Association in the Third District. Belmont Heights Neighborhood Association in the third District Bluff Heights Neighborhood in the Association in the Third District.'",
        "'speaker_2': 'West Eastside Community Association in the fourth District. California Heights Neighborhood Association in the seventh District. Wrigley Association in the sixth and seventh District. Wrigley Historic District. Sixth and seventh District. Country Club. Manor Association in Bixby Hills. The Eighth District.'",
        "'speaker_2': 'Jane Addams Neighborhood Association in the eighth District. Highland Park Neighborhood Association in the ninth District. And Start King Neighborhood Association in the Ninth District. Incidents of pot smoking and drug use, drug dealing and other illegal activities make residents and families feel uncomfortable and unsafe.'",
        "'speaker_2': 'Many parks have lost countless park users as a result of these activities. Despite neighborhood groups efforts to revitalize their parks. One example of this epidemic is last summer, five drug dealers were arrested at Bixby Park within a four week period.'",
        "'speaker_10': 'This summer for drug.'",
        "'speaker_2': 'Dealers were arrested within a two week period. Most drug related arrests take place across the street from or in close proximity to the children's playground. The LDP has done an outstanding job responding to burglary, robbery, grand theft and petty crimes.'",
        "'speaker_2': 'But add to all these public safety concerns frequent incidents of public drug use and drug dealing at our neighborhood parks. The neighborhood associations represented on this letter would like to see the leopard's time spent enforcing the law in our neighborhoods and business districts.'",
        "'speaker_10': 'Thank you for your time. Thank you.'",
        "'speaker_0': 'Thank you. Councilor Price, you had a comment just briefly.'",
        "'speaker_5': 'Thank you for the your comments regarding the park ranger program. I did want to highlight that on September the fifth that our next public safety. Committee meeting, we will be asking for a presentation on the overview of the Park Ranger program and we will hopefully be encompassing some of the data that Vice Mayor Lowenthal requested during our'",
        "'speaker_5': 'last budget meeting. And I believe they'll be some data that we'll be able to talk about during the course. I just wanted to address them.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Good evening. Mayor and council members. I am mark, libya. Resident Leader with community of community resident leader with housing long beach district 52741 North Bellflower Boulevard. I'm here today because to address issues on behalf of housing Long Beach and 15 organizations that have received that you have received letters from this week supporting the use of boomerang funds'",
        "'speaker_10': 'for affordable housing. I know this is in regards to the fire and fire and police, but there is no budget hearing on on housing. So we urge the council members to have dialog today on the use of these funds to move forward in protecting 20% of these funds affordable for housing.'",
        "'speaker_10': 'When talking about boomerang funds, we mean that tax increment dollars returning from the state after the dissolution of the redevelopment agencies. These funds were that were once legally protected for development, for quality affordable housing should be returned to this department for continued investment in our housing community.'",
        "'speaker_10': 'We ask the Council to protect in the budget 20% of tax increment that is critical to financing improvements and development of affordable housing stock. Affordable housing is important because it's about giving people a dignified place to live. It protects families, working citizens, children, disabled and elderly from homelessness.'",
        "'speaker_10': 'Many of these elders and disabled are often on fixed income, and this income may not be sufficient to sustain a quality living. Others are working locally and trying to provide for their family. Yet the abundance of low wage jobs requires a housing stock for this sector of our workforce.'",
        "'speaker_10': 'Improvements and community development is critical resources for healthy communities. This is a proactive approach in putting our citizens forward at the center for these developments, improving and preserving existing stocks of affordable housing support. Once again, campuses even more so families, veterans, children, disabled, frail, elderly and working citizens to be reduced at risk for poverty and homelessness.'",
        "'speaker_10': 'Today, we gather to help our leaders align with the intent on investing into our healthy communities. We have dialog with community members about affordable housing. Please prioritize to set aside 20% tax increment dollars into affordable housing just as other regions of California has.'",
        "'speaker_10': 'Oakland, San Jose, San Mateo, Santa Clara. And I have the list in terms of who has adopted this through. Through the community partnerships. We can realize this. Please take this conversation behind the rails tonight and behind and begin the movement toward protecting the boomerang funds tax increment dollars for affordable housing so we can lead improvements in housing'",
        "'speaker_10': 'that represents the needs of the whole community. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Hello. Good evening. My name is Jonathan Razer and I'm here with Housing Land, which is well and there were earlier there were nearly 100 folks sitting in there. Some had to leave. However, we wanted to let you know that community cares about language access and they also care about affordable housing and the poor fund.'",
        "'speaker_10': 'I'm a student at Castle Long Beach getting a master's in social work, and I'm also a resident of Long Beach at 94 Redondo Avenue, 90804. And I'm here today to urge you to discuss venture funding a lot. 20% of the Boomer Fund for the development of affordable housing.'",
        "'speaker_10': 'So after high school, I joined the military and there I learned about saving money and spending money. And, you know, I was able to buy my first car and I was I realized that the importance of spending money in a daily basis to make sure that my car was functioning, such as the tune up oil change or'",
        "'speaker_10': 'otherwise, you know, in order to avoid an engine breakdown later on in the future.'",
        "'speaker_9': 'Every year you're given the opportunity.'",
        "'speaker_10': 'To develop a budget, to spend money to avoid an engine breakdown. Today, many residents of Long Beach live in housing with infrastructure issues and affordable housing. Production needs are being ignored. If not taking care of this today, these issues will lead to public and health issues, as well as a significant reduction of quality of life for Long'",
        "'speaker_10': 'Beach residents. Within the past few years, the city of Long Beach has borne money from the redevelopment. 20% has been set aside. Today, the mayor is proposing to pay the money back, which we are really thankful for. However, we must acknowledge that this money was legally required to be paid back.'",
        "'speaker_10': 'Therefore, the city must continue to proactively find ways to permanently create a local source to invest in affordable housing. In California, there are cities like Mars Mansion, which are dedicating funds for affordable housing such as San Francisco, L.A. Tremens, San Jose and Oakland.'",
        "'speaker_10': 'San Jose has dedicated over 20 million over 20 million of them in funds to affordable housing. And Oakland has proposed has protected 25% of working women funds for affordable housing trust fund in addition to 10 million in one time dollars.'",
        "'speaker_10': 'San Jose in Oakland are cities which are about the same size, about the same size of Long Beach. So it is possible to make this happen here in Long Beach. You can see this. Well, Marcus, we're going to pass a sheet of paper where you can see these these numbers.'",
        "'speaker_10': 'One step to get there is by addressing the women fund as representatives of Long Beach. You move this because of a man fund. We understand that tonight police and fire budget are the focus. However, we urge you to discuss the women fund.'",
        "'speaker_10': 'There was a large supporters here present tonight waiting to hear from you.'",
        "'speaker_0': 'Thank you very much. Time's Aaron. Thank you for your service. Thank you. Next speaker, please.'",
        "'speaker_9': 'Hello. My name is Nicholas Commander from the second district. I'd like to speak to the issue of the $2.2 million request for discretionary overtime. By way of example, at 735 Gavin Avenue, recently, a well-known gang moved in and they were armed and adult in a variety of drugs, and there were at least two multiple shootings spread apart'",
        "'speaker_9': 'by approximately ten days. The PD stepped in with increased patrols, surveillance, multiple arrests, and they work with other city departments to eliminate the remaining gang members from this address. Another location nearby? I can't say the address because it's still under investigation.'",
        "'speaker_9': 'Dealt with methamphetamine and other drug dealing and had two marijuana grow operations and drug use, of course, and somebody was stabbed in the head there recently. PD responded with the same things increased surveillance patrols, arrests and working with code enforcement, nuisance abatement and the city attorney's office to address the problem at that address and in other address'",
        "'speaker_9': '. Hills With even higher levels of crimes that I can't mention the location of, it's under surveillance currently. So I would implore the City Council to grant this $2.2 million request so that they can continue to respond to urgent situations that arise.'",
        "'speaker_9': 'And since I have a few moments left, I'd like to thank Chief McDonald, Deputy Chief Luna, Sergeant, I'm sorry, Commander Rocky and Lieutenant Michael Pena for their caring, their work and their accessibility. Thank you.'",
        "'speaker_0': 'Q Sir, next speaker them. It's been Rockwell who's above after Mexico. And then if there's no other speakers, I'm closing the speakers list so the speaker list will be closed. Ms..'",
        "'speaker_2': 'Chico I'm her Linda. Chico My address is on file. Mayor and Honorable Council. I want to thank you for asking such thoughtful questions. They really did help the audience members to the residents here understand and break down the proposed changes and issues and opportunities that we have.'",
        "'speaker_2': 'I'll make this brief. I support both budget recommendations, but I really do want to put an emphasis on the increase in Prop H support, especially the $400,000 for Schroeder hall costs, because we've been waiting for that for a very long time and we want to get it right the first time.'",
        "'speaker_2': 'And then the the other thing is the technology and increasing the capabilities of the technology that we have. Mayor Garcia has been wonderful and been a champion of technology here in in the city. And I think that this these departments really do need attention when it comes to increasing the efficiency that we work.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_0': 'Thank you, Mr. Rockwell.'",
        "'speaker_9': 'Thank you, Mr. Mayor. Council. I want to say that and going about through the various cities and our state and other cities throughout our United States, I've yet to feel as comfortable and a downtown of any city in our whole state of California as what I feel right here in the city of Long Beach.'",
        "'speaker_9': 'We have police officers and firefighters, paramedics that have been here in this city for well over 20 years. These men and women are some of the best public service officers anywhere in our nation. They have been there when I've needed them.'",
        "'speaker_9': 'They're there when the rest of us need them. And they are there to help and make sure that our lives, our help and our homes are safe in the event of any emergency. And I want to say they all deserve a round of applause from all of us here in the auditorium.'",
        "'speaker_9': 'Thank you. Fire and police. Men and women.'",
        "'speaker_0': 'Thank you, Mr. Rockwell. Councilmember Richardson.'",
        "'speaker_7': 'Just quickly, I know that we talked about police and fire, but a couple of people talked about the the housing issue. And one person brought up something that stood out to me. I know that we're taking on department by department.'",
        "'speaker_7': 'Are we do we have a plan to hear from? So where would what apartment, what department? Would that be appropriate? Would that be? Development Services? What department is it? Oh, somebody's got it.'",
        "'speaker_0': 'Mr. West.'",
        "'speaker_9': 'Probably Development Services and Health and Human Services.'",
        "'speaker_7': 'So I know I know that health is next, right. Where they were going to be tonight. Would it be would it make sense to have that conversation at health when they come back at the next budget hearing?'",
        "'speaker_9': 'We can certainly have the health portion of it. And if we can squeeze in the development services, we will as well. But we'll work that out through the mayor's office in the next week.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'And obviously always, regardless of the topic, we can always any item on the budget can be discussed at any meeting. So ignore the comments and the public hearing is now. We're going to move. Can I get a motion to adjourn and postpone the next hearing then to the next meeting?'",
        "'speaker_0': 'Because the motion in a second to move the hearing forward to the next meeting, please cast your votes.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Okay. We have a we have a time certain item that we need to get to. I do have if we can do this real quickly for speakers on the speaker public speakers list, that was obviously going to be a long a while ago.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt resolution amending the Master Fee and Charges Schedule by updating Strong Motion Instrumentation and Seismic Hazard Mapping Fees.  (Citywide)": [
        "'speaker_1': 'Item to report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and adopt resolution amending the master fee and charge charges schedule by updating strong motion instrumentation and seismic hazard mapping fee citywide.'",
        "'speaker_3': 'So.'",
        "'speaker_0': 'Mr. West.'",
        "'speaker_2': 'Amy Vohra Mr. Mayor, I just want to add for this public hearing, this is a state mandated requirement. It went into effect July 1st. That's why we are asking you to amend the master fee schedule now as opposed to as part of your normal budgetary process.'",
        "'speaker_2': 'So we would request your approval of this.'",
        "'speaker_0': 'Thank you. There's a motion on the floor. Any public comment on the item? Seeing none. Please cast your votes.'",
        "'speaker_1': 'Councilman Richardson. Motion carries eight zero.'",
        "'speaker_0': 'Okay. Thank you. And now we're going on a consent calendar. Item ten from the consent calendar has been pulled. So if I can get a motion for all the other items. Okay. There's been a motion and a secondary public comment on the consent items saying non, please cast your votes.'"
    ],
    "Recommendation to authorize City Manager to accept a donation of $30,000 from the Friends of Bixby Park to be utilized for enhancements to Bixby Park; and increase appropriations in the Capital Projects Fund (CP) in the Department of Public Works (PW) by $30,000.  (District 2)": [
        "'speaker_1': 'Item ten Report from Parks, Recreation and Marine and Public Works. Recommendation to authorize City Manager to accept a donation of 30,000 from Friends of Bixby Park to be utilized for enhancements to Bixby Park and increase appropriations in the Capital Project Fund in the Department of Public Works by 30,000 District two.'",
        "'speaker_0': 'And I'm not sure this I'm going to turn this over to Vice Mayor Lowenthal.'",
        "'speaker_2': 'Thank you, Mr. Mayor. I want to thank you for allowing me to pull this item. Concerning Bixby Park, unfortunately, our friends of Bixby Park are gone. So I wanted to publicly thank them for all of their passion, dedication and advocacy on behalf of this park over the last several years.'",
        "'speaker_2': 'The Navy memorial grant being just one benefit they brought to the park that resulted in the installation of historic light fixtures that have made the park safer. And in addition, the Friends of Bixby Park has initiated a monthly park cleanup, a gardening club, events for children and adults such as First Saturdays, Music in the Park, and most'",
        "'speaker_2': 'recently worked with Parks and Rec and my office to host a Bixby Park improvement day on Saturday, September 6th. Their active engagement as a group of residents and business owners makes all of us in city government more effective and responsive, and they provide a tremendous partnership to us in the city in order to make Bixby Park much'",
        "'speaker_2': 'more user friendly, safe and inviting. So I'd like to thank them even though they're not here in the audience. Just let it be on the record that we recognize them. Thank you. And with that, I'd like to move the item here.'",
        "'speaker_0': 'There's been a motion in a second by Councilmember Austin. Any public comment on item ten? See? None. Please cast your votes.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Item 12.'"
    ],
    "Recommendation to adopt Plans and Specifications No. ITB DV-14-078 REBID for the improvement of 14 commercial storefronts on Long Beach Boulevard at Anaheim Street; award the contract to Corral Construction and Development, Inc., of Commerce, CA, in the amount of $394,400; authorize a 15 percent contingency in the amount of $59,160, for a total contract amount not to exceed $453,560; and authorize City Manager or designee to execute all documents necessary to enter into the contract, including any necessary amendments thereto.  (District 1)": [
        "'speaker_1': 'Item 12 Report from Development Services and Financial Management. Recommendation to Adopt Plans and Specifications for the implementation of 14 commercial storefront on Long Beach Boulevard at Anaheim Street. Award the contract to corral construction in the amount of 394,000 for account for a total contract amount not to exceed 453,000.'",
        "'speaker_0': 'District one Clean in motion.'",
        "'speaker_9': 'Come on.'",
        "'speaker_0': 'Councilmember Gonzalez.'",
        "'speaker_1': 'I just want to say thank you to development services because it's been a long time coming and it's it's going to be a great beautification project for the area. So thank.'",
        "'speaker_5': 'You.'",
        "'speaker_0': 'Thank you. Public comment on the item. See now and please cast your votes.'",
        "'speaker_1': 'Motion carries eight zero 13. Item 13 Report from Health, Human, Human Services and Development Services. Recommendation to authorize City Manager to execute all necessary agreements for the Fiscal Year 14. Emergency Solution Grant Program Allocation of 455,000 to fund for projects for the period of October one, 2014 through September three, 2015.'"
    ]
}