{
    "Recommendation to authorize City Manager to execute a Citywide Project Labor Agreement (PLA) between the City of Long Beach and the Los Angeles/Orange Counties Building and Construction Trades Council, and the signatory Craft Councils and Local Unions signing the Agreement, for all covered projects over $500,000, for a period of five years; and  Authorize City Manager, at his/her sole discretion, to execute any subsequent amendments to the PLA that are recommended by a majority vote of the Joint Administrative Committee, that do not change the $500,000 coverage threshold or the five-year term of the PLA.  (Citywide)": [
        "'speaker_0': 'Item 19 Report from City Manager, Financial Management and Human Resources Recommendation to execute a Citywide Project Labor Agreement with the Los Angeles Orange County's Building and Construction Trade Council and the Signal Signatory Craft Councils and local unions signing the agreement for all covered projects over 500,000 citywide.'",
        "'speaker_1': 'Thank you very much. We're going to turn this over to city staff for the staff report and then I'm going to open up the hearing. I'm going to ask first for a public comment, unless there's any objection that the council wants to go first and then the council would weigh in at that point.'",
        "'speaker_1': 'But let's turn this over to staff.'",
        "'speaker_10': 'Thank you, Mr. Mayor. Council Members. In November of 2014, the City Council gave direction to.'",
        "'speaker_9': 'The staff to work with the Trades.'",
        "'speaker_10': 'Councils and prepare a project labor agreement that would encompass basically all projects with a threshold over $500,000 and run for five years. So with that, we've been spending a lot of time over the past few months and we have what we think is satisfactory to the direction given by the Council.'",
        "'speaker_10': 'I'm going to turn this over to the folks who have been crafting this. Craig Beck has been leading the charge, a bureau manager in gas and oil, along with Nick Shultz, who's our bureau manager in charge of our Workforce Investment Bureau and also one of the deputy city attorneys, Linda Vu.'",
        "'speaker_10': 'So, Craig, if you could.'",
        "'speaker_11': 'Walk us through this.'",
        "'speaker_1': 'Thank you. Good evening, Mr. Mayor, and members of the city council. As the city manager indicated. We've been meeting with the L.A. and Orange County Building Trades Council to have a discussion about developing a citywide play for Long Beach.'",
        "'speaker_1': 'After the council took action on November 11th with the direction to finalize an agreement. We've had a number of meetings. We started off by looking at other plays that exist within the state of California and really looking at those provisions and trying to determine what best provisions we should pull out and include in our plea agreement.'",
        "'speaker_1': 'After a number of discussions and negotiations, the trades and your staff are here tonight to present to you what we believe is a play that council should consider and improve. I'm going to just go over the major recommendations that are included in the play agreement.'",
        "'speaker_1': 'Please, if there's anything specific that that I need to go into more detail, I'm happy to do that. But if you bear with me, I'll I'll touch on some of the finer points of.'",
        "'speaker_9': 'The.'",
        "'speaker_1': 'Proposed play. And so the major element is that this would include all public works construction activity outside of the public right away that are above $500,000. And that's a pretty extensive list. We believe that that is somewhere in the neighborhood of $28 million annually over the term of this agreement, which is right now five years.'",
        "'speaker_1': 'Other real important component of this play is to include a local hiring element, because what we're really trying to achieve here is putting Long Beach residents to work on Long Beach projects. And that hiring goal would be 40% local residents.'",
        "'speaker_1': 'In addition, we think it's important to reach out to those that are disadvantaged in our community and veterans. And specifically, there's an element where 10% of those individuals would be targeted for employment on the playing. We worked long and hard to think about how do you create access into construction jobs?'",
        "'speaker_1': 'And one of the key elements of creating access is providing a pre apprentice training program. There are a number of entities out there today that do provide that. But we really sought to create a partnership between Pacific Gateway and Long Beach City College, and the building trades themselves to develop a pre apprentice programs for residents to go'",
        "'speaker_1': 'through and really prep them for the apprentice trades and some of the testing.'",
        "'speaker_9': 'Criteria that an individual would go.'",
        "'speaker_1': 'To to get into an apprentice program. And we really believe that that's going to help create a lot of success, that partnership between City College and our Pacific Gateway and trades themselves. There was a lot of discussion before about tiers and how do you focus your hiring within the city?'",
        "'speaker_1': 'And we believe the best way to address that is to include tiers that focus entirely in Long Beach. So our Tier one hiring program would include all of the zip codes within the city of Long Beach.'",
        "'speaker_9': 'And really put preference here locally. There are a number.'",
        "'speaker_1': 'Of elements relative to how do you do reach out and how do we ensure that we're having the best success from a play? So we've included a role of what we're calling a play administrator and that individual or entity.'",
        "'speaker_1': 'This will likely be contracted out to a firm that would would do a lot of the coordination work, making sure that people seeking employment are connected with employment opportunities, making sure that contractors know how to work with the trades if they don't already, and really making those connections and priming the pump, so to speak, to ensure that'",
        "'speaker_1': 'we have a lot of local residents ready for those employment opportunities on our projects. There is a no strike provision which can be very important, especially on large multi trade projects. Think of a large park project or even the new civic center that's currently under discussion.'",
        "'speaker_1': 'How a play can benefit getting that those type of projects completed on time. And then lastly, for large projects, we wanted to ensure that there was extra help relative to outreach. And so there was a coordinator role that that was added.'",
        "'speaker_1': 'The coordinator would really be somebody hired by that contractor for large projects, over $10 million to ensure that those outreach efforts are doubled. On large projects, you can you can understand that a larger project has a larger a longer construction timeline and therefore more opportunities for making those employment connections.'",
        "'speaker_1': 'And we wanted to ensure that the outreach was sufficient for those opportunities. I believe that covers the main tenants of the agreement. Before you this evening, I stand ready to answer any specific questions.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you. And we do have a motion and a second. So I think we're going to the motions will be made and then we will hopefully move on to public comment and then come back for a, I'm sure, a robust discussion.'",
        "'speaker_1': 'Councilwoman Gonzalez.'",
        "'speaker_6': 'Yes. Craig, thank you for the staff report. I wanted to ask a few questions of both you and Nick. I know you both have been working very diligently on this play, both from the logistics side and then also the local hire side.'",
        "'speaker_6': 'But I know there's also been a lot of concern stemming from the community, and I want to get those out in the air.'",
        "'speaker_4': 'Before we before we move forward.'",
        "'speaker_6': 'So you describe the play administrative role. Would you say at this point that's the only cost that we can specifically identify from the play? Is that.'",
        "'speaker_4': 'Correct?'",
        "'speaker_1': 'Yes. Thank you for prompting me on that. I think one of the directions that came out of the council action in November had to do with the fiscal impact of a place. Staff did a significant amount of analysis.'",
        "'speaker_9': 'Looking at where would cost likely be incurred. We were not able to find anything definitive that would show.'",
        "'speaker_1': 'That our construction costs would increase, and that's primarily due to the fact that we have to pay prevailing wage on all of our city projects and prevailing wage tracks very closely to.'",
        "'speaker_9': 'Union wages.'",
        "'speaker_1': 'So what is in the staff report that you're alluding to is there would be a cost for hiring.'",
        "'speaker_9': 'A play administrator.'",
        "'speaker_1': 'We've set that.'",
        "'speaker_9': 'Cost right now at.'",
        "'speaker_1': 'Roughly 1% of the construction budget. So on a $28 million annual expenditure, that's roughly $280,000 in cost. We don't know exactly what that will be because we haven't bid that yet.'",
        "'speaker_9': 'But that's what we've indicated as our best estimate of the play administration element.'",
        "'speaker_6': 'Great. Thank you. I know a couple of my colleagues had concerns with that last time, so I just wanted to make sure that we had that clear and then the job. I see. Let me back back up. The Jack, the Joint Administrative Committee seems to me to be a really good committee that would possibly be able to'",
        "'speaker_6': 'review things as we go along. And the job coordinator was one of those things that said at $10 million. And I understand, you know, that's what we're at now, but it's possible that it could review it for maybe lowering it.'",
        "'speaker_4': 'In a future at a future time. Is that possible?'",
        "'speaker_9': 'Yeah. I think the.'",
        "'speaker_1': 'Goal here is to have success and ultimately to achieve a 40% local hiring goal. And to achieve that success, we want to create some flexibility within the document. So if there's areas that we're falling short in and we need to strengthen, say, an outreach effort as an example, that we would use the Joint Advisory Committee and that'",
        "'speaker_1': 'committee consist of representatives from both the building trades and city to talk about areas of inefficiency and how we can make improvements. And so in your example, yes, that the Joint Advisory Committee could make a recommendation to lower the project threshold to for the coordinator role to ensure that there's more outreach done on larger projects.'",
        "'speaker_6': 'Great. Because I know you've talked about this as kind of a living document. It's going to evolve and this Jack will be really instrumental in that process. Next question is regarding best efforts versus requirement. I know we've gone through this quite a bit.'",
        "'speaker_6': 'You've met with numerous community members on this specific item in reference to local hiring. So how will we see the different points of accountability? I know from Jack Pacific Gateway. Can you run through that a little bit and how we will understand how many of our local folks will actually get jobs on site?'",
        "'speaker_1': 'Yeah, I think first and foremost, there is a craft referral form that's alluded to in the document where this is a specific form that would go to the various trades. And I think we all need to understand that we have a number of different disciplines or building trades that will be involved in this play.'",
        "'speaker_1': 'It's not just.'",
        "'speaker_9': 'One group or one.'",
        "'speaker_1': 'Union, it's individual trades. It will be dispatching representatives to the needs and the jobs that come up. Electricians may have a slightly different dispatching mechanism than, say, the plumbers. And so what we wanted to ensure is that we use a craft referral form.'",
        "'speaker_1': 'So all of those dispatching entities are following the same process. And those forms would actually be filled out for everybody that's referred and then collected by the play administrator, which truly allows us to track how are we having our level of success.'",
        "'speaker_1': 'So you mentioned the Joint Advisory Committee that's certainly in place to address areas of deficiency, as we mentioned earlier. And then the play administrator themselves, working with all of our partners, the trades Lummi City College Pacific Gateway, to bring all of those elements together to inform the council about.'",
        "'speaker_9': 'The progress moving forward.'",
        "'speaker_6': 'And that will be on an annual basis.'",
        "'speaker_4': 'Is that what we've proposed so far.'",
        "'speaker_6': 'For the Council to.'",
        "'speaker_4': 'Correct.'",
        "'speaker_9': 'And following Council's direction, we would come back annually and provide a report.'",
        "'speaker_1': 'Both on the local hire element and any costs that we see associated with the play.'",
        "'speaker_6': 'Great. Thank you. And then I have a couple of questions for Nick. I know that there has been some confusion on the disadvantaged workers. So can you describe that on your end and what that is?'",
        "'speaker_12': 'Exactly sure. What we propose for disadvantage worker was an income based definition and what we looked at was the 70% lower lower standard of living definition commonly used in federal federal programs for eligibility. It's dependent upon actual income, the poverty established poverty level of 70% of that and it factors in your family size as well.'",
        "'speaker_12': 'Our thought in that was if somebody is unemployed or underemployed, that's all we need to know in. Terms of having to connect them to to a better opportunity. So if they can come in, they can disclose and demonstrate that all the other barriers are associated, disabilities are really fall off to the side.'",
        "'speaker_12': 'We just know that they need a job or they need a better job and we can help to get them connected.'",
        "'speaker_6': 'Great. And I know we're going to have a Long Beach City College pipeline. So can you discuss that and your work with them closely as well as with the community members and how that's going to flush out as we as we roll this out?'",
        "'speaker_12': 'Sure. And getting a partner in the community that the the trades could could recognize and support was very important to us in this process. Pacific Gateway sees ourselves as the neck of the funnel. So we need all the community based organization and support to refer folks who are in need of employment or better employment.'",
        "'speaker_12': 'There has to be some assessment process and ultimately some referral to an organization that provides a qualified curriculum that's going to allow them to test and actually gain access into into the internship program or into, excuse me, apprenticeship programs.'",
        "'speaker_12': 'The the City College, we feel, is the best lever to support people in those transitions and through that process, simply because our federal funds can be leveraged with opportunities to access power, the ability to benefit under Powell, especially when construction is a recognized pathway type of a program.'",
        "'speaker_12': 'So we wanted to make all that available and leverage both on behalf of the residents. The other piece of this is we're uniquely qualified at Pacific Gateway from a tracking aspect of things. All of our participants are connected back to the federal base wage record.'",
        "'speaker_12': 'So we can tell you, we can tell you when they attained, how long they've retained, and how many wages they've earned in quarters since they've actually gained employment. And we think that will help with the local hire provision strictly because if somebody who's qualified for an apprenticeship been in an apprenticeship but isn't working hours is out there'",
        "'speaker_12': 'or on the bench, as they say, our system's going to pick that up. And when a craft request form comes in, we're going to be able to refer that person now as living in Long Beach, following within those first tier zip codes and ensuring they move to the top of the list and get that employment opportunity.'",
        "'speaker_6': 'Great. Thank you. And then the last question, I know it's been brought up a concern of the minimum, the five year agreement, basically, and how I know a lot of communities have been concerned because it doesn't if we had anything lower, it may not open the opportunity for various other trades.'",
        "'speaker_6': 'And so and also as as.'",
        "'speaker_4': 'As well as.'",
        "'speaker_6': 'Increasing wages. I know that was something we discussed. Can you go into detail about how important the five year agreement is to keep.'",
        "'speaker_4': 'Keep it locked?'",
        "'speaker_12': 'Certainly, I think and again, as you alluded to, we thought five years was appropriate because it's the appropriate amount of time in some of the trades that will be covered in the agreement where somebody actually moves from apprentice to journeyman.'",
        "'speaker_12': 'So if you want solid and consistent data about wage and impact on wage for local residents, you're going to need for them to make that transition from apprentice to journeyman to actually judge the success of the program in the pilot.'",
        "'speaker_6': 'Great. Thank you. I will just say that, you know, a tremendous amount of support in the last eight months that I've been working on this. I mean, it's been I think for some people, it's they've they've said it's been almost 13 years, I hear, in the making.'",
        "'speaker_6': 'But this is certainly an incredible effort in the parts of the city as well as the trades and making this come to a really well-balanced play that will strive to get folks back to work. It's really been a privilege to help lead this and help support this.'",
        "'speaker_6': 'That's why I'm making the motion tonight to move forward with this. And I'm especially grateful for a few folks. There's Assemblymember Patrick O'Donnell who kind of led this effort before he left the council. My colleagues that were, you know, here from the beginning, Austin Richardson Turanga, as well as our city management and city staff, Linda Vu, Nick'",
        "'speaker_6': 'Shultz and Craig Beck. I have to say that they have been so amenable to creating good solutions for us and looking at alternatives. When the community came forward, we were able to provide answers and provide solutions and alternatives.'",
        "'speaker_6': 'And that's the wonderful thing. Also to Ron Miller. I know he's been working really hard at negotiating, but it's also been something that he understands, needs to be amenable to the community and not just any community, not Los Angeles, but the Long Beach community.'",
        "'speaker_6': 'It's really important. So with that, you know, we were able to come up with a few different successes. I think we came up with a plan that was customized to Long Beach, but it was, you know, 40%, which I think is robust in local hiring, where most cities have 30%.'",
        "'speaker_6': 'So we're about 10% higher than most cities. The first tier is Long Beach, which is very important to us here. When the community asked for disadvantaged workers, we provided that 10%. As Nick had mentioned, that's based on extremely low incomes.'",
        "'speaker_6': 'And unfortunately, we have those incomes we have those zip codes in our city. When the community also asked for a community coordinator. You know, we heard loud and clear. And so that was included at the $10 million threshold.'",
        "'speaker_6': 'And I think, you know, all of this together has really, like I said, made a customized play for all of us. And I think in addition to that, working with our Long Beach City College to create that pipeline, making sure that Pacific Gateway, as they've so promised, and I know that they will work very hard at creating'",
        "'speaker_6': 'that connection with our community to ensure that folks are actually getting to work in Long Beach is very important. So the local community benefits associated with the sound development, you know, this is going to be on budget, it's going to be on time.'",
        "'speaker_6': 'We'll create opportunities for our residents as mentioned, and make them make sure that they get back to work and offer new opportunities as well. And so I'm asking for support and any suggestions that can be provided to the council tonight.'",
        "'speaker_6': 'But my motion is to move to approve.'",
        "'speaker_1': 'Okay. And there's a second with Councilmember Richardson. I'm concerned Richardson going to make a few comments that they're going to go to public comment.'",
        "'speaker_7': 'As a matter of fact, I'm going to. Yeah, I'm going to oblige you. Let's hear from the public, and then I want to give my comment.'",
        "'speaker_1': 'Thank you. Great. Thank you. So we're going to turn this over to the public. To start off, I want to invite up to the public first Congressman Alan Lowenthal, who's here to have two members of Congress that are here today.'",
        "'speaker_1': 'So I want to please both give them the courtesy to do public comment first. And so, Congressman Lowenthal, please.'",
        "'speaker_11': 'Thank you. Thank you. Mayor Garcia and city council members. I look around at. It seems like yesterday that I was sitting right over there when I first started. That's what makes this such a I'm here first to show support and approval of the the recommendation of city staff to create a citywide play.'",
        "'speaker_11': 'Even before I was on the city council and in the early 1990, too, Long Beach had a I was a faculty member at Cal State, Long Beach. And I was asked by the city to work with the city to coordinate between the University City College to help all the displaced workers.'",
        "'speaker_11': 'We were losing lots of workers at that time. And how Long Beach was going to create partnerships to make sure that we would find jobs for our workers. I first started with the Starkist tuna, the closing of the plant down in the port where we lost hundreds and hundreds of workers.'",
        "'speaker_11': 'And then I work with at that time, before it was Boeing and when it was the end of the McDonnell Douglas era. I just have to say that this city really does work well with with creating those kinds of partnerships.'",
        "'speaker_11': 'And now it's time to take it to the next level and to create the citywide play. I just want to say just a few words that that just really indicates just how how good this a project like this will be for our city, because this is really about making sure that Long Beach.'",
        "'speaker_9': 'Workers are prepared for work and will get work.'",
        "'speaker_11': 'In this city on the construction projects. And I think that's just exactly what a city should be doing. In fact, as pointed out, 40% will be targeted to be Long Beach workers on all these projects. We've never had numbers that high.'",
        "'speaker_11': 'I think that's wonderful. I think the fact of having disadvantaged workers, not only those that are low income, but somebody, a group that I'm most concerned about that's returning veterans. Also, our nation needs to make sure there are projects like plays in cities so that those veterans that are coming back have a place to get into to'",
        "'speaker_11': 'make sure that they're rewarded by their communities. The fact that, as I pointed out over 20 years ago, we were creating partnerships now to bring Long Beach City College in, to really provide the pre apprentice training. And the support really makes what Long Beach does best a seamless system.'",
        "'speaker_11': 'It's not just doing the play that you're doing. You're putting in place a system that will work. That's really what's so important. And and the fact that you have oversight and the fact that you're giving it a time period to come back, all of those things are just great.'",
        "'speaker_11': 'And so I'm just really here to say that I support the play. Long Beach is doing it in the right way and making sure that its residents will benefit from this. And I'm just really pleased to be here and thank you for having me.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_1': 'Thank you, Congressman. Congresswoman now, Congresswoman Janice Hahn.'",
        "'speaker_4': 'Thank you. Good evening. Mayor Garcia, members of the city council. I'm pleased to be here tonight. And I, too, am coming in support of this project labor agreement. And while it is a pleasure, let me add again to represent Long Beach in the United States House of Representatives with my good colleague and good friend, Alan Lowenthal, who'",
        "'speaker_4': 'really represents most of Long Beach. I am fortunate to represent a very important part of Long Beach, North Long Beach. The two council districts served by Albertson and Rex Richardson. But my support here tonight and even listening to the staff report made me realize that, as Mr. Gonzalez said, you're putting together a project labor agreement that fits'",
        "'speaker_4': 'Long Beach, and I think that's what's important. I know you don't like me to mention Los Angeles too much, but if you'll indulge me, I will tell you that my support for project labor agreements is based on my experience that I had when I was on the City Council for ten years in Los Angeles, and we entered'",
        "'speaker_4': 'in to many project labor agreements. They're beneficial because they give the taxpayer a better project at the end of the day. Why? Because these projects are built by good union workmen. These projects are done on time and on budget, and these projects are built with local hires, as you've heard tonight.'",
        "'speaker_4': 'And these are folks who really care about their communities. They're invested in their communities. And I think plays really mean that your taxpayers get their money's worth from these publicly funded projects. Since 2001, in the small city of Los Angeles close to you, we negotiated nine project labor agreements, and some of those were our police headquarters in'",
        "'speaker_4': 'downtown Los Angeles. Our harbor area police station and jail facility was a project labor agreement. Our fire station 64 was a project labor agreement. Our automated traffic surveillance and control was a project labor agreements.'",
        "'speaker_5': 'I don't blame.'",
        "'speaker_4': 'The unions if you get stuck in traffic in Los Angeles. And one of the projects that I worked on specifically was with the Port of Los Angeles, and we signed a five year, $1.5 billion project labor agreement at the port.'",
        "'speaker_4': 'And this project labor agreement alone is supposed to create almost 20,000 jobs. So, you know, all of us in public service.'",
        "'speaker_9': 'What do we.'",
        "'speaker_4': 'Want? We want to create jobs. And with this vote tonight, you're going to create good paying jobs. And the building trades through a project labor agreement are able to offer opportunities to so many residents of Long Beach to give them good skills, good careers skills to pay their bills.'",
        "'speaker_4': 'And that's what we all want to do. So I encourage you to support this tonight. Thank you for letting me come tonight to Long Beach.'",
        "'speaker_1': 'Thank you, Congresswoman. Now I have. We're going to set the timer. And now I have representatives of our state Senator Isidor Hull, State Senator Ricardo Lara, and a swimmer, Patrick O'Donnell. And then we're going to start lining up for the rest of public comment if those three can come forward.'",
        "'speaker_1': 'And give their comments. Madam Clerk, make sure you start the timer and just please everyone. Just make sure you give your name for the record. Okay. My name is Nick Giles.'",
        "'speaker_11': 'I'm the district director for State Senator Ricardo Lawrence.'",
        "'speaker_10': 'So, Mayor Garcia and distinguished members of the Council.'",
        "'speaker_8': 'I'll be brief, but I'd like to thank each of you for your dedication to the city of Long Beach and its continued prosperity. I'll be sharing some remarks on behalf.'",
        "'speaker_10': 'Of the center who could not attend.'",
        "'speaker_1': 'As our state.'",
        "'speaker_8': 'Economy continues to rebound. I'm proud to say that the largest city within my district is not only recovering, but thriving by leveraging investment in public infrastructure and embarking on historic undertakings such as the new civic center. Long Beach is leading the way in demonstrating responsible growth that benefits residents and businesses alike.'",
        "'speaker_8': 'The proposed policy on your agenda tonight is about more than simple job creation. It's about investing in.'",
        "'speaker_11': 'And uplifting the working families that drive Long.'",
        "'speaker_8': 'Beach. I respectfully request your support for the project labor agreement. And thank you for your time.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mayor Garcia. Council members and wonderful residents of Long Beach. My name is Heather Hutt. I'm district director for Senator Isidora. Senator Hall couldn't be.'",
        "'speaker_0': 'Here tonight because.'",
        "'speaker_4': 'He's in session at the state capitol. But he's excited to hear that you're considering a project labor agreement tonight. Project labor agreements are sound policies that will bring many benefits to residents of this great city. The nuts and bolts of play are clear.'",
        "'speaker_4': 'Local hire the access to apprenticeship programs and investment into a local economy. The Senator is most excited to grow our economy and create jobs for our community. Opportunity is difficult to quantify. You can't see it, touch it, and it isn't easy to come by.'",
        "'speaker_4': 'But if you're fortunate, you know when it's there and you grab it and take advantage of it. Senator Hall believes that by targeting local residents, disadvantaged workers and U.S. veterans, the play will make opportunity real for Long Beach residents.'",
        "'speaker_4': 'Thank you for your time and we hope to have your support on this important policy.'",
        "'speaker_1': 'Thank you so much. Next speaker.'",
        "'speaker_6': 'Good evening, Mayor, and members of the City Council. My name is Allison Gallagher. I'm here today on behalf of Assembly Member Patrick O'Donnell. Jerry Garcia. I regret that legislative business in Sacramento prevents me from being here tonight to speak in support of Item 19.'",
        "'speaker_6': 'Ever since being elected to public office, I have been a champion of project labor agreements and was proud to have agendas. The one before you this evening. Tonight is the culmination of years of conversations, collaboration and determination. I would like to congratulate and thank city staff for working with the Los Angeles Orange County Building Trades Council.'",
        "'speaker_6': 'Long Beach is going to be better off because of the agreement reached. The item agreement before you is actually simple and benefits the city in two simple and two basic ways. It guarantees that major municipal projects are built by contractors who agree to train workers through apprenticeship programs, and it ensures Long Beach residents have the advantage in'",
        "'speaker_6': 'securing jobs on one of these major construction projects. This policy will help bridge the training and employment gap to further ensure all of our city have the opportunity and access to training that ensures a decent wage. This is good for Long Beach and good for the region in the strongest possible terms.'",
        "'speaker_6': 'I urge you to adopt the project labor agreement. Thank you. Advanced for your support. Patrick O'Donnell.'",
        "'speaker_1': 'Thank you. Is this any more of a delegation representative?'",
        "'speaker_11': 'The Legislative Office? I'm not sure. Public comment.'",
        "'speaker_1': 'Okay. Public comment is now open, so make sure everyone, as we get for public comment, please say your name. And for the record, I will begin 3 minutes. Appreciate it.'",
        "'speaker_11': 'My name is Dave Everett. I'm here with the Associated Builders and Contractors of Southern California. And I'm kind of surprised that this council continues to support this special interest deal as well. When you look at this council and you see everything that can be built in this city.'",
        "'speaker_1': 'Guys, hold on 1/2. So I want to make sure that we we're going to have a very respectful hearing. And so everyone gets a chance to give their 3 minutes completely. So please continue.'",
        "'speaker_11': 'All right. I was trying to point out that by signing this agreement, you're discriminating against eight out of ten construction workers. Eight out of ten construction workers are nonunion. That means nationally and in California, those statistics still hold true.'",
        "'speaker_11': 'So if you want local hire, you're discriminating against eight out of ten construction workers here. It wouldn't discriminate against those eight out of ten construction workers. You're also assuring that Long Beach can only build four buildings for the price of five.'",
        "'speaker_11': 'I know you're all very involved with local governments and some of you even represent certain workers and county workers. So it would be surprising to see that you want those folks to end up with four new facilities instead of five new facilities.'",
        "'speaker_11': 'In addition, a November 2013 Forbes magazine article highlighted that play agreements perpetuate the discrimination that has long pervaded construction unions. In an affidavit submitted to the court, Harry C Alford, president of the National Black Chamber of Commerce, said that about 98% of black and Latino owned construction companies are nonunion and please restrict the use of minority contractors'",
        "'speaker_11': 'on public projects. I urge you today to vote against discriminating against eight out of ten blue collar construction workers and the working class families that depend on them. I urge you to vote against a forced union deal that restricts the use of minority contractors on public projects.'",
        "'speaker_11': 'I urge you to vote against the forced union deal that will assure Long Beach public servants will only get for new buildings for the price of five. I urge this Council to vote no on the special interests deal.'",
        "'speaker_11': 'It only favors campaign contributors and the politically powerful over the average Long Beach citizen. Lastly, I'd like to point out that the play itself has been hidden from the public. It's not posted on the website. It's nowhere to be seen.'",
        "'speaker_11': 'So when the final play is actually available for the public to review, I encourage you to take out the campaign material from the agenda attachments. There is an attachment there that has a building trades newspaper along with the newspapers, basically all the building trades endorsements.'",
        "'speaker_11': 'It seems very odd that a play agreement that would be voted on would have a newspaper full of endorsements on it. Also, when you guys come back and do the final agreement, you know, we will have a lot more criticisms of the play, but we haven't actually had a chance to see it yet.'",
        "'speaker_11': 'So thanks for your time. And this must be a really good agreement if if you can't even let the public see it. So thanks so much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good evening, councilmembers. My name's Eric Christian. I'm the executive director of the Coalition for Fair Employment in Construction. And I guess I'm vexed tonight because I'm wondering where the project labor agreement is. What is it you're voting on?'",
        "'speaker_8': 'Staff is giving you at best an unserious explanation as to what this would cost. And apparently you have an extra $280,000 laying around annually that you can spend on something that's unnecessary. But I'm just wondering where the project labor agreement is that has been negotiated behind closed doors between a big Labor special interest group and yourselves.'",
        "'speaker_8': 'Nobody else was allowed in, not the Associated General Contractors, not the Associated Builders contractors, not women construction owners and executives. Nobody but a special interest group and your city staff. Yet what are you voting on tonight? It vexes me greatly and it's confusing because I'm not sure what this agenda item is.'",
        "'speaker_8': 'I understand the desire not to have something that's quite as implicitly and explicitly discriminatory as a project labor agreement brought out into the public, into the light of day for all to see, because it is something that has provisions within it that are implicitly and explicitly discriminatory that will increase your costs more than $280,000 a year.'",
        "'speaker_8': 'And if it is in fact a citywide project labor agreement, you are in direct violation of the Boston Harbor decision which explicitly stated that a project labor agreement is to be negotiated on a project by project basis. My board has authorized that.'",
        "'speaker_8': 'Should you in fact engage in a project labor agreement that citywide, many of whom have spoken before you some of the largest construction companies in the country, who love to work for you, who do work for you, who will not work under a project labor agreement because of the four provisions that they're all about.'",
        "'speaker_8': 'Everything else aside, local hire, there's nothing that's mandated and local hire you can't legally mandate local hire there goals that's all you see. And project labor agreements are goals. So for a goal of 40%, which I would simply beg to ask what is your current local hire that's never been presented as a solution in search of a'",
        "'speaker_8': 'problem? Instead, what plays are all about or far for specific provisions? And it's why my members will not bid your work, which will increase your costs. All workers have to be hired through a union hiring hall. Contractors are relegated to six core employees.'",
        "'speaker_8': 'Beyond that, all their workers have to be union. All their workers have to pay into a union health, welfare and pension plan that they will never benefit from because they won't be working long hours on the project to be vested.'",
        "'speaker_8': 'That's money that is lost to them. It is stolen to them. And that's why you don't want to have a project labor agreement and actually vote on it because you have to actually defend that provision. Instead, you're hiding behind an agenda item that is frankly, it's inane.'",
        "'speaker_8': 'It doesn't mean anything. Whereas the project labor agreement and finally you discriminate explicitly against nonunion apprentices. So Miss Horne was actually honest and she admitted this is about employing union workers. She mentioned the military. And if my wife, who's lieutenant colonel, went to work in a nonunion apprenticeship program, she couldn't work on your projects.'",
        "'speaker_8': 'Thank you. This item. Thank you.'",
        "'speaker_1': 'Thank you, sir. Okay, next speaker, please.'",
        "'speaker_8': 'Bishop Todd Irvin Church one off Long Beach, California. And again, I stand before you several weeks. We came to this meeting and asked that you would consider the ministers and clergy at the table to help put together this play.'",
        "'speaker_8': 'I want to say thank you to Mr. West and the others who afforded us that opportunity. And again, the goal of 40% local, higher and 10% disadvantage, we believe, is a very positive step for the city of Long Beach.'",
        "'speaker_8': 'Thank you so much. Thank you for your time. Thank you for your efforts.'",
        "'speaker_1': 'Thank you, sir. Next speaker, please.'",
        "'speaker_11': 'Mayor. City Council members were named Piedmont Brown and live at 1891. Briton Drive Long Beach, California 90815. I've been in construction almost 40 years. I worked at a Wells Fargo Bank, the Long Beach Convention Center. I'm excited about this play to support it for our citizens and young men and women in their city for a not.'",
        "'speaker_9': 'Just a.'",
        "'speaker_11': 'Job, but a career for the rest of their life. I hope you support this. And thank you very much.'",
        "'speaker_1': 'Thank you, sir. Next speaker, please.'",
        "'speaker_8': 'Good evening, Mayor Council and staff. I'm Ron Miller, executive secretary of the L.A. Orange County Building Trades. We represent 140,000 hardworking men and women in L.A. and Orange County. Affiliated with 48 locals across 14 different trades. Thousands of our members live in Long Beach.'",
        "'speaker_8': 'They're homeowners community members. They're your neighbors. They coach soccer. They coach Little League there. Their kids attend Long Beach schools. Building trades members here in Long Beach tonight. Could you please stand up? We're here tonight to support a project labor agreement that will lift all boats in Long Beach.'",
        "'speaker_8': 'It will create a large number of jobs for the Long Beach residents. Through our building trades apprenticeships. It will bring in newcomers from your high schools and colleges, from the military and all the diverse backgrounds in the city of Long Beach.'",
        "'speaker_8': 'Through pre apprenticeship programs that we're going to set up with the city of Long Beach, with our building trades M.S. three curriculum. Starting this summer, we're going to create a strong pipeline for our new members to succeed in their building trades careers.'",
        "'speaker_8': 'The Long Beach economy is in the middle of a huge transition. You know, I was born just a couple of blocks from here many years ago. And it was a Navy town. Then it went through the aerospace, the aviation.'",
        "'speaker_8': 'And now it's having to reinvent itself. Long Beach is survived the departure of all those industries. And we've been there for over 100 years, right along with you surviving the labor force. We have a lot to offer the city.'",
        "'speaker_8': 'We want to work with your businesses and your community to make Long Beach a better place. This agreement works just as well for. Labor as it does for business. Business friendly is not a slogan for us. It's something we take seriously.'",
        "'speaker_8': 'We are private sector unions working for private sector companies. And if we don't make those contractors competitive, they don't stay in business and we don't have a place to work. The play is open to all contractors. In fact, prove that it's equal opportunity at the LAUSD project labor agreement.'",
        "'speaker_8': 'Half the company's winning bids are nonunion. These plays make economic sense. Look at the courthouse. Look at the Long Beach, Middle Harbor. Look at the Gerald Desmond Bridge. These these projects will all succeed with place. But don't take it from me.'",
        "'speaker_8': 'Take it from a business expert who just said the building trades people provide a lifelong trade. They take someone who might not be going to college, give them a skill set that is vital to the California economy. That comes from Rob Lapsley, president of the California Business Roundtable.'",
        "'speaker_8': 'Let's get this thing going and put some people from Long Beach to work.'",
        "'speaker_1': 'Thank you, Mr. Miller. Next speaker. My name is Gary Cook. I'm the business manager of Plumbers Local 78.'",
        "'speaker_9': 'I represent.'",
        "'speaker_1': 'To roughly.'",
        "'speaker_9': '2000 members who are dying to go to work here.'",
        "'speaker_8': 'A lot of them are members.'",
        "'speaker_1': 'I stand in support of this and I urge your support.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_9': 'Very good. You, Clarke, as we address a number of items for both sides. Obviously local hires make sense, period. Whether it be the hiring or the actual worker or the contractor. And I think the classic example of the buffoonery we have with the Long Beach Marina, hiring a company up in Seattle to do the work and oversee'",
        "'speaker_9': 'it and have to fly them down or pay for their mileage down to oversee it is absurd on its face. That's why the thing is languishing. Is it is. I would suggest that. Have we had it? A local hires local companies.'",
        "'speaker_9': 'This thing would have been long completed. Period. The third or fourth speaker raised some very valid questions. And quite frankly, I haven't seen the agreement. I don't know if anybody has seen it. But we should issue no contract to any entity that discriminates against anybody.'",
        "'speaker_9': 'Whatever the process, period. That sucks. To the people that are engaged in the negotiations, I would strongly suggest. You sharpen your number two pencils. Because. Even starting in September. And October is probably September, October, when we have a new city manager, a new mayor.'",
        "'speaker_9': 'It is going to be a rough almost three years before our economy in this state, in this city and indeed in the country gets back on a growth pattern period. So I think you've got to come to realities which this council often doesn't do.'",
        "'speaker_9': 'As evidenced by the wallet report that ranks us as the second worst managed city in the country. Buried. Indeed. Jerry Brown, our former befuddled pothead on 60 Minutes. Opined that state of California is at or near the bottom of the barrel at every single paradigm.'",
        "'speaker_9': 'So we've got to do something that the city and the state, but particularly the city, since that's your responsibility, has to do some serious rethinking. And I would suggest you put this issue out on a ballot measure to the people of the city of Long Beach and print it out from A to Z.'",
        "'speaker_9': 'Nail it to the wall like Martin Luther. Don't try to hide behind it. If there's something bad in there, flush it out. Fix it. Thank you.'",
        "'speaker_1': 'Next. Next speaker, please.'",
        "'speaker_8': 'Hi, I'm Gregory Sanders, pastor of the Rock Christian Fellowship here in Long Beach and also president of the Long Beach Ministers Alliance. And I just want to take a second and ask the pastors if they would stand and acknowledge them for coming out and being committed to this process.'",
        "'speaker_8': 'And a week ago I was here and I said, no one called us. But since then, after hearing our heart, our phone has not stopped ringing. And I appreciate that. I want to thank Pat West. I want to thank Nick.'",
        "'speaker_8': 'I want to thank Craig. I want to thank Rex. I want to thank Lina, who really opened up this opportunity to increase this dialog and come to a meaningful play. I want to say to the guys who said they haven't seen it, maybe they haven't seen it because they didn't ask.'",
        "'speaker_8': 'Because when we ask you share, you opened your heart. You were able to ensure that we created a document that would work for our city. As pastors, we do two things. We marry people and we bury people. But in between that time, we need them economically stabilized and we believe that this is a great opportunity.'",
        "'speaker_8': 'And I'm always reminded of breakfast and they say at breakfast, either you're the chicken or you're the pig, the pork. A chicken lays his eggs and keeps moving, but that bacon has to give its life. And I'm happy to say that most of our pastors here, we give our life for the city.'",
        "'speaker_8': 'We're committed to the economic stabilization of the city. We're not just egg layers. Who can who come in, do what we do and we go. We live here. We serve here. Our kids go to school here, our families are here.'",
        "'speaker_8': 'So we are excited about the beginning stages of the play, knowing that as we move forward, we can tweak it, we can refine it, we can make it work better. And so I'm really optimistic. I encourage us to move forward with it without any hesitation.'",
        "'speaker_8': 'Any hesitation. And let's get our city employed. Thank you guys so much. And chickens are not allowed.'",
        "'speaker_1': 'I was waiting for the amen at the end, but. All right.'",
        "'speaker_13': 'Next speaker Hi, I'm Joe Sullivan. I represent the National Electrical Contractors Association of Los Angeles, which is comprised of about 800 electrical contractors of all different sizes. Many of them are from this area of the county. We're very eager to see this project labor agreement happen.'",
        "'speaker_13': 'The project labor agreement will create a more competitive environment. More of our members will compete for these contracts. The reason being is they're more transparent, there's more compliance. We know that prevailing wages are being paid so that increase it creates a sense of competition and we're glad to support that.'",
        "'speaker_13': 'We're also glad to support local hire. We're doing that with the Los Angeles Unified School District and exceeding all the local higher targets we support. We're glad to support the veterans and disadvantaged workers as well. Moreover, we're proud of our apprenticeship program and we're glad to contribute to the ongoing education of future electricians.'",
        "'speaker_13': 'The apprenticeship program is a five year apprenticeship program. It costs about $35,000. It's nearly entirely privately funded. And many most of our members were former electricians. So they come from the trade to be becoming electricians. And by creating local jobs, that's how you create local small businesses.'",
        "'speaker_13': 'That's what they grow into. And we do have a program to help minority contract minority electricians become contractors. So we look at this as a long term investment in Long Beach. And I want to say the members are competitively compete for these jobs.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_11': 'Mayor Garcia, council members. My name is Mike Kovacic, Jack. I am the director of Veterans Affairs for the International Brotherhood of Local International Brotherhood of Electrical Workers for Local 11, which represents Los Angeles County and of course, which is very much so inclusive to you here in Long Beach.'",
        "'speaker_11': 'What makes me uniquely qualified for this position is I spent 32 years of my adult life serving this country, this nation, these communities as United States Marine. I've participated in three wars. I on displaced. I wearing display a legion of merit to Bronze Stars with Combat V and two Purple Hearts for injuries sustained in combat.'",
        "'speaker_11': 'Now, as the director of Veterans Affairs for the International Brotherhood of Electrical Workers, I am out here advocating and supporting this project labor agreement. As we've heard that terminology, local hire, which is also very much so inclusive to the ever growing veteran population that comes back and makes up that demographic.'",
        "'speaker_11': 'Here in Long Beach, I am out there actively advertising and recruiting in your community. Right now, the U.S. vets, the E.D., the work source centers, bringing in advertising opportunities and options to this community here of veterans who otherwise would not have these opportunities and options.'",
        "'speaker_11': 'This project labor agreement, it means so very much to so many. Let's provide and give an opportunity back to those veterans. Given everything that they've done on behalf of us. Thank you very much.'",
        "'speaker_1': 'Thank you, sir. Sir. Thank you for your service and obviously all our veterans in the audience. Thank you for your service as well. Next speaker.'",
        "'speaker_8': 'I look for the Long Beach. My name's Travers. I'm a union member from a local opera. An engineer.'",
        "'speaker_11': 'I started working as an apprentice 2011.'",
        "'speaker_8': 'I finished my my apprenticeship program in June 2014 and now become a full journeyman. I'm employed for managing for for about three and a half years. I worked on a middle Arbor project job that was a play for most of my apprenticeship.'",
        "'speaker_8': 'It's given me enough skills to move on with my career as a journeyman. Now I live. I live in the area for most.'",
        "'speaker_2': 'Of my life. I've grown up in a union family.'",
        "'speaker_8': 'So I believe in unions that we are that believe in unions and what we believe in. It's given me lots of opportunities.'",
        "'speaker_2': 'With having a good career.'",
        "'speaker_8': 'I recently got married and bought our first home and now expecting our first born. I'm grateful for our union and what they've done for us. So we have. So we can have a good chance to provide for our families.'",
        "'speaker_8': 'I think so far it's one of the best things that has had that happen to me. Becoming an opera engineer. Thank you.'",
        "'speaker_1': 'Next beaker, please.'",
        "'speaker_4': 'Good evening, Mayor and City Council. My name is Timur Zachary. I am a two and a half year member of the International Brotherhood of Electrical Workers. I'm an apprentice. I wanted to come up here and see my support for the project labor agreement also, not just because of obviously creating jobs and what everyone else has said, but'",
        "'speaker_4': 'to some of the speakers who spoke about discrimination as a black female. I am very aware that in this trade or pretty much in any.'",
        "'speaker_6': 'Sector, private or public, there's very little opportunity for someone like me to achieve the same wage equality as her male counterparts. And that is something that's huge for me in the union. So when people speak about special.'",
        "'speaker_4': 'Interest groups, I don't know about being a part of a special interest group. I'm a part of a brotherhood.'",
        "'speaker_6': 'And I am especially interested in getting paid as much as my male.'",
        "'speaker_4': 'Counterparts and making sure that I do.'",
        "'speaker_3': 'Well and making sure that.'",
        "'speaker_6': 'I too can provide for a family someday, that I too can retire with dignity.'",
        "'speaker_4': 'So thank you very much. And I hope that you all can.'",
        "'speaker_6': 'Support this and be a Beacon leadership and just make sure that the other cities that see this very historic.'",
        "'speaker_4': 'Agreement go into place can hopefully follow suit very soon in the state of California. Thank you.'",
        "'speaker_1': 'Thank you. Speaker. These are, by the way, we have obviously some great comments coming down. I just wanted to say that a note we have about if everyone in line takes your 3 minutes, we have about an hour of public comment still.'",
        "'speaker_1': 'So which is okay, you have a right to it. But just letting you all know, I think we're hearing obviously a similar message. So if we want to just kind of reinforce what your message is, if it's something that hasn't been said before, we absolutely want to hear that.'",
        "'speaker_1': 'But if it's you know, it's the same message that's, you know, well, if we can speed it up a little bit, we'd appreciate it. But if not, you have a right to your 3 minutes.'",
        "'speaker_0': 'Next Speaker Hi, good evening. My name is Ronnie.'",
        "'speaker_6': 'Annual Awards and I'm the deputy political director.'",
        "'speaker_4': 'At the L.A. County Federation of Labor, AFL-CIO, on behalf of our executive secretary treasurer Rusty Hicks, representing more than 700,000 workers in the county of Los Angeles. We stand here today in support of local residents and workers of the city of Long Beach.'",
        "'speaker_4': 'Simply put, project labor agreements are critical to building a stronger and even more economically prosperous city. We look forward to your leadership tonight and look forward to your leadership and future. Thank you.'",
        "'speaker_1': 'Great. Thank you. Next speaker, please.'",
        "'speaker_11': 'Good evening, Council. Good evening, Mary Garcia. Thank you for allowing me to be here. My name is Ricardo Ray, as I'm the veterans employment coordinator for the Los Angeles County Federation of Labor, a joint effort with the United Way of Greater Los Angeles in partnership with the Building Trades Council.'",
        "'speaker_11': 'Just my charge is to help increase the number of veterans in the building and construction trades. Also, a marine Corps veteran served in Iraq and Afghanistan. Thank. And I just want to highlight some of the opportunities the Building Trades offers our veterans.'",
        "'speaker_11': 'It's really unprecedented. There's nothing like it across the country. I'm talking about things like direct entry into apprenticeship programs, really minimizing the barriers that veterans face as they transition out of the military. I'm talking about taking a veteran from the unemployment line one day into an apprenticeship program the next to me out in the field literally overnight'",
        "'speaker_11': '. Direct entry, unprecedented. There's nothing like it. Also, the building and construction trades are one of the only industries that really recognizes a veterans military experience, takes their military experience, looks at it, and recognizes that by offering them a leg up in the apprenticeship program with higher pay and better opportunities if they can, if there's a correlation between'",
        "'speaker_11': 'their military experience and the building trades. I want to highlight some of the programs that are being led right now, like the way they have their veterans and piping program laborers with Empower America.'",
        "'speaker_8': 'IBEW You heard.'",
        "'speaker_11': 'Earlier a 50% commitment to place 50% spaces for veterans into their apprenticeship programs. And just this week, the ironworker started an all veteran class, also known as Gladiator School. And the stories that I continue to hear from these veterans is that as many programs that are available to them, all these job offers and employers trying to do'",
        "'speaker_11': 'a really great job at hiring our veterans, there's nothing that compares to opportunities and careers in the building trades. So I really urge you to support this play and that's my time. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_9': 'Good evening. My name is Patrick Kelly. I'm with Teamsters Joint Council 42 and Local 952. And I want to thank all of you, particularly the mayor and the council people that we've had the privilege of knowing. We have one council woman who's the daughter of a Teamster Lina.'",
        "'speaker_9': 'We're very proud of what you're doing. The Teamsters Union is proud to partner with all of you. And for those of us who have been involved over here down through the years, I think it's a fantastic event that we're here tonight and that the people of Long Beach have stepped up and elected such fantastic people that we'",
        "'speaker_9': 'have here. I'm so proud of what you're doing. And I'm I'm proud of the electricians from Local 11 that have come out here big time tonight. And I'm also proud of the veterans and the people from the clergy and the community that are pushing to establish true partnership with the city of Long Beach.'",
        "'speaker_9': 'And I want to thank Ron Miller for his leadership. And I want to thank you, Mr. Mayor, for all that you're doing. I really feel that what you are is a breath of fresh air here in Long Beach.'",
        "'speaker_9': 'And I'm not trying to disparage anybody. I'm just saying let's move forward. And I can tell you that the Teamsters and we have thousands of members here in Long Beach. We look forward to partnering up and helping put people to work, whether it's in the trades or as truck drivers here in Long Beach.'",
        "'speaker_9': 'So thank you very, very much, Mr. Mayor.'",
        "'speaker_1': 'Thank you. Speaker.'",
        "'speaker_8': 'Mr. Mayor. Councilman, my name is Derek Simpson, live in the second district. And in the spirit of thanks, I'm here to say thanks as well. From the standpoint of the local hire coalition that I've been a part of, as you know, in the last two months, we've been here many night talking to you about this project labor'",
        "'speaker_8': 'agreement and about our concerns about a local hire policy. But tonight, it's about acknowledging the fact that we've come a long way. We've done things such as move on, the percent of total hours worked and not positions, which we felt was very important.'",
        "'speaker_8': 'And we appreciate that we've moved on. The fact that we have 40% local and 10% disadvantage, which are good set aside and we appreciate that the process was opened up and the ministers talk to you about answering the call when they answered the call for meaning things that are negative in our city.'",
        "'speaker_8': 'You can call them to come to the table on something that was proactive and positive. And we appreciate that as well. You know that we've collected nearly 600 petitions in just about two and a half weeks of just a few days a week from members of our community that also support this from all walks of life.'",
        "'speaker_8': 'And that was important. We've heard you talk about the Joint Administrative Committee, and we think that that's important because it allows a way to sustain the community input, that it won't stop at a city council meeting such as this, but it will be an opportunity for the community to have ongoing input.'",
        "'speaker_8': 'And with that, if there are indeed three positions on that committee, we hope that the Ministers Alliance will have some representation in terms of the faith base. We hope that some local content expert from our community will be able to join in that initiative as well because from that perspective we will get real feedback that is at'",
        "'speaker_8': 'the pulse of what this community feels as an ongoing concern. In short, thank you for all that you've done, and thank you for the spirit of openness that we hope will continue and won't stop with just the passing of a plea this evening.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good evening, Mayor Garcia. Members of the city council and city staff. My name is Bill Baxter. I'm the president of Carpenters Local 630 right here in Long Beach, where at 341 East Wardlow. Tonight, I speak in favor of this proposed project labor agreement.'",
        "'speaker_8': 'This agreement moves Long Beach carpenters and other trades men and women to the front of the line for good paying jobs throughout Long Beach. In addition, a proposal to have a pre apprentice program at Long Beach City College is a positive step for the citizens of Long Beach.'",
        "'speaker_8': 'This proposal is good government. I, I urge you to vote for this project labor agreement tonight. Thank you.'",
        "'speaker_1': 'Thank you very much. Next speaker.'",
        "'speaker_4': 'Good evening, mayor gracey and council members. My name is hannah cooper and i'm a member of IBEW Local 11 and I'm here in support of the play. I've been an electrician for about seven years and I love it.'",
        "'speaker_4': 'Plays provide opportunities for women like me to learn about the trades, enroll in an apprenticeship program, and continue on to have a successful career. Research. Research shows that women in the workplace still only make $0.77 on the dollar that every man makes.'",
        "'speaker_4': 'But please equalize the playing field. Working under plays, women make have access to the same health care, the same retirement plan, and make the same wages as the men they work alongside. The the play on tonight's agenda will help steer other women towards a career in the trades.'",
        "'speaker_4': 'A career that's not only been lucrative for me, but that supported me with the training and the skills necessary to excel in the electrical industry with dignity and respect. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_11': 'My name's John Schaefer, and I'm the business.'",
        "'speaker_8': 'Manager at third generation of power drivers Bridge, Dock and Wharf Builders Local 2375, located in Wilmington. So 28 North Lagoon, Wilmington. Just one of the best things about doing place nowadays is that it's verifiable proof. You know, there's no place going back to the Century Freeway.'",
        "'speaker_8': 'And time and time again, we're meeting those local hire goals. We were meeting these veterans, minorities, what small businesses, you know, getting them involved in all these actions so you can verify some proof. 1928 My grandfather joined the hall as a hardhat diver and said the power lines, underwater power lines that went to Terminal Island when they'",
        "'speaker_8': 'first started. My father in 1946 started to work on the Long Beach breakwater when they built it up as a rock layer. And my brother and I worked on the convention center. I worked on the blue line. And my kid will tell you that every time I drive anywhere near it, I usually tell him the whole story'",
        "'speaker_8': 'about it, and he's about tired of hearing about it. But we don't have a welder yet in the family, so I'm working on the fourth generation. This is a career you could take pride in. This is a career that you can look back and say, Look, I help people move.'",
        "'speaker_8': 'I helped trade move. I got created environment for jobs, with dignity, with a pension and benefits. And I was able people to have families and dignity when they go through their. You will have that same pride when you support this play.'",
        "'speaker_8': 'And I just want to applaud you guys for doing that. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker. Good evening, Mr. Mayor. And Council. My name is Steve Geddes.'",
        "'speaker_10': 'I've been a resident of the fifth district for 22.'",
        "'speaker_1': 'Years.'",
        "'speaker_10': 'And a proud member of Local one of five. For 27 years, I've been lucky enough to work on a couple of.'",
        "'speaker_1': 'Pilot projects.'",
        "'speaker_10': 'Myself, and I think they've proven themselves throughout the country to get the job done on time, get quality work. And I think setting up Long Beach for a five.'",
        "'speaker_9': 'Year run of place is the best thing you can do. I urge you to pass this.'",
        "'speaker_1': 'Thank you. Next. And what I'm going to do before the next speaker is who's the last person in line on this item? The gentleman. The red came in a closer speaker's list. Which is anyone else. Okay, if you're not, I'm going to close the speaker's list up.'",
        "'speaker_1': 'We've had extensive public public comment on this. If we can just move it along, that be appreciated. I know that the council is eager to to go to deliberation. So I think one more personal step then I'll make I'm going to cut the speaker's list off at at Mr. LABAR.'",
        "'speaker_1': 'Yes.'",
        "'speaker_9': 'Next Speaker. Mr. Roberts, I'm an executive for Jobs, a member of the Coalition and a close friend of Labor's. We work on about 17 projects in LA and our place and we have found as workforce development professionals we have found that project labor agreement, having people join the unions is the best, best method, best method to get'",
        "'speaker_9': 'people on a meaningful career track. The you get paid training that is paid for by the unions. You get good wages. The unions help replace people when they when the job is finished. You know, it's workforce development professionals that's really important.'",
        "'speaker_9': 'Also is what's important is make sure the community is connected. And that's what we do in L.A. as a jobs coordinator. And we make sure that we have 135 organizations in our collaborative that send us people. It is that can be a kind of community support that supports labor, that helps with the the the process that we'",
        "'speaker_9': 'think is important down here also. So we support what you're doing. Everybody here, at least in the coalition that I know of, is supporting the play. Thanks. Thank you very much.'",
        "'speaker_1': 'Thank you, sir. Next speaker, please.'",
        "'speaker_14': 'Good evening. My name is Alexander Herndon. I'm an attorney with the Legal Aid Foundation of Los Angeles and our Long Beach office. And I'm also a member of the local hire coalition. Um, this plays a meaningful step towards quality jobs and careers for Long Beach residents.'",
        "'speaker_14': 'And while we haven't been given an opportunity to review the actual agreement, we're heartened that the city has included a significant local hiring component in it. Um, we're hopeful that that component can be fine tuned through the advisory committee and the local hire policy, um, including the participation of a jobs coordinator, which we feel is very important'",
        "'speaker_14': '. Um, a jobs coordinator has proven to be a very successful way to achieve true local hiring in other areas. Um. And in other places where jobs coordinator has been utilized to. Local hiring goals have been exceeded or met.'",
        "'speaker_14': 'If the city wants to limit the use of a jobs coordinator to larger projects, we feel that the threshold needs to come down. It's currently at $10 million. None of the anticipated construction projects for 2015, which are subject to the play, are over that threshold.'",
        "'speaker_14': 'So we feel that the threshold should be lowered to $1 million. Um, but we support the play and feel that it's critical for Long Beach to ensure that those first tier, um, residents of Long Beach are able to take advantage of any play jobs that come up.'",
        "'speaker_14': 'Um, and in that vein, we would like to see some enumerated steps for how contractors move from one tier to the next. Um, but we feel this is a really critical step for good jobs for Long Beach residents.'",
        "'speaker_14': 'And we congratulate you on the play. Thank you.'",
        "'speaker_1': 'Next Speaker.'",
        "'speaker_4': 'Good evening. My name is Jackie Kaneko and I'm with the Los Angeles Alliance for a New Economy Lane. And we have helped lead efforts to increase standards in the construction industry since 2006 to make sure that workers and on publicly funded projects are earning prevailing wages with health and pension benefits.'",
        "'speaker_4': 'And that project labor agreements with local hire help increase access to apprenticeship programs for low income communities of color. Long Beach has taken a very important step in making a reality for its residents. Project Labor agreements ensure that these projects are completed on time and on budget and that has been a proven track record in the other'",
        "'speaker_4': 'agencies that have adopted similar policies, such as the City of Los Angeles, the County Board of Supervisors, and most recently Metro. We hope that you move forward with this project labor agreement and we also fully support the emphasis on low income residents and veterans to ensure that these folks are also have an opportunity for a career in'",
        "'speaker_4': 'construction. So we hope that today you make.'",
        "'speaker_6': 'History here in Long Beach. Thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_14': 'Good evening.'",
        "'speaker_9': 'I'm Wally Baker with Jobs First Alliance.'",
        "'speaker_8': 'And I'm here to speak tonight on behalf of small business that supports plays. As many of you know, I spent about eight years at the L.A. Economic Development Corporation and have worked with a lot of businesses. It is very difficult for small businesses to get the kind of qualified workforce they have and they will need to say'",
        "'speaker_8': ', bid on your redevelopment project. You're going to get thousands and thousands and thousands of small businesses to.'",
        "'speaker_9': 'Make that happen.'",
        "'speaker_8': 'But they need a structure and the play gives them a way of getting to the workforce, having those folks who are qualified and literally all the contractors that I know of, with a few exceptions, are small businesses that do this kind of work.'",
        "'speaker_8': 'They're not really big construction companies. And as somebody said, you know, a number of them are here in Long Beach, but they also want to get to trained employees. And the best way for them to do that is working with a project labor agreement.'",
        "'speaker_8': 'They also want to get to veterans and they want to do good things. So a project labor agreement is something that a lot of small businesses support and they work with and they've been successful. So I ask you to approve this and strongly recommend that you support small business and this place.'",
        "'speaker_8': 'Thank you and good evening.'",
        "'speaker_9': 'Mayor Garcia and fellow council staff and the public that's here today. I just wanted to, you know, say kudos to the council and staff and the building trades for, you know, rolling up their sleeves and saying, hey, we can do this, we can.'",
        "'speaker_2': 'Compromise, we can negotiate and negotiate a good project labor.'",
        "'speaker_9': 'Agreement. I just want to let you know, today we got close to 300 members that came out. Today, we got over a thousand members that live in Long Beach.'",
        "'speaker_11': 'Because they've got a vested interest.'",
        "'speaker_2': 'To work on these projects today. So I.'",
        "'speaker_9': 'Wanted I want our members that's here.'",
        "'speaker_1': 'Today from IBEW Local 11.'",
        "'speaker_9': 'To stand up. We got members outside that's.'",
        "'speaker_2': 'Over there, an overflow room with a big banner saying Project labor agreements mean local jobs. Please, we urge you to vote for it tonight.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_1': 'I think they're I think they've got the flu set up in the library. I believe so. Yes.'",
        "'speaker_8': 'Right. Good evening, Mr. Mayor. Council members. My name is Gerry Lutely. I was born, born and raised here when living here 54 years now. So anyway, I'm an.'",
        "'speaker_9': 'Instructor for the Electrical.'",
        "'speaker_8': 'Training Institute, and we have approximately 1200 students at this time going through electrical apprenticeship. And I was going to go a lot longer, but I'm just going to keep it short. I think this play is going to be great for them.'",
        "'speaker_8': 'And being a.'",
        "'speaker_9': 'Long time Long Beach.'",
        "'speaker_8': 'Resident, I really feel this is going to be fantastic for the city. It's going to grow jobs and I think the city is just going to shine in the future. Thank you.'",
        "'speaker_1': 'Next speaker.'",
        "'speaker_10': 'Good evening, everyone. Hear me? I'm nervous. I'm very nervous. So my name is Ron since I came to Long Beach in 1979. I'm unemployed right now. I'm taking jobs, cash on the table. So I'm nothing against construction jobs.'",
        "'speaker_10': 'But there should be more offers, more opportunities. And what do you think the city council can do or the mayor's office to bring more companies into the city? I'm talking about clerical people, support people, not people that don't disapprove of construction, but can do something besides, you know, they're very important indeed.'",
        "'speaker_10': 'That's true. And and my own experience. Is there a way to do that to attract more companies, not just construction projects? I think that's fine. But we need companies that can provide more manufacturing opportunities. Also, would there be a way to partner with more companies to provide training skills for older workers such as myself or anyone else'",
        "'speaker_10': 'would be interested, you know, computer skills training under the library. I mean, I've been through many classes. I myself, my own experiences. I live on the West Side, which is, I have to say a wonderful part of the city is probably the most diverse community.'",
        "'speaker_10': 'It's a wonderful part of the city. And I think the West, I get shorted a lot of time because not enough attention is paid by myself. I've been the last five or six years. I've gone to many companies door to door, old school way, you know, handing out resumes, talking, no one's hiring.'",
        "'speaker_10': 'I went to one place a few years back. They'd laid off 15 people, 15 people. They had one girl work in an office. What's happening? They had a job fair here. Aerospace company. I don't know if you heard about it, but they had 100 openings.'",
        "'speaker_10': 'Guess how many people showed up? 6000 people for 100 openings. That's pathetic, man. You've got to do something to bring to bring more jobs to the city, not just construction. And not everybody is going to want to join a union.'",
        "'speaker_10': 'Okay. And I'll just have to say that I think you all seem to be trying some and also Tier one, please mention Tier one. And that means jobs in Long Beach. A lot of them. We need them. All kinds of jobs, not just construction.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, Mayor Garcia. Council members. I'm Robin.'",
        "'speaker_4': 'O'Toole.'",
        "'speaker_6': 'I'm a journeyman ironworker. I've been in this line of work for ten years.'",
        "'speaker_4': 'And I support this project labor.'",
        "'speaker_6': 'Agreement. And I want to leave.'",
        "'speaker_4': 'My fingerprint on that building.'",
        "'speaker_6': 'Thank you for your time.'",
        "'speaker_1': 'Thank you. Very concise. Appreciate that. Thank you. Next speaker.'",
        "'speaker_9': 'Good evening, mayor and council and staff. My name is Mitch Potts and I live at reside at 3744 Gundry Avenue in the seventh District. And I also support the ironworkers local 4:33 a.m.. I represent them hard working men and women that build the skyscrapers and bridges that you see.'",
        "'speaker_9': 'And we'll be working on this bridge and we've worked on the Mill Harbor. We're in support of this project labor agreement, and we hope to look forward to having our members working on this, on which a lot of our members do live here in the city of Long Beach.'",
        "'speaker_9': 'So I want to thank you for that. Thank you for your time.'",
        "'speaker_1': 'Thank you. Next speaker. Good evening. My name is Nate White.'",
        "'speaker_7': 'I'm a co-owner of a business in Long Beach on 1644 West 17th.'",
        "'speaker_1': 'Street over there by PCH and Santa Fe.'",
        "'speaker_7': 'I just wanted to say that my employees and.'",
        "'speaker_8': 'I, we live and work in the area.'",
        "'speaker_7': 'And I'm in support.'",
        "'speaker_8': 'Of this appeal. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_4': 'Hi there.'",
        "'speaker_6': 'I'm Deborah Philippe, and I'll try to get a hold of Mr. Gonzales.'",
        "'speaker_4': 'The city manager's office, the owner.'",
        "'speaker_6': 'And the mayor. The only person that actually has returned my call or I got a call from was Greg back. We had a brief conversation today. This is unfair. It's been hidden. It's on the agenda. It should be on the ballot.'",
        "'speaker_6': 'I'm a citizen of Long Beach. I want to know and I want to.'",
        "'speaker_4': 'Vote for the things.'",
        "'speaker_6': 'That are going to increase my cost and my taxes. Absolutely. Regardless of a play, the unions, I don't believe in them, to be quite honest with you. But that's not the point here. The point here is I'm a citizen of Long Beach.'",
        "'speaker_6': 'When you go to Ms.. Gonzalez's website for the city, you cannot get a hold.'",
        "'speaker_4': 'Of her or any of her staff via the website.'",
        "'speaker_6': 'You can't get a hold of the city manager. You can't get a hold of anybody unless you start screaming and hollering. So I'm not going away.'",
        "'speaker_4': 'The statistics don't match up.'",
        "'speaker_6': 'I I'm a previous union contractor. They're not friendly to women contractors. This doesn't work. We have sound facts. That does not work.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Hello. Maria Garcia. My name is Anthea Marcos.'",
        "'speaker_6': 'And I voted for you. I live in North Long Beach.'",
        "'speaker_0': 'My spouse voted for you.'",
        "'speaker_6': 'And when my foster child, Viviane, turns 18 this month, she'll be voting for you as well. Okay. I was 20 like you. I like you too. When I was 23, I had finished college with my B.A., was unable to find work in my field.'",
        "'speaker_6': 'I could not find a career. I found jobs none more than $15 an hour. I worked for jobs seven days a week. I didn't know what to do. I didn't know how to make my payments for my house.'",
        "'speaker_6': 'I went actually to the career transition center was 27. That's on Atlantic Boulevard. And I heard about a.'",
        "'speaker_4': 'Construction apprenticeship program.'",
        "'speaker_6': 'For this at the city of Long Beach, and I joined that. And that was called even though an apprenticeship.'",
        "'speaker_4': 'Program, pre.'",
        "'speaker_6': 'Apprenticeship program excuse me, it was called CPP, which stood for.'",
        "'speaker_4': 'Construction apprenticeship.'",
        "'speaker_6': 'Program. I went through that. That was a ten.'",
        "'speaker_4': 'Week program and they gave me a bag of tools.'",
        "'speaker_6': 'If my first set of tools, if I got into a union, I got into the IBEW, the International Brotherhood of Electrical Workers. They paid for my $400 set of tools, and they told me that that was just so that, you know, they would be happy to give to me so that I could make an income and pay'",
        "'speaker_6': 'taxes to the.'",
        "'speaker_4': 'City of Long Beach and.'",
        "'speaker_6': 'Pay it back. Well, guess what? I successfully completed my apprenticeship and I actually worked my very first job here as a journeyman that I took as a job.'",
        "'speaker_4': 'Job call when I turned in a journeyman was at the city. I mean, that the the site courthouse, Long Beach courthouse loved it.'",
        "'speaker_6': 'I loved it so much. I love my career so much. I want to share it. So I became an instructor at the Electrical Training Institute. I'm an instructor there, and I'm just thrilled to death. I pay tens of thousands of dollars in taxes every year, but I do so gladly because I'm very happy to give back to'",
        "'speaker_6': 'the community. I also try to buy locally. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker. Hi. My name is Ron Reeder. I'm a 28 year resident, 28 years I've been a resident of Long Beach and I have never worked in the city yet, and I would love to work in the city.'",
        "'speaker_1': 'And there was a job tomorrow. I would take it and. I'm struggling just like everybody else out here trying to make ends meet for my family. And I would appreciate you'd support this play. Thank you. Thank you. Speaker.'",
        "'speaker_11': 'Good. Good afternoon. Good evening, Mayor Garcia and council members. My name is Colin Caesar, resident of the district. I'm a 30 year resident of Long Beach. It's been a lot of time in the night district and now live in a safe district.'",
        "'speaker_11': 'I'm also a member of the IBEW Local for 24 years and. I'm a.'",
        "'speaker_8': 'I'm a product.'",
        "'speaker_11': 'Of this apprenticeship program, this plea agreement to do stuff like that throughout the city. Because I was able to raise myself standard of living for my family to raise a family here in Long Beach. I became a homeowner.'",
        "'speaker_11': 'Homeowner here in Long Beach, raised three kids and got two of my sons to follow me into the trade. They are now part of the apprenticeship program at IBEW Local 11. My daughter is going to graduate from from Long Beach Poly High School to go jackrabbits.'",
        "'speaker_11': 'Go jackrabbits to go to play college soccer on a scholarship. I just want you to know that these programs work. And I applaud you guys for even considering to have a plea agreement here in Long Beach because it's going to benefit a lot of disenfranchized people and lift them up out of the poverty level so they can'",
        "'speaker_11': 'raise their family and become homeowners here in Long Beach and become productive members of society. So I thank you so very much.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_11': 'I guess my name is Cedric Cesar. I'm born and raised in Long Beach. I'm a part of the local living union. I'm an apprentice third year.'",
        "'speaker_12': 'And I want you to approve this plea. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker.'",
        "'speaker_12': 'Let me just start. Good evening. My name is Albert Ramirez. I'm a job developer at winter. I'm glad to be in a house full of sisters and brothers. I grew up in a household of union. My grandfather was in big strike of 34.'",
        "'speaker_12': 'I'll tell you, my stepdad is a retired Teamster. My mom is represented by SEIU. So I see the benefits of union and we fully support this play. Directly working with students that do not have that privilege of growing up in a household, what have you.'",
        "'speaker_12': 'I have many students, actually, some here that have to go home soon, want access to this opportunity and this end point to these jobs locally. So we support that and look forward to working with the city, working with the trades, to have some of our students be to be able to attend some of the employment and careers'",
        "'speaker_12': ', because I see day to day the effects of not having a job. With our young Lumbee students because we service students from Long Beach. Roughly 50, 60 students. And every day there's a multiplier effect with not having a job.'",
        "'speaker_12': 'Struggles with sobriety. Struggles with just day to day life eating. So I see this as an opportunity for young adults that participate specifically with one to YouthBuild to be part of this. So, you know, full steam ahead. Glad to see so many sisters and brothers.'",
        "'speaker_12': 'And I look forward to having our our youth be part of this. Thank you.'",
        "'speaker_1': 'But your next speaker, please.'",
        "'speaker_8': 'I'm. Good evening.'",
        "'speaker_1': 'Sir. Missy, you'll be the last. I know. I'd cut off the speaker's list, but year will be the last. Last speaker I've been trying to. I know it keeps growing after the cut off, but I will have her.'",
        "'speaker_1': 'And then she'll be the last speaker. Please.'",
        "'speaker_8': 'Good evening, Mr. Mayor, and honorable council members. My name is Larry Henderson. I'm a retired IBEW electrician, and I want to thank you in advance for your positive support on this play project.'",
        "'speaker_2': 'I believe it would have a significant effect on the city of.'",
        "'speaker_8': 'Long Beach as. Construction projects. As a man with an excellent two wheels coming up on a guy dragging a travel boy behind a horse and. You've heard all the other positive things. And thank you very much for your support.'",
        "'speaker_1': 'Thank you. Next, bigger.'",
        "'speaker_12': 'Good evening. I'm Western Labor. I'm a small business owner here in Long Beach. I'm also on the board of the Pacific Gateway Workforce Investment Board. I'm here tonight to support this proposal for a project labor agreement. I think it's so important in this day and age to grow the middle class and grow middle class jobs.'",
        "'speaker_12': 'And the only way you can do that is by guarantee local hiring. And I want to applaud you for taking this up. I will say, though, that I was very fortunate to be educated on this issue because of my friends in labor.'",
        "'speaker_12': 'I got to see the laborers training facility in Adusa, which is absolutely first class. If you haven't seen it, you should see it. They're doing amazing things and training these people to build things the right way. But I will say that not everybody in the business community is fortunate, as I am, to have those dialogs and to'",
        "'speaker_12': 'understand these issues. And what I'd really like to see moving forward on major issues in the city is for business and labor to come together and to have that dialog early on so everybody can understand it and be on the same page.'",
        "'speaker_12': 'And it seems to me like on this issue, a lot of people do get it and people do want to build good things in Long Beach and have them built the right way and put these great people to work.'",
        "'speaker_12': 'But that's not the case on everything. And so I really think moving forward, we need labor. We need business. God dare I say it, we need the chamber to show up and talk to labor. We need the business associations in the city to be part of this dialog, and that's the only way we're really going to get'",
        "'speaker_12': 'consensus on these issues. But once again, I support this as a resident. I think you guys are doing a fantastic job and thank you for allowing me to speak tonight.'",
        "'speaker_1': 'Thank you, Weston. Next speaker.'",
        "'speaker_9': 'Hi.'",
        "'speaker_11': 'My name is Jonathan Chase Butler. I am a student of Mr. Ramirez.'",
        "'speaker_7': 'I attend Long Beach YouthBuild, where we work on teaching.'",
        "'speaker_9': 'Students construction as well as finishing.'",
        "'speaker_7': 'Up high school and getting our diploma.'",
        "'speaker_11': 'And sometimes I think that this is a good project. It helps us get into what.'",
        "'speaker_1': 'We're really trying to do in construction.'",
        "'speaker_11': 'So I can I agree with that 100%. And I think you guys should stay forward and going on.'",
        "'speaker_1': 'Last speaker.'",
        "'speaker_4': 'Good evening, Mayor Garcia. Thank you for allowing me to speak and honorable members of council, ladies and gentlemen, brothers and sisters who are in the crowd tonight. I just wanted to thank you for putting this on. I'm here on behalf of myself, not the not as the member of a board of trustees on Long Beach City College'",
        "'speaker_4': '. But I have to tell you, I am very excited to see that you're working together with us in the apprenticeship program and putting our Long Beach residents first and giving them the front of the line. I really appreciate that.'",
        "'speaker_4': 'I have been in the arena of construction for almost two decades. I'm a I've always been the only female. So I've been in the trenches. I've seen both sides, and I've seen what quality and certainty does. And it is really what I haven't heard is the that this is the fiscally responsible thing to do.'",
        "'speaker_4': 'You cannot put a price tag on quality, on time, on budget projects and really taking care of our fellow Americans, our men and women who deserve to get paid the right wages and not inadvertently support an underground economy, something that District Attorney Tony Rackauckas has rightfully fought.'",
        "'speaker_4': 'So I just wanted to offer my support and offer my partnership personally. And thank you so much. I can't wait to see jobs right here in our backyard and see really tangible results and no longer this vision of jobs where this is really tangible, measurable outcomes.'",
        "'speaker_4': 'And I really applaud you. Thank you.'",
        "'speaker_1': 'Right. Thank you. I'm going to the speaker's list is now closed. I'm going to go back to the council for deliberation and a vote. So turn this over to Councilmember Andras. Oh, actually, that's right. Because he gave his time.'",
        "'speaker_1': 'So Councilman Richardson, then Councilmember Andrew.'",
        "'speaker_7': 'Thanks, Mr. Mayor. So I wanted to make sure that we heard from everyone here so that our remarks are are tremendous. I see a number of stories that took place tonight, but one in particular is the fact that over the over the course of a few weeks, there's been a number of people who came to city council'",
        "'speaker_7': 'to speak about this. And I just see a progression. The fact that the ministers can come and request a seat at the table and they got that and we received. Now we have a fair and balanced project labor agreement with wide, broad community support of the folks who kept count.'",
        "'speaker_7': 'There was really only one Long Beach resident who spoke against this. Everyone else who spoke in support of this understood the issue and they came and they were prepared. So I want to say that that this requires tremendous thanks to get to this point, to have broad support for play like this.'",
        "'speaker_7': 'I want to acknowledge our city staff, particularly Craig and Nick, for doing a yeoman's job at making sure that they handle sort of all the diverse opinions and bring it together so that we can have something that we all can be proud of.'",
        "'speaker_7': 'I want to acknowledge the pastors in the Ministers Alliance for coming out. Thank you so much for that. You know, it was important. I wanted to make sure that we did acknowledge, Sunny, for coming down because community colleges is an important part of this.'",
        "'speaker_7': 'And I know earlier when we asked the elected officials to speak, we didn't do that. But I want to I'm happy that she did come down and say say a few things. Now here are my thoughts. I support this unequivocally.'",
        "'speaker_7': 'But the fact is, someone nailed it when they said this is this is the fiscally responsible, fiscally prudent thing to do. And the fact is, there are no surprises with the play. Everything is pre-established, pre-negotiated. We understand what the terms are and it's the right thing to do.'",
        "'speaker_7': 'But they were still there was still, you know, been a bunch of like propaganda that's been been spun our way. And I'll be politically correct or maybe incorrect and use the analogy of the chicken that left the egg.'",
        "'speaker_7': 'It's been a lot of eggs left around about this. I want to just go through and clarify some of those eggs because we want to bring home the bacon for our families. So so I was I was I heard someone say the term special interests and I take direct offense to that.'",
        "'speaker_7': 'I consider if you consider women making fair pay, special interests, if you consider ministers and people both white and black and Latino, people of color from all backgrounds, making a fair living. If you consider that special interest, then then I don't know.'",
        "'speaker_7': 'I don't I don't know that it says a lot about your credibility. Then we then we have. There was someone who said something about a higher budget. That's just simply not true. These are public jobs that already require prevailing wage, so it allows for cost stabilization.'",
        "'speaker_7': 'No disruptions to the construction schedule. We know this in Long Beach, there were a number of projects that were delayed, particularly because of bad contractors and the terms weren't freedom pre agreed upon. So so for example, I see my pastor in North Lambie's there fire station 12 to go many, many years to get that done due to'",
        "'speaker_7': 'conflicts and stop notices and and folks not paying their subs. We get rid of that. We actually can save money on this. There was a whole conversation about we exclude nonunion bidders. I want to give an opportunity to city staff to respond to that.'",
        "'speaker_7': 'So Nick or Craig, Mr. City Manager, can anybody just respond to that quickly? The point that this play excludes nonunion bidders.'",
        "'speaker_1': 'Yes. Council member certainly non union contractors are open shop contractors are eligible to bid on any of the city projects being added. An opportunity for them to bring forward core employees and core employees would be employees that were working on their job that we're nonunion.'",
        "'speaker_9': 'Employees at the time.'",
        "'speaker_1': 'So we did our best to ensure that this was open and fair and we still had opportunity for competition within the city.'",
        "'speaker_7': 'So it's an open process and anyone can still bid on any city project. Correct?'",
        "'speaker_1': 'Yes, that's correct.'",
        "'speaker_7': 'Okay. Then someone said that it keeps someone who's a construction worker, this nonunion, from working on long, long projects. Is that true?'",
        "'speaker_1': 'No, that is not true.'",
        "'speaker_7': 'Okay. So and then someone else said that, hey, there was a there was a lack of transparency with this process. Mr. City Attorney did we meet all our noticing requirements with this process?'",
        "'speaker_10': 'Yes. Councilmember. We didn't meet the notice requirements.'",
        "'speaker_7': 'Okay. So I can't see why anybody wouldn't support this tonight. We've gone through every single argument and. So. So I just want to I just want to close by saying thank you to Councilmember Gonzalez. She was just so you know, through this whole process.'",
        "'speaker_7': 'She had a baby and she was out on maternity leave. And I got to tell you, I got to tell you, she I was twisting her arm. We got to bring the ministers on board and calling people and we got to make this happen.'",
        "'speaker_7': 'And literally, she took my meeting. She had her baby and took took this meeting so we could we could talk about this. I want to say thank you and congratulations on bringing this this far. And then and then I want to I want to I want to just say thank you to all the colleagues with tremendous history'",
        "'speaker_7': 'on this councilmember. Austin Councilmember you, Ranga Councilmember Andrews has done tremendous work to bring. He's always talking about the people in his district putting them to work. So I think tonight we have a tremendous opportunity to finally take a humongous leap forward.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Councilmember Andrew.'",
        "'speaker_2': 'Yeah. Thank you, Mayor. You know, I think it's about time for all of us to really seriously just kind of sit down and really enjoy what we're getting to be able to accomplish tonight. A lot of this really comes from the you know, my famous slogan is like a job can stop a bullet.'",
        "'speaker_2': 'I don't see too many people running around that has a job talking about committing crime. This is going to create a situation in the city of Long Beach for individuals who have lived as long as I have a chance to be able to not just have a job, but you join a union, you're going to have a'",
        "'speaker_2': 'future. And this is what we've been looking for, because the individuals I want to get in that union get you a future because they protect your family. That's why they call themselves a family. You know, for 14 years, we have been waiting for the citywide P.A. and the city has been cautious of introducing a pilot to the'",
        "'speaker_2': 'city project. The airport parking lot, Middle Harbor and others have been successful in creating and bringing new jobs for Long Beach area residents. I have seen firsthand the transformation of people getting opportunities not just for a job, but a career supporting their families by giving out contracts to play.'",
        "'speaker_2': 'This will ensure that there's enough work for our Long Beach residents. More work means more jobs. We need to allow the unions enough time to provide their comments to her Long Beach and residents by doing this to prove that our commitment to making this work.'",
        "'speaker_2': 'It is time for us to put actions behind our rhetoric and start creating jobs for our residents. Therefore, I am truly, truly agreeing and supporting the way it is reading. And also, like I said, from Dr. Martin Luther King's famous slogan, How long?'",
        "'speaker_2': 'Not long. This is time for us to get real and make sure that this goes the way it was put in writing. Thank you guys very much.'",
        "'speaker_1': 'Thank you. Got to remember a camp counselor for your anger.'",
        "'speaker_11': 'First of all, before I start with my remarks, I want to thank all of you for being here today. Especially Mr. Miller, the congresswoman, Congressman Lowenthal, Congresswoman Hahn, the elected officials who are here. Thank you for being here.'",
        "'speaker_11': 'It's important that we all work together towards a labor agreement that is going to be fair. That can be just that's going to provide jobs. The the quest of every family is to reach towards the middle class. And that's what union jobs do.'",
        "'speaker_11': 'We had an effort a while back. Many of you might remember there was a councilwoman on this scene from 2002 to 2010 by the name of Tony Reyes, who happens to be a roommate of mine. She at that time, during her her tenure here, tried to work to get labor project labor agreements here in Long Beach.'",
        "'speaker_11': 'It was not her time. This is our time. This is it now. We're here because we want it now. And I'm very I'm very happy to say that I'm following her legacy and being able to vote yes on this because I truly, completely support it.'",
        "'speaker_11': 'There is an item here, however, that I do want to bring out, and I think it's important that we do so. When I was on the Long Beach City College Board of Trustees, we had a major contract to build buildings to make the school better, deal with this infrastructure, building classrooms and improve the quality of education that'",
        "'speaker_11': 'we had at that campus at the time that we entered into the into the project. I brought up the fact that I wanted to see a print. I wanted to see jobs that provided apprenticeships for our students in there.'",
        "'speaker_11': 'Unfortunately, at that time, the City College did not have that infrastructure to do that. The purpose of a community college is to provide certificates and diplomas, not apprenticeships. Unfortunately, we had to restructure the those those classes. And I think that now with the restructuring and now with the possibility of entering into an agreement with Long Beach City'",
        "'speaker_11': 'College, we now have that opportunity to to partner with lobby City College and create those apprenticeships. That's what I that's where I'm happy. I guess it took me leaving City College and joining the council to make that happen, which I'm very proud to say I'm here, I'm doing that.'",
        "'speaker_11': 'So with that, I just will have one question to staff in that. Will this agreement with Limey City College, your partner with the Trades and Pacific Gateway, require a name or you will require some kind of contractual agreement or what's what's the process?'",
        "'speaker_11': 'And in ensuring that Lumbee City College has the ability to provide those kinds of apprenticeships.'",
        "'speaker_12': 'First and the first steps in the process, Councilman, have already been taken. Mr. Miller and company have have met with faculty and staff at the college to ensure that the curriculum being taught in in the trades related programs are in line with the M.S. three curriculum.'",
        "'speaker_12': 'Once that's in place, we know that folks are getting the skills and will have the ability to pass the exam, get into get into the apprenticeship. And we'll certainly work through the process of referral and documentation of of the folks who enter the class and then track them through completion into the apprenticeship.'",
        "'speaker_11': 'Wonderful. That is great news. I'm very happy to hear that because I think that when it comes to the trades, Long Beach City College and any community college for that matter, plays an important role in our workforce development and having the right types of programs.'",
        "'speaker_11': 'There is a long way of being able to provide that. So I want to I want to thank you, Mr. Miller, and all trades and anyone who's here in support of this. Thank you very much.'",
        "'speaker_1': 'Thank you, Carlton Ross.'",
        "'speaker_8': 'Thank you. And I want to thank everyone for coming out this evening as well. This has been a long time coming. I want to first start by commending the many folks who who worked to make this this happen.'",
        "'speaker_8': 'The city attorney's office for their diligence on this this matter. City manager. Staff. Mr. Beck. The L.A. County. Orange County Building. Trades Council. My colleagues. Councilmember Lena Gonzalez. Rex Richardson, Councilmember. I mean, assembly member. O'Donnell, who was really a champion for this this this issue isn't here.'",
        "'speaker_8': 'But I know he's probably watching from Sacramento. This is a special day for Long Beach. And I want to commend the many residents who were engaged throughout this process, culminating until tonight. The Ministers Alliance were here for weeks and weeks and weeks and many other community organizations out there in support of making sure that we had the'",
        "'speaker_8': 'right type of provisions in this project labor agreement that worked for everybody. Tonight, everybody wins. The community wins. Labor wins. The city of Long Beach wins. Those who are unemployed and looking forward for work, they're going to win the trades they win.'",
        "'speaker_8': 'This play has been discussed for many, many years, and I'm just proud to be a part of this, I think, historic decision this evening to move our city forward. As a former aerospace worker and somebody who has watched many people lose jobs over the years to see and understand this history, I think Congressmember Lowenthal did a great'",
        "'speaker_8': 'job of kind of outlining where we have been and where we are today in terms of our job markets. This project labor agreement is necessary. And so. Pastor Sanders, I wanted to talk about your analogy. There's no chicken tonight and definitely no waffles.'",
        "'speaker_8': 'All right. I'm so proud to support this historic agreement without reservation. I think most of you have said most of what I need to say tonight. And so I'll be voting in support of this. Thank you very much.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_6': 'Thank you very much. I, too, want to take a moment to thank our city staff for the excellent work that they've been doing on this project since November 11th. It was a council directive on November 11th that caused the work and the discussions to begin.'",
        "'speaker_6': 'And I think that staff has done an excellent job in not only working with the Trades Council, but also circling back around with council and making sure that some of our concerns are addressed in the provisions of the play.'",
        "'speaker_6': 'I know I speak for myself personally that I worked very closely with city staff behind the scenes as the negotiations were going on to fine tune a few of the provisions that are being proposed tonight as part of the contract.'",
        "'speaker_6': 'I'm very pleased that staff and the Trades Council were able to reach an agreement about the exclusion of City of Right of Way projects from the proposed contract. I've indicated this on many occasions, given the fact that our city is about to undergo a very tough financial period from now until 2021, that the decisions that we make'",
        "'speaker_6': 'as a body should reflect our fiduciary duty to our citizens, and that we should ensure that our obligations to our citizens are not hindered by any policy decisions that we make that may cost us additional money or cost a hit to our budget.'",
        "'speaker_6': 'So I'm grateful and have a lot of peace of mind that our ability to pave our streets and redo our sidewalks is not an unknown in terms of what an increased cost might be. Now there's been a lot of dialog back and forth and I know that we had a lot of supporters speak tonight and I appreciate'",
        "'speaker_6': 'everyone coming out. I couldn't agree with Western Labor more when he said that he had the opportunity to be educated on this process and I too had the opportunity to be educated on the process. And I'm very grateful.'",
        "'speaker_6': 'For those of you who know who you are sitting in the audience, who have called me consistently and made sure that I understood the process and engaged in a very collaborative process with me, I will never forget those of you who did that and who who made it very clear to me that you cared about me understanding'",
        "'speaker_6': 'the benefits of play and that you weren't really just looking at me as a vote, but that you really wanted me to understand what you were doing. There's a few of you who did that, and I'm not going to.'",
        "'speaker_6': 'I'm never going to forget those people that reached out and really educated me because that was a good learning experience for me. And you answered a lot of questions. So thank you. I think collaboration is key and we shouldn't look at policymaking as how many votes do we need to get something passed?'",
        "'speaker_6': 'We should look at it as if it's a good policy. How do we educate and teach people why it's a good policy and how do we bring everyone into the mix? Because I think that is what we're talking about, long term solutions, because not about today and it's not about the next five years.'",
        "'speaker_6': 'It's about long term solutions for our communities and our families. So I want to I want to thank the people who, as probably did for Weston, took the time and especially even those who reached out to me today and actually called me.'",
        "'speaker_6': 'I really appreciate that. But on both sides. But there's always been a discussion in regards to plays in terms of whether or not they cost more, the projects cost more. And that's been a concern that I raised with staff early on and to their credit and staff has worked very, very diligently on this because this play is'",
        "'speaker_6': ', in fact, revolutionary. It's very expansive. It's a big project play that is not really something that we can look to other cities in order to determine what the fiscal impact would be. So our staff really had to start at ground zero to try to determine what fiscal impact would be.'",
        "'speaker_6': 'And to their credit, despite their best efforts, they reported back to council that they were not able to determine one way or another what the impact to the city would be. And I respect that. And I think it is an accurate statement to say that the fiscal impact could be positive.'",
        "'speaker_6': 'And some of the things that I'm going to talk about or it could be negative, but we just don't know and we won't know that until we get some of the data back. I think that in terms of what I've learned about the process and I just want to share before I move on to an amendment, a'",
        "'speaker_6': 'friendly amendment that I'd like to make for Councilwoman Gonzalez's consideration. What I've learned is that plays can in fact be very valuable. I've learned this from long discussions I've had with unnamed folks who are in the audience or some who were here earlier who've enlightened me on a lot of things.'",
        "'speaker_6': 'I have always believed when I thought about plays, that the project by project basis was the most prudent approach to plays. But I understand that the will of this Council and the will of all the stakeholders is to try a citywide play and see how that works.'",
        "'speaker_6': 'And I'm willing to give that opportunity a meaningful shot, because I think it's important. The benefits of plays aren't really subject to physical measurement. They're things that you can't really accurately measure. For example, the best part of a play, in my opinion, is the local hire component and the apprenticeship program.'",
        "'speaker_6': 'I want to thank IBEW for inviting me early on to their facility so that I can have an opportunity to tour it, see the training program that's involved and be incredibly impressed with the number of individuals who are lining up every morning to have the opportunity for a career that gets them on the economic ladder.'",
        "'speaker_6': 'That is amazing. And I'm sure there are all the trades here do that. But only one invited me out to see it. And I want to thank you for that. It was an eye opening experience for me to see hundreds of young men and women.'",
        "'speaker_6': 'Well, actually, not young, young, old, all ages. Standing outside for an opportunity to have. The privilege to learn a trade, something that will serve them well forever. The cost to the city that's been identified in staff's memo regarding this play, in my opinion, is an investment in its residents.'",
        "'speaker_6': 'It's an investment in their education and an investment in the opportunity for the people to learn a trade and get on to that economic ladder that I just like I discussed. I think it's a beneficial investment to our residents that we can't accurately measure, at least not today in at least not in short term data.'",
        "'speaker_6': 'But it's an investment that's worth making, and it's something that's sometimes forgotten when people talk about the unknowns of a citywide play or the unknowns of a citywide play could be a financial detriment or an increase in cost to projects.'",
        "'speaker_6': 'But they can also be. A career for people who may not have otherwise had one, which is a huge investment and a huge benefit. The play also ensures that people are getting paid what they're supposed to get paid pursuant to the agreement.'",
        "'speaker_6': 'There's a certified payroll, and that allows us to make sure that people are being paid what they're expecting to be paid. Most significantly for me tonight has been the comments by the women who are working in the trades.'",
        "'speaker_6': 'Good for you. And your message of equal pay for equal work is well-received by this council member. I love the city college component of this agreement and I want to acknowledge Trustee Zia, who spoke earlier today. I think that is a great collaboration between our to the city and the college and that will serve us well.'",
        "'speaker_6': 'I have a few areas that I think are very important for us to address and monitor before we move forward on this. On this agreement. And this is where the amendment is going to come in. I expect that in advance of tonight, I sent a list of questions to our city manager and our city attorney's office regarding'",
        "'speaker_6': 'measurement criteria and how we would determine whether or not this play has actually resulted in benefits to the city. And I want to thank them for being incredibly responsive and timely and getting back to me on those issues.'",
        "'speaker_6': 'But I expect that staff will give us data at the end of one year and hopefully annually regarding the measurement criteria associated with this play. I'm hoping that some of the following measurement criteria will be used to gauge the success of the areas of improvement for play post implementation, things like reaching the local hiring goals, whether the'",
        "'speaker_6': 'bids received are in line with the engineer's estimate and any other data comparing the speed of contracts, completing contracts or other contract issues, including local companies bidding on contracts as compared to years without a play. All those criteria should be considered and for us so that we can determine the benefits of this play.'",
        "'speaker_6': 'It's important that and I appreciate Councilman Richardson asking the question about local contractors. Much of the fiscal impact of what this might do to small contractors is unknown and it's highly speculative. And I think it's important for us to monitor that and make sure that everyone really does have the same opportunities to be involved in the bidding'",
        "'speaker_6': 'process. It's unknown whether this agreement will, like I said, have a positive or negative impact on the city budget. But there are several potential benefits that small contracts present to our local businesses to be involved in the city's growth and development.'",
        "'speaker_6': 'And we want to do whatever we can as a city to encourage those companies to be involved in the process and to get involved in city projects. Once we have measurement criteria, we'll have the option to make modifications with agreement of all parties to the Joint Administrative Committee.'",
        "'speaker_6': 'There are limitations under the current contract, though, in terms of what can be modified. So with that, I'd like to make the following friendly amendment and ask Councilwoman Gonzalez if she would be willing to accept it. My amendment would be to recommend the approval of the agreement tonight, with the addition of adding, the following data shall be'",
        "'speaker_6': 'provided to council on an annual basis. The five year agreement will come back to Council after a period of three.'",
        "'speaker_4': 'Years.'",
        "'speaker_6': 'For a full review of the agreement. And at that time, any part of the agreement can be modified by the City Council if such modification is warranted through the data that's presented. Are you agreeable to that? Friendly. Yes, I'm agreeable to that friendly amendment.'",
        "'speaker_9': 'What?'",
        "'speaker_7': 'So I was.'",
        "'speaker_1': 'Actually. Councilman. Councilman Pryce still has the floor, so.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'She did say yes. Not right now. Customer appraisal has a four. But I don't think Councilman Price is done with that piece. You're Mr.. Mr. de attorney.'",
        "'speaker_10': 'Excuse me, just point of clarification on the friendly amendment to come back to council and review the document is fine. I'm not sure that we would have to talk to the trades to see if they're amenable. I don't know that the Council on their own could amend the agreement without the consent and agreement of the other party'",
        "'speaker_10': '. If we're signing a five year agreement.'",
        "'speaker_6': 'The current agreement, or when we come back in three years.'",
        "'speaker_10': 'So it will come back in three years for review by the Council and negotiations on possible changes with the trades. Is that the direction?'",
        "'speaker_6': 'I would like counsel to have the opportunity to modify the terms of the contract with agreement with the trades. But at that three year mark.'",
        "'speaker_10': 'That's certainly possible as long as it's with the agreement of the trades, we could modify it at that time.'",
        "'speaker_6': 'And what happens if we want to modify a certain aspect of the agreement and they don't.'",
        "'speaker_10': 'Then it would not be modified. We would need mutual consent to to amend the agreement because the term of the agreement currently is four or five years. So if it comes back in three years in the council and that's where the Joint Advisory Committee would come in to, if they see that there's potential changes or requests, both'",
        "'speaker_10': 'sides have to agree to any potential amendment at the three year mark. So.'",
        "'speaker_6': 'Do anything at this time, is what you're saying. So so basically we we would be locked into a five year contract with no ability to modify it within that five year period. In terms of some of the aspects of the agreement that have been identified in item number 19.'",
        "'speaker_10': 'The two items that are not amenable at this time are the five, the five year term and the threshold. Currently, all other terms and conditions of the agreement could be amended. And I and I guess even those two could be amended if there was agreement with the other parties.'",
        "'speaker_10': 'So as or as of right now we are limited if it's approved as proposed and as the current motion has, on unilaterally changing the agreement by the Council.'",
        "'speaker_6': 'And we would be prohibited from unilaterally changing any of the provisions at all in that five year period.'",
        "'speaker_10': 'Unless there was an agreement by the Joint Council. And that was the recommendation. One of the amendments here or one of the recommended actions of the item before you tonight is to authorize the city manager in his discretion so that the the council this evening, if this motion passes, is delegating the authority of the council to approve'",
        "'speaker_10': 'that. So if there was a proposed amendment by the Joint Advisory Commission and it was acceptable to the trades and it was acceptable to the city manager, those amendments could be made without coming back to council. If you're asking for amending the agreement to come back for a full review in three years, that's certainly possible and we'",
        "'speaker_10': 'can do that. The I just don't want the expectation to be that the council by a by a majority vote could change this agreement without negotiating that with the other party.'",
        "'speaker_6': 'Okay. Let me ask you this then. In regards to this amendment, then at the three year mark, if we were to have a full review of the contract, including the measurement data that staff has provided, could the Joint Administrative Committee make a recommendation for a modification of any and all terms of the contract, including the two terms'",
        "'speaker_6': 'that you've just identified?'",
        "'speaker_10': 'I believe the answer is yes. The joint committee could review and look at various provisions or any provision of the agreement and make a recommendation back to both parties.'",
        "'speaker_3': 'Okay.'",
        "'speaker_6': 'Because right now, as it's worded and I'm looking at the item right now, it says authorize city manager at his or her sole discretion to execute any subsequent amendments to the play that are recommended by a majority vote of the Joint Administrative Committee that do not change the $500,000 coverage threshold or the five year term of the'",
        "'speaker_6': 'play. So could we could the friendly amendment be that the Joint Administrative Committee could make recommendations that might include those two provisions at that three year mark?'",
        "'speaker_10': 'We could certainly discuss that with the other side. I think the intent of that authority was to make it clear to council that those two items, if they were to be amended or to change, would come back to the Council for authorization.'",
        "'speaker_10': 'The city manager wouldn't have the authority to make those two changes. I think the answer is yes, that the Joint Advisory Committee could make a recommendation to shorten the agreement, make the agreement longer, or change the threshold of some dollar amount.'",
        "'speaker_10': 'But that clearly would come back to City Council for approval.'",
        "'speaker_6': 'Okay. But so that they could make that recommendation at that three year mark. So then would it be appropriate in the amendment to have at the three year mark, have council review the project and make recommendations to the Joint Advisory Committee?'",
        "'speaker_10': 'They could certainly do that. And then the city, three members from the city's side, could bring those up at the committee level meeting and discuss that and negotiate and see if there's interest on the other side to make changes.'",
        "'speaker_10': 'Yes.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Gonzales. Okay.'",
        "'speaker_6': 'So with that, I know we're getting into a little bit of detail at this point, so can you clarify that for me, city attorney, just so I understand it correctly, because there's a lot going on and I want to make sure that we're not interrupting any of the negotiations that have already been in place.'",
        "'speaker_10': 'Thank you, Mayor. Members of the council. I believe that the friendly amendment would be to approve staff recommendation, include the annual report back of information which is already in the agreement, and then to report back to the city council at the three year mark for a full discussion of all the terms and conditions of the agreement, and'",
        "'speaker_10': 'that any recommendation from Council would be taken to the Joint Advisory Committee if four possible amendments.'",
        "'speaker_6': 'Okay. I don't know that I would be amenable to that because I think there's a lot of work that has already been put into negotiating this. And I think that we are now looking at, you know, there's two points of consideration here that seem to be very important, which is, you know, the threshold and as well as'",
        "'speaker_6': 'the the other item. And so I. I would not be supporting the friendly amendment at this point.'",
        "'speaker_10': 'Mayor, if I could just maybe I didn't make it very clear. I think that the council has the ability to do this friendly amendment at any annual mark. If the data comes back after the first year and the council believes that there is something that they can do that would improve this agreement or make it more efficient'",
        "'speaker_10': '. Clearly, staff is going to take that recommendation or that information back with them. And the mechanism we have to possibly amend the agreement is to work with the Joint Advisory Committee. So I don't see that there's a downside or that would impact our current negotiations.'",
        "'speaker_10': 'If you would like to consider the friendly because in essence, I think staff is going to be doing that on an annual basis. Without the council, they're going to be working with the Joint Advisory Committee, and that's going to be an ongoing process.'",
        "'speaker_10': 'So I think this friendly amendment is an opportunity that we are documenting. When Council wants to weigh in on this, obviously they can weigh in before that or not take any action at that three year mark. So I'm not sure it would impact where we are now.'",
        "'speaker_10': 'I don't I don't want to speak for the trades, but I think it's a it's a it would be would not impact where we are today.'",
        "'speaker_6': 'Okay. So we're saying that after three years, just so I have this correctly, we are going to be perhaps reviewing this again at the.'",
        "'speaker_9': 'We.'",
        "'speaker_10': 'Would have annual meetings on an annual basis. This council is going to be informed of the status of this. And at the three year mark, there would be a discussion, I believe, a more extended discussion of the current status of the play and how it's performing today.'",
        "'speaker_6': 'Okay. So I just want to make sure that we're not going to have any interruption with negotiations or at the three year to review this. There's not going to be any hindrance to what's already been.'",
        "'speaker_10': 'No, the agreement will be in place.'",
        "'speaker_1': 'And just as an added note, I don't have the. Friendly amendment that Councilwoman Pryce made, I think is very similar to the that was agreed upon to the amendment that was in reiterated through Mr. Park. And so I think there was a lot of conversation that happened, but I think the simplicity of the friendly amendment is simply'",
        "'speaker_1': 'a five year agreement. It'll be a historic five year play for five years. Every single year the council received data. Which part of that is already in the play? But beyond that, the Council received data on top of that at year three.'",
        "'speaker_1': 'The Council will then have a full review of the progress of the project label agreement. As part of that, I think what Councilman Price was saying is that if there's interests for the Council to make suggestions or amendments for the play, that could be suggested, and then through the consideration of the six member negotiation group or I'm'",
        "'speaker_1': 'not sure the exact name of the of the group of the advisory group, then those recommendations could be made in, in, in concert with the trades as part of that, as part of the agreement, knowing of course that everything has to be negotiated.'",
        "'speaker_1': 'I think that was the friendly amendment. I don't find that to be much different. I think that's what she's asking for. It's still a five year agreement. It's still a project labor agreement.'",
        "'speaker_6': 'Okay. I just wanted to make sure we weren't interrupting anything and that after three years, it was going to be a hopeful discussion again and maybe interrupt any negotiation. So I'm. I'm fine with the friendly amendment if. But now that it's cleared up.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Okay. Thank you so much, Councilmember Richardson.'",
        "'speaker_7': 'So just quickly, I just have a quick clarification for the maker of the subject of the friendly amendment. So so I understand we already receive an annual report. I think asking for data is all I mean, if we're going to do this, it's okay to be transparent and we should be able to stand by our numbers and'",
        "'speaker_7': 'what we do. I know challenge with that, but why three years?'",
        "'speaker_6': 'And I can answer that because three years will be the amount of time that we need to really get a sense of what the impact is. We'll have a lot more historical data after three years. Two On the measurement criteria that identified the measurement criteria that I identified is what the city manager and city staff believe would'",
        "'speaker_6': 'be the criteria that we'd be looking for. And at the end of one year we'll have some data, but we won't have enough data to really get an idea of what tweaks or modifications need to be made moving forward.'",
        "'speaker_6': 'So it's just one year, not enough data. Three years is the right amount of data, but certainly we can move it up to two years. I was just trying to be.'",
        "'speaker_7': 'I don't know. I mean, the reason we said five was what the reason we said five was to have a good most most apprenticeships are about five years. You need five years to get through that, to get to that point, to actually evaluate what the purpose of it is, which is jobs.'",
        "'speaker_7': 'And then on top of that. So any so we're going to receive annual data at any point we can we can review it, but we established a jack. The purpose of the Jack and I'm going to compare this to collective bargaining with our employee groups.'",
        "'speaker_7': 'We have like ongoing joint labor management committees that meet outside during the term of the contract when they're not in actual the contract negotiation period. And they evaluate things together and make joint recommendations that a lot of times get either resolved outside the contract or when the contract comes up.'",
        "'speaker_7': 'They have things that have been negotiated through the through the joint labor management process that people vote on. So it would just seem a little this would be my suggestion for my second. If you want to get to a point where you want an opportunity to weigh in, that that feedback should come from the jack which is'",
        "'speaker_7': 'our our established group is labor and business at the table. So I would say I would be more amenable if there were a three, three year sort of study session with the Jack to talk about all the things they evaluated over three years rather than be.'",
        "'speaker_7': 'Right. Because they're they're going to be administering this and we're not going to limit them ongoing. And I think if we frame it that way, it's more collaborative. And it's actually the people that are going to be at the table over the course of the three year term.'",
        "'speaker_6': 'I think that's an excellent idea because then we are involved, the council is involved. We're taking look at the historical data. We're taking a look at the historical data with the experts who have been involved and that we can make a recommendation that makes sense to them.'",
        "'speaker_6': 'Let me just be clear here. I mean, this is a very simple amendment, okay? It's a five year contract. No one's trying to make it shorter than a five year contract. We're just saying that the city is going to be undergoing a tremendous fiscal crisis right around that three year mark.'",
        "'speaker_6': 'We may need to make some modifications and tweaks if we need to in order to stimulate local economy, in order to figure out if we're meeting our goals. The idea that we'll have an opportunity to take a look at the three year mark and I'm respectfully answering your question and I'd ask that, you know, I'm sorry here'",
        "'speaker_6': 'more.'",
        "'speaker_7': 'My mike was.'",
        "'speaker_6': 'Perhaps it's you know, I wasn't trying to be comical, but I'm funny a lot of times are I'm not intending to be funny. I don't know what I said there. That was funny. But I'm trying to respectfully answer your question, which is that I think that's an excellent idea because it allows us to evaluate this project labor'",
        "'speaker_6': 'agreement at the three year mark with people who are involved in it and perhaps make some modifications to any and all terms of the contract that will still be in place for another two years at that time. It's an opportunity for us to work with our partners to make tweaks and adjustments if we need to at the'",
        "'speaker_6': 'three year mark.'",
        "'speaker_7': 'So. So as long as long as we're clear, what we're going to evaluate is what the jack is working on. And I think, like philosophically, I don't think we I mean, if we're going to engage in an agreement and set sort of a threshold and set basis to evaluate over a five year period, I don't want to'",
        "'speaker_7': 'adjust it too much at three years because you're not going to have skew results at five. So I want to be clear. My second my second to your friendly is if the friendly is a review of the Jack, the Jack's sort of the recommendations from the Jack.'",
        "'speaker_7': 'That's what I would second.'",
        "'speaker_6': 'And I don't understand that.'",
        "'speaker_7': 'And I'm okay with the annual report, but.'",
        "'speaker_6': 'Not a review.'",
        "'speaker_7': 'Of the Jack is what I will say. And otherwise I'm not going to.'",
        "'speaker_6': 'And that and I don't understand that at all. I mean, I've read every aspect and every document that's been created by our staff and our city attorney in regards to this issue. And I don't know what you're talking about when you say what the Jack is working on.'",
        "'speaker_6': 'I mean, we're entering into a five year contract and I'm saying at three years, we should be able to review the contract and make modifications if we need to. It's it's really that simple.'",
        "'speaker_7': 'All right. Well, I honestly think this is a fight that's not necessary. We're essentially saying the same thing, so I'm okay with it.'",
        "'speaker_1': 'Okay. Thank you. I'm going to move on to the next. Counsel comment, and then we're going to wrap this up. But I do want to say something. I think it's important that everyone everyone has an important voice here.'",
        "'speaker_1': 'And we're trying to find consensus and we're trying to actually get to something. So this is an important vote. And I know the temperature's rising a little bit, but I want to make sure that we're all being respectful of each other's opinions.'",
        "'speaker_1': 'We have a friendly amendment that's been accepted by both the maker of the motion and that and the second of the motion. And that's right now where the vote is. That is on the motion. On the floor. Councilwoman Mongo.'",
        "'speaker_4': 'Last year when we started this process, many of you heard my personal reservations towards a. A project labor agreement. And like some of my colleagues, I too have gone out and toured some of the facilities, talked with elected officials from neighboring communities.'",
        "'speaker_4': 'And as Westin so clearly pointed out, we don't have a united business front in Long Beach and we need to work on that. And I'm very lucky to have good relationships with members of the business, head of the region, who have some pretty clear ideas that an agreement like this can be beneficial to both labor and business'",
        "'speaker_4': '. I also want to say that throughout the evening today we heard a lot about how Labor keeps our projects on time and on schedule and that they have qualified workers. And we also want to take a moment to acknowledge that even our nonunion businesses.'",
        "'speaker_4': 'Finished projects on time and on schedule and with qualified workers. And we want to encourage them to bid on these projects. And so what I will say is that. Since I was elected, I've always said that I will always give my personal feelings and try to be a leader and stand up from the crowd.'",
        "'speaker_4': 'And I'm also open to learning and growing as a person and listening to my constituents. And in this case, I believe that with the addition specifically of the Long Beach, sort of Long Beach City College certification program and the Jordan ACE program that I hope the Jack will consider expanding to all Long Beach Unified Schools, as so'",
        "'speaker_4': 'many of our jobs programs have been eliminated from our schools, and also that the Jack regularly communicate with Long Beach Unified and LBC and our business partners, whoever we can find them to be and unite them potentially our new Economic Development and Business Coalition created by the Council that as this can be amended regularly, I'm open to'",
        "'speaker_4': 'trying this for Long Beach and seeing where it takes us because we we want our local businesses to also have 40% local hire. And so I'd also like the Jack to consider incentives for businesses that might not all already have all union labor to bid on these projects.'",
        "'speaker_4': 'And I know that in good faith that that will be done and we will review that in our first year. So thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. We're going to go ahead and go to to a vote. I want to make I'm going to make some closing comments and then we're going to vote. First, I want to obviously thank city staff for their hard work.'",
        "'speaker_1': 'I think that a lot of people haven't seen behind the scenes the amount of hours that the city attorney personally, Mr. Parkin, has put in as law, as well as his city attorney team on this issue, including, obviously, Mr. West, Mr. Modica, our entire city management team, and particularly Craig, who's been the lead staff on this issue'",
        "'speaker_1': 'to Mr. Miller and his team. Thank you for for being a partner with us on this. I want to remind us that this has been a process. In 2009, the city approved its first major project labor agreement at Middle Harbor.'",
        "'speaker_1': 'In 2010, the city council approved the airport project labor agreement. In 2012, the city council approved the Gerald Desmond Bridge Agreement in 2012. The City Council also moved forward with the courthouse agreement for our beautiful courthouse. And in 2014, this last year, we had conversations at the Council to move forward with project labor agreements for the Civic'",
        "'speaker_1': 'Center as well as the pool, which happened as we know, which happened last year. I'm proud to have been here and voted in favor of all of those project labor agreements because I believe the project labor agreements provide a consistent level of quality.'",
        "'speaker_1': 'They are able and they give back in so many more ways and what the community receives from the work and the investment you all do in the community. I also want to make sure I mention I know that we talked a lot about the history, but I want to also say a word also about Mayor Foster.'",
        "'speaker_1': 'A Mayor Foster was here and supported these project labor agreements as well when they came forward. And so I want to I want to thank him for his support. So thank you all for being here. I think it's going to be a great day for Long Beach.'",
        "'speaker_1': 'And I know, Ron, I mentioned to you early on that I thought that this would get done. I think this council is really been very thoughtful in bringing us to this place. And so thank you for your work again.'",
        "'speaker_1': 'And I'll call for the vote. Please cast your votes.'",
        "'speaker_0': 'Motion carries seven zero.'",
        "'speaker_1': 'We're going to we're going to take a five minute recess. Thank you.'",
        "'speaker_3': 'You have emotion? Yes, I think.'",
        "'speaker_0': 'Just 5 minutes. 5 minutes back. And it's.'",
        "'speaker_1': 'All.'",
        "'speaker_3': 'Right.'",
        "'speaker_0': 'Luckily I was able to go couple.'",
        "'speaker_6': 'I don't know what he said.'",
        "'speaker_3': 'What else should I ask? No.'",
        "'speaker_0': 'Well, he said 28, but now we're just going to be back.'",
        "'speaker_6': 'Just make.'",
        "'speaker_0': 'Sure I get.'",
        "'speaker_3': 'Her notes and everything. Yeah, yeah. Guess what it is? Yeah.'",
        "'speaker_15': 'And actually know.'",
        "'speaker_6': 'Well, I don't have notes there on my computer. So basically what I said was. So here's what I said exactly. If you want to write it down, then Rex had a recommendation that we have.'",
        "'speaker_3': 'Anyway. Yeah. Anyway. And that's why. Yeah.'",
        "'speaker_9': 'Well, good. Later in the week. Or maybe this week's crazy. Maybe first and next Monday. Give me a call. Talk about me.'",
        "'speaker_3': 'Yeah. Okay. Monday. Just one day. How are you doing here?'",
        "'speaker_15': 'Got. I know, right?'",
        "'speaker_3': 'So you get to name.'",
        "'speaker_15': 'Oh, it's very.'",
        "'speaker_3': 'Exciting. And I like. Right tonight. Right, right. And she said, yes. But I.'",
        "'speaker_6': 'Think she'll be like, oh, it's the.'",
        "'speaker_3': 'Same thing. Right. And.'",
        "'speaker_4': 'Well, the annual. That was our agreement.'",
        "'speaker_3': 'Yeah. Yeah, at that time. Well.'",
        "'speaker_6': 'The only remaining editions would be sent to.'",
        "'speaker_4': 'The joint advisory.'",
        "'speaker_3': 'The joint? Will you as counsel to writing recommendations to a jury in trying to go after group? I know. Yeah.'",
        "'speaker_1': 'Okay. I'm gonna call this meeting back to order. If I can get all the council members come back.'",
        "'speaker_0': 'And review with her.'",
        "'speaker_1': 'Okay. We're going to try to come on back for the rest of the meeting.'",
        "'speaker_0': 'Yeah. I have to admit, I have to do probably another roll call.'",
        "'speaker_3': 'No. Just get out of here. But.'",
        "'speaker_1': 'Madam Clerk, let's do all.'",
        "'speaker_11': 'Right.'",
        "'speaker_0': 'Councilwoman Gonzalez. Councilwoman Pryce. Councilwoman Mango Councilman Andrews. Councilmember Durango. Councilman Austin. Councilmember Richardson. Mayor Garcia.'",
        "'speaker_1': 'Okay. I'm here. We're going to turn back to the regular agenda item 14.'"
    ],
    "Recommendation to authorize City Manager to execute all documents necessary for the First Amendment to Lease No. 14895 with Eleven Golden Shore L.P., a California limited partnership, for City-owned property adjacent to 11 Golden Shore.  (District 2)": [
        "'speaker_0': 'Item 14 Report from City Manager Recommendation to execute the First Amendment to lease with Golden 11 Golden Shore by city owned property adjacent to 11 Golden Shore District two.'",
        "'speaker_1': 'So your staff.'",
        "'speaker_10': 'Yes. Mike Conway, Mayor, members of the City Council, this is a request to extend the term of the lease to accommodate access to the golden shore development. This is Caitlyn's property has no other use than access to the property, but the owners of the property have been so kind as to increase the rent substantially as of the'",
        "'speaker_10': 'end of the term. So I think the city is benefiting this as well. Ready to answer any questions?'",
        "'speaker_1': 'Thank you. Any public comment on the item? Okay. There's been a motion and a second. Please cast your votes.'",
        "'speaker_0': 'Motion carries six zero.'",
        "'speaker_1': 'I think probably the other folks are here for 28. So why don't I take that that next. Uh. Hold on. We just did. But we. We did 19. So why don't I take 28, which I think is the rest of the folks in the audience are here for 28, so let's do it.'",
        "'speaker_1': '28 Madam Clerk.'"
    ],
    "Recommendation to request City Manager and Pacific Gateway to complete a comprehensive study of what a \"Local Hire/FSA\" program would entail and return to City Council within 45 days.  The research for the study should be done with Long Beach community partners including faith based organizations, and non-profits working on these issues.  The report should also include an evaluation and feasibility on a job coordinator for the program.": [
        "'speaker_0': 'Communication from Councilwoman Gonzalez, Councilmember Richardson, Councilman Andrews and Councilman, your recommendation to request the city manager and Pacific Gateway to complete a comprehensive study of what a local higher FSC program would entail and return to City Council within 45 days.'",
        "'speaker_1': 'Councilwoman.'",
        "'speaker_6': 'Yes. I first want to thank my council colleagues, Councilmember Richardson, Councilmember Andrews and Councilmember Otunga, as well as the minister's alliance. I know that from the play we were able to discuss local hire in length. And I think what we.'",
        "'speaker_6': 'One very important thing that we received from that was that we definitely needed a local hire policy or at least review one that was more comprehensive, that looked at not only just the construction industry, but other industries as well.'",
        "'speaker_6': 'And I am a council member that represents the 90813. And I know a lot of us have heard a lot about the 90813 and that it is upwards of 19% unemployment. And it's sad. And so I think this is not, you know, the whole answer to it, but it's certainly a really strong answer to unemployment and tackling'",
        "'speaker_6': 'that and seeing how we can work on that with public development and public dollars. And so I just think my my colleagues for doing that, I think the like I said, the local hire coalition for being a part of this as well and for continuing to work with us.'",
        "'speaker_6': 'And I think we'll be able to build something very strong here. So thank you.'",
        "'speaker_1': 'Thank you, Counsel Councilor Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Thank you, Lina, for bringing this forward. This is this is some might see this as like clean up stuff from the play. But I really think that although this may not have the crowds, this is where the real juice is in terms of hiring our our residents there.'",
        "'speaker_7': 'This would cover not just construction jobs, but service jobs that the city that the city could could look into as well. So I would want to just. The city's city staff have reported anything on this today. Just. Can we hear from Nick?'",
        "'speaker_10': 'Sure. Nick Schultz.'",
        "'speaker_12': 'No, we don't have a formal report for the council. We have had initial discussions related to the play with some of the local groups, the ministerial alliance and some of the council officers. And we look forward to continuing to work with those folks and develop a report within the 45 day request.'",
        "'speaker_7': 'I just want to thank the Council for for moving forward on this. And I want to say that this is an opportunity for us to include a lot of our pre apprenticeship programs, particularly like like the Star program and the Ace Academy and YouthBuild and other other a lot of other programs into this.'",
        "'speaker_7': 'So. So thank you very much. And I encourage the Council to support.'",
        "'speaker_1': 'Not summary Ranga.'",
        "'speaker_11': 'Thank you, Mary. And I also want to thank my council members, my cup, my council member colleagues for including me in this motion, because I think it's more important that we have local agreements that are in line with project labor.'",
        "'speaker_11': 'Agreements mean that's how we get to be successful. And so I'm fully supportive of this and I'm looking forward to working again with our community groups and with the faith based groups. Faith based groups. Got a little list there.'",
        "'speaker_11': 'Some fun to work on this. Thank you very much.'",
        "'speaker_1': 'Thank you. Councilwoman Monk.'",
        "'speaker_4': 'I just wanted to make sure that this includes all types of jobs in the community, not just our labor jobs, but all of our local businesses. The benefit to a community where local hire is prevailing is not just in having your local residents have jobs, but also in the reduction of the commute for the whole region, the'",
        "'speaker_4': 'reduction of pollution for the whole region. So I just want to make sure that we look at incentives also for our local businesses to hire local and what percentage of their payroll would be local.'",
        "'speaker_1': 'Okay. Thank you. See no other comments. Is there any public comment on the item? Please come forward.'",
        "'speaker_9': 'Very good. Kirk has the address. I would suggest that if any outside were to look, follow this council meeting. And if you listen to the previous long three hour discussion on this other item and this, it would be positive proof that this is a dysfunctional organization where the left hand doesn't talk to the right hand.'",
        "'speaker_9': 'All of these have merit. This. This argues well for the fact that you jumped the gun. Because this could have it's actually this would mean more than just cleaning up. This could be an essential part of and should have been an essential part of Murray's right in.'",
        "'speaker_9': 'Without what you spent 3 hours talking about. I would suggest the left hand get to the right hand. And with all the money that this city is spending on communication, it would seem to me that you should start talking, communicating to each other.'",
        "'speaker_9': 'Let the left hand know what the right hand is doing. This has considerable merit, as does the other. There's no sense in horsing around and setting up two committees to commissions and wasting further time to do it. So I would suggest that we need some.'",
        "'speaker_9': 'Again, it goes to the issue. We need some better direction from the leadership of this city. Thank you.'",
        "'speaker_1': 'Next speaker.'",
        "'speaker_8': 'Good evening. Derek Simpson, again, executive director of Long Beach County Action Partnership. Though I've learned a lot in my life this last two months in this process has been quite the experience and education in terms of how we can do better about jobs in our community.'",
        "'speaker_8': 'And it's been because of, as the councilwoman said, the openness and the opportunity to sincerely share information in a way that we could make meaningful and sustainable decisions in our community. I want to thank you again for bringing this item to the agenda of the council tonight, because, as Mr. Richardson said, this is the juice.'",
        "'speaker_8': 'This is where I use the analogy as I was trying to understand how I could articulate it to you. I just recently bought a really, really nice camera and it does everything that I wanted to do, but I don't know how to make it do it.'",
        "'speaker_8': 'And I think that by reading my manual and understanding steps one through ten to get through any given process, it helps me get some absolutely wonderful pictures. I think in this case, with that play being a wonderful document, this indeed historic.'",
        "'speaker_8': 'This particular local hire policy will help us as a community understand how we get the results that it was intended to provide us as a community. So we really hope that we have that continued seat at the table to understand how this policy will help us understand better the play's implementation in our community and make the impact'",
        "'speaker_8': 'that it was intended to make. We want to ensure that each of you know that we're willing to share whatever information that we have and work with you to make this what it was intended to be. And thank you for bringing it this far with the support of your staff here at the city.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_14': 'Good evening, Alexander Hanham with the Legal Aid Foundation and the local hire coalition. In his recent State of the City address, Mayor Garcia encouraged businesses to invest in Long Beach and hire local residents. And with the play and with this agenda item, I think the council and the city have signaled that they're prepared to make that same'",
        "'speaker_14': 'investment. So we thank you for that and we're excited about that. We look forward to working with the Council to refine this policy to make sure that we can maximize that investment and the benefits to the city of Long Beach.'",
        "'speaker_14': 'Um. The local hiring policy can work if it's a three part policy, which includes a first class hiring program, local hiring policy for play construction and local hiring for non play construction. We're very excited about the possibility of a first source hiring program.'",
        "'speaker_14': 'Um, first source hiring can be a great way to, uh, give good jobs in certain sectors to local residents like the service industry. Like retail. Um. First force hiring cannot be used in conjunction with a play. Because unions are under legally binding agreements in the way that they hire for for a certain job.'",
        "'speaker_14': 'Um, if unions try to circumvent those agreements, then it can subject them to liability. They can violate their agreements. So it's important, in addition to the first source hiring, to have a play specific hiring policy to resolve the remaining questions that need to be answered to ensure that Long Beach residents get the maximum benefits from the play'",
        "'speaker_14': '. Um, for example, the policy can spell out the requirements that a resident would need to, um, to qualify as a local resident or as a disadvantaged worker. Um, in addition, and more importantly, the policy can lay out the procedure that contractors must go through, um, to try to hire Long Beach workers before they open up jobs to'",
        "'speaker_14': 'residents of other cities. So before moving from Tier one to Tier two, what does a contractor have to show, have to demonstrate that they have done. Um, to try to fill those jobs that Long Beach residents. Um, it's our understanding that this policy will include a first class hiring program for non construction jobs as well as a'",
        "'speaker_14': 'program for play and non play construction jobs. Um, so we respectfully request clarification on that point. Um, but we're excited to work with the Council on this policy and we thank you for agenda item. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Ernest Roberts again, I think it's great that you guys are looking into the jobs coordinator role in a in a policy. I think that's very important. I can tell you that as has in our work in Los Angeles, we probably put something like 1700 people into the trades, into the various construction trades, the L.A. County building trades'",
        "'speaker_9': 'and the Carpenters. Um, and the processes in the policy would have to be really clear. I understand that there's been some confusion about the first horse, first horse hire and construction trades, and the first are does not work with union contractors.'",
        "'speaker_9': 'So even if the project is at $500,000 a union contract, it will still not be able to pull somebody off of a list. They're still going to have to go to the trades and get a dispatch. There's a lot of detail in this thing, but I think I'm glad that you're looking at this and I encourage you'",
        "'speaker_9': 'to to use whatever expertize you can you can get your hands on. There's a lot of expertize here within our coalition and and in labor to help you figure this out. A clear process of how the trades are going to move, I mean, move to get people from these colleges.'",
        "'speaker_9': 'You know, the apprenticeship programs are training programs in and of themselves. They generally don't need a lot of apprenticeship training. But I do understand that that's what you guys are doing and that's fine, but at least have a clear process of how that's going to happen and that's what the policy will do or does.'",
        "'speaker_9': 'So there's two parts to the policy as we see it, because the first horse hire stuff and then there's the stuff that deals with the construction trades and how that process, how the outreach, how the how the, how the, the network of agencies is going to contribute to this to the to this pipeline, which is why the'",
        "'speaker_9': 'pastors got involved in the first place. It's not unusual for them to see a lot of their congregation with significant issues that need need help in this area. That's why they're here. So just make sure that it happens.'",
        "'speaker_9': 'Also, for purposes of transparency, it might not be such a bad idea to think about having somebody from the community, somebody as knowledgeable about this as one of that six member panel for the oversight for the for the project labor agreement that will give some transparency, give some assurance to the to the pastors and the rest of'",
        "'speaker_9': 'the community that this process is open and clear. Thank you very much.'",
        "'speaker_1': 'Thank you. And I think our last speaker.'",
        "'speaker_4': 'Hello. Council Honorable Mayor Janine Pearce with Lane, Los Angeles Alliance for New Economy. I just want to applaud you guys for your vote earlier and applaud you for taking items. This item number 28, we would just like to to say that we encourage us to look at a robust jobs program to ensure that our plan is really'",
        "'speaker_4': 'successful. And we'd really like to see a pre apprenticeship program that has a proven track record used as a model for what we can custom make for Long Beach. We want to ensure that low income residents are prioritized, as you already have.'",
        "'speaker_4': 'And and, of course, veterans making sure we have a carve out for that. At Lane. We have a proven track record of working with organizations like the Hospitality Training Academy as well as L.A. Trade Tech. And we would definitely like to work with Pacific Gateway in trying to make sure that our pipeline in Long Beach is strengthened'",
        "'speaker_4': 'to make sure that building trades can be successful. And not just in those industries, but also in the tourism industry where we, you know, have raised standards there. But we need to make sure that we're getting local residents into those jobs.'",
        "'speaker_4': 'And so I just applaud you guys and look forward to working with you on this.'",
        "'speaker_1': 'Thank you. Thank you very much, everyone, for coming in. We're going to turn this back to the council count tomorrow. Yes.'",
        "'speaker_2': 'Yes. Thank you. You know, I think especially in my district, I think without a doubt, the residents in this district, you know, that need the programs like this to get a jumpstart. And that's the needed to in order for them to succeed.'",
        "'speaker_2': 'So, you know, this is absolutely one of the ways that we can create, I think, really great jobs and thank all the our culture people bringing this to the diocese. Thank you again.'",
        "'speaker_1': 'Thank you. Councilman Ringa.'",
        "'speaker_11': 'Yeah. I, too, want to thank staff applicants for. However, what I've heard a lot about tonight is the input from the community in regards to not only the play, but the stadium as well. And what I'd like to see it for.'",
        "'speaker_11': 'From here forward, the next 45 days, your staff can reach out to the ministers, your clients to lean to. I mean, they're getting older. It's like, okay, thank you. To reach out and include them in this discussion because I think it's very important that we be as inclusive and transparent as we possibly can in this process.'",
        "'speaker_11': 'So I would encourage staff to please reach out to these other community groups that are in the audience as well and include them in the discussion.'",
        "'speaker_1': 'Thank you. We're going to go and go now to a vote. Obviously. Thank you to all the community that's been working on this. I know there's been a lot of a lot of meetings and hours and an interest.'",
        "'speaker_1': 'And I think just so that the community knows that things are important to note, that I think that we actually have a for us on the city side, we have an all star team on this. And I think we're all been very impressed with with Nick Shultz and his ability to do this.'",
        "'speaker_1': 'And I think he's very excited about the opportunity to bring something forward. And so we want to wish him and his whole team a lot of luck as we put this thing together. So with that is going to take a vote.'",
        "'speaker_0': 'Motion carries seven zero.'",
        "'speaker_1': 'Thank you. And now we're going to go ahead and go to 15.'"
    ],
    "Adopt resolution consenting to inclusion of certain properties within the jurisdiction in the California HERO Program to finance distributed generation renewable energy sources, energy and water efficiency improvements, and electric vehicle charging infrastructure, and approving the amendment to a certain joint powers agreement thereto.  (Citywide)": [
        "'speaker_0': 'Item 15, report from City Manager Recommendation to adopt three resolutions. First, to join the Victory Pace program. Second, to join the California first program. And number three, consenting to to inclusion of certain properties within the jurisdiction in the California Hero program.'",
        "'speaker_1': 'It was emotion, motion, a second and public comment. CNN. Please cast your vote. Oh. Was your public comment? Yeah. Please come forward.'",
        "'speaker_11': 'I thank you, Mr. Mayor.'",
        "'speaker_8': 'Thank you. Members of the council. My name is Alex Mitchell. I represent the hero program. Just wanted to let you know that the hero program.'",
        "'speaker_11': 'Has been in California for the last three and a half years. We're in.'",
        "'speaker_12': 'Over 20. We're in 28 counties, and we've completed over 29,000 energy efficient projects to make homes.'",
        "'speaker_8': 'Greener and more energy efficient.'",
        "'speaker_11': 'And this includes anything.'",
        "'speaker_8': 'From solar to water.'",
        "'speaker_12': 'Efficiency. We've done.'",
        "'speaker_8': 'Almost.'",
        "'speaker_12': '$550 million in home improvements.'",
        "'speaker_8': 'And just in water.'",
        "'speaker_11': 'Alone, because that is a very important, timely issue.'",
        "'speaker_8': 'We have saved over 5.'",
        "'speaker_12': 'Billion gallons of water in homes and that's equivalent to 16 million showers. If you have any questions in regards to this issue.'",
        "'speaker_11': 'Please let me know. Thank you so much for taking this to council.'",
        "'speaker_1': 'Thank you. Next item, please.'",
        "'speaker_2': 'Cast a vote.'",
        "'speaker_1': 'Oh, with the vote. Sorry, it is late. Okay, let's go and take a vote.'",
        "'speaker_3': 'Mm hmm. Yeah.'",
        "'speaker_0': 'So motion carries seven zero.'",
        "'speaker_1': 'Okay. Next item.'"
    ],
    "Recommendation to adopt resolution to authorize City Manager to participate in a Joint Land Use Study (JLUS) with the United States Department of the Navy, and provide up to $16,000 in in-kind services as the Citys portion of the JLUS cost-share agreement.  (Citywide)": [
        "'speaker_0': 'Item 16. Report from City Manager. Recommendation to adopt resolution to participate in a joint land use study with the United States Department of the Navy and provide up to 16,000 and in-kind services as the city's portion of the cost share agreement citywide.'",
        "'speaker_1': 'There's been a motion and a second. Is there any public comment on the item? Yes, sir.'",
        "'speaker_9': 'Very good. You. I have not had an opportunity to check the staff report. What type? What areas are we talking about? What coastline are we talking about?'",
        "'speaker_1': 'Well, as you know, you know, you don't get to ask questions of staff. So what I will do, though, be security just because I'm in a good mood. Mr. West, do you want to just do a you can take a seat and I'll call you back up for the rest of your.'",
        "'speaker_10': 'Sir Diana Tang will give a quick report.'",
        "'speaker_4': 'Mayor, members of the city council, the Joint Land Use Study is a partnership.'",
        "'speaker_6': 'With the Department of.'",
        "'speaker_4': 'Defense. It's a cooperative planning effort, actually, between.'",
        "'speaker_6': 'The military installations.'",
        "'speaker_4': 'So in our case, Naval Weapons Station, SEAL Beach on the Pacific coastline by Long Beach and.'",
        "'speaker_6': 'SEAL Beach, California, and the surrounding community. And it's designed to promote community growth and development that is compatible with an installation's training and operational missions.'",
        "'speaker_1': 'And we do these types of joint land use studies often. So it's a it's pretty routine for us. Okay. Please continue your public comment.'",
        "'speaker_9': 'I still have a.'",
        "'speaker_1': 'Sometimes I just continue to get clarification.'",
        "'speaker_9': 'So we are not talking about any actual coastline. Within the jurisdiction of the city of Long Beach at this time, is that correct?'",
        "'speaker_1': 'Well. Mr. SINGH.'",
        "'speaker_6': 'Sure, Mr. Mayor. The city's interest in the study is actually related to the explosives in Grange on the east end of the Long Beach breakwater.'",
        "'speaker_4': 'And we're hoping that through the Joint Land Use.'",
        "'speaker_6': 'Study, we'll be able to obtain some information that may be able to supplement our East San Pedro Bay ecosystem restoration study. And so the study is mainly focused on naval weapons station SEAL Beach, which is primarily in.'",
        "'speaker_4': 'The city of SEAL Beach, in the county of Orange. But we are interested in explosives in large piece.'",
        "'speaker_6': 'Of it, which is.'",
        "'speaker_4': 'Off the Long Beach coastline, but not on the Long Beach coastline.'",
        "'speaker_9': 'Seaward landward of the sea, seaward or landward.'",
        "'speaker_1': 'That's it. That's it. No more questions. Finish your.'",
        "'speaker_9': 'Public comment and.'",
        "'speaker_1': 'Continue.'",
        "'speaker_9': 'I want to make sure that we're not. Doing anything yet with great water, which eventually we will. I'm very concerned about doing anything that might. Engender the need for mitigation someplace else. You can't step. Any place. Can't do anything in the coastline.'",
        "'speaker_9': 'Without it having a impact someplace else within our coastline. And I want to know where that is. If we don't know, say something. Just say we haven't the faintest idea what we're doing. But what you need to understand and what so many people fail to understand if you move a square foot of terra firma on the sea'",
        "'speaker_9': 'floor over here, it impacts it over there. You disturb and ruin. Marine habitat. And then you have to replace that at a 2 to 1 ratio someplace else. So I want to make sure that when you're walking down and you're tearing up or it looks boring and decide we're going to build something here.'",
        "'speaker_9': 'What's the impact at the other end of the pike, as it were, or the other end of the break? We're. Please consider that we can't afford more buffoonery. Thank you.'",
        "'speaker_1': 'Please cast your votes.'",
        "'speaker_0': 'Ocean carries seven zero.'",
        "'speaker_1': 'Thank you and excited.'"
    ],
    "Recommendation to approve the Revolving Loan Fund Program Administrative Plan (Plan) required by the Economic Development Administration; and  Adopt resolution authorizing Economic Development Commission to designate three of its members as the Revolving Loan Fund Committee responsible for administrating the Revolving Loan Fund Program under the Plan.  (Citywide)": [
        "'speaker_0': 'Item 17 Report from City Manager Recommendation to approve the Revolving Loan Fund Program Administrative Plan required by the Economic Development Administration and adopt resolution authorizing the Economic Development Commission to designate three of its three of its members as the Revolving Loan Fund Committee responsible for administering the program under the plan citywide.'",
        "'speaker_1': 'Okay. There's a motion any Second Amendment to have. Councilman Price, did you have a question on the staff report on this or.'",
        "'speaker_6': 'Is there a staff report?'",
        "'speaker_10': 'Sure. Mike Conaway. Mayor, members of the city council. This item relates to an update of the revolving loan fund program administrative plan, which is required on a periodic basis by the Economic Development Administration and the establishment of a new r l p loan committee within the new Economic Development Commission.'",
        "'speaker_10': 'So as background, access to capital has always been kind of challenging for small and minority owned businesses, and in 1987, the city established its first loan program to address this issue. And since then, the city has been able to leverage its funding capacity through collaboration and partnerships with local banks, advantaged Certified Development Corporation and the National Development'",
        "'speaker_10': 'Council. The Revolving Loan Fund has been in place since 2001 with seed money from the Economic Development Administration, Community Development BLOCK Grant funds and enhanced with RDA funds. And since since its inception, the program has facilitated 52 loans totaling $4,256,000, with $1,000,000 currently outstanding and about 1.3 million available for programing.'",
        "'speaker_10': 'And most recently, the Department of Economic and Property Development assisted in the funding of a small business loan of $95,000 to beachy cream to expand and relocate its organic ice cream sandwich business from Santa monica to Long Beach.'",
        "'speaker_10': 'So since the demise of the redevelopment agency, this program has somewhat of been suspended for a certain period of time with the establishment or reestablishment of the Economic Development Commission. We're looking forward to referring this program to that commission so we can jump start it again and start engaging with our small business community.'",
        "'speaker_1': 'Catch them in.'",
        "'speaker_6': 'Appraisal? Yes. So what types of programs are improvements can businesses receive this loan for? Is there a limitation?'",
        "'speaker_10': 'Councilmember Price, members of the City Council, these are traditionally focused on three locations that would be for assets, for working capital and for inventory. So machinery, essentially machinery, equipment assets are inventory and working capital as well. We steer clear of construction loans as it triggers prevailing wage.'",
        "'speaker_10': 'And we limit our loans to $95,000 through the revolving loan fund, through the committee. And then anything over $1,000 comes to the city or $100,000 comes to city council.'",
        "'speaker_6': 'Is there any room for expanding the uses that would qualify under the loan? And I know you said you're excluding construction, but I know that there used to be years ago loans that allowed them to re face the facade or risk in their particular business, location or storefront.'",
        "'speaker_6': 'Is it possible that that could be included in this?'",
        "'speaker_10': 'That's absolutely included. That's correct.'",
        "'speaker_6': 'Okay. And how do we notify businesses of this opportunity when a new business applies in the city of Long Beach? Do we give them any materials or information about this?'",
        "'speaker_10': 'We have we do have handout materials. Our marketing efforts have been somewhat hamstrung in the last 18 months to two years. We have engaged the Grow America Fund group to assist in our marketing and assist in the processing of applications.'",
        "'speaker_10': 'We're hopeful that our partnering with Grow America and other funding agencies will allow us to market this more under the city of Long Beach. So right now it's mostly handout material. But as we start to engage in the economic and Property Development Department, we'll start bringing these these tools to the forefront.'",
        "'speaker_6': 'Great. Thank you.'",
        "'speaker_1': 'Thank you. And Mr. Conway and Mr. West, will you make sure to add this? I mean, this one is one of the great things that we do, obviously, at the city. I know we're going to be having an economic development study session that was being planned here in the next couple few weeks.'",
        "'speaker_1': 'Let's make sure that there's this is part of that discussion as well as as well as all the other programs that we provide business and then the marketing efforts that we're and how we're letting business know of what we're doing as well.'",
        "'speaker_1': 'Okay. There's a motion on the floor. I have some speakers. Does the maker of the motion want to say anything for Mr. Andrews or want to go down the speaker's list? Okay. Councilmember Austin.'",
        "'speaker_8': 'Thank you. I just had a really one one question regarding the roll off committee and how would that be selected and how would they be selected?'",
        "'speaker_10': 'When we meet with the Economic Development Commission tomorrow, they will be selecting a chair and a vice chair and we will be bringing back to that commission, hopefully at their subsequent meeting or request for them to select the relief committee meetings.'",
        "'speaker_10': 'Members, I'm sorry. There is some guidelines as to who should be included on that relief committee. And typically it would involve one local business owner, another member with commercial lending experience, hopefully with a local bank. And those two requirements are a requirement of the revolving loan fund administrative plan.'",
        "'speaker_10': 'And then the third member can be essentially who the commission selects. So it'll be a three member, our committee.'",
        "'speaker_8': 'Okay. I see that that it's going to be a three member committee. And I think it says that they have business or related experience in areas such as banking, accounting, education, trade, tourism, law, technology, real estate or manufacturing.'",
        "'speaker_8': 'It's pretty broad. Pretty broad. And I think our Economic Development Commission pretty much reflects that. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Margo.'",
        "'speaker_4': 'I just wanted to thank the members of the community and the lending organizations that I'd met with recently and their enthusiasm for this exciting program. So thank you.'",
        "'speaker_1': 'Thank you. Public comment, which we would probably comment on this one or yet? I don't think so. In a public comment case saying none, please cast your votes.'"
    ],
    "Recommendation to adopt Specifications No. RFP PW14-050, and authorize City Manager to execute all documents necessary to enter into agreements with Environ Architecture, Inc. of Long Beach, CA; Gillis & Panichapan Architects, Inc. of Costa Mesa, CA; Kardent Design, Planning & Management of Long Beach, CA; and Westgroup Designs, Inc. of Irvine, CA, for as-needed space planning services in an aggregate amount not to exceed $500,000 over a three-year term, and to execute any necessary amendments to the agreements, relative to extending the terms for up to an additional one-year term, changing the contract dollar amounts, authorizing additional services, if required, within the provisions of the agreements, and adjusting the fee schedules for inflation, all provided that the aggregate total amount of contract authority is not exceeded.  (Citywide)": [
        "'speaker_0': 'Motion carries seven zero 18. Item 18 Report from City Manager and Financial Management Recommendation to enter into four agreements for as needed space planning services in an aggregate amount not to exceed 500,000 over a three year period. Citywide.'",
        "'speaker_1': 'Okay. This is. I'm sorry. This is. I mean, you don't get any public comment on the item. Please come forward. There is a motion in a second by Andrews in Austin.'",
        "'speaker_9': 'Very good. Hugh Clark has the address. Will someone please explain why we have to spend over a half a million dollars to figure out whether or not essentially something fix fits? I'll give you a tape measure. Go down for the Ace Hardware, pick up a tape measure for $2 and you can measure it yourself.'",
        "'speaker_9': 'If you're telling us that the management of this city doesn't have the capacity to take a tape measure and measure something out or measure whether or not something fits or how much space. We certainly don't have to. You know, it's a again, an indictment of the city.'",
        "'speaker_9': 'If we have to spend a half a million dollars to find out if something fits or not or plan to have something fit, which is absurd on its face, it's a further urination of money, which is our biggest problem.'",
        "'speaker_9': 'We don't face so much of a shortfall of money. It's a shortfall of common sense.'",
        "'speaker_1': 'Give us a motion or a second, please cast your vote.'",
        "'speaker_0': 'Councilwoman Price. Motion carries seven zero.'",
        "'speaker_1': 'I don't. 20.'"
    ],
    "Recommendation to adopt Specifications No. ITB FS15-040 and authorize City Manager to execute a contract with Kovach Mobile Equipment Corporation, dba KME Fire Apparatus, of Nesquehoning, PA, for the purchase of six fire pumper trucks, in a total amount not to exceed $3,400,463 inclusive of taxes and fees; and  Increase appropriations in the Fleet Services Fund (IS 386) in the Financial Management Department (FM) by $1,134,803.  (Citywide)": [
        "'speaker_0': 'Item 20 Report from Financial Management Recommendation to execute a contract with KMT fire apparatus for the purchase of six fire pumper trucks in a total amount not to exceed 3,400,000 and increase appropriations in the Fleet Services Fund in the Financial Management Management Department by 1,100,000 citywide.'",
        "'speaker_1': 'Mr. West, I want to appreciate the Council. Know what this is? This is a good thing.'",
        "'speaker_10': 'This is a very good thing. And I'm going to turn this over to our fleet manager down to Berlin, who can explain why it's such a good thing for our fire department and our community.'",
        "'speaker_11': 'Mayor Garcia, Members of Council. This is a.'",
        "'speaker_9': 'Contract with Kovach mobile equipment to purchase six fire trucks. New fire pumpers. Four fire pumpers were originally scheduled for a replacement this year at Fire's request.'",
        "'speaker_11': 'And noting that two of the pumpers in service had deteriorated during the year, we added two more for a total of six. The selected.'",
        "'speaker_14': 'Vendor, Colebatch, agreed to provide the same.'",
        "'speaker_11': 'Pricing for the additional units. Fire pumpers have a useful life of six years.'",
        "'speaker_14': 'There are currently 15 fire pumpers.'",
        "'speaker_11': 'In the city's fleet and these six that are being requested for replacement now were scheduled for 2015 and 2016 fiscal years. The current fire pumpers are 20 years old. And the cost and downtime have been mounting excessively. I'll take any questions.'",
        "'speaker_1': 'Okay. Thank you. Seeing no questions. There's a motion and a second. Members, please go ahead and cast your vote. Should we do public comment on this public comment saying nonmembers, please cast your vote.'",
        "'speaker_0': 'Come to in Austin. Seven zero. 21 Item 21 Report from Financial Management Recommendation to amend Contract with Daniels Tire Service and Sudduth Tire Company for the purchase of vehicle tiger tires to increase the annual contract amount by 130,000 citywide.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement with the Los Angeles County Metropolitan Transportation Authority (Metro) in the amount of $260,800, all other documents necessary to accept, expend and administer the funds, and any necessary amendments thereto; and  Increase appropriations in the Capital Projects Fund (CP) in the Public Works Department (PW) by $260,800.  (Citywide)": [
        "'speaker_1': 'Next item.'",
        "'speaker_0': 'Item 24 Report from Public Works. Recommendation to execute an agreement with the Los Angeles County Metropolitan Transportation Authority in the amount of 260,000 and increase appropriations in the Capital Project Fund in the Public Works Department by 26,000 citywide.'",
        "'speaker_1': 'Okay. There's been a motion and a second. Customer. Austin, do you want to speak to your motion at all?'",
        "'speaker_8': 'Sure. I just wanted to just encourage our full support for this particular item. We're really excited about this this grant from the MTA to put on a fantastic Open Streets event. It's unprecedented in the city of Long Beach.'",
        "'speaker_8': 'It is the route. It will be along Atlantic Avenue from Wardlow all the way up to Halton Park, and it will encompass three council districts. I'm looking very much forward to working with the Council District seven and nine, but with the entire city to make this a an amazing event.'",
        "'speaker_8': 'It's going to promote people to get out of their cars and on bikes. It's going to promote sustainable lifestyle, living throughout our community, something consistent with what we've been doing. And in my district and in other districts throughout the city for for for several years now.'",
        "'speaker_8': 'This is a culmination. We're thrilled to have received this grant. And and it was a competitive grant. We actually beat out other areas throughout Southern California. They picked uptown Long Beach because of the exciting, exciting things that are going on in our community today.'",
        "'speaker_8': 'This is going to happen on June the sixth. You know, and I want to announce first Fridays. It's going to be June the fifth. And so it's going to be a lot of activity, particularly in the uptown communities.'",
        "'speaker_8': 'And I know Councilmember Urunga and Councilmember Richardson are are excited about this and working with our business improvement districts, the BCP, BIA, as well as the uptown bid to make this a and many neighborhood organizations to make this a fantastic event.'",
        "'speaker_8': 'So look forward to June the sixth and I hope you all can support this.'",
        "'speaker_1': 'Thank you, Councilman Richardson.'",
        "'speaker_7': 'I think Councilmember Austin said it best. This is a really exciting opportunity for us. We're really looking forward to June six. So I would encourage the entire city to come out. In a few weeks, we're going to do a joint council presentation with more specifics on what you can expect at Uptown Beach Street.'",
        "'speaker_7': 'So we're looking forward to that. Thank you.'",
        "'speaker_1': 'Thank you. Any public comment saying please cast your votes?'",
        "'speaker_0': 'Councilwoman Mango. Motion carries seven zero. Next Item Item 25 Report from Public Works and Financial Management. Recommendation to award ten contracts for as needed traffic engineering, transportation planning and related technical and professional services. And enter into an agreement in an aggregate amount not to exceed $5 million for a three year term citywide.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to increase Contract No. 32995 with C.S. Legacy Construction, Inc., by $690,254, for a total not-to-exceed amount of $8,700,000, for additional work required in constructing the Chittick Field project;  Increase appropriations in the General Fund (GF) in the Citywide Activities Department (XC) by $590,580; and   Increase appropriations in the Capital Projects Fund (CP) in the Public Works Department (PW) by $590,580.  (District 6)": [
        "'speaker_0': 'Report from I'm sorry. Item 26 Report from Public Works, Financial Management, Parks, Recreation and Marine Recommendation to increase contract. With see as legacy construction.'",
        "'speaker_3': 'How do you guys keep pushing? I don't mind.'",
        "'speaker_1': 'The raw emotion in a second. There's emotion. I say any public comment saying non-police concern. Did you want to say a few words?'",
        "'speaker_2': 'Just a few. I just want to thank, you know, the Parks and Public Works director, Mr. Aurora, as well as the park director, George Champion for the section work. If you guys have a chance to go by J.T. Feel, you will see the kids out there running track playing, you know, practice and football.'",
        "'speaker_2': 'And it's very exciting and I am very thankful for this extra money that we're saving. Thank you. I like the move to approve Councilor Brosnan.'",
        "'speaker_1': 'Just a comment.'",
        "'speaker_8': 'Yeah, just wanted to to cosign on this. I seconded the motion and and I think this is this is worthwhile. I certainly will support it. I have spent a lot of time over to the field over the last few months.'",
        "'speaker_8': 'And I see hundreds of kids and families and young people out there walking the track. I'm taking full advantage of this fabulous new facility park in our in our in our city. And so this is a great resource.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_1': 'Thank you. Please cast your votes.'",
        "'speaker_0': 'Motion carries seven zero.'",
        "'speaker_1': 'Okay. Next up is item 27.'"
    ],
    "Recommendation to respectfully request City Manager and staff to analyze the City's current RFP process, review RFP processes used by other entities, and report back within 90 days regarding recommendations to improve the City's procurement process.": [
        "'speaker_0': 'Item 29, Communication from Councilwoman Price, Councilwoman Gonzalez, Councilman Richardson and Councilwoman Mongo. Recommendation to respectfully request the city manager to analyze the city city's current RFP process review RFP process used by other entities and report back within 90 days regarding recommendations to improve the city's procurement process.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_6': 'Thank you. This is an item that basically requests staff to come back with some ideas on how we can improve our RFP process. We want to make sure that we have a very healthy and robust bidding process and that the scope of work that we put out there is relevant and accurate so that we have the best'",
        "'speaker_6': 'and most responsive bids. I also want to make sure that we take a look at our appeals process and determine whether or not we're giving folks sufficient time to appeal the process if they were not selected. Basically looking for efficiencies and ways to improve our RFP process.'",
        "'speaker_6': 'So I want to thank staff in advance for coming back to us with some recommendations.'",
        "'speaker_1': 'Thank you, Councilman Mungo. Second.'",
        "'speaker_4': 'As I mentioned at a prior council meeting, I feel that it's really important that more Long Beach contractors are encouraged to participate in this process. Specifically, we had a contract early on in our tenure where we were purchasing vehicles from outside the city and we were losing out on that.'",
        "'speaker_4': 'Sales tax revenue and that variance between the winning bid and the next bid was greater than we what we would have received in that sales tax revenue. But it's. Critical that Long Beach businesses have a fair stab at these events.'",
        "'speaker_4': 'So what we want to do is make sure that that's happening. So thank you very much. And I look forward to seeing a Long Beach component to this requirement.'",
        "'speaker_1': 'Thank you, Councilman Gonzales.'",
        "'speaker_6': 'Yes. Thank you. I wanted to thank Councilwoman Price for bringing this forward. I actually was on the same wavelength because I was going to bring something forward in relation to local preference, which I already know we have. But I just had a question about the specific local preference item that we already have.'",
        "'speaker_6': 'It says a ten. It's basically Long Beach businesses get a 10% reduction. Can you explain that a little bit so I can understand that more clearly?'",
        "'speaker_10': 'Yes, Councilmember, this goes primarily for when we're buying good when we're buying things or things like tires and things like that, goods, goods, not services or consultant work. But we get I think it's up to $100,000 will provide a 10% preference to the local hire.'",
        "'speaker_10': 'So someone from a local business is 10%.'",
        "'speaker_9': 'Over the lowest bid. Then we'll go with the local hire.'",
        "'speaker_6': 'Okay. Do you think that because I know other cities have utilized a 2%, I guess like contingency. So if they're within 2% of the bid, then it would go to if it was like an out of city pers out of city business in Long Beach.'",
        "'speaker_6': 'If, uh, if, if Long Beach was within 2%, then it would go to Long Beach.'",
        "'speaker_10': 'Right now we're going 10% instead of 2%. So. But we can certainly come back and look at other other things that we could do to encourage local business, to give them more of an incentive or more of advantage and things like that.'",
        "'speaker_10': 'And we'll have a be able to discuss what other things we can do working with the city attorney.'",
        "'speaker_6': 'Great. And then what are we currently doing? I know I've asked before, um, as far as outreach because I've kind of gotten a few different answers and I'm not sure as to how we're outreaching to our local businesses for them to be included in the process.'",
        "'speaker_9': 'We'll provide all.'",
        "'speaker_10': 'That. Right now, we don't have our business license person here tonight, but he certainly will be able to do all that. We have Planet Bids. Specifically when we have large items like cars and things like that. If we don't get a bid from Ford and we're buying Ford's, you certainly will call Ford and ask why they didn't'",
        "'speaker_10': 'bid to encourage them to bid those kinds of things. But again, those are certainly things that will outline when we come back to the city council with the report.'",
        "'speaker_6': 'Okay. Thank you very much.'",
        "'speaker_1': 'Councilman Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. So I want to thank my colleagues for bringing this forward. I was you're right. I was approached by multiple council people. So I'm happy to see that they came together on one item. I want to make sure that in this process we explore expanding or maybe we BCB are might more minority owned businesses'",
        "'speaker_7': ', women owned businesses and small businesses. As we increase preference, we explore that as we move forward. I mean, these are critical small businesses in our community. So to make sure that we actually place a value on that. Thanks.'",
        "'speaker_10': 'I do want to respond that we do have a very robust plan for that, and we'll bring it back to the city council if we want to expand it. Many times the low bid doesn't meet those standards, so we'll reject a little bit and then go through as many times.'",
        "'speaker_10': 'Many of our projects have been held up to two, 3 to 4 months going through that process to get.'",
        "'speaker_12': 'The builder that does all that.'",
        "'speaker_10': 'So it's incredibly important to us, so much so that we will delay awarding bids until we get the appropriate vendor.'",
        "'speaker_7': 'Perfect. Thank you.'",
        "'speaker_1': 'Councilman Ringo.'",
        "'speaker_11': 'Take him here. I also want to echo Councilmember Richardson's comments there in regards to maybe Libby. Libby. All those qualified agencies. My concern is that many times the reason we don't have a big pool of applicants into the is because they're unaware or can't complete the pre-qualification process.'",
        "'speaker_11': 'And that is, is that still in existence? Do they have to be pre-qualified before submitting a bid?'",
        "'speaker_10': 'You can submit a bid if you're not pre-qualified, but then you.'",
        "'speaker_12': 'Get qualified throughout the bid.'",
        "'speaker_10': 'So certainly a bid can be rejected if you can't meet the needs and requirements as we go, even if you're the low bidder.'",
        "'speaker_11': 'If we go through that well, I would want to also encourage our potential vendors out there to apply, first of all, and to complete the process of of qualification. Are you do you have pre qualification for bids and are say over a threshold?'",
        "'speaker_11': 'I'd say over 100,000 and or a million or anything above. Is there is there a a threshold that qualifies or disqualifies some vendors from applying? Councilmember I.'",
        "'speaker_10': 'Wouldn't be able to answer that, but those are items we certainly will answer when we come back to the city council in.'",
        "'speaker_11': '45 days. Thank you.'",
        "'speaker_1': 'Councilman Mongo.'",
        "'speaker_4': 'I appreciate Councilwoman Gonzalez's comments. She reminded me of a discussion that her and I had had a while ago. I'd also like to ensure that we look at the contractors that won bids that had incentives for early payment and to insure that or to at least report back to us on what percentage of the time the city'",
        "'speaker_4': 'is able to meet those requirements. Because I know that sometimes you'll have a bid and a contractor will give a 20% discount for early payment. But if the early payment requirements are so stringent that the city can't meet those requirements, then we could theoretically be stuck with paying a higher price.'",
        "'speaker_4': 'So if that could be included in the report, it would be appreciated.'",
        "'speaker_10': 'Absolutely.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you for that and the other public comment. CNN Please cast your vote.'",
        "'speaker_0': 'Motion carries seven zero.'",
        "'speaker_1': 'Next item.'"
    ],
    "Recommendation to authorize City Manager to execute any and all documents necessary for a license between the City of Long Beach and the Sares-Regis Group for the short-term use of former Airport Lot D for a Long Beach Auto Tent Sale on May 15 through May 17, 2015.  (District 5)": [
        "'speaker_0': 'Item 30 Communication from Councilman. Councilman. Councilwoman. Mango. Councilwoman Gonzalez and Councilman Urunga. Recommendation to execute any and all documents necessary for a license between the City of Long Beach and the Sarris Regis Group for a short term use of former airport Lot De for a Long Beach ordered tent sale on May 15 through May 17th.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'Jasmine Mango.'",
        "'speaker_4': 'As many of you know, I'm very passionate about working with our local retailers to ensure that Long Beach is receiving the amount of sales tax revenue annually that we should be receiving. Should Long Beach residents shop in Long Beach?'",
        "'speaker_4': 'What we have discovered is that in the car sales category we are significantly lacking. One of the things that we've done is we've brought together all the Long Beach car dealers and started a dialog among a dialog among them.'",
        "'speaker_4': 'And they have agreed that on the weekend of May 15th through 17th, they're going to do a regional car sale right here in Long Beach. And all of the revenue from the sale of those vehicles will come back to the general fund in terms of our sales tax percentage.'",
        "'speaker_4': 'So I think this is a big first step in first one, getting all of the car dealers in a room together that are usually competitors. It's been quite a process and I'm really pleased with the collegiality and cooperation among them for everything going from the logistics to the marketing.'",
        "'speaker_4': 'So thank you very much. This has been led by the Southern California Association of Car Dealers. Todd He's done a fantastic job and are major partners with Nick Worthington and Huffman and Timmins and the others. It has been just a rewarding experience and I look forward to them seeing Long Beach as the place where they want to'",
        "'speaker_4': 'do all of their business.'",
        "'speaker_1': 'Thank you, Katherine Gonzales.'",
        "'speaker_6': 'I just want to say thank you to Councilmember Mungo for bringing this forward. It is a really creative way to keep money in Long Beach. And so I just wanted to thank her for that. So.'",
        "'speaker_1': 'Okay. Councilmember Austin.'",
        "'speaker_8': 'Yes. I just want to congratulate Councilmember Mongeau and thank her for bringing this forward. This is innovative and will create a festive environment for people to spend money and hopefully the city will benefit from it. So I know you've been working hard on this for for several months.'",
        "'speaker_8': 'You've been talking about it, and it's great to see it finally come before the council.'",
        "'speaker_1': 'Thank you. The public comment. CNN. Please cast your vote.'",
        "'speaker_0': 'Motion carries seven zero.'",
        "'speaker_1': 'Thank you. We're going to go now to announcements. Cam, just start off. I want to just begin by making an announcement that on April 26, I will be hosting with the Economy of the Pacific, a special abilities evening at the Aquarium.'"
    ]
}