{
    "Recommendation to receive and file a budget update from the City Manager with updated budget shortfall projections and recommendations for addressing the FY17 projected shortfall.": [
        "'speaker_1': 'Communication from Mayor Garcia recommendation to receive and file a budget update from the city manager with updated budget shortfalls, projections and recommendations for fiscal year 17.'",
        "'speaker_0': 'Thank you. I will have some comments at the end of the presentation. But I do want to just begin by saying that we all know that we've known for a while that we have some some years where because of what we're paying into our largely unfunded pension liabilities that we had had some deficits.'",
        "'speaker_0': 'We've been planning for those. We've been working hard to make investments. And through economic development, I think our team has been doing a great job at at eliminating that and lowering that deficit as much as possible. And so I think what you're going to hear tonight is, is some good news that we're moving in the right direction'",
        "'speaker_0': 'and that while we still have a challenge, the challenge is even a little more manageable than we thought it was a few months ago. And so I'm really happy to hear and I think the council will be happy to hear tonight's presentation.'",
        "'speaker_10': 'Mr. WEST Thank you, Mayor and council members. We've been asked to update you tonight on the most recent projections for the fiscal year 16 budget through fiscal year 18. The past three years we've experienced budget stability. However, fiscal year 17 and fiscal year 18 have been projected to have shortfalls.'",
        "'speaker_10': 'Therefore, we have been closely monitoring revenues and expenses, and we do have a preliminary, preliminarily updated outlook for the next three years. The good news is that even though the price of oil is continuing to decline, other revenues have offset this reduction.'",
        "'speaker_10': 'And so instead of facing a $7.5 million shortfall for next year, our preliminary outlook is that we are now looking at a shortfall of 5.1 million.'",
        "'speaker_9': 'We will be taking steps to proactively address this shortfall, which, while difficult, is.'",
        "'speaker_10': 'Manageable compared to the deficits of the past when we were cutting 20 million to $38 million each year. I will now turn it over to Assistant Finance Director Lisa Erickson, who will describe the changes to the three year outlook and the approach we plan to take to address the budget shortfalls.'",
        "'speaker_10': 'Lisa.'",
        "'speaker_1': 'Good evening, Mayor and members of City Council. First, I'm going to start with a review of the current year that for the FY16 budget that we just passed last year, two months ago, it was based on an improving economy and it was balanced as a result of discipline and prudent decisions.'",
        "'speaker_1': 'It contained no service reductions. It also included funding for both police and fire academies. And we are working to maximize the police academy and in fact, are working to conduct two academies in police academies this year.'",
        "'speaker_0': 'Real quickly, I'm sorry, when the announcement it didn't make a case you were here for item 24. Is that item 24 has been withdrawn? I didn't mention that. So I don't want anybody waiting. So 24 has been withdrawn.'",
        "'speaker_0': 'Leah, continue.'",
        "'speaker_1': 'We've also continued to work on outstanding financial issues and cost savings, and the budget included a projected structural surplus of $675,000 and that does appear to be on target. We are carefully monitoring this budget, though, for key revenue and expense items that are impacting the outlook for this year and the next two years.'",
        "'speaker_1': 'So on the revenue side, we have positive revenue impacts that are helping the outlook. Our sales tax is stronger than projected due to economic growth and also due to some economic development agreements, including CRC Services, Office Depot, Human and Worthington.'",
        "'speaker_1': 'We've also had a stronger transit occupancy tax performance due to economic growth and our property tax has higher residual property tax growth from the RTA dissolution. We have the new fee implemented for first responder fee that's helping the revenue.'",
        "'speaker_1': 'And then also we have stronger electric duty and lease revenue from the pike. On the negative side for revenues, our property tax is also being hurt though by low oil prices, which is reducing the value of oil related properties.'",
        "'speaker_1': 'And also our uplands oil revenue is coming in lower because of the reduced price per barrel. On the expenditure side, we have positive expense impacts, including our open space bond debt service, which was going to be a general fund obligation is now going to be paid by RTA city loan repayments per the state.'",
        "'speaker_1': 'And also we are proposing to make our CalPERS stabilization fund contribution in FY 17 by using one time revenues from 15 year end surplus rather than structurally building it in the budget. Negative expense impacts are the R&D termination is causing increase expense in the fire department.'",
        "'speaker_1': 'However, we are anticipating that that would be covered by the first responder fee and if needed, the 15 year end surplus. And then also we have some county park fund funded maintenance. That is because of the ballot initiative.'",
        "'speaker_1': 'Failing last year is now a general fund expense starting in up by 17. We have some assumptions and uncertainties used in this outlook, including the fact that we're assuming CalPERS costs are locked through FY18 and the low investment returns of last year, though, will mean that we are going to be needing to draw down or CalPERS stabilization'",
        "'speaker_1': 'fund in 18. We're continuing to assume that the economy is good, but that is uncertain and difficult to predict. We are now assuming oil at $45 a barrel for 16 instead of 55, which was what the budget was based on.'",
        "'speaker_1': 'And we're looking at $50 a barrel for 17 and 18 instead of 60 and 65. This is also very uncertain and difficult to predict. We're also continuing not to assume any raises or takeaways due to current or upcoming labor negotiations.'",
        "'speaker_1': 'And I should note that the projection will change based on the 6xy 16 status as the year continues and along with any new information. So as as the city manager mentioned, the outlook has improved. We had a surplus in 16 both years and we were looking at a seven and a half million dollar shortfall in 17 and'",
        "'speaker_1': 'an additional $7.8 million shortfall in 18 for a cumulative 15.3 million. We're now looking at a 5.1 million shortfall in 17 and 5.2 million in 18 due to all those revenue and expense impact changes that I described before.'",
        "'speaker_1': 'So that's a $10.3 million cumulative shortfall, which is 5 million better than originally projected. And the fact that we did not spend the 16 temporary temporary surplus does mean that the 17 deficit was reduced from 5.8 to 5.1 million.'",
        "'speaker_1': 'And that amount is not at the level of the cuts that were that were needed during the Great Recession, as the city manager mentioned, which was 20 million or $38 million, depending on the year. And while this fiscal outlook for 16 and 18 is better than the original projection, this is on top of the already cut cuts'",
        "'speaker_1': 'of $134 million in almost 700 positions since I was seven. And we're also looking that it looks like likely that the shortfalls will continue through FY 20 due to continued low oil prices and pension cost increases that were planned.'",
        "'speaker_1': 'And this is a preliminary outlook and it will be updated later and up by 16, and it could change materially at that time. So our approach for the budget is for up 16, we want to be cautious. We are exploring general fund department budget savings targets, which would begin in January in order to ensure that 16 remains'",
        "'speaker_1': 'in balance and to generate funds for one time purposes, including that second police academy cost, which is likely to also need 15 year end surplus funds as well. And then we're looking. These cuts would be in order to help prepare for FY17 by initiating some savings.'",
        "'speaker_1': 'Now, that could help to balance fiscal year 17 and beyond. 417 Our approach is to allow no service enhancements without offsetting reductions, to continue to develop efficiencies and cost reductions to focus our one time expenditures on reducing cost and meeting critical needs.'",
        "'speaker_1': 'To focus on economic development. To continue to grow that our revenue base and identify potential new revenues and develop approaches to meeting any reduction targets that are needed. And we're going to also be working with our employees to secure fair agreements that recognize the value of our employees while also addressing our fiscal realities.'",
        "'speaker_1': 'So in summary, in our next steps, as Long Beach is projected to do better than earlier anticipated, but we must continue to take steps to address this new economic reality. And we need to reduce our expenditure growth to match that limited revenue growth.'",
        "'speaker_1': 'And this preliminary budget projected shortfall of 5.1 million equates to 1.3% of the departmental budgets. And while this is difficult, it is manageable due to mayors and city councils, discipline and fiscal restraint. However, we do need to stay focused on our core services given our limited resource capacity.'",
        "'speaker_1': 'City staff will continue to evaluate our financial projections, and we'll be updating City Council in February with the 15 year end status and will return in March with updated estimates for the 17 through Fy19 outlook. This concludes my presentation and I am available for any questions you may have.'",
        "'speaker_0': 'Thank you. I'm going to make a couple of couple brief comments and then I'm to turn this over to to the council. Let me just be just begin by saying that I'm really obviously very proud that the council has maintained a level of fiscal responsibility the last few years.'",
        "'speaker_0': 'It's certainly something that started a few years ago when we were experiencing major deficits. I think if we all remember and think back to 2009, where I think our deficit was close to $40 million for that one year alone.'",
        "'speaker_0': 'And so to have gone from a $40 million deficit down to we went down to I think it was 28 and then down to in the teens and then continuingly to drop that deficit down to where it were.'",
        "'speaker_0': 'We had a few years of a small surplus and now back down and to to to a deficit that certainly it's there, it's real. But it's also, I think, manageable. And I think if you think about what that means from a from a fiscal perspective, you're really talking about one point at 1.3% a piece of that general'",
        "'speaker_0': 'fund budget which listen, we are the services that we currently have in place are all important, they're all valuable. But it is something that we can manage and is not the type of of of tough times that we certainly had five or six years ago.'",
        "'speaker_0': 'While the budget is better than expected and is going in the right direction, that doesn't mean that we can somehow loosen the belt and and overspend. I think that something it's really important for this council is the reason why our budget continues to improve is because we continue to be fiscally responsible.'",
        "'speaker_0': 'And so that measure of responsibility needs to continue if we want to continue to see these types of of of better days ahead of us. Let me also just say that one thing we should be considering is if budget trends continue and this deficit has now reduced and we'll get a better picture, you know, when we're in'",
        "'speaker_0': 'February and March. And obviously we all hope that it keeps going in this direction while 1% is manageable. I think we can all agree that in certain parts of divisions of our city, any type of cut would be devastating.'",
        "'speaker_0': 'And I think we can think certainly of our police department, which right now, quite frankly, is stretched to the bone. I can't think of a of a of a group of officers anywhere in the country that do as much as our officers do with the resources that they have.'",
        "'speaker_0': 'And so any kind of cut, I think, to our to the men and women of the police department would be very, very difficult. So this is a real challenge, but I think it's one that will hopefully have a robust conversation over over the course of the next few months.'",
        "'speaker_0': 'And so we decided to do this budget presentation kind of ahead of the normal budget cycle. Normally you would hear this, I think, in January or February, but in talking to the city manager, I felt it was important that they start getting this information out.'",
        "'speaker_0': 'Earlier so that we can plan ahead sooner rather than later. And so with that, I'm going to open this up for counsel, comments and input. And it's also, I think our hope that through the BRC there could be some conversations even earlier than we would normally start so that we can address these things sooner rather than later'",
        "'speaker_0': '. And so so some good news, but certainly some challenges that we still need to deal with. So Councilman Richardson, who has made the motion to receive and file your first.'",
        "'speaker_3': 'Thank you, Mr. Mayor, and thank you, city staff and Mayor Garcia for including us in this update. Sooner than than normal. And I would just say it is certainly welcome news that we're trending in the right direction. We definitely should be watchful and careful.'",
        "'speaker_3': 'But I would I would I know that there's a lot at stake here in terms of our public safety and our core services and our frontline, like our rank and file that we don't want to we don't want to have to cut those core services.'",
        "'speaker_3': 'I want to just check in and just ask our city manager for a quick update. I know that we've had a conversation about and I see that you're tracking the first responder fee and that will have a conversation about a month or so.'",
        "'speaker_3': 'But how's everything coming so far with the in terms of the first responder fee? How's it looking?'",
        "'speaker_1': 'Well, Councilman Richardson, we had implemented the first responder fee just last month. And due to collection cycles, we don't have any information on an actual revenue received at this point.'",
        "'speaker_3': 'Great. So I'm just looking forward to that. I know that we gave it 60 days or so, so that should come back some time in in in December. Thank you so much for the presentation.'",
        "'speaker_0': 'Okay. Next up is Councilman Andrew. Did you have any you want to speak to your second?'",
        "'speaker_2': 'Yes, sir. I just wanted to let you know that I'm very pleased to, you know, see the item on the agenda tonight and that you've taken, you know, a large step, you know, to see that, you know, preparedness.'",
        "'speaker_2': 'But, you know, by 17. So thank you very much.'",
        "'speaker_0': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_5': 'Just a quick thank you to Ms.. Erickson and Mr. GROSS for preparing this, but also for ensuring that the council priorities are adhered to and observed. And you're very clear that this council does not want to impact services to the residents or negatively impact our employees.'",
        "'speaker_5': 'And so I thank you for that, and I thank you for the early notice. That's always I, I feel like this is a first in a very long time that we've had a very early report on what we're looking at.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'I have so much respect and appreciation for Mr. GROSS and Leia and the work that we have done together over the last year. I am just continually impressed by the thoughtful nature of the work that you do. I know that in the beginning we talked about changing the game a little bit, and I appreciate that the council'",
        "'speaker_1': 'supported me in bringing greater transparency to our sales tax revenues and our business district impact on the revenue of our city. I want to give a special thanks to you'll notice that the report discusses increases in our sales tax revenue associated with Worthington Ford and human Toyota and their partnership.'",
        "'speaker_1': 'I want to give a special thanks to the Southern California Association of Car Dealers for coming to the table and talking through opportunities and threats to the industry. Staying in Long Beach, what it means to tell the message of of of the great deal of benefit that comes from buying your car and repairing your car in Long'",
        "'speaker_1': 'Beach. Also, I want to thank the business associations. I think that the new format of the way that we present the sales tax revenue really helps them advocate for bringing additional business to their corridors. I know it's helped us in the fifth District.'",
        "'speaker_1': 'And then additionally, I really want to thank my colleagues. I have seen in the last 18 months innovation of of opportunities for Long Beach residents to spend their weekends and evenings in Long Beach learning about Long Beach and celebrating Long Beach.'",
        "'speaker_1': 'And when we do that, our residents stay here and they spend their money here, and we can earn back that leakage in the sales tax revenue that we had before. We don't have specific other businesses on here, but there are a few who were either thinking of leaving or left for a short period of time and came'",
        "'speaker_1': 'back. And they have 20, 40, 100, $200,000 per entity of impact on the general fund sales tax revenue annually. And I think that what this this really goes to is a collaboration really led and supported by our mayor and our colleagues that has never been seen before in Long Beach.'",
        "'speaker_1': 'And I know that it was a tough pill to swallow in the beginning because there's a lot of extra work for our finance department. But what gets measured is really what gets focused on, and I think that we've seen that in the results.'",
        "'speaker_1': 'So a big win for for the finance department and the council for supporting this additional transparency. Thank you. Thank you so much.'",
        "'speaker_0': 'Thank you. And before I open this up for public comment, I want to say and I say this every time we talk about the budget, but I just really think it's important to remember. And for me, it's an important part of our kind of planning for these deficits, is that Long Beach has these small deficits not because'",
        "'speaker_0': 'we hired a bunch of employees or because we are all of a sudden overspending. But these are employee these deficits are directly related to the larger pension payment that the city is now making and has been making over the last few years.'",
        "'speaker_0': 'And so I say that because we are what we're doing now essentially is being responsible about paying down our long term pension obligation, which then creates us managing through these additional deficits. And if the city was not paying what we're paying now and reducing the pension, we wouldn't have these deficits.'",
        "'speaker_0': 'And so I think that that's it's smart planning. I'm glad that the state went once the city had implemented pension reform, the state followed and is now encouraging other cities to do what we're doing now. But it's long term, it's the smart thing to do.'",
        "'speaker_0': 'And so while no one likes to have deficits, even when they're small, it does force the city to spend responsibly and to invest in the long term health of the city. And so I wanted to make sure that that that was mentioned again.'",
        "'speaker_0': 'Is there any public comment on the budget presentation? And then after that, we'll go right into public comment.'",
        "'speaker_2': 'Good evening, Larry. Do Kirk has the address? Yes. Mr. GROSS and his staff are to be commended for those figures. And I think it argues well argues well for the city to do what I've suggested a number of times is to get a first rate city manager to manage these very difficult times.'",
        "'speaker_2': 'We cannot rely on a fourth rate. Peter Principal Manager selected because the more qualified assistant city manager could not be lead, would not be bullied. So we ended up with what we have. I think it argues well, also for going back to what works so well for so many years is a part time.'",
        "'speaker_2': 'They're selected by the city council. We don't need a globetrotting, globetrotting political hack to how to run the city. Thank you.'",
        "'speaker_0': 'Always instructive. Thank you. Any other public comment on this item? C none members please cast on receive and file. And of course, and thanks again to the finance staff for your work and we look forward to the next presentation at the.'",
        "'speaker_1': 'Motion carry in.'",
        "'speaker_0': 'February. Thank you very much. Let's go ahead and go now through. We have public comment and consent. Let me get a motion for consent real quick. Going to get a motion in a second. There's a motion in a second for consent.'"
    ],
    "Recommendation to adopt the West Long Beach Livability Implementation Plan and accept Categorical Exemption CE 15-139.  (Districts 1,2,6,7,8)": [
        "'speaker_1': 'Report from Development Services Recommendation to adopt the West Long Beach Livability Implementation Plan Districts one, two, six, seven and eight.'",
        "'speaker_0': 'Okay, thank you. We're going to turn this over to staff. I know they've got a good presentation ahead of us of a lot of information. And so. Mr. West.'",
        "'speaker_10': 'Mayor Councilmember, I'm going to turn this over to the deputy director for Development Services, Angela Reynolds. And we also have local architect Melanie Smith to assist Angela.'",
        "'speaker_6': 'Thank you, Mr. City Manager. Good evening, Mayor. And City Council Members. Before you tonight is the Livable West Long Beach Plan. This planning effort was funded by the Port of Long Beach. And while the port is a tremendous economic engine for the city and the county and the country, there have been many environmental impacts to the community'",
        "'speaker_6': 'in and around the city's port. The study focuses on Port Area one A, which includes West Long Beach, Willmore City, downtown and the Wrigley neighborhood. The livability plan was formulated by identifying projects that had already been published and working with community stakeholders to prioritize these projects and initiatives.'",
        "'speaker_6': 'All of the projects in some way improve livability in these neighborhoods. Some aimed at improving air quality. Some reducing noise impacts from nearby heavy industry. Constructing and connecting bike paths with walking paths throughout the city. And continuing to provide community health initiatives.'",
        "'speaker_6': 'So I'm going to introduce Melanie Smith from Melendez. She's the principal there, and she's going to give a slide show that will more fully talk about this plan and then will be available for questions in you.'",
        "'speaker_1': 'Luck of council for having us here tonight to hear about this plan. We've been over a year in the making to to prepare this this plan. And just to start by saying that the direction that was given by the by the funders and by the city was that we were really not being asked to to take a'",
        "'speaker_1': 'clean slate approach to say, you know, be your most creative self and think about, you know, how we could improve livability on the west side of Long Beach. That might be interesting. But what we were asked to do was take a look at already adopted city plans and programs and take take a look at their goals and'",
        "'speaker_1': 'take a look at programs and and projects that were had been identified in those plans that had not yet been implemented and start to compile those. And we were also well aware that the Port of Long Beach is green port policy in the San Pedro Bay Ports Clean Air Action Plan are certainly on the books enacted and'",
        "'speaker_1': 'that those will continue to be implemented within the ports boundaries and improvements will be seen there. And so we sort of set those to the side recognizing that those those elements are underway and we're not building those into this plan.'",
        "'speaker_1': 'But we were asked to take a look at the city of Long Beach has recently adopted a new mobility element. To go back to a plan that I worked on a number of years ago, the community livability plan for the 710 corridor neighborhoods.'",
        "'speaker_1': 'Take a look at the Long Beach River Link projects, the yards west side plan. A portion of that plan is the Terminal Island Freeway Repurposing and decommissioning project. We'll talk about that a little bit more. The city of Long Beach, open space and recreation and housing elements, and also its recently adopted healthy communities policy.'",
        "'speaker_1': 'So this process has been multi-pronged and has involved a great deal of community engagement at a bunch of different levels. This really sort of barely scratches the surface. This summary of the community engagement process we had for this project for the Livable West Long Beach Plan, we had two major convenings workshops, the first one at the start'",
        "'speaker_1': 'of the project last December and then a second one earlier this year. And in addition to large convenings of the community, we held all of our meetings at Silverado Park on the West Side. We also took a availed ourselves of a number of other groups and organizations in the community that already meet to do drop in meetings'",
        "'speaker_1': 'and presentations. A little hard to read on the screen, but a large number of meetings there and and with folks across the spectrum really of stakeholders in the area. And we've also presented the plan at the Planning Commission and at the Board of Harbor Commissioners.'",
        "'speaker_1': 'And so that brings us here tonight. When we started the process again, we were taking a look at it already adopted plans that that had already had really a large amount of community engagement around them in order to have them been adopted.'",
        "'speaker_1': 'And we took took a look at the goals of those plans. And from there, we we identified livability criteria that we brought to the community. And we asked the community to prioritize these criteria relating to what might improve in their minds, some of the most pressing livability concerns on the west side of Long Beach.'",
        "'speaker_1': 'And of course, no surprise, clean air and water was at the top. Availability and access to jobs, goods and services. Number two, safe neighborhoods, beautiful neighborhoods and great schools were really the top five criteria. And while we were identifying criteria and asking the community to rank that criteria, we were also developing a list of projects and programs'",
        "'speaker_1': 'that again had been part of previously adopted city plans. And those project, that project list really fell into a number of different categories. As you can see on the screen, a number of streetscape projects, bike and pedestrian improvements, and a category that we call the Focus on community.'",
        "'speaker_1': 'And that was, you know, urban greening community, neighborhood watch, things like that, safety and security having to do with safe routes to school and things of that nature, park improvements, major roadway projects. And you might say, why are roadway projects part of improving the livability of the West Side?'",
        "'speaker_1': 'The 710 Terminus Realignment Project really will create a great deal of new open space and better connect the community and bike and pedestrian community connections in that part of town transit improvements, health, education and activities and health services.'",
        "'speaker_1': 'So these were all the categories of projects in the projects are listed below. Those that we identified took to the community and again asked the community to give us feedback on that. So, you know, this is the process we underwent as a as I've been talking about.'",
        "'speaker_1': 'The next step was really to package projects. We but but first we were really ranking them. And I just wanted to give you a snapshot of what that ranking process look like the city really asked us to to create a tool that would then be available to the city after this project had been concluded.'",
        "'speaker_1': 'And that would give us a measurable way to take a look at these projects and measure their livability. So in order to rank a project such as the Santa Fe Avenue streetscape project that had been identified, we had to figure out some metrics and some data that we could measure this project against and figure out how it'",
        "'speaker_1': 'would. To what degree it might positively impact livability on the West Side. So we could look at how much population would be served by the project. So 20 over 27,000 people would be served by this project. And we could take a look at its proximity to parks and schools and see that seven schools and three parks would'",
        "'speaker_1': 'be served by this street and that that Santa Fe Avenue streetscape project is going to serve ten and link ten transit routes and actually 103 bus stops. Not linkages directly to LRT in this case, but 103 bus stops is nothing to sneeze at.'",
        "'speaker_1': 'And so we were able to then demonstrate how we could link, how we could rank these projects and leave the city with a tool that it can use really to to refer back to as it takes a look at these projects.'",
        "'speaker_1': 'So as we went through the community process and took feedback, one of the comments that we got in our second workshop was that these projects were great and folks were very interested in seeing them implemented. And a lot of the things in this plan have been talked about in the city for, you know, a long time.'",
        "'speaker_1': 'And the recommendation was that we should think about or explain how do these projects add up to something? How do they add up to, you know, a larger network of improvements that would really see that they would really be visible within the communities?'",
        "'speaker_1': 'And so we ended up taking another look at the project list. We didn't change it, but we took a look at the list and developed what we ended up calling Livable Neighborhood Connection Strategies. And we identified three of those link strategy areas on the West Side, so that really the west west to the northwest and the southwest'",
        "'speaker_1': '. And we identified packages of implementable projects and a network of projects that would really have synergy among each other. And I think, as you all know very well, a large part of what staff does today is seek grant funding to to implement these projects.'",
        "'speaker_1': 'And we know that what we see a lot in in criteria for grant funding is that we've got to show multiple benefits to projects and that they're really hitting a bunch of different criteria. And so we think that as packaging strategies in this way provides again another helpful tool for the city to use as it seeks to'",
        "'speaker_1': 'implement these projects. So the link one area incorporates a number of streetscape projects, again, biking, pedestrian improvements, transit improvements, park improvements and and major road projects, a variety of those. And these are the projects that we can really map and show folks where they are on a map link to.'",
        "'speaker_1': 'Again, we've identified this set, this grouping of projects that can be thought of to really add up to this strategy for this this area of the West Side. And then strategy three area similarly. But it was clear that not everything could be mapped in this way and that there are many important project projects and programs that really'",
        "'speaker_1': 'would feed into all of these link strategies and really be important to think about. And that the community ranked very highly as well, falling out of the health services, health, education and activities that focus on community, community gardening, urban forestry projects, and that safety and security security category, which was also important.'",
        "'speaker_1': 'So those have been included as well and are important. And then another comment that the community made as we were going through the process was that folks certainly are well aware that the port has been doing mitigation, grant funding in a number, a couple of different rounds and that those categories of projects that the port has been'",
        "'speaker_1': 'funding in response to projects that are done, the community has has found valuable and wanted those categories of projects to be included in the plan as well. So things that reduce greenhouse gas emissions, that improve air quality and and and the physical environment at schools and related sites and health care and senior facilities were seen as very'",
        "'speaker_1': 'desirable for the community to. To include in the plan as well. So a lot of folks ask to have asked us. This is great, you know, that they've really supported this effort and this initiative to develop this project list, this ranked and community prioritized list, and and have this available as a tool to to the city and'",
        "'speaker_1': 'to the port moving forward. But they asked us, how is this going to be different? What's going to be different about this? What we did try to do is identify distinct and relevant funding sources that the city may pursue.'",
        "'speaker_1': 'And we tried to include ones that we knew the city wasn't already using. So more because the city is pretty good at this. But we tried to include things that could broaden the horizons a little bit and and give some good case studies of how other communities have used these tools.'",
        "'speaker_1': 'And then we also identified, actually, staff identified the approach that would be used for implementing the plan in the form of a city staff and port staff livable West Long Beach working group that would be formed and would would host quarterly meetings to lead track and report progress using a tool again that we'd provide, taking a look'",
        "'speaker_1': 'at current project status, developing conceptual costs and budgets for projects where they don't exist, identifying funding sources. And then the Planning Commission recommended that there be an annual report to the commission to track progress over time. And that's just an example of the workshop that we're thinking about using as a tool.'",
        "'speaker_1': 'And that, I think, gives you an overview of the plan.'",
        "'speaker_5': 'Mr.. REYNOLDS Is that the conclusion of the staff report? Yes. Okay. Thank you. Thank you so much. We have a motion by council member your anger and second by Councilwoman Gonzalez. Councilmember Your Honor, would you like to address the motion?'",
        "'speaker_9': 'Yeah, but I'd like to get some input first from members of the audience. Okay. At this point.'",
        "'speaker_5': 'Councilwoman Gonzalez. Okay. Okay. So if you would like to address the Council on item 12, please come forward. State your name. Thank you.'",
        "'speaker_6': 'Good evening. Good evening. Mayor and council members. My name is Elizabeth Warren. I'm the executive.'",
        "'speaker_12': 'Director of an organization called Future Ports. And I have a letter that I sent to each of you today as.'",
        "'speaker_6': 'You have it in your.'",
        "'speaker_12': 'E-Mail. I also have hard copies if you'd like a hard copy for reference today.'",
        "'speaker_6': 'I'm very proud.'",
        "'speaker_12': 'Of this letter.'",
        "'speaker_6': 'I stand here as a representative of a coalition, of businesses and labor together that have been looking at this project.'",
        "'speaker_12': 'At one project within the program, and.'",
        "'speaker_6': 'That is the decommissioning of the Terminal Island Freeway. And we have a coalition made of five labor, five ILWU, locals to labor trade laborers and 11 businesses. We have 18 organizations that have put together a letter. I think this is sets a precedent that we've never had labor and business together on one letter.'",
        "'speaker_12': 'Sending a message that we have some very strong concerns about decommissioning.'",
        "'speaker_6': 'The Terminal Island Freeway. This would be the largest freeway removal project in Southern California history, according to the Press Telegram. And it's a critical truck route between the ports of Long Beach and Los Angeles in the local businesses.'",
        "'speaker_6': 'There's 11,000 vehicles that travel daily on this freeway. And then and if this project is comes to fruition and it's decommissioned, those trucks and vehicles are going to be.'",
        "'speaker_12': 'Rerouted onto surface.'",
        "'speaker_6': 'Streets. Alameda, Anaheim and Pacific Coast Highway.'",
        "'speaker_12': 'We are concerned.'",
        "'speaker_6': 'That some of the goals to reduce emissions and to and to have some other positive impacts are actually going to have a negative impact. And that is one of our our very strong concerns of this would not increase freight efficiency and competitiveness of the California freight system, and it would likely impose costs in the form of lost'",
        "'speaker_6': 'productivity and construction inconveniences for the local residents and businesses. We would like to make sure that you do have a copy of our letter. And our ask tonight is that we, although we do support moving forward with climate change initiatives that promote sustainability and have attainable goals, we want things that are based on sound science and that'",
        "'speaker_6': 'are economically feasible. So we urge you not to move forward with the removal of this part of this particular portion, the the the decommissioning of the Terminal Island Freeway this evening. And we'd like to.'",
        "'speaker_12': 'Suggest that there are further.'",
        "'speaker_6': 'Studies, full environmental impact review, traffic analysis and other studies before moving forward on this particular project.'",
        "'speaker_5': 'Okay. Thank you this morning.'",
        "'speaker_6': 'I will give the letters.'",
        "'speaker_5': 'To the hard copies.'",
        "'speaker_10': 'Good evening. Mayor and members of City Council. My name is Western Labor and I actually represent three of the organizations that signed on to the letter. I'm the executive director for both the Harbor Trucking Association and the Foreign Trade Association, as well as the policy director for the South Bay Association of Chambers of Commerce.'",
        "'speaker_10': 'And as we've looked at this, we look at several key things. One, as it was alluded to by the previous speaker, we think there are studies that need to be done to look at the environmental impacts and traffic impacts that would be result of the closure of the TII freeway.'",
        "'speaker_10': 'We are trying desperately at the ports to reduce congestion and truck congestion continues to be a major issue that we're dealing with in the South Bay as a region. And we think we need to look at what are the alternative routes.'",
        "'speaker_10': 'When we've met with the outreach team, we've we've been open about the fact that if we can find alternatives that benefit both the community and our goods movement sector, that's something that we would really embrace and we could really get behind the project.'",
        "'speaker_10': 'But at this point in time, the decommissioning of the freeway becomes a major concern of our organizations because of that major component. I also want to add that this is kind of an important issue as it has brought together people that would not normally be together on an issue.'",
        "'speaker_10': 'To think that you have PMC and the ILWU signed onto the same letter is pretty remarkable, and it just shows how important this issue is to the entire port community. And as I've heard the mayor say multiple times, we are a port town and we embrace our port.'",
        "'speaker_10': 'It's something that we need to look at and see how it how it impacts the the future of our port and how we grow and how we can move more cargo and move more cargo efficiently. We have supply chain optimizations, meeting meetings going on on a regular basis that are bringing the stakeholders together and to to move'",
        "'speaker_10': 'forward with the decommissioning of the freeway without studying it, to make sure it's not going to be a major impact on on goods movement, to make sure that it's not going to be a negative impact on the regional environment is very important.'",
        "'speaker_10': 'And the one last thing I will say is that the TII freeway provides the only major overweight corridor between the Port of Long Beach and IETF. And to remove that, you're going to remove the ability for many businesses to be able to get overweight containers from the Port of Long Beach to the active facility as it's currently'",
        "'speaker_10': 'constructed. And so we need to look at ways to overcome those sort of barriers that will allow us to continue to move America's cargo. And with that, I'll probably reach out to many of you on this issue over the coming weeks, but I'll let the next speaker talk.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good evening, Mayor Garcia. Council members, my name is Dan Hoffman and the executive director for the Wilmington Chamber of Commerce. And so your neighbor and I hope your friend. I did want to before I say another word, I want to thank some of your staff who I've reached out to, Angela Reynolds, who is nice enough to call'",
        "'speaker_8': 'me back on the phone a couple well, actually last month and then a part of your team made a presentation to our board of directors just last week. They were professional. They were courteous. They were kind enough to answer as many of our questions as they could.'",
        "'speaker_8': 'Having said that, unfortunately, our Chamber of Commerce, you know, has joined this coalition, are opposed particularly to the tie, the Terminal Island Freeway elimination and for I think, a couple of really valid reasons. The first has been I think the purpose of this whole plan is to make our environment better.'",
        "'speaker_8': 'And I think that's something we all need to strive to do. It's good for our employees. It's good for our community. We all want to be a little healthier and live a little longer. However, as we look at this project, it appears that what it's going to do is move a lot of this truck traffic from Long'",
        "'speaker_8': 'Beach area to the Wilmington area and therefore making a community that's impacted a little bit better, but negatively impacting a community that's even more impacted. I don't think that that was the intent of this, but I think if you actually take a look at it, that that that's what it does.'",
        "'speaker_8': 'Additionally, we're talking about an estimated most recent figures, 6600 trucks that will be diverted down Pacific Coast Highway to the Alameda Corridor. And so another one of our concerns is the businesses that are directly there. So we're talking about Tesoro, about fast lane transportation, about California Sulfur, about Cal Cartage, and potentially looking at the impact that this'",
        "'speaker_8': 'project will have. So, again, I thank you for your time and and for your consideration and most of all, for your attention. Something that I've noticed here that I don't see a lot of and a lot of different meetings.'",
        "'speaker_8': 'I try to see how people are engaged. And for the most part, I think your community can be very proud of you, that you're very engaged and listen to the folks. So thank you again.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_12': 'Good evening, Mayor Garcia. Members of the city council and city staff. My name is Joan Greenwood. I reside at 2091 San Francisco Avenue in the Wrigley District of Long Beach. I'm here today to say congratulate all of you on this wonderful plan and also to tell you.'",
        "'speaker_12': 'But your work is not done yet. And just as they said that this plan took into consideration existing plans. I noticed that a very important community within the one eight zone seems to have been left out of it because we weren't truly aware that we could have impacted more projects in Wrigley by participating in these workshops.'",
        "'speaker_12': 'So the reason I say this is there's a couple of points I'd like to make that I'm going to focus on this evening. First of all, Tidelands funding, and I've given you a memo with a couple of topographic maps and they show that historically Wrigley between where currently there's PCH and Willow Street, west of Pacific Avenue, was'",
        "'speaker_12': 'wetlands. It is still under tidal influence. And from PCA, Willow Street South is considered by the Regional Water Quality Control Board to be an estuary that is tidelands. So I think the city staff needs to look into this a little more depth because they have far better graphics capabilities than I do.'",
        "'speaker_12': 'The second thing I wanted to address was the use of enviro screen as a ranking tool. It doesn't matter when it comes to your health and where you live. If you are in a1a zone for air quality health risks, it doesn't matter what age you are, what ethnicity, it's being a sensitive receptor.'",
        "'speaker_12': 'And so it skews a little bit of the ranking of the projects. And I got this by looking at a precinct up in Bakersfield that had a very high end virus screening. And I couldn't figure out why until I found out they were next to a food processing plant that had an above ground storage tank of liquid'",
        "'speaker_12': 'chlorine. So you have to be very careful with virus screening. But I do think it's wrong to look at this one zone and say any one part of it is at greater risk than another. We're all at equal risk.'",
        "'speaker_12': 'And to a certain extent, Wrigley is a greater risk because we are downwind of both the Freeway and Wrigley Heights from other areas. The other thing is the Streetscapes River Link referenced the 2007 plan, the original River Link project in 2003.'",
        "'speaker_12': 'Specifically address linking the neighborhoods within the Wrigley District to the L.A. River Trail. And that has been completely left out of this project. And part of it is because of the potential impacts of the I-70 ten freeway and their diverging diamonds, and we're waiting to see the geometric on that.'",
        "'speaker_12': 'So that may be part of the reason, but there was a project that Metro had along Willow Street for improvements, and it's gone away. And the last is the trails were taking too much of a piecemeal in Wrigley.'",
        "'speaker_12': 'And I think we need to continue on in this program. Thank you.'",
        "'speaker_0': 'Thank you, John. Next speaker, please.'",
        "'speaker_13': 'Good evening. I'm kind of sick right now, so I'm going to let her speak for me. But she knows exactly what she's going to say. My name is Jessica Alvarez. I'm with Long Beach.'",
        "'speaker_12': 'I'm. I'm speaking about. Thank you, Mayor and Councilor, for letting me speak. I am a long time resident.'",
        "'speaker_7': 'Here we go.'",
        "'speaker_12': 'Thank you, Mayor and Councilor, for letting me speak. I am a long time resident of Solana Beach, so I went around and as residents about tai chi with commercial conversation and and some residents were for it. Some were against it.'",
        "'speaker_12': 'I think most are an indicator about on it or not.'",
        "'speaker_4': 'Or not educated on it.'",
        "'speaker_12': 'I think if we came to an agreement, we as a city could benefit from it. Every possibility came up with a comment committee or more community involvement. A lot of great ideas were we could all benefit from and for our generation to come.'",
        "'speaker_12': 'Oh, and part of me.'",
        "'speaker_4': 'I think it's a great idea.'",
        "'speaker_12': 'Your name. Oh. My name is.'",
        "'speaker_1': 'Carla. Sorry. Um, I believe in the website. I think it's a great idea, because when.'",
        "'speaker_12': 'Kids come out of school.'",
        "'speaker_1': 'The smell. It's the pollution from the drugs and. Where we try to catch busses. There's a lot of traffic.'",
        "'speaker_12': 'And it's contaminating a lot of people. And especially we're in school.'",
        "'speaker_1': 'That's all we smell. And then kids with asthma, they end up in the hospital because of.'",
        "'speaker_4': 'The pollution and.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Excellent. Okay, next beaker, please. I think these are. Last speaker here. Right. Okay. Yes. Good. Thank you. Honorable Mayor and City Council. My name is Brian Olszewski.'",
        "'speaker_10': 'I'm the executive director of City Fabric. We're a.'",
        "'speaker_0': 'Nonprofit design studio dedicated to improving our.'",
        "'speaker_10': 'Communities through public interest design, planning and.'",
        "'speaker_0': 'Policy. It's great to see the Westside Livability.'",
        "'speaker_8': 'Implementation Plan coming before the Council today. It is the culmination.'",
        "'speaker_0': 'Of multiple community workshops, over 20 stakeholder meetings and interviews. The plan was built on a foundation of nearly a dozen previous community plans, including general plan updates, redevelopment, strategic plans, specific plans and even community initiatives. These plans were formed by over 100 workshops, neighborhood meetings, commission hearings, public hearings, and city council sessions that together engage over a'",
        "'speaker_0': 'thousand residents and stakeholders at Long Beach. With all that said, there's still a long way to go. While the Westside Livability Plan maps out a strategic guide for improving health, wellness and vitality of West Long Beach, each community oriented project will require funding, design, engineering and further stakeholder engagement.'",
        "'speaker_0': 'Whether developing bike facilities, enhancing.'",
        "'speaker_8': 'Pedestrian connectivity.'",
        "'speaker_0': 'Creating new park space or mitigating pollution. The project, identified in the Westside Livability.'",
        "'speaker_8': 'Plan will go a long way to enhancing that quality of life for residents.'",
        "'speaker_0': 'Of West Long Beach and across the city because pollution doesn't stop at any arbitrary border. We look forward to being part of this process, this solution oriented process going forward. And thank you for continuing this effort to improve the Westside community.'",
        "'speaker_0': 'Thank you. Thank you very much. And with that, I'll turn it back over to the council and to Councilman Ranga. But I wanted to just a couple clarifying points, which I think are important, and I appreciate everyone that came down and spoke on this item.'",
        "'speaker_0': 'I just want to make sure that we note that the Westside Livability Plan that before us today, as was noted, does not decommission the freeway. I mean, that is a different process that will be debated. And I think there's a lot of important debate that needs to happen around that conversation.'",
        "'speaker_0': 'But what's in front of us today is a plan that was that's been funded by actually the port of Long Beach. The Port of Long Beach has been a partner in this plan from day one. And we wouldn't have this plan if it wasn't for the port and for their interest in coming to the city and going'",
        "'speaker_0': 'to the community and saying, we know that there are impacts. We know that oftentimes the dollars that we spend in the community aren't always spent in West Long Beach. And so we want to change that. And I think what you're seeing from the Port of Long Beach is two things is one is they've they're changing their policy'",
        "'speaker_0': 'on how they assign community dollars. So the focus is on the communities that are most impacted by the port. That is a new policy. They're just in the process of implementing, which I know a lot of you have been involved in conversations.'",
        "'speaker_0': 'And the second big piece of that has been funding and supporting this plan that the Council has in front of it today. It's a recognition that the communities that have been most affected by the port need additional support to continue to need investment mitigation and and green space and clean air and the cleanest water possible.'",
        "'speaker_0': 'And so I think the community should be proud of this process and pushing this process. I've seen hundreds and hundreds of community members involved in this. And to obviously my friends in industry, there's no greater advocate for the Port of Long Beach than myself and then the council members that are on this on this body.'",
        "'speaker_0': 'And I think the discussion that was brought up on the freeway piece is an important discussion that we will we will have and have a chance to to converse. But but that is, you know, a few sentences in the plan that has before us today.'",
        "'speaker_0': 'What I want to focus on and just remind us that the big focus of this plan is on the additional park space and green space and building a healthy community and ensuring that young kids aren't constantly affected with the effects of asthma and air and pollutants that are in the air.'",
        "'speaker_0': 'And so that's to me, what this is about. And I want to make sure that the conversation really is focused on on that and that this council, if and when this council makes a decision about the freeway, which is a big decision, that will be a debate that will be before the council.'",
        "'speaker_0': 'And whether the council adopts this plan or not won't have a bearing on that specific project, which is one of dozens and dozens of projects that are in this plan. And so with that, I mentioned this over to Councilmember Turanga.'",
        "'speaker_9': 'Thank you, Mayor, because that was exactly one of the things that I wanted to point out and clarify is that this is a start of a conversation at the start of a discussion in regards to, well, the two freeway, but better yet, it's about a whole process of building a livable west with that community.'",
        "'speaker_9': 'If you look on page 17 of the report, you'll see the the the neighborhoods line, which is is is one of. Or it's neighborhoods. We're talking about the neighborhoods of downtown. West Village. West. West side. South or west side.'",
        "'speaker_9': 'West side. Upper West Side. The Valley. Community loss, Fritos, Wrigley, as was mentioned. And one more. So the the impact that this study does is much broader than that. But maybe people are understanding it to be the discussion that the mayor has stated on the to freeway and whether it's decommissioned or not is another discussion will take'",
        "'speaker_9': 'place at another time. And the the community groups that came together to talk about and participate in the in the workshops for a livable livability study was precisely that to look at what impacts our truck trucks, the freeway, the river transportation health is having on those West Side communities.'",
        "'speaker_9': 'And I think that they did that. I want to thank obviously, I want to thank our staff for putting this together. And tonight is a big step for the residents of West Long Beach and taking back the community and fighting for access to things most people take for granted, such as clean air, green space and basic multi-modal'",
        "'speaker_9': 'mobility and connectivity. I want to thank Amy Warwick and Reynolds and Eva Brown for their work in collaborating with our residents. I also want to thank Melanie Smith from Melendez as we get from West Communications for facilitating the workshops in regards to the two freeway itself.'",
        "'speaker_9': 'We understand that there is a lot to be done with that. We still need to look at Square, we still need to look at transportation studies, we need to look at environmental impact reports and and studies there. So that discussion is going to be coming soon to commit to the council.'",
        "'speaker_9': 'And it's also that that opportunity, I think that the goods movement, people and everyone else who's concerned about the to a freeway would that would be the opportunity to come down and share your thoughts and share your concerns that you think that project is going to have.'",
        "'speaker_9': 'Should it or should it not be decommissioned? So I asked that my council members, my colleagues on the council support this plan. It is much broader than just one aspect of it. It is, and it's much too important for us to not adopt it and accept it as something that we can look at for our residents to'",
        "'speaker_9': 'clean up the air, to provide better health benefits as we move forward with our goods movement and as we move forward to establishing Long Beach as the leader in the West Coast. So I ask for your vote.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_4': 'Yes. I first want to thank staff and all of the community partners for being involved with this, because it truly is a night that we can all celebrate. Because, you know, the west side, we've often talked, both Councilmember Muranga and myself, about the West Side and all of the different attributes of the West Side.'",
        "'speaker_4': 'And what needs to be done in this certainly is just one step, but there's a lot more to do here. And as I am the chair of the Alameda Corridor Transportation Authority and the I-70 Project Committee, I'm very understanding of the goods movement in the industry and exactly what it is that we need to do to continue'",
        "'speaker_4': 'being the number one port complex together, both in Long Beach and in Los Angeles. But I do feel that, you know, as I mentioned, this is a wonderful plan. We need to really emphasize all of the community work of our neighbors.'",
        "'speaker_4': 'I see our friend, longtime advocate Jessica on the west side. And you're I don't know if it's your daughter or your friend that came. One of your youth that came and spoke so eloquently. And it and we thank you for being here because I feel we really need to hear from the residents and how this impacts you'",
        "'speaker_4': 'every single day. And so I want to thank you for that. I just wanted to ask a few questions of staff before anything else. I know that outreach has been, you know, an issue for some people. I know we've done a lot of outreach with community.'",
        "'speaker_4': 'But what has. The outreach been like to the businesses directly affected specifically for the tie?'",
        "'speaker_6': 'Councilwoman Gonzales, you heard that we had to are actually three outreaches with communities in the broad community, but we also did a multitude of focus groups, lots of them with goods movement folks. And so I did bring those if you want me to listed, I can certainly do that.'",
        "'speaker_6': 'We met with Tesoro, Cal Cartage, Three Rivers, Noble, L.A. Grain. We also met with Watson Land Company. We went and did a presentation of future future ports, Vaseline and Three Rivers. The U. The CAC will be Tech Park and several other health type organizations.'",
        "'speaker_6': 'We also met with Portage Group. We met with Gateway COG, Caltrans, Metro, Skaggs and the like. We also met with Hudson and Cabrillo Harbor Trucking Association. We met with. Twice, once in a focus group and once at their meeting.'",
        "'speaker_6': 'We also met with West Coast Marine Terminal operators. That's WCM toA. I think you'll see all these people on the letter that you got. PMS say we met with Union Pacific Andy Perez several times. International Warehouse Logistics Association, the I, WFLA, and and I already said future ports.'",
        "'speaker_6': 'But I think we touched them twice.'",
        "'speaker_4': 'Okay. Thank you. And then I know this is coming back and there will be a process, so we'll still have to go through and are secure in a number of different processes in order to.'",
        "'speaker_6': 'Councilwoman, I think you're referring to the Thai decommissioning. And one thing that I did want to say is the West Long Beach plan. That is one project out of 58 projects and 27 programs policies. And I will also say that to the goods movement, folks, all the issues and concerns that you mentioned, we totally agree.'",
        "'speaker_6': 'And when we do come back with the the decommissioning of the Thai plan, you will see in the next steps all those things that were talked about, the ERs, the the truck routes, the traffic studies, all those things.'",
        "'speaker_6': 'I mean, there's a long road ahead on that and at this point. We're not asking council to push us forward on any particular plan for the Commission, and the Council would have to come back and actually do that in a separate action.'",
        "'speaker_4': 'Okay. Thank you. I just wanted to ask those couple questions. And again, I want to thank you for your work in this. It's a it's a huge deal for the west part of the city. I'm very, very happy to know that there were many community members, as I mentioned, that were involved in this process that we continue'",
        "'speaker_4': 'on. And then I know that there will be follow up meetings, is that correct as well internally, just to ensure that we're on in progress with with this plan?'",
        "'speaker_6': 'Yeah, that's councilwoman that's in Chapter five and that's our implementation plan. Development services will be the lead on that. However, there are lots of other interdepartmental is working with us, which is healthy public works, Parks Rec and Marine.'",
        "'speaker_6': 'Certainly the port, that's our working group that we've had all the way through this process. So we'll continue to meet.'",
        "'speaker_4': 'Great. And what type of outreach will be done to allow the community to understand where we're at and the progress and every.'",
        "'speaker_6': 'Step of the way? Well, we're going to report back once a year to the planning commission. And, you know, many of these projects are going to have their own process that goes along with them. That's a public process as well.'",
        "'speaker_4': 'Great. Thank you very much. And congratulations to the community.'",
        "'speaker_0': 'Next we have Councilwoman Mango.'",
        "'speaker_1': 'I want to thank the staff in the port for their leadership in making sure that our communities are livable. I think that that's a a huge component of being a responsible steward of the public trust and what we are responsible to do to the community.'",
        "'speaker_1': 'I appreciate the neighbors who came out to speak today and industry and business and labor who united for a letter. I think that the misinformation on what council items are about has been happening more often. But I appreciate that you came here to give your voice on the potential risks.'",
        "'speaker_1': 'And I think that hearing from the mayor that you can be assured that public comment and input and community outreach will be done before heading in that direction right now. I'm very supportive of the item as it stands and to work towards making the Long Beach more livable.'",
        "'speaker_1': 'Anything we can do to improve the sustainability and breathability along beaches is really important. So great work to everyone. Thank you.'",
        "'speaker_0': 'Thank you. Council Member Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I just got to say, this is amazing work. This is a tremendous legacy I see for the residents who engaged in this. For the leaders who took part in this. And for the staff who drove this.'",
        "'speaker_3': 'This is this is just fantastic work. So I've had a chance to, like, look at this and follow it. I think it's a great model, great model for subsequent plans, strategies that we can implement in other communities. One part that I thought was really cool was the link areas, part where you can look at separate elements the'",
        "'speaker_3': 'mobility, the open space, the public safety stuff, streetscape stuff, and look at how it's all organized into linked areas. I think that's amazing and we should look at doing that in other, other areas of town. So so I've always been supportive of the port doing being smarter about its mitigations.'",
        "'speaker_3': 'And it seems like whenever there's some port lease that we have to hear an appeal for. It seems like there's a different deal with every different mitigation measures. So I think it's smart to have one plan, one strategy that steers and guides those.'",
        "'speaker_3': 'So I think this is great. I would say that, you know, with that, this is, you know, fantastic for Long Beach. But, you know, we got to make sure that we keep, you know, the work isn't done. We got to look at the entire 17 freeway, all the communities along the 17 freeway in subsequent discussions and and'",
        "'speaker_3': 'as well as the 91 freeway. And then the only question I would have, what list of questions I would have is how long did this process take? How much did it cost, and who paid for it?'",
        "'speaker_6': 'Are you asking me that question, Councilman?'",
        "'speaker_8': 'I am.'",
        "'speaker_6': 'Okay. It took 18 months, and it cost $300,000.'",
        "'speaker_3': 'And who paid for it. How was it paid.'",
        "'speaker_7': 'For the port?'",
        "'speaker_3': 'Got it. Thank you.'",
        "'speaker_0': 'Councilman Turanga.'",
        "'speaker_9': 'Finally and on the project that we understand it's going to be a long process. There are already some efforts in addressing some of the the livability plan. There are some major project improvements taking place on Santa Fe corridor.'",
        "'speaker_9': 'We've already installed LED lights along that corridor for public safety purposes. We have a monitoring devices at the schools to measure the air and the air quality there so that when kids are outside, they come inside at the quality is poor for them to be outside.'",
        "'speaker_9': 'So there are things that are already in place. And we also have to look at the fact that, you know, when you look at the at the law, we always talk about a tale of two cities. Well, I want to talk to you about the tale of an island which is West Long Beach.'",
        "'speaker_9': 'And that and it's an island because it's connected by bridges. It's connected by a bridge over the river and the and the freeway on PCH and Willow and water on the other side. So I understand that those streets would also have to be part of this plan in terms of improvements to improve access and improve transportation and'",
        "'speaker_9': 'accessibility for the residents of Long Beach. The part the one part about the West Side in terms it affects me. I have 27,000 residents in that in that area right there. That's just about half of my total district that resides in West Long Beach.'",
        "'speaker_9': 'And I and it's important for for me and for us and the council to look at a neighborhood that is basically like an island. And there are a lot of needs out there, a lot of services that need to be improved upon, and definitely an improvement on accessibility to good health, clean air and some better transportation.'",
        "'speaker_9': 'So, again, I would appreciate your.'",
        "'speaker_0': 'Thank you. That concludes both public comment and council comment. There's a motion by Councilman Urine Guy and a second by Councilwoman Gonzalez on the plan. Members, please go out and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you and thank you all for coming out and addressing the council on this issue. And, of course, we look forward to working with the community and industry, certainly on the next discussion around the freeway piece. Next item, please.'"
    ],
    "Recommendation to approve the Magnolia Industrial Group Property and Business Improvement District Annual Report and Assessment for the period of December 1, 2015 through November 30, 2016, automatically extending the current agreement with the Magnolia Industrial Group, Inc., for a one-year period; and authorize payment of $1,511 in City property assessments from the General Fund (GF) in the Public Works Department (PW).   (District 1)": [
        "'speaker_1': 'Report from Economic and Property Development Recommendation to approve the Magnolia Industrial Group Property and Business Improvement District Annual Report and assessment for the period of December 1st, 2015 through November 30th, 2016. District one.'",
        "'speaker_0': 'Staff report.'",
        "'speaker_10': 'Mr. Conway.'",
        "'speaker_0': 'Mayor Garcia, members of the City Council, decide on releasing the Magnolia Industrial Group Property Business Improvement District. The approval of its annual report and the extension of the management agreement with Magnolia Industrial Group for an additional one year period as allowed by their management plan.'",
        "'speaker_0': 'The Big Board is allowed to raise this assessment rate by 4% per year, but the board voted instead to raise the assessment by 1.56%. The city owns property within the bid boundaries and its assessment is $1,511, which its budget budgeted in the Department of Public Works.'",
        "'speaker_0': 'Staff request approval of the recommended action. And this concludes my report. Thank you. There's been a motion by Councilwoman Gonzales and a second by Councilmember Ringa. Is there any public comment on this item? Kate. Seeing nonmembers, please go and cast your votes.'",
        "'speaker_1': 'Councilman Austin. Motion carries.'",
        "'speaker_0': 'Item 14.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute any and all documents necessary for an Amended and Restated Lease and Operations Agreement No. 22697 and concurrent assignment to Urban Commons, LLC, as Successor Lessee to Garrison Investment Group, LLC.  (District 2)": [
        "'speaker_1': 'A report from Economic and Property Development Recommendation to execute an amended and restated lease and Operations Agreement and concurrent assign assignment to Urban Commons District two.'",
        "'speaker_0': 'Thank you. I'm going to turn this over. I know we have a pretty large presentation or in-depth presentation. I know the council obviously had some closed session conversations on this. And so now we're having an open, open session discussion.'",
        "'speaker_0': 'So. Mr. West.'",
        "'speaker_10': 'Yes, Mr. Mayor. Council members, as we all know, the Garrison Group inherited this project from Save the Queen. The Garrison Group isn't a land developer. So what we're doing tonight will facilitate urban commons to take over the lease.'",
        "'speaker_10': 'They will be a land developer for those 45 acres, as well as managing the queen. And Mike Conway is going to give us the details of this restated lease and presentation.'",
        "'speaker_0': 'Thank you, Mr. West. Mayor Garcia, members of the City Council. This item involves the Queen Mary leasehold and staff's recommendation to enter restated lease with the proposed successor, lessee. Give us an investment group. Our current lessee seeks to assign its interest in the Queen Mary leasehold to urban commons, the proposed successor lessee and for the city and'",
        "'speaker_0': 'urban commons to enter a restated lease that will continue first class operations of the ship. Secure ongoing funding for historic restoration and preservation. And stimulate shoreside development. And increase the stature of this important city asset. From a visual perspective, the Queen Mary leasehold includes the ship and surrounding and rackmount 43 acres of adjoining land and 11.5 acres'",
        "'speaker_0': 'of adjoining water area. The leasehold includes the ship, the Spruce Goose Dome, access to the Carnival Cruise Lines dock, a joint parking garage, surface parking a sublease to a Catalina Express and a separate lease that allows limited use of the events park.'",
        "'speaker_0': 'Further from a visual perspective, access to the leasehold is restricted by the southerly terminus of the 710 Freeway, which is severely impacted by Port Trucking uses. And its access is primarily from the Magnolia Avenue Bridge. And as background, in 1995, the city entered a 66 year lease with Queen Queens Seaport Development Inc, controlled by Joseph Predator, who'",
        "'speaker_0': 'in 2005 declared bankruptcy due to nonpayment of percentage rent. In 2007, Save the Queen LLC purchased the leasehold interest out of bankruptcy. In 2009, Save the Queen defaulted on its loan from Garrison Development Group, who subsequently took over day to day management of the Queen Mary.'",
        "'speaker_0': 'Under terms of the bankruptcy agreement, Garrison completed over $5.3 million in capital improvements on the ship. In 2011, Garrison completed an historic inventory report, which identified over 4700 historically significant items on the ship, and they also hired Evolution Hospitality to operate the ship.'",
        "'speaker_0': 'Evolution has brought such signature events as chill and distinctive exhibits such as Princess Diana, which have served to increase attendance and hotel occupancy and improve the public recognition and reputation of the Queen Mary. Additionally, Garrison continued his financial investment into the leasehold by completing over $8 million in additional upgrades to restaurants, retail stores, hotel amenities, historic restoration'",
        "'speaker_0': 'and new exhibits. More recently, in cooperation with city staff, Garrison developed a conservation management plan and is in the process to complete a Historic Structures Report and Marine survey and another noteworthy success with the completion of the fire alarm upgrade and certification.'",
        "'speaker_0': 'This slide provides a partial list of the upgrades and renovations that Garrison has funded and implemented with Evolution, Hospitality and the historic resource advisor, John Thomas. And resulting from these significant capital investments. Updated, upgraded. Guestrooms and restaurants. Unique and attractive.'",
        "'speaker_0': 'Attractive exhibits and widely popular special events. The Queen Mary has received many awards and accolades since Garrison and Evolution have managed the Queen Mary. Additionally, Garrison has delivered on the requirements established through the Bankruptcy Court, as demonstrated in reports prepared by the city auditor.'",
        "'speaker_0': 'Now. I'll go through a few before and after pictures. This is the first one of the signature smoked smokestacks of the Queen Mary, which are freshly painted. State room upgrades which have improved the guest experience. Renovation of the Promenade Caf, which has improved the look and feel of this eating venue.'",
        "'speaker_0': 'Similarly, Sir Winston's, the Queen Mary's sophisticated eating establishment has been superbly renovated, receiving enthusiastically positive reviews. Chelsea Chowder House now has a more intimate and classical dining atmosphere. The Queen's Salon has been transformed into a first class venue, and the main entrance has been spruced up a little bit and added some modernization.'",
        "'speaker_0': 'And one of the more overwhelming tasks is maintaining the teak deck, which is an ongoing event. But when completed, the difference is truly astounding. So Garrison's successes. So since 2009, the status of the Queen Mary can only be described as a success.'",
        "'speaker_0': 'Garrison has invested over $13 million in capital improvements, upgrades and restoration. Garrison An evolution has brought us Churchill, the Princess Diana exhibit and many historic restorations to original character and quality. City staff believe that Garrison has an extraordinary job of maintaining and improving this unique and world renowned icon, and with evolution as their operator, have significantly enhanced'",
        "'speaker_0': 'the reputation of the Queen Mary and consequently of the city of Long Beach. As staff, I would like to thank Long Win and Chuck Pomeranz from Garrison, John Jenkins and Shaun Monarch Maddock on Evolution, and John Thomas, their historic resource advisor.'",
        "'speaker_0': 'They have not only been great partners, but extraordinary servants, stewards of this international icon who are in the audience with us this evening. And now, as City Council considers the future of the Queen Mary, it's important to recall that there are unique challenges to both hotel operations and landside development.'",
        "'speaker_0': 'These challenges affect land use density, market limitations, access and congestion, all of which serves to increase the risk associated with maintaining and growing hotel revenue and successful land development. These higher risks serve to require an increased level of equity and higher cost of debt than more traditional developments.'",
        "'speaker_0': 'And for a bit more detail, there is essentially a single point of access to the Queen Mary, which is shared by the port and its related truckers. The Queen Mary is surrounded by water and the port of Long Beach, severely limiting the market from which to draw visitors.'",
        "'speaker_0': 'Any development will need to draw up from up to a 60 minute driving time in order to remain successful. Also, tidelands land use restrictions is the limiting factor which serves to further increase risk and limit development. To help gauge development alternatives.'",
        "'speaker_0': 'Three Demand analyzes have recently been completed and the results identified three primary uses for the land. The first being a boutique hotel to supplement the Queen Mary and support Carnival Cruises. The second is an entertainment complex for special and ongoing events with support of food and beverage venues.'",
        "'speaker_0': 'And the third is a Mega-Yacht marina to accommodate larger personal watercraft that have limited berthing opportunities. These analysis suggested a number of entertainment uses to be considered, which include live music themed restaurants, open air markets, waterfront activities, children's entertainment and possibly college classrooms.'",
        "'speaker_0': 'So today, the Queen Mary is faced with a few issues. The existing lease is overly cumbersome. Percentage rent is unreliable. Carnival Cruise Line seeks to expand its presence in Long Beach and needs additional space in the Dome. Development opportunities are limited, and certain incentives are necessary in order to compel land development.'",
        "'speaker_0': 'And so to address these issues, four goals were identified. Number one, ensure the continued first class operation of the ship. Number two, ensure secure ongoing funding for historic restoration and preservation. Three, Ensure a well-capitalized, market driven, high quality, entertainment oriented development.'",
        "'speaker_0': 'And number four, ensure the availability of the dome for expanded cruise operations that increase the passenger count and enhance the guest experience. So for goal number one, staff proposes that a restated lease require the following establish a hotel operations, maintenance and furniture, fixtures and equipment fund starting at 1% of gross revenues and increasing to 3% by year'",
        "'speaker_0': 'five. To fund ongoing maintenance and replacements, establish a new base maintenance plan. Establish a nonprofit foundation to assist in fundraising for historic restoration. Complete and implement the Historic Preservation and Capital Investment Plan, Conservation Management Plan, Marine Survey and Historic Structures Report and prepare and implement a transition plan.'",
        "'speaker_0': 'Four goal two staff recommends that the restated lease require that an amount equal to current passenger fees up to $2.15 per passenger be paid to the city to be used for capital investment and historic restoration and preservation. For the first five years, this amount passed through to the city will be fixed at $2.15 million to compensate urban'",
        "'speaker_0': 'commons for this lost revenue. Staff recommends a preferred annual Non-Cumulative priority return of 9% on both the initial investment and eligible capital improvements. Revised percentage rent to be 10% of operating revenue above the base rent and after priority return has been paid.'",
        "'speaker_0': 'Base rent will continue at $300,000 per year, increasing every ten years by CPI and capped at 40%. This reflects a 3.4% annual rate and the city shall participate in net profits of any sale or refinance of the leasehold interest to a level of 25% of net proceeds for goal number three.'",
        "'speaker_0': 'Staff recommends extending the term of the lease to 66 years to provide for recapitalization opportunities, provide for financeable subleases for land development, require city consent for any assignments or encumbrances. Establish a land value by appraisal and require a return on land value when the land generates revenue starting at 3% and increasing to 7% over five years.'",
        "'speaker_0': 'Adjust the land value every ten years by CPI capped at 40%. This also reflects a 3.4% annual rate. Require implementation of financial reporting practices as recommended by the city or author auditor and require participation, support and cooperation of the Queen Mary Task Force in Development, Design, Outreach and Entitlement.'",
        "'speaker_0': 'And the First Queen Mary Task Force meeting has been scheduled for January 6th of 2016. So design, outreach and entitlement will finally begin. For goal number four as a result of Carnival's interest in increasing the size of its ships, servicing Long Beach and as an incentive for the successor lessee to quickly pursue development to allocate the entire'",
        "'speaker_0': 'Spruce Deuce Goose Dome to carnival for its passenger embarkation and disembarkation needs. And to enhance the guest experience, Garrison conducted an exhaustive search for a highly qualified and well-capitalized successor, lessee. Garrison identified urban commons as their preferred successor.'",
        "'speaker_0': 'Lessee and city staff has spent the last year working with urban commons to ensure that their team are sufficiently experienced, motivated and capitalized to maintain first class operations of the hotel, continue significant capital investment and historic restoration and preservation, and immediately pursue land development.'",
        "'speaker_0': 'Staff is pleased to join Garrison in recommending urban commons as the successor lessee. Urban Commons has assembled an impressive team to work with the Queen Mary Task Force to begin development, design and public outreach for landside development with First Harrigan, Gensler, Architects, Burnham and Associates, John Thomas and Global Hospitality Group.'",
        "'speaker_0': 'The Urban Commons team is ready to meet with the Queen Mary Task Force and begin its outreach efforts. As a little bit of context, this slide shows the hotels owned and or operated by Urban Commons just in California with a preponderance in Southern California.'",
        "'speaker_0': 'And this slide shows urban commons development projects, which are entirely in Southern California. This is the Urban Commons team headed by Howard Wu and Taylor Woods, who assembled a formidable and local team. Urban Commons will retain evolution hospitality to ensure a seamless transition, and John Thomas will continue as its historic resource officer.'",
        "'speaker_0': 'As development opportunities are refined through the outreach and engagement process, additional specialized team members will be added to augment expertize in market segments identified during the engagement process. So with that, staff recommends that City Council authorize the city manager to execute a restated lease and concurrent assignment to Urban Commons LLC as successor lessee to Garrison Investment Group'",
        "'speaker_0': '. And this concludes my presentation. I'm available to answer questions. Thank you. Before I turn this over to Vice Mayor Lowenthal, who will lead the conversation in a being second district and being the creameries in the second District, I want to start off doing public comment first.'",
        "'speaker_0': 'And so if there's any members of the public that want to comment on this issue, now would be the time.'",
        "'speaker_8': 'It looks.'",
        "'speaker_7': 'Like this. I think. Smarty pants.'",
        "'speaker_8': 'Jim McCabe. Many of you are familiar with me. I'm a retired deputy city attorney. Just as a starter, this agenda item is pretty glaringly in violation of the Brown Act. The the agenda item doesn't even mention the Queen Mary.'",
        "'speaker_8': 'If you're familiar with operations agreement 22697. That's fine. But the general public is not familiar with that. This is a clear violation of the public. Oh, excuse me. That the Brown Act and I think it should be of concern to all of you, because if it's found to be null, to not be.'",
        "'speaker_2': 'Sufficient, what you do tonight will.'",
        "'speaker_8': 'Be null and void. I am informed that the city gets rent now. That was true of the lease that I wrote and I think it is principally still in effect. Please be sure that the. City. The Tidelands Beaches Recreation will receive nothing from this lease.'",
        "'speaker_8': 'There is $300,000 in purported rent that goes right back into the ship that we we're giving away for 66 years. A new 66 year period. We'll never get the 10% of gross revenue rent because obviously this is a net profit situation in which you'll never get any rent until.'",
        "'speaker_8': 'Urban gets a whopping 9% of its return on its return every year for the next 66 years. We've been told by the city manager that this is an urban development property, but nothing in the council letter mandates that any development be done.'",
        "'speaker_8': 'And on the land parcel and not. There is no downside for the proposed lessee if it doesn't. This is a very sweet deal for Urban entered into with almost no public notice. I appreciate your attention. I obviously answer any questions if you want to add some.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening, council and mayor and control. And I agree with the previous speaker that there was no public notice given for this item. I read through. The agenda for this week. And I didn't see anything about the Queen Mary.'",
        "'speaker_6': 'So I am unprepared to address anything having to do with this lease. Just reading the agenda item does not give you any clue that this is about the Queen Mary. I also have a question about the developer, the land that is going to be developed along with the ship.'",
        "'speaker_6': 'I heard a brief mention of the events park. And I'm wondering, is this what is often what the name of this park, as I understand it, is the Harry Bridges Events Park that is near the Queen Mary. And I would like to know if that is being included in what can be developed.'",
        "'speaker_6': 'As I understand it, this is part of the city's parks and recreation. Parks and I question whether this can be developed. Thank you for answering any questions.'",
        "'speaker_0': 'Thank you. Another one, please come down, Larry. Any other public speakers besides Mr. Goodhue? Any other ones? Nope. Okay. Mr.. Good to be the final speaker.'",
        "'speaker_2': 'Very good. CLERK As they address the olfactory senses, they're triggered immediately when you see a 9% return. Which is a healthy or very healthy return. In today's economy. I'd like to see what you have refused and are scared to get from the city auditor relative to having her do an audit on the city hall project or didn't'",
        "'speaker_2': 'even get one for the port of for the courthouse. Certainly you should get one here. And I don't know, I'm not I've I'm not a financial wizard, but I know if somebody is getting 9%. Somebody else has taken it out the rear.'",
        "'speaker_2': 'So that boils down to and that may be the city of Long Beach. So I would suggest a thorough audit by somebody other than willy nilly and Madoff. Madoff to. And whatever the lease has. The one thing I want to make sure that is not in there is that we don't have a flea market, a farmer's market'",
        "'speaker_2': ', or an arts and crafts show. And the lease should specifically prohibit those. If you're going to spend the type of dollars that you're going to use, we don't the people that are going to spend the type of dollars sufficient to get a return for that investor, aren't interested in a flea market, an arts and crafts show or'",
        "'speaker_2': 'anything approaching it. So make sure that lease echoes that sentiment. Thank you.'",
        "'speaker_0': 'Thank you. I'm gonna turn this over to the vice mayor before I do so. Just to clarify. And I was brought up. I know, Mr. City Attorney. Now, as I read the counsel item, I know that the Queen married in the first sentence of the discussion, and it opens with that.'",
        "'speaker_0': 'But just to confirm with you. This item clearly meets all the posting requirements and the standard legal test.'",
        "'speaker_9': 'That is correct.'",
        "'speaker_10': 'I would disagree with the speakers of under government code section 54 nine 54.2. Agenda must contain a general brief description of each item of business to be transaction transacted or discussed in here. Clearly, the.'",
        "'speaker_9': 'Item being discussed is the amended and restated lease.'",
        "'speaker_0': 'And it provides the exact least number. Thank you. With that, I'll turn this over now to Vice Mayor Lowenthal.'",
        "'speaker_5': 'Thank you, Mr. Mayor. And thank you, Mr. City attorney. Also want to thank the speakers for sharing their thoughts about this. I know certainly some of you have been involved with the Queen Mary, at least been interested with the Queen Mary for a very long time.'",
        "'speaker_5': 'And that's something that we share in common. We on the council, as well as those in the community, I have been working with the Queen Mary the entire time I've been elected to office. And so that's nearly ten years have seen.'",
        "'speaker_5': 'Somewhat of its entire lifecycle pretty much in the last ten years, the bankruptcy, the assumption of the lease by garrison and some steps before that. But this is a big deal for us and I know it. Mr. Conway doesn't make presentations with as much fanfare as certainly I know is involved with the moment that we are embarking'",
        "'speaker_5': 'upon. But it is a big deal. This is the best thing that I have seen for the Queen Mary in the entire time that we have discussed this for a decade to bring her back to her glory. She is nearly back and I have to thank Garrison for that.'",
        "'speaker_5': 'They've done a good job of stepping into the management role of Queen Mary and surrounding properties, even though it was not their original role or their original mission. And I think garrison for that, for stepping up and doing that.'",
        "'speaker_5': 'So they have brought.'",
        "'speaker_6': 'Back.'",
        "'speaker_5': 'The various parts of the ship that they have been working on and really kind of short her up. And so I'm thankful for that. They've lived up to the conditions of their lease and brought on the necessary partners to manage the hotel and restore the Queen Mary according to the Conservation Management Plan.'",
        "'speaker_5': 'And that's important to us. So I do think them for that. However, the Queen Mary and her surrounding property have the potential to be so much more. And given what we have done in the downtown proper to restore life and energy and vitality as well as improve the area economically, I think it's time that this type of'",
        "'speaker_5': 'attention is paid to the Queen Mary as well. And that's why I'm very optimistic with this new lease urban commons, we will take the next step with you and a step toward development of the acreage around the ship in a manner that enhances our downtown and our shoreline.'",
        "'speaker_5': 'And I think the timing couldn't be better. I'm also confident that will include our Queen Mary Land Development Task Force in the most effective manner possible. I know they had their first meeting recently, and I know they're very excited to be a part of this process.'",
        "'speaker_5': 'So, Mr. Mayor, I'm very supportive of this recommendation. I look forward to working with Urban Commons to deliver on the terms of their lease and the potential of this site. I also want to share that I am personally committed to the improvement of this ship.'",
        "'speaker_5': 'It's something that I think each of us feels to some degree, but we all have an affinity for the Queen Mary here in Long Beach, and I am very happy to see this through. Ten years in the making, from where it was ten years ago to today and where it can be.'",
        "'speaker_5': 'I thank you for that. And thank you, Mr. Conway.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_4': 'I just want to thank Mike for this great presentation. I know as Vice Mayor Lowenthal mentioned, the upgrades and renovations are just astounding to see where we were at and then just the stacks alone. I mean, an incredible improvement to our beautiful landmark here.'",
        "'speaker_4': 'And I thank you for your work in this. I think we certainly had a long way to go. And this is timely as we are changing the downtown, as things are getting a little bit better. And yes, the surrounding does need to certainly change and we need to look beyond what we currently have.'",
        "'speaker_4': 'And so I want to thank you for that, for bringing that to light. Mike, I just had a question as far as additional outreach. I mean, is there going to be like a new marketing plan of some sort or how would that be?'",
        "'speaker_6': 'Um.'",
        "'speaker_0': 'Councilmember Gonzales, I think we'll start with the Queen Mary Task Force to get an idea of how we can or how urban commons can coordinate with them and the outreach efforts. So I think we'll take some guidance from the from the task force.'",
        "'speaker_4': 'Great. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Richardson.'",
        "'speaker_3': 'I want to just take a moment to again and this is my second or third time tonight just congratulating folks on a legacy project. This is the second or third thing I've seen tonight at the council that really is fantastic work that represents, you know, not only the leadership in and our vice mayor's district, but also the'",
        "'speaker_3': 'great work staff has done. So I'm really excited about what's to come with Queen Mary. When I you know, I'm not from California, but when I before I lived in California, there were three things I knew about Long Beach.'",
        "'speaker_3': 'It was Snoop Doggy Dogg. It was the Port of Long Beach and the Queen Mary. So this is in the you know, this is this is big, right? This is this is really big. And so I want to congratulate our vice mayor in her her her hard work, the entire city council, the mayor, the task force staff'",
        "'speaker_3': '. I'm really excited about what's to come. And this is going to be big for tourism in our city. Thanks.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_4': 'Thank you. I have a few questions.'",
        "'speaker_12': 'In regards to.'",
        "'speaker_4': 'The I know we have the task force in place, but what can you tell us in terms of development plans, development, desire? Given your your knowledge of the project and the partners that we're going to be working with?'",
        "'speaker_0': 'Councilmember Price There has been some considerable discussion as to potential uses on the site, and as the demand analyzes indicated there, it will likely be entertainment oriented. Hurst Harrigan is on the Urban Commons team. They are a preeminent consultant relative to entertainment development in the South Land and we think that's the likely direction that development will take'",
        "'speaker_0': 'for the land side. But we want to make sure that we don't prejudge what will come out of the task force and what will be communicated through outreach in the downtown to the Greater Long Beach area. But we expect that given the constraints of the site and the Tidelands restrictions that entertainment uses are likely going to be'",
        "'speaker_0': 'predominant on that land. But the actual elements we would like to get more feedback from the community and the task force on that.'",
        "'speaker_4': 'But you see development at that site as a. Foregone conclusion.'",
        "'speaker_0': 'The If I understand your question correctly, Urban Commons has been patiently waiting to start the outreach and development process. They're anxious to get started. Okay.'",
        "'speaker_4': 'And then I know we talked about the Dome and Carnival's use of the dome. I happened to be at a conference at the Queen Mary every day last week. So I got to spend a lot of time on the ship, as well as a lot of time talking to people whose first time it was in Long Beach'",
        "'speaker_4': ', who were in the conference with me and who were on the ship for the first time. So I made a lot of kind of user observations. And what, if any, requirements do we have for the maintenance or the updating of that dome?'",
        "'speaker_4': 'It really does not look like it's in good shape at all. I don't think it's been cleaned in a while.'",
        "'speaker_0': 'The dome is under the Garrison's lease currently and there has been a request by Carnival to have the dome cleaned. Evolution Hospitality responded to that request, indicating that as soon as the event that is occurring in the dome is completed, that they would move forward and clean the dome.'",
        "'speaker_4': 'And are there any sort of maintenance requirements moving forward? Because, you know, it does reflect on on the city to a large extent. And to nicely.'",
        "'speaker_0': 'Garrison is required. Currently, Garrison through evolution is required to maintain the dome. In informal discussions with Carnival. There is an expectation that significant investment will occur in the Dome once they take it over. We can't get into detail.'",
        "'speaker_0': 'The city doesn't have a direct relationship with Carnival, but we expect an investment to occur shortly.'",
        "'speaker_4': 'All right. Well, thank you for your report. And thanks to the vice mayor for the information she's provided and the work that you've all done to educate us all tonight. Thank you.'",
        "'speaker_0': 'Thank you. And just to bring a little more clarity from what I understand, that as soon as chill is over, they're going to clean the dome from when, say, the the emptied out and the clean the both the outside and the inside.'",
        "'speaker_0': 'Vice Mayor Lowenthal.'",
        "'speaker_5': 'Thank you again, Mr. Mayor. I was eager to have the task force start and misspoke, actually. I only imagine that they've met. They have not met yet. They plan to meet in January, but I know they're looking forward to it.'",
        "'speaker_0': 'Thank you, Councilman Andrews.'",
        "'speaker_2': 'Yes. First of all, I'd like to thank Mr. Conway for the fine job. He's, you know, taken on with this new a vice mayor in your district. But I can see nothing but a win win for this situation.'",
        "'speaker_2': 'And knowing the job that you guys are going to, you know, take it from looking at the pictures that you put up here. It shows me that I can go back to the Queen Mary and get away from those ghost stories I used to hear about.'",
        "'speaker_2': 'So you guys keep up the good work and kudos because I will be going back with my family again. Thank you.'",
        "'speaker_0': 'Thank you. We're going to before we go to the vote, I'm going to make a couple a couple closing comments. There's no question that the Queen Mary is an icon of the city of Long Beach. When people think of Long Beach, they think of the Queen Mary.'",
        "'speaker_0': 'There's incredible history. There's incredible military history tied to that ship. There's history in the way Long Beach was developed and certainly as the way our country was developed here and in California. So when you think about the the value that that ship has, it's really you can't really put a price on the cultural icon that it really'",
        "'speaker_0': 'is. And so to be able to finally get to a point where we're going to look at the land surrounding the ship and develop it in a way that's appropriate, that's community oriented, that maximizes the space, but also brings more people and draws more people to the ship while reinvesting back into the ship and into and into'",
        "'speaker_0': 'the dome, I think is is critical. I think it's we shouldn't vote without also thinking officially a garrison. You know, Garrison came in at a very difficult time in the Queen Mary's history. The Queen Mary has had a a rough history in the last ten, 15 years.'",
        "'speaker_0': 'And so the fact that Garrison stepped in when they did, made the investments that they could, reinvested it back into upgrades on the ship. Now, the ship is not in perfect shape. There is a lot of investment that still needs to happen.'",
        "'speaker_0': 'But you can't argue that the ship today is in much better, but in a much better position and improved from a historical landmark perspective than it was before Garrison came on board. And so thank you to Garrison for those investments.'",
        "'speaker_0': 'And we know that now, as this transitions over to urban commons, which I've had obviously a chance to know, the vice mayor has had a chance to to meet with them. We're bringing in a group that has experience with development, and Garrison never intended to be the master developer on the site.'",
        "'speaker_0': 'And what we really have an opportunity now to do is to build out a part of downtown Long Beach that has been dormant, in many cases empty and with and has not met its potential. So this is an opportunity to build something spectacular adjacent to the Queen Mary.'",
        "'speaker_0': 'It's a chance to build something that respects the fact that the Queen Mary is the centerpiece and will be the centerpiece of this development. And we look forward to in in the coming months when the community process kicks off in January with the first meeting of the task force.'",
        "'speaker_0': 'We're going to engage in a very, I think, a very open and transparent process where the community can come in and be able to comment on on on the plans that Garrison and the task force are going to develop in the in the coming months.'",
        "'speaker_0': 'And so we we're excited to, in the future, break ground on that project and build something the whole community can be proud of. And that, of course, respects the great beauty of the ship. And so thank you, Garrison.'",
        "'speaker_0': 'And. And if all goes well here. Hello. Urban comments. And we'll begin that relationship. And with that. Members, please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you and thanks again for for that next item, please.'"
    ],
    "Recommendation to authorize City Manager to execute all documents, and any needed subsequent amendments, with the Department of Defense through the Office of Economic Adjustment, to accept funds totaling $3,995,609 funded by the Community Economic Adjustment Assistance for Reductions in Defense Industry Employment to implement a project that would address the economic and workforce impact of the C-17 plant closure, for the term of June 1, 2015  through September 30, 2016; execute a contract with Bluedrop Performance Learning in the amount of $2,500,000 to develop web-based platform materials to assist dislocated workers in transitioning their skills; and   Increase appropriations in the Community Development Grants Fund (SR 150) in the Economic and Property Development Department (EP) by $3,645,609.  (Citywide)": [
        "'speaker_1': 'Report from Economic and Property Development recommendation to accept funds totaling 3.9 million funded by the Community Economic Adjustment assistance for reductions in defense industry employment and execute a contract with blue drop performance learning in the amount of 2.5 million to develop web based platform materials citywide.'",
        "'speaker_0': 'Thank you. Councilman, actually, let me turn this over for our staff report. We have a quick report from.'",
        "'speaker_10': 'Nick Schulz, executive director of the Workforce Investment Board. Good evening, Honorable Mayor Garcia, members of council. The item before you is the acceptance of an award from the Department of Defense Office of Economic Assistance under the Defense Industry Adjustment Program and is related to the impending closure of the Boeing facility in Long Beach due to elimination in'",
        "'speaker_10': 'the C-17 weapons system. Air support for communities, in fact impacted by factory closures and laid off employees focuses on developing adjustment and implementation strategies. Our local adjustment strategies focus on regional job creation through business development and expansion, workforce development and community economic diversification.'",
        "'speaker_10': 'Pacific Gateway aggressively pursued this program because we understood the uniqueness of the defense industry can create obstacles for communities affected by defense downsizing because firms and workers develop specialized skills and competencies designed to serve designed to serve government and military customers.'",
        "'speaker_10': 'They are challenged when trying to enter new markets and new sectors. Second, we know we must plan for the long haul and assume that we will not immediately be able to replace all the lost defense jobs. Replacing those jobs or adding new jobs in the communities is a long term proposition, and it is unlikely that a single'",
        "'speaker_10': 'new employer will ever absorb the entire impact. Instead, we are focused on developing strategies that support multiple economic drivers to replace lost defense jobs. When faced with downsizing, large defense contractors opt to remain focused on defense and government business, while in contrast, many smaller firms in the supply chain have interest in pursuing new markets or diversification opportunities'",
        "'speaker_10': '. We want to help local firms assess their competitive assets and challenges and design appropriate strategies for new business development by focusing on strong partnerships and a commitment to change as critical success factors. We believe we can ensure a successful community transition occurs.'",
        "'speaker_10': 'Thank you and I'd be happy to answer any questions.'",
        "'speaker_0': 'Thank you. Is there any public comment on this item seen on Councilman Richardson?'",
        "'speaker_3': 'Just want to take a moment and again, say congratulations. This is yet a second week of of great work represented on our agenda from our workforce organization. And I look forward to seeing the cumulative totals when we review our federal legislation by the numbers, because I have a I have a I'm going to guess that we're we're'",
        "'speaker_3': 'we're we're going to be well ahead of where we were last year in terms of our performance and in receiving federal support. So congratulations and great work.'",
        "'speaker_0': 'Councilman. Mango. I'm sorry. My apologies. Councilman Austin.'",
        "'speaker_8': 'Thank you. And I'd also just like to say congratulations. I think this is this is good news, as good as it can get with considering that we are we're dealing with a plant closure. I can remember when the career transition center was was developed originally to deal with major reductions in force with the job losses associated with'",
        "'speaker_8': 'the McDonnell Douglas and Boeing back in the nineties. And this is this is bittersweet. So I think this is good. I'm a little kind of curious because I know that most of the workforce that that has will be leaving or that has left the the plant there.'",
        "'speaker_8': 'Many of those are 20 plus year employees and curious what type of retraining they will have as through through this service. Do you have any specifics on that? Mr..'",
        "'speaker_10': 'So actually, this is very different than anything we've brought forward to you before. This actually doesn't fund retraining specifically as Department of Labor will pay for that training. And we do have a national emergency grant to fund specific skill development for laid off Boeing workers in the pipeline.'",
        "'speaker_10': 'What the OJ grant does is actually allow us to build infrastructure that extends our reach out. So professional employees, those folks are sometimes hesitant to walk into a center like we operate, or those folks who actually have the skills to navigate the career pathway and access specific services on their own.'",
        "'speaker_10': 'This platform will actually extend our whole suite of services, as well as take the training courses offered by our partner providers, the ones that they can afford through online access. This will actually make those trainings available to folks without ever having to walk into our center or into a classroom.'",
        "'speaker_8': 'Thank you, Mr. Schulz. And I'm not sure if you mentioned how we we identified this fund or these funds.'",
        "'speaker_10': 'So actually, the Office of Economic Adjustment had actually worked with Long Beach as a community before when the Navy was in town. It is not a competitive solicitation like many of the things we move forward. It's specifically for a community that loses a prime defense contractor similar to the BRAC process you would see when a base would'",
        "'speaker_10': 'close.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'I want to thank our our team again for doing such a great job on this. Many of my colleagues joined me last night at the grand opening of Mercedes in the old MD. Facility. And as we transition the supply chain of the region, it is great for our city to be a leader in this, and it would'",
        "'speaker_1': 'not be possible without the great work. Thank you to the city manager and the Workforce Development Team. Nick, you have been a beacon of light for this city since you've started. We just cannot say enough about the great work that you've done and the number of new jobs that are going to be in the pipeline.'",
        "'speaker_1': 'So look for another council agenda item coming soon that will help our Long Beach residents get these these best and brightest jobs. We were already out there meeting. I met with a couple of VP of the companies within the last week, and I can't wait to bring that on board.'",
        "'speaker_1': 'And I know that with Nick's help, it'll be a successful project. So thank you all.'",
        "'speaker_0': 'Thank you, Councilman Ringo.'",
        "'speaker_9': 'Thank you very much. I also want to give kudos to staff for bringing this forward. I do have a couple of questions in regards to the length of this funding. Is it a one year, two year project one?'",
        "'speaker_9': 'How long it's going to go.'",
        "'speaker_10': 'Current amount you will be approving runs through September of 2016. Based on the progress in the deliverables of the plan, we have the opportunity to continue to find relevant, relevant projects through.'",
        "'speaker_9': 'And what would some of those delivery deliverables include, such as.'",
        "'speaker_10': 'Deliverables are in three categories. First categories economic development and planning that include that includes a data collection and analysis of existing industries. It includes and industry cluster mapping as well as public engagement around the economic drivers and growth opportunities for the Long Beach community.'",
        "'speaker_10': 'The second part of the grant revolves around land use and infrastructure planning. This is with regard to long time, long term use or transition of the facility. So there's a financial feasibility analysis involved with that land use and infrastructure planning as well as a C-17 transitional master plan.'",
        "'speaker_10': 'And that would be developed based on opportunities that that are shown to have promise out of the economic analysis that's conducted. And then the third piece of the plan that we've talked about in Councilmember Austin's questions is the assistance to impacted defense firms and workers.'",
        "'speaker_10': 'And that's there's. The C-17 defense and dislocated worker platform, as well as direct assistance to C-17 supply chain firms.'",
        "'speaker_9': 'Yeah, that that third component was one that has most interest for me in the sense that do we have some kind of background on these employees as to a level of experience, education, ability to transition to other jobs in the in the not only in that in their own industry, but transition to jobs locally within within their'",
        "'speaker_9': 'own labor market here. And also perhaps even and we will have many opportunities within the city of Long Beach with perhaps some positions within the city itself.'",
        "'speaker_10': 'So fortunately, Boeing's complied with all their notice requirements under the WARN Act. We do have both positioned and positioned in number in each position and job descriptions related to almost 1600 folks impacted by the final closure. We're able to do some talent mapping with that.'",
        "'speaker_10': 'Look at the knowledge, skills and abilities of those folks coming out of the coming out of the Boeing closure and then map that over to existing opportunities in the labor force. And if there is not a consistent or highly predictive match for them to gain reemployment quickly to take a look at training opportunities that we have available'",
        "'speaker_10': 'locally that would help to close the skill gap and get them reemployed.'",
        "'speaker_9': 'Finally, in regards to the last part you spoke about, in terms of the mapping, the opportunities for retooling, retraining obviously is important. Are they going to be connected somehow with our OPI programs or lobby City College should they want to continue their education or enhance whatever it is they have?'",
        "'speaker_10': 'Again, there's we can have more of that discussion when we bring forward the specific request for for to accept the training dollars related to the laid off worker. Again, those will be federal workforce investment dollars that assist in that regard.'",
        "'speaker_10': 'So we are. Mandated to use what they call the employment training provider list. It's a state sourced list. You have to pass the standards set by the Bureau of Post Post-Secondary and Private Education, and you have to meet performance to continue to be on that list.'",
        "'speaker_10': 'Local rope programs, local Long Beach City College programs, CSU ALB PA programs, as well as private proprietary programs appear on that list.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Any public comment on the item?'",
        "'speaker_2': 'Very good, Kirk, as he addressed this is an interesting fund. I've never I never have gotten inside of it. But I'm wondering, in all seriousness, whether or not. This fund or a fund like it from the federal government might be used.'",
        "'speaker_2': 'To take the aircraft facilities. And. Make that, as I suggested a couple times before of it using. That our new City Hall complex period. We could put nine floors there especially. Certainly that building is more than ample to handle on one floor.'",
        "'speaker_2': 'What we have here are nine floors. And other city offices. Let's examine the possibility. See whether or not those funds exist. The case could be made that this is also as a result of employment. Industry is city wide in the in due to the reduction of military service and so forth or of military equipment or demand, therefore'",
        "'speaker_2': '. So let's take a look at that if that money is there. One other quick, very quick footnote on the Queen Mary. Since you are the Stewarts, please never again refer to the funnels as smokestacks.'",
        "'speaker_0': 'Larry, that's a wrong a wrong item. So thank you very much. Members, please go ahead and cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item, please.'",
        "'speaker_1': 'Report from Financial Management Recommendation to execute a contract with the Mobile Source Air Pollution Reduction Review Committee to receive and expand local government match program funds in the amount not to exceed 1.4 million citywide.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager to execute a contract with Los Angeles Truck Centers, LLC, dba Los Angeles Freightliner of Whittier, CA, for the purchase of three Autocar ACX 40, CNG-fueled, refuse collection trucks, with related equipment and accessories, on the same terms and conditions afforded to the City of Claremont, in an amount not to exceed $1,026,491, inclusive of taxes and fees.  (Citywide)": [
        "'speaker_1': 'Report from Financial Management Recommendation to adopt resolution to execute a contract with Los Angeles, Freightliner for the purchase of three refuse collection trucks in an amount not to exceed $1 million citywide.'",
        "'speaker_0': 'There was a motion and a second. Is there any public comment? Mr. Andrews. No, I wouldn't be here.'",
        "'speaker_2': 'Good evening. My name is Richard Suarez. I represent the International Association of Machinists and Aerospace Workers.'",
        "'speaker_8': 'Just a quick, quick observation on this item of.'",
        "'speaker_2': 'Purchasing new equipment for. The Refuge Department, as I've said to this council and many times, I'm concerned. I'm concerned over the safety of the men and women who toil here day in and day out. I brought to your attention just a few months ago an incident where one of our members was pricked by a needle and received'",
        "'speaker_2': 'very, very little support. I'd like to just bring to your attention that we have fought with management in this particular department to supply safety gloves. Safety gloves. And they're still not there. Safety goes. And they're still not there.'",
        "'speaker_2': 'And I would just ask any of you. If your husband or your wife or your child or your brother or your sister, if you worked under these conditions. And the want is just to have rubber gloves so that when you pick up garbage and when syringes go through those plastic bags, you don't get pricked.'",
        "'speaker_2': 'I'm fighting this fight today. This morning we received an email from Mr. West, Vicar, who's the public works department at this particular facility. And in answer to a letter that we had written to the director of public work, Mr. Malloy.'",
        "'speaker_2': 'And this is what Mr. Vicar wrote. The city does not have a job hazard analysis for refuse operators. The Department of Public Works Safety Officer Manny Jaramillo will be conducting a job hazard analysis and anticipates the process taking approximately four months.'",
        "'speaker_2': 'We've been picking up garbage in this city for 70 years. There is no known. There is an unknown hazard for our members. No one knows what the hazards are. We will see that this morning. I beg you to please not ignore me, not ignore the men and women here every day that face these hazards.'",
        "'speaker_2': 'I don't understand. I really don't understand. We can disagree on a lot of things. But don't ignore safety. Rubber gloves, folks. It's shameful. I need your help. I'm asking for your help. Thank you.'",
        "'speaker_0': 'Thank you. Let me go to Mr. West. I just want to make sure that you get the council back to response on the on this rubber glove issue. Certainly. Okay. I've heard it twice. And I want to make sure that we're the cities is responding.'",
        "'speaker_0': 'And I just want to make sure that we're before us. Is the resolution to authorize to execute the the purchase of the collect or the refugee collection trucks? Is that right? Of the of the the contract with with the truck center.'",
        "'speaker_0': 'This item is about buying of new refugees and new trucks. Right. Okay. So let me go to Councilman Austin, who was up first. If it sounds.'",
        "'speaker_8': 'Like this is a good item, new weapons refuse trucks trucks that are going to be cleaner burning energy using CNG fuel. I support the item and ask that you do the same. I mean, I'll just just speak to the Speaker's point.'",
        "'speaker_8': 'If there are some issues with personal protective equipment for our city employees, we need to make sure that we're providing the best for them to do the work.'",
        "'speaker_0': 'Thank you, Councilman Richardson.'",
        "'speaker_3': 'These trucks get a lot of wear and tear. So stand in support of the motion and let's get these guys some gloves. Thank you.'",
        "'speaker_0': 'Councilman Andrews.'",
        "'speaker_2': 'Yes, you know. Thank you, Vice Mayor. You know, I understand the need for trash trucks, you know. However, I am truly concerned about the employee's safety. You know, especially when it comes to the basic needs, like gloves. You know, we by making the dollars with the trucks and we can't get rubber gloves to these individuals for their'",
        "'speaker_2': 'own safety. And I would like to ask for a request of a memo from the city manager and what kind, you know, is currently being done to address the basic safety needs and how we can improve so that employees can meet this form of safety.'",
        "'speaker_2': 'Because this is something I think that everyone should take time to look at because these are the individuals on the front line and they definitely need some form of safety. So I don't think we can put trucks over safety when it comes to our employees who are out there on the fields doing the work.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. You're Ringa.'",
        "'speaker_9': 'Thank you, Mayor. Just one question. First of all, I want to thank staff for working on this. I know that we have one of the most green fleet fleets in the region in regards to what we're doing with our vehicles.'",
        "'speaker_9': 'However, what I am concerned about in terms of these refugees trucks is that we have parts of the city who are much more impacted by truck and car pollution. Is there a deployment plan for these trucks in regards to where they're going to be serviced or what parts of the city they're going to be deployed to?'",
        "'speaker_10': 'Dan Berlin will handle that item.'",
        "'speaker_8': 'Yes, Councilman.'",
        "'speaker_10': 'These three trucks are essentially used throughout the city. They're three of a kind. They lift the large dumpsters through the front over the front of the truck.'",
        "'speaker_2': 'So they are.'",
        "'speaker_10': 'Not deployed in any particular part of the city. They're used throughout.'",
        "'speaker_9': 'Well, I would you know, my West Miami community is highly impacted by pollution. So and I'd like to see some new trucks in that area that you.'",
        "'speaker_10': 'Councilman, I want to point out also that all of our trash trucks are are green.'",
        "'speaker_9': 'So they're they're all CNG. LNG.'",
        "'speaker_10': 'Most of the trucks right now, the majority of the fleet is LNG powered.'",
        "'speaker_8': 'Which is slightly not.'",
        "'speaker_10': 'As clean as the CNG. And that's with the exception of 14 diesel powered trucks that are held in reserve and are due for replacement in FY17.'",
        "'speaker_0': 'Thank you. Any other councilmember councilmembers have any comments? We did public comment already. Please go ahead. Castro votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Next item.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager to execute a contract with Office Depot, Inc., of Signal Hill, CA, for furnishing and delivering office supplies on the same terms and conditions afforded to Region 4 Education Service Center, of Texas, through The Cooperative Purchasing Network, in an annual amount of $1,200,000, with the option to add expenditures up to 10 percent (or $120,000), for a total annual amount not to exceed $1,320,000, for a period of two years, with the option to renew for three additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_1': 'Report from Financial Management Recommendation to adopt resolution to execute a contract with Office Depot for office supplies for a total annual amount not to exceed 1.3 million citywide.'",
        "'speaker_0': 'Is there any public comment on this item? Please come forward.'",
        "'speaker_2': 'Pleasure. Yes, Larry, good to you. Clark has the address. Let me suggest we amend this to reflect the comments relative to the last one from council members saying that we get gloves. Let's find out if these people also have those gloves.'",
        "'speaker_2': 'And if you have any doubt of the need for that, they should go home today. Look at what the wind has blown down on your sidewalk and try picking up some of those forms. They'll cut right to the.'",
        "'speaker_2': 'Slashdot. You'll have your fingers open. So you can amend this motion here to find out if these people will sell those gloves. You don't have to convene the Council of Trent to get it done. It's a pretty simple factor.'",
        "'speaker_2': 'And my sense is they may. They may even have those. Call them up and find out.'",
        "'speaker_0': 'Thank you. Neither public comment. CNN. Please cast your votes.'",
        "'speaker_1': 'Councilman Odinga. Motion carries.'",
        "'speaker_0': '20.'",
        "'speaker_1': 'Report from Financial Management Recommendation to adopt resolution to execute a contract with Office Depot for custodial supplies for a total amount. Annual amount not to exceed 1.8 million citywide.'"
    ],
    "Recommendation to receive and file the Houghton Park Conceptual Plan and consider Categorical Exemption CE 15-155.  (District 9)": [
        "'speaker_1': 'Report from Parks, Recreation and Marine Recommendation to receive and file the Howden Park Conceptual Plan District nine.'",
        "'speaker_0': 'Transformative stuff.'",
        "'speaker_10': 'Thank you, Mayor. Council members, we have a report by Parks Rec, Marine Director Steven Scott and project manager Meredith Reynolds.'",
        "'speaker_8': 'Honorable Mayor and members of the City Council. The item before.'",
        "'speaker_9': 'You tonight is to.'",
        "'speaker_8': 'Provide a brief report on the Highland Park Conceptual.'",
        "'speaker_9': 'Plan. This conceptual plan was borne out of the planning process for the Highland Park Community Center, which began a little over a year ago in September of 2014. During the community center planning.'",
        "'speaker_8': 'Process, feedback was.'",
        "'speaker_9': 'Received from the community that extended beyond the walls of the proposed community center, illuminating the community's desire to plan for the park.'",
        "'speaker_8': 'The future of the park as a whole.'",
        "'speaker_7': 'In response.'",
        "'speaker_9': 'To that input in June of this year, the Department kicked off this planning.'",
        "'speaker_8': 'Process for the Highland Park Conceptual Plan.'",
        "'speaker_9': 'I'm now going to turn over the presentation to Meredith Reynolds. Our park development.'",
        "'speaker_8': 'Officer will provide a.'",
        "'speaker_9': 'Brief summary of the community.'",
        "'speaker_8': 'Outreach process and an overview.'",
        "'speaker_9': 'Of the elements of the Highland Park conceptual plan.'",
        "'speaker_12': 'Good evening, Mayor. Members. City Council. The purpose of this planning process was to create a comprehensive conceptual plan inclusive of Howden Park in its entirety, which is a 31 acre site located between Atlantic Avenue, East Harding Street, Myrtle Avenue and Jordan High School.'",
        "'speaker_12': 'The outcome of this process was a conceptual plan that outlined desired park amenities that are to help guide future investment in the park. This is the first of many steps toward rehabilitation of the park amenities. And to understand the how and park site, we first started with a review of.'",
        "'speaker_1': 'The different aspects of the park.'",
        "'speaker_12': 'This included site access and transportation routes, utilities on site and off site, amenities and opportunities and constraints. Following an evaluation of existing site conditions at Halton Park.'",
        "'speaker_1': 'The first of two community workshops was held on.'",
        "'speaker_12': 'June 27, 2015 at the Halton Park.'",
        "'speaker_4': 'Community Center.'",
        "'speaker_12': 'Over 30 participants attended the first Interactive Community Workshop, which included a presentation of background and site information, a site awareness walking tour where participants recorded.'",
        "'speaker_1': 'Their site observations at each tour stop in a.'",
        "'speaker_12': 'Workbook format. Individual and group discussions of tour findings such as issues and opportunities. Safety, security, parking and activation. And a group design charrette to graphically.'",
        "'speaker_1': 'Express ideas on site.'",
        "'speaker_12': 'Maps. Individual participant feedback was presented to the larger group, and a group design charrette commenced to graphically express consensus for elements of the proposed conceptual plan. The information received at the first workshop was then evaluated and summarized and presented in a draft conceptual plan at the second Community Workshop held on August 29th, 2015, at the Howden Park'",
        "'speaker_12': 'Community Center. Many of the attendees from the first workshop also participated in the second. Participants were able to confirm that the project team and accurately reflected the information provided at the first workshop. The general consensus from participants was that the draft conceptual plan reflected the desires of the community expressed through the process.'",
        "'speaker_12': 'Extensive community outreach was performed for both community workshops, including fliers, social media, online presence.'",
        "'speaker_1': 'And also activating networks of.'",
        "'speaker_12': 'Community groups to share information as well as the Imagine Outcome website. The conceptual plan shown here is a result of a community process that arrived at a consensus around the elements listed on the screen in front of you is intended that future rehabilitation projects will be implemented as funding is identified.'",
        "'speaker_12': 'This concludes my presentation and myself and Steven Scott.'",
        "'speaker_1': 'Are available for questions. Thank you.'",
        "'speaker_0': 'Thank you. I turn this over to Councilman Richardson.'",
        "'speaker_3': 'Thank you, Mayor Garcia. So thank you and Meredith for the presentation and for leading this process. We've come a long way to get here to be able to consider this conceptual plan tonight. So since the 1930s, Highland Park has stood as a central meeting location in the heart of the North Long Beach community.'",
        "'speaker_3': 'And I just think it's fitting. We've talked about the Queen Mary. We've talked about a lot of things tonight. Well, now we're talking about Highland Park, which is sort of the the heart of heart of North Long Beach, in my opinion.'",
        "'speaker_3': 'So this heavy, heavily used park is a common fixture, serving as a meeting place center for activities, a safe route for students walking home from Jordan High on the park's north end. Each year, more than 15,000 youth and teens participate in afterschool and fun day programing to fund April programing.'",
        "'speaker_3': 'This is the first time since the park's been part since the park was developed nearly a century ago that a comprehensive conceptual planning process has taken place to create a cohesive sense of sense of place and a source of pride in the community of North Long Beach.'",
        "'speaker_3': 'The conceptual planning process balanced, preserving the green space and the history of the history important to the community with rehabilitation needs of existing amenities, with new amenities needed to serve the population who use the park. The result of this conceptual planning process ensures Highland Park is well positioned for improvements when funding and grant opportunities arise.'",
        "'speaker_3': 'Our community is excited to begin to begin implementing aspects of this of this plan. I'll just list out a few great things about this plan. There's new parking areas, entry monument signs, a new electronic reader board, fitness stations, hydration state stations, seating areas, a community garden, outdoor basketball courts, additional soccer, upgraded soccer fields, improved picnic shelters, improvements'",
        "'speaker_3': 'to our baseball diamond preservations of our trees and our green space, additional lighting and user focused bike paths. So by the end of the year, we'll see the installation of our fitness plan and our hydration stations, which are both paid for by District nine one time funds.'",
        "'speaker_3': 'And the North Long Beach Heal Zone, Kaiser Permanente funded initiative in the ninth District. So I want so I'll just take this moment to just invite folks to join us as we launch this plan while we cut the ribbon on the fitness zone one week from today, December 24th and 9 a.m. at Horton Park, 63 on Myrtle'",
        "'speaker_3': 'Avenue. So that said, excuse me, November. So that said, I make I move to receive and file the Highland Park conceptual plan and consider a categorical exemption. S.E. 15. Dash 155.'",
        "'speaker_0': 'Thank you. Councilman Austin.'",
        "'speaker_8': 'Yes, thank you, Mr. Mayor. And I want to take this opportunity to congratulate Councilmember Richardson, the many residents who took part in the planning of this process. I know I took I was a privilege to be early, be at some of the early meetings and see some of the conceptual ideas come come to fruition in this plan'",
        "'speaker_8': '. We don't get funding without vision and without having a plan. And so it's great to have a master plan for Highland Park. It is a North Lawn Beach resource. It's the only regional park, I believe, in the north part of our city.'",
        "'speaker_8': 'We spent the last couple of weeks talking about the need for green space, active green space. I think this is certainly in line with that vision and we'll continue to work together to make this this this plan come to fruition, hopefully sooner than later.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_0': 'Councilman Tauranga.'",
        "'speaker_9': 'Thank you. The buildings that are there, I know that they house some some programs there. I know that the health department has a family preservation project. And within those buildings, there was also some services provided through the work program there.'",
        "'speaker_9': 'Healthy Babies, I think was also fun that was working out of there. Is your plan to upgrade the the internal offices in those buildings?'",
        "'speaker_8': 'Honorable Mayor, members of the City Council.'",
        "'speaker_9': 'The facilities that you're speaking of are were not included as part of the conceptual plan. This was more for.'",
        "'speaker_8': 'The park specific.'",
        "'speaker_9': 'Activities. That being the amenities.'",
        "'speaker_8': 'Related to recreational programing.'",
        "'speaker_2': 'Such as soccer field, baseball fields.'",
        "'speaker_9': 'But that facility was not included in the plan. Perhaps, Councilmember Richardson, or perhaps you might want to add sometime in the future, look at some upgrades for some of those buildings, because I've been in those offices and they could definitely use some some upgrades.'",
        "'speaker_3': 'The ninth District field office is in there for many, many years. In that building, we're very familiar with it. It just received some improvements, some paint jobs and things like that. The focus here was about optimizing the park and we'll continue those conversations.'",
        "'speaker_0': 'Thank you. Councilman Andrews.'",
        "'speaker_2': 'Yes. Thank you, Mayor. I just want to, first of all, congratulate Councilman Richardson. You know, I just see what you guys are doing is just wonderful, especially out there, you know, in the ninth District, you know, I was there in the parade and get a chance just to watch some of the improvements that you have taken to'",
        "'speaker_2': 'make your nightstick, you know, just look great. And I just want to commend you on that hard work and also for Parks and Rec for getting behind this project here. Congratulations.'",
        "'speaker_0': 'Thank you. Public comment, please, on the item.'",
        "'speaker_6': 'And Cantrell and I. I see they've taken the picture off. I had some questions about what is being done with the soccer field. I see it mentioned that there was going to be a. Rehabilitation of it. Is that how upgraded?'",
        "'speaker_6': 'And I'm wondering how this is going to be upgraded. Most of our soccer, all of our soccer fields that I'm aware of in the parks have just been. Any place. There's not trees, there's open space, and they've used the grass that's there.'",
        "'speaker_6': 'And we found out that that really doesn't work with soccer fields. Like the baseball fields, they have to be installed. With a sand. Layered for drainage and because of gophers, there should be galvanized wire put down to keep the gophers out.'",
        "'speaker_6': 'And then a special kind of turf that will keep that will last with a lot of play. And there is natural grass turf that stands up to play. And I'm hoping that when you. Doing this, redoing this soccer field at Helton that you will consider putting in a soccer field that's going to serve the children that are'",
        "'speaker_6': 'playing on it. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Thank you, Mayor Garcia and.'",
        "'speaker_5': 'Our council members, for taking the time.'",
        "'speaker_1': 'To listen to us talk about this great program.'",
        "'speaker_6': 'I want to give a shout out to Rex besides just being just a great idea.'",
        "'speaker_1': 'And much needed in our district.'",
        "'speaker_6': 'Since we're the densest sixth district and probably the district with the least amount of green space per resident. This upgrade is long overdue and it's really exciting to see. But most importantly, I think that's the process that Rex and Shauna and the ninth District staff has been has presented to us to include the district members and the'",
        "'speaker_6': 'residents. To come in to be a part of it is probably the most exciting thing of all. I mean, we're talking about civically engaging people who have either dropped out and didn't think no one ever cared about them or giving them a chance to learn how the civic process processes.'",
        "'speaker_6': 'It's been fabulous. It's been really exciting to have architects, big name architects with big contracts come in and listen to you and implement small ideas into big plans. So I'm really happy about the process that has taken on.'",
        "'speaker_6': 'I'm so glad that you guys are paying some.'",
        "'speaker_1': 'Attention to North Long Beach because we love it. And we're actually starting to feel like you like us.'",
        "'speaker_6': 'So thank you so much.'",
        "'speaker_0': 'Thank you, Speaker, please.'",
        "'speaker_10': 'Good evening. Honorable there. Council members and staff. My name is Dan Pressburger.'",
        "'speaker_2': 'I'm the president of the De Force Neighborhood Association. I'm just speaking to the issue.'",
        "'speaker_10': 'This is a great time for us. It's a lot of excitement for us. Happy to have this happen. Thank you, Rex. Thank you, Al. And I don't think there's needs to be much more said.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'Good evening to Mayor Garcia and the council members, especially Councilman Richardson in Austin, helped in part play a major role in providing open space and meeting. And meeting the recreation needs in North Long Beach. The facilities are used by many groups.'",
        "'speaker_8': 'Including seniors. Our youth and uplifting youth and teen programs. Many different community groups. The park also served as the location for most of the cultural and civic events held in the ninth District.'",
        "'speaker_9': 'And.'",
        "'speaker_8': 'This plan was developed, this plan. Many of the citizens in Long Beach spent time in developing this plan. This is we really look forward to the improvement because the park as I say, the park is very well used and we look forward to it.'",
        "'speaker_8': 'Thank you. My name is Otis Hogan and I am I am the chairman of the co-chair of the Highland Park Neighborhood Association and a member of the Human Relations Commission. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Howdy. Hey, I'm going to keep this very brief. First of all, I want to compliment everybody here for this. This park. I mean, it's been long overdue. Fantastic ideas. All these concepts in place is fantastic. The way this thing looks like it's.'",
        "'speaker_9': 'Uh, working out just great. Um, the question that I have is same as what end control we're saying is that there's a concern over the soccer fields, and we're trying to have we're having some trouble. I'm from District five, not from District nine.'",
        "'speaker_9': 'One of the problems that we're having is we don't know what documents were driving the artificial turf versus grass. It seems like there's a controversy, but there's not a controversy. And so this is kind of what I am going to ask for, is that are we going to have artificial is the plan to have artificial fields over'",
        "'speaker_9': 'there or is it grass? And what is driving document that that that will be pushing that or will that be something to be decided at a later time? We're having a lot of trouble struggling with this, with this at least a lot of the residents in different districts at this time.'",
        "'speaker_9': 'And it looks like there's also a big struggle among the city of some sort to to decide that this and we are also having apparently last week there was a problem with an issue where there were a. A developer was saying that the city was telling him that that they needed to have artificial turf, at least build'",
        "'speaker_9': 'artificial turf. And I'm just kind of wondering where this is coming from. The memo that I saw that was created by the Parks and Recreation before Steve Scott was there by a guy named George, actually was dated, I think, June 15th of this year.'",
        "'speaker_9': 'And it recommended artificial turf of the, you know, more expensive. I think it was the chrome, not chrome, but it was like a coconut filled thing. And then we know, even though it hasn't been put on the table, there was a chrome rubber, you know, thing.'",
        "'speaker_9': 'And then I mean, there's been a lot of things going on. But the basic rationale for the. Using artificial turf was. That it was a water issue. And then we have Ms.. Mungo here saying that, oh, water is not an issue.'",
        "'speaker_9': 'So we have the city in conflict. And I'm just kind of wondering, where are we at in that point now? What do we what do we work? And if somebody could help enlighten me, I'd appreciate that. That's all I have.'",
        "'speaker_0': 'Thank you, sir. See no other public comment on the Hutton Park masterplan here. Members, please go and cast your vote. There is a motion and a second.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Great. Congratulations to the community. And now we have to fund it. And so now that's the next big challenge. And and we're all actively working on that as well. And so we know that's a big deal to the community.'",
        "'speaker_0': 'So thank you. Next item.'",
        "'speaker_1': 'Report from police recommendation to receive and file the application of Aroma de Roma Centro for an original application of an ABC license at 444 West Ocean Boulevard, Suite 110 District two.'"
    ],
    "Recommendation to receive the application of Smart & Final Stores, LLC, dba Smart & Final 745, for a premise-to-premise transfer of an Alcoholic Beverage Control License, at the southeast corner of Atlantic Avenue and 45th Street, determine that the application serves the public convenience and necessity, submit a Public Notice of Protest to ABC, and direct City Manager to withdraw the protest if a Conditional Use Permit is granted.   (District 8)": [
        "'speaker_1': 'Report from police recommendation to receive the application of Smart and final for a premise. Two Premise Transfer of Navy ABC license at the southeast corner of Atlantic Avenue and 45th Street determined that the application serves the public convenience and necessity.'",
        "'speaker_1': 'Submit a public notice of protest to ABC and Direct City Manager to withdraw the protest if a copy is granted. District eight.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_8': 'So moved those that support this obviously this is the smart and final will go into an empty space and will be a source for for economic development in the big three those area.'",
        "'speaker_0': 'Now, we're very we're actually very excited about this. So it's going to be very, very needed. There's a motion in a second. Councilman Gonzalez, any public comment on the item saying non Castros, please.'",
        "'speaker_1': 'Councilman Andrews. Motion carries. Item 24 Report from Police Recommendation to award a contract to Dell Marketing to provide body worn camera equipment.'",
        "'speaker_5': 'I'm sorry. It was withdrawn. Thank you. 25, please. You all are so impatient. You want to go.'",
        "'speaker_7': 'Home at 12:00.'",
        "'speaker_6': 'Report?'",
        "'speaker_5': 'It's only 915. It's very early for us.'",
        "'speaker_1': 'Report from Public Works recommendation to increase interim blanket purchase order with united stormwater by $350,000 citywide may have.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Chapter 2.63 in its entirety; and amending Section 9.65.060.A, all relating to the Cultural Heritage Commission, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Item 27 Report from Development Services Recommendation to declare ordinance amending the Long Beach Municipal Code relating to the Cultural Heritage Commission and Administrative Citations and penalties. Read the first time and lead over to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_5': 'Mr. City Managers or staff report on this item.'",
        "'speaker_1': 'Madam Vice Mayor, members of the City Council. This item first appeared before you this summer, where the staff presented two recommendations to the City Council. One was recommendation A and one was recommendation B. The City Council chose a recommendation C, which was a combination of both of them.'",
        "'speaker_1': 'This allows the city staff to process a request for landmarking a piece of property without the owner's signature on the application. But it does require us to consult with the owner prior to the public hearing. So we we agree it's a great compromise.'",
        "'speaker_1': 'It allows for the protection of potential resources, but it also allows for owner participation at the appropriate time.'",
        "'speaker_5': 'Thank you. There's been a motion and a second. Councilman Gonzalez.'",
        "'speaker_4': 'I just wanted to say thank you for the work. I'm glad we're we're moving forward with this.'",
        "'speaker_5': 'Thank you, Councilman Pryce. Any member of the public that wished to address item 27 seeing none. Members Cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Land Use District Map of the City of Long Beach as said Map has been established and amended by amending portions of Part 22 of said Map from I (Institutional) to RP-13 (Residential Planned Unit Development with Maximum Density of 13 du/ac), read and adopted as read.  (District 8)": [
        "'speaker_5': 'Item 28 Report from Development.'",
        "'speaker_1': 'Services Recommendation to declare ordinance amending the Land Use District Map from institutional to IRP 13 read and adopted as read District eight.'",
        "'speaker_5': 'Councilman Austin.'",
        "'speaker_8': 'So moved.'",
        "'speaker_5': 'Wonderful. And I want to ask Councilman Andrews so any member of the public that wishes to address item 28 saying none, members, cast your vote. Oh, I'm sorry, sir. I did not see you.'",
        "'speaker_7': 'Can we?'",
        "'speaker_8': 'I know this sounds picky and stupid. But this is an illogical motion because you haven't yet created ARP 13. By the way, unlike some other speakers, I will furnish you my name. I'm Joe Weinstein. I did speak last week.'",
        "'speaker_8': 'I do not like to come down here again to talk on the same subjects. But. There is a minor little matter. As to whether a. The proposed zoning is a good idea. And B, whether. The project, which it is intended.'",
        "'speaker_8': 'To permit. In fact. Meets the specifications of the zoning. I have not check that out, but someone else did raise that question and there may be some question as to whether all of the conditions of that zoning have, in fact, been met by the details of this project.'",
        "'speaker_8': 'This particular zoning, perhaps in the abstract, need not be a bad idea, but the way you see it realized in the project. Is not a very good idea. You could have the same density and more without destroying the usability, the usable green space that this design does.'",
        "'speaker_8': 'Because really, although it looks impressive from a top down view, it looks like you see plenty of green space between the buildings, that that space is pretty well wasted and useless because the buildings are high enough to pretty well shade and dominate the green space that's in that project.'",
        "'speaker_8': 'So I'm not saying that the density that you're going for is a bad thing. But doing it in this way doesn't work, and any zoning that just permits this without further control is not a good idea. Thank you.'",
        "'speaker_5': 'Okay. Thank you, sir. Members, please cast your vote.'",
        "'speaker_1': 'Councilman Andrew's motion carries.'",
        "'speaker_0': 'Next time, please.'",
        "'speaker_1': 'Report from Development Services recommendation to declare ordinance amending the Land Use District Map from institutional to park red and adopted as Red District eight.'"
    ],
    "Recommendation to declare ordinance approving an application for a Development Agreement pursuant to Chapter 21.29 of the Long Beach Municipal Code; directing the City Attorney to prepare a Development Agreement embodying the application and key terms of the Development Agreement as approved by the City Council; and authorizing and directing the City Manager to execute, on behalf of the City of Long Beach, a Development Agreement with The Long Beach Project Owner, LLC and DEM Investment Company, LLC, for the Riverwalk Residential Development Project and Oregon Park construction, read and adopted as read.   (District 8)": [
        "'speaker_1': 'Report from Development Services Recommendation to declare ordinance approving an application and requesting the city attorney to prepare and the city manager to execute a development agreement for the River Walk Residential Development Project and Oregon Park Construction read and it as read District eight.'",
        "'speaker_0': 'City Public comment on this item who's come forward.'",
        "'speaker_6': 'And Cantrell and last week when the Oregon Park was discussed. It has been stated that the soccer field was to be artificial turf, but when the developer spoke in his rebuttal, he said he could go either way on this.'",
        "'speaker_6': 'And so I'm hoping that. As this park is developed. You will consider putting in a a natural grass field. If you put in an artificial field. It will have to be fenced to keep off. Drinks, food, bikes. Cars.'",
        "'speaker_6': 'All the things that destroy an artificial field. So that means that this will not be open for the children of the neighborhood to play on. There will have to be a locked gate to keep out. Any. This is what has happened in Hawaii and Gardens.'",
        "'speaker_6': 'If you go over to the field, they're behind the. Casino. You will find that they have a paid worker there to keep out anybody that's not on a team and all the team members are searched before they go on to the artificial sports field to make sure they have only water.'",
        "'speaker_6': 'The artificial turf is more fragile than a natural grass field. And there are other considerations, such as heat and injury risk, that makes natural grass much more. Usable for a large population of children, not just soccer players. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_9': 'My comments are going to be pretty much the same as my previous comment, so I'll keep it brief. The soccer field is another does the same thing. This is going to be a recurring theme with me. Again, I'm wondering why the city is specifying artificial turf.'",
        "'speaker_9': 'I'm having a lot of trouble with this one is that we have, again, a document that is contradicting itself. There's. At least within the city. We have two people. We have we have a councilperson that stating that is incorrect and we're using the same document, it seems to drive the the need for artificial turf.'",
        "'speaker_9': 'And the specifications is obviously going through the city and it is being requested from our planning department, whoever is he's getting his information from. If I'm incorrect on that, please let me know. I've also looked at the, uh, the documents that Mr. Parkin has said that drives the.'",
        "'speaker_9': 'The city has said that they are. The council has said that the the meeting minutes of September 3rd, 2013, was. The Council has decided that. They were that that it was artificial turf was done. I've looked at the video.'",
        "'speaker_9': 'I've also given it to federal prosecutors who live in California and a judge, a federal judge. And they've looked over the documents. And I'll be I'm just going to quote from what they said is that you have to be crazy to to even think that this is has any kind of intention whatsoever to.'",
        "'speaker_9': 'To go artificial. And I'm just telling you, this is what they're telling me. I've got 30 years of contract experience and I don't see any place at all where where they said that there was artificial was being driven from there.'",
        "'speaker_9': 'So I'm just trying to understand. Can you tell me where how I mean, any reason, even the slightest reason, even a phrase that says, look, we're trying to improve artificial surfaces for all of the cities on here. I don't see a single document, a single writing.'",
        "'speaker_9': 'I don't see a single even thing on the video that shows that. Are we see is a budget that's been approved for the different fields on this particular one. I don't know what's driving it, but I just got to understand, we have a mayor here, great, intelligent, good looking mayor.'",
        "'speaker_9': 'And he's saying that he wants to to, you know, going green is the way to go. It helps the environment. And now we're we're paving over it with artificial turf. That's what I'm saying. I'm just trying to be as polite as I can and as nice as I can.'",
        "'speaker_9': 'And I'm just kind of trying to understand the process of what we're going through. That's all. That's all I'm trying to do.'",
        "'speaker_0': 'Thank you. We have a motion on the floor in a second. Members, please go and cast your votes.'",
        "'speaker_1': 'Thanks, man. Motion carries.'",
        "'speaker_5': 'Thank you.'"
    ],
    "Recommendation to declare ordinance finding and determining that a credit is due against the Transportation Improvement Fee applicable to the Riverwalk Residential Development Project; and authorizing the City Manager to execute an agreement regarding credit for transportation improvements made in connection with the Riverwalk Residential Development Project, read and adopted as read.  (District 8)": [
        "'speaker_1': 'Item 31 Report from Development Services Recommendation to Declare Ordnance. Finding that a transportation improvement fee credit is due and authorizing the city manager to execute an agreement providing for the Transportation Improvement Fee Credit Read and adapted as read.'",
        "'speaker_5': 'District eight A motion by Councilman Austin and I seconded Councilman Austin.'",
        "'speaker_8': 'Yes, this is a continuation from last week and I would urge your support.'",
        "'speaker_5': 'Thank you. Sir, any member of the public that wishes to address item 31. Please come forward.'",
        "'speaker_8': 'Provided the Riverwalk residential development can go through. This. This item makes perfect sense, I guess. But one of the reasons I came down here tonight. Fact. The driving reason. It's not because I want to and not because I know whether this development is going to pan out beautifully or be a bust.'",
        "'speaker_8': 'I don't think anybody knows that. But there is one thing that. Project approvals or any other action by the city is not supposed to do. And that is. Proceed in an illegal or at least totally illegitimate matter with respect to certifying an environmental impact report.'",
        "'speaker_8': 'Last week you certified an environmental impact report that materially falsified the situation and that has considerable impacts on the necessity or otherwise for mitigations. As one speaker then pointed out, an excuse such as the lack of standards for traffic crowding, residential streets, a lack of standards which you can very well understand, because it's presumed that that development'",
        "'speaker_8': 'along a residential street will not, in the ordinary experience, have any impact. That's worth writing a standard about that using such a phony excuse. Lack of standard. In order to. Disregard the issues that go into a proper environmental impact report.'",
        "'speaker_8': 'That. Simply is not contemplated by the California Environmental Quality Act. And I'm here because this is actionable. And if citizens feel that there is a cause for action, they are supposed to warn the other party if they have a possibility of warning them that it is actionable.'",
        "'speaker_8': 'This will be one of the several resolutions pertaining to the existence of the project that calls for your consideration as to whether you really wanted to certify and in an inadequate report when you could have turned around and you still could then ask for a few weeks whereby a correct report is produced.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Thank you. Members, please cast your vote.'",
        "'speaker_1': 'Motion carries. Item 32 Report from Development Services Recommendation to declare ordinance. Finding that a Parks and Recreation Facilities Fee credit is due and authorizing the city manager to execute an agreement providing for the park fee credit read and adopted as read.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Table 30-1 of Chapter 21.30, Table 31-1 in Chapter 21.31, and by adding Subsection T to Section 21.31.020, and adding Division III to Chapter 21.31 by adding Sections 21.31.300, 21.31.310, 21.31.320, 21.31.325, 21.31.330, 21.31.340, 21.31.350, Table 31-8, and 21.31.360, relating to planned unit developments, read and adopted as read.  (District 8)": [
        "'speaker_1': 'Report from Development Services Recommendation to declare ordinance amending the Long Beach Municipal Code relating to planned unit developments. Read in adopted as read.'",
        "'speaker_5': 'District eight. Councilman Andrews. I'm sorry, Councilman Austin.'",
        "'speaker_8': 'I moved this part.'",
        "'speaker_5': 'Thank you. Public comment, please.'",
        "'speaker_6': 'For what it's worth, Lorie Angel. I live at 458 East Street addressing our representatives of the public. One thing I did want to mention that is I did go through the city council video last week, and part of the basis for approving the project was the fact that the residents were in favor of it.'",
        "'speaker_6': 'Well, there were 30 speakers, 31 speakers. 14 of the speakers lived in the neighborhood. Six were for it and eight were against it. And of the total speakers it was 2 to 1 against and we didn't bring a bus.'",
        "'speaker_6': 'So my concern. Is not. Even the issue that we push this thing through when it isn't really all as favorable as it's being lit up to be, is that the concept of a PUD is included in this ordinance and it hasn't been discussed anywhere except in the context of the Riverwalk.'",
        "'speaker_6': 'The public hasn't had a chance to weigh in. And not only that is what it says in this ordinance is already in direct conflict to the one project that you have in the books. It says that it has to have a driveway.'",
        "'speaker_6': 'Well, the Riverwalk doesn't have a driveway. So what happens now? They don't have any driveways. Is that okay? Does that get vetted anywhere? Is there. I mean, where the process is really fouled up here? Has anything gone through the planning commission, as they said, that, oh, you have a variance, you don't have to have a driveway and'",
        "'speaker_6': 'maybe that doesn't matter. I know everybody's tired, so let's just go home and just vote yes. I mean, this is a problem. It's an issue. You're creating something that's going to have an impact on neighborhoods henceforth. And also the ordinance just looks at APD within the context of itself.'",
        "'speaker_6': 'It doesn't even have reference to anything outside of it, except if a river runs through it or a street runs through it. Well, what about the impact to everything outside of APD? It's not even addressed. This ordinance is not ready to be passed.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Next speaker, please.'",
        "'speaker_8': 'Joe Weinstein again. Oh. Like the other speakers, I have to point out that this this was not properly noticed. To the extent that it could have been said to be noticed at all. It was put in such a way that you wouldn't notice it.'",
        "'speaker_8': 'Mind you, the last of several resolutions that appear to pertain to all of two parcels in one district of the city, and suddenly something that applies to land use throughout the city. This is patently against the spirit, if not the law of due notice.'",
        "'speaker_8': 'It's so totally anti transparent. But then let's look at the actual. Zoning option that's provided. It was a. It was a straw man question that people allegedly asked whether this would change zoning anywhere else. No, it doesn't. But it provides options.'",
        "'speaker_8': 'And what kind of option does it provide? Essentially, it essentially an anything goes. If you have five acres, you can put any you can ask for any number of units on that acreage. It's true. They all have to fit within.'",
        "'speaker_8': 'There's only a certain number of lots per acre, but you can pile several dwelling units within a single lot and there's essentially no limit. Impost. What you have then therefore is in place of a son of cracker box, which some people derisively referred to this.'",
        "'speaker_8': 'It's not a son of cracker box. It's a clan of cracker walks. And in fact, the way you try to put it over, it's a clandestine of clan of cracker box. And basically the more honest way to do this is to go to Houston.'",
        "'speaker_8': 'Houston has got a problem. No zoning. That's honest. This, in effect, says Houston, we want your problem. Thank you.'",
        "'speaker_6': 'And Cantrell last week when it was pointed out that this PUD would affect. Development in other parts of the city are. We were told. No, that's not right. This is only for. Riverwalk. I'd like to read what the staff report says.'",
        "'speaker_6': 'Use of R one and development standards are not consistent with a new large subdivision or the current goals and objectives with enhanced site planning, unit designs and community amendments. Staff therefore proposes to create a planned unit development PWD zoning district that could be used for this and other similar large scale residential projects currently in the development pipeline'",
        "'speaker_6': 'or on potential infill sites on suitably large lots. Therefore, this could be used in any one of your districts in the city. It could be used for the city college property. In the fifth district on los coyotes and wardlow.'",
        "'speaker_6': 'It could be used for c dip in the third district. It could be used any place. There's still five acres left to cram in a large development and create. Density. I'm wondering if you even read the staff reports.'",
        "'speaker_6': 'Because I can't see how you could vote for something like this without allowing the public to know that this is what is going to happen in their city. True, the developers will still have to go through, get their permits and go through planning and come to you for your blessing on their developments.'",
        "'speaker_6': 'But now they have the ability to ask for 13 houses per acre where before they did not have this ability. You are changing the whole zoning of the city. Think carefully.'",
        "'speaker_8': 'My name is Richard Ivey, and I'd like to echo the comments that have been spoken here earlier. It was very anti transparent. It looked like it was only relating to River Walk. It was hidden in a bunch of other items.'",
        "'speaker_8': 'And it applies to the whole city.'",
        "'speaker_0': 'I don't think people are aware of the impact that this items had. Normally we have hearings.'",
        "'speaker_8': 'We have opportunity for input. We have. Public meetings. Throughout throughout the city. We've.'",
        "'speaker_2': 'Looked at zoning and our resident are. Things that we've wanted to and ways that we've wanted.'",
        "'speaker_8': 'To develop our our community.'",
        "'speaker_2': 'And. And this.'",
        "'speaker_8': 'Just totally overrides all of that. I think that down the road we will look and look back at this and say, this is what?'",
        "'speaker_2': 'We'll have the beginning of a very.'",
        "'speaker_8': 'Big change in our city that will not have good effects. Thank you.'",
        "'speaker_5': 'Next speaker, please.'",
        "'speaker_9': 'Hello again. I think I'm very fortunate. At least I have an advantage that I. I was able to speak to the planning department before I came to this meeting, and I spoke to this lady at length. So. I do know that there's been a lot of things that's been vetted in the within the city, and I think'",
        "'speaker_9': 'Ms.. Mungo's office for at least putting me in touch with these people. But I will admit that this is very difficult language for the average person to kind of understand what's taking place. And I am going to kind of echo what they're saying, but not quite, you know.'",
        "'speaker_9': 'I will admit that that yeah, this, this, this pussy pudi where the zone is going to increase the density for sure and. Trying to stay on the same subject that I have been. There's going to also be a lot of.'",
        "'speaker_9': 'Uh. Um. Water usage coming from there and what, 161 people, something like that that's going to be in this unit. They're going to be sucking up a lot of water. And it's going to be more than even the parts that we supposedly made a memo against because they were using water.'",
        "'speaker_9': 'So we got a little bit of a contradiction in that respect. But I also want to echo what Incontrol was saying regarding this. Many of these there's many zones in Long Beach that it intends to have an institutional zone.'",
        "'speaker_9': 'And this is going to just make it a little bit easier for the for the. The developers are going to look for these type of things and they're going to they're going to do their best to use this as a template for stamping this thing out.'",
        "'speaker_9': 'And that's really kind of more the fear that I have is that, you know, we have this land, the property that Encontro mentioned is near my house and it has been tried before it was fought off. Gosh, I don't know, maybe ten, 12 years ago.'",
        "'speaker_9': 'I mean, I've been in Long Beach in this area for 50 years at least, you know. And so this is kind of somebody left their pin up. Um, this is kind of on. We're having a lot of difficulty.'",
        "'speaker_9': 'How do you prevent? Is it possible for maybe a council person to say, look, this isn't even though we might be able to choose, can we leave this? This is going to designate this as a like a blue area or something just to let a developer know that it's been marked that way.'",
        "'speaker_9': 'I mean, I don't know. There might be a suggestion, but we also probably need a map. To locate the different areas that this other developers might choose. At least make that available for people to kind of vet so the council people can bring it out to their public to in fact that so.'",
        "'speaker_9': 'That's why I have to say good luck. I've still got a water issue, you know, but life goes on.'",
        "'speaker_7': 'Thanks.'",
        "'speaker_5': 'Thank you. Members, cast your vote. No.'",
        "'speaker_1': 'Councilwoman Mongo motion carries.'",
        "'speaker_5': 'Item 35 I'm sorry.'",
        "'speaker_1': '34 Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code relating to speed limits. Read the first time and lay it over to the next regular meeting of the City Council for Final Reading District six and nine.'"
    ],
    "Recommendation to request City Manager to direct the Parks, Recreation and Marine Department in coordination with the Public Works Department to provide an update on and current cost estimate for previously approved soccer field turf conversion projects at three parks - Admiral Kidd, El Dorado and Seaside; request further report on what other appropriate park uses could be developed at El Dorado Park in lieu of an artificial turf project; and report on when it would be feasible to bid on any such in lieu projects.": [
        "'speaker_1': 'Communication from Councilwoman Mongo. Councilwoman Gonzalez, Councilmember Dunga. Recommendation to request the Parks Recreation Marine Department to provide an update on and current cost estimate for previously approved soccer field turf conversion projects at Admiral Kidd, El Dorado and Seaside Park and request report on other appropriate park uses that could be developed at El Dorado Park in lieu of'",
        "'speaker_1': 'an artificial turf project.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'Yes. So first I know that there have been a couple of questions that came up. Ramon, I have the email with your ten questions. I'm glad that you got to speak with Amy Bodak in the building, the planning department, to get a lot of your questions answered.'",
        "'speaker_1': 'I know there are many more responding to. These will take a bit of time, but I'd be more than happy to meet with you right after the meeting to give you some verbal answers right away, because I know they're important to you.'",
        "'speaker_1': 'My colleagues and I have inherited a $3.5 million soccer project. I know the question was, when was this approved? It was actually and I don't know if the chair but at the time, vice chair of Budget Oversight Committee wants to comment on that or if you want me to commit me to do it.'",
        "'speaker_1': 'So under Vice Chair Lowenthal, now Chair Lowenthal of the Budget Oversight Committee, Patrick O'Donnell made a motion that solidified 2.7, I believe, in the original motion for artificial turf soccer fields at three locations identified as Seaside Admiral, Kid and Eldorado Park in the 2013 budget.'",
        "'speaker_1': 'The recommendations of the committee came to the full council, at which time that council approved them. Over time, we've we've come along with a few different things. One, there was a misstatement by the director of Parks and Recreation that there was a drinkable water savings at every park.'",
        "'speaker_1': 'What it actually is, is that there's a drinkable water savings at Seaside, an admiral kid, but a reclaimed water savings at El Dorado Park. And that over time, the costs of these programs have increased and some of the grants associated are no longer available.'",
        "'speaker_1': 'And so what I think my colleagues and I are asking today is that when this item comes back to council for a decision that we have all our options on the table. So I know that we've recently hired a wonderful member of the Parks and Rec team to look at rehabilitating our grass fields.'",
        "'speaker_1': 'And I think that that's a top priority across our entire park system. We need to look citywide and I think we have an item coming in the next few weeks with me and a few others where we're talking about what that infrastructure rehabilitation of all of our parks would look like because we know we need to do'",
        "'speaker_1': 'that. And then if we do move forward, which we have not yet decided with an approval of any artificial turf soccer fields, we want to make sure we have all of our options. The state of California is considering doing a study on chrome rubber.'",
        "'speaker_1': 'We want to be sure that if chrome rubber has any adverse health impacts, that we are aware of those and we'd be able to consider it at that time. And we have a recommendation from the Parks and Rec Commission to consider natural infill of many different sorts and or according to that meeting, coconut husk, which has only'",
        "'speaker_1': 'one provider. So we want to open it up to potentially all natural fill. And then in discussions with some of our community partners that play soccer on the fields, a majority of the players of soccer in the community don't play on full sized fields.'",
        "'speaker_1': 'The ten and under, they call them U10 and U12 and U six and U eight. They play on partial fields. They take a full sized field, and they divide it up so that multiple teams can play at the same time against one another.'",
        "'speaker_1': 'And so what I think this item is doing is saying. When we do need to make a decision. We would like public works in Parks and Rec to bring back all of our options because what we don't want to do as a council is make piecemeal decisions along the way.'",
        "'speaker_1': 'We want to make a comprehensive decision in the best interests of all the residents and all the stakeholders. So I think with that, if we're comfortable going to public comment. Chair.'",
        "'speaker_5': 'Yes, we can do that. Let me call in the second or the motion first. Okay. Public comment, please.'",
        "'speaker_9': 'I think I'm going to my my talk is going to make it a lot easier for her to say, yes, I'm going to try to make it as easy as I can. In my view, as a person who's played soccer, I was one of the people that started.'",
        "'speaker_9': 'I got the soccer approved in a morally, you know, there was nobody playing and we had to sneak around and play and then they told us not to. And we ended up working, strangely enough, for the air. So.'",
        "'speaker_9': 'So. We? I know that a lot of the bodies bodies are buried. And maybe in June somebody asked me to get involved with this. I thought it was crazy. But then I saw this George from the Parks and Recreation angle.'",
        "'speaker_9': 'He's even crazier than I am. So, um. Basically what I'm trying to say is that, you know, I've done a lot of analysis. I've been involved with contracts, have been involved with sports, being a world class athlete for over 25 years.'",
        "'speaker_9': 'You know, that was about 15 ago. So what I'm saying is I've actually done a lot of research and I've determined that that when I break out the numbers, we've got about a 40%. You know, grass is about 40% less, 40 to 50% less even than the crumb rubber.'",
        "'speaker_9': 'The lowest value, the lowest cost, least cost item is what I've done in grass hasn't changed that much in price, but crime has gone up a little bit since the last proposal. And so. You know, all I'm saying is it seems like a lot of people love to play on grass.'",
        "'speaker_9': 'Everyone I know in soccer would prefer to play on grass rather than artificial turf. And I think Steve actually said that to me when I was at Eldorado Park. That's what they prefer to play on. He knows that.'",
        "'speaker_9': 'But we have a problem in that. I think, Charles, I'm going to say interpretation of what happened in that meeting. I know you said it. I've read the documents and I've seen the video. And I talk to you about the federal prosecutors that have seen it and the judge.'",
        "'speaker_9': 'So there's a huge difference between what our local prosecutor is saying versus what experienced, seasoned people who do this and deal with corruption every day know they know what things are said as legal definitions. You can't get around it.'",
        "'speaker_9': 'You can't just say, oh, this is a judgment call. There are certain things that are yes or no. And there's nothing that says, Hey, look, we did it, you know? So, I mean, the documents have got to show that.'",
        "'speaker_9': 'They have to reflect it. People have got to do it. So the numbers actually show that the grass is is cheaper for all of us. And I know that, you know, we have District seven. He's looking into it.'",
        "'speaker_9': 'He's doing a good job. But. I don't. Nobody can understand why we know grass is so much less expensive. And I mean, you can't justify 50% more for something when and it's safer and everybody wants it. Versus versus something that's, you know, 50% less.'",
        "'speaker_9': 'And everybody I mean, everybody wants to have that other thing I'm getting ready to take off. I understand. Thank you, sir. And, uh, just. Thank you, sir.'",
        "'speaker_0': 'That's all right. Actually, time's up. We won't pass the time. Thank you, sir. Okay.'",
        "'speaker_6': 'And Cantrell. And I appreciate you staying and listening to me. I sent an email today to all of you and recommended that you go to this website. The Dirt on turf. Because it has a lot of good information.'",
        "'speaker_6': 'Comparing artificial turf with natural grass. As has been said before. Natural grass can be half as much. And the geode fill or the coconut. Huske will. Is much more expensive than chrome rubber. Chrome rubber has not only possibilities of.'",
        "'speaker_6': 'I'm sorry I'm interrupting your conversation, Mrs. Mungo. Crumb rubber. Gets hot. It has to be cooled with water. It has to be cleaned. And so there's so many problems with it. I'm hoping that when Parks and Recreation and Public Works looks at these.'",
        "'speaker_6': 'Looks at the. Artificial turf they will also be considering. Putting in natural grass. May I ask is is that going to be part of the study? But natural grass will be considered also. Can I get an answer on that?'",
        "'speaker_6': 'I guess not. Okay. Thank you.'",
        "'speaker_0': 'Thank you. I see no other public comment. I'll take this behind to the council now and the rail here and start off with Councilman Manga, the maker of the motion.'",
        "'speaker_1': 'I'll hear from my colleagues.'",
        "'speaker_0': 'Councilman Gonzales to the second of the motion.'",
        "'speaker_4': 'I think Councilwoman Mango for bringing this forward. I know this has been a big issue and I'm very glad that the speakers came up and spoke to us about their passion for this issue. Most certainly, quite frankly, you know, in the first District in Seaside, we just want to park and we just want grass.'",
        "'speaker_4': 'We haven't had grass for some time. And so it's been. You know, it's it's been a long time for us to have something, and we're just very excited to have the opportunity to look at options at this point.'",
        "'speaker_4': 'But I'll tell you, my community most, most definitely is very excited about this because they're they're they're they just want something to play on. I think, you know, currently it's been dirt for the last five years, very impacted neighborhood.'",
        "'speaker_4': 'I think some of our lowest poverty in the city. It's pretty tough. So I just thank you for being open to giving us some options. I know you have been working on this as well, Stephen, with Councilman Mongo and I know Councilmember Suranga and I have been talking about other options and I know he'll speak a little'",
        "'speaker_4': 'bit about Admiral Kidd, but this is all great discussion and I'm looking forward to seeing what what comes next of it.'",
        "'speaker_0': 'Thank you. Now turning things over to Councilmember Ranga.'",
        "'speaker_9': 'Thank you, Mayor. And I do want to thank Councilwoman Mangal for bringing this forward. You know, this is a difficult conversation to have, frankly, because, you know, we are in the middle of a drought, my my in my district Advocate Park, tons of kids and in the senior adult leagues play there.'",
        "'speaker_9': 'It's become dirt. I would prefer, obviously, grass just like everybody else. And like it's always been traditional how we've got to look at our options and, you know, the options that we have right now is that we do have this fund, these funds available to enhance our soccer fields.'",
        "'speaker_9': 'Whether it's artificial or not, you know, but even with grass, you know, there's other infrastructure stuff that we need to look at, too, that can be just as expensive, if not more so. The options that we want the staff to come back with are are viable.'",
        "'speaker_9': 'We want it. We want to look at them. And yes, when we do get the staff report back, we want to see it all. We want to see what all the options are and they're all before us so that we can discuss them and then take it from there in terms of what we would like to see'",
        "'speaker_9': '. There's some research, obviously. And Control brought about that report in terms of what's out there, which is fine, something to look at and to to consider. But at this present time, I think what we need to do at this time is just to direct staff to look at all the options and come back with a report so'",
        "'speaker_9': 'that we can move forward from there.'",
        "'speaker_0': 'Thank you. Turn this. Go back to Councilman Longo.'",
        "'speaker_1': 'Thank you. I hope my colleagues will support Parks and Rec and public works, bringing back all of our options so we can make a comprehensive decision. I think that the decision to be made needs to be an informed one.'",
        "'speaker_1': 'So I look forward to that opportunity and the continued public input. Thank you.'",
        "'speaker_0': 'Thank you. With that, please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Now we're going to go, I think, two announcements. Let me start off I want to start with Councilman Andrews because he wants to close a meeting in someone's honor.'"
    ]
}