{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and consider third-party appeals (APL17-020 and APL17-021) from Bea Bea Jimnez, David White, Karin McGinley, Tino Haramis, Kazumi Hiromoto, Tetsu Hashimoto, and Warren Blesofsky (representing Long Beach Citizens for Fair Development);\n\nAdopt resolution finding that the 320 Alamitos Project is consistent with the Downtown Plan Program Environmental Impact Report and subject to the Downtown Plan Mitigation Monitoring and Reporting Program, and making certain findings and determinations related thereto; and\n\nUphold the Planning Commissions decision to approve a Site Plan Review (SPR17-001) and Lot Merger (LM17-002) for the construction of a seven-story, 77-unit residential development at 320 Alamitos Avenue in the Downtown Planned Development District (PD-30).  (District 2)": [
        "'speaker_1': 'Okay. So now we're going to move on to our hearing agenda. And so well, let's go ahead and cue up hearing number one.'",
        "'speaker_0': 'In a report from Development Services recommendation to receive this supporting documentation into the record. Conclude the public hearing and consider third party appeals from Long Beach Citizens for Fair Development and uphold the Planning Commission's decision to approve a site plan, review and merger for the construction of a seven story 77 unit.'",
        "'speaker_4': 'Residential development at 320 Alamitos Avenue.'",
        "'speaker_6': 'In the Downtown Planned Development District.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'Thank you. And Tom, I know you have some comments here. I think this is just to make a motion to continue this to October 24th. Okay. So it's been moved and seconded. Any public comment on containing this item saying no members, please cast your vote.'",
        "'speaker_2': 'Mr. Vice Mayors, voting on this matter. I'd just like to point out that in the agenda packet for this item, there is a resolution that relates to.'",
        "'speaker_1': 'Environmental matters that is also in the.'",
        "'speaker_2': 'Packet and it's on the clerk's website. It did not make it as part.'",
        "'speaker_7': 'Of the recommended action for this item. So you will be receiving a revised staff.'",
        "'speaker_1': 'Report on the supplemental agenda.'",
        "'speaker_2': 'So it'll be available next when the hearing takes place.'",
        "'speaker_1': 'Thank you. So, members, please cast your vote.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and approve the hearing officers recommendation to deny the business license MJ21701137 submitted by Long Beach Cannabis Club for a medical marijuana business located at 5752 East 2nd Street, but reject the hearing officers finding that Naples Canals are not a public park as defined under Chapter 5.90 of the Long Beach Municipal Code.  (District 3)": [
        "'speaker_0': 'Motion case.'",
        "'speaker_1': 'Thank you. Listen, hearing number two, please.'",
        "'speaker_0': 'Report from financial management, parks, recreation and Marine recommendation to receive supporting.'",
        "'speaker_4': 'Documentation into the record to conclude the hearing and approve the hearing officer's recommendation to deny the business license submitted by the.'",
        "'speaker_0': 'Long Beach Cannabis Club for a medical marijuana business located at 5752 East Second Street, but reject the hearing officer's findings that Naples canals are not a public park.'",
        "'speaker_6': 'As defined under Chapter 5.90 of the.'",
        "'speaker_0': 'Long Beach Municipal Code District three.'",
        "'speaker_1': 'Thank you. Is an oath required here? Yes. Okay. Let's go ahead and conduct the oath.'",
        "'speaker_0': 'So parents, anybody who's giving testimony, please stand. Do you and each of you solemnly state, state that the testimony you may give in the course now pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you. So, Mr. Modica, go ahead and take us away. Thank you. Mr. Vice Mayor, the staff report on this will be given by Brett Jacobs, our business service officer in the Financial Management Department and supported by the city attorney's office.'",
        "'speaker_1': 'Good evening, honorable vice mayor and members of the city council. Tonight you have before you a recommendation to uphold the hearing officer's determination to deny the business license application and a21701137 submitted by Long Beach Cannabis Club for a medical marijuana business located at 5752 E Second Street in Council District three.'",
        "'speaker_1': 'In addition to the calculator, you have been provided the hearing officers recommendation and findings, the appeal hearing packet, the appellants brief in support of their argument and the city's brief in support of its argument to provide some background on this item on February 22nd, 2017.'",
        "'speaker_1': 'The Long Beach Cannabis Club submitted an application to operate a medical marijuana dispensary at 5752 East Second Street on May 31st, 2017. The Department of Financial Management denied the business license application due to the proposed business location being within 1000 feet of a public beach and being located within 600 feet of a public park, which is in'",
        "'speaker_1': 'violation of one beach baseball code. Section 5.90.030. On June eight, 2017, Luggage Cannabis Club filed an appeal of the business license application denial. And on July 18, 2017, the City Council referred to appeal to a hearing officer on August 14, 2017.'",
        "'speaker_1': 'The appeal hearing was held and the presiding hearing officer assigned by the city clerk's office was Larry Minsky on August 23, 2017. The hearing officer recommended that the denial of the business license application submitted by Long Beach Cannabis Club be upheld due to the proposed business location being within 1000 feet of a public beach Mother's Beach, which'",
        "'speaker_1': 'is in violation of Long Beach Coastal Code Section 5.90.030. In addition to the hearing officer, in addition, the hearing officer concluded that the city did not meet the burden of proof to show that the proposed business location was also within 600 feet of a public park with respect to Naples canals.'",
        "'speaker_1': 'If the city council affirms the hearing officer's finding that Naples canals is not a public park within the meaning of Long Beach, most of the code section 5.90.02 of the Naples canals must be removed from the medical marijuana business buffer map.'",
        "'speaker_1': 'The Long Beach Medical Code Section 5.90.02 defines a park as publicly owned, natural or open areas set aside for active public use for recreational, cultural or community service activities. The city maintains it enables canals clearly meet the definition of a park under the Long Beach Morse Code, Section 5.90.02.'",
        "'speaker_1': 'Because the Naples Canals is a public open water area with a primary purpose of recreational use with activities such as kayaking, boating, swimming and paddleboarding. As such, staff recommends council adopt the hearing officers determination to deny the business license application but reject the hearing officer's determination that Naples Canals is not a public park.'",
        "'speaker_1': 'That concludes my report. And staff are are available to answer any questions council may have. Thank you. And so at this point, we'll go to public comment. Is there any member of the public would like to speak on hearing number two, please come forward.'",
        "'speaker_1': 'Larry Goodhew, a cleric as he addressed a stadium before. The landlord has proven himself and the owner of the property a highly irresponsible individual. He is essentially allowed his property, which he owns, in which he's currently trying to establish the objectionable business in, as well as the one next door to become a sanctuary for the two individuals'",
        "'speaker_1': 'at the epicenter of an insidious criminal syndicate period with which he could have easily done, i.e. simply by fencing off in the closed hours with an attractive fence, as other residents have done, as other business owners have done.'",
        "'speaker_1': 'But he has refused to do that. He essentially gives the middle finger to the residents again, his location. It was a primary location for that episode, for that criminal activity or the the nest for those two individuals until until he started applying for this.'",
        "'speaker_1': 'But he still ingratitude the odious owner of the building next door that is essentially run by the turd that floated into the shore, across the shore, across the pond about a few years ago. And he, together with his equally odious number two guy, which is certainly an appropriate description, championed those two individuals by play, by publishing articles'",
        "'speaker_1': 'favoring those two individuals. Those two individuals are ones that one of them threatened to kill. Threatened to kill a shop owner, catty corner from that location the other bit and put someone in the stomach. Those who have been banned from the library for a similar type of conduct and every time the female, the elderly, senior citizen librarian'",
        "'speaker_1': 'staff would walk out on the street for lunch break, they would spit. Which period the individual, individual owner and the manager of that facility has proved himself highly irresponsible. Yet this guy supports supports him and his equally odious individual, his number two guy, who when he was out on a medical leave and it looked as if it'",
        "'speaker_1': 'was he was not going to make it to pearly gate, not only to where the pearly gates immediately shut the day. The guy down below said even he had his standards and closed him off. You can't have landlord, you can't have people giving sanctuary to criminal activity.'",
        "'speaker_1': 'And it speaks ill of the very character of the individual who would want to open up something which is steps away from essentially nothing more than child trafficking, sex trafficking and child. Thank you. Sex trafficking. Thank you for your testimony.'",
        "'speaker_1': 'Saying no further public comment will close public comment. I want to just ask for the record, is the appellant at all in the audience? Okay. I don't see the appellant here. No one's responding. Just need to do that for the record.'",
        "'speaker_1': 'So public comment is closed, so we'll take it back behind the real council in place to overcome it.'",
        "'speaker_0': 'I want to.'",
        "'speaker_6': 'Thank staff for their efforts on this. This is an example of what we're to see from now on in regards to these establishments and some of the buffers that in my opinion, this one is a no brainer. But I thank staff for their excellent work and of course of the analysis of the Naples canals.'",
        "'speaker_6': 'I think I think it's hilarious that the hearing officer would have concluded otherwise, given what a huge source of recreational activity that particular canal provides for the entire city and never mind Christmas. So thank you very much.'",
        "'speaker_1': 'Thank you, Councilman Austin. Thank you. Members, please cast your vote.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and approve the hearing officers recommendation to uphold the denial of the business license application MJ21701212 submitted by EZ Greens, LLC, for a medical marijuana business located at 1355 West Willow Street.  (District 7)": [
        "'speaker_0': 'Motion case.'",
        "'speaker_1': 'Thank you. Let's have hearing number three.'",
        "'speaker_0': 'Please report from.'",
        "'speaker_4': 'Financial management recommendation received supporting documentation into.'",
        "'speaker_0': 'The record. Conclude the hearing and approve the hearing officer's recommendation to uphold the denial of the business license application submitted by easy greens for a medical marijuana.'",
        "'speaker_4': 'Business located.'",
        "'speaker_0': 'At 135 five West Willow Street, District seven.'",
        "'speaker_1': 'Thank you. And I believe another oath is required to administer the oath.'",
        "'speaker_0': 'Witnesses, please stand. Do you and each of you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_1': 'Thank you, Mr. Modica. Thank you, Mr. Vice Mayor. The staff presentation will again be given by Brett Jaquez, our business services officer. Good evening, Honorable Vice Mayor and members of the City Council. Before your recommendation to uphold the hearing officer's determination to deny the business license application, NJ 21701212.'",
        "'speaker_1': 'Submitted by Easy Greens LLC for Medical Marijuana Business located at 1355 West Rose Street in Council District seven. In addition to the counsel order, you have been provided the hearing officer's recommended recommendation and findings, the appeal hearing packet and the city's brief in support of its argument.'",
        "'speaker_1': 'To write some background on this item on February 21st, 2017, Easy Greens LLC submitted an application to operate a medical marijuana dispensary at 1355 West Grove Street on May 31st, 2017. The Department of Financial Management denied the business license application due to the proposed business location being within an area zoned exclusively for residential use, which is in'",
        "'speaker_1': 'violation of the Long Beach Municipal Code. Section 5.90.030. On June 8th, 2017, Easy Greens LLC filed an appeal of the business license application denial. And on July 18, 2017, the City Council referred the appeal hearing to a hearing officer on August ten, 2017.'",
        "'speaker_1': 'The appeal hearing was held and the presiding hearing officer assigned by the city clerk's office was Elio Palacios. On August 29, 2017, the hearing officer recommended that the denial of the business license application submitted by E-Z Green's LLC be upheld due to the proposed business location being in an area zoned exclusively for residential use, which is in'",
        "'speaker_1': 'violation of Long Beach Municipal Code Section 5.90.03. It is requested that the City Council accept the hearing officer's recommendation to deny this business license application. That concludes my report. And staff are available to answer any questions Council may have.'",
        "'speaker_1': 'Thank you. And Mr. City Attorney, do we need to ask for the appellant on this? Okay. Is there is the appellant present? Okay, please come forward. You have a reasonable amount of time to make your case. Let's just cue up 10 minutes here.'",
        "'speaker_1': 'I probably need that long. Okay, well, let's queue up five. Okay. Mr. Vice Mayor and City Council, thank you for giving me a chance to speak. Be a being that we applied for this this medical marijuana license. It is.'",
        "'speaker_1': 'It's currently zoned on is on the map. It is zoned residential. But that's that was our point of contention, why we appeal this process to begin with. My father purchased this property back on August 8th, 1980, from Mobile Oil Corporation.'",
        "'speaker_1': 'It was it was an existing gas station at the time. My father at that point converted it from a gas station to a convenience store dairy market, which is which is how it's been operated since that time. So for the past 37 years, it's been operated clearly as not a residential use.'",
        "'speaker_1': 'We we so since during that time we've had a beer and beer and wine license from state of California. And during that whole time and basically the zoning I believe we believe to be amid something made a mistake with the zoning not back in 2013.'",
        "'speaker_1': 'We we I think we realized that it was not zoned and we attempted to preliminarily change the zoning on this property. My father contacted various business owners along the the block that we were located on. Some of them did agree to for us to go ahead with the zone change and we would all split the cost.'",
        "'speaker_1': 'And then early 2014, we were approached as personally, we were approached by 7-Eleven to to purchase this building from us, along with the license, the beer and wine license. So at that time, my father tried to rush the process, going because the 7-Eleven was not going to purchase it, being zoned incorrectly.'",
        "'speaker_1': 'But at that time, my father, we met with Monica mendoza, who was at the was a planner at the time. And we had she and my father met with Linda, to whom was also in in the works for the city in planning.'",
        "'speaker_1': 'And at that time, they told us that the the zone change was already going to be part of this citywide general plan change. That's still hasn't occurred from 2014 til now. We were under the understanding that that process would have taken between six months to a year.'",
        "'speaker_1': 'And here we are three and a half years later and still has not been done. And I understand that there's a bunch of little hiccups that go along the way with that. But as a direct result of this this thing, we haven't been able to we were denied for this application, as well as not being able to'",
        "'speaker_1': 'sell our business and the building property to 7-Eleven. We've been we've definitely been harmed by this through the slow process. This is taken. And we're hoping to get this the zone change done, if possible, prior to this general planning, because we don't even know when that's going to happen.'",
        "'speaker_1': 'We'd like to apply for if we're not going to be able to open a dispensary, we'd like to still be in this in the medical marijuana business. But if the zoning is not changed by the time, you know, we'd like to do the cultivation side if possible.'",
        "'speaker_1': 'We're exploring that as well at least. But if that's yeah, that's that's basically we just want to get this thing done. This process is, you know, started from 2013 and like I said, it's been a commercial use since 1980 at least, at least.'",
        "'speaker_1': 'And I'm sure mobile operator discussed that as a gas station for 20 years before that. So that's all that saying. Thank you. So this time we'll get a public comment. Is there any public comment on the side of.'",
        "'speaker_1': 'Very good. Upfront. I don't know this specific location, but I would offer this suggestion to this city. There will be obviously a number of people that will always want to come down and we're going to try to do this.'",
        "'speaker_1': 'And in any neighborhood, they are problematic. Here would be my suggestion. If you feel that you have no alternative in some locations, this is what and this is what. In the final analysis you should you should do is take the top two or the next to the top floor of the Long Beach Police Department.'",
        "'speaker_1': 'Clear it out, rent out space, and then have a lottery. And people can apply for one of those places to operate a marijuana establishment there. And there's ample parking in the garage there for them to do that period.'",
        "'speaker_1': 'And that saves a considerable amount of time. It's there. They can go buy a lottery basis and for each district they will have a certain you'll work it out with a certain number of lottery spaces will be opened for each district.'",
        "'speaker_1': 'And then you go to the downtown, to the police department and do your stuff. The city then gets at least some revenue from it to offset the damage that will flow from being forced to sell it. Thank you.'",
        "'speaker_1': 'Thank you. So say no further. Is this public comment coming forward? Thank you. Is there any other public comment on this item? Okay. This is our last speaker.'",
        "'speaker_5': 'Thank you, Shirley Bassey. With regards to the denial of this license, I believe that it is in the overall best interests of the city being the medical marijuana and the regular kind. There is no difference between the two.'",
        "'speaker_5': 'It's all marijuana. It's it's all doing the same thing. So we have saved some toddlers. We have saved some met middle school high school children from walking by that business and getting a contact high. We've saved the necessity of the residents to have to explain to their children, what's that smell?'",
        "'speaker_5': 'Mommy, Daddy, what is that? We have saved a generation that live in that area from the necessity of getting that much more closer because marijuana is a gateway drug. We've saved that many children from being that one step close to the use of opiate drugs.'",
        "'speaker_5': 'Heroin. We saved them. Cigarets are now in front of us. They are in some of our houses, even though we've required now smoke free zones in restaurants and other public places. Because years later. Through cancer and death. And all kind of malfeasance in our human body.'",
        "'speaker_5': 'We have say we are now having to answer that question. But with with marijuana, we're going down the same road. And some of us years later. Are going to hear your children say, I don't care if you do put medical in front of it, Mommy.'",
        "'speaker_5': 'They offered me a joint and then they said, Well, why don't you try a primo. That's marijuana kid dipped in cocaine. And then they offered that to me. Dad. And while you voted, it was illegal. You said, Mommy, that you said you voted it right, Mommy.'",
        "'speaker_5': 'You're going to have to answer that in the generations ahead. As your children? Some of them. Who voted. I don't care if you are selling it legally now. You're going to have to answer your children and your children's children.'",
        "'speaker_5': 'Mark my words, some of you will weep for this decision. When you know, deep in your heart, forget what they have allowed you to do here in your heart of hearts, you are entertaining this not because you have a medicinal necessity.'",
        "'speaker_5': 'You're entertaining it because it is now the trendy thing to do. When you don't want to deal with the stresses of life and the many of us who are either Catholic or Protestant. I'll finish later. Thank you.'",
        "'speaker_1': 'So we closed public comment, but I see one additional speaker. Is this one or is this too one? This is one. So I leave that there.'",
        "'speaker_3': 'Well, you see something? Got it, Roberto. Well, you got something to say to me. Merry Christmas.'",
        "'speaker_1': 'You ain't got to say nothing to me. All right, so you have 3 minutes and time starts now.'",
        "'speaker_3': 'Well, I think you give an honor to Jesus. I don't. I disagree with her because I saw a documentary on the History Channel. Nixon was giving out marijuana, medical marijuana in 73 and everything. So. And I got glaucoma, I found out in 2011.'",
        "'speaker_3': 'And that's the first thing the doctor said to me is marijuana has no side effect. The team along the left hand approach that I take and the Santa press makes my eyes twitch so no one is all right.'",
        "'speaker_3': 'You know, I use all of them. But the thing is, is marijuana back in the days was the peace pipe, not the regular tobacco marijuana. And and the Native Americans wanted the indigenous holiday and everything. They were here last week.'",
        "'speaker_3': 'If we had they maybe they need to smoke marijuana because when we got finished and I got kicked out, everybody remembers. Right. And this is has to do with marijuana. When they got finished, the natives, you know we used to smoke piece pipe of cool but see when we got out there I was with the white lady'",
        "'speaker_3': 'and the white man and Fred that was over there and the police escort is to a car because it was a little commotion. They were following us, La Raza people. So what time we get out there? I'm in the back seat.'",
        "'speaker_3': 'They don't see me like this has to do. I'm getting to it. They say.'",
        "'speaker_1': 'You know. Yeah, now, come on.'",
        "'speaker_3': 'It's not a warning. I'm talking about marijuana. Why it needs to be. Now, come on. Don't do that. Because you got to hear this. We need marijuana because I would like to smoke marijuana with them and they would have peace, not jail.'",
        "'speaker_3': 'The ones who was here last week and if we had back in Long Beach and I could smoke a doobie with them, maybe they wouldn't be trying to beat us up and kill us. Okay. So the thing is, is Uncle Jerry would like that, but they don't.'",
        "'speaker_3': 'So the thing is, as far as them, what they did, they caught us and they try to reach in to take those phone and assaulted us. And then I went to police tell them it took too long to get there.'",
        "'speaker_3': 'So as vice mayor, before I leave, I want to ask you this. I want to make sure I wanted to make sure that step doesn't happen again because, hey, we come here to talk, not to fight, but if we got to be our own police, I'll do that and I'll go get some brothers a hand with that'",
        "'speaker_3': '. But I don't want to do that because I don't feel like going to jail. And that's why we got the police. We got good police here. I remember when crack was all up in Long Beach. That was such a good job that this is a very safe city now.'",
        "'speaker_3': 'So just I just tell the police what's up and let me handle this because they handle this in Long Beach and hey, remember, next time they come with this indigenous stuff, when we get out there, I ain't having no more of that bull crap because the brother ain't having it.'",
        "'speaker_3': 'I'm gonna get some brothers down here. We're going to handle this. That's the last thing I'm saying. So, you know, hey, tell that man to handle his all that stuff. Hey, I ain't going down Long Beach.'",
        "'speaker_1': 'Thank you. And we didn't see Frances come forward. Francis, you have your 3 minutes.'",
        "'speaker_8': 'I am Francis, Emily Dawson Harris and I reside in District one and I wholeheartedly support this surge and this matter. I felt that the hearing officer's recommendation is sound and is and should be about the denial of the business license.'",
        "'speaker_8': 'I'm also staying on the subject matter. I kind of was listening to the appellant and I just was wondering about a point of clarification because I kind of got a inclination that there's a possibility that he realizes there's a probability that the license may be denied.'",
        "'speaker_8': 'And I'm kind of concerned about the matter about still having a business or something there. And I don't know if there's a separate business license that has to be got for. I'm kind of wondering what's going to happen with this denied?'",
        "'speaker_8': 'What's going to happen with the facility? Because I think that needs to be made clear as to what's actually going to happen with this location. Thank you very much and I appreciate it.'",
        "'speaker_1': 'Thank you. Public comment is close. We'll take it back behind the wheel. Councilmember Durango. Thank you, vice mayor. I know. I know. That little stretch of land between the river, the 17 freeway and Santa Fe as well. This property lies around the corner of Easy and Little Street, and it has been a dairy for town that I've'",
        "'speaker_1': 'been in Long Beach. But I wasn't sure. I wasn't aware about the early history that it was a gas station. So that's that's enlightening. We were saying that has been very difficult for Mr. Wayne and his son in their property is that they have made efforts to sell that property and make it something else and convert that'",
        "'speaker_1': 'use into something much more not only useful for the community but profitable for them. Of course, during the course of my being on the city council, it was revealed at that location it's what they call a legal non-conforming use, which complicates matters in terms of properties that are that are designated as such.'",
        "'speaker_1': 'So I want to ask our planet, our department service people, if they could please give a definition of legal or performing use so that we can proceed with with how we move forward with the time of the sale here.'",
        "'speaker_1': 'Kerry. I will respond to that.'",
        "'speaker_0': 'Thank you. Good evening, Honorable City Council, and thank you for your question, Councilmember Miranda. The legal, legal nonconforming use is one that was approved, legally permitted during a certain time, and then subsequently the codes changed. So, for example, for this particular property, it was zoned commercial back in the forties and fifties and sometime prior to 1979 it'",
        "'speaker_0': 'was zoned residential. And the existing development on the site, which was permitted legally at the time, remains legal, non-conforming and status, even though the underlying the zoning is are one which is residential and now only allows for residential uses.'",
        "'speaker_1': 'And and that that presents a quandary because it is a legal non-conforming use. Yet it was resolved to be residential and and so Mr. Wang feels that he's been treated unfairly and I don't blame him for that because he's not.'",
        "'speaker_1': 'Now at this point when he was trying to sell the property to 7-Eleven because 11 does sell wine and beer, he could no longer be that type of service. He could no longer be there. So he's of in a in a quite a quandary here in terms of what was he going to do with that property.'",
        "'speaker_1': 'It's not about marijuana. It's about his property and what he can do with it at this point. And it's a shame that that he was unable to at least be able to consider another use for that property. But then the law is a law.'",
        "'speaker_1': 'We did pass a measure m m it was the definitions are very clear in terms of where you could put some dispensaries and some growth. And being that this is in a place where there's a residential very nearby, he can't they can't convert that property into that.'",
        "'speaker_1': 'Also, when he did his application, there were a maximum of 23 points to achieve in the application. And he didn't he didn't get the 23 points. So he was deemed eligible to continue in the lottery. So at this point, it appears that Mr. Wang is not able to apply for a medical marijuana dispensary or apply for 7-Eleven'",
        "'speaker_1': 'or apply for any other use, which is a shame. So at this point I would like to direct staff of the audit services and Mr. Kaiser to please meet with the Wangs, talk to them, give them some ideas as to what would be a very usable, well appropriate use of that property that may be able to give'",
        "'speaker_1': 'them some relief and and give them an opportunity to stay along because it's been a long time for 30 plus years, they've become a part of the community. They also own the car wash down the street on the corner of Santa Fe and and well, so they they are very familiar with Long Beach.'",
        "'speaker_1': 'They're very familiar to the people who are who live in the West Palm Beach area. And I think that they deserve a fair shake. So, Mr. Warwick, is that possible that we can be able to work with the banks and this mayor, councilmembers, vice mayor, councilmembers, certainly will have an economic development department meet with the Wangs, talk'",
        "'speaker_1': 'about zoning, what opportunities that exist. Absolutely. Okay. All right. And again, you know, this this is a parallel situations where I did meet with planning a building during this period of time. We were talking about 711 and how the land you sell that was coming in.'",
        "'speaker_1': 'And we're looking at changing some of those those those rules. And that is one of the stretches right there that is very complicated because of that corner and plus the other properties that are to the west of him, where there's a church, there's a laundromat, there's a restaurant, and there's a a playground and a library.'",
        "'speaker_1': 'So it's very mixed and it's very a talk about nonconforming. I don't know what that street is in terms of where there's residential, whether it's commercial or what. It's very unclear. So we as we move forward, we're probably touching a little button here that they should at least wear this item.'",
        "'speaker_1': 'But it's it's something that we really need to clarify and get clear and territory that stretch land so that Mr. Wang and his son can can have an appropriate use of that property. So having said all of that, I recommend that we go ahead and accept the the recommendation of the of the administrative judge and move forward'",
        "'speaker_1': '. I hope my colleagues will as well. Thank you. Thank you. And that motion has been moved and seconded. Councilman Art and any remarks?'",
        "'speaker_3': 'No, I think Councilman Urunga made the case and I support his motion.'",
        "'speaker_1': 'Thank you. Those are remarks. So members to. Catch a vote.'",
        "'speaker_0': 'Gonzales motion case.'",
        "'speaker_1': 'Thank you. So that concludes our hearings. So I just want to clarify the order of the meeting this evening. So right now we have just a few people queued up for public comment. Just five names we will take up public comment next.'"
    ],
    "Recommendation to request City Attorney to prepare an ordinance amending the Long Beach Municipal Code to prohibit the use of single-use food and beverage containers made of expanded polystyrene foam, rigid polystyrene #6, and non-recyclable and non-compostable material for prepared food distribution.  (Citywide)": [
        "'speaker_1': 'Case. Thank you. So at this at this time, we're going to go ahead and have item number 16. So, Madam Clerk, please read.'",
        "'speaker_0': 'Support from Public Works recommendation to request the city attorney to prepare an ordinance amending the Long Beach Municipal Code to prohibit the use of single use food and beverage containers made of expanded polystyrene foam, rigid polyester, rigid polystyrene number six and non-recyclable and non compostable material for prepared food distribution citywide.'",
        "'speaker_1': 'Thank you. Will go to staff vice mayor councilmembers. Our public works director Craig Beck is going to present this item along with bureau manager of Environmental Services Chico Mokonyane.'",
        "'speaker_10': 'Good evening, Vice Mayor, members of the City Council. We are pleased this evening to be before you to discuss the item that came to council on December of 2016. And in that time the city council, our staff to go out and look at what it would take to implement a polystyrene ban here in the city of Long'",
        "'speaker_10': 'Beach. If you look at this slide, there were essentially four actions that the council requested staff to do. One was to reach out to the Environmental Committee to conduct a public outreach with the community and stakeholders while we worked on drafting an ordinance.'",
        "'speaker_10': 'Also, you requested the city attorney to work with staff to draft that ordinance, to ban expanded polystyrene and other polystyrene disposable food service containers. You requested staff to develop a public education campaign related to the ban, and you also requested that we work with the Economic Development Commission to find financial incentives for local businesses.'",
        "'speaker_10': 'We were able to to.'",
        "'speaker_1': 'Accomplish these.'",
        "'speaker_10': 'Four items. We spent some time over the last four or five months doing that. And we have here this evening the outline of that effort and the ban that we're proposing tonight to go through the details of the work the staff has done and to get into some of the technical aspects of a polystyrene ban.'",
        "'speaker_10': 'I'm going to ask Deacon Mokonyane to go through the rest of the slide presentation. Diko.'",
        "'speaker_1': 'Good evening. As members of the Council. So let's start off with a quick definition. What is polystyrene? There's two forms of polystyrene. There's expanded polystyrene, which is a petroleum based polymer. It's used for packaging and insulation. It's lightweight and consists mostly of air, about 95% of air.'",
        "'speaker_1': 'It's made of pre expanded polystyrene beads and it's also made of Styrofoam. Styrofoam calling it Styrofoam. I call it a tissue, Kleenex. Certain forms are banned. It's it's not the name of the actual product. And there's also rigid polystyrene.'",
        "'speaker_1': 'And rigid polystyrene is a number six plastic. If you look at the bottom of your cups, oftentimes you'll see a number with a with arrows running around it. That would be a number six. It's an unexpected form of polystyrene that's more thin and rigid.'",
        "'speaker_1': 'So the purpose of the ordinance to ban polystyrene is three fold. One, Litter Prevention. Two, to protect public health. The National Institute of Health has identified styrene as a reasonably anticipated human carcinogen. And four three waste reduction. What we are going to propose today will address each of these issues with regard to little prevention.'",
        "'speaker_1': 'Expanded polystyrene is problematic because of its lightweight and easily moves in the world and in the waterways. Study by the Clearwater Water Action Group found that 60% of litter is food and beverage packaging on the beaches, and 60 to 80% of that litter comes from upstream.'",
        "'speaker_1': 'It comes from inland. It doesn't come from the actual beach user. To protect public health against either as a reasonably anticipated human carcinogen. This ban would reduce human exposure to this chemical and with regard to waste reduction and diversion, will see that the recommended recommendation will include only to substitute this material with recyclable items only.'",
        "'speaker_1': 'Also the audiences. There are over a hundred jurisdictions in California alone that have regulated and expanded polystyrene in some way or another. There are different levels of that regulation. You'll see that most of these as I go to the next slide, you'll see that most of these are along the waterways.'",
        "'speaker_1': 'Here you can see there's 19 cities in L.A. and Orange counties that have some degree of polystyrene regulation, some as simple as public facilities, other as thorough as banning it from retail. Oldest one we have in California was done in West Hollywood in 1990, just a matter of interest.'",
        "'speaker_1': 'So the council asked us to get stakeholder input as part of this process. We had five public meetings. We met with the through the Environmental Subcommittee, the Sustainable City Commission, Economic Development Commission twice and then once again with the Environmental Subcommittee.'",
        "'speaker_1': 'During this time, there's a lot of public comment and a lot of good discussion among the committee members about the pros and cons of this over different issues that should be considered as part of it. And we're going to go over a few of those things right now at the Environmental Committee.'",
        "'speaker_1': 'So you can see there's a number of items that came up. I'll give you the the high view, the strong. The big considerations were for a phased in implementation, giving small businesses an additional a longer grace period, allow businesses to use up their existing food inventory and targeted public education campaign regarding the proper disposal of all take'",
        "'speaker_1': 'out packaging. All of these items were put into consideration as part of this recommendation at the Economic Development Commission. Again, it was also recommended a phased in implementation specifying an additional six months grace period for small businesses and to consider financial incentives, as was recommended by the Council for Businesses that voluntarily comply before implementation.'",
        "'speaker_1': 'And also discussion was had about an administrative citation procedure for enforcement. Finally, the Sustainable City Commission meetings, it was recommended that Long Beach Unified School District be included in the ban. The ban be based on the recyclability and compostable of single use food, where items also supported a strong educational effort with an emphasis on reaching small businesses'",
        "'speaker_1': 'and making it multilingual as well, as well as a campaign to encourage people the public to use reusable food where containers. A boomerang campaign, if you will. So we have identified serious food rules that are proposed in this ordinance, including expanded polystyrene would be prohibited, as you see in the first picture, rigid polystyrene as again you see'",
        "'speaker_1': 'in a picture and a non-recyclable food and beverage containers. The scope is food service can be in containers for onsite and consumption of to go. It is not for insulation or any of those other reasons. So very acceptable alternatives would include reusable food where some restaurants like to use or will use materials for servicing.'",
        "'speaker_1': 'In the restaurant, we would propose they use plates that are reusable. The public can bring their own containers to go recyclable or compostable materials. As the examples you see in front of you and in the side, there are recyclable options include plastics one, two and five, and there are common alternatives to plastic.'",
        "'speaker_1': 'Number six, aluminum is a highly recyclable alternative. Compostable options include paper containers, sugarcane and corn derived alternatives. There's a number of there's a number of items out there that can be that can replace the polystyrene assembly. 3.1 was passed by the state a while back.'",
        "'speaker_1': 'It already requires businesses generating every four cubic yards of trash to have recycling. So recycling is available at these establishments. And so 1826 was also passed in 1826 is focuses on organics and requires businesses generate a certain amount of food waste to begin food waste recycling programs.'",
        "'speaker_1': 'If someone were to choose compostable materials as a replacement, they could use the food waste program to have their materials composted. So businesses would be included in the proposed ordinance include all city facilities and food establishments that sell or provide food or beverage for immediate consumption or to go.'",
        "'speaker_1': 'That would include brick and mortar sort of restaurants, cafes, coffee shops, food trucks, food vendors, grocery store prepared, food section only, and other prepared food services that you might see at hotels and hospitals and schools. In light of the recommendations made at the various public meetings, we have suggested a phased in approach.'",
        "'speaker_1': 'I'd like to point out that it is my belief that Long Beach would be the first to have a phased in approach. The other cities in California generally do a deadline and everybody complies. Phase one would be three months after adoption by the council.'",
        "'speaker_1': 'It would be effective at city facilities or local government facilities and special events. Phase two would be six months after that. Food establishments that serve food and beverage for immediate consumption are to go. We are focusing on larger businesses, larger restaurants that we've identified as being having 31 seats or more.'",
        "'speaker_1': 'And that would be six months after the initial phase and nine months after the adoption. And then 15, six months later, 15 months after adoption, would expand to smaller restaurants that have 30 or fewer seats. And. And this gives them the extra grace period that was recommended by the public hearings that we attended.'",
        "'speaker_1': 'We also. There will be exemptions. Sorry, there would be exemptions are offered to people will be allowed to exhaust their current inventory as was recommended to us. If if a company or a restaurant is already under contract to purchase beer food containers, they could be given an extension as part of their exemption.'",
        "'speaker_1': 'And if for some reason there's no reasonable alternatives. This can be evaluated on a case by case basis, and the Director of public works would have the authority to grant an additional exemption. Economic incentives. We met with the Economic Development Commission, as I mentioned earlier, and met with them twice and we did some research on and other'",
        "'speaker_1': 'jurisdictions have done for incentives. The incentive program could take a lot of different looks to it. It could include the city providing some assistance in purchasing materials that may be a little more expensive initially. It may include the opportunity to I'm a strong advocate of just recognizing those businesses that decide to comply early and promoting them and'",
        "'speaker_1': 'have a program where they're recognized. They can have a sticker on their window, they can get an ad in the paper recognizing them and appreciating their commitment to the environment and to this particular ordinance. As far as education and assistance, depending on the decision made by this council, we could have a variety of different educational assistance programs'",
        "'speaker_1': '. Certainly we would like to focus on bill like our Sustainability Commission recommended. Manhattan Beach has a very nice, robust program currently that promotes bringing your own. We would have a website that would dedicate information to people understanding how the band works.'",
        "'speaker_1': 'We would have a hotline dedicated for people to call and report concerns or issues. We would also meet and canvass the restaurants as necessary, and we would have a multilingual campaign to make sure that we were reaching out to all of our all of our restaurants throughout the city.'",
        "'speaker_1': 'Compliance provisions, ensuring compliance is going to be central to the implementation here. And so we will work with the health department. The health department will absorb this annual visits to the restaurants. They use a very educational approach when dealing with restaurants, very much the carrot as opposed to the stick, and especially with the new new ordinance that'",
        "'speaker_1': 'they're going to look at it very sensitively and work with the businesses to ensure compliance. And the Environmental Services Bureau would work with them as they needed to help that education program go out. So summary of our recommendations today to the audience, we recommended the audience include all polystyrene, both expanded and aged, polystyrene and minor sackable or'",
        "'speaker_1': 'non compostable containers. We recommend a phased approach which gives extra time to small businesses to comply. Excuse me. We are committed to having an expansive education and assistance program. We want to have a collaborative approach. This is not intended to beat anybody up.'",
        "'speaker_1': 'It's intended to work with them to help them comply. Ultimately, the goal would be to reduce litter on our streets and beaches to prevent that pollution from getting to our ocean and habitats. Reduce the public's contact with harmful chemicals.'",
        "'speaker_1': 'And promote the use of reusable items over single use items.'",
        "'speaker_10': 'So I just want to recognize all the work that the team did in reaching out and working with the various community members. I want to thank all the community members that came to the various committees to provide input to this process.'",
        "'speaker_10': 'Staff has a recommendation before this council and we stand ready to answer any questions you may have. Thank you.'",
        "'speaker_1': 'Thank you. We'll go to Councilwoman Gonzalez.'",
        "'speaker_4': 'I'd actually like to, if it's okay with everyone, to go to the public first for comment. I know many people have been waiting, so absolutely.'",
        "'speaker_1': 'Let's pull up public comment. Anyone interested in speaking on this item? Please come forward at this stage. I'm going to go west of everybody so we can get a sense of how long public comment will go. Let's have health officials line up if they can.'",
        "'speaker_1': 'If you're able to find. Hello. All right, just. Just a moment. Just want to make sure I have an accurate read the day with my. Okay. So I see about, you know, about 20 people in the audience. So we're going to go to 2 minutes on public comment and then I practice three kind of tight.'",
        "'speaker_1': 'I got talking stick it. Just want to make sure we I mean we have a few big items on to make sure that we have every everyone has an opportunity to talk so I'm gonna make the call as as chair to go down to 2 minutes.'",
        "'speaker_1': 'Given this amount of public comment. And so when you're ready, ready, set go ahead and proceed. Okay. Many of you are aware of the movement to promote Long Beach as the aquatic capital of America. In just over a decade from now, we will have the chance to reinforce this branding as several of the 2028 Summer Games aquatic'",
        "'speaker_1': 'events are held here. The main focus of the group I founded 23 years ago, while Goleta Marine Research and Education is to mitigate the unsightly and unhealthful effects of plastic waste in our aquatic environments. Between 2003 and 2005, Goleta received half a million dollars from the state water board.'",
        "'speaker_1': 'To find out just how much plastic waste comes was coming down the Los Angeles and San Gabriel Rivers and ending up in our marine environment. What we determined was that in the three representative days, we sampled 23 billion pieces of plastic weighing 30 tons were delivered to the ocean by our bordering rivers.'",
        "'speaker_1': 'That's three days less than 1% of a year. The numbers are staggering, but our grant required us to not only find the quantity of plastic waste, but also to do something about it. And we did. We found that 236 million of these plastics, 10% of the 2.3 billion total were preproduction plastic pellets.'",
        "'speaker_1': 'These small resin beads, the size of a grain of rice are what the plastic industry melts to make consumer goods worldwide. They make the weight of the entire Earth's population of humans in these beads yearly. We put screens in the storm drain catch basins near the plastic factories and found that they were losing them to the receiving'",
        "'speaker_1': 'rivers by the millions. Our report resulted in Assembly Bill 258, colloquially called the NOTO bill, which prohibited the discharge of these pellets into the environment. Enforcement actions resulted in no fewer pellets are found in our rivers. Unfortunately, this good news is not reflected in the amount of expanded polystyrene beads that are still flowing down our rivers by'",
        "'speaker_1': 'the millions. Thank you. Actions must be taken. Thank you for your time. Next speaker, please. Hi. My name is Paul Buchanan. I'm a chef and I own a business here in Long Beach. It's a food service business. Polystyrene is difficult to recycle.'",
        "'speaker_1': 'It's a major source of pollution in the city and more importantly, in the ocean and our waterways. I have run my food service business without it. For the past eight years or more, I have focused on using compostable vehicles such as natural fallen palm leaf plates, bagasse, or a variety of paper products.'",
        "'speaker_1': 'I fully support this proposal and believe that it's the right step for our city. And the person that was in front of me, Charlie Moore, knows more about plastic than anybody in this room and most people probably in the state.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'I am Francis, Emily Dawson Harrison, Homicide in District one. And I want to thank Councilwoman Lena Gonzalez. I brought this matter actually to the entire council about a year ago about the fact that I got the crime of the Pacific and attended the lectures.'",
        "'speaker_8': 'And I learned a lot. And they were showing how the staff found the different plastics were affecting the marine life. And so heartbreaking to actually see the actual pictures of the fact that they had on the me, my marine life, my nursing, my background's nursing.'",
        "'speaker_8': 'And I go, wow, this is amazing. I need to share this with other people. So thank you so much, Councilwoman Leanne Gonzalez, and your staff is awesome. And then there was an event that you had around the holiday and I said to your chief of staff, Sequoia, it's just awesome that you are moving forward on this.'",
        "'speaker_8': 'But, you know, you brought to my attention that that I brought it to you. But actually, I want to say that this is a really good thing to have. And when I saw about this this the strikes being not to limit the use of that, that was awesome matter of concern.'",
        "'speaker_8': 'I want to thank you for that. And then also, I don't know if there's any type of incentive to really increase people to bring their own containers. And I was thinking of the cost of being less for the restaurants to have to provide a different form of containers.'",
        "'speaker_8': 'And maybe they can have a kind of an incentive. Like if you go to the movie ten times and maybe 30 times or something, you get a free movie, but maybe you can get a free dessert after you come ten times for something.'",
        "'speaker_8': 'You have a little card that they stamp. I think it's good to have an incentive to try to get people to bring their own. And there's some some country in the Middle East. I mean, I think in the in the Asian part of the world where they actually take the plastic and Styrofoam and they use it and'",
        "'speaker_8': 'they put it and mix it in concrete and delay the road. So, you know, maybe the city can look in to that to see maybe if some of the plastic can be used for mass fashion to try to help protect the earth further.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi. My name is Donna. Pressure on Birch. I sit on the Sustainable City Commission for the eighth District, and I only have a couple of things to say, but I do have a visual that I'd like to just hold up for you.'",
        "'speaker_5': 'And I think we live in a time where consumers and businesses and manufacturers need to come to the realization that disposable, single use, non reusable or repurposing items are just not beneficial for humans, for insects, for any anything that lives on the planet or the environment in general.'",
        "'speaker_5': 'It'd be different if we didn't know better. But we do know better. We know what's the right thing to do.'",
        "'speaker_0': 'Insisting that we need to continue the.'",
        "'speaker_5': 'Manufacture, sale and use of expanded polystyrene, which after its initial use offers little to no value and pollutes the environment to the extent that it is virtually impossible to correct is very shortsighted. So having said that, and I also have something about the business community that I found, Mr. Scott Kanis, who is the.'",
        "'speaker_0': 'He is the executive director of the downtown San.'",
        "'speaker_5': 'Jose Businessmen's Association, which also has a polystyrene.'",
        "'speaker_0': 'Ban, and he represents many of the affected restaurants.'",
        "'speaker_5': 'He says that the restaurant owners haven't been complaining about the switch at all. He said that the customers are the ones that are saying good riddance to Styrofoam, and that is because the restaurants obviously want to accommodate the preferences of their customers.'",
        "'speaker_5': 'I would think that most of Long Beach, that would be their preference to have the thing that is healthy for the environment. So here is my visual. I just wanted to share this. I can't be tall enough. I'm 510.'",
        "'speaker_5': 'By the way.'",
        "'speaker_0': 'There are 110 cities in the city of Long in the state of California that have some type of polystyrene ban. I apologize for wasting all this paper, but I'll recycle it. At any rate, I just wanted you to see this.'",
        "'speaker_0': 'And it's alphabetical and Long Beach terms then.'",
        "'speaker_1': 'Thank you. We're fine right here. There it is.'",
        "'speaker_0': 'So that's where we need to be.'",
        "'speaker_1': 'Fantastic. Thank you for your time. Thank you for your testimony. Next speaker, please. Hey, Larry Bolen. I just wonder if you could call up in your mind a visual of the vessel that left Long Beach and we're out of the mid-Pacific and the area where vessel walked on the polystyrene in the mid-Pacific.'",
        "'speaker_1': 'How many of you remember that? Yeah, I was on my boat.'",
        "'speaker_2': 'Okay. Yeah.'",
        "'speaker_1': 'You. Right? I could. I never forgot that. There must be millions of tons of this stuff. So where are we missing? Looking at some oversight here. And that is the Port of Long Beach. Why don't we take a look at that cruise ship and maybe we could convince them?'",
        "'speaker_1': 'Because I tell you where you know where that stuff goes. A friend of mine was on a a tanker for 20 years. ExxonMobil, not all that polystyrene goes off to the stern of the vessel into the water. And that's a huge problem.'",
        "'speaker_1': 'And it's even a global problem. But why don't we take a look at the port and see what they could do to nation with some of the the cruise ships and maybe the other ships coming in to get rid of that stuff.'",
        "'speaker_1': 'Thank you very much. Thank you. Next speaker, please.'",
        "'speaker_0': 'Hi, I'm Annie Buchanan. I live in District eight and I'm also a member of Long Beach 350.'",
        "'speaker_2': 'I just want to commend this city council. You know, several some years ago we got rid.'",
        "'speaker_0': 'Of plastic bags and we grumbled about that for a while. And now it's a no brainer. We all have these in our car. So I think it's time to take some personal responsibility. I bring this with me to every restaurant I go to.'",
        "'speaker_0': 'It comes back home with me, with my take home. It's easy. It goes right in the dishwasher. I wash it and goes back in the car in this bag for the next restaurant. So I think it's time we do this for Mother Earth, and I commend.'",
        "'speaker_2': 'The city of Long.'",
        "'speaker_0': 'Beach. Let's do it.'",
        "'speaker_1': 'Mother. All right, make speaker, please. Good evening, members of the council. My name is Mark Coleman. I live in the third district where I've lived for over 30 years. And I'm here tonight on behalf of the board of directors for the Peninsula Beach Preservation Group.'",
        "'speaker_1': 'And this is the neighborhood association that represents the families of the peninsula in the third district. The Board of directors of the PB, PG has voted unanimously in favor of the proposed ban, and that has been communicated to our elected representative as well.'",
        "'speaker_1': 'We recently conducted a survey of Peninsula residents and 95% support the ban. I can also say, having lived in Belmont Heights for nearly 30 years, I don't know if Maureen's who lives here, but I would say the residents of Long Belmont Heights probably overwhelming support this ban as well.'",
        "'speaker_1': 'It's just good for our community. Why is this important? If you've been to Peninsula Beach any time in the last 20 years, you'll see it's polluted on a daily basis by trash, including Styrofoam and plastics that come from a variety of sources, including the Port of Long Beach, the L.A. River, the Cerritos Channel, and the citizens of'",
        "'speaker_1': 'the city of Long Beach. The beach will not survive much longer. And the Al Goleta Marine research has led the scientific study to show that the Styrofoam is breaking down at such a level that we will no longer be able to clean our beaches.'",
        "'speaker_1': 'It's incumbent upon the council to act. And I say to my brothers and sisters in the restaurant industry, you use the beaches, too. This is not against the restaurants. This is attempt to make all of us responsible global citizens and more importantly, protect the resources that have been entrusted to us.'",
        "'speaker_1': 'I hope you act courageously tonight and take an important step in protecting our beaches from the pollution that is overwhelming them. Thank you. Thank you. Next speaker, please.'",
        "'speaker_2': 'Oops. Hello.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening. Good evening, everyone. My name is Saucony. I'm one of the co-founders of Long Beach Environmental Alliance. I am for the polystyrene ban.'",
        "'speaker_0': 'With our economic growth.'",
        "'speaker_4': 'Industrial output, increased population and transport, we make more extensive use of natural resources. What I have learned from being an.'",
        "'speaker_0': 'Environmental and community.'",
        "'speaker_4': 'Activist is that some people do not know what to do when it comes to being green or more sustainable in their lives. Some may believe that it takes more work to be green when actuality it is. Cost saving enriches our lives and our future.'",
        "'speaker_0': 'By proposing.'",
        "'speaker_4': 'This dark polystyrene.'",
        "'speaker_0': 'Ban.'",
        "'speaker_4': 'We can help enact change in others. In other words, we need to have a paradigm shift in regards to our behavior mindset of industrialized people. We need to think about next generations and lessen our use of fossil fuels.'",
        "'speaker_0': 'Think about the plastic ban bag. California wanted it and now we have.'",
        "'speaker_4': 'Learned how to adapt to those changes. All it takes is time for people to get used to these things.'",
        "'speaker_0': 'Changing our behavior is necessary. With your help, we can. We can show them the way. In the end, we all share.'",
        "'speaker_4': 'This place.'",
        "'speaker_0': 'And what we should do, sorry, and what we should do. Takes to protect our environment and for the damages and pollution.'",
        "'speaker_4': 'Let's be an inspiration to other cities and countries and have them move forward with us. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. Hello. My name is Seamus Innes. I live in Long Beach and the fourth District Council in Supernormal District at 39512 or away. I'm on the advisory committee of the Long Beach chapter of the Surfrider Foundation, and we started working here in Long Beach in 1999, and one of the first things we started'",
        "'speaker_1': 'doing was holding beach cleanups. And it was a way to get people to realize that the beach belongs to them. And so we started doing these beach cleanups and we sell plastic bags and cigaret butts and Styrofoam, and we started activating, working against Styrofoam and plastic bags.'",
        "'speaker_1': 'We killed the bags. That was great. And then in 2006, after a long time, we started making these postcards that say, ban the foam, get rid of Styrofoam, and we send them we've been sending them ever since we sent thousands.'",
        "'speaker_1': 'I remember sending them when a couple of you guys were staff for other council members and some people's wives were council members and previous mayors. So we've sent thousands of and you guys have received them and realized that this is what a lot of your constituency want.'",
        "'speaker_1': 'So I'd like to take this point, this moment to point out that all these people who've written you over the years of beach cleanups and tabling events, this is what they want. They want to ban Styrofoam in Long Beach, the EPS and the other hard, rigid polystyrene.'",
        "'speaker_1': 'As part of that whole we've been working, Surfrider has been working on it for a long time. The city has been working on it a year ago when this first came up. The city had already been working on it for eight years.'",
        "'speaker_1': 'Now it's going on nine years. And then by the time the ordinance is going to be written, it's going to be nine plus years. They're going to have an implementation phase. It's 3 to 15 months. I would ask that we cut that down to six months because ten or 11 years of working on this is plenty enough'",
        "'speaker_1': '. Thanks. Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening. My name is Sarah. What'sgoingon? I'm here on behalf of the Los Angeles County Business Federation, also known as Best Fed. And I am also a resident of Long Beach. I'm here representing more than 160.'",
        "'speaker_4': 'Business organizations and millions of workers in L.A. County, including the.'",
        "'speaker_0': 'City of Long Beach. The motion to ban on polystyrene will be a huge blow to small businesses and their employees. Ban in a single material and food service packaging will not.'",
        "'speaker_4': 'Address the amount of litter in our public spaces or.'",
        "'speaker_0': 'Bring us closer to zero waste. Food service containers made of polystyrene are a minor component of litter, and if banned, this material can.'",
        "'speaker_4': 'Easily be substituted for.'",
        "'speaker_0': 'Others that would simply similarly go into our waste stream. In 2015, the California State Water Board acknowledged the statewide trash policy that products bans do not help communities reach compliance with their stormwater permits because they do not reduce waste.'",
        "'speaker_0': 'Rather, the board found that product bans are more likely to involve a substitution of the banned item and the substitution would be discarded in the same manner. There are more effective and practical approaches to reducing trash, such as expanding recycling, stepping up an anti litter enforcement, expanding recycling education, and partnering with the business community to identify other'",
        "'speaker_0': 'solutions and opportunities for more recycling investment. But rather than substantively addressing the issue of litter, today's motion will hurt restaurants, caterers, delis and other food service providers who would see their operating costs increase as a result of such a ban because replacement products are 2 to 3 times more expensive than polystyrene products.'",
        "'speaker_0': 'This Fed supports policies that achieve the best solution and have a record of supporting sensible environmental policies. But these policies must be reasonable, and they must actually help achieve the environmental goals that the city has set. We encourage you to look for alternatives to the ban that will actually address the issue in an effective and comprehensive way'",
        "'speaker_0': '. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'No vice mayor, council members and staff.'",
        "'speaker_2': 'Thank you so much for this opportunity. My name's Stellar SEWA from Green Education.'",
        "'speaker_0': 'And I want to thank Councilwoman.'",
        "'speaker_5': 'Gonzalez for having the courage to bring this up as well. I have four friends that are suffering from cancer right now for family members that are also suffering from cancer, prostate cancer, breast cancer.'",
        "'speaker_0': 'Other types of stomach cancer. And, you know, after a while, we start out.'",
        "'speaker_5': 'Stop asking, well, what what caused it, right? Who knows what caused it? But, you know, we we live with so many materials. We use so many materials on a daily basis that might be might be causing these situations.'",
        "'speaker_5': 'They're nonsmokers. They're healthy individuals. You know, it's it's it's a it's a wonder, you know, what what's causing it? Could it be from styrene, from benzene, foam in these Styrofoam products? How many of us go to a restaurant, have leftovers that are packed up for us in a Styrofoam container, only to heat up our leftovers in a'",
        "'speaker_5': 'microwave where the hot foods and liquids start. This breakdown of that Styrofoam causing toxins to be absorbed in our skin. I'm asking for your vote for the health of your constituents, for your kids, for Luca, for do you believe for all the folks that have kids on the council for your future grandkids?'",
        "'speaker_5': 'Note The Green Price Festival has always required something that we do every year, required that our food vendors not bring Styrofoam to those festivals, not bring straws, plastic utensils. Everyone complained about the plastic bag ban. This is something that I think we can get used to.'",
        "'speaker_5': 'It's behavior change that I believe most of us will be more than happy to to take on. And so I ask for your support. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening. My name is Stephanie Mathews and I'm an organizer of a monthly beach cleanup here in Long Beach. Polystyrene is the single most fun item during our beach cleanups. Over time, it breaks down into tiny pieces, which are by far making up by.'",
        "'speaker_5': 'Far the hardest item to remove, both.'",
        "'speaker_2': 'Commercially.'",
        "'speaker_0': 'And by hand. By its nature, polystyrene is very bristle and fragile. So when the city bulldozers come to clean up the beach.'",
        "'speaker_5': 'They actually break it.'",
        "'speaker_0': 'Down even into smaller pieces and leave them behind.'",
        "'speaker_2': 'Instead of removing it.'",
        "'speaker_0': 'And disposing it accordingly. It is. It takes a lot of effort, hard work, and it's mainly impossible for our volunteers who then sift through the sand for hours to get these tiny little pieces.'",
        "'speaker_2': 'Out of the sand. And it is completely mixed in.'",
        "'speaker_0': 'The only way we can protect our waterways and enjoy our beaches as a resource for public health is to prevent this material to enter our community. So I'm very happy to hear that the city is moving forward with the ban, and I congratulate you on your leadership in this matter.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. Hello. Hello. My name is John Kendrick. I'm one of the co-founders of the Long Beach Farming Alliance. I'm also the vice chair of the Gray Panthers here in Long Beach.'",
        "'speaker_3': 'A member of the.'",
        "'speaker_1': 'Long Beach, 350. And also don't waste Long Beach, and I'm going to go farther than what people have been saying. I'm going to show you what actually has been going on over the years in Long Beach. Now this city makes money from tourism and all kind of water activities.'",
        "'speaker_1': 'But how long can we go like this? And people don't want to come to this city and do things they do. May be somebody that lives here. Or somebody coming to visit. Nobody wants to come to a city that looks like this.'",
        "'speaker_1': 'No, but the whole year around and a lot of times this is days that not after a storm, but just on a regular day. This was going on. It used to be a time you saw this trash. Only when it when it rained and after it rained.'",
        "'speaker_1': 'But now we see it is on a daily basis through our whole city. It doesn't matter if you don't have any river. If you're sitting there a San Gabriel River or walking through the city of Long Beach or no parks, this is going on everywhere.'",
        "'speaker_1': 'We talk about being a green community, but we don't act like one. And what does this say for our children? Because what we don't clean up today, they got inherited. And this goes on to health issues and other things.'",
        "'speaker_1': 'It's time for us to put our actions where our mouth is and do it for ourselves and for our children. Thank you. Thank you. Thank you. Next speaker, please. Good evening, Vice Mayor, Honorable Council. My name is Chris Duggan.'",
        "'speaker_1': 'I am representing the California Restaurant Association. We happily represent over 500 members here in beautiful Long Beach.'",
        "'speaker_2': 'Sierra opposes the item before you tonight. A ban on foam and our takeout containers are opposition.'",
        "'speaker_1': 'Is also with all.'",
        "'speaker_2': 'Bans on single use food service products.'",
        "'speaker_1': 'Bans are essentially mandated cost increases that often hit the.'",
        "'speaker_2': 'Smallest mom and pop family owned restaurants in your community. The mandated costs are real and you have seen over 120 individual restaurants have written letters to you explaining this. These are not big restaurants.'",
        "'speaker_1': 'This is the economic backbone of your community. Most of these restaurants are the smallest restaurants.'",
        "'speaker_2': 'In Long Beach, and the proposed ban would adversely.'",
        "'speaker_1': 'Impact them the.'",
        "'speaker_2': 'Hardest. The new mandate cost just adds to the cumulative.'",
        "'speaker_1': 'Impact of the rising food costs and the rising labor.'",
        "'speaker_2': 'And health care cost to our industry.'",
        "'speaker_1': 'Additionally, a phased in approach.'",
        "'speaker_2': 'Is not the answer to these increased costs. Whether you pass the ban today or pass it with a phased in approach, small businesses will feel the impact truly.'",
        "'speaker_1': 'Earlier this year.'",
        "'speaker_2': 'The CIA commissioned a price study again that was sent before you. It showed the cost ranged between 54 and 145%. This is with.'",
        "'speaker_1': 'Both your hot cuts and your cold cuts. Again, bans are not the solution.'",
        "'speaker_2': 'Bands lead to more bands.'",
        "'speaker_1': 'What Long Beach needs is a comprehensive litter prevention recycling program in place. Therefore, the CIA S.R. urges you to oppose the item before you tonight. Thank you. Thanks for your time. Speaker, please. Good evening. My name is Mike Centers.'",
        "'speaker_1': 'I'm CEO of Titus Services. We're a recycling company in Los Angeles, California, and we primarily work with material recovery facilities. I like to call a murphy MRF, and what they are is they take all the material that's in your blue bin from your home or a lot of times from the bins put out at businesses and take'",
        "'speaker_1': 'them to a center and they separate the material by material type. We believe that bans are not the way to solve the recycling or the litter problem. We think that taking that material and using it in another manner is the best way.'",
        "'speaker_1': 'And our secondary murf takes material from the Merced, from the blue bin that isn't captured originally from the murf. And we recycle deeper. We recycle for polystyrene, expanded polystyrene and rigid recycle for polypropylene, pet htp, aluminum and metal.'",
        "'speaker_1': 'And when we see materials banned, what it does is it reduces our volume, makes it more difficult for us to get to truckload quantities. And that's what you need to make recycling work. You have to get to a point where others can use it as a resource and replaces Virgin material.'",
        "'speaker_1': 'We've done work in California. We've been managing to recover about 50% more from a material recovery facility. By taking it and designing different equipment and removing it. One of our products is expanded polystyrene. Polystyrene. We did some work in Culver City when they were looking at a ban.'",
        "'speaker_1': 'We actually took material that was going into another company, took what they were missing, and we recycled about 40% of it and divert it from landfill. So we've been pretty successful in delivering. We'd like to divert 50%. It depends on the customer, but generally been pretty successful in doing it.'",
        "'speaker_1': 'And by doing that we've been creating jobs. We have created 23 jobs over the last five years and our goal is to put one of these in every major city in the United States. And we believe it's a win win.'",
        "'speaker_1': 'You get further diversion, which is important for the city and state mandates, and you also get an opportunity to recycle material rather than having it end up in the wrong spot. Thank you. Thank you. Next week, please.'",
        "'speaker_6': 'Hi, guys.'",
        "'speaker_5': 'You know me as the chair of the Sierra Club, although I do live in one of the council districts. We've got members in all your districts. Several of them are really emailing you about this issue. Everything we've heard today, you could almost take out the.'",
        "'speaker_0': 'Word polystyrene and put it in single.'",
        "'speaker_5': 'Use grocery bags. It's the same conversation we just had. People a couple of years ago freaked out, said it was good to close grocery stores. People would lose jobs. We'd have no way to get our groceries home again.'",
        "'speaker_5': 'But we made the transition pretty easily. Business fears change and I get that. But we just made a small change by by getting rid of the single use throwaway grocery bags. And now there was a lot of talk back then about proper disposal and littering being the real problem.'",
        "'speaker_5': 'But they're so lightweight, just like the polystyrene clamshells, they're so lightweight they blow out. But since we banned them, how many of you guys have seen what I called the jaywalking jellyfish? Those things that would kind of slowly grow across the street.'",
        "'speaker_5': 'We don't see them anymore because they're not there to be blowing out of our trash cans and stuff. Now, I see a lot of people here that have never been to our council meeting. I know this because we don't have a blue bin.'",
        "'speaker_5': 'We've never had a blue bin, but these people care and I don't want them to lose their jobs. People have gone out and bought matching t shirts. They really made an effort. They really must be in fear that their jobs are going to go away.'",
        "'speaker_5': 'But we we got rid of the single use throwaway bags and nobody lost jobs. Grocery stores didn't close. 110 other cities have gotten rid of throwaway polystyrene, and they've still got thriving restaurants. They still got catering business like Paul's.'",
        "'speaker_5': 'So nobody should be losing your job over this because 110 other cities in California have done it. So if they can do it without closing restaurants and losing people's jobs, if we got rid of our single use throwaway grocery bags without closing what little mom and pop corner stores are losing jobs.'",
        "'speaker_5': 'I think we can make this transition without any of these people who shown up tonight losing their jobs. And DeKoe had provisions for small businesses who were financially strapped by this. So it sounds like we've got a great plan in place.'",
        "'speaker_5': 'Thank you for your yes vote.'",
        "'speaker_1': 'Thank you very much. Next speaker, please. Good evening, Vice Mayor Richardson, Federal Council. My name is Tommy Fireblade with IBEW Local 11 here in Long Beach. We care about jobs and environment. We do not believe that they are mutually exclusive.'",
        "'speaker_1': 'This is why we oppose the policy that would ban expanded polystyrene single food service containers. Such a policy picks winners and losers. Manufacturers of expanded polystyrene food service products have facilities here in Southern California that provide important jobs to our recovering economy.'",
        "'speaker_1': 'Bands could risk these jobs. We need more investment in our recycling infrastructure. It is outdated and it often does not capture all of the recyclable material. In fact, some recyclers may only recycle less than half of the material.'",
        "'speaker_1': 'Bands, such as the proposed EPS Food Service Container Band does not work the only harms manufacturing insults in small businesses and further delays solutions that will improve recycling and create new good paying jobs. It is time to develop solutions that are good for jobs and good for the environment.'",
        "'speaker_1': 'Thank you. Thank you. Thanks, Peter, please. Good evening, Vice Mayor Richardson, council members. As other speakers have spoke tonight, we have people from the restaurant industry here that are working mom and fathers, sons and daughters are with us this evening.'",
        "'speaker_1': 'I want to commend them tonight for coming. Thank you very much. Please stand. The reason why I commend them is you all recognize how difficult it is to come to a council meeting. We're now, what, almost 7:00 and they've now spent their evening 2 hours to come down here and tell you that they're opposed to a ban'",
        "'speaker_1': '. They're opposed to a phased in approach. There's no two ways about it. We've only been impacted with the minimum wage. We've already been impacted with sales tax increases. Let's take a different approach. Let's find a solution. Let's don't go with just political rhetoric of 110 cities.'",
        "'speaker_1': 'Heck, there's 300 cities in California that don't have a ban. Big deal. The reality it is find solutions. Those solutions are data driven. The council has proven in the past that they look at facts and statistics rather than just the emotional rhetoric tonight.'",
        "'speaker_1': 'Figure out a way through coming up with a solution by getting the city, whether it's through the private sector, whether it's working with city staff, whether it's through a third party, get a survey done that determines what impacts have happened with these other cities that have passed the ban.'",
        "'speaker_1': 'Take a look and see what's out there before you pass this ban and impact mom and pop restaurants. Don't be quick to make a decision tonight. Take a slower approach. Thank you. Thank you. Next speaker, please.'",
        "'speaker_6': 'Hello, Council. My name is Elizabeth LAMB. I'm executive director of Low Cerritos Wetlands Land Trust. And our mission is the protection and preservation of our local wetlands, the low cerritos wetlands, my organization and the thousands of supporters and members that.'",
        "'speaker_0': 'We have support this.'",
        "'speaker_6': 'Ordinance.'",
        "'speaker_5': 'We decided to support.'",
        "'speaker_6': 'The ban because of the harm that.'",
        "'speaker_0': 'Polystyrene does.'",
        "'speaker_5': 'To low Rita's.'",
        "'speaker_6': 'Wetlands. It not only pollutes our wetlands.'",
        "'speaker_0': 'But it also harms the wildlife.'",
        "'speaker_6': 'That depend on this fragile ecosystem. It breaks up into small pieces that are mistaken as.'",
        "'speaker_5': 'Food by some of.'",
        "'speaker_0': 'The wildlife out there. And it also.'",
        "'speaker_6': 'Hampers nesting and other.'",
        "'speaker_4': 'Activities out there because it clutters up the.'",
        "'speaker_6': 'Wetlands. And as you know, there aren't very many left in Long Beach at this time. When the lows through this wetlands are being restored and becoming more and.'",
        "'speaker_0': 'More of this.'",
        "'speaker_6': 'Great community resource, we need to do things to make it a more robust and inviting place for the community and for habitat. And the polystyrene ban helps do that. While I am not an expert on business, I was talking to.'",
        "'speaker_5': 'The proprietor of a local business in the third district, the owner of a coffee house called.'",
        "'speaker_0': 'Viento e Agua.'",
        "'speaker_6': 'And he hasn't ever used Styrofoam, he told me.'",
        "'speaker_4': 'Because he thinks it's so damaging.'",
        "'speaker_6': 'To the environment and his business is thriving. And I am as compassionate as anyone about people's small businesses. And I would urge those who are concerned about this ban to talk to these.'",
        "'speaker_4': 'Successful.'",
        "'speaker_6': 'Local businesses and learn how they were managed, how they managed to do so well by taking what is really a small step for protecting the environment.'",
        "'speaker_0': 'It is a bit of a cliche, but it is true.'",
        "'speaker_5': 'That.'",
        "'speaker_6': 'Someday.'",
        "'speaker_4': 'The way.'",
        "'speaker_6': 'That we inhabit the planet will come back to impact our children and their children and their children's children. This modest.'",
        "'speaker_4': 'Proposal that makes Long Beach.'",
        "'speaker_6': 'A good example for other cities is something that I support and I.'",
        "'speaker_4': 'Hope you do as well.'",
        "'speaker_1': 'Thank you. Next speaker, please. Good evening, Vice Mayor Richardson and members of the council. My name is Rob. No, tough. I'm the director of the Don't Waste Long Beach Coalition. And our coalition believes in a zero waste city with recycling, composting and good green jobs for all.'",
        "'speaker_1': 'And we're here to speak in favor of tonight's proposal. Not only is this material nearly impossible to recycle, but it also often times open, ends up on our local beaches and threatens our local wildlife and marine life. And if we want some data and stats at the rate we're going by the year 2050, there will be more'",
        "'speaker_1': 'plastic by weight in the ocean than fish. So let that sink in because we are a city that enjoys a large stretch of the Pacific coastline and we should pause and think about what that truly means for us, our quality of life, and what that means for the future of our beaches and what it means for residents'",
        "'speaker_1': 'of our city. The Donors Coalition has participated in several beach cleanups, as you've heard from other speakers here over the past year. And the number one item we find on our beaches is Styrofoam. It breaks up in a tiny bit, as you've heard.'",
        "'speaker_1': 'And when that happens, it's mistaken for for food or for fish eggs. We have sea, we have fish, we eat it. We have we have seagulls who eat it. And of course, they suffer the consequences from this. But even beyond the immediate threat to our environment and quality of life are the workers themselves who actually produce this'",
        "'speaker_1': 'stuff. Many of the chemicals used in the manufacturing. Process are toxic. The workers who manufacture and the workers actually manufacture it are the most at risk. And so it's for these reasons that 110 other cities have actually already moved ahead with this policy.'",
        "'speaker_1': 'So let's not be the last to jump on this train. It's good policy. It's good science, and it's the right thing to do. So let's move forward with doing what's right and protect our workers, our environment, and let's ban polystyrene.'",
        "'speaker_1': 'Thank you. Thank you. Next speaker, please. Good night, council everyone. Good night. My name is called on Decenas.'",
        "'speaker_3': 'I am worried about.'",
        "'speaker_1': 'That the band because I depend heavily on his jersey for our material and the band will incur the cost to my business by 20,000. I know that more than I can use to do. I invest in my business.'",
        "'speaker_1': 'I worry about the the peace with the city is alive. The cost. Right now, we have a lot of problem with the Turks put in the streets their language. So right now, increase the band the cost impact in our restaurants.'",
        "'speaker_1': 'We are part of the restaurant in this more business and. I worked really.'",
        "'speaker_3': 'Hard to build my my.'",
        "'speaker_1': 'Business for three years. So every everything happened in the city in park made it hard to my my business my business is family business. So my family depend the business is I pay a lot of the fees and I get money for the everything.'",
        "'speaker_3': 'The brand, the light.'",
        "'speaker_1': 'The legacy, everything that, the things I need in my restaurant, in fact, very hard. Thank you. Thank you. Next speaker, please. Good evening, Castle. My name is Brennan Holley. I'm here representing Sebastian Gomez, owner of Casa Sanchez, number four, where I work.'",
        "'speaker_1': 'Um, it's been here for 15 years. And Long Beach. I'm here opposing the ban on polystyrene and number six, plastics. Also, I oppose any type of phasing process. Thank you. Thank you, Max. Speaker, please.'",
        "'speaker_4': 'Good evening. Dear council members, my name is Lorelei Levis and I work at Daily Bread Bakery, which recently opened a year and a half.'",
        "'speaker_0': 'Ago on North Long Beach. I'm here to say my opposition to the proposed band of the polystyrene containers.'",
        "'speaker_4': 'We're a reason business. And we did struggle a little bit at the beginning to start it. However, though we are concerned with this because this increases our expenses as it is, it's brand new. And as you all know, starting a new.'",
        "'speaker_0': 'Business, it's it's a little difficult.'",
        "'speaker_4': 'And now even more with.'",
        "'speaker_0': 'This van it it a like it makes.'",
        "'speaker_4': 'Us double think of.'",
        "'speaker_0': 'We can do this or not and we appreciate you guys. If you guys would like like they all said would.'",
        "'speaker_4': 'Double consider and.'",
        "'speaker_0': 'Not like vote on this that fast without looking.'",
        "'speaker_4': 'At the other cities that have already.'",
        "'speaker_0': 'Passed this ban.'",
        "'speaker_4': 'So, yeah. Thank you all so much.'",
        "'speaker_1': 'Thank you. Next speaker, please. Hello. Good evening. City Council. I live and represent Long Beach, California. I mean, I love doing these Long Beach years and I work as Santa Claus is number one. And we totally opposed the ban of Styrofoam products.'",
        "'speaker_1': 'And number six, we feel that this is a ploy to cripple the small business owners. I mean, like right now, our costs of the products are $200 a week. With the ban, it will go up to $400 a week, if you notice.'",
        "'speaker_1': 'Look at the people who are opposing this ban. You know, it's the larger companies. You know, if we if you if you guys do this will totally cripple us, maybe put it out of business. You know, I ask you guys to not vote for this ban.'",
        "'speaker_1': 'Thank you. Thank you. Next picture, please.'",
        "'speaker_0': 'Well, I want to start with Mitt Romney's agenda.'",
        "'speaker_1': 'Garcia good afternoon. My name is General Garcia. I am also translating for.'",
        "'speaker_0': 'Your trouble in capers, burgers or negosyo. I stayed on Long Beach for the U.S.A..'",
        "'speaker_1': 'I work at Gabriel's Burgers, a business that has been in Long Beach for over ten years.'",
        "'speaker_0': 'Yesterday, I keep an undeclared army position alla provisioned a container, loaded the plastic of my metal safe.'",
        "'speaker_1': 'And I'm here to declare my opposition to the prohibition of our number six plastic containers.'",
        "'speaker_0': 'Yes, the material. The plastic was economical, efficient. Yes. And cultural negotiable.'",
        "'speaker_1': 'This material is both affordable and efficient and very essential for my business.'",
        "'speaker_0': 'Are there masala provisions basil weed lost causes among the theses meal dollars alone?'",
        "'speaker_1': 'In addition, given if the double in increase of cost is, is, is accurate, it would increase my costs by $16,000 a year.'",
        "'speaker_0': 'At Alamosa water.'",
        "'speaker_1': 'Twice as much as we play right now.'",
        "'speaker_0': 'Nosotros get a month in plastic. Go for muchos personas. Enchiladas on your trabajo neighborhood record.'",
        "'speaker_1': 'We would like to keep using this material because there are a lot of low income people in our communities that rely on this.'",
        "'speaker_0': 'I personally am pregnant and also said the Leviticus letter here to proclaim either.'",
        "'speaker_1': 'There are many of our customers that ask if we accept MBT, which is the, you know, food support program by the state.'",
        "'speaker_0': 'Is so significant a person asking Napoleon comprises alimentos continental you know.'",
        "'speaker_6': 'Be the new.'",
        "'speaker_0': 'Local gobierno.'",
        "'speaker_1': 'I mean, these are people that cannot afford to buy their own food supplies and ask the government for assistance.'",
        "'speaker_0': 'Sierra Leone I somebody that Andrea of Jezebel of fuels a la comida if I look at no Podemos I say.'",
        "'speaker_1': 'If you guys approve this ban, we will definitely be forced to raise our prices, and that's something we can't do.'",
        "'speaker_0': 'BURGER Muchos personas. GABBANA The NLD nettle by the palazzos element of.'",
        "'speaker_1': 'Because there are many people that obviously don't have the money or barely have the money to pay for their own food stuffs.'",
        "'speaker_0': 'Them unite person to get by some Paula can yes online order the launcher either c than zero to comida in order for them or the food vendors continued orders. The comida. The plastic is the one that both parties give.'",
        "'speaker_1': 'And we also have a lot of people that want to take their food to go and they don't have their own containers to, you know, do that. They rely on these containers less.'",
        "'speaker_0': 'Peter Consiglio cannot comment on when I was in contra restaurants back in your boat, they're not l'approvazione.'",
        "'speaker_1': 'I asked the council members to don't commit an injustice and vote no on this ban.'",
        "'speaker_0': 'GRACE Yes, thank you.'",
        "'speaker_1': 'Thank you. And before we take the next speaker, I see the gentleman in the suit is the last in line. If there's anyone who wants to speak, now's the time to get in line. Otherwise, sir, in the suit.'",
        "'speaker_1': 'You are the last, last speaker and public comment. Then proceed.'",
        "'speaker_0': 'Hello. Good evening. My name is Cecilia. This is one, darlin. And this is Sophia. And we are here to represent Polly Burgers, a business that has been in Long Beach for 24 years. We are here to state our opposition to the proposed ban of polystyrene containers.'",
        "'speaker_0': 'We're worried about the ban because Polly Burgers depends heavily on the use of the this affordable material. And the ban will increase will heavily increase the cost to the business at Polly Burgers.'",
        "'speaker_5': 'We are also concerned that the City Council Council is planning to ban a product that is in fact recyclable. The city can now recycle it on its purple and the purple bins. We have worked really hard. The business has worked really hard and we urge the city to vote against the ban and unfairly target small businesses.'",
        "'speaker_5': 'Even a face out approach is going to hurt small businesses in the long run. You know, we think we're doing a good, but in fact, we're going to end up hurting ourselves later on. I think that the city and the businesses should come together and promote recycling instead of this ban that would just hurt small businesses and'",
        "'speaker_5': 'small business owners. Thank you. Thank you.'",
        "'speaker_1': 'Thank you for your testimony next week. Please. Hi. Good evening. I am Vincent. I work for Casablanca Restaurant, Mexican food. And there is some for a stay here is too opposed to the ban. One of the reason is that if you give somebody else blade like could be reusable.'",
        "'speaker_1': 'I don't think somebody wants to go to their house and watch the place that they have been using for and go back with the same plate. They are bad bags, you know, are very full. I don't think they are going to use and are played for.'",
        "'speaker_1': 'I think we going back 50 years ago that way, you know, we are going back 50 years. So I just I don't think is a good idea to go in the plate and use it again because it is food, you know, and food got bacterias and everything.'",
        "'speaker_1': 'So I opposed to the ban. And thank you very much. Thank you. Next speaker, please.'",
        "'speaker_2': 'Yes. I'm Brenda Smith and I'm with Patricia's restaurant in Bixby Knolls and I'm representing them as the band on the food containers, which is going to hurt the businesses for the restaurants. And I work with quite a few small mom pop restaurants and for the band the.'",
        "'speaker_2': 'The containers is going to be a hardship on them also as well as the community to go up on their prices in which most of the people in poverty do go and buy their readymade food from these different types of small restaurants.'",
        "'speaker_2': 'And along with abandoned them. And if they want to ban something that's going to hurt the environment. I can agree with trying to protect the environment, but also why no one's focusing on what are we breathing in the air from these jets flying and spraying us and we don't know what we're coming down with and we want'",
        "'speaker_2': 'to blame it on the Styrofoam. It's making us outcasts, and no one knows what's causing us to become ill but banned and something that's helpful to help people to get their meals home from a nursing male to nutritional for their bodies.'",
        "'speaker_2': 'They want them to bring back containers to bring their food home. A lot of times people don't even have enough money. They stand and panhandle to get money to buy a fast hamburger, a fast taco or whatever it may be.'",
        "'speaker_2': 'But to ban that, it is unsanitary to bring your own containers back to a restaurant. Now, when the health department are going to step in on, they're going to turn around, said you cannot accept reusable containers from your home or whatever.'",
        "'speaker_2': 'So you're going to run into so many situations. So something's got to give. And I believe strongly that it should fall into the favors of the small communities to where they are playing a vital part in the community, to where they have jobs.'",
        "'speaker_2': 'And so they don't file it to become a statistic of unemployment. Those are nice.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Thank you, Vice Mayor.'",
        "'speaker_4': 'Richardson and Council. My name is Samantha martinez and I.'",
        "'speaker_0': 'Represent the Plastic Foodservice Packaging Group. We are a trade association that represents the resin manufacturers, resin suppliers and the manufacturers of all different types of foodservice packaging. Talking about the apps and apps that you're speaking about, talking about all rigid plastic paper, poly coated paper, compostable degradable, all of the different types of materials that are food service'",
        "'speaker_0': 'packaging. And we agree.'",
        "'speaker_4': 'We do not want to see our products in the literature and we do not want to see.'",
        "'speaker_0': 'Them in the landfill. We would love to see.'",
        "'speaker_4': 'And work with you on recycling and on litter removal.'",
        "'speaker_0': 'But a ban will not address that.'",
        "'speaker_4': 'A ban will take one material out and replace it with another.'",
        "'speaker_0': 'Material, which might even be more plastic material.'",
        "'speaker_4': 'Or.'",
        "'speaker_0': 'Material that doesn't doesn't degrade and or isn't recyclable. So we think and we have heard from experts that a ban doesn't address and doesn't reduce litter, doesn't reduce waste whatsoever. It's just replace with another product. What we really need is a real solution that's.'",
        "'speaker_4': 'Going to address recycling and other.'",
        "'speaker_0': 'Ways to effectively address litter. Also, as you've heard, it would affect jobs by banning polystyrene foam, both in terms of manufacturing, but potentially in terms of hours at restaurants. I'm want to address the health issue, the FDA, the U.S. National Toxicology Institute of the Environment, the U.S. toxicology program, the Harvard Center for Risk Analysis all say that'",
        "'speaker_0': 'polystyrene is safe for food for food service consumption.'",
        "'speaker_6': 'Styrene occurs naturally.'",
        "'speaker_0': 'In strawberries, in beer, in.'",
        "'speaker_4': 'Cinnamon, and a lot of things that we eat and ingest in.'",
        "'speaker_0': 'A lot larger.'",
        "'speaker_4': 'Percentages than in a in a polystyrene.'",
        "'speaker_0': 'Foam cups. So we hope that you'll take a step back and look at the full issue.'",
        "'speaker_4': 'And we would love to work with you on real solutions. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, city council. Hopefully I'm going to try to get as far as I can with this with the baby. My baby sitter canceled tonight, but that was very important for me to be here. I'm the executive director at Al Goleta.'",
        "'speaker_4': 'Many of you are familiar with our organization. We are local here and we work to prevent plastic pollution. It's our job. We have become very embedded in this issue at a global level. We have toured, you know, facilities on a global level, local level here in the States.'",
        "'speaker_4': 'And we have seen how difficult it is to process not just the polystyrene, but all plastics. And there's a lot of complexities behind this issue on both sides. It's not about just Long Beach. It's not just about the states.'",
        "'speaker_4': 'But we're looking at a material that is low in value. Therefore, it is not recovered and recycled at the rate that it should be. We have seen that even with the machinery that the plastics industry gives to the facilities, that they still have a very hard time selling the expanded polystyrene.'",
        "'speaker_4': 'In fact, we toured a facility where they were having to pay customers to take the polystyrene away because they couldn't afford or because they had to meet the quota and that they had to divert a certain amount of material.'",
        "'speaker_4': 'So we're working with plastics that literally are designed to be used once yet designed to last forever. We've been very irresponsible with this material when we should have feared the consequences of plastics from the very beginning. And that's ultimately how we ended up in this position, is we were not responsible with a persistent and polluting material that'",
        "'speaker_4': 'now is ubiquitous in nature. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening, City Council. My name is Sona Coffey and I'm a resident of the fourth District and I also serve as the vice chair.'",
        "'speaker_4': 'Of your Sustainable City Commission.'",
        "'speaker_0': 'I'm here tonight to speak in support of this item. I really see this challenge of how we deal with disposable food waste materials as an opportunity for the city, as an opportunity for the city to really help our most vulnerable communities, most vulnerable people in our communities, the hardest working people in our communities.'",
        "'speaker_0': 'As you can see, several of them are here tonight. We want to do to take that responsibility and as local government to really help pave the way. I hope staff here can bring these two groups together. We have a sea of blue and a sea of green, and I think it might look really beautiful from down here'",
        "'speaker_0': '. But I know there's a lot of opposition and contention. And from the comments made tonight, there's a lot of education that needs to happen. And I think that really is the role of the city. That's the role of staff here as you are hopefully providing direction to bring back an ordinance for the staff to move this forward'",
        "'speaker_0': 'and work with both sides so we can come up with those creative solutions. And there are creative and cost effective solutions available. Many of you know me from my work in local government. I worked for one of the cities, one of the 110 cities that did pass this ban.'",
        "'speaker_0': 'There were no impacts to our local businesses. We didn't have hardship claims. They were not shuttering their doors because we had to replace the products, getting rid of foam and the rigid polystyrene and replacing them with recyclable alternatives.'",
        "'speaker_0': 'So those options do exist. I would share one example from the city of Seattle and the Sustainable City Commission.'",
        "'speaker_5': 'We would like the city to include a.'",
        "'speaker_0': 'Request for businesses to only provide straws upon request. And Seattle did this with their straws in Seattle campaign playing off of their Sleepless in Seattle, great hit in that area, but really looking at 150 restaurants for 30 days.'",
        "'speaker_0': 'They did not provide plastic straws. People didn't complain. They the ones who did want it got a paper straw upon request. They were able to cut out 2 million straws in that 30 day period. We use 500 million straws a day in America.'",
        "'speaker_0': 'So it's a big problem and we're looking to local government to help us solve it. Thank you.'",
        "'speaker_1': 'Thank you. Next speaker this evening, city council members and staff, my name is. Thank you for allowing us to speak and thanks for all you do. I know it's often a no win situation. You can't please all the people all the time and you put in a lot of time.'",
        "'speaker_1': 'So I know you're going out of here. Just hopefully get out of here with your health and your sanity at the end of your terms. I'm a retired schoolteacher, 36 of those years. The next minute, just for that comment.'",
        "'speaker_1': 'You're a good man. I don't care what any of your ex-girlfriends say, sir. My wife got the final word. Good man. You've learned. Well, I taught in Long Beach for 36 years at Long Beach State. Rogers and Marshall, when they were junior high schools and finished my career at Wilson High School.'",
        "'speaker_1': 'I'm here to speak on behalf of the polystyrene ban. I think this is a litter issue. It's all over the beaches. It's all over the city. It never biodegrade. It will always be there and has always and has already been identified as a human carcinogen.'",
        "'speaker_1': 'It never goes away. It may get smaller, but it's always there. Polluting and causing disease in human beings. 19 city regulations and restrictions in L.A. and. That's a great start. I'm hoping we're going to be the next. This is a health issue.'",
        "'speaker_1': 'I hope you allow us to be the next city. Fish and birds are dying because they ingest it. They get no nutrition from it. I've seen it happen. It's a simple equation. If the fish die or the ocean dies effectively not supporting ocean life, then we follow.'",
        "'speaker_1': 'We die. We as a city need to start now and preserve the beauty and health of our oceans, beaches and ourselves before it's too late. I do believe that safety trumps economics in this case, and this is a public health and safety issue.'",
        "'speaker_1': 'The polystyrene ban will be a wonderful step in that direction, and this will be for us and those who follow us. Thank you very much for listening. Thank you. Next speaker, please. Council members. Thank you very much. Tim James, California Grocers Association, representing many of the grocery stores operating here in Long Beach.'",
        "'speaker_1': 'I think we need to start with the false comparison between the single use plastic bags. Single use plastic bags were never used to contain prepared foods. We never put prepared foods in those plastic bags. What we're talking about with this issue is products that we as grocers who have both a legal and a moral responsibility to be'",
        "'speaker_1': 'as safe as possible with our packaging options as well as ensuring quality. Have concerns with bans on packaging. The things that we need to be concerned about with grocers as we choose. Our packaging items are called holding temperatures, hot holding temperatures.'",
        "'speaker_1': 'The amount of time that packaging is going to be used not only inside the store but at home with the consumer. That gets into various details about oxygen transfer rates, moisture transfer rates, a lot of detail. But all of that comes back to the singular point that for our responsibility for our consumers is, number one, we have'",
        "'speaker_1': 'to use packaging that is safe for the product. That's our number one choice. The second one is then to maintain quality. When you think about a lot of the foods we package in the stores for several days, then as consumers you bring them home, use them over another period of several days.'",
        "'speaker_1': 'So that's why the packaging grocers used is chosen very specifically for very specific purposes to hand up to hold up to those rigors both in the stores and at home. That's why we're asking you not to move forward with this ordinance today and continue to look at other opportunities to address some of the issues you believe you'",
        "'speaker_1': 'have in Long Beach so that we can still retain those opportunities to make sure we have safe and quality food that's being provided by our grocery stores. Thank you. Thank you. Next speaker, please. Good evening, Vice Mayor and council members.'",
        "'speaker_1': 'My name is Kobe Sky. I'm a second district.'",
        "'speaker_2': 'Resident environmental engineer.'",
        "'speaker_1': 'And I'm very proud to be the chair of the Sustainable City Commission. I wanted to speak in favor of the proposal before you tonight and wanted to thank staff for doing such a great job in reaching out to stakeholders and developing a proposal that really tries to balance all of the feedback that they've been receiving over the'",
        "'speaker_1': 'months that they've been working on this, since they got direction from this council to move forward 15 years ago. There is a book written called Cradle to Cradle, and it talked about the need to shift our economy to rely on either recyclable or compostable materials so that we're not creating materials that are used once and end up'",
        "'speaker_2': '. Hurting our environment indefinitely, literally for.'",
        "'speaker_1': 'Centuries. And that's what we're talking about doing tonight. It's not just about expanded.'",
        "'speaker_2': 'Polystyrene or.'",
        "'speaker_1': 'Styrene. It's about all the products that are being used that aren't recyclable or compostable and shifting to ones that meet either of those two approaches. This is the heart of the proposal that staff has put together, and it's going to put us on a path to a sustainable future.'",
        "'speaker_1': 'This is where the state of California has been moving for many years. It's something that is inevitable because we can't continue to use materials that aren't recyclable or compostable. We need to get these materials.'",
        "'speaker_2': 'From renewable sources.'",
        "'speaker_1': 'And have them be able to be recycled into the economy. Otherwise, we're creating environmental harm and doing damage to the economy in the long term. So I urge you to take action tonight. If we fail to take action, it just means that much more.'",
        "'speaker_2': 'Material.'",
        "'speaker_1': 'Will continue to be polluting our beaches, harming our tourism and our businesses. And so I urge you to vote yes on this draft proposal. Thank you. Thank you. Next speaker, please. Good evening, Honorable Vice Mayor and Council. My name is Connor Locke.'",
        "'speaker_1': 'I'm a third district resident. I studied economic policy at Georgetown University and in Munich and Germany. I'll tell you from firsthand experience in Washington, D.C., where I think they consume more coffee cups and more takeout food than anywhere else in the world.'",
        "'speaker_1': 'They use compostable paper products. These work they work for hot sandwiches, they work for salads, they work for hot and cold food. I can carry them in a blizzard on the metro to a Verizon center. It's the cap center game.'",
        "'speaker_1': 'Now, I can carry these around with me as a student. I can carry them to my internship on Capitol Hill and back in Germany. It's not even a question. This is 80 million people in the entire country of Germany have been doing this for 60 years.'",
        "'speaker_1': 'They recycle even more than us and they ban products that are detrimental to their people, to their wildlife and to their environment. What you have before you tonight is a beautifully compromise driven proposal by staff that apparently took like nine years to build, which means that it's been on their docket for longer than all of you have'",
        "'speaker_1': 'been here, except maybe the Andrus for its longevity. It's it's been community sourced. It's been put before business, it's been put before environmental advocates, and it's been put before people who are now really quite old. And it started when I was 13 years old.'",
        "'speaker_1': 'Sorry, 15 years old. I can do math. It's something that's very crucial that you pass. You want to build a society that you want your kids to live in. Many of you have young children. I'm looking to have young children in the near future here in Long Beach.'",
        "'speaker_1': 'I don't want them to go down to the beach in the third district, down to the peninsula beach where I go on a morning run and see these tiny little bits of Styrofoam and plastic forks and bits of sharp, spiky things digging into their feet.'",
        "'speaker_1': 'I don't like New Puppy to be eating this stuff when I'm out for a walk and I start paying attention for half a second. And I know you don't want that either. So yes, we have very valid concerns by the restaurant workers and organizations.'",
        "'speaker_1': 'Their cost will increase somewhat, but we have mitigation aspects not only for employment, but within this proposal. So please trust your staff. They're paid to serve the constituents and the businesses. Thank you. Thank you. And our final speaker.'",
        "'speaker_1': 'Thank you for being so patient. Waiting in line behind closes out. Good evening, Mr. Vice Mayor and Council Members. My name is Craig Cadwallader and I'm speaking on behalf of the Surfrider Foundation South Bay chapter. And I'd like to just go through a few points that were brought up earlier.'",
        "'speaker_1': 'First of all, the problem with polystyrene is not just on the beach or in the oceans. It's in our parks, it's in our neighborhoods, it's everywhere. So we it covers everybody and we'd like to see it removed, expanded.'",
        "'speaker_1': 'Polystyrene is a unique product. We heard some testimony about it being replaced with another product. Well, no other product breaks into the small pieces like expanded polystyrene does. So in my opinion, I consider that a defective product. And because of that nature, we spend a lot of money trying to clean that up.'",
        "'speaker_1': 'That money, that money for that cleanup comes from taxes. So some of these people are working so hard, like I do, are paying extra money in taxes to clean up the mess that is coming from the polystyrene. There's a lot of misinformation about the cost of the replacements.'",
        "'speaker_1': 'In some cases, the costs are less. And so we've had a lot of misinformation. And I can tell you that we have studied, tried to find a business that has been impacted. The city of San Francisco failed to hardship clauses.'",
        "'speaker_1': 'They actually worked it out with the businesses and they were withdrawn. We can find no examples of a hardship. And last of all, it's it's really a leadership thing I would like you to consider and a pardon request clause, which just requires putting utensils and straws in carry out things when the customer asks.'",
        "'speaker_1': 'This could save enough money for the businesses to offset and because they put things in the bags that people don't want. So thank you. Hope you're thinking. Thank you. And that concludes public comment. So now we'll take the discussion back behind the wheel.'",
        "'speaker_1': 'Councilwoman Gonzales.'",
        "'speaker_4': 'Thank you, everybody, for being here. I know it's been a little bit of a long night, but a lot of us have been here for many other things much longer. So I really appreciate it, though, on various different sides.'",
        "'speaker_4': 'So I appreciate the hard work of the research and of course, all of the discussion tonight. I would first like to thank our city staff because I do agree as well. Both Craig and DeKoe and the Environmental Services Team have worked with my office, you know, very closely to make sure that we understand it and we're getting'",
        "'speaker_4': 'it right and providing the best education to both businesses and our advocates. So I want to thank you for this work over the last almost a year in getting this to where it is now. And I'd also like to thank quite a few other people, because they have done all of this work for many decades.'",
        "'speaker_4': 'So when we talk about studying this, this they have done this beyond any of us here on the council. So the support from the last three days, wetlands alga algal aida research marine institute, of course. Captain Charles Moore, we thank you so much.'",
        "'speaker_4': 'I have your book in my house, surfrider, sierra Club, Cal State, Long Beach Environmental Club, The Don't Waste Coalition. We Are the Next. Long Beach 350 Heal the Bay Rubber Band Arrangements Californians Against Waste, Long Beach Environmental Alliance, the Green Education Inc, Los Angeles Waterkeeper and many ocean friendly residents.'",
        "'speaker_4': 'I'm sorry, ocean friendly? Yes. Residents and restaurants who are participating in this. So I really appreciate all of their work. Let's give them a big round of applause. So as many of you heard I mean, we've heard the statistics.'",
        "'speaker_4': 'Of course, the EPA has stated that less than 2% of Styrofoam is successfully recycled. There's no lucrative market out there that will actually recycle this. And, of course, it's not biodegradable in any of our lifetimes. You know, you have two paper products versus one Styrofoam product.'",
        "'speaker_4': 'The two paper products will biodegrade in 40 years. The Styrofoam products not going to biodegrade until 500 years. So neither are any of our lifetimes here, sitting here in this audience, it will happen. And we've also seen many statistics originating around the composition of this.'",
        "'speaker_4': 'So we've seen that the California Coastal Commission actually commissioned a study in 2011 with the Clean Water Action Plan that showed that Northern California, where bans were being proposed, basically has a litter composition of 60% originating from local restaurants, primarily forms of polystyrene.'",
        "'speaker_4': 'So this isn't an attack against business, small business. In fact, we want to be your friends in this process. We understand that there's a lot of burdens of small business owners. And I think this is our opportunity to work with you, not against you.'",
        "'speaker_4': 'And with that audit, it actually showed that in San Francisco there was a 44% reduction in polystyrene on the streets after the ban. They enacted theirs in 2010. So we have some work to do, in my opinion. And our own local research firm, as we've heard, Goleta Marine Research, did a local research study with Cal State Long'",
        "'speaker_4': 'Beach students. We have it all here. And their results found that one in every four pieces of litter on the streets of Long Beach was expended. Polystyrene and about 4 million pieces of polystyrene were actually found in December 2015 during a beach cleanup from the pier to the end of the peninsula, which is less than two miles'",
        "'speaker_4': 'of beach. That's incredible. And it's true. It's costing not just our business owners who I know many of you care about litter as well. It's a blight. It's not just we're not charging the business owners. It's a taxpayer issue, too.'",
        "'speaker_4': 'Right. Both residents and businesses that have to recoup these costs day in and day out from cleaning this issue are clean. Just all of the cleanups that I attend and my office attends on a monthly basis, we about 20 community organizations, and we are participating in cleanups every single basically every weekend to ensure that our streets are'",
        "'speaker_4': 'cleaned. And I believe it's worth reiterating that we need to take an action tonight to move this city forward with this expanded polystyrene and rigid polystyrene ban. And let's not forget, I know I did a PowerPoint the last time we were here, but this topic has actually been before the city council on ten separate occasions over the'",
        "'speaker_4': 'past 12 years, starting back in 2005. So we've seen this, we've heard it. It's been discussed. Former councils actually recommended this. Former city managers actually recommended this. And then we ended up banning plastic bags. And we ended up also supporting resolutions at the state level as well.'",
        "'speaker_4': 'And over the course of the past ten months, in addition to the five publicly notice meetings regarding this topic, my chief and my chief of staff, Corey, who I have to think because he's been everywhere with everyone talking to all of our business improvement districts in addition to myself, every single business improvement district, Bixby Knowles, Naples Island'",
        "'speaker_4': ', the Council of Business Associations to include downtown uptown Bixby Knolls, again East Anaheim Business Association, the West Siders. Everyone got a presentation from my office personally and with the number of businesses that were said that they were in opposition by DART.'",
        "'speaker_4': 'We contacted them and I speak two languages so I was able to speak my office was able to speak with them in Spanish and we were able to educate them on what this this policy was actually able to do, not, again, to work against them, but to work with them.'",
        "'speaker_4': 'And in this we know we noticed that a lot of them didn't even realize that there was a phased approach. There's 15 months that we have to implement businesses, small businesses. There will be workshops that will be set up.'",
        "'speaker_4': 'There will be a hotline, and many have rescinded their opposition after hearing this. In addition, there will be a cooperative purchasing vehicle, and I keep bringing this up because I actually work as a technology consultant for one of the largest corporations in the world.'",
        "'speaker_4': 'And I work to get small businesses excuse me, have a little bit of a called small businesses to cooperative purchasing agreements. And in this case, we actually have one called the Green Town, Los Altos. And they are a cooperative purchasing program where a lot of small business.'",
        "'speaker_4': 'Just like yourselves, are able to pull their resources and lower their costs by 25%. So it can be done. In many cases, the alternative products that you could use could be cost neutral. They can cost a penny. Every business has a little bit different of a business model.'",
        "'speaker_4': 'But we want to make sure something works right for that specific business, and we'll do everything that we can. I know our environmental services group here are their bureau is absolutely committed to making sure that we get this right for business and related to recyclability, Sedona recycles actually did a study to truly determine the value of recycling'",
        "'speaker_4': 'polystyrene and came up with this report. Talk about a lot of labor costs in energy and time. The pallet took over one month to prepare and with all of the labor and staff time required to prepare, clean and build the pallet, it ended up being a net loss of over $700 per pallet just to recycle polystyrene.'",
        "'speaker_4': 'And of course, we know that the behaviors are not in place. So it's a little bit more difficult because of of this. And so, therefore, we lack a lot of recycling and sourcing. And additionally, the city of Long Beach, we're already studying a variety of innovative ways to increase recycling.'",
        "'speaker_4': 'We have our Litter Free Long Beach program that was implemented back in 2006 because of the similar discussion we had years ago. And we are looking to reduce waste with the zero waste five year notice and which calls for a study around issues of recycling as well.'",
        "'speaker_4': 'And this summer, the mayor presented an update to the clean Long Beach plan. It's an initiative where we will be cleaning up a lot of our business corridors, and many of you have seen that. And in that, I actually asked for a litter audit to ensure that we are looking at that coincided with what we're doing here'",
        "'speaker_4': 'today. And overall, we know that the behaviors are not in place inherently to recycle polystyrene. It's labor intensive, it increased costs and there's no lucrative market. There are people are not purchasing this up and saying that this is a a good reusable item because, again, it doesn't it doesn't biodegrade.'",
        "'speaker_4': 'And if it did and if it was lucrative, retailers would be doing it now. And let's be clear, the cost to local business to shift over to non polystyrene is pretty minimal. As I mentioned, in many cases it can be a lower cost or cost neutral and we have taken great strides to be a business friendly city'",
        "'speaker_4': 'and work hard to make sure that the policies we implement, support and guide our local businesses versus become a detriment. So other cities have actually had a hard deadline, were phasing this in and in addition in about as May actually I'm sorry, as of May of this year, the Clean Water Action Organization did a price comparison and'",
        "'speaker_4': 'it includes in the packet in the packet that I provided, it shows the real costs for this ban. In eight of the 11 categories, the straight line projection is either cost neutral or cheap, cheaper to polystyrene, and when you average them all together, the average cost again is less than one penny.'",
        "'speaker_4': 'And all manufacturers currently of polystyrene polystyrene currently have alternative products. So instead of asking us as a city to stick with something that is not biodegradable, I ask those large manufacturers to really look and start diversifying your portfolio to see what else is available and offer those to our small businesses.'",
        "'speaker_4': 'You have the opportunity to lower the costs in many cases. And so as many of our small businesses and I have many of them in the in the first district downtown, we have one called Crest Market who has used polystyrene non polystyrene products for many years.'",
        "'speaker_4': 'There are Latino owned business from Acapulco. They have weathered the storm. Like many of you, they were in the recession and from day one they were using a non polystyrene product because that was their mission and their business model.'",
        "'speaker_4': 'Was it difficult? Sure. And now that there's opportunities in place to help them, I see them being a mentor to many of your businesses, especially the Latino owned businesses that can benefit from this. So overall, I would say I we have enough studies, we have a litter audit, we have the don't waste study.'",
        "'speaker_4': 'We have our Goleta study. Many of the study, the decades of research that is sitting here, and we have over 120 cities that have implemented this ban. We also, as a city council, a few months back, we supported SB 705.'",
        "'speaker_4': 'Unfortunately, it didn't hit the governor's desk, so it didn't make it. But we unanimously supported that, which basically stated that a plan for waste diversion by 2040 is to reduce landfills by 75%. And it would in order to do that, SB 705 asked for a statewide ban.'",
        "'speaker_4': 'And so although we supported it unanimously, like I said, it didn't hit the. The governor's desk. But I think that spoke volumes to what the city is able to do. So again, I'll just say that we're offering 15 months.'",
        "'speaker_4': 'We're offering small businesses a cooperative purchasing option for discounts. We're offering educational workshops, undue hardship waivers. So if any businesses feel that they cannot weather this policy, then will absolutely help them. And overall, the state hasn't made a decision.'",
        "'speaker_4': 'The county, they're unincorporated. They only take care of unincorporated areas. They haven't made a decision. So when is it time for the city of Long Beach to make a decision? In my opinion, the decision is now. So I hope my council colleagues will will vote in favor of the staff recommendation.'",
        "'speaker_4': 'They did a lot of hard work. And our residents and businesses, I know will will benefit from this. So thank you very much.'",
        "'speaker_1': 'Thank you. Councilmember Pierce.'",
        "'speaker_0': 'I want to thank my colleague, Councilmember Gonzales, for bringing this item forward, for leading on this item and really doing a lot of research and spending a lot of time to make sure that she had the facts right.'",
        "'speaker_0': 'I know that this is like other items this council has been hearing lately tends to be divisive. And I have five pages of talking points similar to what many of you guys have talked about. What are the numbers?'",
        "'speaker_0': 'Right. What are the facts that we know about? Can polystyrene be recycled? Can it not be? What does it take to wash it? How much does it fill landfills? But I want to address just momentarily the fact that these conversations are often based on fear and business being scared that something that we're going to do is going'",
        "'speaker_0': 'to have a negative impact on them. And we have a lot of these policies that we come across where we have that fear. And then we look back five years and we look back ten years down the road and we see that we've been able to adjust.'",
        "'speaker_0': 'We see that it might be a penny or two pennies added on to my meal, which I'm okay with. When we first brought this item forward. We had Retro Row businesses in my district come out and all of those restaurants and the Retro Row area and some beyond that came out and spoke in support of this.'",
        "'speaker_0': 'There are businesses like Holy Moly, who are small businesses that used to use polystyrene for every single plate, whether you ate in or out. And now they no longer use that. Now they use something that is biodegradable. And so it breaks my heart to see that sometimes we use fear to get some big business, some dollars, or'",
        "'speaker_0': 'to get some people that rally big business, some dollars against what this council has time and time again that they care about with, which is health equity. So whether we're talking about the fork that's broken in the beach where our kids are walking or our dogs might ingest it.'",
        "'speaker_0': 'This is an issue about health equity. We know that these products have carcinogens in them and we have an ability to limit that exposure. Well, we limit it across the board, whether it's in some food products or not.'",
        "'speaker_0': 'No. But we have an ability and we have a duty as council to protect our residents and to make sure that we're leading by example. And leading to me means stepping over that fear and knowing that we've done our best.'",
        "'speaker_0': 'And nine years is a long time. Nine years of kicking the can down the road has kicked that can, which I forget what even cans. Even if you don't recycle cans, they last forever, let me tell you. Well, my daughter and I went on a hike and we went to the nature center and they had products of'",
        "'speaker_0': 'everything that we use with the years that it takes for it to degrade. And it's it's shocking, you know. And so if this is one area where we can do a little dent and it might take a penny more, even though we have studies that show that the cost reduction is is not that much, I think we'",
        "'speaker_0': 'absolutely have to do that. I think that the council and the staff has spent so much time on this that now we're spending so much money where we could be saving the taxpayers a lot of money by not revisiting this item again and going forward with the plan that we've worked really hard on.'",
        "'speaker_0': 'I have two questions for staff. One of the things I've talked a lot about in my district and with residents is we love the big belly trash cans. We have put those along our our tidelands area. It's one of the areas that I would love to see them at every single bus stop.'",
        "'speaker_0': 'And I mention this because I know that I did meet with Dart several months ago and we had the conversation around, Well, can't we just divert trash? You know, instead of banning something, let's just make sure we have places to divert it.'",
        "'speaker_0': 'Putting it in big belly trash cans is one of those areas because that the wind doesn't blow them or anything like that, but they are extremely expensive. So I just wanted to hear from staff if there was any plan to do a a master plan for big belly trash cans, maybe in business corridors or by our transit'",
        "'speaker_10': '. Councilmember Pearce, thank you for the question. It is true that many of the business corridors have looked to install big belly trash cans. Certainly down in Belmont Shore, most recently in the fourth, on fourth Street, the fourth Street business district.'",
        "'speaker_10': 'The cost for a big belly when we purchased them for Fourth Street was roughly 40 $500 a piece. As you know there, they require a manual service. So while they do have a compacting system in them, which means the frequency of of disposing of the waste is is longer, you don't necessarily have to do it every day'",
        "'speaker_10': '. Sometimes it can be weekly. It just depends on the use of the facility, the cost of the labor to clear those those receptacles and the upfront cost to purchase them really kind of make them prohibitive at this time for that kind of an investment.'",
        "'speaker_10': 'Plus, the the battery for the solar versions, many of them have a solar option to them for the compacting unit. Those batteries need to be replaced currently and in about a 4 to 5 year cycle. So we look at that as a significant investment.'",
        "'speaker_10': 'What we would like to share with council this evening is staff is looking at adding additional recycling receptacles at our bus shelters. We're working currently with Long Beach Transit, so there's roughly 500 bus shelters across the city. This the city's responsible for some of those shelters and Miami Transit's responsible for some of those shelters.'",
        "'speaker_10': 'And we're trying to come together in a in a cohesive effort to address both the cleanliness of the bus shelters, the collection, and then recycling opportunities at those locations.'",
        "'speaker_0': 'Thank you so much for that report. I think my point is that I want to continue to work towards a place where we can in our corridors and with transit. That's great to hear that we're doing that, but we know that's not enough.'",
        "'speaker_0': 'We have to be able to ban the worst products. And I think that this plan does that in a way that is quickly, quick enough. And I think 15 months. You don't see other cities that have banned products like this doing a phased in approach or saying, here's a here's a hardship for businesses if they need to'",
        "'speaker_0': 'come to us. I want any business owners that are here to also know that we've done a lot as a council to support you, and we will continue to support you. And I would not vote on something that would that would minimize your guys business.'",
        "'speaker_0': 'Right. Folks are going to be able to take care of this and pay a penny or two extra. And we're going to be able to save our kids. And health equity is something that we care about deeply. So I think that we should do this now.'",
        "'speaker_0': 'I think the work has been done. And I want to congratulate again all the community members that are out there that are volunteers every single month at those cleanups and really put their heart in doing that work. So I hope our colleagues will understand that 99 years is long enough and the phased approach is the right approach'",
        "'speaker_0': '. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. No.'",
        "'speaker_0': 'I want to thank everyone who's taken my call over the last several weeks more closely in the last week. I know we have a controversial item at council almost every week. So a lot of you get a lot of calls on Wednesday about the following Tuesday about what we're talking about.'",
        "'speaker_0': 'So if you have something next week, you'll know to get a call starting tomorrow. These are complex issues and we talk a lot about the different opportunities to improve the quality of the water in Long Beach and to get rid of the trash.'",
        "'speaker_0': 'And what we've heard tonight is that polystyrene is recyclable. And when I read some of the studies referenced, when we eliminate polystyrene, we replace it with another product that is also recyclable or sometimes one that's not. And I appreciate the conversation I had yesterday about, well, we want to take a cup that was X amount of grams'",
        "'speaker_0': 'and replace it with a cup that may not be recyclable because it's paper on the outside and plastic on the inside, but that paper over time will eventually degrade in the ocean because it is being subjected to the water and so on and so forth.'",
        "'speaker_0': 'But at the end of the day, what I really want to see is us attacking the really hard issue of what is causing the complete litter problem. Litters one. I get that the big belly trash cans can be a support of eliminating the litter.'",
        "'speaker_0': 'And on top of that, we need to discuss that in some of the studies that I've discussed with some of you that in year one, we don't see a huge impact. And even in year two, we still see a huge replacement of the original litter from Styrofoam to plastic.'",
        "'speaker_0': 'And so we need to attack the whole issue. I have some ideas on that. I want to hear from my colleagues before making any friendly amendments, but I believe we should explore a public private partnership that includes big belly trash cans, like Councilmember Pearce said, both on the.'",
        "'speaker_0': 'Business corridors, the beaches and the parks. I also would like to see the definition of the businesses at each different size level adjusted. I know we have three main sizes of business, the small that are outlined in the current ban.'",
        "'speaker_0': 'The medium size which is the 60 and then the large. I really would like our phased approach to start with large and then us to do a study to see that impact. I recognize that it happens over time, but I feel that the more important thing that I see when I'm collecting trash at a beach clean up'",
        "'speaker_0': 'is the tiny little dots that come from the products that are at retail. So in our community the other day in an alley, I see a beanbag chair and a beanbag chair with a knife like a slit in it that's filled with billions of little beads that are running into our alleys.'",
        "'speaker_0': 'I'd like to see us replace phase three with a ban on selling those Styrofoam coolers, selling the beanbag chairs. And there was another item I have discussed with some of you that we feel is pretty important. You just ordered beanbag chairs.'",
        "'speaker_0': 'I hope they don't have polystyrene in them. And the polystyrene beads that you can buy at the store for crafts, those you can just literally go to the store right now and buy five gallon bags of the actual little beads that everyone's concerned about.'",
        "'speaker_0': 'And so when I go online and I see Joanne's fabrics on Palo Verde Avenue has those available for sale. That concerns me because those are the actual little dots that we're talking about and they're not even addressed in the.'",
        "'speaker_0': 'So I'd like to come to an agreement where we phase in some of those other options. So I'll listen to hear from my colleagues on what they want. I think that the work that each and every business owner does is important.'",
        "'speaker_0': 'I recognize in talking with some of my businesses that it's inconvenient for them or they don't have the credit to be purchasing some of the stuff in the large volumes. And as much as it pains me to hear that they drive outside of the city borders to go to a Costco or a smart and final to buy'",
        "'speaker_0': 'these polystyrene containers, I don't see that forcing them to buy something that doesn't meet their consumer needs is going to help. Because in my experience, people who take those home, they eat out of them and then they throw them in their trash can and then they tie a knot on that trash can and they put it in'",
        "'speaker_0': 'their trash bin and it goes to the incinerator in Long Beach. And so looking to find where that middle ground is and this is a complicated problem of litter versus recycling versus all of that. So I have something prepared as a possible bring everyone together on both sides that I've worked on while all of you spoke.'",
        "'speaker_0': 'And I tried to include as much of what you said in it. But I'll I'll listen to my colleagues first and see where we can end up.'",
        "'speaker_1': 'Thank you, Councilmember Yolanda. Thank you, ma'am. I, too, want to extend my gratitude to Councilmember Gonzalez for bringing up the issue. Her presentation was awesome. It covered all aspects of what we're dealing with here. She talked about the economics and the cost of polystyrene, the social implications, the environmental effects and the health effects.'",
        "'speaker_1': 'She touched it all, so there's not much to say in terms of those areas. I do have some statistics, but I'm not going to throw them out there. I think we've heard enough for the night, not only from behind the rail, but from the audience.'",
        "'speaker_1': 'And I, too, want to thank you from both sides of this issue for coming out here tonight, because that's how we learn. We learn from you when you voice your concerns and you express your ideas, we learn from that and we listen.'",
        "'speaker_1': 'And some of the things that come out of here are those that we've adopted from you. So I want to thank you for being here, especially at a late hour, when you've probably missed your dinner like like we did.'",
        "'speaker_1': 'But does it matter? That's our job. I also want you to reflect on the fact that Long Beach is uniquely situated. We're at the mouth of two rivers, the San Gabriel River and the L.A. River. A lot of trash comes into Long Beach through those two rivers.'",
        "'speaker_1': 'And we're a big city. So we have people who come to visit the beach to enjoy its sights and maybe perhaps a nice sunny day out there. So the little that we get is not only our own, it's from from up north, from other cities north of us.'",
        "'speaker_1': 'So this issue of polystyrene in not only our beaches but in our rivers is a very serious issue for us. And we really need to look at what we can do to impact to to impact that very issue of litter in Long Beach.'",
        "'speaker_1': 'And we can do our small part and our small part is to. Clean it up. If it takes a man, it takes a man. But I think more importantly, we need to look at other ways of getting our food from a restaurant by market, from a a food truck to a home to store it and then have'",
        "'speaker_1': 'it eat it, eat it, finish it to say eat it again if you eat it once again. So it's one of those complex issues that we have. What we're looking at, do we recycle or do we throw away?'",
        "'speaker_1': 'Do we take it to serve, which is our recycling plant out there? Great energy? Or do we take our own plates and containers made out of glass or other kind of a compost? That would be a better a better use and a better way of preserving our food.'",
        "'speaker_1': 'So what you're saying is that's most important here tonight is that only how do we deal with this issue of polystyrene? But what effect is it going to have on the businesses that use polystyrene? There's been a concern expressed.'",
        "'speaker_1': 'We've we've heard testimony from some of the workers who work at some of the restaurants and how they use that polystyrene and how important it is to their business. So I'm also looking at maybe make it our friendly in terms of how we can better impact businesses and minimize the impact that it's going to have on them'",
        "'speaker_1': '. Should we vote to a to impose a ban on polystyrene in Long Beach? I'm also a member of the Coastal Commission, as was mentioned, and I had a had meetings last week in San Diego and then we passed the resolution that in November we will we're going to adopt a no Straus month for November.'",
        "'speaker_1': 'So of course, the Commission is very much aware of the impact that even straws, its one little straw can have on our environment. You know, we have to consider that every piece of trash that we throw sometimes well that sometimes in many ways reaches the beach and the impact that it has in our beach environments are huge'",
        "'speaker_1': '. So we're trying to affect that at least one little straw at a time and hopefully that it'll make a difference in litter. I also sit on the River Simmons Conservancy, which through my district a river runs through it, the L.A. River.'",
        "'speaker_1': 'We have river cleanups. And one of the most common pieces of debris and trash that we pick up is polystyrene. So this is a huge issue. It's very it's very impactful not only to our rivers, streams and our beaches, but to our cities.'",
        "'speaker_1': 'So I hope that when we finish this discussion tonight that we could come up with a plan that would be workable and amenable to everybody, that will make a difference and will have an effect to essentially deal with our trash, deal with that litter, and be able to address the the the issues of health and safety and'",
        "'speaker_1': 'clean up our environment. Thank you. Thank you, Councilman Price.'",
        "'speaker_6': 'Thank you very much. I, too, want to thank everyone for being out here tonight. The residents, the businesses, the advocacy groups. I really appreciate you being here tonight. And as I shared with Councilman Gonzalez this morning and I have in the past, I think this is a fantastic item.'",
        "'speaker_6': 'I represent much of the coast. And I agree that this is a step, definitely a step in the right direction. I do think that this is a bigger conversation that we should be having with other entities within the region as well, not in lieu of the discussion we're having tonight, but we need to be talking with Orange'",
        "'speaker_6': 'County. We need to be talking with L.A. County, where the recipient of a lot of garbage that comes from other cities. And we need to be having that discussion. I also want to talk with city staff about the recycling some some of the comments that were made about recycling and how we might be able to better optimize'",
        "'speaker_6': 'efficiencies in regards to recycling. Our is our public works team able to address that or talk about that a lot. I know we heard from one of the companies, Titus or Titan. I don't remember the company, but somebody spoke about different things that other jurisdictions are doing in terms of recycling.'",
        "'speaker_1': 'Councilwoman Price, thank you for asking the question. In our current curbside program, we accept clean polystyrene that's generally packaging like you see if you see your stereo component package. We do not we do not take soiled food polystyrene, which is really what's being identified here in this particular program with regard to the recyclability of polystyrene, it's it's'",
        "'speaker_1': 'there's a lot of different opinions out there. We do have a couple of facilities locally where we heard some speakers that they do do some recycling of expanded polystyrene. And yeah, my guess would be that it's clean polystyrene is my guess on that.'",
        "'speaker_6': 'Okay. So, so there may be some opportunities for, for us to maximize our efficiency, but not to such a degree that it would probably make an impact that would be measurable.'",
        "'speaker_1': 'If I understand you correctly. Yes, I agree with that.'",
        "'speaker_2': 'Okay.'",
        "'speaker_6': 'So my concern from the outset of all of this is and I and I've heard from a lot of residents, but but specifically, I've had a lot of meetings, one on one with small businesses in my district. And I've talked with owners who are very concerned about the impact that this is going to have on their business'",
        "'speaker_6': 'operations. And I fully understand the argument of saying to people who say, I have a fear that their fear is unfounded. It's not the first time this council has been asked to tell people who have a fear that their fear is unfounded.'",
        "'speaker_6': 'We had issues, for example, with the airport where people said this If you vote on this, it's going to impact our lives. And advocates would say, no, it's not. That fear is unfounded. But the fear that people have or that entities have is real.'",
        "'speaker_6': 'And I think we have a responsibility to try to do our very best to work with those communities to alleviate that fear. And I'm very grateful that the program that is presented in the staff report and staff should be commended.'",
        "'speaker_6': 'The staff report was excellent. I thought you did a very thorough job and I thought it was very balanced. And most of it I agree with, but the phase three that's listed in there for small businesses. First of all, I'd like to hear a little bit more from my colleagues regarding what the definition of the small businesses'",
        "'speaker_6': 'would be. But I have a an issue with phase three, and that phase three specifically affects the small establishments. And so I'd like to offer a friendly at this time regarding our small business establishments. And that friendly would be that we implement phase one and phase two of the plan.'",
        "'speaker_6': 'But that as two small business establishments, we do not implement anything until we have after a year of implementation of the ban. As to phase one and two.'",
        "'speaker_0': 'We author issue a report.'",
        "'speaker_6': 'That is done on the impacts of the ban on the city. And at that point, if council finds that there is a measurable benefit, then we roll out an implementation plan for the business community and do it in the 15 months that's outlined in the staff report.'",
        "'speaker_6': 'So basically what it says is let's let's start with this ban right away. Let's start with phase one and phase two. When we get to phase three as it relates to small businesses, let's take get a report from an independent objective analyst to talk to us about the measurable results of the ban.'",
        "'speaker_6': 'And if there is a measurable benefit, then we roll out the small business incentive package and the implementation plan, which is 15 months. So that's my friendly.'",
        "'speaker_1': 'Thank you. So that was a proposed friendly amendment is accepted.'",
        "'speaker_4': 'Response. I would still like to hear more, but I at this time, I don't want to accept that. I think what the staff recommended was very fair. And again, I think we have a lot of studies and with all due respect, Council Member Price.'",
        "'speaker_4': 'I think our our advocates have studied enough. This is again to be in partnership with our businesses and I think we're going to give them a lot of guidance along the way. So I'd love to hear more, but at this time I do not want to accept the friendly amendment.'",
        "'speaker_1': 'Thank you. Councilwoman Price, continue the discussion.'",
        "'speaker_6': 'Now, that was my my my one offer to try to move this forward. So thank you.'",
        "'speaker_1': 'Thank you. Councilman Andrews? Yes. Thank you, Mayor. First of all, I'd like to acknowledge my colleagues for, you know, bringing this item forward. But I do have some reservations about this. I would like the audience to really think about what this ban means if it is passed.'",
        "'speaker_1': 'Are we really enhancing our city sustainability? Let's compare two cups. This is my take. Mine here by rail, two and the other. There you go. A Starbucks cup. It's a plastic coated paper that is likely to go to a landfill because it's hard to recycle.'",
        "'speaker_1': 'Most restaurants use cups made of form number six, which can be recycled into other food products. If this item passes and we've been.'",
        "'speaker_2': 'Recycling.'",
        "'speaker_1': 'Material. I think it's important that we consider other ways to protect the environment. Is this item benefited the part of the vice mayor proposal? Five years notice for commercial Hurley and I truly appreciate having this dialog, but perhaps a ban isn't the solution.'",
        "'speaker_1': 'Maybe it is time that we look at a way, another way to change our consumer behavior. Because I would really like the make of this motion to really come to a situation where we can kind of come together and let everyone realize that we can get this put in a situation where we all can come to a'",
        "'speaker_1': 'more, I think, substantial solution. And I'd like to hear more, too, but this is what I would really hope that we can come to, that everybody can kind of go at this having a feeling that we did try to do our best in making everyone know we can't make everyone happy, but at least let you know that'",
        "'speaker_1': 'we are concerned about your concerns. Thank you very much. Thank you. Councilman. Next, this councilmember sabrina. Thank you. I'd like to thank all the folks who attended tonight and for putting in these 3 hours so far. I'd also like to thank the Sustainable City Commission has a special place in my heart as a charter member of that'",
        "'speaker_1': 'commission served two terms as chair. I'm sorry that all of your items you forwarded to council don't appear here tonight, but I think it was a great effort that the Commission made. I'd also like to thank the vice chair of that commission for speaking here tonight, and she referenced the division here tonight.'",
        "'speaker_1': 'And in my view, this is far too great a division than we should have at this stage of the game. And I think that's our fault. I think that's a direct result of the lack of outreach on this and the lack of stakeholder input.'",
        "'speaker_1': 'Had we gone through a more robust process, maybe we wouldn't be in this situation tonight. Six months ago, I sent a memo to staff because there was a question about including the school district and whether or not Pasadena had included their school district.'",
        "'speaker_1': 'And in my research, I found that Pasadena, when they were talking about their ban, they had a stakeholder group that met for months, and there were a dozen members of that stakeholder group, including the Pasadena Health Department. And when you think of that, that makes all the sense in the world.'",
        "'speaker_1': 'We're talking about food containers, and there's very few cities in California that have health departments. Pasadena is one, Long Beach is another. And to my knowledge, they weren't part of this process. Going back to I'll just shift gears to our environmental committee.'",
        "'speaker_1': 'I chair that group and the members are Vice Mayor Richardson and Councilwoman Pierce, and we had specific guidelines that we forwarded. So I'd like to ask staff about that. One of the questions I asked, because we'd heard so much hearsay about Titus recycling, we'd asked for an assessment of that.'",
        "'speaker_1': 'Can staff tell me if that ever was brought forward?'",
        "'speaker_10': 'Councilmember Supernova. The presentation that was made to the Environmental Committee and what was adopted was staff's recommendation of forward it to council. I don't remember. Call a specific request to go beyond forwarding the recommendation at council.'",
        "'speaker_1': 'Okay. So just just for clarification, that reference came from several bullet points that we listed that that our committee wanted brought forward. And we actually mentioned them by name. And we were. The the direct transcript reads as public works to see that Titus does or doesn't do exactly what is being proposed as opposed to hearsay evidence.'",
        "'speaker_1': 'So this is the type of thing that that we just didn't get answered. So here we have the CEO of Titus here again tonight making claims. And we just don't know what can be done by this recycler. And my point is says whether or not you believe in recycling Styrofoam, the folks here in this audience deserve an'",
        "'speaker_1': 'answer on that is what are the facts? And then just a couple of questions along those lines. That's kind of been brought up a little bit by my colleagues. We're asking for a replacement products here, so I would just ask staff to weigh in that, you know, we know that polystyrene is hard to recycle.'",
        "'speaker_1': 'That's but it's been testified to it's got to be clean, free of food residue. What about the other containers? Is food contamination an issue for the substitute products that are being recycled? And will we be able to recycle those?'",
        "'speaker_1': 'Council member. Supervisor. Thank you. Certain plastic materials are more easily recyclable than others. Plastics one and two tend to be the more recyclable materials. Okay. And then we heard a lot about there's no second market for polystyrene. You know, we happened to attend a surf meeting tonight.'",
        "'speaker_1': 'That's not the issue. RF time. That's about the facility we have down on the port and we have an annual meeting and they mentioned that plastic is not being taken by China anymore. How does that affect our overall recycling program and how will that affect the possibly the substitute products or straws or whatever we might have?'",
        "'speaker_1': 'Have we done an assessment of that? Thank you for that question. Council Member Super. And I, in fact, a couple of weeks ago I was in Sacramento on this discussion, came up with the head of calories cycles. This is not just a Long Beach issue.'",
        "'speaker_1': 'This is not just a California issue. Frankly, it's a it's a countrywide issue. And the industry is is just now starting to try and figure out how to how to deal with this issue. We're working with our recycling contractor and the material recovery facility, and we're trying to study and figure out how we can go forward in'",
        "'speaker_1': 'the future on this. But as of the beginning of 2018, China has said that they will no longer be accepting certain materials to be delivered from other countries, including the US. Okay, thank you for that. I just wanted to follow up on the friendly proposal by Councilwoman Price.'",
        "'speaker_1': 'Do we have a definition of small companies like 100 employees or what what constitutes a smaller establishment?'",
        "'speaker_10': 'So the presentation that staff is recommending is that small would be designated as 30 employees or less. And that follows the city's business license. 30 seats? I'm sorry, 30 seats in a restaurant which follows the city's business license definition.'",
        "'speaker_10': 'So if you qualify as a small business for business license purposes, it would be the same for the ban that we're proposing this evening.'",
        "'speaker_1': 'Okay. So we might have to massage that into place for an establishment that is 70% of their business through the drive thru that we might have to look at that matter moving forward. So I'd ask staff to examine that, provided any form of that friendly is accepted.'",
        "'speaker_1': 'Okay. Well, I'd like to hear my colleagues on their motions. Thank you. Thank you. Councilmember Pearce.'",
        "'speaker_0': 'I yes, I'm one to address just the one issue around whether the items are recyclable or not. Something that I didn't mention earlier. I met with Atco a while back and they talked about how some of these products are recyclable, but they also talked about the process they have to go through and something that Councilmember Gonzalez mentioned'",
        "'speaker_0': 'in the cost associated with that and the fact that it cost more to recycle them than it does not to have them. So I just want us to be clear that we're the recycle conversation isn't one that's going to save our beaches or our community from that issue.'",
        "'speaker_0': 'I also wanted to reference the comment that was made by one of the speakers around making straws and utensils available upon request. And I think that one of the comments was around how much money it might be able to save the business if we do that and make it upon request might help offset some of the costs'",
        "'speaker_0': 'there. So I'd like to ask my colleague if that is a friendly that she might be willing to make to accept.'",
        "'speaker_4': 'Can you say that again? I'm sorry.'",
        "'speaker_0': 'Yes. It's making utensils and straws available upon request for takeout. Yes, that sounds good. Okay. And I do see that there's some other folks lined up the conversation around small business being 30 seats. If we're going to make a different process for them, I think the staff has already done a fantastic job, but I am curious to'",
        "'speaker_0': 'see where that conversation goes. So thank you.'",
        "'speaker_1': 'Thank you, Councilman.'",
        "'speaker_3': 'Thank you. I'll be very brief and I'll try to be brief. First of all, I want to thank our staff for the great report. I want to thank Councilmember Gonzalez for bringing this issue forward, as well as all of the public comment that we heard this evening on all sides of this issue.'",
        "'speaker_3': 'I want to just say that I support the direction that we are headed as a council and as a city on this particular issue. I think it's good to have policy before us for consideration Olympic impacts, not just a handful of people, but the entire city, this entire city, for their will, impact for generations to come potentially'",
        "'speaker_3': '. I would like to really see us walk away this evening with something in place that will respect all of the interests before us, but move us in the right direction. I want to just speak about my constituency on a district.'",
        "'speaker_3': 'We represent a lot of diverse opinions and diverse people, but we also have a lot of small business in the district as well. And I've heard from many of our our business owners who are very concerned about this this ban before us.'",
        "'speaker_3': 'My my I've heard from my constituent and I was glad to see Donna here. She's our our sustainability commission representative. We have constituents who are very sensitive to the environment, but also very sensitive to small business. Most of the small businesses and restaurants in my district are residents and in the city as well.'",
        "'speaker_3': 'They're not coming from other places. They're stakeholders here as well. And I think we all agree that our beaches and environment would benefit if there were less carelessness in terms of litter and plastics and polystyrene throughout our city.'",
        "'speaker_3': 'Limiting Styrofoam. And the city of Long Beach, I think will help in the long run. I do like the the conversation around litter because I think that is a core issue here. We can't get away from it no matter how we look at it.'",
        "'speaker_3': 'We have an issue there and I think we can do a lot of better in terms of managing that litter and the with the tools that we have in front of us in and the big burly trash cans is is one I think obvious solution that that I think it's almost unanimous.'",
        "'speaker_3': 'One, when I hear the councilmembers talk, everybody wants to see them in their districts, in their business corridors. I think they should be in our districts. I think they should be in our parks. I think they should be on our beaches.'",
        "'speaker_3': 'And I think they should be on business corridors and prioritized business corridors that are closer to waterways and our streams that lead to the ocean. In the eighth District, we run a lake parallel to the L.A. River, and there's a lot of talk.'",
        "'speaker_3': 'We had a presentation just last week with the Lower L.A. River Revitalization Group that I'm a part of. The mayor is a part of several cities up and down the L.A. River are part of that that that that a task force is looking at doing other things with the L.A. River.'",
        "'speaker_3': 'And one thing that came to mind is if we're going to be creating more more recreation and bringing more people to the L.A. River, we're going to have to be considering more pollution and the potential for more pollution.'",
        "'speaker_3': 'And so to that extent, I think we need to be also in that that group, I'll be recommending that we look at a waste receptacles along the L.A. River as well, I think, as well as elected leaders, our responsibility to improve the environment whenever we can.'",
        "'speaker_3': 'And and I have a good feeling that tonight we're going to take a step in the right direction in doing that. I think at the same time, we need to be fair to all of our stakeholders and understand this financial impacts and mitigate those impacts as we implement the new policy.'",
        "'speaker_3': 'I don't think there's a rub in terms of direction. I think the rub may be how we implement the policy. Right. And so I would really recommend some flexibility here from all of my colleagues so we can we can land in the right place.'",
        "'speaker_3': 'This evening, we've had some experiences where inflexibility has has resulted in hurt feelings. And so and I will also say that I think that a regional and statewide approach is is will be more in our benefit, because if not a band is band is just going to be a band aid unless we get the rest of the'",
        "'speaker_3': 'county on board. Well, what we're doing, most of the litter that we're dealing with is coming from other cities up the L.A. River. We need to do our part as a city, but we can't do it alone and we're not going to fix the problem unless we bring everybody on board.'",
        "'speaker_1': 'Thanks. Thank you. And I'll I'll insert my comments here. So so I had an opportunity on Friday to sit down with a number of restaurants in my council district. And we had a we had a great conversation. We are you know, we had a pitcher of beer and some pizzas and.'",
        "'speaker_1': 'We kind of sat down and worked it out. And they came in and they were kind of worked up about information, saying things like, my costs are going to double and this and this and that. So we sat down and we went sort of piece by piece and talked it through.'",
        "'speaker_1': 'And what I found is that we don't engage our small businesses enough, frankly. And and I know there's a lot of people here that were told certain things and that, frankly, just are not true. And I think that we need to we need to really get to the point where we can do some real engagement, real outreach'",
        "'speaker_1': 'in terms of supporting these small businesses and frankly, not exploiting them. When I got to sit down with them, they told me things like, hey, it's going to double my double my cost at a minimum. So we sat down and started looking up, you know, looking up.'",
        "'speaker_1': 'My staff looked up some some price sheets and and there was significant interest in, you know, doing some localized sort of in district purchasing consortiums or bringing people in to have them actually compete for your business. And and so, you know, that said, I want to take a take a step back from the sort of the politics'",
        "'speaker_1': 'here. I see that there's a lot of talking points. Everybody came down and said the same thing. And I want to get back to the purpose here. Councilwoman Gonzalez has been a good a good leader, a good champion on this on this policy.'",
        "'speaker_1': 'And when it first came, the council folks might not remember, but we asked for a phase. It was a big discussion. And city you know, Councilwoman Gonzalez, the rest of the council got on board with that phase in and city staff worked on that and brought it back.'",
        "'speaker_1': 'Secondly, there was a lot of concerns when it initially came about impacts to small businesses. We asked them to take a look at incentives for small, small businesses. And there was a lot of conversation about an economic hardship because I do remember the plastic bag ban and everyone likes to applaud it.'",
        "'speaker_1': 'But in reality, not a lot of people were happy in a lot of it. There are still grocery stores today that don't have plastic that are still using plastic bags. So it still it did lack in education and and we didn't create the real pathway for people to have to get access to their hardship waivers and things'",
        "'speaker_1': 'like that. So so what I want to say is, you know, we are at the mouth of the L.A. River. We are the second largest city in the county, arguably between six and eight feet. An eighth largest city in the state fluctuates depending on what list you look at.'",
        "'speaker_1': 'And we do need to make a statement that if folks are going to enjoy our beaches, if we have communities to live along our rivers, we have to make an example for all the cities that are that are up river.'",
        "'speaker_1': 'And and we need to make a statement tonight. Now, in terms of the the the sort of the the policy discussion here, I saw that Councilwoman Councilwoman Gonzales initially came out and outlined a process and there were some friendlies that were added.'",
        "'speaker_1': 'My hope is that and you know, and I agree with what Councilman Andrews and Councilman Austin said, I want to make sure that we get something done tonight that the city council can live with that maybe, maybe not the folks who are organizing all the restaurants, but maybe that the restaurants can live with and that the and'",
        "'speaker_1': 'and, you know, something that the residents can live with. And so I'm hoping that we can sort of drown out the politics and the consultants and just have a conversation about what's right for Long Beach. Because reality is the state, the state I anticipate after election season, the state's going to take this up in the next cycle'",
        "'speaker_1': 'in 2029, after the 2018 elections. And the more time, more heads up we can give to our small businesses to prepare, the more of a system that we can put in place so that they actually adjust to it.'",
        "'speaker_1': 'I think I think we're actually going to do our small businesses a favor. So first, I want to ask Councilwoman Gonzalez. So I know that we built in we already built in a delay for the small businesses in phase three.'",
        "'speaker_1': 'And what is that? That was a delay. It was 15 months. Okay. So I think everyone here would probably support a longer delay. So is that something you're open to?'",
        "'speaker_4': 'What are we thinking?'",
        "'speaker_1': 'Wilson was having a conversation.'",
        "'speaker_4': 'Well, I mean, if you're thinking like an additional three months because we've done three months, I think that would be fair. So if you do like an eight.'",
        "'speaker_1': 'How about a window? So if we didn't like if we went from 15, what if we did 18 to 24? Is the implementation window? No. Well, 18 to 21 gives you an additional 3 to 6 months time out.'",
        "'speaker_1': 'We're having a conversation on our side. We listen to you guys. We're trying to we're trying to put together some public policy that works here without. So the only thing I.'",
        "'speaker_4': 'Would say and I appreciate that is that when we are crafting economic incentives for these businesses, we're going to be prolonging the incentives we give back to these small businesses. So a lot of businesses existing that are currently using alternative products would benefit from these economic incentives that we're hopefully going to put together.'",
        "'speaker_4': 'So whether that's we've talked about small grants, we've talked about a green business program where you get recognition, whether it's a logo, a window decal, a certification of sorts. A lot of the existing businesses will exhaust all of those resources, first and foremost.'",
        "'speaker_4': 'So I would hate to delay it even further, but I would say 18 months is.'",
        "'speaker_0': 'A good.'",
        "'speaker_1': 'Place to work with that now. Let's say 18 months. That's a friendly at 18. So I think additional three months. Let's let's talk about the undue hardship exemption. It's just a question for staff. So my understanding and this was a you know, this was good intel that came to me in my meeting on Friday with the small'",
        "'speaker_1': 'businesses. They said that a number of cities established undue hardship provisions or processes, but they hadn't been implemented. Can you speak to sort of what cities have them that haven't been implemented or what we can do to make sure that those are in place before the before the ban actually takes place?'",
        "'speaker_1': 'Yes. Vice Mayor Richardson, San Francisco can use them as examples of observe, if you would, the Cadillac of this type of model where they've done everything from bans in all restaurants to retail sales. They have undue hardship exemptions.'",
        "'speaker_1': 'They had only three businesses request an exemption, and none of those businesses were restaurants. So what we found in most cases is most restaurants aren't taking advantage of undue hardship exemptions. Okay. And the other piece of this is, you know, I saw that there were some economic incentives.'",
        "'speaker_1': 'Can you just talk a little bit more about what those are and what's on the table? How's it how's that looking? Sure. We're we're putting together some plans with the Economic Development Commission and the Economic Development Department. There's some recommendations that came out of the commission.'",
        "'speaker_1': 'They include recognition, as was described, similar to what we've done in the past with our no litter zone businesses, where the businesses would be recognized in the press, perhaps for complying with the ordinance early on in supporting the city's desire to exercise this ban.'",
        "'speaker_1': 'They would get a thank you. They would get recognition. They could put in their storefront in their window. People would know that they're complying with these environmental laws and drive business to them. There are other options as well where there could be some assistance given to if there's excessive financial hardship in new products being purchased.'",
        "'speaker_1': 'There's Encinitas has a model where they use or they give a small, small grant. And we'd have to work with our city attorney's office to see how we could do this appropriately. But they give small granted a couple hundred dollars or so.'",
        "'speaker_1': 'Based on when they phased in. So the earlier they phased in, that dollar amount might be a little bit more. The later they phase in it, be a little bit less. Okay. So I'd want as we get closer to really be tight on the messaging there.'",
        "'speaker_1': 'Next, I have a question for Councilwoman Price. So I know that you you started off with a conversation about some things that you'd like to see, but it's.'",
        "'speaker_6': 'Just one thing. Okay.'",
        "'speaker_1': 'But I want to I want to I want you to jeroboam. I just want to drill down on that a little bit. Can you elaborate what are the things you're specifically looking for in that study? What are you looking for?'",
        "'speaker_1': 'And then if you could, you know, in the hope of making this productive conversation, draw out the pieces that are different than what's already been studied by staff. So what elements, more specifically, you want to see?'",
        "'speaker_6': 'Well, and I appreciate the question. I don't take well to being cross-examined by my colleagues. So but I do appreciate the inquiry. And and and always I try to make the conversations productive. And just because people here aren't hearing exactly what they want to hear doesn't mean it's not productive.'",
        "'speaker_6': 'But in terms of a study, I think my my biggest concern from the outset has been that I, I seek to try to protect our small businesses as much as possible. And although I appreciate your comments, Vice Mayor Richardson, regarding keeping the politics out of it and something about consultants, I mean, let's be honest, there's advocacy groups'",
        "'speaker_6': 'here. There are special interests here. There are residents here. There are businesses here. The reality is it's a typical Tuesday night when we're addressing a controversial issue. So let's not single out any particular person or entity. What I will say is that having heard from small businesses, I think before we implement a ban on them, we should'",
        "'speaker_6': 'definitely have the data to support the ban. There is the data on this particular topic in regards to Styrofoam is fractured. Having said that, I think having a Styrofoam ban is a good policy. I think at the very least, it will make a dent into a much larger, complex environmental problem that we have.'",
        "'speaker_6': 'But the data, Vice Mayor Richardson is completely fractured in terms of the role of Styrofoam, specifically on the environment. So what I would like to see is an impact study, whether it's done within the city of Long Beach, because, you know, we're going to be implementing phase one and phase two immediately.'",
        "'speaker_6': 'So we will have some data of our own to look at. We'll also have the opportunity to look at data from the 100 cities or so that have not yet produced a report. And based on that data, then we can implement to our small businesses this 15 month rollout plan.'",
        "'speaker_6': 'It's not saying, let's not ask the small businesses to follow the ban. The small businesses, by the way, and the consultants that you point out, by the way, have repeatedly said at the podium they don't want a phased in approach at all.'",
        "'speaker_6': 'They don't want a phased in approach. I'm saying I understand that and I hear you, but we're going to do a phased in approach. We just want to wait until we have the data to impose it on the smallest businesses, because it is extremely expensive for these businesses to stay in business.'",
        "'speaker_6': 'Restaurants are now going to Postmates and Uber Eats and all sorts of delivery services, so most of their expenses are now going up because of delivery service. The industry is changing. And so what I'm saying is I'd like us to be able to say, yes, we are going to implement this for small businesses, but we're going to'",
        "'speaker_6': 'wait and have a study first and then we're going to implement it on that way. I would feel a lot more comfortable doing it. That's my personal opinion. I understand that the Friendly wasn't a. But it's my effort to compromise every other aspect of it, of the staff agenda item I love and would want to implement tomorrow'",
        "'speaker_1': '. Great. So I would I would just say, you know, you know, my comment about consultants, it's because, you know, I represent the businesses and the residents of Long Beach and I try to put their their probably, you know, their interests ahead of consultants.'",
        "'speaker_1': 'And the reality is, I didn't single out any single consultant, but when I met with my businesses, we had a certain connection, a certain conversation, and that happened. And then what ends up happening was end up getting a letter, refocusing, or after the meeting got a letter from a consultant refocusing the discussion, and it totally mischaracterized the'",
        "'speaker_1': 'meeting we had. And in reality, those were not the words of our small businesses. And so we have small businesses here, and they are concerned, but we need to do a better job as a city engaging them. Frankly, it's a little bit of exploitation.'",
        "'speaker_1': 'Now, I had never met this particular consultant before, but in general, I want to make sure that we're actually making public policy that meets the needs of our long term businesses that are here, not necessarily someone who's an organizer is going to move on to another campaign.'",
        "'speaker_1': 'I'm sure you understand that. And so my hope is my hope is and I'm going to give this one more try because I didn't didn't get much, much clarity if there's. So you're saying evaluate what actually the evaluate phase one, a phase two before implementing phase three.'",
        "'speaker_1': 'Is that what you're proposing?'",
        "'speaker_6': 'Yes.'",
        "'speaker_1': 'Okay. So what I'm what I'm hoping to see is, rather than put a pause, because we have this conversation about cannabis, we had a conversation about minimum wage. I have no problem with looking at data, but what I don't want is for people to get sort of a have a unclear timeline when they leave here for whether'",
        "'speaker_1': 'or not this is going to be implemented. I think that's reasonable. I think enough people have said, hey, we want to support a ban. You said it yourself, Councilman Price. I've heard enough people say they want to get there.'",
        "'speaker_1': 'What I want to get to tonight is somewhere we can say, look, we're going to address these concerns, perhaps, you know, have a delay, do some studying right now, but actually have a very clear timeline that folks can support.'",
        "'speaker_1': 'And Councilman Andrew's councilman, Councilman Austin, a number of people said we're not looking for people to say what they these you know, the public said we don't want any phase in whatsoever. Well, guess what? They're not elected to make policy.'",
        "'speaker_1': 'And we are. So I don't mean, you know, this not coming off a lecture, but we've been here before. We've seen how sort of these issues that should be something where we understand a vision of where we're going as a city.'",
        "'speaker_1': 'We get caught up in the details. Chickens, goats and bees, you name it. Right. Where we actually should be taking steps in the right direction. So so I'm going to close with Councilwoman Gonzalez, given that discussion around a study.'",
        "'speaker_1': 'Are we open to doing asking staff to conduct a study on day one and not conduct a study specifically on two issues? One. Excuse me. Let me finish. Let me finish. We can, you know, a few more people cued up.'",
        "'speaker_1': 'One on the impacts of phase one in phase two. And secondly, gather more data, more information. Want more data on impacts of cities we have just implemented. But we but we're not going to say don't implement, don't move forward with phase three.'",
        "'speaker_1': 'But we say bring back a study to the city council to be seen. And without necessarily saying don't implement phase three is understandable. So you'll do something like that?'",
        "'speaker_4': 'Absolutely. I've asked this before from many other policy items that while we implement this at a three months, nine months and then maybe 18 months for small businesses, while we're doing that, absolutely. We can bring back for the.'",
        "'speaker_1': 'Larger businesses, for.'",
        "'speaker_4': 'The. Yes, yeah, we can absolutely bring data back. That includes information about various cities.'",
        "'speaker_1': 'And if.'",
        "'speaker_4': 'Any aggregate we're doing.'",
        "'speaker_1': 'And if we're doing three months, six months, nine months on larger businesses at any given point, that can be the trigger point for city council to say, hey, before you move forward with this other additional phase, we're seeing some data that that may not be favorable.'",
        "'speaker_4': 'Sure. Yes. And I will remind you that, you know, our environmental services staff is working very hard on this, and they've done a lot of research and information on this. And with all due respect, you know, a lot of the studies in our city, as much as we want them to come back on time and they know'",
        "'speaker_4': ', unfortunately, they're so bogged down with work that they often don't come back in time. And I don't want this to delay any further because unfortunately, our city work, you know, employees are working so very hard. So I would love for us to keep the timeline, but absolutely and you know, respective to Councilmember Price's information is to bring'",
        "'speaker_4': 'back that.'",
        "'speaker_1': 'So, okay, so I'm sure there will be additional things to add. So I'll just close with this. You know, when I was in elementary school, my, my, my teachers would tell me, hey, styrofoam is bad. You know, I'm 34 years old.'",
        "'speaker_1': 'I was elementary school. But Styrofoam is bad. It never goes away. It pollutes our fish. We're at the mouth of the river. Where? The home of the aquarium Pacific. We need to be on the right side of this issue, but we need to do, in a way, doing it in a way that acknowledges progress as we move'",
        "'speaker_1': 'forward, but has some sort of a timeline, incentives in place and data in place. So my hope is that with that conversation, it sounded like and this will be further defined, I'm sure, but it sounds like Councilwoman Gonzales is open to some some part of a study that that has come up tonight.'",
        "'speaker_1': 'So that concludes my comments, Councilwoman Mongo.'",
        "'speaker_0': 'I would really love for us all to come together. I'm going to quote a communication I received from someone that spoke tonight with a green board. The first year of the study that we've seen in other studies that he was referencing show minimal benefit.'",
        "'speaker_0': 'And so my concern is that what we're starting to. This is one of your own that's still here. The first year of the study shows minimal benefit. The second round of the study is where you see the reduction.'",
        "'speaker_0': 'And so that's the general goal of the ban. I get that the goal is to reduce polystyrene. I also want to really speak to Councilmember Durango, who really gets and all of his comments were just so on point tonight about how we are the receiver of all of the different trash from the whole region and a ban'",
        "'speaker_0': 'in Long Beach. The study isn't going to likely show a large increase in that right away because, again, we're the mouth of everyone. And so I also want to comment that Councilmember Durango mentioned food trucks, and I'd like to add food trucks to this ban, because those are people who are not Long Beach businesses and they drive'",
        "'speaker_0': 'their dirty trucks into our community and then they park on our streets that don't have very many parking spaces to begin with, sometimes in front of our small businesses and restaurants that are trying to make a living, and then they use their polystyrene to put their food into the community.'",
        "'speaker_0': 'And those individuals are usually eating that food on the street and they're the most likely to throw it into a trash can. So I had kind of thought of a few friendlies, but what I'm going to do right now, what I'm going to do right now is I'm going to I'm going to make a motion.'",
        "'speaker_0': 'I hope that Councilmember Gonzalez will be the second on that motion, because I really think it it really takes all the things said here tonight. But I think that she really deserves the credit on the work it took to get here.'",
        "'speaker_0': 'But I think that this pulls everything together from a long time. So and mostly also because I don't know other what other Friendly's she's accepted that I'm not in agreement with because I was so busy trying to aggregate all the ideas I've heard.'",
        "'speaker_0': 'So first I want to request a study to explore a public private partnership for the purchase of 100 big belly trash cans for the deployment along business corridors, parks, beaches and specifically areas that take food trucks, often with primary deployment to areas with food trucks and water adjacent areas with the goal of reducing all litter of litter'",
        "'speaker_0': 'and bring back a two from four within 180 days of any options or costs that are available. I'd like to prohibit, since it's a city property, we don't actually need an ordinance on it. I consulted with the city attorney earlier, so a policy prohibiting single use food and beverage containers made of EPS rigid polystyrene number six and'",
        "'speaker_0': 'non-recyclable and non compostable materials for prepared food distribution at city facilities and city permitted events effective July one. City events permitted prior to the ordinance are adopted with exemption or receive an exemption. Adopts Adopt an ordinance prohibiting single use food and beverage containers made of EPS rigid polystyrene number six and non recyclables on noncombustible materials for prepared'",
        "'speaker_0': 'food distribution at large food establishments, which is the third tier of our food establishment guidelines defined as having as defined as the third tier and bring that back within 18 months of full implementation by all of them verified within 18 months of the adoption of the ordinance and include a ban on all this is this is a'",
        "'speaker_0': 'new one this is adding to what we need to ban ban on retail sales of polystyrene disposable ice chests, beanbag chairs filled with polystyrene and polystyrene beads used in crafts and sold in craft stores at the same timeline as the entire ordinance include and undo.'",
        "'speaker_0': 'Most of this language is still from Council Member Gonzalez's item include an undue hardship exemption that would allow, business says, to apply for a compliance waiver similar to the Pasadena Municipal Code. 8.67.06. So. Conduct and present a study regarding the benefits of the ordinance.'",
        "'speaker_0': 'And if the Council determines that the ban has been measurable made measurable data results. Let me try that one again. Conduct and present a study regarding the benefits of the ordinance. And if the Council determines that the ban has made a measurable, data driven outcome, consider implementing the banned citywide on all restaurants.'",
        "'speaker_0': 'Provide a business license refund. This is a smile, a slight rewording of the incentive program. Provide a business license refund to businesses of less than 100 seats that voluntarily comply with the ban within 180 days of the adoption of the ordinance.'",
        "'speaker_0': 'So that means for you restaurants, if you choose to take on the ban and you are not included in the third tier of restaurants, then you can fill out a one page form similar to what Councilmember Price and I adopted for new and small business growth in the city.'",
        "'speaker_0': 'So one page form that says, look, you didn't require that I get rid of Styrofoam, but I'm getting rid of Styrofoam. And I would like you to refund my business license for the year so it'd be free for your business to operate in the city for that year because you've chosen to make a good decision and make'",
        "'speaker_0': 'it easier on our community to not use Styrofoam. So I'll put that out there. I hope that Councilmember Gonzalez will second. It was my keyboard, but if she will not, it's as I've motioned. If she won't, I hope one of my colleagues will, because I think this really pulls together all of the thoughts of all of my'",
        "'speaker_0': 'colleagues and moves towards a citywide ban. And it and it includes, quite frankly, a lot of items that were not originally up in the discussion that I think are very harmful.'",
        "'speaker_1': 'Thank you. And next we have Councilmember Turanga. Wait, I don't see a second. Is there a second on that motion? If not, okay, there's a second. Councilmember Turanga. Thank you, Vice Mayor. Again, I agree with you. 18 months, I think that's fair.'",
        "'speaker_1': 'It gives small businesses an opportunity to review and look at how their business is functioning with the with the ban. The other aspects of it, I don't know if I can with the Stacey's Councilmember Mango's motion, because that would be I mean, I think we will get what we want, but there's unintended consequences, I think in some'",
        "'speaker_1': 'of that that is being proposed mainly that if we give back or create a free business license deals for for that year, we're going to lose all revenue. Hold on, hold on. Let me finish. Let me finish. And don't get excited.'",
        "'speaker_1': 'It's been it's been a long week. So, I mean, I can see that. And plus, I don't think that there will be many businesses who would jump on that. But we do need carrots. We need we need to give them carrot, because the bottom line that I'm hearing here tonight is two issues.'",
        "'speaker_1': 'One, we have trash. It doesn't break up. We can't get rid of. It stays for hundreds of years. We got to deal with it. The second is that we need that trash because it's cheap to make. They're very versatile.'",
        "'speaker_1': 'We could do a lot of things with it and we can make a whole ton of them and be able to serve the needs of our customers. In terms of restaurant business, it's economics, you know. So we're dealing with economics versus the environment.'",
        "'speaker_1': 'And I hate to put those in terms of just supporters. Both of them get together, but hopefully that's not what we want to do here. We want we want to go to a middle ground here where we can have something that the businesses can work with that will help our environment.'",
        "'speaker_1': 'So. Correct isn't a lot. Okay, answer my question. So how do we get there? How do we get there? So the stick may be the ban, but it doesn't have to be a ban. It could be businesses that would convert over to composted types of materials like paper bags or box or cardboard or anything else.'",
        "'speaker_1': 'That that is just for now. Not call it a ban. Let's just say an incentive to use other materials other than polystyrene. And there would be incentives to using that because that would, in fact, help our environment. It'll be biodegradable and it would be easily disposed.'",
        "'speaker_1': 'How do you get there? Well, you know, until we find something that's made more cheaply, it's going to be expensive. We know that that's that's the argument. The argument is that polystyrene is very cheap and very versatile, but yet very toxic to our environment.'",
        "'speaker_1': 'I don't know how many of you have seen a movie. I forget the name of the movie right now. But they show where there's a whole portion of the ocean that is nothing but plastic all over for miles and miles and miles.'",
        "'speaker_1': 'And we can't do anything about it. We can't because we can't recycled. So let's go to our senses. Let's deal with the reality here that we're dealing with economics versus the environment. So how do we get there? I don't know.'",
        "'speaker_1': 'Perhaps. So my colleagues here has this idea. They know Stacey is chomping at the bit, ready to tell me how. But we need to. To look at the fact that polystyrene is toxic. We know that that's a fact.'",
        "'speaker_1': 'And we know that it's polluting our oceans. And it's polluting our rivers. That's a fact. So in the absence of doing that, perhaps we can look at if these companies are willing to make more public staring, let's make them responsible for it.'",
        "'speaker_1': 'Let's have them clean out. Really? How can I help us clean our rivers? How to clean our oceans? You're helping create that machinery that we could put at the mouth of the river that will capture all that polystyrene waste and get rid of it.'",
        "'speaker_1': 'Or how do you take it? Get some ships. Go out to that that black zone in the ocean where there's nothing but plastic out there. And clean that up. Help make them responsible for what they're creating, to help us clean our environment.'",
        "'speaker_1': 'Make them responsible for making cheap products that everybody was use, but take more responsibility. So what it does to the act, to the environment. So in a nutshell, we're at a crossroads here. We've we've discussed this now for about 3 hours now.'",
        "'speaker_1': 'We're going 3 hours with this discussion, and we're still trying to find a middle ground that would be happy for everybody. And I don't know if we're going to find one that could please everybody tonight, but I would like to to make a friendly, if I can.'",
        "'speaker_1': 'Is that in addition to whether I can make a friend of yours or anybody's motion? Well, we'll do your motion and maybe make a friendly later look at we'll come back to it. But I'm not going to finish with that now.'",
        "'speaker_1': 'Thank you. Yeah. Okay. There was a question made to the make of the motion.'",
        "'speaker_0': 'So the question related to where the money would go for the business incentive program, there was $100,000 set aside into a special account for those new businesses. And I verified with the city financial officer, John GROSS earlier this evening that we would be able to use that same funding for this.'",
        "'speaker_0': 'We would just add on an additional option of a way to draw down those funds for the businesses. So there is money in the account and then make them responsible. I appreciate that. Councilmember Turanga, I spoke to some of the members of Surfrider Foundation and others about an option of having the In-Dash industry fund a water wheel'",
        "'speaker_0': 'that a lot of people have posted on Facebook. And it's a very interesting idea and it not only cleans up polystyrene, but it also cleans up cigaret butts, one of our biggest issues and others. But they didn't feel that they could trust the industry to do that.'",
        "'speaker_0': 'So I feel that we cut off that dialog before it was even possible because of the lack of trust between the two sides today. And I think that's what we're all trying to bring together.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_4': 'Yes, I am so sorry. I have.'",
        "'speaker_0': 'To apologize.'",
        "'speaker_6': 'Because I you know.'",
        "'speaker_4': 'I think that you all have certainly seen us go back and forth, both business and green advocates, and I really appreciate it. So I'm going to offer a substitute substitute motion, and I hope this will make everyone satisfied in some respect because it's going to take components from everybody's discussions here.'",
        "'speaker_4': 'And I really appreciate the robust discussions because I think this is what we need to and what we need, in fact, to really make really great, robust policy. So taking into consideration what everybody has mentioned, I would like to make the substitute substitute motion that would include the same timeline, three months city facilities and events.'",
        "'speaker_4': 'And I believe that also I'm sorry, so do city facilities, events, nine months, large restaurants. And let me ask you, Environmental Services Bureau, why was 30 selected as small business? As if I'm sorry, defined as large business 31 and under.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Counsel reasons The Health Department has detailed information on restaurants based on a number of seats, and they break them up in certain certain numbers. So 0 to 10, 11 through 30. And we looked at 1130 being the threshold, pretty much split the city up into 15 50%.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'And so we figured half the restaurants would be at that point and then the other half would follow suit afterwards.'",
        "'speaker_4': 'Do you think we would be able to. Okay. So I see what you're saying there. So that's fine.'",
        "'speaker_1': 'The next threshold would be 60.'",
        "'speaker_4': 'So that would be 60 and then 100. Okay. Do you think we'd be able to increase that? You know, for so for large restaurants, we can include we can define that as 60 or 100. What would be the would there be any issue on the back end with an on your side on city staff in enforcing that'",
        "'speaker_10': '? Councilmember. No, there wouldn't.'",
        "'speaker_4': 'Okay, so let's move the large restaurants to 100. I think that's something that was recommended by Councilmember Mango.'",
        "'speaker_1': 'Councilwoman Gonzalez. It would have to be 101.'",
        "'speaker_4': '101, that's correct. Yes. 101. And then 18 months as recommended by Vice Mayor Rex Richardson to incorporate the smaller businesses. And at that point, I also believe we can incorporate the ban on retail sales of polystyrene disposable ice chests.'",
        "'speaker_4': 'Beanbag chairs filled with polystyrene and the polystyrene beads at that same time. And I also want to make sure that I believe I saw in one iteration that food trucks were included. Is that correct?'",
        "'speaker_1': 'Because it food trucks are considered as part of the first not the first part of the second phase of the large businesses, as are franchised chain restaurants such as McDonald's. Yes.'",
        "'speaker_4': 'Okay, great. So food trucks are included. And that was something Councilmember Mungo brought up. And I think they should be included. Absolutely. Because they are part of the issue as well. So we're at 18 months. And then I would also like to add the study, as Councilmember Price had mentioned.'",
        "'speaker_4': 'I do believe that we should have, you know, any any more information we can get the better, of course. And I would hate to burden our city staff with this additional study, but I think if it's going to keep us in line with the timeline, but include, you know, more information, that would be great.'",
        "'speaker_4': 'So if that could be provided, maybe add a year or a 15 month mark, possibly earlier so we can make a better decision. That would be great. Well, hey, I'm giving it to them. I say 12. It might be 18 months.'",
        "'speaker_4': 'No, I'm sorry. I don't mean to say that, but it's true.'",
        "'speaker_10': 'Certainly the staff can provide a report on the impacts as we see it.'",
        "'speaker_4': 'And.'",
        "'speaker_10': 'Provide that to you. I think we'd want to see at least nine months worth of data, so maybe somewhere around that 9 to 12 month time frame would be appropriate.'",
        "'speaker_0': 'Perfect. So we'll receive a.'",
        "'speaker_4': 'Study back from 9 to 12 months and that will include information relative to the impacts of other cities and litter. And we'll have that. I would like to just comment, though, so I appreciate that. So I would like to comment on the business license refund.'",
        "'speaker_4': 'I don't personally believe that we should be dictating what types of economic incentives at this point. And I also feel, although it might be something we can do, maybe something it doesn't necessarily mean that we should do it.'",
        "'speaker_4': 'And the reason I say that is because what has been proposed is to refund business licenses for people that are for businesses that are going to comply voluntarily, meaning that they're not complying currently. But what about the businesses that have been complying for ten, 20 years?'",
        "'speaker_4': 'We need to find some sort of incentive for them as well. So I just ask us to explore, which I think we're already doing.'",
        "'speaker_0': 'And what I'll ask our Environmental Services Bureau to do, and I think I spoke about this before, is there's a.'",
        "'speaker_4': 'Green.'",
        "'speaker_0': 'Business program provided through.'",
        "'speaker_4': 'The state. And I don't believe at this time that the City of Long Beach is certified through that program. That program allows small businesses to represent themselves with a green reputation. On the state website you're on the state website with a green reputation, people can locate you in the city of Long Beach.'",
        "'speaker_0': 'But we're also afforded.'",
        "'speaker_4': 'For for being a part of that and certifying ourselves some funds to help small businesses. So I think there's some leeway in helping both existing and new businesses that are voluntarily going to comply with this, maybe even prior to the 18 month date.'",
        "'speaker_4': 'And then lastly, I do believe we should implement a study to.'",
        "'speaker_0': 'Explore the.'",
        "'speaker_4': 'P3 for the purchase of big bellies. I don't know if it's 100 or 200. I don't know what that looks like. A hundred would be great. But I mean, if we can.'",
        "'speaker_0': '50.'",
        "'speaker_4': 'Gets us there, great if it's 200. But I do believe we need some sort of study. I think that's something that was.'",
        "'speaker_0': 'Brought up by.'",
        "'speaker_4': 'Councilmember Pearce Price and Mango.'",
        "'speaker_0': 'So with all that said.'",
        "'speaker_6': 'I know this was.'",
        "'speaker_0': 'A very robust process. I hope that that.'",
        "'speaker_4': 'Brings some clarity.'",
        "'speaker_0': 'I hope that.'",
        "'speaker_4': 'That brings some compromise to the table. And I hope that we also look and thank again are green advocates, but are small businesses, because.'",
        "'speaker_0': 'The end of the day, bigness, big business is going to want what they want. But it's really the small.'",
        "'speaker_4': 'Business that we have to advocate for, and it's the individuals who are going to be affected by this. It's carcinogens. It's it's deeper than just litter. It's the environment that we need to protect here in the city of Long Beach.'",
        "'speaker_4': 'So I hope that helps. Thank you very much.'",
        "'speaker_1': 'Thank you, Councilwoman. And I just want to recognize your willingness to compromise, integrate a lot of feedback you've got here. And so I'm going to I'm going to go ahead. And second, your motion next is Council Suber. No, thank you.'",
        "'speaker_1': 'Okay. Now I have just a little tiny bit of a friendly it's barely anything. You'll even notice what I thought I heard when Councilwoman Pryce first made that friendly. She never mentioned staff, and then the vice mayor mentioned staff.'",
        "'speaker_1': 'And then you picked up on that. So I would like to ask for a friendly that we have a third party study and maybe we can come up with some funding sources here among the groups. I just I just feel for what I see on both sides.'",
        "'speaker_1': 'All right. But just to add another burden on the public works, they do a just a tremendous job. And I just I just think that if we could take this off their plate, that would be a real nice move.'",
        "'speaker_1': 'And then also, just to clarify, because there are a lot of moving parts here, so everyone knows that the small businesses are exempt from the ban immediately. Is that what you are saying? So I just want to reiterate right now.'",
        "'speaker_1': 'Okay. Thank you. Thank you, Councilman Austin. Oh, no. Councilman Price.'",
        "'speaker_0': 'Okay. So I want.'",
        "'speaker_6': 'Clarification, please, on that. So. So the point of the study and and I appreciate the robust discussion as well, but we started off this discussion with one friendly and and now we have a whole bunch of other points, which is fine.'",
        "'speaker_6': 'I agree with all of them. But the basic premise was to hold off on implementing on our small businesses. And the reason I was suggesting a study is because I don't want a study just to do a study because my colleagues are right.'",
        "'speaker_6': 'We often get studies just to get studies. The whole point of the study was to dictate and justify the implementation of the ban on the smaller businesses, which are very limited in number when we're looking because of this definition now that we have.'",
        "'speaker_6': 'So the whole point was to have a study that we can then use data from to be able to justify for our small businesses. Look, we know for sure this is going to have an impact and we want you to get on board and give you this time to to phase it in.'",
        "'speaker_6': 'When we were saying this that the folks here want to have a timeline by which to count on its city staff that said they would need nine months to one year from implementation to be really able to measure the results of the data.'",
        "'speaker_6': 'That's the time that we need to conduct the study and therefore we can't implement on small businesses until the time that we've had to analyze the data results and then apply the the ban on small businesses, which again.'",
        "'speaker_0': 'The the record should be very.'",
        "'speaker_6': 'Clear. What I'm hearing my colleagues say is that everyone is on board with the ban. It's just a matter of when and at what point in time the ban moves on to the small businesses. And what I'm saying is I'd like to have a study in place of how the implementation of the ban is impacting the city'",
        "'speaker_6': 'and use that data to justify imposing the ban on small businesses at that time. So I'm a little bit confused here. Are we going to because Councilman Supernovas question I think led to a different thought than I had.'",
        "'speaker_6': 'Are we now saying that we're not going to impose the ban on small businesses until the study? Well, what I think that was my friendly.'",
        "'speaker_1': 'Let's just have the city attorney go ahead and recap the motion, the substitute substitute on a recap of the substitute subsidy motion made by Councilmember Gonzalez, seconded by Vice Mayor Richardson. It would be to keep the phased in approach three months after the adoption for the city, city facilities, renters and the others.'",
        "'speaker_1': 'Then a nine month with a change from over 30 to 101 seat restaurants. And then at 18 months it would be 100 or less. It would be implemented. It would include a ban on retail sales at the same time of the implementation of phase three, 18 months of ice, just bean bags and crafts.'",
        "'speaker_1': 'It would add, require a study to be done during the implementation to come back to council between nine and 12 months. Regarding the impacts of the ban, and I'm not sure if the friendly was accepted to have a third party conduct that study or that would be a city study.'",
        "'speaker_0': 'Well, I'd like.'",
        "'speaker_4': 'To find out what the costs are, because I you know, I would love for our city staff at.'",
        "'speaker_1': 'This time, the friendly is not accepted and they could come back at the time the ordinance is brought to you and have you get a further discussion on that.'",
        "'speaker_4': 'I think that would be good. I would be fair. I would hate to add more costs to you.'",
        "'speaker_1': 'Would also include to direct staff to explore the incentive programs such as the Green Business Certification through the State of California and out a study for the purchase of big belly type trash cans, big bellies, a brand name.'",
        "'speaker_1': 'There's other types of vendors that have similar products for and to come back with a memo to council as to the cost and the impacts of that. Okay. Thank you, Councilman. So you have more. Okay. Next council on Monday.'",
        "'speaker_0': 'I was just trying to get some of the things. The pours for small businesses is 18 months, but the study will come back after 12 months. But that but that doesn't mean that there's been 12 months of data and it doesn't go to the comment that I specifically showed earlier, which speaks to a specific comment from someone'",
        "'speaker_0': 'from the Surfrider Foundation. Related to that, the data doesn't usually support it within the 12 months. And so I wouldn't want to put ourselves in a position where the study would come back and not support the ban. The goal is under the motion.'",
        "'speaker_0': 'I need to eventually have a city wide ban, but it would demonstrate yes or no if it actually worked or and by the way, in this option, the big bullet, the the big berry like not brand named trash cans can be a part of that impact that makes all the difference.'",
        "'speaker_0': 'So I, I, I see the areas that are significantly similar to the motion I made. I think that the motion I made really brought everyone together. I think that in your outlining of all the things you said, Councilman Mims, I think that it shows how close together our two motions are.'",
        "'speaker_0': 'And so I would again ask that you reject your motion and come on board with my motion, because I think that I sat with and tried to line those things out to make sure there wasn't the confusion. And I really feel passionately about the business incentive, and I also feel passionately that the study has to have time'",
        "'speaker_0': 'to show effectiveness. And in that vacancy of time, we have to incentivize the businesses to do it anyway. And so that would be my comment. But I think we've come so far and I really, really appreciate all the great work.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Vice Mayor, if I can just go something really quick. So the study, from what I.'",
        "'speaker_6': 'Understand, if we can get clear on.'",
        "'speaker_4': 'This, is not our own study within the city. It's going to be a study of additional cities and additional impacts that have already implemented this ban. So the impacts of and that was requested by Councilmember Price as to various other cities that have impacts what they're doing with the ban and all of those details.'",
        "'speaker_0': 'So I think that was my misunderstanding because I read the study from San Francisco 2008 that showed that there wasn't an impact. And so I thought she was asking. I mean, we can ask her for our own study to see if our ban works and if it's different because we're at the mouth of the river and there's'",
        "'speaker_0': 'other components. And because we know the Surfrider Foundation's going to work hard to get Lakewood and Cerritos and Downey to take on a ban as well.'",
        "'speaker_1': 'So before everybody chimes in, just to be clear, the study that Darrell recommended that Councilmember Sabrina recommended was independent. And if you could just articulate a little bit more, Councilman Sunak's, we understand it was an independent study. Am I right?'",
        "'speaker_1': 'Was that it internally or was that externally to other? So I would say, for lack of a better term, third party, maybe an independent third party study. Right. Because I immediately heard, Adam, Adam, it's late. I want to use my words carefully.'",
        "'speaker_1': 'A little bit of pushback from public works like this is tough for us to do. We have a lot on our plate. It's like, well, okay, I have a way around that. We can get a third party group in here to do it independently and maybe the sides here can fund that so that, as the city attorney'",
        "'speaker_1': 'pointed out, the funding mechanism and whatnot that can come back, we can decide that later. So when you know the long answer. So, Councilwoman Gonzalez, it seems very consistent. What you're saying is if there was an independent study asking staff to evaluate the funding, a feasibility, can that be a part of your motion to make sure that's'",
        "'speaker_1': 'reflected?'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_1': 'Okay. And then the reporting internally is not a study that's just tracking and reporting. That's reporting out on a regular basis. That's something staff can do. So can we make sure that that's reflected in your motion as well?'",
        "'speaker_1': 'Sure.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_1': 'Okay. So it seems like those are captured now. We're going to go to the next speaker, Councilmember Pearce.'",
        "'speaker_0': 'Yes. Thank you for restating that. I do want to ask staff, when we're doing our reporting that we report on how many businesses are adopting this early because I know I can't remember if somebody in the audience said the number, but I know we already have over 100 small businesses in Long Beach that already do this voluntarily'",
        "'speaker_0': '. So if we get include that, I think that would be helpful for the council to see how that would impact future small businesses. And then I just wanted to clarify, at the beginning we made I made a friendly that was accepted by the Councilmember Gonzales on including it was on the first but it was okay so I'm'",
        "'speaker_0': 'going to make another friendly I'm going to do it again since we're on the sub sub to include that utensils and straws are given upon request for takeaway items. That is my friendly. Do you accept? Thank you. Before I came up again, I just want to make sure there's no other comments that I include.'",
        "'speaker_0': 'I think that we've come a really long way, the councilmember that has done the work on this for the last two years. He's done a great job, and I think it's just going to applaud us for trying to make it the right thing, but recognize how much work has gone into this day.'",
        "'speaker_0': 'And that is probably why it's kind of difficult to go back and forth. But just want to thank everybody for their efforts.'",
        "'speaker_1': 'Thank you, Councilman Price.'",
        "'speaker_6': 'Okay. So I agree. I want to commend everyone who's worked on this. And, Councilwoman Pearce, you two have worked really hard on this. And I know that, you know, your name is and on some of the signs, but I know you have a lot of passion for this item, so congratulations to you for getting it this far'",
        "'speaker_0': '. So what I the.'",
        "'speaker_6': 'Question I have and I guess I'm going to try to make another friendly if we're proposing a study and that's going to take 12. We're going to wait 12 months to start the study. And then we're going to do a study and start implementing the business incentive at 18 months.'",
        "'speaker_6': 'Then during that.'",
        "'speaker_0': 'Presumably it'll take.'",
        "'speaker_6': 'What, 30, 60 days? Let's give or take that. If the study is late, we'll have a few months during that window to look at the analysis from the study and make a determination as to the next phase, which is the implementation of the business point, the business aspect, the phase three.'",
        "'speaker_6': 'So what I'd like to do is incorporate something into this that allows us to, as a body, review that data before implementing that. The business push the small business portion of it. So I don't know if that makes sense, but my friendly would be that after the study is completed, but before the implementation of the small business'",
        "'speaker_6': 'portion commences, that that item come back to council so that we can make any adjustments that are necessary based on the data that we have received. So that would be a friendly.'",
        "'speaker_1': 'Was that like a study session? Yeah. Like the other.'",
        "'speaker_6': 'Day, the session or just for us to get the data and we might have to tweak the roll out of the implementation.'",
        "'speaker_1': 'I'm not sure if the problem is necessarily if you get the study back on on any Tuesday, you could do an amendment to the ordinance to change the implementation date of Phase three. At that time, you could you could amend this ordinance at any on any Tuesday.'",
        "'speaker_6': 'Right. And I get that. But my friendly is specifically saying, before we roll out the implementation of the small business portion, we as a body together would receive information on the data so that we can move forward with that implementation phase.'",
        "'speaker_6': 'Because you're right, if a TFF comes back that outlines a study, a council member may want to put it on the agenda, may not want to put it on the agenda, it may get lost in the mix. I want it to actually come back so that we can hear the data and we can report to our small'",
        "'speaker_6': 'businesses. This is the data your rollout is about to start and it's based on this great positive data.'",
        "'speaker_1': 'So if I just understand it friendly correctly, then the 18 months wouldn't be a hard date. You wouldn't determine that date until you received the study.'",
        "'speaker_0': 'Yes. Okay.'",
        "'speaker_1': 'So, Councilwoman, the resolution responding to the request.'",
        "'speaker_0': 'Sure.'",
        "'speaker_4': 'That is fine. We can do a study session, but I would really advise this council to stick with 18 months. I really would do that. But we're.'",
        "'speaker_1': 'Getting somewhere. All right. Okay, Councilman Austin, you're up. Well, it was an acceptance. That's. I think I heard an acceptance. Okay, Councilman Austin, listen, city attorney. Sorry, I didn't hear the acceptance. I heard that the 18 months.'",
        "'speaker_0': 'Can you do it again? Yes.'",
        "'speaker_1': 'Sorry. And then I didn't hear the study session. Now there's a study session out of the city council. Should this.'",
        "'speaker_0': 'Be a a meeting.'",
        "'speaker_4': 'A study session? Just some sort.'",
        "'speaker_1': 'Of report, opportunity, practical.'",
        "'speaker_0': 'Review that.'",
        "'speaker_1': 'Yeah, I fell for the question. Well, you're the last speaker, so no need to call for the question. Okay, so that concludes comment. Members, please cast your vote. This vote is on the substitute substitute on a substitute substitute motion.'",
        "'speaker_0': 'Motion carries. Unanimously.'"
    ],
    "Recommendation to request City Attorney and Department of Health and Human Services to draft an ordinance requiring all restaurants within Long Beach who have bundled Kid's Meals to offer water, milk or a 100% pure juice beverage that is under 60 calories as the \"default\" choice.": [
        "'speaker_1': 'Wow. Congratulations. Congratulations. Now we'll move on to item number ten with a clerk. Please read item number ten.'",
        "'speaker_0': 'Communication from Councilmember Pearce, Councilwoman Gonzalez, Councilman Andrews and Councilmember Your Honor recommendation to request the City Attorney and Department of Health and Human Services to draft an ordinance requiring all restaurants within Long Beach who have bundled kid's meals to offer water.'",
        "'speaker_1': 'Well, I'm sorry. Just just for a moment, we're going to take a two minute recess just so people can we'll just take a 20 minute recess. All right. Thank.'",
        "'speaker_2': 'The organization.'",
        "'speaker_1': 'Okay. Madam Clerk, let's call the council meeting back to order. Please call.'",
        "'speaker_0': 'Councilwoman Gonzalez. Councilmember Pearce. Councilwoman Price. Councilmember. Super Now. Councilwoman Mongo. Councilman Andrews. Councilmember Urunga. Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_1': 'I am here. Let's have item number ten, please.'",
        "'speaker_0': 'Communication from Councilmember Pierce, Councilwoman Gonzalez, Councilman Andrews and Councilmember Your Honor. Recommendation to request the City Attorney and Department of Health and Human Services to draft an ordinance requiring all restaurants within Long Beach who have bundled kids meals to offer water, milk, or a 100% pure juice beverage that is under 60 calories.'",
        "'speaker_4': 'As the default choice.'",
        "'speaker_1': 'Councilman Pearce.'",
        "'speaker_0': 'Thank you. And as you can tell by the empty left side, this is the easy item. We'll try to make it smooth tonight. And I want to thank all of those that are here tonight to speak on this item that have been doing a lot of hard work on this, not only with my office, but with the'",
        "'speaker_0': 'community members and the small businesses doing great outreach. So thank you so much for that. Before we move forward to the presentation, actually, I'll do the yeah. Before we move forward to the presentation, I want to make an amendment to the recommendation.'",
        "'speaker_0': 'So that amendment should read to request the City Attorney and Department of Health and Human Services to draft an ordinance requiring all restaurants within Long Beach who have bundled kids meals to offer water or milk as the default choice.'",
        "'speaker_0': 'No, you got that. I think that that was pretty easy, just removing a part of that. So I'll explain that as we go through the PowerPoint. And then I want to hear from community members and then we can take it behind the dais.'",
        "'speaker_0': 'Okay. So obesity is an epidemic in our community with more than 2 billion adults and children around the world who are obese or overweight, that's equal to one third of the world's population carrying excess weight with help of our Department of Health and Human Services, the Los Angeles County Department of Public Health.'",
        "'speaker_0': 'We were able to study Long Beach residents, but among adults, 31% are obese, 37 are overweight by children between the ages of two and five are overweight or obese. 27% of fifth, seventh and ninth graders are considered obese.'",
        "'speaker_0': 'The Food and Drug Administration recommends that people age three and older should consume more than no more than 12.5 teaspoons of sugar added each day. Our problem here in Long Beach, most recent adult numbers that we have is that over the past 30 years, obesity among adults and children has increased nationwide.'",
        "'speaker_0': 'So for California, we have adults at 25%, fifth graders at 40%. And in Long Beach, the number is 25% for adults and 44% for fifth graders. Approximately another 30% of children and adults are overweight as well as dental health.'",
        "'speaker_0': 'So some of you guys might not know. I worked at a pediatric dentist office for, I don't know, six years. My aunt is a pediatric dentist and I got to help assist. And so I personally saw the effects of sugary beverages, particularly juice that was impacted on children because juice is higher in sugar and calories, water and'",
        "'speaker_0': 'milk are always the best options for your little one. This is from the Association of Pediatric Dentist. In fact, a child under one years old in a pediatrics academy suggests completely removing juice from their diet. And there are some other recommendations around juice, but it basically says that it should be minimal.'",
        "'speaker_0': 'And often with, you know, my daughter Jubilee, who's five, if she has juice, it's half water, half juice, because we see a lot of times people believe that juice is healthy for you, but it completely takes away the enamel on your teeth.'",
        "'speaker_0': 'And we know whenever your dental health is impacted, it can get into your bloodstream and have a really negative impact on children. So for that reason, we removed the juice from this motion. The risk of sugary beverages among children.'",
        "'speaker_0': 'Sugar sweetened beverages are single, largest contributor to caloric intake. I'm so tired. I can't believe I'm doing this at 930 at night. Children who drink at least one sugar sweetened beverage per day have 50, 50, 55% greater odds of being overweight or obese.'",
        "'speaker_0': 'So the consumption clearly doubles the risk of dental cavities for children. Once they are obese, then children have increased risk of type two diabetes, heart disease, asthma, sleep apnea, social discrimination, tooth decay and poor academic performance. So we definitely want to make sure that we are doing everything that we can as a community to prevent that from'",
        "'speaker_0': 'happening. We want to provide healthy choices to make it easier for children's and parents to make healthy food choices by creating environments that support healthy habits. Audience Requiring that all restaurants with bundled kids meals to offer milk or water parents will still have an option to choose other beverages upon request.'",
        "'speaker_0': 'We know we have over a thousand restaurants in the city and about 209 of those restaurants actually provide bundled kids meals. So this isn't something that is, you know, broad and would tackle every business in the community. We also know that other governing bodies like Santa Clara, Stockton, Paris and Davis have implemented this as well.'",
        "'speaker_0': 'These guys all agree milk and water should be a first choice. I mean, come on. And on top of these guys, we had a letter today from McDonald's that said that they support our policy. We met recently with Coca-Cola Brand and they talked to us about how they do zero branding at events at parks or anywhere else'",
        "'speaker_0': 'for Coca-Cola products where the children might be present. So even doing something like a soccer club where you might want to have corporate sponsorships, they wouldn't do that because there are kids around. And so if industry leaders in other cities are saying this is the right choice for our community, I think it's time that Long Beach take'",
        "'speaker_0': 'that step, too. Plus, you know, are a little cute kids here. We want to make sure we benefit all the community. Increasing the number of healthy beverages consumed by Long Beach children establish healthy behaviors in childhood that continue for life.'",
        "'speaker_0': 'And create a better future for our children. I'd like to additionally say that we know that while parents are doing what they can at home, a lot of times we go out into the community and we see standards that are normalized.'",
        "'speaker_0': 'That is what we we base our culture off of. And so going to a restaurant where they're saying, water, milk first, water, milk first. It's going to help parents understand that might not have had the education around the impacts of sugary drinks.'",
        "'speaker_0': 'And there is a lot out there. I know that a lot of us feel like kids not having soda is a no brainer. Those six years that I worked at the dentist office, you would be surprised at how many four year olds came in with no front teeth because parents didn't understand the impact, even if it was'",
        "'speaker_0': 'a no sugar soda pop that the the impact it has on our kids. And so I think it's great that we've got other cities that have done this. I think it's great that we have corporate sponsors that have said they're doing it.'",
        "'speaker_0': 'And we had four small beach, small beach, small businesses that were lined up to speak tonight but weren't able to stay as long. So I hope that my colleagues will support this item. I look forward to hearing public comment and getting a nice, robust conversation.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_1': 'Thank you, Councilmember Bianca. Thank you. And I want to thank Councilmember Pearce for bringing this forward. It is long overdue. We've known about the impacts of sugary drinks and the impact they've had on our children. And I really appreciate bringing this forward.'",
        "'speaker_1': 'I was part of a household cohort years back and we dealt with this in regards to the impacts of sugary drinks to children as well as at that time because of this several years ago now. But the number to the growth of fast food chains and how you could see them and course, for example, Long Beach.'",
        "'speaker_1': 'All right, a rule there is a Burger King a with a local, a culture, a subway and the McDonald's. All right, there. Corner where? The corner. So the the the influx and the impact that these businesses have on our health is can be understated.'",
        "'speaker_1': 'And your report right now really stated that. So thank actually the point. I wholeheartedly support this. Thank you. Councilmember Andrews us. Thank you, Vice Mayor. Also, I'd like to thank Councilwoman you to.'",
        "'speaker_0': 'Hear from me.'",
        "'speaker_1': 'Oh. Oh, no, no, no. Okay. All right. So we're going to take public comment first.'",
        "'speaker_0': 'And while we're waiting for public comment, I would like to say how much I appreciate the work that the vice mayor did on this item before it fell into my hands.'",
        "'speaker_1': 'I don't know what you're talking about. Thank you. You have 3 minutes. Thank you. Wow, 3 minutes. Thanks. Chef Paul Buchanan have a business here. And I've also been teaching at the at some of the Columbia schools about days of taste, which a child learns from.'",
        "'speaker_1': 'About food and nutrition. From three main places. One at home. Two at school. And now from TV and social media ads. So children are going to school to have chocolate milk with sugar added with salt added to the chocolate milk.'",
        "'speaker_1': 'I don't think that's a really great, healthy choice. So I hope that's not going to be included in the milk that can be offered to promote soda and sunny delight, which is not really an orange juice. It's just it's just the food coloring and sugar water at home.'",
        "'speaker_1': 'We can only hope that a beverage can be given to our child that is not laden with sugar or food coloring or phosphoric acid like Coca-Cola. So that being said, I'm happy to see that you're proposing that we encourage them to have something water.'",
        "'speaker_1': 'I don't know why you took away the juices, because I think lemon juice and two teaspoons of sugar and water would be 60 calories. That would be much more healthy than some of the other sugary drinks. So I think that would be a great option.'",
        "'speaker_1': 'My child in 16 years has never really ever had a soda at the at any place because she hasn't bought any of those packaged meals because they are usually fried food. And that's not what we really encourage because there's no vegetables usually involved.'",
        "'speaker_1': 'But thank you for for your efforts. And I think this is a good direction for us. Thank you, chef. Paul, just a moment. Councilmember Pearce has a suggestion for public comment.'",
        "'speaker_0': 'Oh, you can put it on me. Oh, I'm okay with reducing the public comment time since it's ten 930. Are you guys good with that? So you guys want to do a minute and a half in one minute.'",
        "'speaker_2': 'All right. All right, guys.'",
        "'speaker_1': 'Let's see now. Support, we're going down to one minute. Lightning round.'",
        "'speaker_0': 'Thank you for self-regulating.'",
        "'speaker_1': 'You have the floor.'",
        "'speaker_0': 'Hello. My name is Chu Irrational and I live in District eight and I've lived in Long Beach for 27 years. I also work as a health education education advocate at the Choices Clinic. I am here to speak in support of the Healthy Kids Choice Ordinance.'",
        "'speaker_0': 'I am pre-diabetic and I have made many lifestyle changes to ensure that I do not become diabetic. Cutting out sugar sweetened beverages such as soda is one of the lifestyle.'",
        "'speaker_5': 'Changes that I have made. I am also.'",
        "'speaker_0': 'Pregnant. I am looking forward to becoming a first time mom. I know that is. It is very important for me to continue to set a good example for my children and make sure that they do not become diabetic.'",
        "'speaker_0': 'I know that I can control the items that are in my home, but it is much harder to control the temptations that my kids may be exposed to outside of the home. By making the healthy choice the first choice, my children will have less, one less temptation to face.'",
        "'speaker_0': 'Thank you very much for your consideration. Considering this item tonight, please make the right choice and vote yes.'",
        "'speaker_1': 'Thank you. Thank you for your testimony. Next speaker, please.'",
        "'speaker_2': 'Good evening. My name is Joyce Flynn Adams. I'm a member of Long Beach Alliance for Food and Fitness LeBoeuf.'",
        "'speaker_5': 'I support this. We have gathered over 250 signatures in three different languages from Long Beach residents supporting this measure. All of them support the adoption of a healthy drinks and kids meals ordinances in the city of Long Beach.'",
        "'speaker_5': 'So the city council members, city officials, we thank you very much for this opportunity and we hope you'll vote for this.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_4': 'Vice Mayor Richardson and council members. My name is Claudia Gauthier. I am the government relations director for the American Heart Association. I want to thank you for your leadership in bringing this item forward.'",
        "'speaker_0': 'And part of my work has been.'",
        "'speaker_4': 'To talk to the community, talk to businesses, talk to all of you about the goals of this ordinance and and your leadership and bring this forward is is much appreciated. As stated by Councilmember Pearce.'",
        "'speaker_0': 'This effort will help.'",
        "'speaker_4': 'Reduce the amount of sugar kids consume. It's going to help parents access that same environment and same messaging that kids get from then from home and in school. So let's adopt this and make healthy options. The first default for kids in Long Beach.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please. Good evening, Vice Mayor, City Council, City Staff, everyone.'",
        "'speaker_2': 'My name is Alfred.'",
        "'speaker_1': 'Montoya with Public Health Advocates and the Healthy Eating Active Living Cities Campaign. I manage our Heal Cities campaign here in Southern California, and as many of.'",
        "'speaker_2': 'You know, Long Beach joined the campaign.'",
        "'speaker_1': 'In 2012, committing to making the city a healthier place. And today's discussion about the healthy default drinks and kids meals is right in line with that healthy eating, those healthy eating efforts. And I'm here today on behalf of my organized organization, Public Health Advocates with along with these folks from the Long Beach Healthy Kids Choice Coalition to'",
        "'speaker_1': 'speak in strong support for tonight's item. By voting yesterday, you're saying you want to make the healthy choice, the easy choice for young kids in the city. And you're shifting norms so that when you think of that drive through and the nagging child in the back, that that first option is going to be water or milk, right'",
        "'speaker_1': '. Very simple, but beautiful idea. I think so. I applaud you all for taking leadership. Being the first in L.A. County to look at this ordinance. And I want offer myself and my organization for support for next steps. Thank you very much.'",
        "'speaker_1': 'Please vote yes. Thank you. Next speaker, please.'",
        "'speaker_5': 'I think this is a great idea, but I would ask if you could also include the schools, not just the restaurants. Have them just offer the water, milk or 100% pure juices. And Long Beach Unified School Districts is what you have governance?'",
        "'speaker_5': 'Well, they're separate entities. However, I think that they should also be included in a conversation for them to.'",
        "'speaker_2': 'Join this recommendation.'",
        "'speaker_1': 'Thank you. Thank you for your time. Next speaker, please. When I was Leslie Wilks, founder CEO of Little Enterprises 2016, rolled out a happy, healthy mind and body program. I'm also an author of children's books, and these are the first two books that we came out with Eating Bad for Good Health and Eating Backwards to move Forward'",
        "'speaker_1': 'is the first two of a series of six books. 2017 we start. We moved over to consulting, which we are targeting our school districts, also any youth organizations. And we came out with a series of many books and it's the first book that we came out with is Why Is My Sugar So Sweet?'",
        "'speaker_1': 'And it talks about sugary drinks. The effects of the has is brief and to the point how much sugar are in these drinks, how much are needed for the body, and what the effects are on the youth? And we are here to offer our assistance any way we can to the sea Long Beach with our book program'",
        "'speaker_1': '. And we have another book coming out, check and see what's inside of me. And all of these are children's books that are focused from the age of five and up for the illustrated books. Thank you. Thank you for your time.'",
        "'speaker_1': 'Next speaker, please.'",
        "'speaker_5': 'Good evening. Hello. My name is Jennifer Pond. Say hi, Janine and I am here to speak in support of Healthy Kids Choice Ordinance. I live in Long Beach and District eight with my ten year old son and husband and have worked at the Children's Clinic for the past 17 years.'",
        "'speaker_5': 'I see how hard I have seen how over the overconsumption of sugar sweetened beverages have affected my neighbors, my friends, my families and community members throughout Long Beach. I see how hard parents work to provide a healthy home environment for their children while managing family and work responsibilities from one or two jobs.'",
        "'speaker_5': 'For many busy parents, keeping up with everyday circumstances is difficult, and we often turn to outside food as one of those parents restaurants that offer healthy beverages for my son as a first a possibility and not as a last possibility is helpful.'",
        "'speaker_5': 'It's supportive. It's a it's a way to let us parents know that we're supported and that our community supports healthy beverages. Lastly, I just want to thank you for beach streets, uptown, the.'",
        "'speaker_1': 'Streets.'",
        "'speaker_5': 'Up, and it's a great event and I'm looking forward to riding our bikes. Fantastic on Atlantic thing.'",
        "'speaker_1': 'Make sure you make your way to the village first. Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening, Dr. Jessica Schumer. I'm a pediatrician.'",
        "'speaker_4': 'I work in District one at the Children's Clinic and a resident of District three.'",
        "'speaker_0': 'Honestly, I think medical.'",
        "'speaker_4': 'Residency was easier than city.'",
        "'speaker_0': 'Council just putting it out there. So, you know, it's pretty it's pretty simple. Sugar is killing us. Actually, the most.'",
        "'speaker_4': 'Recent recommendations are less than 25 grams a day of sugar for kids.'",
        "'speaker_0': 'Which is a can of coke is about somewhere between.'",
        "'speaker_4': '40 and 50.'",
        "'speaker_0': 'So I would say this is one.'",
        "'speaker_4': 'Step and is a no.'",
        "'speaker_0': 'Brainer. It's less than 50 for us adults.'",
        "'speaker_4': 'Just ask why.'",
        "'speaker_0': 'But the American Academy of Pediatrics absolutely supports this recommendation. And juice, no matter what.'",
        "'speaker_4': 'Is is not healthy either.'",
        "'speaker_0': 'So sugar is killing us. We have to do something about it.'",
        "'speaker_4': 'And I need your help. I counsel about this every single day to pretty much every single patient and their family.'",
        "'speaker_0': 'So they can make informed decisions.'",
        "'speaker_4': 'But we need to have just common sense legislation to support healthy environment so that kids can thrive.'",
        "'speaker_1': 'Thanks again. Fantastic. Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, everyone. I'm the director of communications for Pizza Rev. Surprisingly, I'm speaking in favor of the ordinance.'",
        "'speaker_0': 'We are a build your own.'",
        "'speaker_4': 'Pizza concept that has grown to 20 locations.'",
        "'speaker_0': 'Including one at the Long Beach Town Center.'",
        "'speaker_4': 'We have always been committed to giving everyone options to meet their dietary needs.'",
        "'speaker_0': 'And we know that.'",
        "'speaker_4': 'When it comes to kids meals, we're.'",
        "'speaker_0': 'We're putting a lot on parents to make good decisions. And so we've actually always.'",
        "'speaker_4': 'Had milk and juice that only has 40 calories as the default option as part of our kids meals.'",
        "'speaker_0': 'So we support, you know, improving the health and.'",
        "'speaker_4': 'Healthfulness of kids meals served by all restaurants.'",
        "'speaker_0': 'Including in Long Beach.'",
        "'speaker_4': 'And therefore are in favor of the ordinance. And I will be leaving kids vouchers up here for anyone who's still here, who has children.'",
        "'speaker_1': 'All right, help yourself. Yeah, let me have one.'",
        "'speaker_0': 'Thank you, guys.'",
        "'speaker_1': 'Next speaker, please.'",
        "'speaker_0': 'Good evening. My name is Natalia Kabaka. I live in the fourth district. I'm a proud parent of five year old. I'm Vizsla Buff, and I also volunteer for the Headstart Preschool Program, as well as a policy conference as well as in the classrooms.'",
        "'speaker_0': 'And while hoping during the classrooms the headstart serves low fat milk or water to their children and they haven't seen or heard from anyone of them that they're not happy with the choice. They bring their milk, they enjoy it.'",
        "'speaker_5': 'And no one will ever ask that if they want saw the in there.'",
        "'speaker_2': 'Or even juice.'",
        "'speaker_0': 'And in the past few months, I have seen so many parents faces getting excited when they come to know about this initiative. And they have heard from that that I'm always.'",
        "'speaker_2': 'For healthier choices.'",
        "'speaker_0': 'So young children, they usually want what is promoted, what they can go to right away. I was happy to see that some restaurants already supporting this.'",
        "'speaker_2': 'Town.'",
        "'speaker_0': 'Hosted drinks and kids news. And I would ask you, please oppose this proposal. Yes.'",
        "'speaker_5': 'And hope parents of Long Beach too to grow up healthier kids.'",
        "'speaker_1': 'Thank you. Testimony next speaker, please.'",
        "'speaker_11': 'When I started.'",
        "'speaker_1': 'Almost double the time.'",
        "'speaker_11': 'I mean, I'm kind of in check on a point on this thing. I mean, they started the NSF program, this program and medical school committee that thera estao ka sunanda Yosuke brother the ATC because they were not familiar list in front of me that your field commando commander Marcello Laplace Mr. Seahorse near lost in that unknown photo'",
        "'speaker_11': 'Remy Nystrom all of you the city and myself. Lebanon illegally the moochers amphetamine crats.'",
        "'speaker_0': 'Good evening. My name is Carolyn Chacon. I live in the ninth district. I unconditionally support this ordinance because of the medical problems that eating fast food causes. I suffer from diabetes and I come from a family who also suffers from this illness.'",
        "'speaker_0': 'I believe that by eating healthier meals, our children and grandchildren will have a better future. Also, our lifestyle would be better off as well.'",
        "'speaker_1': 'Thank you. Thank you for your testimony. Next being please.'",
        "'speaker_3': 'Here we come in the name of Jesus once again. Okay, this is good and nothing bad about it, but I think more study needs to be done. I saw some documentaries and high fructose corn sirup. Seems to be the mirror seems to be the problem over in Mr. Austin's district.'",
        "'speaker_3': 'I live over it. Well, no, that ain't him in his district. That's Lakewood. We got a fresh and easy over off of Paramount. I went there one day. I hadn't been there for a while. I go there. Boom.'",
        "'speaker_3': 'It's not there. It doesn't divide it. I see. I saw in the documentary how the high fructose corn sirup when it gets in your body. It was made in Japan lab so the body doesn't recognize the sugar, doesn't make insulin, so therefore the liver and the kidneys have to filter it out.'",
        "'speaker_3': 'My ex wife, she needs a new kidney. Everybody's coming down. If you can really do something about. We've got to get that out. Consider when I was a kid, wasn't killing off like that. We weren't highly obese, that high fructose corn sirup.'",
        "'speaker_3': 'So I'd say.'",
        "'speaker_1': 'All right, thank you. So that concludes public comment. And we will now take it behind the railing. Remind the city council that the public did a fantastic job making their comments as they got it down to one minute.'",
        "'speaker_1': 'Let's see if our city council can do the same. Councilman Andrews No. Councilman. Councilwoman Gonzalez.'",
        "'speaker_4': 'Yeah. I just like to say, you know, I'm.'",
        "'speaker_0': 'A mom of a little.'",
        "'speaker_4': 'Two and a half year old and I really appreciate both the medical field as well as the advocates for being here. Joycelyn I, we've talked about many different. Initiative. So I really appreciate it. And I know from my house personally that it is only good when my child has the ability to drink only water or milk.'",
        "'speaker_4': 'And I think for many other kids I remember back about I don't know, I want to say about eight years ago, I actually walked the first District from parks. We started at a park and we walked to the nearest food establishment.'",
        "'speaker_4': 'And on the way to the from the park to the food establishment, there were billboards advertising unhealthy meals. There are cracked sidewalks. So kids are having a tough time getting places, of course. And then, of course, at the even the little convenience stores, healthy, unhealthy food options are right in the front for kids to purchase right after'",
        "'speaker_4': 'school. And so I think this is a fantastic initiative. Thank you, Councilmember Pearce, for bringing this forward and I hope our council colleagues will vote in support.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'I would just like to make a friendly to add back in juice up to 40 calories. So I know you said no to the 60 calories. We have a business who's already making good choices and proactively doing the right thing in the community.'",
        "'speaker_0': 'And so I would hope that we would be able to thank them and use them as an example and allow them to maintain themselves. I'd like to hear from the from my my colleagues first. Sorry.'",
        "'speaker_1': 'Councilman Price.'",
        "'speaker_6': 'So I want to thank Councilwoman Pearce for bringing this item to and for taking the lead on it. I know she's done tremendous outreach and has genuinely expressed a willingness to incorporate other ideas and concepts into tonight's agenda item.'",
        "'speaker_6': 'And I appreciate that. I will say we do. Several of us here have business corridors in our district, so we wanted to make sure that the businesses were okay. And and I know I spoke with some of you who have been leading this and actually the businesses or most of them very, very supportive of this idea.'",
        "'speaker_6': 'I mean, they they're parents, too. And so it really wasn't something that many of them they couldn't really measure any sort of financial impact that it would have. And so I was very pleased to hear that and the support of the majority of the folks I spoke with and my business community.'",
        "'speaker_6': 'And I appreciate the folks that are bringing this forward because you did your own outreach, which was really fantastic. You went and you talked to business leaders and business communities and educated them about the benefits. And that really helps us a lot on our end, because then you've already done that work of educating them and letting them'",
        "'speaker_6': 'know what the options are. So I really appreciate that and I'm happy to support this item. And again, I want to thank my colleague for bringing it forward.'",
        "'speaker_1': 'Thank you, Councilman Austin.'",
        "'speaker_3': 'Thank you. And I'll support this motion. I've been a long time champion and believer of healthy options and choices, particularly for here at the city. I'm not exactly sure what happened to our efforts to do that. We'll have to get a report back.'",
        "'speaker_3': 'But healthy children grow into healthy adults. I think most of our businesses are actually doing this already. And so this is, I think, just a great step. And I'd like to see us do this even further for to encourage a healthier living for for all of our residents.'",
        "'speaker_1': 'Thank you. I'll have my comments here before Councilmember Pearce closes it out. Obviously, this as this has my support. You know, five years ago when we when we passed a resolution become a heel city, we looked at the landscape and what this look like.'",
        "'speaker_1': 'And the politics were very different. And today you've seen that McDonald's and others have embraced this. And it makes a lot of sense. And frankly, you know, eating healthy shouldn't have to be the choice. That should be the standard.'",
        "'speaker_1': 'Eating bad should have to be the thing that you think about. Right. So we have to sort of rework how we sort of retool and break these cycles that have happened for generations about bad eating. So this this has my, my, my strong support.'",
        "'speaker_1': 'And congratulations, Councilmember. This is a great item for Councilman Pearce.'",
        "'speaker_0': 'Thank you. I do want to apologize for running through the presentation kind of quickly. When I sat down, I had ran upstairs and run back downstairs. And so I definitely want to make sure we recognize that you guys really did a lot of the work when I first came into office a year ago.'",
        "'speaker_0': 'I spoke with a couple of my colleagues who had met with you guys, and we decided to start working on this. And when we talked about the businesses, we said, Well, we've got to do business outreach, you know, and you guys really did it.'",
        "'speaker_0': 'We mapped everything. We worked with our health department and really went out there and engaged with residents and businesses in the right way. And so I want to really just applaud Claudia, Alfred, Katy, you guys have really been fantastic.'",
        "'speaker_0': 'I also want to say how much I appreciated Kelly and our very own health department on this, and I wanted to just hear any last thoughts from you, Kelly, because I was going to call on you earlier, but I just went right on through.'",
        "'speaker_0': 'Go for it. Okay. My right.'",
        "'speaker_2': 'Is that at the time that we have been participating in this partnership as part of the outreach and the design, and.'",
        "'speaker_1': 'We are in full support.'",
        "'speaker_2': 'Of this effort. So thank you.'",
        "'speaker_0': 'Thank you. In in reference to the friendly, I don't think I'll be accepting the friendly because I feel like, you know, sometimes we craft policy and we fear about which side is going to support us and which side isn't.'",
        "'speaker_0': 'I feel really confident that the businesses we've reached out to feel good about the choice without juice. That's what we talk to the businesses about up until the very last minute. And so knowing that knowing that the Pediatric Association and the Dental Association all say we need to reduce juice as much as possible, I feel like it's'",
        "'speaker_0': 'the right choice for our families. And because it is a choice and not a ban, that it's the right move to make. So I hope that you guys will vote in full support. Thank you. I want to thank my colleague for for trying to engage on it.'",
        "'speaker_0': 'I just feel like the work has kind of been done for a long time and that it's the right vote. So thank you.'",
        "'speaker_1': 'Councilman Longo.'",
        "'speaker_0': 'I urge you to reconsider. I mean, the work has been done, but that doesn't mean that it's 40 calories. It's a small amount and it's 103 calories. It's not a milk. It's not about the calories. Stacy went on mango.'",
        "'speaker_0': 'When we talk about juice on our on our teeth, we talk about decaying teeth. We talk about it eats away. It's not necessarily a calorie intake, 40%. Or 40 grams. And when I hear from doctors that say they don't recommend it at all, I want to I want to govern based on that.'",
        "'speaker_0': 'You know, it's a choice. It's not a mandate. You can say, I want juice. It's first choice. So if you if you go in and you say, I want to order this, you know, this kid's meal for my daughter, and you forget to say, Oh, I'll have a Coke with that, then the worker is going to say'",
        "'speaker_0': ', Well, would you like milk or water with that? If you say No, I'd rather have apple juice, then you can have apple juice. So you're saying that on the menu it can show all three options. It'll have all the beverages somewhere else.'",
        "'speaker_0': 'But yeah, it's. What if you forget to offer something?'",
        "'speaker_3': 'That's the question.'",
        "'speaker_1': 'I excuse me. The conversation, the orientation behind the rail.'",
        "'speaker_0': 'To make sure they have a choice. This is about choice. That's saying first healthy choice student. They could still order whatever they want to have to drink for their kid. I just feel like we have businesses who have proactively make it made steps to move in the right direction and now they're being subjected to additional regulations.'",
        "'speaker_0': 'And I feel that this I don't want to go into the details of it not being comprehensive, but I appreciate that doctors make recommendations. I appreciate that there's a best case scenario. I also appreciate the option for free choice and the ability for a community to make their own decisions.'",
        "'speaker_0': 'And they can say, honestly, sorry, and quite honestly, there are people who have had a terrible sugar upbringing and still seem to have excellent teeth and excellent gums and excellent athletic ability and are below the average weight of people of their height.'",
        "'speaker_0': 'It's a very comprehensive option and I'm just asking for a small friendly and I am very disappointed in the decision because I appreciate that there's 25 of you here who've done a lot of work and there are a thousand businesses in our community who may choose not to have kids meals.'",
        "'speaker_0': 'You've already taken out the main component of the original driver of the motion, which was that items I'm sorry, that packaged children's items were incentivized by toys. You already eliminated the toy component and made it food groups as a whole.'",
        "'speaker_0': 'And so I'm I'm shocked that there would be no option for compromise. I've even asked for it to be a lower calorie count and. Thank you anyway.'",
        "'speaker_1': 'Councilmember Sabrina. One of the speakers tonight asked about the school district. I just went online and I wanted to ask staff if you have any coordination with the school district because they offer 100% free fruit juice with their meals and milk.'",
        "'speaker_2': 'The school district has their own policies and to the day set, they set that structure. So we will if this when this goes through if this goes through, then we'll continue to have those conversations. We do a lot of health, education and nutrition eating.'",
        "'speaker_2': 'We run community gardens, all those kinds of things. But we would after this conversation tonight, we would continue to have that conversation with the school district.'",
        "'speaker_1': 'Okay. Thank you. Councilman Austin.'",
        "'speaker_3': 'Just have to ask the question. And this may maybe for the city attorney or health department. But if a restaurant is found to not be in compliance with this ordinance, what would be the consequence?'",
        "'speaker_2': 'So it is at this stage, the Environmental Health Department is it's doing its restaurant inspections will be adding a box as to whether it's complying with this. And they may be utilizing, as they do.'",
        "'speaker_1': 'For other times when it's safe from real safety issues. They do a lot of education around why things.'",
        "'speaker_2': 'Are needed to it, to actually an opportunity for the health department, to the.'",
        "'speaker_1': 'Environment through environmental.'",
        "'speaker_2': 'Health to educate folks about about why this is in place in.'",
        "'speaker_1': 'It would be found, as you know, roads and roads.'",
        "'speaker_2': 'Not taking place and we would be able to circle back in the future. And if every time that we go back after a couple of times in a certain place, then we would start here and.'",
        "'speaker_1': 'Possibly be unfound. But at this rate, this is an educational tool.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilmember council members. You know, I think one of the reasons why I felt passionate about not accepting the friendly is because of my experience of working in a dental office and watching how much damage this does to kids and feeling like this is an item that is about first choice.'",
        "'speaker_0': 'We just went through a three plus hour exercise on compromise. I do hope that we as a council can recognize the work that's been done and the thought that's gone into two policies when they come up here and respecting that that process.'",
        "'speaker_0': 'So I will accept your friendly. At 14 at 40 calories. I think that this is a great policy moving forward and I think that people have done a great job. I hope that we can continue to see milk and water as the first choice.'",
        "'speaker_0': 'And the conversation around use and education is something that I hope, as we do our education campaign and outreach in the videos and things that we're working on that we highlight a difference in between that and water and milk.'",
        "'speaker_0': 'So I accept your friendly.'",
        "'speaker_1': 'All right, Councilman Mondo.'",
        "'speaker_0': 'I appreciate you accepting the friendly, especially because if we're going to have a talk about things like this, where the item published and circulated in the community says one thing, I think it's disingenuous to change it at the dais.'",
        "'speaker_0': 'And so if you weren't going to accept my friendly, I was going to ask that we even delay the motion a week to give the community the opportunity to read the item differently, because there are businesses that make decisions about the things they provide, and I'm happy to still advocate for them not to allow those juices, but'",
        "'speaker_0': 'for businesses that do, I think it's the right thing. And it also did a little bit of research and I talked to Vice Mayor Richardson about this earlier today, that some of our local smaller businesses that purchase bulk products at Costcos and Smart and Finals and the such, there are nearly no juice options under 90 calories that'",
        "'speaker_0': 'are 100% juice available for purchase in bulk, almost none. I walked the aisles, I looked into this and I did it because the item was published to the community in a way that included juice. And so I appreciate you accepting the friendly.'",
        "'speaker_1': 'Thank you. And it seems like the theme of the night is consensus. Members, please cast your vote.'",
        "'speaker_2': 'I think.'",
        "'speaker_0': 'Motion case.'",
        "'speaker_1': 'Fantastic. Congratulations. We will now move on. We've already handled the consent calendar. We've had the public comment. Now we'll take item number nine.'"
    ],
    "Recommendation to approve the Downtown Long Beach Parking and Business Improvement Area (DLBPBIA) Annual Report continuing the DLBPBIA assessment for the period of October 1, 2017 through September 30, 2018; and authorize City Manager, or designee, to extend the agreement with the Downtown Long Beach Alliance for a one-year term.  (Districts 1,2)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you. Number 12. Number 11, please.'",
        "'speaker_0': 'Report from economic development recommendation to approve the downtown Long Beach.'",
        "'speaker_4': 'Parking and Business Improvement Area Annual Report. Continuing the assessment for the.'",
        "'speaker_0': 'Period of October one, 2017 through September.'",
        "'speaker_6': '30, 2018, District one and two.'",
        "'speaker_1': 'Thank you. Staff Report. Our Carmel has a brief one honorable place Mayor and members of the City Council. This item is the annual premier of the Downtown Garbage Parking and Business Improvement Area Ongoing Annual Assessment. The recommended recommended action on this item continues the assessment for another year.'",
        "'speaker_1': 'There are no proposed changes to the basis of assessment nor significant changes in proposed activity. Therefore, staff request that the City Council approve the annual report and continue the levy of the assessment and authorize the city manager to extend the agreement for one additional year.'",
        "'speaker_1': 'That concludes my report. Thank you, Councilman Gonzalez.'",
        "'speaker_4': 'Thank you for the staff report.'",
        "'speaker_1': 'Thank you. PEARCE Councilmember Pierson. Okay. Any public comment on this item saying no members, please cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any subsequent amendments, with Long Beach Community College District, to provide law enforcement and security services, in an estimated amount of $3,102,526, for a period of five years, adjusted annually every year on October 1, for cost increases.   (Districts 5,6)": [
        "'speaker_1': 'Thank you. Can I just make one motion for all the rest? I'm joking. Item number 12, please.'",
        "'speaker_0': 'Report from police recommendation to.'",
        "'speaker_4': 'Execute an.'",
        "'speaker_0': 'Agreement with the Long Beach Community.'",
        "'speaker_4': 'College District to provide law enforcement security services and an estimated amount of $3,000,102. 526 districts. Five and six.'",
        "'speaker_1': 'Thank you. And this motion. District five and. Okay, fine. All right. It's been moved and seconded. Any public comment on this item? Larry. Good. You while I support this item. I think it's good to keep in mind. And it's a reminder, though, notwithstanding the good effort the police department have, the ranks, the numbers of the police are'",
        "'speaker_1': 'down at a all time low. And it's going to be, what, 3 to 4 years before we're back up there. And it what sharpens. This is what happened on the blue line two days ago. Which was I? One of probably the worst experiences I've seen when the train left.'",
        "'speaker_1': 'PCH for Willow took about six and a half minutes and there was a very violent in terms of conduct and language mail attacking verbally and walking back and forth and threatening or using language, in your words. That has never crossed my lips or anybody I know of.'",
        "'speaker_1': 'And that continued on. And it's a matter of record. I've called the MTA, wrote rid of written a letter. It call also the police. Right then there was no police on the station at PCH, none at Pacific Coast Highway, none in Willow.'",
        "'speaker_1': 'When the train pulled into Willow, I walked up to knocked. I left one part of the car, walked up to the front, took the bike, walked up, knock on the door. The driver asked him to call the police and his response was and he had heard that and he said, well, he hasn't hurt her yet has he'",
        "'speaker_1': '. So forth. And I suggest I told him to call the police. He would not. And I told and this is going to be your last day of work. If that if he didn't do that, that underscores the need of addressing the situation and taking the police that we.'",
        "'speaker_1': 'Are assigned to the police to the through line, which we don't have. They weren't there. And more often than not, not not there. Over and above the fact that transit policing is a specialized detail. And this council needs to step up to that fact and realize it and take the necessary steps to return the policing of the'",
        "'speaker_1': 'transit system to the trained professionals under Sheriff McDonnell. And there's the the approach every major city in the world has, i.e., a specialized trained force. To ride the transportation, which very few of these council members ride. Thank you.'",
        "'speaker_1': 'Thank you. So that concludes public comment. Members, please cast your vote.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you. Before we proceed, I move that we reconsider item number 11. And unless someone is second second, the motion to reconsider.'",
        "'speaker_0': 'Is.'",
        "'speaker_1': 'Not yet. We have to vote on the reconsideration. Could somebody second reconsideration? What do you have to say? Vocally, I say okay. Reconsider is not debatable. Right? I'm sorry. The question I have to reconsider. There's a potential conflict of interest.'",
        "'speaker_1': 'We have to vote on the reconsideration before we take the item, correct? That's correct. Okay. So any discussion on the reconsideration saying nonmembers members raise your hand if you're okay with reconsideration of item number 11. Okay. Madam Clerk, it looks like that approved.'",
        "'speaker_1': 'That's unanimous. So let's reread item number 11. And yeah, I remember Linda, please.'",
        "'speaker_0': 'Report from Economic Development Recommendation to approve the downtown Long Beach.'",
        "'speaker_4': 'Parking and Business Improvement.'",
        "'speaker_0': 'Area Annual Report. Continuing the assessment for the period of October one.'",
        "'speaker_4': '2017 through September 30th, 2018, Districts one and two.'",
        "'speaker_1': 'Councilwoman Gonzalez.'",
        "'speaker_4': 'Yes, and I apologize. I didn't I didn't even think about it, but I have to excuse myself. My partner Adam is a member of the DLP.'",
        "'speaker_1': 'Thank you. So we'll give in a moment so she can exit the room. Thank you is removed by Councilmember Pearce and seconded by mongo. Any public comment on this scene? Members please cast your vote.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7080 for improvements of the Daisy-Myrtle Bicycle Boulevard Project; award a contract to Sully-Miller Contracting Company, of Brea, CA, in the amount of $3,932,644, authorize a 10 percent contingency in the amount of $393,264, for a total contract amount not to exceed $4,325,908; and authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments;  Increase appropriations in the Transportation Fund (SR 182) in the Public Works Department (PW) by $4,621,101, offset by grant reimbursement revenue; and  Accept Categorical Exemption No. CE-58-09.  (Districts 1,6,7,8,9)": [
        "'speaker_1': 'Thank you. Councilman, you can return back to the room. I have a number 13 police.'",
        "'speaker_0': 'Report from Public Works, Park Recreation and Marine recommendation to award a contract to Sally Miller Contracting Company for improvement.'",
        "'speaker_4': 'Of the Daisy Myrtle.'",
        "'speaker_0': 'Bicycle Boulevard Project for a total contract amount not to exceed $4,325,908. District's one.'",
        "'speaker_6': 'Six, seven, eight and nine.'",
        "'speaker_1': 'Thank you. Can we have the cruelest and shortest staff report that gets everyone excited and supportive about this item? Craig Back will provide the coolest and shortest staff report ever. Craig The expectations are set.'",
        "'speaker_10': 'Yes. Good evening. Council Vice Mayor Members City Council Lucky number 13. Item 13, this is Daisy Bike Boulevard, which has been in the making for multiple years. And in fact, there were many times when we didn't believe we were going to be able to bring this project forward.'",
        "'speaker_10': 'We had funding issues, we had design issues, we had timing issues. But we all before this council this evening, this is a key bicycle project that will create a 9.5 million 9.5 mile excuse me connection between our downtown and our north town neighborhoods.'",
        "'speaker_10': 'So it will go through the district's named one six, seven, eight, nine, but it starts in two. So we are picking up most of the council districts in our community. We're very pleased to bring this forward. We anticipate, starting with council's approval tonight, we anticipate starting construction in January and finishing in early summer.'",
        "'speaker_10': 'And that concludes my staff report.'",
        "'speaker_1': 'Thank you. Councilman Austin Ferreira will support this motion and this has been a long time coming. And I can tell you that as we've had multiple community.'",
        "'speaker_3': 'Meetings on this.'",
        "'speaker_1': 'Reviewing design, I think this is going to be a great project that.'",
        "'speaker_3': 'Connects an entire city. So I'm looking forward to support it and encourage everybody else to do the same.'",
        "'speaker_1': 'Fantastic. I'll just offer my comments here. This is we've seen this for a long time and a lot of people probably wonder whether this project is real or not. We finally get to answer that question. Looking forward to construction.'",
        "'speaker_1': 'Looking forward to our new roundabout at Harding and Myrtle. Councilwoman Gonzalez.'",
        "'speaker_4': 'Yeah, I want to say thank you to the public works team. This was a long time in the making, and I know.'",
        "'speaker_0': 'A Willmore City representative was here, but I really appreciate.'",
        "'speaker_4': 'You providing us the timeline.'",
        "'speaker_0': 'I want to ask as to.'",
        "'speaker_4': 'I know.'",
        "'speaker_0': 'This is going to.'",
        "'speaker_4': 'The one more city. What about parking in that specific historic district? Is parking going to be an issue?'",
        "'speaker_10': 'Councilmember Gonzales We don't anticipate any are very few parking impacts. There may be some locations where we're adding traffic calming measures. That could be a traffic circle. That could be a roundabout. And that's done to ensure that we are slowing the traffic to make the passageway safe for bicyclists, but would be minimal.'",
        "'speaker_10': 'One, maybe two. I can provide specifics for you in the one more area here and it's great.'",
        "'speaker_4': 'I know we'll be getting.'",
        "'speaker_0': 'About four roundabouts, so we're excited about that. Thank you very much. Great work.'",
        "'speaker_1': 'For roundabouts. Wow. Maybe I should renegotiate. Any public comment on this? Yeah.'",
        "'speaker_3': 'Oh, let me come across one of them.'",
        "'speaker_1': 'Representatives.'",
        "'speaker_3': 'I represent Jesus against a Jewish churchgoing man, man. Yeah. See? Hey, you're right. Anyway, so check out this cool. But I remember that $25 million bike lane thing some months or.'",
        "'speaker_1': 'Whatever that was.'",
        "'speaker_3': 'On me. There we go. Okay. The 25 million bike length. There was a 25 million. That's six, seven months ago. Voted eight nine. Then it was about three, four months ago, 25 million. And that's when I came up here and see the day.'",
        "'speaker_3': 'If you give $500,000 to me, that's why I had my son here that day. And I say, if you give 500,000, the rest will go get some people will paint with brushes and everything. Okay, all of that. That was to take care of everything.'",
        "'speaker_3': 'I was done. Larry Bohlen came up here and said he'd been riding for 70 years in Long Beach and everything, and he was asking, why did you have to spend all this money? So that was 25, another 25, and now we got 4 million.'",
        "'speaker_3': 'So we we took a 54.'",
        "'speaker_1': 'Million for bike lanes.'",
        "'speaker_3': 'And what does it take for bike lanes? I mean, are these.'",
        "'speaker_1': 'Go bike lanes or are they.'",
        "'speaker_3': 'Pay? I mean, come on, man. It doesn't cost 54 million for bike lanes.'",
        "'speaker_1': 'JetBlue lost 2 billion. I'm talking straight up about.'",
        "'speaker_3': 'This even is money and.'",
        "'speaker_1': 'Everything. I'm looking at the repair side.'",
        "'speaker_3': 'Of me because it.'",
        "'speaker_1': 'Talks about all the books for yeah, we want $10,000 for.'",
        "'speaker_3': 'Immigrant Alliance.'",
        "'speaker_1': 'Project 13. Would you say divide number 13? I'm talking.'",
        "'speaker_3': 'About money. I know what it is. I'm saying give me pass because I didn't get seven. As as we talk about buying books for somebody that have speak English and stuff. Well, come on, we talk about put money somewhere else.'",
        "'speaker_3': 'Why don't we just teach.'",
        "'speaker_1': 'People English in school, you know?'",
        "'speaker_3': 'But anyway, this is getting back to the item. Okay. So as far as this, all I'm saying, why all this extra money? We up the money? I know you're not going to answer me now, but I really want to know because really, I mean, out of serious, all this money, 4 million.'",
        "'speaker_2': 'Give me 500,000.'",
        "'speaker_1': 'I'll hook that up. I do it.'",
        "'speaker_3': 'Five and everything. This is costing too much and we need to find another way. I mean, it sounds all good, but this I've been seeing three feet high weeds around Long Beach. I haven't seen a lot but we can do I see methods crack is they need help we need money for other things.'",
        "'speaker_3': 'We're people and we have a lot of projects. I mean, there needs to be not nice. It's nice. I don't want to live in Hawthorne. I don't want to live in L.A. I like Long Beach. It's a nice city, but we got to take care of the people.'",
        "'speaker_3': 'It's too many. I ain't never seen this many white folks on dope in my life, and that scares me because, you know, we'd first get third last get hired. I, I see white folks doing business and black folks and all that no more.'",
        "'speaker_3': 'So we need to.'",
        "'speaker_1': 'Get things right and it's not spend your time.'",
        "'speaker_3': 'Wasting it. Thank you.'",
        "'speaker_1': 'Members, please cast your vote. Councilwoman Pierce.'"
    ]
}