{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing regarding an economic subsidy in connection with a Transient Occupancy Tax Sharing Agreement with Breakers Development, LLC, a California limited liability company, for the property at 210 East Ocean Boulevard, Assessor Parcel Number 7278-007-034, pursuant to California Government Code Section 53083; and   Authorize City Manager, or designee, to execute any and all documents necessary, Transient Occupancy Tax Sharing Agreement, with Breakers Development, LLC, a California limited liability company, or assignee, for the development of an upscale independent boutique hotel. (District 2)": [
        "'speaker_1': 'Thank you. That concludes our presentations. We have two hearings today. We're going to go into our first hearing, which is hearing item number one, and then we'll have our second hearing. So let me turn this over. How can I have a clerk?'",
        "'speaker_1': 'Please read the hearing, please.'",
        "'speaker_0': 'Hearing item. Once a report from economic development recommendations received supporting documentation into the record conclude the public hearing regarding an economic subsidy in connection with a transient occupancy tax sharing agreement with breakers development for the property at 210 East Ocean Boulevard and authorize city manager to execute a transient occupancy tax sharing agreement with breakers development for the'",
        "'speaker_0': 'development of an upscale independent boutique hotel. District two and this item requires north.'",
        "'speaker_1': 'We go ahead and do the oath, please, Madam Court.'",
        "'speaker_0': 'You stand and raise your right hand. You and each of you do solemnly state that the testimony you may give in the court now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_0': 'So help you God.'",
        "'speaker_1': 'Okay. Thank you very much. So let me go ahead and begin by having our assistant city manager, interim city manager, Tom Modica. Go ahead and do the presentation to me.'",
        "'speaker_10': 'Thank you, Mr. Mayor. We will have Sergio Ramirez, our deputy director of economic development, give a presentation about this proposal. Thank you, Tom. Good evening, honorable mayor. Council members. The item before you is a transit agency tax sharing agreement for probably one of the most iconic properties on Ocean Boulevard, a property that almost a century ago opened'",
        "'speaker_10': 'its doors here in Long Beach and as a luxury hotel. But over the years kind of fell on hard times. This item before you tonight is is an opportunity for a new chapter for this property. I have a quick presentation for you.'",
        "'speaker_10': 'So the subject property is located at 210 East Ocean Boulevard. It's a 14 story building situated on approximately 1.15 acre parcel. So by way of background, the Historic Breakers Hotel opened its doors in 1926 as a luxury oceanfront resort.'",
        "'speaker_10': 'Over the years, the hotel experienced changes, changes to the name of the property ownership changes, physical changes, and changes to the use. From 1990, up until 2015, the property was operated as a congregate care senior facility. And as I mentioned, the property over the years experienced deferred maintenance and dilapidation.'",
        "'speaker_10': 'In 2017, Breakers Development LLC, a subsidiary of Pacific Six, a local development company here in Long Beach, purchased the property. The developer would like to reposition the property back to a luxury hotel, the Breakers Hotel and Spa. The proposed development project would include conversion of the existing historic breakers building into a luxury hotel, which would accommodate 185'",
        "'speaker_10': 'well-appointed rooms, averaging approximately 400 square feet. The property would be a full service hotel with a spa, dining and entertainment. There would be over 10,000 square feet of meeting and ballroom space over ten that I'm sorry, over 10,000 square feet of meeting and ballroom space over 12,000 square feet of food and beverage would would provide space for'",
        "'speaker_10': 'a new full service restaurant and bar remodel and reopening of the doors of the famed Sky Room, a new signature rooftop bar and terrace, new ground floor coffee shop along Ocean Boulevard and a brand new destination jazz club venue.'",
        "'speaker_10': 'The project would also include a new beauty salon spa and a new pool deck would be constructed on the third floor along with a fitness center. As part of the Devon project, the developer will be constructing approximately $1 million in improvements to Victory Park, which will include new landscaping and reconfiguring of vehicle access.'",
        "'speaker_10': 'The proposed project will create approximately 500 new construction jobs and approximately 240 permanent jobs. Now, I'd like to just quickly take a moment to share with you some of the renderings of the proposed development project. The rendering before you on screen is an image of the new lobby.'",
        "'speaker_10': 'So this will greet visitors when they come and check into the new hotel. This is a typical guestroom of the new hotel. The image. Here is a picture of the new restaurant in the lobby dining area. This is the picture of the new spa.'",
        "'speaker_10': 'And this is the pool deck which will be constructed on the third floor overlooking the Terrace Theater and Pacific Ocean. And finally, the new and improved Sky Room, which will reopen upon the completion of this project. And the new feature, of course, the rooftop bar in and Terrace, which will have views of from Pacific Power.'",
        "'speaker_10': 'I'm sorry, Palos Verdes to Laguna Beach. The developers proposing a total development cost of approximately $135 million. The high cost of development is due to adaptive reuse of the historic building. The city engaged an economic consultant outside party Kaiser Morton Associates, to conduct an independent analysis of the construction costs and projected operating income.'",
        "'speaker_10': 'Kaiser Marson had determined there was an economic feasibility gap of approximately $37.7 million. The developer has requested a share of the projected transit occupancy tax or what the city would receive. The project is completed. Projected totals to the city because of the construction of the project is expected to be approximately 42 million in 20 years and 73.5'",
        "'speaker_10': 'million in three years. Under the proposed TOT sharing agreement, the developer has asked to receive approximately 13 million over nine years. That would translate to approximately 34% of the feasibility gap. During that period, the city would the developer would save 80% of the total and the city would receive approximately 20%.'",
        "'speaker_10': 'During the nine year period and the assistance would be capped at $13 million. The developer would be required to make a minimum investment of $7.7 million and operate a four diamond rated triple triple A for diamond rated hotel for a period of 20 years.'",
        "'speaker_10': 'And certify annually under eight and have to operate a preferred hotel flag or better hotel. And the subsidy is similar to the same deal that we did for American Life Hotels back in 2017. Staff recommends that city approve the transit occupancy tax sharing agreement received the supporting documentation into the record.'",
        "'speaker_10': 'Conclude the public hearing regarding the economic subsidy in connection with transit occupancy. Tech Sharing Agreement with Breakers Development LLC, a California limited liability company for the property at 210 East Ocean Boulevard. Assessor Parcel Number 7278007034 pursuant to California Government Code Section 53083 and authorizes the city manager or designee to execute any and all documents necessary to approve'",
        "'speaker_10': 'transit occupancy tax sharing agreement with Breakers Development LLC, a California limited liability company or city for the development of an upscale, independent boutique hotel that concludes staff's presentation. Would you be happy to answer any questions?'",
        "'speaker_1': 'Thank you. We're going to do public comment next as part of the hearing order. And so if I call you or your name, please come forward. The first speakers are Jose Soto. Can you stamp's Anna Evans, Goldstein and Jeremy Arnold?'",
        "'speaker_1': 'Those speakers could please come forward as a sotto can you stamps Anna Evans Goldstein and Jeremy Arnold, please come forward. Please. Thank you.'",
        "'speaker_7': 'The City Council.'",
        "'speaker_10': 'Hello. My name is Jose Soda. I work at Hyatt Centric here in downtown Long Beach. I'm here to encourage you to vote for the 13 million for the Breakfast Hotel Project. However, I have a question about why they have not received a similar amount to the American Life Project.'",
        "'speaker_10': 'I'm happy to learn about the project the developer has worked on to make sure that the hotel will include benefits to the environment and community. I am happy about the proposed parking plan that the developer has made and effort to increase.'",
        "'speaker_10': 'Also parks space in the city. The new Tanaka Park and the work being put into the Victory Park will be a great place for my family and me to visit and spend time. The efforts being made to preserve this historic building are good and will be a benefit to our city.'",
        "'speaker_10': 'We need more projects to include community benefits such as these and hope you will accept the 13 million.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening, Mayor Garcia and city council members. My name is Kenya Stamps and I am the associate vice president of sales at the Long Beach Convention and Visitors Bureau. And I'm here along with my senior vice president of sales, Joseph Genesee, on behalf of Steve Goodling.'",
        "'speaker_5': 'He would like to be here tonight, but he had a previous engagement and could not be here. And we wanted to express our support of this project as it as it relates to the city being able to I'm sorry, the convention and visitors bureau being able to acquire more groups, especially citywide.'",
        "'speaker_5': 'We have run into situations where because we don't have an upscale boutique project like this, we are not able to speak with certain groups. And so this is a super important project for us. It will open doors for us that we initially couldn't get into and it's a great project for the city.'",
        "'speaker_5': 'And honestly, we couldn't find a better group of owners that are in full support of the city as well as as their own project. So again, we're just here to express support for this Breakers project. Thank you.'",
        "'speaker_1': 'Thank you so much. Next speaker, please.'",
        "'speaker_4': 'Hello. My name is Anna Evans Goldstein and I am here on behalf of Unite Here Local 11. I'm here to voice support for the 13 million total in total for the Breakers Hotel. Pacific six has made strong commitments to a variety of environmental protections and community serving uses, including mitigating greenhouse gas and noise impacts related to both'",
        "'speaker_4': 'operation and construction. Their commitment to the community has already been realized through partial funding for a newly permanent public park in a park deprived area of the city. The project also includes renovations to Victory Park and as an excellent.'",
        "'speaker_5': 'Example of.'",
        "'speaker_4': 'An adaptive reuse of an historically preserved building. However, I want to raise a concern over the process. The proposal for the Breakers Hotel does not seem in line with previous top agreements the city has negotiated mystifying the process by which the amount before you is reached.'",
        "'speaker_4': 'The American Life Project received an agreement in 2017 of 28.'",
        "'speaker_5': 'Million to close a.'",
        "'speaker_4': 'Feasibility gap of 47 million, making their rebate roughly 57% of the gap. The Breakers Agreement is proposing a cap of 13 million for a 37 million feasibility gap, which is only 34% of what is needed to close the gap significantly less than the American Life Project.'",
        "'speaker_4': 'These two projects are one block away from each other and both slated to be upper scale hotels. If the Breakers Hotel rebate were calculated similarly to American life, the full rebate would be capped at 21 million. So we ask that you approve the 13 million total for this project today, but we urge that this matter is brought'",
        "'speaker_4': 'back before the Council with a more in-depth analysis for the amount being recommended and to award the missing 7 million. The process must be more transparent. Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker and then creative, carelessly. And tonight can be also. Please come up carelessly and to me. Can you please come up? Good evening. My name is Jeremy Arnold. I live in District one. I want to say I'm in favor of the $30 million total t0t for breakers.'",
        "'speaker_1': 'However, like Mr. Soto, Ms.. Evans. Goldstein, I am curious as to why they are not being offered a similar amount to the American Life Project. There's no explanation in the staff report of how the decision was made to determine the cap of $30 million.'",
        "'speaker_1': 'There are no indications that breakers should be receiving or sorry. There are indications on that staff report that Breakers should be receiving more in 2017. Long Beach Engage BRT Urban Economics to prepare a hotel incentive program. Study notes in its survey of California hotel development subsidies that, quote, subsidies for four diamond hotels are typically much higher than'",
        "'speaker_1': 'for three diamond hotels. These subsidies range from 15% to 40% of the total development costs. If we are to take the lowest percentages of this range at 15% of the total development costs of the Breakers Hotel, which is $135 million, the total subsidy would equal 20 and a quarter million dollars in order to be on par with'",
        "'speaker_1': 'the standard for the state. I'm a huge proponent of environmental protections for our city when it comes to development, and I'm happy to see the numerous mitigations. Pacific says six has put in place the on demand energy management system to reduce energy and greenhouse gas impacts.'",
        "'speaker_1': 'The additional employee parking spaces and on site information about transit and ride sharing services to reduce traffic and greenhouse gas emissions and the construction related measures to reduce air quality and noise impacts during the construction phase are strong commitments.'",
        "'speaker_1': 'I urge you to approve.'",
        "'speaker_9': 'The $13 million.'",
        "'speaker_1': 'In total now, but leave you with my question about why they're not being offered a similar amount of totty that was offered to the American.'",
        "'speaker_9': 'Life Project slated. To be built only one block away. Thank you.'",
        "'speaker_1': 'Thank you very much. Next speaker, please. So.'",
        "'speaker_4': 'I carelessly here. I love this project. That building is wonderful. And I'm delighted to see that we're going to invest in that hotel. The economic development subsidy does seem like it's a lot. 80% of the transient occupancy tax.'",
        "'speaker_4': 'I don't object to a businessman wanting to make a reasonable return on investment. I always compare this to my own era in business, and I can tell you that if Boeing couldn't find 10% on their money, it was a no bid.'",
        "'speaker_4': 'So this particular business is looking for 8%, which doesn't seem unreasonable to me. But what I would ask is if the numbers are not as anticipated and if they make more than the assessed calculations that we just went through, can we somewhere in the deal have the ability to recalculate and bring money back to the city?'",
        "'speaker_4': 'So I'd hate to give them a giant windfall profit at our expense. Thank you.'",
        "'speaker_1': 'Thank you. Your last speaker, please.'",
        "'speaker_7': 'So I can face success for president.'",
        "'speaker_10': 'There's a developing trend across the country with.'",
        "'speaker_7': 'The matter of.'",
        "'speaker_10': 'Boutique hotels. Uh, I actually, uh, work at one in downtown L.A. and I have to say. But there is an interesting trend in which. The rise.'",
        "'speaker_7': 'Of boutique hotels, you know, young hip millennials and maybe older generations that want proximity to millennials, you know, so this is the boutique hotel.'",
        "'speaker_10': 'Thing. And I think it's great. The issue is, is when they don't work, because what often happens is a partnership with entities like Airbnb, where they convert hotel rooms into apartment hotels. This is happening currently in, uh, in southern.'",
        "'speaker_7': 'San Diego County as well as Sacramento, Oakland and San.'",
        "'speaker_10': 'Francisco. This isn't a by chance or a coincidence. This is a clearly a, uh, a business tactic used by a lot.'",
        "'speaker_7': 'Of major.'",
        "'speaker_10': 'Developers when the hotels don't work. They do this? Personally, I'm indifferent towards this project as a whole. I think 80% is inappropriate. But for me, if, let's say.'",
        "'speaker_7': 'Karma, I read.'",
        "'speaker_10': 'The report that they had and you know, there's certain stipulations which I think, uh, it goes without saying, the diamond, uh, the rating is that's imperative. But for me, if we going to invest public funds.'",
        "'speaker_7': 'Coming out of Missouri.'",
        "'speaker_10': 'Uh, which was supposedly supposed to be used to maintain a certain number of firefighters and police officers, if we're going to dedicate that money and to.'",
        "'speaker_7': 'Making sure this development occurs.'",
        "'speaker_10': 'I think that there should be some kind of, uh, agreement with, uh, Pacific six that.'",
        "'speaker_7': 'Uh, they can't turn any of these hotel.'",
        "'speaker_10': 'Rooms that they can't fill into Airbnbs. Or if there is the case.'",
        "'speaker_1': 'That they are going to uh.'",
        "'speaker_7': 'Designate a certain percentage of the rooms into Airbnbs.'",
        "'speaker_10': 'That they should also pay an annual.'",
        "'speaker_9': 'Permit per room like any, any other.'",
        "'speaker_10': 'Provider Airbnbs do for the city in addition to the taxes that they're going to pay as a hotel provider. Outside of that, you know, you could do more with the.'",
        "'speaker_7': 'Community benefits, but we'll take what we can.'",
        "'speaker_10': 'Get. Thank you.'",
        "'speaker_1': 'Thank you. I don't have Ms.. Control signed up, but I will please come forward and speak. And we just need a please sign up for the council, so please go ahead.'",
        "'speaker_4': 'Thank you. I'm. Curious as to why. This is being done that the developer claims he needs money for historical restoration of this hotel when they're adding a swimming pool, which was never there before. A rooftop bar and a large circular driveway which is taking part of Victory Park.'",
        "'speaker_4': 'True and true they are. Putting. A new park in another part of town. But the. Coastal Act requires that if you take park land from the coastal zone, it has to serve the people that are in that zone.'",
        "'speaker_4': 'So any restoration of Victory Park should have been in downtown. My biggest concern about this is when the nine years is going to start. If it starts next year, 2020. We are having the Olympics here in 2028. That's eight years.'",
        "'speaker_4': 'So I'm assuming we're expecting a lot of people to come and stay in our hotels during the Olympics, will be losing all of that hotel tax or at least 80% of it. During the Olympics and you're shaking your head.'",
        "'speaker_4': 'Council member Mungo. I hope you'll explain how this doesn't affect the Olympics. I feel that we bend over backwards to help John Molino. Restore the breakers. We've already. Signed a contract with him, and now he wants more. He got part of Victory Park.'",
        "'speaker_4': 'We are subsidizing him to. For seismic. Repairs for community hospital, which he will profit from. I am against taxpayers subsidizing this project. Thank you.'",
        "'speaker_1': 'Thank you. With that, we will conclude public comment and I will move on now to a deliberation from the council council member Pearce.'",
        "'speaker_8': 'Thank you. I want to thank staff a great deal for their work on this. I know that this has been a topic since the company decided to to purchase this building for, I believe, $40 million. Correct. $40 million.'",
        "'speaker_8': 'And so I want to thank staff. I know that they've done a lot of hard work. I want to thank Pacific Six for really being a community partner. And I want to address some of the community concerns and really talk about why this project is a historic moment for this council.'",
        "'speaker_8': 'My work before I got on council was around community benefits. It was around responsible development. The organization I worked for put out a report about subsidies to hotels in particular. We subsidize the Hyatt on city land for $76 million with no strings attached, with no community benefits, with no worker standards, with none of that.'",
        "'speaker_8': 'In about 20 years, the city gave away nearly $1,000,000,000 to developers that weren't based in the city of Long Beach. What we have here is a project that is a cornerstone of our downtown. We have here a project that is a historic building that is gorgeous, that everybody that drives by it wants to go inside.'",
        "'speaker_8': 'They want to experience it. They want to go to the rooftop nest that's been up there. Now we have a developer that not only wants to really invest in it and really protect it and make it shine, but those developers are Long Beach based that we're keeping Capital Local, that we're saying for every dollar we invest in'",
        "'speaker_8': 'our local community, we're going to get a return on that investment for every good job we create that has a living wage. We know we get $3 back in our community for every dollar of that living wage. So what I see here is a project that is invested in parks, that's invested in historic preservation, that's invested in'",
        "'speaker_8': 'its workers, to say we have 200 workers that are going to have standards and a seat at the table. And those workers will likely come from Long Beach community. We know about 90% of Long Beach hotel workers live in Long Beach.'",
        "'speaker_8': 'And so for me, the idea of a community benefit is exactly that. And it is having a partner that is based here that's willing to give back. This isn't a giveaway, though, because this building for many years wasn't a hotel.'",
        "'speaker_8': 'We didn't get any tax dollars returned on that. We didn't get a total return returned on that. So by year 13, we are going to have a return on our investment is not the right number. I know that we've got.'",
        "'speaker_8': 'Yes. By year 13, we will have received back our 13 million that we gave up in the beginning. And so that again is a return back on our investment. I support this project. I do have a couple of questions.'",
        "'speaker_8': 'I know that we have struggled as a city to try to figure out how we wanted to do a total plan, how we wanted to address this, because we know that in other cities they don't just do a T or T share deal.'",
        "'speaker_8': 'They give away the whole house, they give away everything just to try to bring people in without community benefits. So understanding the difference between the American life deal, which I believe was 57% of the gap versus the 34% of the gap.'",
        "'speaker_8': 'Can you explain on that, please, John? Or Sergio.'",
        "'speaker_1': 'Certainly a council member. Yeah. So so the deals are essentially the same from a percentage basis, 80% of TOTY over the first nine years of of the 20 year deal. But when we look at a project like American Life, which estimates to cost a total of 262 million, versus a project that is estimated to cost a total'",
        "'speaker_1': 'of 135 million. The percentages what you put in leads to a different outcome. So ultimately, between these two projects, it's a matter of scale. And so 80% of a much larger number is going to yield a much larger number.'",
        "'speaker_1': 'And in this case, the American life deal will return up to 28 million over that nine year period. The minimum level of construction or investment is 230 million. And as a comparison in this deal, the total over the nine years is 13 million because the minimum level of investment is 70 million.'",
        "'speaker_1': 'So these are vastly different projects in terms of scale, and as a result, they're going to return a different number in terms of subsidy.'",
        "'speaker_8': 'And so in looking at that difference in between the gap, did you guys consider that? Did you have conversations about that, that it wasn't as much as American life?'",
        "'speaker_10': 'I'm just definitely so one of the things originally the developer had requested 80% of total for a 20 year period. And so I think what we had said, because we didn't have doesn't have a policy regarding due to subsidies.'",
        "'speaker_10': 'We looked at the most recent deal the American be that being the American life and and structured RDL based on that framework.'",
        "'speaker_8': 'Okay. As I mentioned, I support this project. I know John and I, we don't always see eye to eye on everything on this project. I wear eye to eye and I really respect the level of community engagement you've brought to it.'",
        "'speaker_8': 'I do want to hear from my colleagues if there's an interest in exploring that next piece of the conversation. But I would encourage my colleagues to vote yes on this tonight. It's a great project and it's a historic moment for the residents, as well as the city of Long Beach.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Next up is Romney. If you could take a few if you'd like. Did you want to make some comments or three questions? Okay. Let me go to Councilwoman Price.'",
        "'speaker_2': 'Thank you. I, too, am supportive of this item. I do have a few questions. The first is, did I read it correctly that there's a 20 year minimum operating period that's required pursuant to this agreement?'",
        "'speaker_10': 'That is correct, Councilwoman. I'm sorry. I may have missed that during my comments during the presentation. That is correct. There is a requirement for the an operating period, a minimum 20 years. Typically, the life of hotels is about 25 to 30 years.'",
        "'speaker_10': 'But essentially what we've done is required a 20 year requirement period for operation to ensure that we're able to recoup our investment, but plus the latter years, which is where we really see kind of the return on investment.'",
        "'speaker_2': 'Okay. And the $70.7 million investment that is part of this agreement on behalf of the developer, is that is there a timeline for that when that investment has to happen? Does it happen before the the occupancy permit does, or is it through the life of the contract?'",
        "'speaker_10': 'No, that that's a great question. And yes, that happens before the occupancy. Once the project construction period is completed, those numbers are certified by an independent third party to ensure that that level of investment has occurred.'",
        "'speaker_2': 'Okay. What happens then at year 15 on in terms of a requirement for ongoing maintenance by the operators to ensure that at that time, when the city is receiving the full top contribution, the hotel is at optimum condition to be able to attract customers.'",
        "'speaker_10': 'Great question. Again. Again, part of the requirements that will be built into the agreement is a requirement for an annual certification of Tripoli's for Diamond certification, Triple A. The Automobile Club has a kind of rates, hotels and whether it's year one or year 30, there's a minimum standard that requires kind of certain level of detail from everything'",
        "'speaker_10': 'from guest experience, service, food and condition of the physical, physical condition of the hotel. If something is off in see, for example, the towels aren't soft enough or you know, the, you know, for maintenance they don't receive that rating of like for diamond.'",
        "'speaker_10': 'And so that is going to be built into our requirement of our hotel, of our of our agreement to ensure that from day 1 to 30. I'm sorry, you're 30. The condition of the hotel is of that of for for for Diamond.'",
        "'speaker_2': 'And and I don't know this because I'm not in the hotel industry, but do they have like an annual audit of the correct regulatory agency? But I guess the the certifying agencies to determine whether they're at that.'",
        "'speaker_10': 'So so Tripoli actually sends out certification. There's a certification that Tripoli conducts. The folks from Tripoli come out and the experience, the hotel, walk through it and experience it and provide that certification and that know whenever you go to a hotel, you'll see kind of at the entrance or lobby it's presented and it's in a prominent location'",
        "'speaker_10': '. And that certification is what we will require to make sure that we are able to then provide our reimbursement of the total.'",
        "'speaker_2': 'Okay. That's great. And I think that the I wanted to some assurance on that because I do know that there are folks who are interested in this high end type of hotel will be will look to resources that will list the hotels in the different parts of the region that are part of a particular hotel group.'",
        "'speaker_2': 'So it's important for me, if we're going to invest in this, that at the time the city is going to take over the full totti, that the hotel continues to be in the condition where people would want to stay in it.'",
        "'speaker_2': 'I'm very excited about this project. I think the fact that it's a historical preservation but yet an update and improvement project is huge for the city. This is definitely an area where we're lacking in the city in terms of services that we offer to visitors.'",
        "'speaker_2': 'And I think we've made so much progress in the city in terms of development and businesses that we're trying to attract to the city that we really need this this type of a hotel. To give folks yet another option for visiting the city.'",
        "'speaker_2': 'I'm very excited about it. I think, you know, historical preservation is important, but also updating the services, the look and what people and meeting the needs of what consumers want is critical for success. So at some point you have to merge historical preservation with reality.'",
        "'speaker_2': 'And I think this this project is going to do that. So I'm grateful for the partnership and I thank staff for your thorough job. And I know several of us reached out today for additional information on this item.'",
        "'speaker_2': 'So I want to thank you for all the work that you did behind the scenes to get us briefed for tonight. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'I will echo Councilwoman Price's comments related to preparation. I appreciate city staff providing the report that was detailed with all the addendums. I think that it's important for us to recognize that investments such as these are also a risk.'",
        "'speaker_5': 'And so we appreciate Mr. Molina taking a risk on Long Beach. He has a track record of being successful here. We appreciate that as well. I really appreciate the detail that we went into related to knowing and understanding the 80% sharing.'",
        "'speaker_5': 'I know I've shared my thoughts with staff, but in the future, as we look towards these opportunities, when you go year by year through the investment to MBS controls question the um, the number could be reached earlier than nine years and the project could cap off because the $13 Million cap could mean that it is achieved in'",
        "'speaker_5': 'five years. It just depends on the success of the hotel. And so with that, we would still be sharing in those revenues. Once that cap is reached, they would all come to the city, and that's a benefit. The other benefit is the property is getting significant improvements and those significant improvements show up on our property tax rolls'",
        "'speaker_5': '. And while we do not get the lion's share of property tax, the County of Los Angeles does. And those are still programs that are are universal to the region. And then a percentage of that, a small percentage of that does come to the city of Long Beach, and we will benefit from that.'",
        "'speaker_5': 'And so if not, but for Mr. Molina's investment, we would be receiving zero. We would just be receiving the old property tax value, which is less than the current property tax value, significantly less should that property not have been purchased.'",
        "'speaker_5': 'So we are already in a better position today than we were under the previous operators and now we have a new revenue source that was not available when it was a senior care facility. And this is just a turning of the time, but with a elegant look back at our history.'",
        "'speaker_5': 'And for that I am thankful and just once again, I appreciate my colleagues and the amount of work that went into this. I know that it is not easy to bring together all these moving parts in a successful way and to do it and to do it in a way that is meaningful for workers.'",
        "'speaker_5': 'The community and history is is really remarkable. Thank you.'",
        "'speaker_1': 'Thank you, councilwoman. Councilman, super now.'",
        "'speaker_9': 'Thank you. Vice Mayor De Andrews could not be here tonight, so he asked me to read a couple of comments on his behalf. So this is from D. Andrews. I support the request of the Breakers Development LLC to be granted a subsidy in the form of a TOT sharing agreement.'",
        "'speaker_9': 'The revitalization and renewal of the Breakers into a luxury boutique, hotel and spa will transform a property that has lagged behind the rest of downtown Long Beach development. This new development will be generating millions of dollars of new TOTTY and creating hundreds of new jobs.'",
        "'speaker_9': 'These are new revenues and jobs the city would not get if the breakers were not redeveloped. I believe that we I believe that we are if we are asked by the developer for assistance in financing and revenues of this project, it is incumbent on the City Council to respond favorably to that request, for it will still guarantee'",
        "'speaker_9': 'US revenue that we would not ordinarily get if this project was not built. And he concludes by saying, I ask for my colleagues support. I'd just like to say that community hospital or Miss Maryland is an investment community hospital was mentioned that got my attention that's in the fourth council district.'",
        "'speaker_9': 'But I'd like to remind everyone that community hospital was built in 1924 and the Breakers was built in 1926. So I'd like to commend Mr. Molina for investing in one of our newer properties. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Richardson.'",
        "'speaker_9': 'Thank you, Mr. Mayor. And I'll be quick. I love this building. I love this project ever since I first heard about this project. I think with our beautiful downtown, we do not have enough rooftop lounges and rooftop venues.'",
        "'speaker_9': 'And this from these renderings, it looks amazing. The pool looks fantastic. But my favorite part is going to the jazz club, and I'm surprised it hasn't come up as much. We love live music. We will be active patrons of this jazz club.'",
        "'speaker_9': 'Separately from that, I like. There's a lot to like about the project and I think we should lift up some of those things. So I know that there's a lot of focus on TLT and Council among them interest in property taxes also.'",
        "'speaker_9': 'There's also sales tax. There's a lot of good things about this. So, Mr. Chrysler, so quickly, could we summarize what is the full picture of new revenue for this that the city will realize on this project?'",
        "'speaker_10': 'Council member, if I may have me answer for Mr. Kessler in your one kind of new revenue, even with the share of total subsidy to the developer, the city is going to be receiving just under 400 $400,000. And then, of course, it escalates in the when once the subsidy burns off, the city will jump to the subsidy'",
        "'speaker_10': '. I'm sorry, the revenue to the city will jump to $2.2 million. Overall, total kind of revenue to the city will be approximately $66.8 million from this property. Even with the subsidy.'",
        "'speaker_9': 'And aside from your staff time to negotiate. This was the city's investment that that. It was a number $66 million over three.'",
        "'speaker_10': 'I'm sorry.'",
        "'speaker_9': 'It was the city's investment. Aside from your staff.'",
        "'speaker_10': 'I think it's just staff time, a consultant staff time to review this and to make sure. And, of course, legal legal costs to review this.'",
        "'speaker_9': 'So aside from soft costs of staff, this this is a strategic investment. It makes a lot of sense over the long term for the city. And is projects like this that we are able to balance our budget, advance more city services, police officers, firefighters, parks, libraries.'",
        "'speaker_9': 'It's because of projects like this. I commend you also commend the developer and everyone who has been involved in this. I also want to say it's great to see that, you know, a lot you know, Councilman Pierce mentioned it.'",
        "'speaker_9': 'This wasn't the way the development took place in the past. You've got business and labor together. The community is happy endorsing a solid project. It makes the choice very, very easy for me. Was that you're going to say no?'",
        "'speaker_10': 'Councilmember One thing I want to mention is that one thing I would just want to clarify that this isn't money that we're actually kind of paying the developer. This is new revenue that is generated from this development.'",
        "'speaker_9': 'It exists clear on that. We've all it cost us nothing, relatively nothing. And this is almost $77 million in revenue over three. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Ringa.'",
        "'speaker_7': 'Thank you, Mayor. Just one quick question. Is there any part of this project that touches the coastal the coastal line, the coastline? It was mentioned before. Well.'",
        "'speaker_10': 'I don't believe this requires a course of development permit. It's just on the outside of the course of development permit area.'",
        "'speaker_9': 'Exactly.'",
        "'speaker_7': 'Well, thank you. But I you know, I have to agree with everybody who's spoken so far, because this meets a lot of criteria. It's a remodel, rebuild. It's bringing in revenue will eventually. It creates jobs. And it has a community benefit.'",
        "'speaker_7': 'What else could we want? Plus, no expense to the city. So I think that when it comes to this project, it's it has a lot more pluses and minuses and I'm told, in support of this project.'",
        "'speaker_1': 'Thank you, Councilmember Pearce.'",
        "'speaker_8': 'Yes, Rex, Councilmember Richardson reminded me you guys have a great music program. Was that in the presentation? I missed it. Did you talk about it?'",
        "'speaker_10': 'We talked a little bit about the jazz club and of course, the venues, but maybe the developer would like to maybe talk touch upon the.'",
        "'speaker_8': 'He's like, I don't want to. I don't want to. I'll just be a having having a Long Beach based company come in and do this means that we're going to have local musicians come in, not only in the jazz venue.'",
        "'speaker_8': 'Right. But throughout. And that we're going to have a connection with our schools. They're going to bring in the high school music guys and come in and they're going to jam for us. I mean, there is a great synergy that we don't have anywhere else in downtown.'",
        "'speaker_8': 'I just want to make sure that that's lifted up so that the press can come and bug you about it later on. It's great to hear my council colleagues thoughts. I'd like to to move forward with the motion.'",
        "'speaker_8': 'Could you also come back with just a deeper dove on the total? So we have an understanding. You can do that. Awesome. Great. That's right. Thank you.'",
        "'speaker_1': 'That concludes council comments. I just want to just add that just more broadly speaking, I've I've obviously been I've encouraged us to think about our TOTTY as a way of attracting and ensuring that big projects and projects of significance could get built within our downtown.'",
        "'speaker_1': 'And I'm really glad that over the last few years, the city has begun using that as a as a mechanism for attracting quality projects. There are cities, some that are just a few miles from here that will provide 100% of Totti to build projects.'",
        "'speaker_1': 'And essentially that's that's not uncommon. And so I think and in some cases not get much out of that for the community or for labor standards. And so I think that to have a project of this significance that would not be happening if it wasn't for the commitment of the team involved.'",
        "'speaker_1': 'And I just want to thank the team for working with us, working with the team to ensure that we not only end up with what is really going to be a spectacular regional draw, but also one that provides support for our environmental goals and certainly our goals as it relate to worker standards and representation for those that'",
        "'speaker_1': 'are working there. So I think those are all things that are very important and I do want to thank the team for for doing that. And the last thing I'll say is there are there are hotel projects in L.A. in the broader state that literally that the hotel just alone, that one project brings in folks from across'",
        "'speaker_1': 'the state and the region because of the quality of the project. That's, for example, it's like the Ace Inn in downtown L.A. And this this project has the potential of being a a a hotel destination, where I think people are going to come in from across the state to visit this this location and enjoy the amenities and'",
        "'speaker_1': 'all the of the experiences that people can have in this space. So congratulations to the team and with that, members will go ahead and Castro votes.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt Resolution continuing the East Anaheim Street Parking and Business Improvement Area assessment levy for the period of October 1, 2019 through September 30, 2020; and, authorize City Manager, or designee, to extend the agreement with the Zaferia Business Association for a one-year term.  \n(Districts 3,4)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you. And we'll be moving on now to hearing item number two.'",
        "'speaker_0': 'Here's an item to report from economic development. Recommendation to receive supporting documentation into the record. Conclude the public hearing and Adobe resolution continuing the East Anaheim Street Parking and Business Improvement Area Assessment Levy for the period of October 1st, 2019 through September 30, 2020, and authorize City Manager to extend the agreement with the SCAFARIA Business Association for'",
        "'speaker_0': 'one year term District three and four.'",
        "'speaker_1': 'Thank you. If I can, please have our acting city manager, Mr. Modica.'",
        "'speaker_10': 'Thank you, Mr. Mayor. That presentation will be given by our economic development staff, Eric Romero. Is there an oath for this one? No. No oath. Honorable Mayor and members of the City Council. The East Anaheim Street Parking and Business Improvement Area, also known as a bid business improvement district, was established by the City Council in 2010, allowing'",
        "'speaker_10': 'for the levy of an annual business license assessment to be paid by businesses located in the bid. City Contractors Aphria Business Association to manage the bid and the Zafira Business Association.'",
        "'speaker_9': 'Board of Directors.'",
        "'speaker_10': 'Serve as the advisory body to the City Council on matters related to the bid. State law requires an annual report be submitted to the City Council by the Advisory Board for the bid. The annual report describes the boundaries, proposed activities and budgetary information, as well as the method and basis for continued continuation of the assessment.'",
        "'speaker_10': 'The 2019 2020 Annual Report proposes no change to the boundaries or the method of leaving the assessment. The proposed activities will focus on marketing and promoting the district and its businesses. Special events, litter abatement and beautification and Business Outreach.'",
        "'speaker_10': 'State law requires that a public hearing be held on the proposed program and assessment. At its September ten, 2019 meeting, the City Council approved a resolution granting approval. The annual report declaring the intention of the City Council to levy the assessments and set today as the date of public hearing.'",
        "'speaker_10': 'City Council shall hear and consider all protest against the assessment program and boundaries as proposed in the annual report. This concludes my staff report and I'm happy to answer any questions. Thank you.'",
        "'speaker_1': 'Thank you. There's no public comment on this item. There's a motion and a second councilmember. Super now.'",
        "'speaker_9': 'I think you asked for my colleagues support. I just had one question on on the name. Originally, he sent a high street. They call it East Asia. That is absolutely not used anymore. Does that have to still be in this document for legal purposes?'",
        "'speaker_10': 'So the name of the Business Improvement District is still officially the East Anaheim Street Parking and Business Improvement Area. That name can be changed. And we'd be happy to connect with you offline to talk.'",
        "'speaker_9': 'To that process. I believe the association would want that.'",
        "'speaker_1': 'Thank you. Thank you. Councilman Price.'",
        "'speaker_2': 'Agreed. And I support everything that Zakaria does. And I think staff for the support that they give. And I think calcium is super not for taking the lead on being the liaison for the city with that organization things.'",
        "'speaker_1': 'Thank you. And with that, there is a motion and a second. So please go out and cast your vote on the second hearing.'",
        "'speaker_0': 'On to Mamasapano. Ocean cares.'"
    ],
    "Recommendation to request that City Council receive and file a presentation on the Century Villages at Cabrillo 2019 Social Impact Report.": [
        "'speaker_1': 'Thank you. I have a time certain that I know his past because the hearings went went long. I want to bring up item 25, which had the first time certain here. You can please have that item up.'",
        "'speaker_0': 'Item 25 Communication from Council Member Muranga Recommendation to receive and file a presentation on the Century Villages at Cabrillo 2019 Social Impact Report.'",
        "'speaker_1': 'Councilmember Ringo.'",
        "'speaker_7': 'Tonight, I am pleased to have representatives from the Villages at Cabrillo, at the Council tonight to provide their 2019 social impact report. The villages at Cabrillo provide a multitude of services to our residents and serve as a model to other cities and agencies for services related to our continuum of care.'",
        "'speaker_7': 'I'd like to invite Ms.. Kimberly Wie, vice president of Resident Services, to present an update on their 2019 social impact report. And I see that Mr. Renee Castro has already lined up to present Southport to the Council. Renee.'",
        "'speaker_9': 'Thank you, Councilman. Mayor. Members of the Council. Thank you so much for having us. My name is Renee Carlstrom, director for Community Engagement. I am not. Can we but I'm going to I'm going to tee it up for Kim to give our report.'",
        "'speaker_9': 'We just wanted to thank the councilmen, the mayor and council for the opportunity to present our 2019 Social Impact report. We're very proud of the work that's been done in this. Tonight, we actually wanted to start with a brief video, just a three minute video to share a little bit about the villages and the work that we'",
        "'speaker_9': 'do there. Of course, as all of you know, we provide housing, bridge housing and permanent supportive housing for on any given night, 1500 formerly homeless people are veterans, families, children. So we're very excited about this work. And we just really wanted we like every year to come and present to the council because and thank you for your'",
        "'speaker_9': 'partnership. We really could not do this work without the work of all the councilmembers. Of course, our council member in the seventh, Roberta Aranda staff. But in particular, we really want to thank the city department, its development services, everything Parks and Rec, Health and Human Services, the police department.'",
        "'speaker_9': 'It's really is a partnership to make this work. So again, I we're going to be sharing a brief video. And then after that, we will have our chair, Dora Soldo, who is the chair for villages at Cabrillo, speak briefly, and then we will have our vice president for resident services.'",
        "'speaker_9': 'Kim, we will present the data. Thank you so much. If we could cue up the video, please. Okay. There is no video. Okay, so I'm going to do it with hand puppets. All right. So I'm going to ask our chair, Dora Hassell, to please.'",
        "'speaker_4': 'Good evening and thank you for having us. My name is Dora Herzfeld, and I have the honor of serving as the chair. Of the The Villages of Cabrillo Collaborative Marzo Executive Director of Comprehensive Child Development. And we are one of the many partners that make up the villages of Cabrillo Collaborative, and I'm joined by a number of'",
        "'speaker_4': 'our wonderful partners. And I think Renee was talking about really partnership and our support of the city for everything that has been offered to us in order to bring this neighborhood alive for people who formerly were experiencing homelessness.'",
        "'speaker_4': 'And for us, the heart really of the neighborhood is the people and the people who have worked so hard to create an environment where well-being and and healing can occur for us as the beautiful buildings go up. We're working on a parallel track to make sure that the experience of the residents is equally thought of and careful'",
        "'speaker_4': 'in terms of the experience we're providing. And I think for us, as the Villages of Cabrillo Collaborative, we say to you that as we get support for these wonderful buildings in this wonderful community, we owe you a service that any resident, any Long Beach resident would be proud to receive.'",
        "'speaker_4': 'And so we're here again to thank you, to let you know that we're certainly meeting our commitment to make sure that every single resident is cared for and is supported in a way that's going to make their quality of life better.'",
        "'speaker_4': 'And we have plans, just as we do have plans for the facility. We have plans for a residence which includes this year a real focus on improving outcomes for children zero five who call the villages at Cabrillo their neighborhood.'",
        "'speaker_4': 'And also to look at the organizational culture of the community to make sure that it's responsive to the needs of the residents in that community. So we thank you again, and we're here to let you know that we are honoring our commitment with our social impact report to you for your investment in our neighborhood.'",
        "'speaker_4': 'And I'll pass it over to Kim.'",
        "'speaker_5': 'Thank you, Dora. And thank you all for The Village. It's a real collaborative standing behind me. I love having a posse. Thank you. Again, my name is Kim WI. I'm the vice president of residential services at Century Villages at Cabrillo.'",
        "'speaker_5': 'And it is my pleasure to present to you our Social Impact Report. Each year I come before you in and tell you how we're doing and this is how we codify our results. This is what all of the all the hard work in the dollars goes into.'",
        "'speaker_5': 'And we present this report each year so that we can show what, you know, all the great work that we're doing. It is a it is a labor of love. It is a ten month project that really brings together all of the data of our partners, both on and off site.'",
        "'speaker_5': 'It includes stories of our residents, great photos and data. It is truly a collaborative process in conjunction with the City Health and Human Services HMAS Team. We definitely could not do it without that. A lot of the data comes.'",
        "'speaker_4': 'From the HMAS.'",
        "'speaker_5': 'System. We also get data from our 14 partner agencies and all of that is put together by Dr. Beth Magee, who is our outside evaluator for the project. I'd also like to, again, as Rene said, thank the city for their ongoing supportive efforts of not only the villages of Cabrillo, but also the process of putting together the'",
        "'speaker_5': 'Social Impact Report, and especially Kelly Collopy, Alison King, Theresa Chandler, Shannon Parker and Ailsa Ramos. We definitely could not do it without them. Each year we look back at our progress and each year, as you've seen the Social Impact Report, you will see that there is a theme this year.'",
        "'speaker_5': 'Our theme is whatever it takes. And those of you that are familiar with the intensive case management or the Measure H funding, you've probably seen whatever it takes in all of the documents throughout the county documents. And so we wanted to put a story behind it and put some real life behind what that really means.'",
        "'speaker_5': 'And so if you read our centerpiece this year, that is all about what our service providers do, what our case managers do to help keep people housed. It is truly a whatever it takes model. We work in partnership with all of our service providers on and off site.'",
        "'speaker_5': 'We work with the residents hand in hand to help move them from homelessness to being housed. That takes a lot. And what that really means of moving from homelessness to housing is to becoming a good tenant, a good resident, paying the rent and being a good neighbor.'",
        "'speaker_5': 'And while trying to manage all of the daily tasks of having your own apartment while trying to overcome all the barriers that got them on the street in the first place PTSD, mental health, substance abuse and poverty and a long life of trauma.'",
        "'speaker_5': 'And so that is that is definitely a challenge that.'",
        "'speaker_8': 'We have met. In 28.'",
        "'speaker_5': '2018, 2291 residents were housed at the villages. Of those 1291 ward permanent supportive housing. And of that, 1200 30% of them entered permanent housing after.'",
        "'speaker_4': 'Experiencing chronic homelessness.'",
        "'speaker_5': 'At Harbor Interface building that opened this year, for example, there are 13 adults with a combined homeless experience of 38 cumulative years, 138 cumulative years. And so despite these challenges, our collaborative and our service providers and our wonderful team, county and city partners, our property management team, and of course, the residents themselves did whatever it takes to'",
        "'speaker_5': 'stay house and succeed. And you can see that in the numbers.'",
        "'speaker_4': 'Did I hit the wrong button? I'll leave that.'",
        "'speaker_5': 'At. 98% of our residents retained housing for six.'",
        "'speaker_2': 'Months.'",
        "'speaker_5': 'And 95% remained. How's after a year?'",
        "'speaker_1': 'And just for I know that the timers not appear, but we've got about three, three and a half minutes left for the presentation. Thank you.'",
        "'speaker_5': 'And beyond remaining housed, which is a huge chore as the own. We wanted to echo what Dora was saying in that there are lives improved in many ways as well. They increased their incomes. They saved in the rents.'",
        "'speaker_5': 'They were happier. They felt safe in their own home.'",
        "'speaker_4': 'They're healthier.'",
        "'speaker_5': 'And most of all, they're. They're living a life of a housed individual now. And so again, thank you so much for exploring our social impact report data. And I hope you have an opportunity to read our centerpiece, which really explains to you the concept of whatever it takes.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. Not somebody, ringa. Councilwoman Price.'",
        "'speaker_2': 'Q I want to thank Councilman Ranga for bringing this presentation forward tonight. I had the pleasure to take a tour with my staff not too long ago, and it's just very impressive the work that's being done there and the community that you've created that so many people call home, and all the different touches that you've put into'",
        "'speaker_2': 'making it feel like home for communities of people who may be in transition and needing the support of not just their neighbors, but also of the folks who oversee and safeguard the operations there to ensure that everyone is comfortable and included.'",
        "'speaker_2': 'So I want to thank you for everything that you do. It's a really fantastic operation that we have right here in the city of Long Beach. I wish more people knew about it, actually. And our our office has been trying to spread the word.'",
        "'speaker_2': 'I think we did our news newsletter article about the villages of Korea in our newsletter a few months ago. And we really appreciate you giving us an opportunity and giving the residents an opportunity to see all about your facilities.'",
        "'speaker_1': 'Thank you, Councilor Richardson.'",
        "'speaker_9': 'Thank you, Mr. Mayor. And thank you, Councilman Ranga. You have a true jewel in your backyard and on the West Side, this social impact report. I look forward to it every year. Rene, I'll tell you, we actually, Jack and we do a social impact.'",
        "'speaker_9': 'We do an impact report in our district modeled after your report. It's clear, it's transparent, it's easy to read. It takes a lot of complex things and boils down to what's all about making an impact. So congratulations to you on that.'",
        "'speaker_9': 'Villages Cambria is only so you know, there are so many things that we could all say, but truly it's a model. It's a model that is recognized nationally. You know, I served on SAG for a long time. I'm first vice president.'",
        "'speaker_9': 'This is the you're the only organization successfully navigated the cap and trade process. Received two awards in the first two years of the Affordable Housing Sustainable Communities Program. And we look forward to future applicants awarding additional projects as we move forward.'",
        "'speaker_9': 'You know, in our last year, I've been there many times in our last tour. I have to tell you, it was just great to see kids playing outside. You don't even see that very often. Just in regular neighborhoods.'",
        "'speaker_9': 'The kids were outside playing in the way that you've overlapped so many services, you know, you see children's clinic, so many services all working together and you've brought the train and mean brought the bus into the site. It's amazing.'",
        "'speaker_9': 'In fact, it's the model for the vision for the the bridge housing facility we're developing in uptown. This is the model to have to point out something in our backyard to be able to take residents, tour it and say this is where we could be.'",
        "'speaker_9': 'It does so much to really build the goodwill and the confidence to turn around that not in my backyard conversation because yes, villages Cabrillo is an amazing space. It has bridge, housing and shelter and all of those things make stand.'",
        "'speaker_9': 'And we need to we to make sure that our residents fully understand what's what's possible in this conversation. So, again, thank you. I really love this report. I'm a big fan of villages, Cabrillo and best wishes. We look forward to many more great years with you.'",
        "'speaker_1': 'Thank you. And got some reports.'",
        "'speaker_8': 'On some member of Richardson stole my talking points. I'm done. No, I'm kidding. I it's really hard not to say echo up here. As a council member, I want to echo their comments saying that you guys are a model.'",
        "'speaker_8': 'I don't know that that comes across as real as it really is to be able to lead not only organizations like yourselves, but to lead the city in this conversation. I think that our city, night and day, where we were ten years ago with how we talk about and and try to problem solve homelessness, mental health addiction'",
        "'speaker_8': '. And that is really because you guys have led the way and demonstrated to us that you can do it in a safe, clean environment that's supportive and that you've got real outcomes. I do not think for a second that the City of Long Beach would have invested as much as we have in homelessness if it was not'",
        "'speaker_8': 'for your leadership. And I want you guys to really know that that's it's not just giving accolades because you guys are a partner that comes and presents to us every year. But I really feel that with my heart that you as individuals have led this organization to be a gem for the nation.'",
        "'speaker_8': 'And so I know that you guys are also looking to purchase properties. My team is working with economic development right now to identify some properties in the Second District that that might be up for sale right now. And so I look forward to those partnership opportunities and just thank you guys so much for putting your heart into'",
        "'speaker_8': 'it. We know that this work takes a lot out of you and your families as well. And so applauding you for that effort. Thank you.'",
        "'speaker_1': 'Thank you very much. We have one public comments and I can only please come forward. CNN. We're going to go ahead and receive and file a report from your anger.'",
        "'speaker_7': 'Thank you, Mary. And I want to thank the staff at the Board of the Villages for being here this evening and present presenting this report. I look forward to it every year as well, because it just shows the progress that you're doing here.'",
        "'speaker_7': 'And you are a gem of the West Palm Beach area and you provide so much, so many very need, much needed services. And just to give a brief description of some of the the assistance that you get from Catholic Charities, U.S. vets, the children's clinic, and the.'",
        "'speaker_7': 'Oh, my God. All right, now we're here and a Project Return Peer Support Network. I mean, those are just agencies that provide a whole other slew of services that you provide there at the at the villages of. You're also expanding.'",
        "'speaker_7': 'I think you have another project coming in with another, what, 89 beds or so? Something like that.'",
        "'speaker_9': '163.'",
        "'speaker_7': '61. I was way off double that. And so, I mean, you continue to expand and you continue to provide great services. And if you don't make. And we take a photo. Wonderful City Council. You're welcome to join me down there if you want.'",
        "'speaker_1': 'Please go and cast your votes in the receiving file, please.'",
        "'speaker_9': 'Thank you. And if I may, Mr. Mayor, I'd like to just introduce a couple more partners. Jessie D'Agostino for the VA critical partner for us, of course, mentioned U.S. vets. Kerry Liggins Thompson, our acting director from the children's clinic, Gina Lee Lawlor.'",
        "'speaker_9': 'Of course, Jaylene Westfall, our.'",
        "'speaker_10': 'Resident services supervisor, and of.'",
        "'speaker_9': 'Course, star herself. So can we just give them a quick hand to mention my boss, our executive director, Steve Coleman?'",
        "'speaker_1': 'All right, please, members, please go to cast your votes.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'I'll send it to you right now.'",
        "'speaker_1': 'Thank you. Yeah.'",
        "'speaker_5': 'You know, I'm like this.'",
        "'speaker_9': 'All right.'",
        "'speaker_5': 'Get a little bit closer.'",
        "'speaker_4': 'If you can. One, two. But I want to add. Thank you.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary with The AES Corporation, to accept and expend a donation in an amount not to exceed $500,000, for the development of a new playground at Channel View Park; execute any documents necessary for the implementation and administration of the project; and   Increase appropriations in the Capital Projects Fund Group in the Public Works Department by $500,000, offset by donation revenue.  (District 3)": [
        "'speaker_1': 'Here we are. We are now doing 34 and then public comment. So Adam, 34 is up next, Madam Clerk.'",
        "'speaker_0': 'Item 34 is a report from Parks, Recreation and Marine Public Works. Recommendation to execute all documents necessary with the AEC as corporation to accept and expend a donation in amount not to exceed 500,000 for the for the development of a new playground at Channel View Park District three.'",
        "'speaker_1': 'Thank you, Councilman Price.'",
        "'speaker_2': 'So I want to acknowledge this major contribution from, yes, a community or corporate community partner in the third district. As for those who don't know, there is a community, a residential community across the street, basically from where ACS operations are currently located.'",
        "'speaker_2': 'And that community has a lot of changes in their demographics. So we're starting to see a lot of younger families moving into that neighborhood. And so the community reached out to us and the council office about a year ago asking if it would be possible to have some playground equipment put there so that it could be a'",
        "'speaker_2': 'more of an active park, because right now it's very much a passive park. So we reached out to ABC and they were immediately gracious and very generous and agreed to help partner with the city to develop this park.'",
        "'speaker_2': 'And Meredith Reynolds has been our lead from Parks Rec and Marine. And I know she's here, but this is a fantastic project and I urge my colleagues to support this project. And, you know, we're not looking for an elaborate playground, but it's enough that it's going to have a community feel.'",
        "'speaker_2': 'And the young kids growing up in that neighborhood will have a place to play.'",
        "'speaker_1': 'Oh, Mr. Market, you want to add anything to that from a staff perspective?'",
        "'speaker_10': 'Think we're good. This is a fantastic project and Ace has been a really good community partner.'",
        "'speaker_1': 'Thank you. I don't have any public comment for this item. And so we're going to go ahead and cast your votes, okay? No, no, that's okay. Councilman Franco, any comments for cancer votes?'",
        "'speaker_7': 'Oh, just always happy to support and, you know, project like where you get free money and a great project.'",
        "'speaker_1': 'Thank you. Please go ahead and cast your vote. I want to think as as we cast our votes as well. Amazing. This is exactly the type of partnership that you want. And just, you know, you know, I'm a big fan of the team over there.'",
        "'speaker_1': 'And so just give them my regards and thank you. This is going to be a huge benefit to the community. But Councilman Price was discussing so a huge fan of the project. Thank you.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_1': 'Great motion carries. Thank you so much. And we're going to go back to public comment, if I can have, please, Bill Orton, Larry Goodhew, a king of fire and Jasmine Pan, please come forward as a first for speakers.'"
    ],
    "Recommendation to request City Manager to work with staff to conduct a red curb evaluation in parking impacted neighborhoods, to find any possible removals or reductions in order to increase available on-street parking spaces while maintaining safety.": [
        "'speaker_5': 'Thank you. And Devin. It looks like he's not here. We will move on to the next item on the agenda. Item 26.'",
        "'speaker_0': 'Item 26 is a communication from Councilwoman Price, Councilmember Peers, Council member, soup owner and vice mayor. Andrew's recommendation to require city manager to work with staff to conduct a curb evaluation in parking impacted neighborhoods.'",
        "'speaker_5': 'Councilwoman Price.'",
        "'speaker_2': 'So this is an item that is at this point narrowly tailored to impact neighborhoods that are parking impacted. And what we want to do is just take a look at our read curves. We're not looking to shorten red curbs or cause any traffic safety hazards as a result of shortening red curbs.'",
        "'speaker_2': 'But we do have some red curbs that really could be evaluated in terms of whether we still need them there, whether they need to be as long as they are. And we think that we can recoup some additional parking spaces if we have the opportunity to conduct a red curb audit in parking impacted neighborhoods.'",
        "'speaker_2': 'I know that where we have a parking impacted neighborhood, being able to get an additional spot or two on a street makes a huge difference for the business corridors and for the multifamily residences that are usually located in those parking area parking impacted areas.'",
        "'speaker_2': 'We also want to look proactively at how we can try to find efficiencies with our current parking configurations in parking impacted neighborhoods. So having our team out there looking at the red curves, evaluating where we can make some changes will hopefully lead to additional recommendations that we can implement in the future.'",
        "'speaker_2': 'I urge my colleagues to support this item that is very much in demand in parking impacted neighborhoods. Thank you.'",
        "'speaker_1': 'Councilmember Pearce.'",
        "'speaker_8': 'Yes, I want to say I support this in concept. I know whenever I first got into office, my staff person, Melton was in the field every single day, auditing every single block we possibly could. I think out of the entire second district, what we were able to get were seven parking spots by shortening curbs, at least out'",
        "'speaker_8': 'of the most parking impacted area. So I support this in theory. I look forward to hearing from staff on cost and recognizing that it's a big undertaking but vitiate any effort to add more parking where it's safe. Thank you.'",
        "'speaker_1': 'Thank you, Coulson, for super now.'",
        "'speaker_9': 'Thank you again. Vice Mayor Andrews apologizes for not being here tonight, but he asked me to read this statement. I would like to thank Councilwoman Price for bringing this item forward because I too have concerns for my residents as it relates to red curbs.'",
        "'speaker_9': 'It seems like recently we're making these curbs longer in places where we are heavily impacted and the impacted areas on our map also seems to be outdated in district six. Anything west of Long Beach Boulevard is congested. Where I live, we miss the impacted zone by just a few blocks, but we too are struggling to find parking'",
        "'speaker_9': '. It amazes me that the permit parking districts that are already established are not even in the impacted areas. My neighborhoods like Wrigley Historic District have both literally and figuratively been driving in circles to find parking. I look forward to I look forward for a path in the right direction.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_6': 'Thank you. And I want to thank Councilmember Pryce and the rest of the council members for bringing this forward. This is obviously a challenge for our entire city, and I wish I could have signed on as well, because we do have some park in impacted areas as well.'",
        "'speaker_6': 'I'm sure that city staff will be be cautious and do their due diligence as they're doing this study. There's also a concern that recently came up from from some of my constituents and neighbors regarding the visibility at the intersections as it relates to red curbs.'",
        "'speaker_6': 'And so I would please take that into consideration as you were moving forward with your study, but I'm happy to support this item.'",
        "'speaker_1': 'Thank you is core. Leslie, please come forward for public comment.'",
        "'speaker_4': 'Okay. With respect to the read curves, parking is definitely an issue in many parts of Long Beach. I spent almost half an hour trying to find a parking place down on Broadway a couple of Saturdays ago. My good luck.'",
        "'speaker_4': 'We'll get you a parking place in some of those areas. I am concerned, however, about losing line of sight at corners if red curbs are removed. The real solutions we should be looking at is that is to focus on getting builders to install adequate parking.'",
        "'speaker_4': 'It is the height of foolishness to do road diets and eliminate parking requirements when the population is multiplying and we are putting up higher density residential and business structures. Please do not relax. Parking requirements. If we do that, we are only benefiting developers, not the community.'",
        "'speaker_4': 'We failed to construct a useful public transportation system in L.A. County, Orange County and Long Beach in the 1960s, when it should have been done. We won't be able to cut back on cars, so we need parking. But the real answer is not red curbs.'",
        "'speaker_4': 'It's making sure that we require it in our zoning. Thank you.'",
        "'speaker_1': 'Thank you. That concludes public comment that I signed up. I know you. You didn't know you had to sign up currently, so please speak.'",
        "'speaker_4': 'Thank you. I agree with everything that Carlos just said. I am concerned about. The elimination of view viewing at an intersection by eliminating the red curbs. What was the purpose of painting the curb red of an intersection if it wasn't so that people could see what was coming?'",
        "'speaker_4': 'I also agree with her on. The. Issue of demanding that builders developers put in more parking in their. Developments. I talked to a contractor and he said, we put in what the city requires. If they required more, we would put in more.'",
        "'speaker_4': 'Just last week, I was at a planning commission meeting where they're building an eight storey and a 23 storey building on third and Pacific. Maybe it was 21 storeys. I know it's big. There is only going to be one.'",
        "'speaker_4': 'Parking place for each unit. This is ridiculous. Everybody has two cars now and some have very many more than that if they have teenagers. This is replacing a city parking lot. And there's no parking on the streets. So that's what you should be looking at to find more parking.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Price.'",
        "'speaker_2': 'You and I just want to clarify a few points because I'm not sure if everybody was reading the same item. We're not looking to remove any red curbs, and we are not looking to jeopardize the public safety by creating traffic hazards.'",
        "'speaker_2': 'This item is directing our traffic engineers to take a look and conduct an audit. And for those who have complained about different things that traffic engineers have done to slow traffic and comment, I think we can all agree that safety is at the forefront of their minds.'",
        "'speaker_2': 'So I look forward to hearing back from them on what the results of their audit shows and again, jeopardizing public safety and traffic safety is not at all any part of this item. And should that be a reality, we certainly won't make any changes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. There's a motion in a second. Please cast your votes.'"
    ],
    "Recommendation to direct City Attorney to draft an ordinance temporarily banning the sale of flavored vapor products in the City of Long Beach.": [
        "'speaker_0': 'Ocean carries.'",
        "'speaker_1': 'Thank you. Now we're doing item 30.'",
        "'speaker_0': 'Item 30 Communications from Councilwoman Price. Councilwoman Mango Vice Mayor Andrew's recommendation to direct city attorney to draft an ordinance temporary banning the sale of flavor vapor products in the city of Long Beach.'",
        "'speaker_1': 'Thank you. Councilwoman Pryce.'",
        "'speaker_2': 'Thank you. I want to thank those who have signed on to this item with me, and I want to share my thoughts with you about why I brought this item. Tonight's discussion is about safety and health. Across the country, we are seeing truly concerning health impacts related to e-cigarettes and vaping.'",
        "'speaker_2': 'The CDC is reporting over 800 cases of lung injuries directly connected to vaping and e-cigarettes. And there have also tragically been 12 deaths. No one picks up an e-cigarette for the first time, expecting that it will rapidly injure their lungs and land them in the emergency room.'",
        "'speaker_2': 'And even more, no one expects to be killed by using these products either. For adults, these products are often marketed as a safer way of consuming tobacco, nicotine and and can help stop smoking. That is true, however, with serious and pressing pulmonary injuries being experienced across the country due to the mechanisms of vaping, we need to look'",
        "'speaker_2': 'more closely at these products to ensure that we are protecting consumers. Additionally, we have seen teen nicotine addiction increasing rapidly and connected with vaping e-cigarettes. This is heavily connected with the marketing of vape products to teens throughout, mimicking candies and sugary fruit flavors.'",
        "'speaker_2': 'So in light of the urgent health issues being seen nationwide and right here in the city of Long Beach, where we had two reported incidents involving pulmonary injuries, as well as the need to do more to reduce youth nicotine addiction.'",
        "'speaker_2': 'Enacting a temporary ban narrowly tailored to target flavored nicotine vaping products would allow the city to play a role in safeguarding our youth and protecting the general public. What is being proposed tonight is the sale of flavored vaping products.'",
        "'speaker_2': 'I know that there are many who feel the city should do more. I know that there are those who have asked us to to institute a permanent ban tonight. And I know that there are those who have asked us to institute a full ban on all vaping products.'",
        "'speaker_2': 'And I understand that. But I think at this juncture, it's important for us to study the impacts and find out what safeguards are happening at the state and national level that can help protect consumers. Anyone using e-cigarettes to quit smoking and break themselves of a nicotine addiction under our temporary ban would still be able to access the'",
        "'speaker_2': 'products. It would just not be the flavor of cotton candy. With this policy, we both take a prudent step to address a health concern that is nationwide, while also seeking to make a bigger impact on reducing teen access to vaping based nicotine.'",
        "'speaker_2': 'Cities, counties and states all across the country are making major strides to confront this issue. And it is time that the city of Long Beach did the same to protect our residents until we have more information regarding the health impacts.'",
        "'speaker_2': 'Tonight we found we received word that the county of L.A. instituted a ban on flavored vape products. We know that the state of Michigan has banned it. The state of New York, the state of Massachusetts, the city of L.A. has not yet instituted their ban, but their city attorney has indicated very publicly that banned a ban should'",
        "'speaker_2': 'be in place for flavored tobacco products. And I know that's something that's on their radar. San Mateo County has instituted a ban on flavored tobacco. San Jose has instituted a ban on flavored, flavored tobacco products. And I believe it's time for the city of Long Beach to do the same.'",
        "'speaker_2': 'I know that our health department has also been involved and engaged in this conversation. They are here this evening. I know that Kelly Collopy, our director of our health department, is here, and I'd like to invite her up at some point to talk about some of the impacts and concerns that the city health department has observed and'",
        "'speaker_2': '. Share with us a little bit some of their concerns in regards to how we can protect our our city residents and consumers.'",
        "'speaker_1': 'It's comfy.'",
        "'speaker_11': 'Good evening, council members and Honorable Mayor. Thank you for the opportunity to provide some information around this topic. So we do know that generally that flavored tobacco products are the gateway to further smoking and other sort of other sort of tobacco usage.'",
        "'speaker_11': 'It is one of the things that we've been focusing on. When you look at the injury cases that we that have happened nationally, 40% of them or I'm sorry, 22% of them have occurred among those who are 18 to 21 and 16% are occurring for those under the age of 18.'",
        "'speaker_11': 'In Long Beach, we do have a restriction for anyone under the age of 21 for any tobacco product. Vaping is included in that process. So when we're looking nationally at the under 18 to the 21 year old, we would want to be making sure that we're paying close attention to that population as we're looking forward.'",
        "'speaker_11': 'Again, the flavored tobacco products, including vaping and non vaping, are the key entranceway. And as we're looking at the L.A. County that was just passed, they are looking at all flavored tobacco and vaping products, not just the vaping piece in terms of in terms of the vape technology of your e-cigarettes.'",
        "'speaker_11': 'It is not yet been determined what is causing. So they have not yet found a single agent. They're looking at vitamin E, but they're looking at so many other ways they are finding it, those coming from the streets, but also coming from the places that they're being sold in in different in different agencies.'",
        "'speaker_11': 'The city of Long Beach has 13 vape only stores within the city. That is that. And then on top of that, there's another 490 that sell that are licensed to sell tobacco and vape products across the city. So I just wanted to give you a feel for that for those numbers.'",
        "'speaker_11': 'We support as the health department this this ban. And I'm free to answer any questions after that. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Price. And anything else to add?'",
        "'speaker_2': 'Nothing further from.'",
        "'speaker_1': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'Thank you. I appreciate those who have reached out to our office on this very important item. I appreciate our health directors thorough report related to the cases that have come forward. I think it's important for us to look into whether or not those that are being impacted are utilizing the FDA approved vape cartridges.'",
        "'speaker_5': 'I think that one of the things that this allows us to do is it allows us to take a pause for us to take a moment and a step back to ensure that we're being prudent in the way in which we establish parameters to protect youth health.'",
        "'speaker_5': 'We don't want to drive individuals to the online or illicit market. We want to be careful and appropriate in our action to ensure the greatest health impact. I think that one of the other things that I would like to see is an education component.'",
        "'speaker_5': 'We have a very strong green education component to our marijuana program. I think it would be appropriate for us to explore how to do that. I'd also be very interested in the recommendations that come back to this council restricting the places that you can get certified vape products from.'",
        "'speaker_5': 'Over 500 locations to maybe a more controlled environment similar to just the vape shops where we would be able to do greater education and control. And so for those reasons, I'm very supportive of moving in that direction, and I'm open to listening to the community who has already started a great conversation around the protections we need for'",
        "'speaker_5': 'our youth and health and my colleagues. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Richardson.'",
        "'speaker_9': 'Thank you, Mr. Mayor. And thank you, Councilwoman Price, for bringing this forward. I followed the the conversation on tobacco free Long Beach for a number of years of an ongoing discussion for over ten years in the city. And as new technology like vape pens come online.'",
        "'speaker_9': 'The conversation. The education outreach typically is delayed. You might. And during that gap from when a new thing comes online and when the foundations and the health world respond to it, a lot of mistruths come out during that time.'",
        "'speaker_9': 'A lot of people in the community truly feel that vaping is healthier than smoking. Direct cigaret. It's not true. It's not true whatsoever. Whatsoever. In fact, it could be more dangerous because you can't regulate the amount of the dose.'",
        "'speaker_9': 'Difficult to regulate the amount of dose. And all vaping pens are not created equally. So in that regard, I completely support this. And I would say what L.A. County did today. I just read the article. They banned all flavored tobacco, including Vape.'",
        "'speaker_9': 'I don't see a scenario where I'm going to say if is market cotton candy, like you said, is marketed at youth. I don't care if it's vape or if it's tobacco. Cotton candy, tobacco is a bad thing. I remember we were kids.'",
        "'speaker_9': 'We got an ice cream truck. They would have candy shaped like cigarets. Right? You blow it and little powder comes out. It's the same thing. So I'm okay if we want to go a bit further and say, Hey, when we instituted this moratorium, staff evaluate getting rid of these things completely because frankly, it's just the right thing'",
        "'speaker_9': 'to do. So that. Are you down for that?'",
        "'speaker_2': 'This is for flavored vape products, but I think absolutely we should be following the research and hopefully the Health Department can weigh in with a recommendation. I think that's very, very good.'",
        "'speaker_9': 'So I'll submit that to you as a friendly. But this is a great item. Thank you so much.'",
        "'speaker_1': 'Thank you. Councilmember Councilwoman Mongo. Actually, she just went. Councilman Austin.'",
        "'speaker_6': 'Thank you. And I. To support this this item wholeheartedly. I think as e-cigarettes are very commonly used, particularly among high school high school students and middle school students. So we have a responsibility as a city council to to look into this.'",
        "'speaker_6': 'And I'm very fortunate to have had a young intern working with me who's been keeping me up to speed and and and kind of drilling the importance of of educating parents, but also young people on the importance of understanding of e-cigarettes and the oils that are unregulated at this point.'",
        "'speaker_6': 'And we often don't know what's right, what's inside of these vaping products we need to catch up with. And I think that the public health needs to catch up with what's going on. And this is one of those situations or scenarios where the technology is kind of gotten ahead of government in a lot of ways.'",
        "'speaker_6': 'And so I applaud the other cities and states that are that are looking into this. If you haven't had an opportunity to check out Dr. Sanjay Gupta's special, I saw that this this past weekend. It was very eye opening on the the the real uncertainties, particularly surrounding vaping.'",
        "'speaker_6': 'I did have one question. We we're talking about a temporary ban. What would it include? We understand that it includes unflavored tobacco as well as vaping products. But would that include also menthol as well?'",
        "'speaker_8': 'Well, I'd.'",
        "'speaker_2': 'Be open to that amendment.'",
        "'speaker_6': 'I could throw that in there as well. As a as a friendly. Because it is a flavored tobacco.'",
        "'speaker_3': 'Mm hmm.'",
        "'speaker_6': 'And and and it is a also. And I'll just say that this is a very personal issue to me. My mother passed away four years ago from lung cancer. She was a chronic smoker all of her life. She tried to quit on many occasions and was addicted to nicotine.'",
        "'speaker_6': 'And so if we can avoid people from that outcome, we have a responsibility to do it. And I'm happy to to the moral support to this this item.'",
        "'speaker_1': 'Thank you. Thank you, Councilman. Councilmember Pierce.'",
        "'speaker_8': 'Thank you. I want to thank my colleague for bringing this forward. I'd like to to understand a little bit from our health department, also your education program around cannabis. Really, I feel like if we're going to even if it's a temporary ban, I mean, I think from hearing our council colleagues, that would eventually lead to a permanent'",
        "'speaker_8': 'ban and understanding the education program we've done with cannabis, are there opportunities for us to include this in that education program as well?'",
        "'speaker_11': 'Absolutely. They've been operating the green light bulb cannabis education program and we will continue to do that and also highlight the impacts from vaping. As part of that, we can also, through our tobacco education program, continue the conversations around vaping and other tobacco products that were not be flavored.'",
        "'speaker_8': 'Now I know that from my family member that quit smoking, he smoked for 20 years and there was a one 800 number on a bus by our house. And he kept driving by, driving by it. And one day he called the one 800 number and he got help.'",
        "'speaker_8': 'He called the number and he had a counselor on the line that he could call 24 hours a day any time you wanted to pick up a cigaret. And he quit after 20 years cold turkey after trying patches and everything else.'",
        "'speaker_8': 'And so I think that those education programs as outreach opportunities are really key. I know that our youth often. You know, whether it's cigarets, whether it's vaping. I'm from Texas. It was dip cherry flavored, you know, so any flavored products?'",
        "'speaker_8': 'I'm very supportive of taking those out because that is the way that that folks come into this. I'd like to hear from the city attorney just you know, I know the county just did this. How that. I'd like to hear a report on the county ban and to see if that goes as far as Long Beach would'",
        "'speaker_8': 'like or if we want to extend it to even more tobacco products. So.'",
        "'speaker_10': 'I'm not prepared tonight to give you.'",
        "'speaker_8': 'That maybe.'",
        "'speaker_10': 'To will get that and do a memo to you and the mayor and the council on the county ban. And if this passes this evening on the proposed ordinance for Long Beach and how that would be similar to the county ban.'",
        "'speaker_8': 'Thank you. That's what I'd like. Again, I appreciate this. It's the right step.'",
        "'speaker_1': 'Thank you, Councilman Ringa.'",
        "'speaker_7': 'I want to thank Councilmember Price for bringing this forward. Yes. We want to get a little bit of a clarification. This is the recommendation is to draft an ordinance temporarily banning the sale of flavored reaper products. That correct.'",
        "'speaker_7': 'Temporarily. I just want to get the the clear.'",
        "'speaker_10': 'I have not heard what temporary is yet, but yes, but it does include flavored tobacco, including vape products and also including menthol are my notes so far.'",
        "'speaker_7': 'Thank my customers that up as well because I was going to bring up about tobacco and menthol as well. And I'm glad that that part of this is going to be during the temporary ban. Is there going to be a study presented or researched or you're going to be doing a coming back with an ordinance that we'",
        "'speaker_7': '. Evaluate and approve. I'm just trying to get a handle on what? What is it we're doing here tonight?'",
        "'speaker_10': 'That's a great question. The the the ordinance, as I understand it, we're being asked to create would be a temporary ban, whether that's one year, 18 months, whatever that the council decides that would be, at which point it would sunset, unless there's further action by the council, if that's the desire of the council, or it could do'",
        "'speaker_10': 'a permanent ban.'",
        "'speaker_7': 'Total ban forever. But you know that.'",
        "'speaker_10': 'That's also an option. And you could come back at a later date and always rescind that if you have additional information and wish to change that. So those are options are on the table.'",
        "'speaker_7': 'See my copy. If I recall correctly, we had a tackle, a tobacco prevention and education program at one time at the health department. Is that still there or has the funding sunsetted on that?'",
        "'speaker_11': 'No, we have a we have significant funding around tobacco education. And we have a team of people who is who was working on that. And we have a number of different efforts. We're currently working to fill all the positions for that program, but we have the capacity to run a very strong education, tobacco education program around these'",
        "'speaker_11': 'issues.'",
        "'speaker_7': 'I'm also thinking about it, tobacco enforcement. I mean, we're looking at a ban of a vaping and tobacco product, the flavored tobacco products. I think that would be important that we also have a strong enforcement component to this as well.'",
        "'speaker_11': 'The environmental health. They do enforcement, at least in terms of underage sales when it comes to that piece. So we are out there consistently doing enforcement around that and we know how many people we state organizations who sell to underage under age 21 for all tobacco products.'",
        "'speaker_7': 'All tobacco that including of the.'",
        "'speaker_11': 'E-Cigarettes and vapes.'",
        "'speaker_7': 'Okay. That's all I have. Thank you. I strongly support this.'",
        "'speaker_1': 'Thank you, Councilmember. Super now.'",
        "'speaker_9': 'Thank you. I'd like to yield my position to Councilman Price, and then if you can come back to me.'",
        "'speaker_1': 'And so. Woman Price.'",
        "'speaker_2': 'Thank you. So I'm hearing a lot of support for this item, which I love. And to me, this is the kind of debate and engagement I love to have on council, because as we're hearing one another talk or we're talking about policies and where we all stand on it, and I love it.'",
        "'speaker_2': 'It's very authentic and organic. I want to put it out there to hear from my colleagues. I actually would like to go a step further and make this a permanent ban on flavored products. And I don't know what my my colleagues think about that.'",
        "'speaker_2': 'I want to hear from you about that. But. I won't amend the motion. I won't amend the motion at this point because I want to hear from everyone. But I think at the very least, in regards to how long will this temporary ban last, I will say until further notice.'",
        "'speaker_2': 'And the city would have to bring the item back in order to provide the research and lift the ban. The other thing that we didn't talk about is how long would we give the businesses to be able to comply with this policy and take these items off their shelves and have an opportunity to redo their marketing so'",
        "'speaker_2': 'that their cotton candy products are not the top selling products in their store. So maybe we can give them 30 days, which is what I know some of the other local jurisdictions have done. So as part of this motion, we would give them 30 days to be able to adapt to it.'",
        "'speaker_2': 'But I also want to hear my colleagues thoughts on making it permanent now. The motion on the floor is for the temporary ban until further notice, at which time we would come back and end the ban if we wanted to do that or modify it at that point.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Mongo. Actually, we want to go back to Councilmember Super now.'",
        "'speaker_9': 'Okay. Thank you. I have to apologize. I just received a report like 13 pages, and it's a little late to the party, so I haven't had a chance to study it. But what strikes me is that the news on this is late breaking, to say the least.'",
        "'speaker_9': 'Here's a report from the CDC as of yesterday that they admit that bootlegged THC products are likely to blame. So that type of stuff for Kelly Collopy. I didn't bring these folks with me. So for Kelly, I really sympathize with your position that you're getting this information.'",
        "'speaker_9': 'You know, as we speak. And so it's so tough to sort this out. And then I wanted to follow up on Councilwoman Mango's point about I guess I would call it unintended consequences that if you put in a ban of this type, are you going to drive folks to the black market where there is zero regulation?'",
        "'speaker_9': 'And to that, I think maybe if we could proactively come up with a formula here that might work, and that is if we have. Those numbers were staggering, by the way. 13 vape shops versus nearly 500 outlets. So if you banned that everywhere but the vape shops where you could regulate everything, keep an eye on it.'",
        "'speaker_9': 'Is that a possible term? I want to put that out there. That would that would give people an outlet other than the black market. I think. I think if if if they are I assume we have the regulation in place already for these shops.'",
        "'speaker_9': 'Also, Kelly had mentioned that the oils and vitamin E and I know very little about this topic, but if they shops were restricted to water soluble only, would that be an improvement over the oils that seem to be causing a problem?'",
        "'speaker_9': 'So I have more questions and answers here, but I'm just throwing it all out there. Thank you.'",
        "'speaker_1': 'Thank you. Did you miss coffee? Did you want to answer some of those questions?'",
        "'speaker_11': 'So vitamin E is one of the things that they think may be part of it, but they haven't. It's not the core of every of of every time someone has shown up. So, like, I wouldn't I wouldn't look so much at whether it's water or oils or what it is because there's a really a mix.'",
        "'speaker_11': 'So I think those are one that's one of the things we are seeing impacts both well, predominantly they're seeing them on the streets. They are also, you know, they're seeing at least 25% of the cases coming from those that are coming from vape shops.'",
        "'speaker_11': 'And so, you know, are through sort of standard mechanisms to access. So it's making sure that, well, you know, it's it's still not clear. There's not well, there may be more of some and not of others. That's still not completely clear what it is and where it's coming through.'",
        "'speaker_11': 'There are also, you know, in terms of the FDA and approved, there's many things that are not approved about vape, even though they're being sold in different stores. So there's not a lot of regulation. So it's hard to know exactly what we're looking at there.'",
        "'speaker_9': 'Can I follow up to that real quickly? And so if I can summarize what you're saying, is that in the interest of caution, you're supporting the ban at this time. Yes.'",
        "'speaker_6': 'Councilmember Mongo.'",
        "'speaker_5': 'Thank you. So what I would like to do is I am open to expanding to a more permanent ban. One of my thoughts would be if we could funnel tobacco users to just the 13 vape shops. So doing a permanent ban citywide on the for 90 those for nine.'",
        "'speaker_5': 'Do you have also other sources of revenues? Those are gas stations, liquor stores, other things like that where they would not go out of business. Then we work on a aggressive campaign for the vape shops to help us pull people away from tobacco.'",
        "'speaker_5': 'Because I will tell you, I still have three members of my family to smoke and one shoes. And so there are still actually four members. I forgot I have an in-law as well who are also choose. So I have four members of my family who still are addicted to tobacco.'",
        "'speaker_5': 'And so we do want to find places in Long Beach for those people to see the one 800 No Butts campaign and other things. And if we could all hone them into a funnel of perhaps those 13, I'm not sure.'",
        "'speaker_5': 'Again, I wasn't prepared on what direction to go, but to at least get them those resources because what we don't want to do is just have them step over the border. And I know that not every council member here is a border district, but in the fifth district I'm a border district, so I border Lakewood, Hawaiian Gardens'",
        "'speaker_5': ', Cypress, Los Alamitos, Rossmore. I could go on and on. And there are all these other places that those resources are available just over the line in a 7-Eleven. And so what I would love to do is find a resource here, a search here, since every councilmember has gotten to speak.'",
        "'speaker_5': 'Before we really get into the details on the item, would you be open to going to public comment and then coming back to the real.'",
        "'speaker_6': 'I'm going to allow Councilmember Pearce to speak next. We will have two councilmembers cued up. We have Councilmember Pearce and Richardson, and then we can go to public comment.'",
        "'speaker_5': 'Great. So those would be my comments. I would like to see an aggressive campaign like the No Butts campaign of the past, because I think there are just still too many people that are addicted to tobacco.'",
        "'speaker_8': 'Thank you. I wanted to queue up to say that I support a full ban upon hearing your comments. Councilmember among its I hear we always we want to be supportive of small businesses, but when it's something like lung cancer and our kids getting their hands on things, we have to put the lives of our constituents and their'",
        "'speaker_8': 'children first. Well, I mean, that's I understood that you said you wanted to ban the hundreds of them that sell the product, but keep open the actual vape shops that.'",
        "'speaker_5': 'I think that I care about the health of our community, so much so that I also don't want us to lose the opportunity to provide a public outreach campaign right here in our own city.'",
        "'speaker_8': 'So so people do not get help getting off of a vape or cigarets at a vape shop. They get that help through our health department. They get that help whether it's in a grocery store at or a bus stop ad.'",
        "'speaker_8': 'And so I support a full ban. I'd like to see us get get there. And I know, Charlie, this is the first day that we've had this. I would like to ask if if our health department before our city attorney's office comes back with an ordinance but that our city health department do a small presentation.'",
        "'speaker_8': 'So we really have some of those numbers in front of us. I hope that the city attorney's office will continue to draft that item, but that we at least have some context that we know how far we want that item to go whenever that comes back in front of us.'",
        "'speaker_8': 'That's something that our health department could do.'",
        "'speaker_11': 'What sort of numbers we would be looking for.'",
        "'speaker_8': 'I guess I want to better understand the number of of users that that have been impacted and have an understanding about some of these claims, whether it's oils, whether it's water. Does it really matter? Just I mean, we're all kind of working without that information, without shared information on that.'",
        "'speaker_11': 'We can do that. One other number I want to share that 61% of our high school e-cigarette users are buying in that big shops.'",
        "'speaker_8': '61% are buying at baby shops.'",
        "'speaker_11': '61%. Wow.'",
        "'speaker_8': 'Wow.'",
        "'speaker_11': 'And high school users are buying or buying them in vape shops. So just as we're thinking about the youth portion of this.'",
        "'speaker_8': 'Well, we know that that sometimes we have laws on the books and those laws are not adhered to. I mean, I was buying Cigarets when I was 12, going into a store buying Cigarets when I was 12. We have to make sure that they're not there for kids to walk in and buy.'",
        "'speaker_8': 'And so I fully support a full ban. I support being as aggressive is as this council is willing to go. But I do think that we need a little bit more information from our health department and some clear direction if it's a full ban, if that's the direction that the maker of the motion would like to go'",
        "'speaker_8': '. Thank you.'",
        "'speaker_6': 'All right, Councilmember Richardson.'",
        "'speaker_9': 'Thank you, Councilmember. So, Councilwoman Price, I want to address you wanted some feedback. Here's what I see here. So we've attempted bans in the past. Plastic bag bans, Styrofoam bans. And we should probably stick to the process to folks.'",
        "'speaker_9': 'Now we start with an immediate minute order, you know, a moratorium. And give staff time to shape a policy that works, that requires outreach. That should be a part of it. But the man goes into effect today. This conversation about a full ban or a temporary ban, any given Tuesday, anything could be temporary.'",
        "'speaker_9': 'There is no full ban versus temporary. The other thing I'll say is if we just slam this on. You know, Councilwoman Mongo mentioned the border districts. We border Lakewood, Bellflower, Paramount, Compton. Our markets still don't comply with the plastic bag ban.'",
        "'speaker_9': 'Restaurants probably aren't ever going to comply with the Styrofoam ban. Reality is the reality is if we want this to work, I think we should put forward we should ask staff how long it takes to shape a policy.'",
        "'speaker_9': 'Put the minute order in place now which the ban goes into effect immediately or as soon as the audience comes back. And then we take time and shape it, because there's opportunities also that we may not may not be represented here.'",
        "'speaker_9': 'For example, opportunities to codify education, to put noticing on businesses and other things and through their different audiences. So the conversation on and so youth flavored flavor tobacco targets, youth, right, menthol. There's the conversation that targets African-American communities.'",
        "'speaker_9': 'Those are very different, distinct conversations that have come up in other areas that have brought this up. And what we don't want to do while we're excited about this motion is go out and shape the policy without doing the work.'",
        "'speaker_9': 'And so I support the direction we're heading. But I would just say let's give those put the burden on staff to go figure this thing out and bring us a quality policy. That's what I would recommend.'",
        "'speaker_6': 'All right. I'm going to ask for public comment. And as you coming up, I'll just give my quick comments on that as well. I do think this is like many other policies that that we have embarked upon. I think we'll be getting a lot of direction from Sacramento, which what might render a lot of the time that'",
        "'speaker_6': 'we're putting forward. But I'd like to come forward Kim Kirkman, Carlos Jeffrey Luciano and Corliss Lee to start. You have 90 seconds.'",
        "'speaker_2': 'Yes, I'm good. Hi. My name is Kim Markman.'",
        "'speaker_5': 'I have three kids, a college student, high school student.'",
        "'speaker_2': 'And a middle aged student. I am actively.'",
        "'speaker_5': 'Involved with the Wilson PTSA and the Long Beach PTA and other foundations. I am here to support the proposal at hand. However, you guys all want to do it. I'm. I support it. I don't care how you word it.'",
        "'speaker_5': 'I support it. Today I am wearing my parent hat. I can't wear my PTA hat today because, you know, once again, we're a body that has to vote on on supporting it. I have concerns and I have had concerns for probably since they started selling the e-cigarettes and the flavoring.'",
        "'speaker_5': 'I've read many articles. My husband keeps sending me articles.'",
        "'speaker_8': 'Articles and concerns that are coming to light. The first 2 to 6 are alarming to me.'",
        "'speaker_5': 'The National Youth Tobacco Survey.'",
        "'speaker_8': 'Quoted on the Wall Street Journal.'",
        "'speaker_5': 'And the safe to say B Corp, I saw the exact same quote today. It's 1.7 million high school students used e-cigarettes in the last 30 days. 90% of adults addicted to a.'",
        "'speaker_0': 'Substance started.'",
        "'speaker_5': 'Before age 18. And I know that goes substances abroad because I, I often talk to my kids about this. One pack of cigarets is equivalent to one joule. And I know I saw on the Internet today.'",
        "'speaker_8': 'That Governor Newsom.'",
        "'speaker_5': 'Signed an executive order to.'",
        "'speaker_2': 'Confront the youth vaping.'",
        "'speaker_5': 'Epidemic. The Wilson PTSA.'",
        "'speaker_0': 'Board, which I am the president of and many of my peers.'",
        "'speaker_5': 'Have high.'",
        "'speaker_8': 'Schoolers are concerned enough that we.'",
        "'speaker_5': 'Are hiring a professional company, this cyber safety cop, to come in and him.'",
        "'speaker_4': 'Am I done?'",
        "'speaker_6': 'Thank you. Yes, I'm sorry. You can.'",
        "'speaker_8': 'Darn it. I was.'",
        "'speaker_3': 'So close in.'",
        "'speaker_4': 'School. Oh, you did great.'",
        "'speaker_3': 'Oh, good.'",
        "'speaker_6': 'Thank you, Carlos. After. Carlos is Jeffrey Luciano.'",
        "'speaker_1': 'How are you doing? Thanks. Thanks for listening to us. Actually, I'm here representing the shops and every shop owner and I understand this is an issue that we have to address and everything have started with, you know, the youth trying to get all these baked cigarets and different stores.'",
        "'speaker_1': 'And we understand that what they do, they always try to get it anywhere, but no other beach shops. Usually our beach shops are run by the owners. We have all these licenses that we have to obtain in order to sell these devices and to sell these e-liquids.'",
        "'speaker_1': 'No, we not allowed any people under age to walk into our vape shops because we will lose our business now if there is a ban. I will say that you will can the 13 shops that there is in Long Beach so you can update some data about what's going on because otherwise futures will be followers on these'",
        "'speaker_1': 'and just follow where other cities are doing. And we don't we can do something with this. We can actually get a device or age verification that we already have talk about. So the every to everybody that comes through our stores will be verified.'",
        "'speaker_1': 'So we won't even take fake IDs because, you know, that's something that sometimes people can control. And then if you ban this, you will creating a black market. That's what's going to happen. People is going to go out of the city.'",
        "'speaker_1': 'You will close the shops. And then I think it's better if we allow only certain shops so you can obtain the data.'",
        "'speaker_6': 'Thank you, sir.'",
        "'speaker_1': 'You guys appreciate it. Thank you.'",
        "'speaker_6': 'Mr. Luciano. Geoffrey Luciano.'",
        "'speaker_1': 'Good evening, councilman. Thank you very much for your time. And, you know, speaking on this agenda and hearing me out, you know, I've been using electronic cigarets for ten years. I used to be a smoker prior to that for many years.'",
        "'speaker_1': 'And I quit using flavored nicotine. And all my customers, all my customers, which are 21 and over adults, they use flavored nicotine to quit smoking. And they're very concerned. Uh, you know, we all know that flavored nicotine has been in existence for about a decade.'",
        "'speaker_1': 'And this recent epidemic is a recent occurrence. And based on Kdka's report, 7770 7% of the of the epidemic involve THC or else 16% involve nicotine products. The recent occurrence has raised many eyebrows in Long Beach and action needs to be taken.'",
        "'speaker_1': 'I believe in preventable measures. Yet I urge the city council, the city attorney, to work with electronic cigaret retailers in forming alternatives to the prohibition of flavored products with the highest regard to prevention of use, access and curve, any potential harm and misuse of e-cigs.'",
        "'speaker_1': 'Speaking to many constituents in Long Beach, the underlying fear that this total restriction on flavors. Of flavored e-cigs will perpetuate parasitic. Thank you, sir. Bootleggers releasing harmful products into this market in turn, resulting in risking unimaginable consequences. Let's work together and reach an outcome of providing a harm reduction for all.'",
        "'speaker_6': 'Thank you. Thank you. Thank you. Carelessly after careless, we have Neil. Neil Hanson.'",
        "'speaker_4': 'I totally support what you're doing here today. And and I thought the discussion was really good. And I don't have a particular answer in this because I think when you ban something, in some ways you make it more desirable, especially for kids.'",
        "'speaker_4': 'You know, I think they'll probably go after it one way or another if they want to. But I do believe that the education part of it is probably the most important. So whatever we can do to get out to the schools and make sure that everyone understands the dangers that go with it.'",
        "'speaker_4': 'I love those old commercials where they had that woman with the cigaret in her neck. I mean, when you see the end game of of tobacco, it's not pretty. But I would say that I would favor raising the price.'",
        "'speaker_4': 'You know, if you're trying to get it away from kids, make it so that it's not economically feasible for them.'",
        "'speaker_6': 'Thank you. Mr. Neil Hanson and then John Seaburg.'",
        "'speaker_7': 'Hello. And thank you. My name is Nils Hands. And. And I own an electric bike store and a vape store, both in Long Beach.'",
        "'speaker_1': 'For over six years, I've helped thousands.'",
        "'speaker_7': 'Quit smoking to lead a healthier life. And I got to tell you, it feels pretty amazing. I, too, was a long time smoker who stumbled upon vaping in its earlier stages.'",
        "'speaker_1': 'Prior to my discovery, I suffered at least four times a year with bronchitis, believing I was allergic to.'",
        "'speaker_7': 'Everything since I was always congested. Before quitting, Cigarets realized that those were the source of my illnesses.'",
        "'speaker_1': 'However, we're not here to listen to.'",
        "'speaker_7': 'Me talk about how vaping saved my life.'",
        "'speaker_1': 'We're talking about how to keep it away from kids. As a father of three, one of them a teenager. I'll be the first to tell you. I educate and with my wife, educate our kids to not smoke.'",
        "'speaker_7': 'To not vape, ever. They don't need it.'",
        "'speaker_1': 'Keeping kids healthy is a concern for all of us. And as someone who sells the products, I feel I have an.'",
        "'speaker_7': 'Even greater responsibility.'",
        "'speaker_1': 'Therefore, I would like to present to the Council a list of.'",
        "'speaker_7': 'Responsible and I believe, ultimately effective regulations that would have even a stronger, more positive impact than an outright ban.'",
        "'speaker_1': 'A ban would only send kids and people back to cigarets.'",
        "'speaker_7': 'Black market type products.'",
        "'speaker_1': 'First, we must limit and license the locations where these products can be found. To my findings, there's over about 600 tobacco.'",
        "'speaker_7': 'Licenses in the city of Long Beach and only eight vape shops. I believe that only vape shops should sell vape products. Next, we need to limit the amount of nicotine. Nicotine is a huge driver for these kids. They're looking for a buzz.'",
        "'speaker_9': 'We don't carry Jewel at my store.'",
        "'speaker_1': 'My store, we see over 70 to 120 people a day. We don't carry JUUL. We don't sell it. We don't believe in that high nicotine stuff. That's what kids are going after.'",
        "'speaker_7': 'They're going after the bus. Thank you, sir. Flavors for everybody.'",
        "'speaker_6': 'Please submit your list to the to the clerk, and we will.'",
        "'speaker_7': 'I gave you guys all folders today.'",
        "'speaker_6': 'So thank you. Take a look. John Seaburg. After John Shane Simpson.'",
        "'speaker_1': 'Podium for short people. My name's Shaun Seaborg. I have been a vapor for 11 years. 11 years? I have zero nicotine. I have never been a nicotine vapor in any shape or form of way, never smoked cigarets never gave up care about tobacco products in general.'",
        "'speaker_1': 'I however I have I have however, been using a great product and zero nicotine flavor to basically nebulizer albuterol sulfate. Now albuterol sulfate comes in a nebulizer for people with asthma or breathing problems and you can mix it.'",
        "'speaker_1': 'And basically it's activations which are the same as the active agents that are in Egypt's with the exception of nicotine. But I do believe that there is a serious issue here with your products in general. You're talking about a nicotine product that is within 50% or I'm sorry, 50 milligrams in nicotine when most vapes in general and'",
        "'speaker_1': 'most nicotine products are between zero and six milligrams at 50 milligrams, you're talking about a high, not a pleasant one. And it's never fun. I mean, it's what the kids are chasing after and it's not something that we need to really take a look at.'",
        "'speaker_1': 'Now, as far as kids getting it, most shops that I visit, there's never any kids in there. Rarely do kids ever even come in. But you will see advertising for Jewel on the front door of an AMPM, front door of a Chevron, front door of a 7-Eleven.'",
        "'speaker_1': 'And, you know, in my experience, it's those places where kids are also getting their vapes from that and online retailers. And both of those need to be seriously checked by not only the parents who are kind of being lazy and not proactive, but also by the council yourselves.'",
        "'speaker_6': 'Thank you so much. Thank you. Through Simpson and then after Mr. Simpson and Travis Anthony.'",
        "'speaker_1': 'Hi, my name is Shane Simpson.'",
        "'speaker_9': 'I'm with I'm a vape shop owner myself real quick we do it that vape shops this is this month alone fake IDs that were confiscated over the course of 38. There's 42 IDs here. The teenagers are to walk in and purchase nicotine products illegally.'",
        "'speaker_9': 'We use a third party age verification. These are purchased on a website called ID Guard. You can shop teens can buy five ads for $100. PayPal only. Stand by. But we we've caught them. And I'd like to submit this to staff to review them.'",
        "'speaker_9': 'You can scan and police department can also scan them. They all fall foul of the bar code authentication. We checked the barcode to verify that it's a real I.D. or not, not the magnetic strip. Many experts are very easy to forge.'",
        "'speaker_9': 'I recommend a 2% or 2.5% nicotine cap. We did independent research survey with 2500 youth in the Southern California area, and they're all looking for 50 to 70% milligram. They are not interested in 36 adult smokers, 86% use that.'",
        "'speaker_9': 'The CDC, DC data from the NTSB report of 2018, less than 7% of teens use flavors. Fruit. Less than 5% use meant I actually have the NYS 2018 report I can show you guys. Break it down. I want to work with the city to craft responsible progressive legislation.'",
        "'speaker_9': 'I think Long Beach could be the model for eliminating youth use and protecting adult access. Thank you.'",
        "'speaker_6': 'Thank you. Then Travis Anthony and then Nick and McGwire.'",
        "'speaker_7': 'Hello. My name is Travis Anthony. I own vapor land in Long Beach on the east side of Long Beach. Do you guys have a hard. Decision to make and duty to do. We get it. We've been paying attention for the last six years.'",
        "'speaker_7': 'There is 23 shops in 2013 or 14. I think there's down to eight. Pretty much spread over 52 miles of Long Beach. So it's not like we're all in one spot. We just want to give it give us an opportunity, because I know that nobody wants kids to smoke.'",
        "'speaker_7': 'I smoked at 1112. I didn't have a choice, but I found it either way. So last year I started a tobacco retail education team. I met with education. City enforcement, presented a bunch of restrictions. I didn't really get far with it.'",
        "'speaker_7': 'I didn't know how to how to go about getting any further. So the eight shops have come together and we presented you guys very restrictive, very regulated forms like you've been hearing lowering nicotine. Lowering consumption, doing the Peel System's roots, age verification.'",
        "'speaker_7': 'It can't be sold without it. And that's pretty much all we're asking for is don't make everybody go to Lakewood, to these other vape shops. They're going to get rich overnight. We're going to go out of business. And there's there's other ways than just making everybody go black market.'",
        "'speaker_7': 'What we want to communicate with you, I don't think a lot of you guys know about the products. That's why I started last year trying to educate somewhere. We. Thank you. Thank you very much.'",
        "'speaker_6': 'Big. And then after Nick, we have Bill blow it.'",
        "'speaker_10': 'Hello. My name is Nicholas Almaguer and I run a local bait shop.'",
        "'speaker_1': 'I have worked there for about.'",
        "'speaker_10': 'Five or six years. I have personally helped.'",
        "'speaker_9': 'Over a thousand people quit smoking. I have cried.'",
        "'speaker_10': 'With people on a regular basis when they quit smoking 3 to 4 packs of cigarets a day. I have had.'",
        "'speaker_9': 'People come in who smoke 3 to 4 packs.'",
        "'speaker_10': 'Of cigarets a day and we got them to quit on the spot and never touch another cigaret again. That is why I do this.'",
        "'speaker_9': 'Yes, I am looking at losing my job. Yes, my boss is looking at losing his business. My friends are looking into going bankrupt because of this. And the thing that I care about the most is my customers. They are not just our customers.'",
        "'speaker_9': 'They are friends and family. I have been known personally to have my customers come over and have barbecues for them.'",
        "'speaker_10': 'Support them, turn into a community type event where we are supporting each other, quitting smoking. That is the thing that I think a lot of people don't understand about this industry. I think that is what makes it a truly special community.'",
        "'speaker_10': 'These people encompass ex-smokers. They hate big tobacco innately. And I think there's a common misconception that we.'",
        "'speaker_9': 'Are big tobacco. We go out of our way to avoid big tobacco, and it is really the main thing that we're against.'",
        "'speaker_1': 'So I helped.'",
        "'speaker_10': 'Prepare those folders that you received earlier and those folders contain. Responsible regulations that we believe you guys should put into effect in order to prevent this without hurting other constituents.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_6': 'Thank you so much. Bill. Then after bill, we have lance brooks.'",
        "'speaker_1': 'Good afternoon. This bill baldinger coalition for smoke free long beach.'",
        "'speaker_9': 'I want i'm not here to.'",
        "'speaker_10': 'Convince you tonight.'",
        "'speaker_1': 'I'm here to congratulate you. Taking up this strong measure that you're considering today on. It's a bold move and.'",
        "'speaker_9': 'You have a lot of support in the community. You've received that support. You've seen this coming into your offices today. And we congratulate you for for.'",
        "'speaker_1': 'Thinking of the health of the residents of Long Beach. Just want to say a few words about some of the comments we heard. There is no safe smoking. There's no safe vaping. There's no safe secondhand smoke. These things are just not true.'",
        "'speaker_1': 'Al. Mr. Austin, when you spoke about your family, it struck me. I lost my father and all my uncles, frontline servicemen in World War Two who never saw.'",
        "'speaker_9': 'Their grandchildren because of tobacco. And I don't want another generation to go through. What? My family went through and years went through and we need to put a stop to it. This is a great first step. There is a lot more to do, but we need to keep children safe, number one.'",
        "'speaker_9': 'The other considerations are important, but not as important as that. Thank you.'",
        "'speaker_6': 'Did ice caps keep Travis Anthony? Nick Almaguer.'",
        "'speaker_1': 'I apologize. I think the last time I was similar. Last name?'",
        "'speaker_6': 'Bill Blow. It's okay. Okay. Who was that?'",
        "'speaker_1': 'Bill Ball. Vega.'",
        "'speaker_6': 'Sorry about that.'",
        "'speaker_9': 'Hi. My name is Bill Bloat, and I, uh, I own a home in the fourth district, and I own Smuggler's Success, which is also in the fourth district. It's a.'",
        "'speaker_7': 'Vape shop we started in 2012.'",
        "'speaker_9': 'And, you know, I did it to try to help save lives. And there seems to be a lot of.'",
        "'speaker_1': 'Misconception about is vaping healthy, is it healthier?'",
        "'speaker_7': 'And it depends on who you ask, I guess these days, because.'",
        "'speaker_9': 'You get mixed signals from everyone you know. In the UK.'",
        "'speaker_7': 'Doctors are recommending it and.'",
        "'speaker_9': 'Here they're not. So it's something that obviously needs more.'",
        "'speaker_7': 'Education, more research.'",
        "'speaker_1': 'And hopefully you guys.'",
        "'speaker_7': 'Look at what we've sent you guys for regulating.'",
        "'speaker_9': 'We would like to be able to self.'",
        "'speaker_7': 'Regulate and really make sure.'",
        "'speaker_9': 'That they're not getting in the hands of children and that we're not selling, you know, 35.'",
        "'speaker_7': 'To 60 milligram nicotine in things like jewels.'",
        "'speaker_9': 'And small devices that can be hidden very well. I have two kids that go to high school in Long Beach and.'",
        "'speaker_1': 'You know, they see the jewels, too, and they tell me about it.'",
        "'speaker_7': 'Meanwhile, my two children.'",
        "'speaker_9': 'I've never tried vaping, so thank you.'",
        "'speaker_6': 'Thank you so much. What a color romance books. And after the dance we have tonight complete.'",
        "'speaker_1': 'Her name's Lance Brooks, and I work at Smuggler Success, a vape shop in Long Beach. I've heard a lot of interesting things here tonight, but one of the things that I've heard is the amount of products are purchased from vape shops.'",
        "'speaker_10': 'I just think it's inaccurate. I think it's information here that's not true. Accurate of smoke, vaping.'",
        "'speaker_1': 'Different than smoking. And I think we've heard some good ideas on how to help our citizens be more responsible and use it as a tool except for enjoyment.'",
        "'speaker_10': 'Rather than for the kids to get hold of it. I think there are easier ways to for the children not to get a hold of it. I don't think vape shops in what they call C stores where they're getting it.'",
        "'speaker_10': 'We just don't have 16 year olds that walk through our store and buy jewels. That just doesn't happen.'",
        "'speaker_1': 'We had a couple.'",
        "'speaker_10': 'Incidents when we've had the health department come and do stings and we just didn't sell to them just because to them we always heard we we know our customers very, very well.'",
        "'speaker_1': '90% of customers we know by name.'",
        "'speaker_10': 'And we know we're selling, too. So I think if we.'",
        "'speaker_1': 'Can look at some of these ideas and be drafting together, I think it would be effective to help our citizens, help the youth, help the adults.'",
        "'speaker_10': 'I think education is a.'",
        "'speaker_9': 'Huge, huge, huge part of helping this and.'",
        "'speaker_1': 'Stopping this. And I hope that we can kind of come to something that would.'",
        "'speaker_10': 'Work best for everyone. Thank you.'",
        "'speaker_6': 'Thank you. Mr. Sunak MP. He's not here. Ashley Salazar in my notorious.'",
        "'speaker_4': 'Hello.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_8': 'I work for Brian L.A., which.'",
        "'speaker_4': 'Is a organization that focuses on air.'",
        "'speaker_2': 'Quality and lung health issues.'",
        "'speaker_4': 'And I'm a health educator focusing.'",
        "'speaker_8': 'On educating.'",
        "'speaker_4': 'Parents and teachers and students about vaping and e-cigarette.'",
        "'speaker_8': 'Use.'",
        "'speaker_4': 'So for the last year, I've been doing parent workshops all over Los.'",
        "'speaker_2': 'Angeles County, and teachers and administrators.'",
        "'speaker_4': 'And parents are overwhelmed by what they see. These presentations just really give an insight to the problem. Students tell me that they go to the restrooms and it is so common for them to see their classmates vape and smoke.'",
        "'speaker_4': 'And young people choose to vape for many reasons, including peer pressure, availability of flavors.'",
        "'speaker_2': 'And the youth and vape culture surrounding it.'",
        "'speaker_4': 'Even though flavors are just one part of this big issue, it is a concerning one. There are thousands of flavors available, and these flavors.'",
        "'speaker_8': 'Are often targeted as at.'",
        "'speaker_4': 'Youth.'",
        "'speaker_5': 'Frito-Lay supports the city of Long Beach and.'",
        "'speaker_4': 'Tackling the teenage vaping epidemic to protect our youth. However, we do not believe a flavor ban will solve this problem if it is not supplemented by an educational component for parents, teachers, students and the community as a whole.'",
        "'speaker_4': 'Flavors is just one part of this problem. We think Long Beach for.'",
        "'speaker_2': 'Understanding that this.'",
        "'speaker_4': 'Vaping issue is a big problem and taking steps to study this issue in order to come up with a solution. Thank you.'",
        "'speaker_6': 'Thank you so much, Lionel Trias and then Matt Morton. Council members.'",
        "'speaker_1': 'For the time.'",
        "'speaker_7': 'Allowed me to speak today.'",
        "'speaker_6': 'My name is Lionel Triest.'",
        "'speaker_7': 'I'm 35 years old and I no longer smoke. I beat the vapor for six and a half years and I have a daughter. My daughter means everything to me. My daughter means absolutely everything to me. And I am doing everything that I can to provide for her, which means working in this industry.'",
        "'speaker_7': 'I used to work in the medical field, hurt my back. I wanted to use my mind. Baby mama was pregnant. My grandma was dying of cancer. And I had to make a decision. I told her on her deathbed that I am going to change lives to get people to stop smoking.'",
        "'speaker_7': 'She said, I know you can do it. I wanted you to be in the medical field, but I know this is what your heart is telling you. My family didn't approve that at first, but they soon later to realize that I had changed.'",
        "'speaker_7': 'I have grown up. I became a man being in this industry. Please don't take this away. I know that we're adults here that can make good decisions and better decisions for our kids. I believe that flavors help adults such as myself to make things better, a better life for the rest of us in the future.'",
        "'speaker_7': 'I'm not going to go any further and more than what I need to say, but please reconsider what some of my colleagues here have been talking about, about better. Let's do a better legislative for a better Long Beach for baby.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_7': 'Sir. Thank you.'",
        "'speaker_6': 'Matt Morton. After that, we have Chris Sherwin.'",
        "'speaker_1': 'Hi. Resident of Long Beach. Don't really have a skin and either side of the game. I don't own a shop and whatever. I haven't had a real cigaret in over a year thanks to e-cigarettes. National Institute of Health in the United Kingdom has proven that e-cigarette vape only has 5% of the toxicity of a regular cigaret.'",
        "'speaker_1': 'And my own doctor says my lungs are better. I can taste food. It's fantastic. Unfortunately, right after this meeting started, CNN reported that two more deaths have happened because of vaping related issues. However, they also both of them were not nicotine products.'",
        "'speaker_1': 'They were under ground, counterfeit THC and CBD cartridges. The Institute of Health in the state of Virginia found that all of their products that they tested from legal legal shops. Came back with none of these contaminants. Sacramento just published a thing.'",
        "'speaker_1': 'They grabbed 13 legitimate products, 13 counterfeit black market products. Ten of the 13 had the vitamin E acetate. That is a cutting agent that goes into the counterfeit products that when heated, becomes cybernetic. That's our problem. I have apple watermelon in my pocket right now.'",
        "'speaker_1': 'I love it. Flavors are for everyone. Banning flavors on a kneejerk reaction like this for something else. Is a problem when you have a fantastic community that's willing to help. Listen to the community, please. Thank you.'",
        "'speaker_6': 'Chris Sherwin. And I have to correct Christine Simpson.'",
        "'speaker_7': 'Good evening, members of council. My name is Chris Sherwin. I'm with the Campaign for Tobacco-Free Kids. I want to congratulate you for your attention to this very important issue. What we've seen is a growing momentum in California and across the country of communities doing just what you're considering tonight.'",
        "'speaker_7': 'And that is a full and permanent ban on the sale of all flavored tobacco products. E-cigarettes and all other flavored tobacco products. Flavors and tobacco have no place together. We are very concerned about the the recent epidemic of respiratory illnesses.'",
        "'speaker_7': 'But let's take it back, step back and look at the bigger picture. We have seen a 135% increase in youth e-cigarette use in the last two years. This is recent federal data. This is the tide that we are most concerned about.'",
        "'speaker_7': 'And the FDA is the agency that oversees whether a device is approved or not as a cessation product. No e-cigarette has been even submitted to the FDA or as a cessation product and therefore has not been approved as a cessation product.'",
        "'speaker_7': 'What we are now seeing are thousands and we're up to 5 million youth nationally have used an e-cigarette product. We're hearing about it from parents. We're hearing about it from teachers. In addition, over 50% of youth smokers use menthol cigarets.'",
        "'speaker_7': 'There are over 250 flavors of cigar flavors now, and cigars are now more popular among high school boys than Cigarets. So I encourage you to do a full, comprehensive prohibition on all flavored tobacco products across the city. Thank you very much.'",
        "'speaker_6': 'Shane Simpson.'",
        "'speaker_9': 'All right. Thank you.'",
        "'speaker_6': 'Okay. Kevin Price. After cave in is Taylor Thompson.'",
        "'speaker_0': 'Hello, Mayor.'",
        "'speaker_8': 'And council members.'",
        "'speaker_0': 'My name is Karen.'",
        "'speaker_8': 'Price and I'm in sixth grade. I'm here in support of.'",
        "'speaker_0': 'Item 32 temporarily banned vaping.'",
        "'speaker_8': 'Products. Being in sixth grade means I'm one step closer to becoming a teenager.'",
        "'speaker_0': 'With Vape kids are.'",
        "'speaker_8': 'Tricked into buying it because they think it is like.'",
        "'speaker_4': 'Candy.'",
        "'speaker_8': 'As scary as this is, here is a rush to become cool with vape as an option. This is kids number one choice.'",
        "'speaker_4': 'It is. This is not just for middle schoolers.'",
        "'speaker_8': 'But for kids and teens and all because it is.'",
        "'speaker_0': 'Bad for our kids health and kids may get addicted.'",
        "'speaker_4': 'It is your job to protect it.'",
        "'speaker_0': 'Because the.'",
        "'speaker_8': 'Vaping companies care more about their money than your health. I know. I know. If you vote yes, some will not be happy. But sometimes. Sometimes the right decision is the hardest to make.'",
        "'speaker_4': 'So I'm asking.'",
        "'speaker_0': 'You for for you to help.'",
        "'speaker_8': 'Me and my community and make.'",
        "'speaker_0': 'The right choice tonight. Vote yes.'",
        "'speaker_6': 'Thank you. Next is Taylor Thompson. Yes. Then we have Jessica Quintana.'",
        "'speaker_4': 'Hello. My name is Taylor Thompson. I have been working in the vaping industry for over six years now. I work in an open system type of product. I'll give you an example. I work for a company called Save Your Vape.'",
        "'speaker_4': 'We manufacture this product. It's a blueberry lime flavor. There's been a lot of studies proving that flavors do help people unflavored products that you guys are proposing. None of us want to. That's not appealing to us. It's not something we enjoy.'",
        "'speaker_4': 'And a tobacco flavored product would taste like a cigaret what we're trying to avoid. Right? So that's kind of the problem there. But I want to kind of show you an example of a dual really easily edible, right?'",
        "'speaker_4': 'I put this in my pocket, vape it. This is what I make. These are my two devices. They're over $200 for these. I don't think any kid's going to walk into a shop and be able to afford that.'",
        "'speaker_4': 'If I could show it to you, too, you would see there's a lot of cloud production with this. There's barely any. The milligram on this is 50 milligram, the milligram on this is six milligram. My mom quit smoking cigarets because of vaping.'",
        "'speaker_4': 'It changed and saved her life. She breathes easier. I was. I was raised with asthma because of her. I don't have it any longer, so I get a little emotional because this ban is just unfortunately so wrong. You guys are making the right call with this one.'",
        "'speaker_4': 'Unfortunately, we don't want our kids to vape, but this will drive tobacco back in power. This is this is the future here. This is we are not big tobacco. We don't want to be big tobacco. And we definitely, certainly don't want our children vaping.'",
        "'speaker_4': 'But this is not the way and we want to work with you guys. Just tell us how, you know on a real level, but I appreciate it.'",
        "'speaker_6': 'Thank you for your comments. After jessica, we have Lauren Labar.'",
        "'speaker_4': 'Good evening. Council members. Thank you so much. Councilman Austin. Jessica Quintana, executive director of Center Cha. We probably see over 10,000 youth each year. It's interesting that folks came up here and said that youth don't get access or can't buy these products, but they get them very easily.'",
        "'speaker_4': 'And so I've worked in tobacco control prior to working with Central Cha for over seven years. And so, you know, folks were afraid of the ban back then. Oh, if we ban Cigarets in the bars, the bars are going to shut down.'",
        "'speaker_4': 'Well, they're thriving. If we ban smoking in the parks, you know, nobody's going to be, you know, hanging out at the parks or, you know, smoking in the park areas. We no longer have smoking in the parks. We got rid of the the the nice billboards in tobacco that was, you know, advertising to youth and communities of'",
        "'speaker_4': 'color. They're no longer in magazines. The magazine company said they were going to go out of business if you took the advertisements away from the tobacco industry. They're still in business. What I can tell you is these kind of flavored and all these gimmicks that come from the tobacco industry are, number one, trying to target our youth'",
        "'speaker_4': '. And so how they use their vehicles through, you know, vapes and vape shops and other stores, whether that be the markets, the supermarkets, the 7-Eleven. Long Beach has always been a Ford city, working in tobacco control for many years, and especially reducing youth access.'",
        "'speaker_4': 'Everybody remembers when you can get the pack of Cigarets off the self-service display. That's no longer the liquor store said they were going to go out of business if that happened. Well, guess what? They did it. Thank you.'",
        "'speaker_4': 'So folks have a responsibility to our children and the public health and the safety of our youth. The ban is the correct thing to do.'",
        "'speaker_6': 'Thank you so much. Next up is lowering the bar. Name. William Bowe digga.'",
        "'speaker_1': 'O.'",
        "'speaker_4': 'Hello. Tonight. My name's Lauren Lavoie. I'm 27 years old. I'm a former smoker. I've been working in the E-Liquid industry for eight years now. I started smoking Cigarets when I was 12 and was not able to get off them until I found vape.'",
        "'speaker_4': 'I tried everything. I tried lozenges, patches. I heard you say the health department is helping people get out of smoking and if that was the case, vaping would have taken off the way that it did. That's just the reality of it.'",
        "'speaker_4': 'In regard to the recent illnesses and deaths, I've heard it said before, but the CDC has come out officially and said that 84% of those were admitted to using THC products illegal as illicit drugs off the black market.'",
        "'speaker_4': 'And they assume.'",
        "'speaker_5': 'That is actually a.'",
        "'speaker_4': 'Higher amount and less amount of a vapers because they don't trust that people are actually being elusive to what they're using.'",
        "'speaker_5': 'I think a more effective way of cracking down on that would be to go after the illegal cannabis market.'",
        "'speaker_4': 'If that seems like too big of a task, I don't know what would happen.'",
        "'speaker_5': 'If there was a black market.'",
        "'speaker_4': 'E-Cigarette market. We are a passionate industry.'",
        "'speaker_5': 'We want to stay alive and like we're not selling to kids.'",
        "'speaker_4': 'Looks like I'm.'",
        "'speaker_5': 'Running out of time. We do have a lot of options.'",
        "'speaker_4': 'Only selling 21 over establishments like bars. Same thing with vaping.'",
        "'speaker_5': 'Require a scanner for any e-cigarette.'",
        "'speaker_4': 'Purchase.'",
        "'speaker_5': 'Including delivery of online.'",
        "'speaker_4': 'Purchases. And a lot of the kids are getting them online and and everything like that. So nicotine nicotine restrictions on levels licensing and pull our license if we if we fail.'",
        "'speaker_5': 'At any of your tests.'",
        "'speaker_6': 'Thank you so much.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_6': 'That stuff is Gina Payne, you know.'",
        "'speaker_4': 'Good evening. My name is Dr. Gina Peony. I'm a retired professor from Cal State, Long Beach and Public Health. I've been an advocate of public health for decades. I'd like to address the fallacy that vaping is harm reduction.'",
        "'speaker_4': 'We're finding that it is not. The current epidemic is indicating that vaping has an acute toxicity. You cannot compare this to the chronic toxicity of tobacco. So don't fall into that fallacy. The second thing is that in public health, we have a history of moving forward for prevention before we know the actual cause.'",
        "'speaker_4': 'We have a history of doing that. John Snow took the handle off the pump and stopped the epidemic before we could see cholera in the microscope. We could prevent AIDS before we knew the cause was HIV. This is another opportunity of prevention.'",
        "'speaker_4': 'You don't have to wait to find out the exact cause. So I also am a mother of two daughters that graduated from Milliken. My youngest daughter told me she graduated in 2014 and she said it was easier to get vapes than Cigarets.'",
        "'speaker_4': 'She was offered them all the time. Thank you.'",
        "'speaker_6': 'Thank you so much. That concludes our public comment. We're going to take it back behind the rail for the council. Next up is council member Mungo.'",
        "'speaker_5': 'Thank you. I really want to appreciate the amount of public comment. I know that this was a US Council agenda item created by council members. So you didn't get included in an outreach process yet? I agree with Councilmember Richardson that we really need to move down that pathway.'",
        "'speaker_5': 'I would like to. Propose that we make the ban effective January one. That would give us three months, 90 days for people to sell what's on their shelves and so on and so forth. I think that it should be limited to non-veg shops, but citywide we should ban the sale of all flavored vape and jewel and any'",
        "'speaker_5': 'violations of any sales of these products could result in in loss of your licenses. And I don't know what licenses we have control over in those because I don't know everyone that sells them. 490 is a very high number, and so I'd like to learn more about that at the vape shops.'",
        "'speaker_5': 'I'd like to require 21 and over signage, tobacco use warnings, limit of nicotine for sale to the 2.5%. Require an ID check. I don't know if it's legal. If they catch someone with a false ID, if they could be required to hand over the stack of false IDs collected to the city.'",
        "'speaker_5': 'I don't know if we'd want to get involved in that or not. I'd be looking for a recommendation from our health director on that because I think that. If there is no process where kids get stopped. From this and their parents don't know.'",
        "'speaker_5': 'What then? It just continues to go on. They go to alternative sources. And then I'd like to work on a collaborative with the vape shops where they provide us data. What are the zip codes of individuals buying vape?'",
        "'speaker_5': 'What vape products are sold to? What zip codes? I think that goes to Councilmember Richardson's point. And then I'm completely open to an a full ban if we find any violation. And the way that that would happen is if there's only currently eight vape shops.'",
        "'speaker_5': 'The moment one of you sells to an under 21, you're gone. That's it. So eight violations and we have a citywide ban. I appreciate that many other cities and counties have come forward with ideas. And one of the things I love about being on the Long Beach City Council is we're not all of those other cities.'",
        "'speaker_5': 'I think that this is a huge opportunity for us to stand apart from the rest. For us to implement a very aggressive campaign, moving people towards and away from tobacco. I mentioned to Councilmember Richardson, I surveyed my four family members that smoke.'",
        "'speaker_5': 'Two of them are nicotine and one of them is wintergreen. Flavor. The wintergreen is chew. And so these are adults that I would like to see move towards vape and then eventually towards nothing. But right now, I don't see them quitting any time soon.'",
        "'speaker_5': 'And I know they've one person's tried it multiple times, multiple, multiple times. And the failure is is very trying. Two of them have young children and have both tried to quit when their children were around because they didn't want to have spittoons around their house.'",
        "'speaker_5': 'I see people vaping and driving. I will tell you, I met Trevor when he brought his vape shop to the fifth District. And I will tell you, I met with the landlord. I was afraid. I didn't think that it was a good location.'",
        "'speaker_5': 'I definitely put up a lot of barriers because I had serious concerns about the youth. What he has demonstrated is to be a successful art conscious, environmentally conscious, and really an advocate for adult use only and getting off of nicotine.'",
        "'speaker_5': 'Because when I was in high school, everyone went to this one individual who, by the way, still lives in the fifth District and everyone would buy Cigarets from him. Everyone, he wore a trench coat. He'd open it up.'",
        "'speaker_5': 'You could buy a pack of cigarets you could buy. I'm not joking. He lives in Lakewood Village to this day and he you could buy a cigaret for $10. And so I don't want to be there. I really feel we need to get rid of the jewels.'",
        "'speaker_5': 'And then I also searched Amazon for 1999. I can have mango flavored vape delivered to my house tomorrow. If I order within 3 hours, it'll be there tomorrow. And so I really hope that the council and my colleague, Councilman Price, will consider the fact that there's only eight vape shops.'",
        "'speaker_5': 'And if we work with them over the next 60 days to come up with a plan that we really could come up with something better than any of the other bands we've ever seen, with the goal of reporting numbers of how many individuals you've pulled off of cigarets and tobacco, because I think that there's a future in'",
        "'speaker_5': 'finding a solution. So with that, I'm open to continuing to hear the items of my colleagues.'",
        "'speaker_1': 'Thank you, Councilmember Super.'",
        "'speaker_9': 'Thank you. I have a statement to read from Vice Mayor Andrews, if you'll bear with me here. This is from Dee Andrews. I believe that it's important that the city council act to protect the health of Long Beach citizens in light of the nationwide health impacts of e-cigs and other flavored vapor products that have recently been in'",
        "'speaker_9': 'the news media. As a part time educator at the high school level. I have to say that any proactive measures we can take to protect youth are very much worth it. Teenagers already think they know it all without the added pressure of industry tactics that use flavor and other attractive methods to make a profit.'",
        "'speaker_9': 'As adults, we make a choice on what we purchase and consume. Teenagers who may not have access to products do not need an extra layer of unhealthy products. I hope this matter is taken seriously as deaths are increasing, and we must work proactively with businesses getting the word out that these products are not safe and not a'",
        "'speaker_9': 'safe alternative to cigarets. We are doing this for a healthy Long Beach. Sincerely, Dee Andrews.'",
        "'speaker_1': 'I thank you, Councilmember. Councilwoman Price. Okay.'",
        "'speaker_2': 'So just a couple of thoughts. First of all, I want to thank Vice Mayor Andrews. He did sign on to this item and I want to thank him for his support and for those comments. I know he's not here tonight, but he's been very engaged in this discussion.'",
        "'speaker_2': 'I don't accept the I guess there are friendly amendments. I don't accept, expect, accept them and I'll say why, at least not in their entirety. We're talking about a public health issue where people are dying. People are actually dying.'",
        "'speaker_2': 'I understand we want to be business friendly, trust me. Let me repeat.'",
        "'speaker_1': 'Let me. Let me just make sure Councilman Price has the floor.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'When pressed.'",
        "'speaker_2': 'Continue. So while I want to support our businesses and do everything we can to work with them, let me just say we are the only city that's offering a mitigated temporary ban while we figure out some policies that will be long term implemented.'",
        "'speaker_2': 'Every other city and county and state has proposed a full, permanent ban. We are trying to approach this from a mitigated standpoint by saying let's get these products off the shelves as soon as possible because they are killing people.'",
        "'speaker_2': 'They are actually killing people. And we have a duty as we have a fiduciary duty, we have a duty in every way to protect our consumers and our youth. And I cannot say that we are going to wait three months and keep these items on the shelf while we continue to see negative impacts to the youth.'",
        "'speaker_2': 'We've already had two incidents of pulmonary injuries in the city of Long Beach. What if one of those was a death? One of the one of those was the death of a of a young child. So we're talking about a temporary ban that gives us an opportunity to work with the businesses.'",
        "'speaker_2': 'Absolutely. We want to work with the businesses. And Jessica, I love your points. When we talk to every time we talk about a ban, people say, oh, this is going to cause everyone to go to the black market.'",
        "'speaker_2': 'We had that conversation with marijuana. And you know what? The number one complaint we're getting with marijuana now is that there's too much competition from the illegal dispensaries. The whole reason we enacted legislation and to legitimize it in the city of Long Beach is so that we wouldn't have a black market.'",
        "'speaker_2': 'And yet the number one complaint we're getting now from the legitimate business owners is that there is a thriving black market. And so I don't think a ban is going to cause any of these businesses to go out.'",
        "'speaker_2': 'I really don't. We're talking about a temporary ban. Look, I own a small business. If there was a national data tomorrow that said the product that my store offers is killing people. I would stop and pause and I would think, okay, maybe I need to think about the future of my industry because fighting a temporary ban today'",
        "'speaker_2': 'is not going to change the fact that there is a mechanism associated with vaping that is causing pulmonary injuries. That mechanism needs to be studied. This is not a traditional class one or Class two medical device that gets FDA clinical trials.'",
        "'speaker_2': 'So we're just starting to learn more and more about this industry as a result of deaths. And I don't want those deaths to be Long Beach deaths. So I'm asking my colleagues, I submitted this item. We've been working on it for four months.'",
        "'speaker_2': 'Up until tonight. I did not expect or know for many of my colleagues that they wanted to somehow exempt vape shops from this 60% of the sales according to our data. Of Youth comes from products sold in vape shops.'",
        "'speaker_2': 'So while I appreciate our eight businesses are checking IDs and I think that's wonderful. 60% of the youth are purchasing their products in vape shops. That could be completely bogus information. I don't know. But we work with our health department and we rely on them regularly to form opinions and conclusions and policies on behalf of the city'",
        "'speaker_2': '. That's our job to do. So with all due respect to Councilwoman Mongeau and I have tremendous respect for her. If this was any other industry where the product was killing people, we would say, let's stop, let's pause and let's take a look at it.'",
        "'speaker_2': 'And you know what? We have worked very closely with our businesses in Long Beach to shape policy so that it's well-intentioned and thorough. And I'm open to doing that with the vape shops. I'm not saying that we should have a permanent ban tonight, although I would support that.'",
        "'speaker_2': 'But the item that I drafted is let's take an immediate pause because people are dying. People are literally dying. We have a duty to take a pause and mitigate that. Will people still get. I can't control what people buy on Amazon.'",
        "'speaker_2': 'Absolutely. But we can control what people buy in Long Beach. I'm not here to control what people buy on Amazon. That's that's not within the purview of our jurisdiction. This item is meant to address what people buy in Long Beach.'",
        "'speaker_2': 'So I'm asking for my colleagues support on this item. I think some of the item some of the suggestions tonight by my colleagues were amazing in terms of working with the companies, trying to develop comprehensive policies. Education and outreach is huge.'",
        "'speaker_2': 'I'm the one that brought the education and outreach item to council for cannabis, and I think we could do a similar thing. But this item is not about getting people to stop. Smoking or not be addicted to nicotine.'",
        "'speaker_2': 'This item is because.'",
        "'speaker_5': 'The.'",
        "'speaker_2': 'Products are being ingested through a mechanism. That is deficient on research right now. And the products are causing pulmonary injuries to people. It is a public health emergency. This item isn't about let's work with people and help them not be addicted to tobacco.'",
        "'speaker_2': 'That's a great conversation. It's a wonderful conversation. Someone should bring an item to talk about that if they want. But my item tonight is about the public health issue of people dying as a result of the mechanism of vapes which are sold in vape shops and they're sold in convenience stores.'",
        "'speaker_2': 'So thank you.'",
        "'speaker_6': 'Next up, we have councilmember pearce.'",
        "'speaker_8': 'I i support the statements made by councilmember price. I hope that we can get the report from our health department to kind of open up our eyes to the facts about this so that we we have those before us.'",
        "'speaker_8': 'I support a ban as soon as we can while we explore that and understand more the impacts. But absolutely, people are dying. We have to act fast. Thank you.'",
        "'speaker_6': 'Thank you. Council member Supernormal.'",
        "'speaker_9': 'I'm going to speak for myself now. I've completed my duties to the vice mayor. And first, I want to thank Kim Kirkman from Wilson PTA for speaking here tonight. Kim, I'm sorry we didn't get you through your entire conversation there, but I also have a pipeline in to Wilson High School for information.'",
        "'speaker_9': 'And that just made me think that as far as some type of ordnance is crafted, any way we can reach out to the school district and get them involved in this, in crafting this, I just think we have to have a larger conversation there because I think everyone in this room wants to protect the youth.'",
        "'speaker_9': 'The only question is how we get there. And then I think for the comments that Council Member Richardson made, I think maybe Councilman Price and you are on the same page. It just wasn't really articulated that way that this is a temporary ban, then get it sorted out.'",
        "'speaker_9': 'Okay.'",
        "'speaker_2': 'So, yeah, we're on.'",
        "'speaker_9': 'Okay. So I think that's where we are now. I just want to thank everyone for spending some time with us here tonight. I'm the biggest proponent of streamline council meetings, but sometimes it takes this type of process and this is the beginning of conversation.'",
        "'speaker_9': 'So I think it's going to be very fruitful in the long run. So thank you.'",
        "'speaker_6': 'Thank you. And I'd like to also just remind the council we have five minute limits under our new rules. And I know are some some of our constituents are paying attention and clocking us. Councilmember Mongo.'",
        "'speaker_5': 'Thank you. I just don't want to be misquoted. And I know council member Price doesn't want to be misquoted either. I'm not here trying to stick up for any small business over any other small business. What I'm saying is, and I think maybe some of our council officers and I can identify a person calls our office and'",
        "'speaker_5': 'says X is happening. And it's it caused this accident, which then means you need to change the stop sign. But when you go back and look at the data, perhaps it wasn't what we perceived. And so, again, when I signed on to the item, because I am supportive of a ban, I did that with the caveat from'",
        "'speaker_5': 'my chief to yours that I want to craft something more comprehensive, because I don't know a lot about Vape. I don't know a lot about the industry. And I'd read conflicting reports that the CDC doesn't necessarily think that it's from FDA approved cartridges.'",
        "'speaker_5': 'And so what I don't want to do is punish and ban an industry that has not actually caused any deaths. And I think it's very inappropriate across the state for us to continue to blame people without the information.'",
        "'speaker_5': 'Specifically, do we believe there's correlation, perhaps? I don't know. But 80% related to THC? I think that there's a bigger issue at play that we need to address as well. And I'm not trying to bring my own item or step on your item.'",
        "'speaker_5': 'That's not my intent at all. I just also don't want at least a partner that's been in my district as a good vape shop. Not to mention there's a not so great vape shop on the border of my district in Lakewood that does sell to youth.'",
        "'speaker_5': 'I don't want to funnel kids there because that particular vape shop, which is going to be next to the new marijuana dispensary, is not a great partner and is not a part of the plan. And so for the hope that we could all work together to find a solution.'",
        "'speaker_5': 'I was hoping for that to be the case. So what I will state is I will be supportive today, but I hope that the Health Department can come back very quickly and find a way that we can also utilize this as a public health campaign.'",
        "'speaker_5': 'And I think that I see the news media here today, and I hope that you'll report this as a city who's really working hard to know the facts behind the deaths, to ensure that we are making the right bands so that we can protect our youth.'",
        "'speaker_5': 'Because every single person up here, including myself, is first and foremost looking at the health of our youth and ensuring that we're not pushing them from one thing to another. I'm not going to get into a whole nother conversation today, but like soda and then juices that have too much sugar.'",
        "'speaker_5': 'And it's a it's a it's a bigger item overall that we as a policy body get to discuss. And I was being very genuine to your request to have a genuine conversation. And when I heard from individuals who are much more knowledgeable about Vape than I am, I really feel like they were being genuine.'",
        "'speaker_5': 'When you bring forward a stack of ideas like that, I think to myself, being a police officer, what mechanisms do I have to get at youth to stop breaking the law? And I will tell you time and time again, it's their parents.'",
        "'speaker_5': 'It is getting their parents involved and collecting those IDs. You're not currently getting to the parents. How do we do that? What does that look like? How do we bring them in? Is there any kind of. Appropriate level of peer pressure that we can provide and how do we encourage that?'",
        "'speaker_5': 'I don't know what those answers are. We've only had ten days to discuss this item. It has been on a bigger level. I have watched the county supervisor meeting and other meetings throughout the region, but I just don't know that we can say that we aren't.'",
        "'speaker_5': 'We are still not banning non flavored THC. And so I'd like to amend the item to include banning dual and non flavored THC vape cartridges. If you'd like that friendly.'",
        "'speaker_2': 'No, I don't accept the friendly.'",
        "'speaker_6': 'Okay. So Councilmember Turanga.'",
        "'speaker_7': 'Okay. So we've gone. We'll circle what appears to be here. And just and this I had and we went from a temporary to a permanent. And I think we're back to temporary territory where we.'",
        "'speaker_10': 'Well, where I think we are is we have a motion on the floor to ban all flavored tobacco products and vape products, including the menthol flavor. 30 days to the audience would give 30 days to come into compliance with the ban.'",
        "'speaker_10': 'The ban would be temporary until further action by the City Council. And prior to bringing back the ordinance for Council's consideration, the Health Department would have a presentation to the City Council.'",
        "'speaker_7': 'Remember prices that you're understanding of the motion. Like.'",
        "'speaker_6': 'Before we go to a vote, I'd like to just a point of clarification as well. How long is this ban going to be in place?'",
        "'speaker_10': 'Until further action by the city council.'",
        "'speaker_6': 'Okay. So do we have any idea when. When we'll be able to? Because I want to. Yeah. I'd like to be able to understand that we're going to be forming a policy and that we will have a process where we're outreaching with the public.'",
        "'speaker_6': 'Um.'",
        "'speaker_2': 'Sure. So why don't we stakeholders? Why don't we include, as part of this motion that our health department can reach out to the vape? Yeah. Businesses in the city and start working on some education and outreach options similar to what we did with our cannabis industries.'",
        "'speaker_2': 'And then also, I know that many council members here are involved in researching what's going on around the country. But certainly if our health department could take the lead and if there's anything new that's discovered regarding health impacts or if there's any specific danger zones that were made aware of as a result of some of the research'",
        "'speaker_2': ', I know that for the deaths are conducting a lot of autopsies and it's actually a big issue is the mechanism of the vape and how the product breaks down into the lungs. And so hopefully we can follow that research so that when the item comes back and perhaps health department can issue ATF to all of us, that'",
        "'speaker_2': 'talks about those outreach efforts and the updates in policy and health impacts that they're watching. This is a trend that I imagine our health department will be following closely. So I think I would defer to them to bring it back when they feel they have enough for us to move forward on something.'",
        "'speaker_6': 'Think that clarifies things a little bit better for me personally. Are you okay, Mr. City Attorney? Okay.'",
        "'speaker_2': 'Hearing that this collopy is okay. We didn't ask her. I don't know if that's feasible.'",
        "'speaker_6': 'Yes, of course.'",
        "'speaker_11': 'It will be. I mean, we have been tracking on it. We'll be able to provide the data and we'll we'll issue a two from four on the outreach plan with our folks at Timeline.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_6': 'And I'd also like to just encourage us to work with some of the community organizations that do education around this issue. I think all of us as council members can can really help reach our school age children and help our parents as well.'",
        "'speaker_6': 'With that members, please cast your vote.'",
        "'speaker_0': 'Ocean carry.'"
    ],
    "Recommendation to adopt Specification No. RFP TI18-063 and award contracts to Deloitte Consulting, LLP, of San Diego, CA, to provide implementation services for a Customer Relationship Management (CRM) system in the amount of $1,650,000, with a 10 percent contingency in the amount of $165,000, for a total amount not to exceed $1,815,000, for a period of one year, with the option to renew for one additional one-year period, and to Salesforce, of San Francisco, CA, through its recommended reseller, Carahsoft Technology Corporation, of Reston, VA, for the software licenses, in the amount of $294,807, with a 20 percent contingency in the amount of $58,961 for a period of one year, for a total amount not exceed $353,768, with the option to renew for four additional one-year periods, with annual increases ranging from 2.5 to 7 percent; authorize City Manager, or designee, to execute all documents necessary to enter into the contracts, including any necessary amendments; and  Increase appropriations in the General Services Fund Group in the Technology and Innovation Department (TI) by $1,": [
        "'speaker_6': 'Next up, item number. 35.'",
        "'speaker_0': 'Adam, 35, is a report from technology and an innovation recommendation to work contracts to Deloitte Consulting to provide implementation services for a customer relationship management system for a total amount not to exceed 1.8 million, and to sales force for the software licenses for total amount not to exceed 303,007 and 68 citywide.'",
        "'speaker_6': 'Okay. Councilmember Mongo.'",
        "'speaker_5': 'Yes. We are very excited to hear a report from Ms.. Eriksson, and I was also asked by the mayor to give positive comments and vibes to Ms.. Eriksson, because we're so excited to finally have this presentation.'",
        "'speaker_10': 'So members of the city council, we echo that. This is exciting. This is something that the council has really invested in. And when we were in front of you about a year and a half ago, with all of our critical technology needs, this was one of the major focus areas of the council.'",
        "'speaker_10': 'And so with that, I'll turn it over to Lee Ericsson, who will walk through what we're doing with our customer relationship management system.'",
        "'speaker_4': 'Good evening. Members of City Council. We are here tonight to request approval to enter into contracts with Deloitte Consulting and Salesforce to implement a CRM or customer relationship management system. This project is a high priority for the city and was included in the technology systems category of the critical technology infrastructure needs that acting city manager Tom Modica'",
        "'speaker_4': 'just mentioned. First I want to cover the goals of the CRM project. In 2010, the city implemented Go Long Beach, a mobile application that allows residents and city staff to submit service requests each year. The usage of go along beach has increased and in fact usage tripled over the last five years to almost 60,000 service requests in'",
        "'speaker_4': '2018. As Gold Long Beach becomes more and more popular. Manual processes need to be automated to keep up with demand. Even with the success of Go Long Beach, it is evident that a true customer relationship management system is needed.'",
        "'speaker_4': 'The goals of an integrated and comprehensive CRM include to provide residents easy access to city services, provide tracking and monitoring capabilities that can serve as a tool to help improve city service delivery, improve resident engagement and access in conformance with the city's language access policy.'",
        "'speaker_4': 'Improve openness, transparency and accountability. Improve alignment of resources with service demands, and enable district level reporting capabilities that will drive improved data informed decision making. To support this effort. The city hired a consultant to assess the city's organizational readiness capabilities and resource capacity, as well as to create a strategy for a CRM system.'",
        "'speaker_4': 'We then use that assessment to help put together an RFP to solicit potential vendors for the system. The RFP process was multi-phased included a request for clarifications to gain further information and clarify responses. A multi departmental selection committee reviewed the nine responsive vendors and invited five firms for product demonstrations.'",
        "'speaker_4': 'A best and final offer request was then issued to the top two finalist, followed by reference checks. The Selection Committee then selected the Salesforce platform implemented by Deloitte Consulting. Salesforce is an industry CRM leader with 19.5% market share.'",
        "'speaker_4': 'Last year, Gartner has recognized Salesforce as a leader for CRM systems over the last 13 years, as evidenced by ability to execute and completeness of vision. Salesforce has public sector experience and a flexible platform in both look and functionality.'",
        "'speaker_4': 'The platform is also scalable and cloud native. Deloitte has a proven track record as an implementer, with both the City of San Diego and Orange County. Deloitte has also stellar public sector customer references, and all project team members are local to Southern California, which helps with logistics and travel costs.'",
        "'speaker_4': 'The scope of the CRM includes replacing the current Go Long Beach app with a more robust system. The new app will retain the goal Long Beach brand but offer a modern user interface. The customer self-service system will be able to be accessed via tablet, phone or laptop and allows constituents to track status of request and will also'",
        "'speaker_4': 'include access to a knowledge base to help residents placing requests. There will also be a robust back office utility that will allow staff to enter requests from constituents that call in and or to check status of requests. There will be seamless interfaces to back office work order systems which will eliminate duplicative and manual entry by staff.'",
        "'speaker_4': 'Lastly, there will be dashboards and reports that provide metrics to city staff and officials on the service requests, including items like duration, to close the ability to identify multiple requests that are on the same issue and to better pinpoint the geographic location of the request.'",
        "'speaker_4': 'With this CRM system, the public can expect a replacement of go Long Beach with modern technology. The transition will involve a robust communication and education plan. In addition, the Platform and Apple have multilingual support in conformance with the city's language access policy, and there also be enhancements to the city's website, Long Beach Lock up to serve as'",
        "'speaker_4': 'a one stop source for information about city services and the CRM system will include all existing go along beach topics, plus new topics such as beach and park maintenance items backed by digital workflows. Afghan officials can expect one common platform to manage interactions with the public, insights into performance through reporting tools like dashboards, and the improved ability'",
        "'speaker_4': 'to recognize and address duplicate service requests, among many other benefits. These screenshots show what is possible and serve as a blueprint for what the new Go Long Beach app may look like. The new Go Long Beach will be developed from the ground up by Deloitte based on city direction and staff and officials will be provided with opportunities'",
        "'speaker_4': 'to provide feedback throughout the project. The city will also receive a knowledge base as part of the implementation. The goal of the knowledge base is to provide self-service for constituents through one channel and to provide staff and officials with one consistent tool and points of reference for comment.'",
        "'speaker_4': 'Answering commonly asked questions. So the first year cost of the serum project will not exceed $2.16876 million, which include $2,168,768, which includes software, license costs, implementation, services and contingency. The ongoing license costs are already included in the FY 20 budget that was approved by City Council last month.'",
        "'speaker_4': 'The upfront costs are covered by funding identified in the critical technology infrastructure needs, as well as the remainder of funding coming from savings in other areas of the Technology and Innovation Department. FY 19 budget. If City Council approves this award appropriation tonight, the project will be kicked off this quarter and a new CRM system will be launched'",
        "'speaker_4': 'and operational by the end of 2020. This concludes my presentation. I am joined by burying a body, our brand new business Information Services Bureau Manager and Scott Otter, our business information technology officer. And collectively, we are ready to answer any questions that you may have.'",
        "'speaker_6': 'Thank you for that great presentation. I'll take it back. I know Councilmember Mongeau spoke on this to want to continue.'",
        "'speaker_5': 'Yes. Thank you. So I just want to tell you how pleased I am with the work that's been done. I know it took a long time, but I know it takes a long time to be thorough. I appreciate the level of research that you went into.'",
        "'speaker_5': 'I think it's important to note that these conversations are happening across the region. I also serve on a county wide mobility discussion and we are talking about how systems like these need to integrate over city lines. Within my district there is a donut hole of unincorporated, and if an individual drives through that area not knowing that they're'",
        "'speaker_5': 'no longer in the city of Long Beach. They would potentially use the gold on each app and not know. And so I look forward to the first phase, which is us handling our responsibilities to our constituents in a meaningful way.'",
        "'speaker_5': 'And then I'm. Our next agenda item is also related a little bit to this, but how we pull it all together so it's seamless across the region that Long Beach is the leader in allowing constituents to interact with their local government.'",
        "'speaker_5': '24 hours a day, seven days a week without coming to City Hall. And so I'm really excited for this. A lot of people talk about, oh, when you got elected, didn't you get a booklet of all the backlogged data and all the sidewalk requests that were pending or the tree stump removals that had been pending?'",
        "'speaker_5': 'We didn't. We received the database, but it was in the system in methodologies of the prior councilwoman, something that we did not know or understand how to really interpret. And so this tool will be able to be passed, not passed at all.'",
        "'speaker_5': 'It's it's a structural tool that is the responsibility of the city for us as council members to interact with to ensure constituents get services. My second year, an individual told me that three different council members had promised to remove their tree stump.'",
        "'speaker_5': 'It had been 17 years. Systems like these won't allow that to happen. We'll be able to get data that shows how long reports have been or requests have been pending and why they're not getting done. And so for this, I'm very excited.'",
        "'speaker_5': 'Congratulations to Lia and the team. I know it doesn't just happen at the top. So to each and every one of the members of the team that had a role in this. Thank you.'",
        "'speaker_6': 'I also remember, Piers, you seconded emotion.'",
        "'speaker_8': 'Yes, I did. Second emotion. Thank you. I'm really excited. I feel like we've been talking about this every budget. We kind of bring up the app. My office uses it a ton. I have a couple of questions and you might not be able to answer them, but that's kind of like a wishlist right now.'",
        "'speaker_8': 'Even though I know we've got a year to go through this process, I'm wondering if there's a way to overlap our district lines in here so that we very quickly could be able to say, okay, here are the request and that that constituent now understands, Oh, when I'm filling this out, Councilmember Pierce is my contact.'",
        "'speaker_8': 'So if I don't hear back, maybe she's the person I can follow up with. We're getting nods.'",
        "'speaker_4': 'Awesome. I'll go ahead. Yeah, that's. We are planning on having district level geographic boundaries so we can work to incorporate that.'",
        "'speaker_8': 'Wonderful. And then when I'm looking at just your possible images, I see location of issue. Are we still going to have the geo mapping where you'll be able to? Okay. I just wanted to make sure on that. This is great.'",
        "'speaker_8': 'I think it looks amazing. I look forward to going through the process over the next year and maybe we could also put a competition layer in here. You know, we can say let's start a competition that begins on this month and see who gets the most go Long Beach request.'",
        "'speaker_8': 'It's kind of fun. It's kind of fun, guys. Thank you, guys.'",
        "'speaker_6': 'You're on your own. Yeah, I.'",
        "'speaker_7': 'Don't think so, because after all, we are about service to the community. It's not a competition. We all we all win. You know, one of the one of the goals that you set here in terms of the the project goals and you stood out to me right away obviously is a I don't number three improves resident engagement'",
        "'speaker_7': 'and access in conformance with the city's language access policy. Can you describe how you're going to do that and will it require additional staffing and other types of human resource management type of? Take this A to take on this and this item.'",
        "'speaker_4': 'Councilman Yarrawonga. So the app itself with the labels will be translated into the different languages and it includes template standard responses that would be coming from commonly from common items. But what could happen with more customized individual interactions?'",
        "'speaker_4': 'We would be meeting city staff who have translation capabilities to be responding to those. So the actual roll out of that will be determined as part of the project scope and get department involvement and how that would actually work when we execute this.'",
        "'speaker_7': 'That sounds great. I'm looking forward to that. Thank you.'",
        "'speaker_6': 'With no other comment. Is there any public comment on this item? Or you. Let's cast their votes. Oh, I remember supernova. Well, was it? There was nobody signed up on it. I don't. Well, come on up. Come on up, please.'",
        "'speaker_4': 'Would you on this one? I think it's a really good plan. Mm hmm. It could be make be a big benefit, make it easier on customers, easier on city staff to go electronic. I didn't hear anything about cost savings associated with the system.'",
        "'speaker_4': 'And normally when you go electronic, there are cost savings. Secondly, I'd also like to see I know Deloitte has industrial engineers and in terms of how the processes work in the city, I think the industrial engineers could be brought in as well, although I wouldn't want to negatively impact your budget.'",
        "'speaker_4': 'But great idea.'",
        "'speaker_6': 'Thank you, members. Please cast your votes.'",
        "'speaker_0': 'Councilmember Pearce Councilmember Mongo. Motion.'",
        "'speaker_6': 'Thank you. I'd like to go to item number 22 for housekeeping purposes. I know it was announced at the beginning of the meeting that we'd be laying over an item and we just need to vote on it, I'm told.'"
    ],
    "Recommendation to request City Manager to work with the Technology & Innovation Department, and all other appropriate departments to work together, research, and report back within 180 days on the potential costs, benefits, partnerships, and challenges of a City of Long Beach-issued identification card.": [
        "'speaker_0': 'Motion carry.'",
        "'speaker_6': 'Annexes. Item number 28.'",
        "'speaker_0': 'Item 28 is a communication from Councilwoman Mango Councilwoman Price Council Member Muranga Councilman Austin Recommendation to require City Manager to work with Technology and Innovation Department and report back within 180 days on the potential cost, benefits, partnerships and challenges of a city of Long Beach issued ID card.'",
        "'speaker_6': 'As a member. Mungo Thank.'",
        "'speaker_5': 'You. I know earlier this year a member of the community stated that they don't always know what the council agenda item is by the verbiage that's on the screen. So I'm going to read you the subject line of the agenda item.'",
        "'speaker_5': 'The Long Beach one card streamlining, resident connectivity and access to city services. I brought this item as a continuation of making sure that we're putting forward best practices to ensure that our residents have the capability to easily engage and access the things that matter most to them, whether it's providing department or policy feedback, reporting a pothole, finding'",
        "'speaker_5': 'a library program, looking for a free, family friendly event, or renting a park space for a birthday. All of those activities could be streamlined into one easy place for residents to access. Currently, a resident might have up to nine different accounts in the city.'",
        "'speaker_5': 'They might have their library card number, their gas card number, their gas account number. They might make reservations at Parks and Rec. And each and every time they have a identity that is not necessarily known to the other departments.'",
        "'speaker_5': 'And so through the CRM system that was approved in the previous item, we are implementing functionality that will better able us to manage our communication systems with residents with the Long Beach One card. We would also be giving the residents a portal for easy engagement and connectivity in their hands.'",
        "'speaker_5': 'This could connect a citywide calendar. When we talk about equity and access, a lot of that conversation falsely gives a representation of a barrier fence in which a tall person can see over the fence. And we have to let the shorter people stand on boxes to see over.'",
        "'speaker_5': 'I'm saying let's remove the fence. Let's take down the fence. It's the 21st century, and it's time we seek innovative, technology based solutions to make sure all people have equal opportunity for access, not those that know their council offices phone number, not those who know that public works is the one who handles that versus Parks and Rec'",
        "'speaker_5': ', whether it's language, access, identification, qualifications, or needed services of housing, public transportation, parking, access to citywide parking lots, access to our our regional park health and senior programing, access to our C one and C two meal programs for seniors, arts and cultural institutions as we.'",
        "'speaker_5': 'As well as we have the capability to connect everything with banking and payment functions. There should be that same functionality that allows our residents connect easily with us. That's why I'm proposing the Long Beach one card as a solution.'",
        "'speaker_5': 'As a city, we should strive to get everyone connected. And so with that, I hope that I'll have my colleagues support in finding the next step. Right now, we have several different apps. You have an app to review, a police report, you have an app to do Long Beach Transit.'",
        "'speaker_5': 'And within Long Beach Transit, you can enroll and reserve your seat to get to and from events. And we should be able to have that same connectivity across our library programs, our park programs. Individuals call my office and say I registered for summer day camp with these deposits and now I have to go somewhere to do something'",
        "'speaker_5': 'to get my kid enrolled. To be able to move from six weeks of care to seven weeks of care should be easy and convenient for the senior mom, single mom. And so with this, I ask for my colleagues support.'",
        "'speaker_6': 'Thank you, Councilmember Mongo. I'll remember. Richard. I'm sorry, Your Honor.'",
        "'speaker_7': 'Thank you. Acting mayor. Normally I'm opposed to any kind of additional ID cards that are going to be given to people to identify themselves where they're at. But I sound down on this and because I think that it's a discussion worth worth having only to so that we could get more information about some of the technology that'",
        "'speaker_7': 'that we are in the 20th and 21st century. We are looking at more technology as we move forward, and I think that we need to be on top of it. So I'm doing this with a bit of trepidation in thinking this, that I want to see what comes out of it.'",
        "'speaker_7': 'So before I vote against it, I'm voting for it, but not that I'm going to vote against it at the end. But just giving a preview that in case it comes out to where I'm not totally sure that I want to support something like this.'",
        "'speaker_7': 'I just want to put it out there that there is some concerns that I might have with this card as it moves forward, especially as it relates to identifying people, residents who perhaps are not fully documented to be here.'",
        "'speaker_7': 'What would be the requirements to get the card? What types of ID and proof of residency they would have to show? Those types of things. So like I say, I'm checking this with a bit of trepidation, but let's move forward with it.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_6': 'Thank you. Well, if there's no objection, I want to go to public comment and then bring it back line. Will.'",
        "'speaker_5': 'I would love that. Would I be able to make one comment to council member?'",
        "'speaker_6': 'Would your comment hold you hold your comment.'",
        "'speaker_4': 'All right.'",
        "'speaker_6': 'Well, you got me. First, I'd like to call Leslie, then Jessica Quintana.'",
        "'speaker_4': 'Hi. I just wasn't really clear that we actually needed an ID card. I mean, I would think just a password and a name should do it for most things. The other thing that concerned me about this one is that it kind of smacks of Big Brother and a watchful eye of the city that, you know, they're going'",
        "'speaker_4': 'to keep track of every single thing that you do. And I think that makes people fearful. Um. I wouldn't want to inhibit their participation in anything by them being paranoid that their participation is being tracked. So that's it.'",
        "'speaker_6': 'Thank you for your comments, Mr. Quintana, please.'",
        "'speaker_4': 'Good evening. Jessica Quintana, executive director of Central Asia. As you know, we're a nonprofit organization in the city of Long Beach. And time and time again, we hear from our residents and families and youth that, you know, they need to reduce the amount of paperwork and IDs that they need to go get services within the community.'",
        "'speaker_4': 'You know, I think this is very innovative. Thank you so much, Councilwoman Mango, for bringing this forward. I think it needs work, you know? Definitely needs to have a good discussion in regards to the community, you know, not being fearing that their identity or their whereabouts are being tracked.'",
        "'speaker_4': 'We're trying to make this, you know, system very easily for our families and residents to get park recreation services, to be able to go get go to a food bank, to be able to get transportation. So I think there needs to be more thought into this initiative because there's definitely needs to be benefits for a lot of'",
        "'speaker_4': 'our low income families to be able to access services citywide. So not just in one eastern area, but also on the west side of area in north and south of of Long Beach. And so I think that if we can come up with a system that benefits our community residents to be able to access, you know, things'",
        "'speaker_4': 'for their families, education services, for the children to go to the library, to be involved in baseball, soccer. You know, one idea that shows that they're qualified, that they're eligible and they can participate. And so I think that that would reduce a lot of, you know, challenges for parents to access, you know, city services, whether that be'",
        "'speaker_4': 'the arts, culture, you know, recreation, you know, food banks, anything for the city. But I'm telling you at this point, this is very, very infant stage of this. And there needs to be a lot more discussion. I know up in Denver, Colorado, where I'm from, where I was born, because I grew up in Long Beach my whole'",
        "'speaker_4': 'life. They also have a one ID card. And so folks are able to access the bus system, you know, get library services, get recreation services, go to their local museums for free. So, you know, that's the kind of opportunities that we want to be able to provide our families.'",
        "'speaker_4': 'So I'm sorry.'",
        "'speaker_6': 'Thank you so much. I think the clerk gave you a little bit more extra time.'",
        "'speaker_4': 'Thank you, Mr. Clark.'",
        "'speaker_6': 'With that back Councilmember Mongo, you did want.'",
        "'speaker_5': 'To thank you. Yes. So Rusty is the most progressive cities across the country are the ones that are on the cutting edge of this. Oakland, Denver, San Francisco. I did feel that this was in its infancy, though. I have gone out and met with Jessica and one Benitez and others at Liberty City College and Lobby, Unified School'",
        "'speaker_5': 'District and Long Beach Transit. And I've done a lot of the initial meetings to get feedback on the initial item. I provided 180 days a six month period because I do believe that there is a greater discussion that really needs to be had.'",
        "'speaker_5': 'We are finding that passwords are actually causing more risk to people's identities than face ID or a thumbprint or something. Especially our senior communities are most vulnerable when they have multiple logins and passwords or a password that has to change.'",
        "'speaker_5': 'And so we feel as though I'm sorry, the experts have stated that it is better to have like a digital ID card on your phone of some sort that only you have access to with two two factor authentication.'",
        "'speaker_5': 'With that, it would also be opt in. And to to Jessica's point, a lot of the discussion of why I didn't bring this three months ago, even though it was prepared and we had these meetings so long ago, was because of the fear and discussion around the census.'",
        "'speaker_5': 'And we just didn't feel it was an appropriate time until that matter was handled. And then we felt like a six month opening to have that dialog would be appropriate so that we can really talk about moving forward in a more collaborative and collective way.'",
        "'speaker_5': 'I think also six months from now, we'll have made significant progress on the CRM. Significant progress. I see them all in the back. And so once that significant progress has been made, will really be able to better understand the utilization of this.'",
        "'speaker_5': 'That really is possible. I think of things like discounted swim lessons to be able to say click. Did you know your kid can go to a safety class today to learn how to swim before drownings? To be able to have that kind of push notification and access to individuals who opt in would be great.'",
        "'speaker_5': 'It also is great when something is going to happen in your community. We spend a considerable amount of money notifying people by mail that they don't open that something near their home is going to change and oftentimes they're not notified till too late.'",
        "'speaker_5': 'You'd be able to opt in to that. And so the possibilities are endless. And I really appreciate the openness and both by Councilmember Suranga, even with his trepidation and the support of his canton. I thank you.'",
        "'speaker_6': 'Thank you. Member Richardson.'",
        "'speaker_9': 'Thank you, Councilman. So supportive of the item. I think giving 180 80 days to evaluate it makes a lot of sense. Couple of things. So I think over the course of so, in most of those cities where they move forward with municipal I.D., there was a process of sort of engaging with communities.'",
        "'speaker_9': 'And so I want to make sure that that we call out specifically the undocumented community. Latino population, like the leadership, is engaged about making sure that this is something they're seen as a benefit, not a barrier to services.'",
        "'speaker_9': 'Also, sort of, you know, municipal I.D. has a lot of benefits and opportunities. I think one of the one of the greatest sort of trends is is the full integration of transit. And, you know, like we had a discussion most recently at Skegg about how we make decisions about what vehicle to take.'",
        "'speaker_9': 'Right now, you can grab you know, you might be able to grab an app, Uber or Lyft, and see how long it takes to, you know, to get from point A to point B or you might grab Lyft at a Lime app and see a scooter or a bike once in the area.'",
        "'speaker_9': 'Which one takes the most or at least time looks right now is how do we integrate all of that? Right. If you have municipal services and it may include Long Beach Transit, how do you integrate your app? Right.'",
        "'speaker_9': 'To say, do I prefer to walk? Do I prefer to scooter? I prefer to ride a bike or catch a lift to get where we're going. That's where things are heading. So I think when we think about municipal ID, I think our innovation department should be thinking about more than just identification, but integration of services that makes'",
        "'speaker_9': 'us helps us to make smarter decisions about emissions, smarter decisions about transportation and more efficient choices. So I'm certainly you know, I'm certainly going to track and sort of engage here. But I just want to be clear that, you know, there will be apprehension on this issue.'",
        "'speaker_9': 'And so I want to make sure that that is fully vetted out before it returns in 180 days. And I want to make sure that we we really put some real emphasis on transit. I know about tap car, you know, Los Angeles, but here in Long Beach, we're not we're not online in the same way.'",
        "'speaker_9': 'Even if we get tap cart, our transit agency, our bike share, our mobile, our scooters are all three separate sort of functions led by three different policy agencies, all in the train. Right, three policy agencies. If we want to make a decision about rates, you have to have three different conversations with three different agencies.'",
        "'speaker_9': 'If you want to talk about efficiencies, senior discounts, youth access, equity, how to distribute around town, right now it's three conversations with three agencies. We should at minimum, as we explore this, be thinking about a JPA or some joint committee among transit agencies to explore this conversation.'",
        "'speaker_9': 'So there's just a lot of thoughts here. A plan engage. Thank you, Councilwoman Mongo. I look forward to see where this goes.'",
        "'speaker_6': 'Thank you. Member Pearce.'",
        "'speaker_8': 'Yes, thank you. I did have a lot of conversations before coming to council tonight on this issue. I think in an ideal world, all of us have talked about wanting to have integration. I think it's wonderful that we have the CRM conversation happening right now, so I'd want to have a couple of questions answered.'",
        "'speaker_8': 'First, I'd like to understand how it would interface with our CRM system. I'd like to understand what the cost are. I'd like to understand how our other agencies not only I know that there's some issues where we wouldn't be able to have library cards because there's certain information that's privileged information that can't integrate.'",
        "'speaker_8': 'So really understanding where can we align different areas. There are a couple communities that are vulnerable communities. I know that the council members is saying it's an opt in. I have issues with creating a system that might be privilege for some that other communities fear getting involved with.'",
        "'speaker_8': 'So I would ask the staff in exploring this, sit down and meet not only with Jessica's organization, but the Long Beach Immigrant Rights Coalition. The Cambodian community is another population and then our senior population. So we have our senior advisory committee commission.'",
        "'speaker_8': 'I would want to make sure that how are we making sure that our seniors feel comfortable with this? And I think in an ideal world, it sounds great. Recognizing that it's going to take a lot of work to get there and being realistic with that.'",
        "'speaker_8': 'I see. I think that that's it in our school board. You know, I know that I spoke with our school board member. The represents my area and I know that they had a lot of concerns. And so let's just make sure that as we go through this, we do it kind of slow and with engagement from all'",
        "'speaker_8': 'stakeholders. So thank you.'",
        "'speaker_6': 'Thank you, Councilmember Mongo.'",
        "'speaker_5': 'Thank you. I appreciate the comments of my colleague. And I'll also add, and I alluded to this a few weeks ago when we were hearing the discussions at the state level related to banking changes and local banks. And so I think that I mean.'",
        "'speaker_5': 'We talk about some of our Section eight renters, and they don't even have a bank account sometimes. And they they live at cash advance check facilities that cash their checks and pay those amounts. I mean, long term, it could be even bigger than that.'",
        "'speaker_5': 'And I'm not I'm not going to add the banking in today, but I think that it's important to have the conversations with that in mind in providing that kind of financial access to some of our low income and most in need communities.'",
        "'speaker_6': 'Thank you very much. Hearing no more comment from the behind the wheel. Thank you for the very innovative and thoughtful item this evening and I'm sure we'll be having plenty of discussion on this in the future. Members, please cast your votes.'",
        "'speaker_0': 'Ocean carrying.'"
    ],
    "Recommendation to request City Attorney to explore joining an amicus brief urging the U.S. Supreme Court to take up a challenge to the 9th Circuit Court of Appeals decision in Martin v. City of Boise.": [
        "'speaker_6': 'King. So our last item of the day is item number 29.'",
        "'speaker_0': 'Item 29, communication from Councilwoman Price, Councilwoman Mango, Councilman Muranga and Councilman Austin. Recommendation to request city attorney to explore. Joining an amicus brief urging the U.S. Supreme Court to take up a challenge to the Ninth Circuit Court of Appeals decisions in Martin versus City of Boise.'",
        "'speaker_6': 'Okay. This item is. Up. Councilmember Price.'",
        "'speaker_2': 'Thank you. So I want to update the item a little bit because we filed it on the 23rd. And there are two stages. There are two points in time when you can submit an amicus briefs to the Supreme Court.'",
        "'speaker_2': 'One is at this stage, which is the petition stage, which the deadline for that has already passed, although it passed after we submitted our item for council consideration. The second stage where you can submit an amicus brief is at the merit stage and the merit stage is not yet before us.'",
        "'speaker_2': 'We have some time before the merit stage and it's not even for certain that we will get to the merit stage because the Supreme Court will have to determine whether the case has merit before we get to the merit stage, at which time we'll have seven days after the filing of that petition to file our amicus brief'",
        "'speaker_2': '. So at this juncture, I actually want to change this item. And because because we don't know if we're going to get to the merit stage and the petition stage has already passed. What I'd like to do is request that our city attorney prepare a letter of support for the L.A. County Amicus.'",
        "'speaker_2': 'I mean, sorry, not a letter of a resolution supporting L.A. County's decision to file an amicus brief. That's my my request tonight is that the city attorney's office be directed to prepare a resolution in support of L.A. County's amicus brief in connection with the case of Martin versus Boise.'",
        "'speaker_2': 'So so with that, let me give you guys some background as to why I think this item is important and ask for your consideration. So we we all know we talk about homelessness frequently as a council body. And we know that Long Beach is one of the best equipped cities to handle the crisis.'",
        "'speaker_5': 'And we are.'",
        "'speaker_2': 'Struggling, like every other city, to manage the issue in terms of its impact on residents, businesses, city and of course, those who find themselves homeless and need services. We have an amazing set of resources available at the Multi-Service Center and housing providers who are helping us with all types of assistance that our homeless population should choose to'",
        "'speaker_2': 'accept. We have outreach teams in the Health Department, police department, fire department, and hopefully soon our awesome lifeguards are all trying to get people into services. And we're working on this from every angle with creative approaches like an in-house jail and in jail, clinician new shelters, day labor programs, real time bed availability software and even research, such'",
        "'speaker_2': 'as working with Cal State Long Beach to focus our outreach strategies and find opportunities for improvement. These are just a handful of the great programs we are working on in the city, but this is not about what we're doing, right?'",
        "'speaker_2': 'Earlier this year, the Ninth Circuit Court of Appeals heard the case of Martin versus City of Boise. And their decision has fundamentally changed the way that cities are now able to manage our open spaces, including parks, beaches, sidewalks and parking lots.'",
        "'speaker_2': 'The decision has resulted in us not being able to any longer enforce our own ordinances that are designed to prevent public health issues from spreading. The decision forbids municipalities from enforcing ordinances that prohibit public camping unless those local governments can offer acceptable shelter to every unhoused person in their jurisdiction.'",
        "'speaker_2': 'This severely limits our ability to address homelessness and the appropriate protections of the rights held by everyone to access and meaningfully enjoy public spaces. The city needs to have the ability to appropriately regulate public camping and enforce our city ordinances with the objective of protecting everyone equally and maintaining public health standards throughout the city.'",
        "'speaker_2': 'The decision of the Ninth Circuit is truly unique as there's no other circuit interpreting the Eighth Amendment in this way. So this inconsistency is why earlier this week. We we saw. Well, I think it was probably last week now.'",
        "'speaker_2': 'Multiple cities throughout the nation joining in the amicus briefs in order to ask the Supreme Court to reevaluate the impacts. We have a responsibility as a city to help those that are experiencing homelessness in every way that we can.'",
        "'speaker_2': 'We have a responsibility to help them find their way to services. We have a responsibility to make sure that we are not punishing them for the fact that they are homeless. But we also have a responsibility and a duty to protect citizens and to allow citizens to be able to use public spaces in a meaningful way and'",
        "'speaker_2': 'to feel safe doing so. When we have encampments and the city is not able to do anything about the encampments, we start to see crime happen within the encampments. We've seen that happen within the region and nearby counties.'",
        "'speaker_2': 'We've also seen some incidents of it here in the city of Long Beach. We also see public health issues with spreading of disease that we're not able to control and we need to control. We also see issues that are vulnerable to fire hazards, for example, such as many of our wetlands, areas where we are not able to'",
        "'speaker_2': 'clean up the encampments as as merely a public health and public safety issue because of the restrictions that have been set forth by the ninth District, it has severely limited our ability to provide safe and safe public spaces that all residents can enjoy.'",
        "'speaker_2': 'And so with that, I would like us to adopt a resolution to support L.A. County's efforts in filing their amicus brief and to support the larger county that supports us every day through the use of county funds to help us address the issues of homelessness.'",
        "'speaker_2': 'So I ask my colleagues to support me on this.'",
        "'speaker_6': 'Thank you. I was set in motion, but before I go to comments from a counselor, I'd like to do public comment. We have Gary Holbrook. Bill Sheehan. I'm sorry, Jenny Holbrooke. It's getting late.'",
        "'speaker_4': 'Reprise and also Councilmember.'",
        "'speaker_1': 'Mongo and wrong guy in Austin.'",
        "'speaker_4': 'For bringing this agenda item to the council. The city of Long Beach should be able to control occupancy.'",
        "'speaker_1': 'Of its.'",
        "'speaker_4': 'Public spaces to ensure they are available for all residents and visitors to safely use and enjoy. So let's not delay in supporting L.A. County in asking the US Supreme Court to overturn the Ninth Circuit's ruling. Thank you.'",
        "'speaker_6': 'Thank you, Mr. Bill Sheehan.'",
        "'speaker_9': 'Good evening. My name is Bill Sheehan. I live in District three and I support the recommendation on the resolution. There is no single answer in dealing with the homeless crisis. Long Beach has been ahead of the pack in finding ways to get homeless people off the street and connected with service providers.'",
        "'speaker_9': 'For example, our quality of life officers are really doing groundbreaking work in this area. The Boise ruling is too sweeping and the city needs to have flexibility in dealing with a problem that cuts across all neighborhoods. The Boise ruling makes it difficult to regulate public camping.'",
        "'speaker_9': 'It's important to regulate camping in order to keep people safe and to protect the rights of everyone to access and use public space. I wanted to touch on the safety and access issues. For example, people have been camping and congregating overnight at the Granada Rest Restroom and Snack Shack area, off and on for several years.'",
        "'speaker_9': 'Two years ago, one late one night, a man died on the Granada ramp. Police reported there were a group of people there. One woman accused another man of a crime and a group of men jumped on this fellow and he died in the scrum.'",
        "'speaker_9': 'This happened after 10:00, so none of the people should have even been out there because it was past the beach curfew. And there have been similar deadly incidents involving the encampments in Long Beach in the past. And I think the encampments are not only dangerous to the general public, but they're especially dangerous to the people who live'",
        "'speaker_9': 'in the encampments. The second issue I wanted to bring up was Access. And a couple of a few years ago, the city repaved the sidewalk between Granada and Bayshore, and they went out of their way to make sure it was ADA compliant.'",
        "'speaker_9': 'But now I see sometimes there are people camped on the sidewalk or leaving their camping gear on the sidewalk, and there's people that need the ADA access are out in the street going around that. So that almost seems like an ADA violation.'",
        "'speaker_9': 'So I really encourage the Council to consider supporting the resolution in support of L.A. County. And I think the most important thing is that the city have flexibility in dealing with homelessness. Thank you.'",
        "'speaker_6': 'Thank you so much. I'd like to call forward and this city material. And after that, since I came, say.'",
        "'speaker_4': 'It's cottage to your liberal desires.'",
        "'speaker_2': 'Good evening, everybody. A very involved.'",
        "'speaker_4': 'Citizen in this.'",
        "'speaker_0': 'Community, and we do a lot of outreach with a transient population in our neighborhood.'",
        "'speaker_4': 'The population fell on hard times, but who also continues to respect their surroundings and the people around them.'",
        "'speaker_0': 'We know them and respect.'",
        "'speaker_4': 'Them as well. Unfortunately, we also deal with a different kind of transients, mostly addict, who do not want to follow the rules or the basic coexistence. They are the ones who do not want to accept services and refuse shelter, and yet they take advantage of all the protection laws created for the truly needy.'",
        "'speaker_4': 'They set up camp in our parks and beaches in the sidewalk.'",
        "'speaker_0': 'And we are the ones who pick up their trash, their needles.'",
        "'speaker_4': 'At times stolen goods and worse, their human waste is to become a real health hazard issue. Ordinances were created.'",
        "'speaker_0': 'By the city to.'",
        "'speaker_4': 'Protect all citizens equally, to protect us all from health and crime problems. This ordinance should be enforced on all citizens without discrimination. I am grateful for Councilwoman Pryce, who is always on the front line, bringing constructive ideas and effective.'",
        "'speaker_0': 'Effective ideas to improve the.'",
        "'speaker_4': 'Quality of life for all. We love Long Beach. Thank you very much.'",
        "'speaker_6': 'Thank you for your comments. We have Corliss Lee up next. And after carelessly we have Larry go to.'",
        "'speaker_4': 'I don't think I've ever had so many line items that interested me on an agenda before. But this amicus brief, I think Suzy pretty much said it all, but I did last week with some folks who are looking into the homeless issue.'",
        "'speaker_4': 'And they had set up interviews with a social worker, a manager of a homeless program, and then a guy who worked with the union rescue mission. And we asked him certain questions and one of them was, Who are they?'",
        "'speaker_4': 'Who are the homeless? And they all answered it the same way. They said, basically, it's the mentally ill. It's people with substance abuse problems. And then there's the all other so, you know, people coming out of prisons, people who lost their jobs, you know, a whole big bank of all other.'",
        "'speaker_4': 'But moving on from that, when I looked at the homeless situation over in our local park and Eldorado Park, I'd say six months ago we turned in that there were some homeless camped on an island in the middle of the lake there.'",
        "'speaker_4': 'And I can't believe how crazy it was trying to get them removed. I mean, I finally told Hiroto that I could do it in a morning, you know, I could go get a couple of big guys, move the stuff off the island.'",
        "'speaker_4': 'And we really felt like, as as our group, Friends of Eldorado Park, it's a safety and sanitation issue. And. It always has to be balanced with compassion and what you're going to do to help them. But you can't have them in the middle of the park where there's no bathroom, you know, and they're defecating.'",
        "'speaker_4': 'And if they've got needles, there's problems and there's little kids there that spend the night. So you have to be allowed to implement the ordinances that you have out there for safety and sanitation.'",
        "'speaker_6': 'Thank you so much, Mr.. Good to you. And after Mr. Good who we have Tasha Hunter. Yeah.'",
        "'speaker_1': 'Very good. You? I'd like to make this recommendation to the city attorney. Quite frankly, work and figure out a way to avoid jerking our council agenda around. Like Seinfeld's, Kramer enters and leaves a room. Additionally work with the Innovation Department, the Innovation Department.'",
        "'speaker_1': 'So we had the ability to present like we used to do. Something in writing. I had to pass out what I passed out to you today. Previously we would be public, would be able to you'd be able to see that the public would have it up on the screen if we would present it to the tech department'",
        "'speaker_1': 'a week ahead of time. But we don't have that ability now. So I would urge you, the city attorney, to explore ways in which that can be done.'",
        "'speaker_6': 'Speak to the issue, sir.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'Thank you, Miss Hunter.'",
        "'speaker_4': 'Good evening.'",
        "'speaker_5': 'Tasha Hunter, Uptown Business Improvement District.'",
        "'speaker_4': 'So I wanted to come to you because.'",
        "'speaker_5': 'This is an issue all over the city, especially in the business improvement district.'",
        "'speaker_4': 'And I have had the opportunity to work with.'",
        "'speaker_3': 'Our.'",
        "'speaker_5': 'With our police department, with our commander, Laura Cella. Up there are.'",
        "'speaker_11': 'Acting Commander.'",
        "'speaker_5': 'Sol Amita and Erica moreno with the with and in our health department who come out weekly to work with the individuals. I also go out on my own when I get these phone calls from the property owners in the businesses.'",
        "'speaker_5': 'My phone is on 24 hours and I get the calls and I show up. And I know about Cynthia and Benjamin, who live in the alley allergic to the sun. They can't be out in the afternoon, so they come out at night.'",
        "'speaker_5': 'And my business owners can't come out of their business to go to their cars and their vehicles. So there is that compassionate approach. But it's also if it's interfering with our businesses, being able to conduct that business and patrons being able to go in during the day, there's a fear.'",
        "'speaker_5': 'There's children. I'm in the area of two different schools, and so I thank you for bringing this forward and all of you that are supporting it. It's something that has to be addressed. We are, like I said, trying to take that compassionate approach because at the end of the day, they are people.'",
        "'speaker_5': 'There's Johnathan that helps take out the trash at the 7-Eleven in exchange for Slurpees and coffee, but as stretched out in front of the 7-Eleven. Jonathan, you can't be here today. I met Cookie. Cookie was blocking an entrance of a business and the people were afraid to come out, so they called.'",
        "'speaker_5': 'So I'm thankful for the services that our police department, our health department, the people offer and and thankful that the businesses and the property owners feel comfortable enough to call. So, again, I support this and everything that we do, and I'd like to know, let it be known that the business district does humanize the folks that are'",
        "'speaker_5': 'out there, realize their circumstances, but also letting them know you can't be here.'",
        "'speaker_3': 'Okay.'",
        "'speaker_6': 'Thank you so much. I bring it back a second into the motion, but I would hold my comments. For now. I will recognize the member.'",
        "'speaker_9': 'RICHARDSON Thank you. Councilmember And so, yeah, I mean, I didn't realize I didn't I didn't fully understand this measure until it was brought to me, the Supreme Court decision. I mean, it just raises a lot of questions. So I want to start asking those questions.'",
        "'speaker_9': 'So. Mr. City Attorney. So under the law today can a homeless individual sleeping on a street be it were arrested. If we go to move this person and by offering them a place to stay.'",
        "'speaker_10': 'In California under the Boise case, the answer is yes. If the city has a location or a facility in which they can go to and they refuse services, they can be cited.'",
        "'speaker_9': 'So under Boise, under law today in Long Beach, we have a hotel voucher or bid for them to go. We offer that if they refuse it. Then simply then we can still move that individual today if we have that resource.'",
        "'speaker_10': 'They can be cited under Boise.'",
        "'speaker_9': 'Yes, it can be cited. Things can happen under Boise. Okay. Now, if someone, let's say they're creating a public nuisance, making noise, you know, relieving themselves on the sidewalk. Today we have the power to move that individual or decide that image.'",
        "'speaker_9': 'Today, under Boise. That's correct. Okay. So what if under Boise today, an individual was sleeping? On the sidewalk. Who hasn't broken any other law except for the existing camping law. And we approached that person, offer them and we have no bed to offer or no hotel room to offer.'",
        "'speaker_9': 'Could we today under Boise? Cite that person or move that person. No. So what would be the difference if this Supreme Court ruling goes down? From what we can do today. In that scenario to what we could not do.'",
        "'speaker_9': 'I'm what we could what we cannot do today and then what we could do.'",
        "'speaker_10': 'I'm probably going to oversimplify it. But if you the Boise case added additional restrictions in the Ninth Circuit for those cities in states under the Ninth Circuit jurisdiction that don't exist in other areas of the country. And so if the petition is accepted by the Supreme Court and the Supreme Court overturns the ruling in Boise, it would'",
        "'speaker_10': 'excuse me add basically another tool for the city and cities to police department to and give them a little bit more flexibility on how they handle those situations that you describe.'",
        "'speaker_9': 'Actually wasn't more simple. When, like. What do you mean, flexibility? I need to understand it currently.'",
        "'speaker_10': 'It limits the ability to cite a person unless they have a and a shelter or a facility for them to go to. Under Boise, unless you have that, you can't cite them. And a number of cities are just not enforcing.'",
        "'speaker_10': 'If you remove the Boise requirement, it could be cited.'",
        "'speaker_9': 'So let's say Boise goes away. Let's say it's overturned in that scenario. Mr. Modica, what how would we treat an individual if we don't have a place from.'",
        "'speaker_10': 'Actually going to ask Commander Herzog to come up and talk a little bit about what we would do in a situation like that. And Police Chief Robert Luna as well.'",
        "'speaker_1': 'Good evening, council members. So currently, as he explained under Boise, we're offering him that if there isn't a bed available, we're approaching them trying to get them to get compliance and. And moving them along that way. And if they don't move and we have no bed available, they're staying where they are.'",
        "'speaker_9': 'So that's what we would do if Boise's overturned. We would ask them to leave.'",
        "'speaker_1': 'Sorry, I misunderstood the question.'",
        "'speaker_9': 'If Boise is overturned.'",
        "'speaker_1': 'If Boise is overturned, that allows us to go up to and approach them. And if they don't want services, we can take enforcement action.'",
        "'speaker_9': 'Well, let's say we don't have services. So right now we can do enforcement action today. We can do enforcement action today if we have services. Correct. Let's say we don't.'",
        "'speaker_1': 'If we don't have services, we.'",
        "'speaker_9': 'Don't have hotel vouchers, shelter beds. And how would you handle that?'",
        "'speaker_1': 'And if Boise has gone. Then we can take enforcement action.'",
        "'speaker_9': 'What does that look like? Enforcement action? Well.'",
        "'speaker_1': 'It's what we would have then, just about a year and a half, two years ago, before the Boise decision came out. We would still work with our partners trying to do outreach to offer services. If they didn't, then we would take enforcement action.'",
        "'speaker_1': 'But it also allows us if the.'",
        "'speaker_9': 'If you could just elaborate a little bit on enforcement action.'",
        "'speaker_1': 'Okay. That's either citation or arrest, depending on the situation. Most likely citation. But if the problem's not going to go away, then it may lead to an arrest.'",
        "'speaker_9': 'Okay. So I. So there's two concerns with that for me. So one. If an individual is not working any law other than the camping law and we don't have a place to offer for them to sleep. And we are, in fact.'",
        "'speaker_9': 'Making the act of existing and sleeping when there's no other option illegal. That's a civil rights issue, and that's where I draw the line. If there are real on the ground, tactical things that we can do to strengthen our policies, everybody on council would support that.'",
        "'speaker_9': 'I'm pretty confident when it comes to we have to have a code. There has to be a law to cross is a reason why this law got held up. The investments hadn't been made. Sure, we're in a better situation than most cities, but we are not where we're supposed to be.'",
        "'speaker_9': 'We have 125 beds that we're working on. Everyone Home report says we need 500 beds. We still need to identify two or three locations for additional beds. That's where our focus should be. This. I get it. The idea of doing what we can to address the homelessness issue.'",
        "'speaker_9': 'But at some point there's a line to cross, which is rights. Secondly. I have a concern with the leaf leaf blower approach. Push, push, push. I don't care where the leaf goes. If we have. And that's not an insult to anyone.'",
        "'speaker_9': 'But if we haven't created the beds and today we don't have them. If we haven't created the beds and the realistic, what really is happening is we're pushing people from side sidewalks into larger hidden encampments along the rivers and the freeways, the seams of life in those areas.'",
        "'speaker_9': 'It's scary. Two weeks ago, one homeless individual stabbed and killed another individual in the encampment in my district, not on the sidewalk. This happened in a hidden encampment that crawled back onto the street and the guy died. The same encampment, an individual with a toy gun was held up.'",
        "'speaker_9': 'And, you know, at the AMPM, where people thought he was going to shoot people. The encampments are real problems and that's where we need to be focusing. It's not going to solve the issue by pushing people from sidewalks into encampments, and I don't think that's what anybody's implying.'",
        "'speaker_9': 'But the reality is this measure here puts us on course to make a political statement essentially, and doesn't help us to address the root issues. What do we need to do? We need to build more beds. We need to build confidence with our residents.'",
        "'speaker_9': 'That is not going to be the end of the world. Trading a dangerous encampment for permanent supportive housing. That's what we need. I'll also say we should be really clear on what we speak and support and what we speak in support of to hear that.'",
        "'speaker_9': 'You know, I you know, public comment saying, you know, it's it's fair. Anybody can say what they like. When you represent organizations that make statements, make sure you fully understand the impacts of those statements and how they reflect on those businesses.'",
        "'speaker_9': 'I can tell you, you know, I can tell you most folks agree on homelessness. But if you if you ask a person a simple question to someone should be potentially criminalized for sleeping in the place that they seem safe if we don't have services to offer them.'",
        "'speaker_9': 'And I'll tell you right now, a lot of those businesses would say, well, that's a different conversation. That's a very different question. And enforcement or or leaf blower solution. The other thing is, I'm actually happy to see that it's been changed from a friend of the court brief to a letter to L.A. County.'",
        "'speaker_9': 'I'm glad to see that. But it was by no means was this a unanimous decision. It was a32 vote. And the issues cited in this very controversial 200 people speaking L.A. County vote, the major issue was civil rights.'",
        "'speaker_9': 'It came down to simply civil rights. So from my standpoint, I understand I don't like the in the council meeting on issues like this. But frankly, I don't think this is something that we should be doing. It's not consistent with our values as councilman as.'",
        "'speaker_9': 'As Long Beach. Housing First City. It's not consistent. We should be focused and focused on upstream solutions and identifying at least two more locations to build a bridge housing, a permanent supportive housing to get to our 500 bed support.'",
        "'speaker_9': 'I understand diversity. You know, our colleagues like to talk about the diversity and points of view. I would ask and I get it. We have differences and points of view here. I would offer and suggest if folks feel strongly about this, I do this all the time.'",
        "'speaker_9': 'Issue a letter from your office. Get your colleagues to sign on to that letter. The whole council should and shouldn't be forced to make a decision like this on something that goes right up against the line of civil rights.'",
        "'speaker_9': 'So those that's my piece. I can't support this. Thank you.'",
        "'speaker_6': 'Okay. Thank you, Mr. Richardson. Artists take the privilege to speak on this issue just briefly myself. I will try to stay within the five minute time frames prescribed for the council. This is a very, very important issue. I'm glad to see you come before the council for discussion.'",
        "'speaker_6': 'This is something that I know I've heard from many residents, constituents about. They feel like we need more tools in our toolbox to deal with the issue of homelessness. And I don't. Think that signing on to this amicus brief in any way diverts our focus from creating more beds and more shelter beds.'",
        "'speaker_6': 'I'd like to see us be a little bit more aggressive on that. And I'm with you. I stand with you on that, and we definitely need more beds than less. We would do a lot better if we have more places for our homeless or those experiencing homelessness is to go.'",
        "'speaker_6': 'But we also know that it takes several contacts and a lot of outreach to get these individuals to those services. Right. And. This this particular decision before us has put impediments for law enforcement as well as homeless services, and almost creates a disincentive for individuals to get services.'",
        "'speaker_6': 'And so I strongly believe that we need to do do more and the law needs to be give give local government tools to work with. And so this is why I stand in support of this. So this particular item, when we talk about encampments in public places, on sidewalks, in places and spaces where our public is actually'",
        "'speaker_6': 'engaged, when you're talking about business districts and I did hear from a board member just last week from the Uptown Business District who was very upset and emphatic that we do something and sign on in support of this amicus brief.'",
        "'speaker_6': 'I heard that. And so I do think the public commenters who came forward and spoke on behalf of those business, Susan Uptown Business District, but I hear from them and because me knows, I hear from them in the Virginia Village, I hear from business as well as residents throughout the district.'",
        "'speaker_6': 'This I think challenging this this item is not something that is I don't think it impacts anybody civil rights necessarily. I think what we are trying to do here in the city of Long Beach is take a compassionate approach.'",
        "'speaker_6': 'We are using every tool in the toolbox and looking at every option to provide help to to those experiencing homelessness in our city. And we'll continue to do that. And so. Councilmember Richardson. If you can help fast track beds in the city and help identify where we can put more beds in the city, you know, you have'",
        "'speaker_6': 'a partner in me to do that. Because I do think we do need to help offer more services and and help for for. Population. But at the same time, I do think we need more tools in the toolbox to, to, to encourage individuals to get help, the help they need and to move them into the services that'",
        "'speaker_6': 'we provide here in the city. So with that said, Councilmember Pearce, you're up.'",
        "'speaker_8': 'Okay. I didn't know how the conversation was going to go tonight, but I know that when I read this item, I had a lot of questions. You know, under hearing council member Richardson talk about it as a civil rights issue was not something that I had thought about.'",
        "'speaker_8': 'I had simply thought. Can we really arrest somebody for sleeping? You know, and I know that there are cases when this population is very diverse and their challenges are very diverse. I want to understand what protections are in the Boise case right now for those struggling with homelessness that could be removed if if the Boise cases overturned'",
        "'speaker_8': '. Is there someone on staff that can talk to that?'",
        "'speaker_10': 'Yes. Basically, the Boise case, as we said earlier, requires the city in order to enforce an anti-camping ordinance to have services available, a bed or a place where the person can go. That person is then given that option.'",
        "'speaker_10': 'And if they refuse, then they can be cited or arrested.'",
        "'speaker_8': 'And that's it. There's no other there's nothing else in the case to correct.'",
        "'speaker_10': 'I'm simplifying a very long decision. But yes, that's the gist of the case.'",
        "'speaker_3': 'Okay.'",
        "'speaker_8': 'The reason why I pressed on that is because I feel like it is a heavy case. And to make a decision like this where we are going on record at a national level, to be able to say that we're okay with with that decision is a challenge for me.'",
        "'speaker_8': 'So let me I think my challenge is that this is an opportunity, not a hindrance, that this is an opportunity for us to really push ourselves. And I know that that. Mr. Modica, we as a council and the mayor have already pressed on you in a very firm way that homelessness is our priority.'",
        "'speaker_8': 'I'm not sure that the numbers have shown, and I know that we had the justice lab that gave us some numbers around repeat offenders that go into the jails. Are we seeing that those repeat offenders are getting help, that that going to jail is helping them get on their feet, get sober, get mental health support?'",
        "'speaker_8': 'If I had those numbers and I was like, clearly, why don't we take them to jail? Because we've done X, Y and Z. It's now helping. Then I would be I'd feel very different right now.'",
        "'speaker_9': 'Councilwoman Pierce. Very good question. I don't have the numbers in front of me, but I believe our pilot program, which is one of the first of its kind in a in a jail, eventually will work. When you have a clinician that is able to listen to the individuals coming in and then trying to identify services that they'",
        "'speaker_9': 'may need, we are getting some numbers of people who are going to the M.S. and other resources that the clinicians able to divert them to. What we've got to do is better not coordinate, but keep track of any individuals coming back after that.'",
        "'speaker_9': 'And we're in the process of doing this because it's all new to us. But that is the goal at the end of the day, to reduce the number of high frequency offenders that are re-offending and getting them back on their feet, whether it's substance abuse assistance, mental illness disorder or assistance, whatever it may be.'",
        "'speaker_9': 'Because at the end of the day, the goal is to keep our jail empty some day. Maybe we can accomplish that.'",
        "'speaker_8': 'And let me ask I mean, I think we all kind of say we all look back and say, Reagan, we wouldn't be in this situation if we wouldn't have taken away those tools. Are there other things that are happening at the national level or the state level that that allow us to say, okay, instead of going to'",
        "'speaker_8': 'jail, say police come out, instead of taking you to jail, we can require to take you to a bed. Require not offer.'",
        "'speaker_9': 'Yes, there are options out there. But please remember for Commander Herzog and I were police officers and we are one of the only services that's out there that's 24 seven. We are filling an extraordinary amount of gaps. 99% of the time, your police officers do a magnificent job of dealing with the mentally ill and those suffering from'",
        "'speaker_9': 'substance abuse disorders. We would love to be able to turn to the mental health profession, but typically they don't work but 8 to 5 and on weekends and we're there. We're always there. So we're going to do our best to fill in those gaps.'",
        "'speaker_9': 'No police officer wants to encounter somebody on the street and take them to jail unless they're just outrightly violating the law. And please keep this in mind as you're asking us questions. We estimate that over 60% of the people we contact, those individuals you're talking about who are sleeping on the sidewalk, sleeping in front of businesses and'",
        "'speaker_9': 'so on and so forth, they refuse services. And that's the frustrating part for these police officers who are going out there based on dispatches and then have limited tools in their toolbox to deal with it. Then the citizens turn around and get angry at the officers because it's them who aren't doing anything about it.'",
        "'speaker_9': 'When it's a complete system failure and I'm talking system at the county level, state and federal level. So I hope that answers your question. But I'm telling you, most of the time, our officers do an absolutely amazing job of trying to find alternatives because for us, it's service first.'",
        "'speaker_9': 'And I'm going to tell you something, I'm very proud of this city, which includes every one of you for all your efforts in everything we do about homelessness in this city. If you are homeless in the city and you want services, we can provide them.'",
        "'speaker_9': 'If you choose to accept them.'",
        "'speaker_8': 'And that gets directly to the the crux of my question, which is, is there something that we could do that we require we take somebody and we get them off the street, but it's not jail with a citation next to their name.'",
        "'speaker_8': 'It's not putting them in the system, but it's putting them in a mental health system. And I'm thinking of what happened at the county level when they said instead of having a county jail, we want to have a county mental health facility.'",
        "'speaker_8': 'Are there opportunities here in the city of Long Beach for us to say instead of it being jail, it's mental health services that are required? Because I live in the second district, I know the homeless population in my community.'",
        "'speaker_8': 'I almost hit somebody last week on Broadway running like a crazy man. And I and I know he was going to jail because a police car was there and he was not stable. Yes, ma'am. And that was the right thing for him because he was not being safe with everyone.'",
        "'speaker_8': 'So what can we do outside of jail? And what I'm getting to is trying to put the city of Long Beach to think outside the box and to use this Boise case as an opportunity instead of an opportunity to push back.'",
        "'speaker_8': 'So I'm digging in on some of them.'",
        "'speaker_9': 'Yes. And I can then try and answer each one of those concerns. Our city, I believe, has done an amazing job of thinking out of the box. Can we do better? Absolutely. I always look to to raise our efforts when this Boise decision first came out.'",
        "'speaker_9': 'Our officers were on the street encountering people suffering from homelessness. And like they always do, if they were breaking the law, they would take the measures they had to to enforce the law. But it was a service first.'",
        "'speaker_9': 'Do you want services? Do you need services? So from that perspective, we didn't change. Eventually through the city manager's leadership, Pat West and Mr. Modica, we as a city came up with the plan with our partners in health to come up with this voucher program that has been, I think, pretty successful for those who choose to want'",
        "'speaker_9': 'the services. But the key in answering your question is this. When I walk up to Charlie Parkin, who may be experiencing homelessness, and I ask him, Sir, I would love to get you in a services. You may need assistance.'",
        "'speaker_9': 'And he looks at me and says, You know what, man? Thank you, but I'd rather just stay on the street, which again, is over 60%. If he's violating the law, I have the discretion to cite him or arrest him.'",
        "'speaker_9': 'Or I could say, Hey, do me a favor, just please move somewhere else. I don't want to cite you. I don't want to arrest you. That's where the discretion comes in. But the big difference in what you're asking is the law does not.'",
        "'speaker_9': 'If Charlie says, no, I don't want to, I cannot force him. The only thing I can force upon him if he's violating the law. And that's a big if I can say to them or I can arrest them, but I cannot make him legally accept services.'",
        "'speaker_9': 'And that's where the big problem comes in. I would love to be able to force somebody into substance abuse treatment or mental illness assistance. But the law does not allow me or us to do that.'",
        "'speaker_8': 'Is that state law or federal law?'",
        "'speaker_9': 'That is state law.'",
        "'speaker_8': 'So what are we doing to change that at the state level?'",
        "'speaker_9': 'I'm going to have to look back at all of you.'",
        "'speaker_8': 'And that's a question. Absolutely. It's for us. I think it's for city staff. I think it's it's another one of those tools that doesn't criminalize being homeless. It doesn't criminalize being mentally ill. It doesn't criminalize addiction that often is caused by poverty or perhaps the system.'",
        "'speaker_8': 'And so I'm trying to use this again as an opportunity to put it back on us, to think outside of the box and say, well, what can we do instead of just opposing this? But take it as an opportunity to really each of us agenda something or work together with staff to do something bolder than we've already'",
        "'speaker_8': 'done. One other area that I'm going to go back and work with my staff on right away, in addition to at the state level, I know that we've said no to module housing in the past, that we've said no to shipping container housing in the past.'",
        "'speaker_8': 'And I believe we have a memo right before anybody left that that outlined how we could do that. I'm working with economic development right now on two properties to try to have the city purchase it as a place where we could build more housing.'",
        "'speaker_8': 'So that question around more housing, we're taking that serious. But for the city to look at that module option and say, are there areas right now that our city loaned city owned land that we could build on quickly?'",
        "'speaker_8': 'So these are some of the pressure points that I think the Boise case is hopefully pushing us to do. I'm not going to be able to to vote yes tonight, but I do want to say how much I appreciate Councilmember Price for always looking at the homeless challenges and really trying to come up with the best way'",
        "'speaker_8': 'that her constituents want her to lead on this item. I know our constituents differ sometimes in relation to this. I hope that this is an opportunity for this entire council to take seriously the fact that there are going to be laws that are passed at the state and federal level that we have to engage in and make'",
        "'speaker_8': 'it a big priority. So I ask staff to consider some of that, what we can do with lobbying on the state level, and we will continue to do our part as well.'",
        "'speaker_10': 'And Councilmember, I wanted to add a couple of things that we've done since the Boise case in response to this, to try to be innovative, to try to adapt. I think the police chief said it well. Cities that have not had any services and don't do any of the things that Long Beach has already done.'",
        "'speaker_10': 'It found themselves in a much different situation and they've had a harder time adapting to to the new law. A couple of things we have done. We have now a new mental health facility in Long Beach that helps us with some of those emergent needs where police can actually drop off people who are, you know, at that'",
        "'speaker_10': 'level where we can take them into custody for and get them some mental health services. That was something that came in to District seven, which has been a great resource for us. We also have now instituted a pilot program where we are purchasing hotel rooms every night so that every night we do have the ability on a'",
        "'speaker_10': 'limited basis for our officers to offer those services, even when the embassy is closed, even if we don't have a shelter bed, to say that those are available so that we then do have some tools to be able to react to that.'",
        "'speaker_10': 'And then the third innovation is we found while the officers are willing to do that, we have a difficult time. If somebody has a lot of belongings, who who will may want to go there, but then say, I'm going to refuse because I don't want to lose all of my stuff.'",
        "'speaker_10': 'So we have this council has given a used city truck to a nonprofit and they are operating and they're a phone call away and assist us with moving some of those belongings. So that's you know, these are all pilot programs.'",
        "'speaker_10': 'We're studying their efficacy of how we're doing out there and we'll be reporting back on that. But we are adapting and and trying to address so that there are other options. Besides that we still get individuals that just don't even with all those resources, just say, I don't want to do that.'",
        "'speaker_10': 'And this allows us to take enforcement action if they really do not want to to participate.'",
        "'speaker_8': 'Thank you for that, Tom. I'll just I'll wrap up with saying I also know that we yes. To all those things and I applaud us for all those things. And Councilmember Price and I've worked together on this pilot program for the Tidelands area, where we are also going to invest some of our funds to make sure we'",
        "'speaker_8': 'can open up more nights at hotels and knowing that we need our health department to work on the weekends sometimes. But we need somebody that's going to be there to make sure that they're connecting with that homeless person before they have a chance to leave in the morning.'",
        "'speaker_8': 'And so I know that we are doing some of those things, and I guess that that is why it's hard for me to kind of move forward in this direction. But I look forward to hearing my my council colleagues thoughts and again, appreciate that we have done a lot and we just have to keep pushing ourselves to'",
        "'speaker_8': 'do more. Thank you.'",
        "'speaker_6': 'All right. You hold the record this evening. Next, does Councilmember Suber nor do I will interrupt in the future.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': '9 minutes.'",
        "'speaker_9': 'Dude.'",
        "'speaker_6': 'Laughs Miss Cantrell to be the timekeeper.'",
        "'speaker_9': 'Do I have the floor at this time?'",
        "'speaker_6': 'Councilmember Super Nora, please.'",
        "'speaker_9': 'Okay. Thank you for the floor. I'm going to turn it over to our esteemed colleague, Vice Mayor Dean Andrews. He has asked me to read a comment on his behalf.'",
        "'speaker_6': 'Your time?'",
        "'speaker_9': 'Yeah. Okay. I'll donate some of my time here. The Andrew says. I support my colleagues in requesting the city attorney in filing an amicus brief urging the Supreme Court to take up the case of Martin versus the city of Boise.'",
        "'speaker_9': 'And it's an important case for both the idea of local control, but also how we can address and mitigate the impacts of homelessness in our community. City of Long Beach has and continues to provide services to those who seek to get off the streets.'",
        "'speaker_9': 'But at the same time, we have a duty to make our public parks safe and inviting for all. This case severely limits our ability to balance those duties, and I believe that we must take our views known. The Supreme Court.'",
        "'speaker_9': 'And that ends the vice mayor's comment. There was a line in here that I just noticed, and that is we have a duty to make our public park safe and inviting for all. And with Commander Herzog sitting there, I would like to publicly thank you, because he worked very hard for a year and or as of a'",
        "'speaker_9': 'park. And I. I would you and I should mention your successor, Commander O'Dowd, also worked with us, and we were able to return that park to the residents and the neighbors. And I would just suggest that if we're going to talk about civil rights or rights of any type, I think there should be a balance with those'",
        "'speaker_9': 'rights of the neighbors to utilize these facilities directly across to you. And this is a park embedded in a neighborhood. Also, to the last point that was made, I believe our pilot program started today to have services on the weekends.'",
        "'speaker_9': 'Did it start a. October 1st, Mr. Monaco.'",
        "'speaker_10': 'So technically the budget starts today, so the money is now available and off we go. We are putting together how that will work and then we'll launch it programmatically very soon.'",
        "'speaker_9': 'Okay, so well, technically we're not on the weekend yet, so if it started today, it wouldn't take effect on next weekend. Okay. Thank you.'",
        "'speaker_6': 'Thank you. A member of Durango.'",
        "'speaker_7': 'Thank you, sir. Austin. You know, I've been listening to the discussion here. And, you know, I originally signed on to this thinking that it's a public good, a good thing. But, you know, when I when I go out in the community.'",
        "'speaker_7': 'And people ask you, what are you doing about the homeless situation under the freeways, on the park, at the empty lots for the stores? They said, well, you know, my response is always been it's not a crime to be homeless.'",
        "'speaker_7': 'But I think that's what we're doing here is we're criminalizing homelessness, and I can't agree with that. You know, I think that the opening discussion that Councilmember Richardson brought up in terms of some of the things that. The tools that are there for the police department already exist is, I think, something that we need to give a'",
        "'speaker_7': 'chance of. Council acting city manager Tomioka has mentioned some of the items that we're working on now and homelessness being at the top of his list in terms of his goals during his interim position that he's here is acting in position, and I think we need to give those a chance.'",
        "'speaker_7': 'The last thing I want to do is put in people into jails or citations that don't deserve it. I mean, I took a big hit a couple of years ago when I supported having the behavioral health center put in my district.'",
        "'speaker_7': 'And I said at that night, they say, you know, there's there's a political thing to do and there's a right thing to do. And I said that night, I know I'm going to lose votes. And, you know, so be it.'",
        "'speaker_7': 'But I think the right thing to do was to support that behavioral health center. And I did lose votes. They did go to those neighborhoods and those people and say, you know, you supported that behavioral health center. I can vote for you there.'",
        "'speaker_7': 'Well, I'm sorry you feel that way, but I think that I did the right thing. And yeah, and that's where I'm at right here. I'm at this point where. The political thing to do is like, let's go with the amicus brief and let's support it and let's turn it over and so be it.'",
        "'speaker_7': 'But I think that the right thing to do is we need to look at ourselves internally and we need to address this issue internally with ourselves as we do. I'm not confident that sending a message through a resolution or Ivanka's brief is going to be effective, quite frankly, because it's going to be up to the Supreme Court'",
        "'speaker_7': '. So that brings me up to this point. The discussion we're having right now is about a resolution. The item that we're dealing with here is a request to join an amicus brief. Is that a separate motion totally and completely that we need to change or, you know, this is a point of order, I guess, that I'm asking'",
        "'speaker_7': 'for at this point, because I think that this discussion basically is moot if if we can't join the amicus brief and that's what's in the agenda.'",
        "'speaker_10': 'Councilmember, as Councilmember Price indicated at the beginning, the time to actually sign on to an amicus brief for the petition has passed, but there isn't a second opportunity. Should the United States Supreme Court accept the petition and consider the matter on its merits?'",
        "'speaker_10': 'What the. I do think it's appropriate and allowed under the Brown Act to re. Amend this motion as the Council member from the Third District did in a resolution in support of the L.A. County Amicus Brief, because the intent in the in the direction in the first one was to explore joining that amicus brief.'",
        "'speaker_10': 'So while we aren't able to legally sign on to it because it's already been filed, a resolution in support of it is going to state the position of the city of Long Beach that you do support the Supreme Court hearing this matter.'",
        "'speaker_7': 'For the record, he took a minute of my time. I do want to say, though, however, that while that may be true and we can do that again, you know, I'm looking at what we're dealing with as people and how we represent ourselves to those people.'",
        "'speaker_7': 'And, you know, kudos and my total support goes to the police department. You guys are phenomenal. I mean, the work you do, the people that you confront and you have to deal with and the patients and the tact and the decision making that your officers do on a daily basis is absolutely phenomenal.'",
        "'speaker_7': 'I can be a hothead. I don't know if I would be able to do that. But your your leadership certainly shows in the fact that Long Beach has been a leader in having to deal with this issue in a very humane and an honorable way.'",
        "'speaker_7': 'So given that, I'm not going to be supporting the motion, the floor.'",
        "'speaker_6': 'Okay. Thank you. Councilmember Price.'",
        "'speaker_2': 'Thank you. So just a couple of observations I've made. And again, I'm very thankful for this conversation. We are a diverse city and we're a diverse council. And I love and appreciate the fact that we can argue passionately and disagree and still respect one another's point of views.'",
        "'speaker_2': 'And I think we're doing a very good job of that tonight. I will say a couple of things in regards to our business corridors. As a small business owner who owns a business in a business corridor. Absolutely. We want to make sure that we're doing things that are humane and cognizant of individuals that need assistance and support'",
        "'speaker_2': '. And I have a lot of stories myself personally, similar to those shared by Tasha Hunter with transients that I've interacted with on Second Street, in and around our business. And my family and I have gone to great lengths to help individual people over and over again.'",
        "'speaker_2': 'When you have people that are choosing not to go to a particular business corridor or you have business owners that have habitual problems that they can't address related to transient activity, it impacts the business corridor and it impacts their ability to thrive as a business.'",
        "'speaker_2': 'And I think that's important for us to think about. You know, we have our directors that manage our bids and we tell them, you know, go forth and do the very best you can. And really, we set them up for failure because we're not giving them any tools and it's not fair.'",
        "'speaker_2': 'It's just really not fair to them. We have to do our job. What I would say is to the council members who are against this item, you should perhaps think about turning over the laws of the city that you don't agree with, because what this item says is that we have laws in the city that we cannot'",
        "'speaker_2': 'enforce, so our police department cannot enforce our camping ordinance. If you think we should not have a camping ordinance, then that's the item you should bring to council. Because what we're saying through this item is that we should have the local ability to enforce our own ordinances.'",
        "'speaker_2': 'Camping is illegal in a park. It's illegal for a variety of reasons. There's all manner of public health issues that come about when someone doesn't have access to toilets or running water and they're sleeping in a park. Think about a campsite that you go to with your family.'",
        "'speaker_2': 'If you don't have access to toilets or running water and you're there for a prolonged period of time, there's going to be health impacts around you. So when we have that happening in a public park, it's not fair to expect our residents to go to that park and enjoy that park and throw the football with their child'",
        "'speaker_2': 'when there are needles on the ground or signs of camping. So, you know, I agree with a lot of the comments that have been made tonight. But let me be very, very clear. Civil rights, civil liberties and due process belongs to everyone.'",
        "'speaker_2': 'It belongs to everyone. It belongs to residents in the city, and it belongs to those who are violating current, existing ordinances. If we don't think those ordinances should be in place, then I would challenge those council members who are opposed to this item to bring an item next week, sometime this month, and say, You know what, we'",
        "'speaker_2': 'no longer should have a camping ordinance in the city, because what we're saying right now is Boise. The Boise decision says we can't enforce our own ordinances unless we have available beds. If we don't have available beds, we cannot enforce ordinances that we have on the books.'",
        "'speaker_2': 'So if there if there are people on this council that think sleeping in a public park and having an encampment in a public park should not be against the law, then why is that item not coming to council?'",
        "'speaker_2': 'Why is that item? Why are those council members not saying, you know what, let's reverse that law? Because that's a discussion I'd love to have. I'd love to hear what the people think about that. So I think to hide behind Boycie and say, you know what, Boise is punishing.'",
        "'speaker_2': 'You know, if we overturn Boise, it's punishing the poor. By the way, the council, the supervisors who voted on the amicus include supervisors like Janice Hahn, who has done more for homeless issues in this county than any elected official I know of in recent history.'",
        "'speaker_2': 'She's putting her money where her mouth is, and she voted in favor of this amicus. So I don't think anyone's intent is to punish the poor or make homelessness a crime. And look, just because we disagree on things, I don't think it's okay for us to spin or infer or, you know, accuse our colleagues of having bad'",
        "'speaker_2': 'intent. That's nobody's intent. Okay. So there may be parts of an item that council members don't like and they say, I want to take this part out. I like this part. It's not okay to then say this council member is blank.'",
        "'speaker_2': 'That's not okay. And I hope we don't do that. But I think protecting the rights of all residents is important. And that's what this item is about. Ah, by the way, it's too late for us to file a support our own amicus.'",
        "'speaker_2': 'Right now, the best we can do is a resolution. And when it goes to merits, we can file an amicus then if we want to, within the time limit.'",
        "'speaker_6': 'Thank you, Councilmember Richardson.'",
        "'speaker_9': 'Thank you. And you know, again, I don't know, I, I believe that whenever we're talking about taking positions on policy, we should try and attempt to be clear and specific about what we're trying to do. I've heard of term a number of times tonight.'",
        "'speaker_9': 'Tools in the Toolbox. As a council member who likes to understand the specifics, what tools are currently not in the toolbox that if this law goes away, will be inside the toolbox? Anybody.'",
        "'speaker_10': 'The ability to cite a person and not have a bed available.'",
        "'speaker_9': 'So again. The conversation about enforcing it. So all the examples that we're giving tonight of refusing services is not relevant to this conversation because if someone refuses services that are available, we can today enforce on them. Is that correct?'",
        "'speaker_10': 'If there's a bed available.'",
        "'speaker_9': 'If there is a bed available today, if there's a bed available, we can enforce on them. Today, this conversation is all about simply capacity. That's it. If there is a bed available, we can enforce. We can cite. We can arrest today.'",
        "'speaker_9': 'If we don't have services, meaning no more hotel vouchers, no more shelter beds, then the very narrow, specific tool that we're talking about, just to be crystal clear with everybody here, the only tool is criminally enforcing on someone.'",
        "'speaker_9': 'We cannot offer them a service. We haven't run into very many situations where we haven't had services. We have services to offer. This is simply about capacity in that very narrow, fine, specific fact that if we don't have something to offer you, then we want to pass a resolution saying we don't agree with this law that says'",
        "'speaker_9': 'you can be arrested when we have nothing to offer you. I just want to be crystal clear. This is not about some great tools in the toolbox. It's about one tool, which is simply criminalization. I want to say something else.'",
        "'speaker_9': 'I want to be very clear. We can have laws about camping. You know, sleeping in the right away. We can have laws. This is about, again, capacity. We don't have a place for people to go. We cannot enforce that law.'",
        "'speaker_9': 'That's the right thing to do. That is the right thing to do. If we offer you services, we're ponying up taxpayer dollars, working on taking on the risk of counseling you, Ranga said. Mental health facilities in his district.'",
        "'speaker_9': 'We're taking on a conversation on bridge housing in our district. We're taking it on. If we take that conversation on, then parallel to it, we can step up enforcement. It's it's it's about capacity and how this thing rolls out today.'",
        "'speaker_9': 'We don't have that. So again, to be crystal clear, there are no make up tools in this toolbox. It is one tool that we're voting on. One tool. It is. If you don't have a place for someone to go, should they be?'",
        "'speaker_9': 'Could they be criminalized? Actual criminal action. Now, I think if someone is breaking laws criminalizing, I think if they're stabbing people, criminalize them. I think if they're if they're attacking someone, if they're stealing your property, if they're doing all these things, go after them for way too long.'",
        "'speaker_9': 'Absolutely. We should not. I mean, we have enough right now to go after individuals. But there's a fine line. And that line is human rights and civil rights. That's a very clear, very clear line. So, again, I'm I'm fine.'",
        "'speaker_9': 'I'm not swaying the council going one way or the other. I'm going to vote no. I think as a matter of courtesy, I think this issue itself that again, to our business district, to everyone here who believes that this ad some tool to be clear it doesn't add it to this is a resolution that has no impact'",
        "'speaker_9': ', no tool. It's a political issue at midnight. That's what this is. I think we should be focused on support, on getting the shelter open, on doing more outreach. Councilman Austin, put it out. Hey, if we know of other places, let's be clear.'",
        "'speaker_9': 'We also need a shelter downtown. We also need, you know, we need geographic diversity with these shelters. Let's be clear about that. That's what we need. But for the sake of this conversation, to be crystal clear, there is no invisible tool in the toolbox.'",
        "'speaker_9': 'This is simply about we don't have a tool for you. We can arrest you or cite you criminal action. That's what this is. Capacity. That's what this conversation is. And I don't think we're there and we have the capacity to do this.'",
        "'speaker_9': 'So I'm fine. Thank you.'",
        "'speaker_6': 'Crystal clear from your lens. Councilmember Mongo.'",
        "'speaker_5': 'Thank you. If allowed a point of. I mean this in a genuine way. I'm not judging in any way. Mr. Richardson, have you been on a ride along yet? I don't know, actually.'",
        "'speaker_9': 'I've been on a number of ride alongs. I've been the reason that every I've been a part of this body, one way or another, I got it.'",
        "'speaker_5': 'I just wanted to know because I have a story to tell and I just wanted to know the context of what you would hear it. When I first graduated from the sheriff's academy, my first shift on patrol, my first shift on patrol, we were encountering a homeless encampment.'",
        "'speaker_5': 'I mean, every officer on their first shift nowadays encounters either mental ill person or a homeless encampment. And there was a woman who was being abused by another man inside the homeless encampment. However, she did not want to admit that many of you know, battery and abuse is one of the more difficult things to get people to'",
        "'speaker_5': 'talk through. There are all sorts of things that are in these encampments. We may not have enough that we might have enough beds for one individual who's in a park or two individuals on a business corridor. But it's an entire encampment that needs to be broken up on a regular basis to protect the individuals within it and'",
        "'speaker_5': 'quite frankly, the health of the community around it. I appreciate your point about one specific tool, but it's actually not one specific tool because even if there's not a bed, we have services to offer. And oftentimes the individuals that we encounter are rejecting the services.'",
        "'speaker_5': 'Not the lack of bed. And so I appreciate that you think I'm wrong. I. I actually am hearing on this side of the dias, they disagree. We have something to offer. Often it might not be what they want at the time.'",
        "'speaker_5': 'I will say that. The amount of training coming out for police officers is consistently changing. The amount of resources available is consistently changing. If this. City of Boise cases overturned. We still can choose to create a local policy that we don't enforce unless they've had multiple encounters of being offered a bed or any of those things, we'",
        "'speaker_5': 'can still do those. And so for those reasons and in in support of I watched the supervisors and their discussion and public comment and the way in which the board of Supervisors really put that forward. Supervisor Hahn. Yes.'",
        "'speaker_5': 'Has been a leader on homelessness. Also, Supervisor Barger has really talked through some of our environmental issues and the fires created that fires that have literally harmed individuals in great numbers and that that season is coming again. And so for those reasons, while I appreciate I don't want to criminalize homelessness in a way that we don't offer'",
        "'speaker_5': 'anything but. Oftentimes, as some of our data showed related to our innovation team, it's the same individuals who do not want services and they do not want a bed or they take the bed voucher, but they don't actually ever go there.'",
        "'speaker_5': 'And we need to talk through sometimes the threat of enforcement is actually what puts them into services. And so I appreciate your perspective and I appreciate the councilwoman for bringing this forward. And I. I look forward to us continuing to try to solve homelessness.'",
        "'speaker_5': 'That was a quote from you on the day you were sworn in for your second term and you said, We will solve homelessness. I'm pretty sure my husband's repeated it like five times. He said Rex Richardson is going to solve homelessness.'",
        "'speaker_5': 'I'm pretty sure we've got to go back and watch the.'",
        "'speaker_9': 'Tape, address the elephant in the room and build essentially shelters and affordable housing that's working on the shelter and affordable.'",
        "'speaker_5': 'We are. We are. And so for those reasons, I really want to appreciate those who have come before us and taken on this amicus brief. And I'll be voting in support.'",
        "'speaker_6': 'Right. Seeing nobody else cued up without public comment. Please. Can you repeat the motion? What's before us? It's the city attorney.'",
        "'speaker_10': 'The motion is to request city attorney to prepare a resolution in support of the Los Angeles County's amicus brief.'",
        "'speaker_6': 'Okay, members, so you're clear. Please cast your votes.'",
        "'speaker_0': 'Ocean carries.'",
        "'speaker_6': 'Okay. Thank you very much. We will now have our second public comment. Solution.'",
        "'speaker_10': 'We need a motion to reconsider the item. We need to vote on the motion to reconsider.'",
        "'speaker_6': 'Oh. We can vote on the motion to reconsider.'",
        "'speaker_10': 'We need to vote on the motion to reconsider to bring this item back in front of the council, because I think we want to revote. Yes.'",
        "'speaker_6': 'What if we don't want to revote?'",
        "'speaker_10': 'Then vote against the motion to reconsider.'",
        "'speaker_7': 'Okay.'",
        "'speaker_0': 'Motion carry.'",
        "'speaker_6': 'Yeah. Okay. Okay. So it's been moved in second it. Motion to reconsider.'",
        "'speaker_10': 'Has passed. Now, this is the motion again on item 29, with the resolution in support of the Los Angeles County Amicus Brief directing city attorney to prepare that resolution and bring it back to council.'",
        "'speaker_6': 'Members cast their votes.'",
        "'speaker_7': 'And I got it. I got it. You. It was like, boom.'",
        "'speaker_0': 'Motion pass for three.'",
        "'speaker_6': 'Okay. Long night. So we're going to go into our second public comment. We have Joanne Freeman and James Midway. Are you still available still with us? Joanne Freeman. It was midway. Please come forward.'"
    ]
}