{
    "Recommendation to adopt Specifications No. RFP DV21-062 and award a contract to Nabih Youssef & Associates, of Los Angeles, CA, for a survey of existing buildings, in the amount of $769,000, with a 15 percent contingency in the amount of $115,350, for a total contract amount not to exceed $884,350, for a period of two years, with the option to renew for three additional one-year periods, at the discretion of the City Manager; and, authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments; and  Increase appropriations in the Development Services Fund Group in the Development Services Department by $250,000, offset by funds available.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. Let's hear item number six, please.'",
        "'speaker_1': 'Report from Development Services Recommendation to two contract for a survey of existing buildings for a total contract amount not to exceed 884,350 citywide.'",
        "'speaker_2': 'All right. Looking for my cue system? Is there a motion on that? Okay, I see. Councilmember Gurinder, would you like to stick your motion? No, I'm good with Nike. Okay. We need a second on this. All right, Councilwoman.'",
        "'speaker_2': 'And they are second. Is there any public comment on this?'",
        "'speaker_4': 'We have one public comment. Allie Perkins. Your time begins now.'",
        "'speaker_3': 'Hi. I'm a little confused. I wanted to speak on agenda item 1220 2-0045. Was that in that whole. The number of consents that you just voted on.'",
        "'speaker_2': 'No go item items one through 19.'",
        "'speaker_1': 'That Allie Perkins would like to speak on, item five. Which is part of the consent.'",
        "'speaker_3': 'Yeah, I was a little confused. I apologize.'",
        "'speaker_2': 'Okay. Well, I'm you know, we're on a different item, but if you want to spend your 3 minutes on this, we'll hear it.'",
        "'speaker_3': 'Okay. I appreciate that. Mr..'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Okay. I'm speaking on agenda item 20 20045. As a parent whose children attend school in the city, I am concerned about the public health orders in regard to COVID 19 that my children's school is required to follow. I speak for many parents when I say that these requirements are unlawful and nonsensical.'",
        "'speaker_3': 'We are fed up with the restrictions that continue to go against our children's health and wellness and further subject them to harmful mask wearing isolation and vaccination protocols that have been scientifically proven to cause more harm than good.'",
        "'speaker_3': 'If your main concern was with health and safety of my children, then why are cloth and paper masks acceptable when the CDC as well as other valid agencies, have proven them ineffective? In fact, many psychologists have declared them detrimental to mental, emotional and cognitive growth and learning.'",
        "'speaker_3': 'If Koga if COVID is so deadly, then why do schools not have has stations to dispose masks and other infected items properly? If Omicron is so contagious, why is that? That my possibly expose child needs to quarantine. Yet her sister, who resides in the same home and goes to the same school, doesn't.'",
        "'speaker_3': 'Why do unvaccinated children need to mask and quarantine when exposed but vaccinated do not. Regardless of the proven fact that vaccinated still spread and contract COVID. I would love to hear some answers. With COVID variant, with COVID variants weakening, we are starting to see the decline of severity.'",
        "'speaker_3': 'Children have from the very beginning been less affected by COVID, by COVID than adults. When children can contract COVID while they can still contract, COVID is widely known that most do not get sick and if symptoms appear, are very mild.'",
        "'speaker_3': 'Yet protocols continue to be enforced, creating a massive increase in mental health illness. As someone who works intimately, intimately with youth in the mental health field, I can tell you. You guys have failed our children. I would love to draw your attention to the $401 million of federal funding Long Beach School District has received since March 2020'",
        "'speaker_3': '. This information is on the Web for everyone to read. This has never been about the health of our children. It's been about the money, the $400 million incentive to turn a blind eye to the damage this district has caused.'",
        "'speaker_3': 'The youth of this city has served no one except those who continue to enforce these policies. Per the American Rescue Plan Act, which is where you have received the bulk of your money. The Esser three requirements state that schools must address how they intend to implement prevention strategies that are reasonable and consistent with the most recent CDC'",
        "'speaker_3': 'recommendations. In other words, schools will not receive funds unless they state and obey CDC regulations. But these regulations are not backed by honest science. They are unfounded and appear to be arbitrary, not to mention inconsistent and unreasonable. No money, no amount of money can help our children at this point.'",
        "'speaker_4': 'Thank you. That concludes your time.'",
        "'speaker_2': 'Thank you. Let's take a vote on item number six, please. Roll call, please.'",
        "'speaker_1': 'District one. I district to.'",
        "'speaker_0': 'My.'",
        "'speaker_1': 'District three. I district for.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District five. High District six. I District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District nine. Motion is carried.'"
    ],
    "Recommendation to request that the City Council: (1) receive supporting documentation into the record and conduct a public hearing on two appeals of the Board of Harbor Commissioners' adoption of the Final Initial Study/Negative Declaration (IS/ND) for the World Oil Tank Installation Project (Project) filed pursuant to Long Beach Municipal Code Section 21.21.507 by Safe Fuel and Energy Resources California (SAFER CA) and Long Beach residents Nicholas Garcia, Sopha Sum, and Sophall Sum, and Earthjustice, Coalition for Clean Air, East Yard Communities for Environmental Justice, Communities for a Better Environment, Center for Biological Diversity, and Sierra Club - Angeles Chapter (collectively, \"The Coalition\"); and (2) adopt resolution denying the appeals and upholding the Board of Harbor Commissioners' adoption of the Final IS/ND for the Project.": [
        "'speaker_2': 'All right. Let's go to item number 20 to continue hearing.'",
        "'speaker_3': 'You have failed our children. All of you.'",
        "'speaker_2': 'Item problem are not business like.'",
        "'speaker_1': 'Yes, we will mute public participation. Item 20 Report from Harbor Recommendation to receive supporting documentation into the record and conduct a public hearing on two appeals of the Board of Harbor Commissioners. Adoption of the final initial study. Negative Declaration of the World Oil Tank Installation Project filed by Safer, California and the Coalition and adopt a resolution denying'",
        "'speaker_1': 'the appeals and upholding the Board of Harbor Commissioners. Adoption of the final is and d for the project. If you would like to speak on this item, please raise your hand.'",
        "'speaker_2': 'All of it required a live stream of now.'",
        "'speaker_1': 'Yes, but anybody participating in this item, if you and each of you do solemnly state that the testimony you may give in the course now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_2': 'I do.'",
        "'speaker_0': 'I don't.'",
        "'speaker_2': 'Right. Thank you, Madam Claude. Mr. City Attorney, can you now walk walk through the council and the public through the process of this hearing?'",
        "'speaker_0': 'Yes. Vice Mayor, the first I believe there was a preliminary matter. My understanding is that world oil has decided to stipulate to prepare an environmental impact report for this project. So if we could hear from world oil to see if that is indeed the case.'",
        "'speaker_2': 'Paul Ryan is the representative from world over.'",
        "'speaker_0': 'Sue Gornik, the vice president of Environmental Health and Safety. I agree with that stipulation.'",
        "'speaker_2': 'Right. And so. Ms.. City Attorney So what do we need to do from here now that they've agreed to that?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'So in light of that stipulation that moots the appeals for the evening, which we're seeking to have an air prepared. And so if there is a motion from the city council to then direct this to go back to the port for further environmental review, consistent with that stipulation that world oil will prepare an environmental impact report for'",
        "'speaker_0': 'the project. So moved.'",
        "'speaker_2': 'It's been moved by Councilmember Aranda. The next in line was Councilman Austin. Is that a second? Yes. Okay. Yes. All right. Thank you. So it's been moved and seconded. Is there any public comment on the motion to accept this stipulation?'",
        "'speaker_1': 'We do have public comment at this time. There are 12 speakers queued up.'",
        "'speaker_2': 'Okay. And just to be clear to folks, what we're doing is they've agreed to effectively do what the appellant is requesting. And so if you're speaking to that, then now would be the queue up. But let's go ahead administer public comment.'",
        "'speaker_4': 'Nick Garcia. Your time begins now. You have 90 seconds.'",
        "'speaker_2': 'I'm.'",
        "'speaker_1': 'Mr. Garcia, please unmute yourself. Your 90 seconds starts now.'",
        "'speaker_4': 'Our next speaker is Robert Smith.'",
        "'speaker_2': 'Oh, I'm so sorry. I was then when I'm. You know.'",
        "'speaker_4': 'So start.'",
        "'speaker_2': 'Good evening, Vice Mayor. Councilman. My name is Nicolas Garcia. I am a member of the State for fuel and energy resources. California separate. California is a coalition of individuals and organizations with members, including myself, who live and work in and around this area.'",
        "'speaker_2': 'We advocate for sustainable development in Long Beach that minimizes environmental, environmental and public health impacts that provide community benefits, including investment and safe and skilled local construction workforce. Before this project can be improved, the city must address the project's impact on workers, public health and Environmental Environment and Environmental Impact Report, or incorrectly concluded that the project will'",
        "'speaker_2': 'have no significant environmental impacts. At this that is simply false to project a significant environmental impact on air quality health risk and greenhouse gas emissions, the Harbor Commission failed to disclose and mitigate. We believe the mitigation project impacts are critical to ensure good jobs, clean jobs and sustainable construction economy.'",
        "'speaker_2': 'I urge the Council to uphold this appeal and deny the project. Thank you.'",
        "'speaker_4': 'Our next speaker, Robert Smith. Your 90 seconds begins now.'",
        "'speaker_2': 'There we go. Good evening, Mr. Vice Mayor and members of the City Council of Long Beach. Thank you for hearing this issue. The painters in L.A. trades are happy that this is going to go back, that the oil has accepted the.'",
        "'speaker_2': 'e.R. Royal impact report. They're going to do one of the we we as the painters have concerns about safety in the area, etc. for our workers in our workers families in the area. And we also have concerns about skilled and trained workforce, and we look forward to moving forward.'",
        "'speaker_2': 'To the next step here. We just see where we're going to go at harbor commission that the thing is for us is that safer California and. The state building and construction trades have a voice here within this forum.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Our next speaker with the telephone number ending in 8019 year 90 seconds begins now. Please begin. Please hit star six. Oh, that's put him back on. You can begin. Our next speaker is Chris Chavez.'",
        "'speaker_2': 'Yes. Thank you and good evening. Councilmembers. My name is Chris Chavez. I'm the deputy policy director at Coalition Clean Air, one of the appellants for today and also a resident of Brinkley in the seventh District. I want to thank the council for making this motion for your attention to this issue over the past couple of months.'",
        "'speaker_2': 'It really encouraged a thorough air in this process, just to quickly highlight both this project and the community surrounding it are under the Protection of Assembly Bill 617, the Community Air Protection Program. They are both part of the Wellington Carson West, Long Beach, age 17, community, which signifies it's one of the most polluted, most vulnerable communities in'",
        "'speaker_2': 'the state of California. So that's important to keep in mind as we move forward through this process. I just want to encourage the council and the Harbor Commission to do your due diligence in protecting the folks who live in LA in these areas and really make sure that we're reducing emissions from this project.'",
        "'speaker_2': 'Thank you very much for your time.'",
        "'speaker_4': 'Thank you. Our next speaker is Dave Shuker.'",
        "'speaker_2': 'Good evening. Can you hear me?'",
        "'speaker_4': 'Yes, we can hear you.'",
        "'speaker_2': 'Thank you. Dave Fuqua speaking in his capacity as operations director of the Long Beach Alliance for Clean Energy. In principle, I support the motion and thank World Oil for agreeing to the stipulation, although I'd like some clarity on whether the stipulation is for an environmental impact review or just a report.'",
        "'speaker_2': 'I think what's needed is a project air that includes it. That includes all phases of the project, including planning, construction and operation. As we just heard from some of our union folks. Safety issues should be thoroughly examined. Moreover, we need to take seriously maybe whistling in the wilderness that we need to take seriously how a project like'",
        "'speaker_2': 'this fit into our existing program. I mean, just for the state, for instance, the downtown plan, climate plan, city climate plan. As somebody else mentioned, maybe 617 community, police specific communities. Obviously, part of the reason why there's the diesel definition.'",
        "'speaker_2': 'Right. And I also just, you know, trying to think of, you know, 20 or 100 years scale. I'd like to see a technical review of some of these.'",
        "'speaker_4': 'Thank you. Our next speaker is Julie May.'",
        "'speaker_0': 'This is truly a may from communities for a better environment. I'm a senior scientist.'",
        "'speaker_3': 'In our four communities in Wilmington and southeast Los Angeles.'",
        "'speaker_0': 'I just want to thank you.'",
        "'speaker_3': 'For.'",
        "'speaker_0': 'Performing the E.R..'",
        "'speaker_3': 'It was both a no brainer and common sense that this was necessary. And it was.'",
        "'speaker_0': 'Also deeply.'",
        "'speaker_3': 'Documented in the record with the materials we presented about biofuels.'",
        "'speaker_0': 'Hydrogen sulfide, fire danger, earthquake hazards, water risks.'",
        "'speaker_3': 'Many other hazards that were significant in this heavily impacted community.'",
        "'speaker_0': 'We appreciate you doing the full air that was absolutely necessary. Thanks.'",
        "'speaker_4': 'Thank you. Our next speaker is Whitney.'",
        "'speaker_3': 'Levine. My name is Whitney Amaya.'",
        "'speaker_0': 'I'm a resident of West Palm Beach and a member of Eastern Communities for Environmental Justice. And yeah, I also just want to echo what's been shared. I'm glad that, you know, we're not moving forward with a negative declaration and that there is going to be a full year because honestly, a negative declaration for this project just did'",
        "'speaker_0': 'not make any sense because there's a lot of impacts that would come from the project. And I guess I don't think that it needs to be a reminder, but just in case, like my community and a lot of the other communities surrounding this area, we're already impacted by this so much.'",
        "'speaker_0': 'And so please take that into consideration as well, that it's not only the impacts from this project, but the impacts from everything else as well. And I think that's one thing that I wanted to say and thinking of this year is also taking into consideration like accidents, because it's not a question of whether it will happen, but'",
        "'speaker_0': 'when it's going to happen. You know, just from my experience of living next to refineries pretty much all my life and oil and gas infrastructure, it's super scary when things like this happen. And it's also frustrating whenever there's any accidents because there's never any real answers for community members.'",
        "'speaker_0': 'I think the thing that we tend to hear is, you know, there was this crazy accident, but there aren't any threats or any impacts for our health. And if there are impacts from these facilities during regular operations, how are we supposed to believe that there aren't any impacts?'",
        "'speaker_4': 'Thank you. Our next speaker is Sylvia.'",
        "'speaker_3': 'Hi. Good evening, Sylvia Arradondo with Communities for a Better Environment. And it's good to hear that this is going to go back to the air.'",
        "'speaker_0': 'I'm also a community member in Wilmington and have represented to the community in the harbor area for and through my work in different capacities and also as steering committee member for the one with Ben Carson with long with input from seven of.'",
        "'speaker_0': 'And I just want to thank you for sending us back to the air and as other speakers have mentioned of having a project of this scale move forward without an air process is too damaging. And it's also it does bring about a lot of concern, as you all know, living surrounded by industry or at least seen industry'",
        "'speaker_0': 'in our communities really has a severe impact on community health. And so both these are one thing that I'm always constantly talking about with folks because the the health harms.'",
        "'speaker_3': 'That are related from the off season.'",
        "'speaker_0': 'I've experienced many of, you know, friends who passed away from the different chemicals. And we just need to continue to take a stand for community. And so seeing, you know, a 40 hour process really helps us and the community know what is already going on and and continue to put in the documentation.'",
        "'speaker_4': 'Thank you. Our next speaker is actually Hernandez.'",
        "'speaker_0': 'Hello. My name is Ashley Hernandez and I grew up in Wilmington and I'm also with an organizer with Communities for a Better Environment, and we're with our youth program in the local Wilmington Harbor area. I also want to echo what a lot of peers here are saying, and thank you for really including FDR, into this process.'",
        "'speaker_0': 'I think it's obviously a bare minimum for front line communities to get these processes to be carried out. And so I just really wanted to emphasize the need for frontline communities that are dealing with heavy cumulative impacts, including refineries, oil drilling and heavy diesel traffic to be considered in the in the in the many impacts that we're'",
        "'speaker_0': 'going to deal with, including, obviously, this proposal. And so I just really want to echo the sentiments of folks here and really wanting to have a full air be carried out in the next couple of months, it seems.'",
        "'speaker_0': 'Well, I know it was, but thank you so much.'",
        "'speaker_4': 'Our next speaker is Darrell Golden.'",
        "'speaker_2': 'Good evening, everyone. My name is Sarah Golden. I'm a member of West Long Beach Association and the 617 Committee and a resident of West Long Beach. And I just have a couple of questions. The lady from World Oil, did she stipulate to the entire request of the appeal, but just the Arab portion?'",
        "'speaker_2': 'Well, what was the stipulation for police? Hey, there. We're we're not it's not a Q&A, but we're a promotion before we go. Okay, I buy one of those. Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Kalani Lee. 90 seconds begins now.'",
        "'speaker_3': 'Good evening, everyone. My name is Kay. Honestly, I'm both a community member and a lawyer. I'm here to speak on behalf of myself, a Harbor Gateway resident, and my cousin and her son, who are Long Beach residents. I am grateful, like many of the public commenters here today, that this project is going to be sent back for'",
        "'speaker_3': 'a full hour. Given the nature of this project, it's clear that.'",
        "'speaker_0': 'One was required. The fact that.'",
        "'speaker_3': 'It's adding 2500 barrel crude oil storage tanks and freeing up almost 190,000 barrels of petroleum storage has at least the potential to cause significant environmental impacts related to air, water, fire prevention, resources, earthquake hazards and more. And this project clearly.'",
        "'speaker_3': 'Exceeds their firemen. To prove that there's a potential to cause a significant.'",
        "'speaker_0': 'Impact on a community. And.'",
        "'speaker_3': 'I'm just very grateful that it's going to undergo the required environmental review under CSA. Thank you.'",
        "'speaker_4': 'Our next speaker is Allison Ham. Your 90 seconds begins now.'",
        "'speaker_3': 'Hi. Good evening. My name is Allison Holm. I'm an attorney with Communities for a Better Environment.'",
        "'speaker_0': 'I'd just like to thank you for moving.'",
        "'speaker_3': 'Forward with us. For the full year of the World Oil Project.'",
        "'speaker_0': 'SEQUA is a lifeline for frontline line communities that rely on seek review to understand the potentially significant impacts of the proposed projects and to provide comments and proof proposed projects. It goes without saying community should not be sacrificed for the sake of economic development.'",
        "'speaker_0': 'So thank you for prioritizing community health and safety for this project. Appreciate it.'",
        "'speaker_4': 'Thank you. Our next speaker is Marine Premiere.'",
        "'speaker_0': 'Marine Premiere. All right. I apologize. I was having trouble meeting myself. Hi. My name is Marnie Premiere. I'm the executive director for Future Ports, based in Long Beach. We are an organization dedicated to both growing and greening ports of Long Beach in Los Angeles, as well as Wyoming and San Diego.'",
        "'speaker_0': 'And. And building a sustainable supply chain. We are very supportive of World Oil's efforts to work with the council and with the community and labor partners to move this project forward. It's a much needed facility for recycling fuel in the port terminal area.'",
        "'speaker_0': 'We applaud World Oil for voluntarily seeking air on this project and working with the labor and community partners to move.'",
        "'speaker_2': 'The project forward through the air process.'",
        "'speaker_0': 'And thank you very much, the council this evening for your substitute motion to allow this project to move forward. And we certainly do wish that any negative declaration had been upheld, and we were very supportive of the project.'",
        "'speaker_0': 'But we're glad to see that it will continue through the process and we'll be committed to working with world oil and the community partners to make that happen. Thank you very much.'",
        "'speaker_4': 'Thank you. Our next speaker is Anna Christianson.'",
        "'speaker_2': 'Hello? Hello.'",
        "'speaker_4': 'Well, please begin.'",
        "'speaker_2': 'Sorry you asked me to unmute, but I'm not interested in that. Oh. One moment, please.'",
        "'speaker_4': 'Anna Christiansen.'",
        "'speaker_0': 'Hello.'",
        "'speaker_4': 'Please begin.'",
        "'speaker_0': 'Okay. Wait. I'm on the phone because the camera was. The computer wasn't working. I'm sorry. I'm going to try it. Does the computer work now?'",
        "'speaker_3': 'Can you hear me?'",
        "'speaker_4': 'We can hear you.'",
        "'speaker_0': 'Okay. I'm not going to talk on the phone. All right. Sorry. Yeah, this process got a little weird on the computer. Okay, so along with everybody else, I'm grateful. I'm not particularly grateful to world oil. I'm certainly not grateful to city staff who recommended that the project be approved without any air.'",
        "'speaker_0': 'I'm grateful to all the community activists, all the organizations who wrote and researched and did the hard work of contacting community members and and doing the science that is necessary. Grassroots science and outreach that should have been done by the city staff to understand just how.'",
        "'speaker_0': 'Bad. This project is how much we do not need it. There is no. I'm glad. I'm grateful to have an air. Everybody will go. Go through it. But there is no way in hell that this that expanding fossil fuel infrastructure in production, whether it's in the port or in the low cerritos wetlands, is or offshore or offshore'",
        "'speaker_0': 'island is any benefit to this community. It's time to walk away from fossil fuels. Thank you very much.'",
        "'speaker_4': 'Thank you. Our next speaker is Ella Gonzales.'",
        "'speaker_2': 'You know, today meant a lot. And it just said, I, you know, basically, yeah, I'm not here to applaud World Oil Company. This is a private corporation that is pillaging the planet. There was, um, there was a town that caught on fire this, this year on New Year's Day in Colorado.'",
        "'speaker_2': 'I mean, Colorado usually expects snow, not fire. And this is just the beginning of the rest of our lives. But this is a company that made millions of dollars causing, you know, cancer to people, children, asthma, planet burning up.'",
        "'speaker_2': 'So Long Beach needs to start phasing out oil. It needs a plan to not add any more infrastructure. And air should be the expectation and is.'",
        "'speaker_0': 'The law.'",
        "'speaker_2': 'For any type.'",
        "'speaker_0': 'Of development.'",
        "'speaker_2': 'Whatsoever. You're building a building. You're building a parking lot. You're building you're drilling for oil. You're building an oil tanker. You need an air. So, you know, good for them for complying with the law because there was a hearing, because there was a lawsuit filed by Earthjustice, an environmental nonprofit.'",
        "'speaker_2': 'But this isn't a cop out for the city council. You are expected to deny this project in.'",
        "'speaker_0': 'The name of climate.'",
        "'speaker_2': 'Change. If you are not a climate denier, if you accept the science, you accept the reality of the warming planet that you live on. So, you know, good, good. For those who did write the city council, you guys got lucky this time.'",
        "'speaker_2': 'But, you know, we're we're paying attention to these projects. Thank you.'",
        "'speaker_4': 'Thank you. What the individual with the telephone number 8019. Your time begins now.'",
        "'speaker_2': 'I just wanted to ask if this is the item number 26. So by the.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Excuse me. I don't.'",
        "'speaker_3': 'Remember you.'",
        "'speaker_2': 'Mr. Clarke. With a few more people.'",
        "'speaker_1': 'It's the appellant who would like to speak. Please begin.'",
        "'speaker_0': 'Yep.'",
        "'speaker_3': 'Good evening, council members. My name is Carla Fetterman on behalf of appellant Save for California. We support the motion to remand the project in order to prepare an environmental impact report to address and mitigate the project's significant environmental impacts.'",
        "'speaker_3': 'Safer California filed this appeal to address the board's failure to prepare an air for the project pursuant to Secure to disclose and mitigate the project's significant, unmitigated air quality impacts, public health impacts and climate change impacts associated with construction and operation that were not disclosed or mitigated by the negative declaration.'",
        "'speaker_3': 'Our appeal presented substantial evidence supporting a fair argument that the project may result in potentially significant impacts related to volatile.'",
        "'speaker_1': 'Organic compounds.'",
        "'speaker_3': 'And particulate matter and greenhouse gas emissions. As such, we support the motion to remand the project to preparing air. Thank you.'",
        "'speaker_2': 'Right. Thank you. So that satisfies the public comment when they get back behind the rail. I raised my hands. Councilmember Durango.'",
        "'speaker_4': 'I'm sorry, Vice Mayor. We still have one more volunteer.'",
        "'speaker_2': 'I would like to speak. Do we have one more comment on. Hang on. Mr. Clark, go ahead and handle the rest of it. Let us know we have a green light.'",
        "'speaker_4': 'Carter Garage. Your time begins now.'",
        "'speaker_2': 'Thank you. My name is Cody Rhodes. I'm an attorney from Earthjustice representing the coalition that appealed this project. I'm glad to hear that world oil will be preparing in the air for the project. And I'd like to thank the city council members for considering the community concerns on this issue.'",
        "'speaker_2': 'I hope that this air will address the concerns we raised in our appeal filing and the public comments of the project. Specifically, the air need to strongly investigate this project's cumulative impact for context. Over 1000 petroleum storage tanks are already permitted in the South Air Basin and world oil already had seven oil storage tanks at their Long'",
        "'speaker_2': 'Beach terminal with over half a million barrels of capacity. So what doesn't allow us to act as if these tanks don't exist by evaluating the project in a vacuum? So in the air, these cumulative impacts must be thoroughly investigated to give the public and decisionmakers a complete picture of the project's real impacts.'",
        "'speaker_2': 'Unfortunately, recent studies from the South Coast have shown that the emissions from storage tanks like these are systematically underestimated. So benzene, which causes cancer, for example, was found to be underestimated by 34 times. So consideration of these findings is something that really must be incorporated in the upcoming air for this project.'",
        "'speaker_2': 'We're also concerned about disaster risk for the project in the Air must look into alternatives that will mitigate the risk to residents and ecosystems from disasters, especially given the governmental influence of climate change. Thank you very much.'",
        "'speaker_1': 'That concludes public comment.'",
        "'speaker_2': 'All right. Thank you. All right. They're going back behind the room. Councilmember doing a thank you, vice mayor. And I want to thank all the presenters who spoke this evening about the project, the motion that we put on the floor.'",
        "'speaker_2': 'I just want to make sure that I have an understanding of where we're at. And my understanding is that world oil has agreed to simply prepare an environmental impact report with a world oil tank installation project. And I'd like to hear from world oil that my understanding is correct.'",
        "'speaker_2': 'So it's the city attorney. Could you could you clarify? I think I think we're past that part of me, Rita. The city attorney. Can we can you just clarify a lot of discussion between then and now?'",
        "'speaker_0': 'Yes, that is the stipulation. Councilmember.'",
        "'speaker_2': 'Thank you very much for that clarification. So in light of the other fact, I moved to dismiss the appeals as moot and send this project back to the Port of Long Beach for further environmental review and preparation of an environmental impact report as stipulated by world oil.'",
        "'speaker_2': 'I want to thank all of the oil for taking this initiative and ensuring that all potential environmental impacts are exploring this project. I appreciate their willingness to take the lead on this. It also allows for additional details and environmental review to be gathered during the process, as are more important for community input than negative declarations.'",
        "'speaker_2': 'And I look forward to the process in the community. I also want to thank the Point Loma staff for their work on the project and look forward to seeing this full environmental impact review come back to City Council in the near future.'",
        "'speaker_2': 'And then I have a second thought that that would be my statement. That would be my motion. Thank you. Great. Thank you, gentlemen. Most. Helpful advice.'",
        "'speaker_3': 'Thank you. Vice Mayor, I want to echo Councilman Romney's comments and.'",
        "'speaker_0': 'Thank.'",
        "'speaker_3': 'World Oil for voluntarily withdrawing your project this evening and moving forward with a full air.'",
        "'speaker_0': 'It's clear to me from.'",
        "'speaker_3': 'The public comment that we heard that this next phase for you should definitely include.'",
        "'speaker_0': 'A more robust community.'",
        "'speaker_3': 'Outreach component. I think I know for sure that they're based on my understanding.'",
        "'speaker_0': 'Of the project and some of the comments that we heard that they maybe a little bit of of a lack of outreach in.'",
        "'speaker_3': 'Terms of what the project entails and the impacts.'",
        "'speaker_0': 'And I hope that that happens. And also that from some of the comments we heard earlier, that world oil work very actively on.'",
        "'speaker_3': 'Obtaining some.'",
        "'speaker_0': 'Agreement on a skilled and trained workforce as we move forward on this project.'",
        "'speaker_3': 'So thank you very much and have a great night.'",
        "'speaker_2': 'Thank you, Councilwoman Allen.'",
        "'speaker_0': 'Thank you. Vice Mayor I've spoken with the port staff. I've spoken with the applicant, I've spoken with the applicant, and I've heard all sides. And I just want to thank World Oil for voluntarily moving forward with the air.'",
        "'speaker_0': 'You listen to the community and the climate advocate and you are receptive to all of our concerns. So I look forward to being part of the Yarra process and seeing the additional information and the review that comes out, as well as seeing the increased community engagement that will be a part of the process.'",
        "'speaker_0': 'So thank you for being a good partner and keeping impacted communities at the center of our decision making.'",
        "'speaker_2': 'Thank you, Councilwoman Ciro.'",
        "'speaker_3': 'Thank you, Vice Mayor. I want to add to the comments my colleagues made about wanting to think many of the community members and the coalition that's made up of the coalition and providing their concern and ensuring that information is shared with us.'",
        "'speaker_3': 'In addition to thanking staff at the port, as well as oil for providing various information and coming to the conclusion that the best process was to move forward with an air. So thank you.'",
        "'speaker_2': 'All right. Thank you. Say no further council comment. I'll just add my support for what's what's in front of us. You know, two weeks ago, I think no one anticipated that there would be this much anxiety and community angst about the project.'",
        "'speaker_2': 'And I want to thank all the folks who have reached out to my office community members, labor partners, world oil representatives to try to get to the place where I think is the right decision, which is to move forward with a full, more robust process.'",
        "'speaker_2': 'So I'm happy to support this tonight. Let's go ahead and call our roll call vote we.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I'm Mr. Vice Mayor. Just for a while. What I did on second emotion so far. My apologies. I'm just going to go ahead and speak to the company. Well, I think everything has already been said. I agree with all of the comments that have been stated by my colleagues.'",
        "'speaker_2': 'I appreciate the robust input and the passion from the community, but also the the coalition that actually came together, I think was one that I don't think I've ever witnessed, the man who lost ten years on the council.'",
        "'speaker_2': 'And so with that said, I think it's we've landed in a good place. We should move forward, but also in the future when it comes to robust community input. I would just like to also maybe admonish and. Recommend to our port commissioners that they do a little bit more work with the community so that we can get'",
        "'speaker_2': 'these issues dealt with before they get to the city council level. Thank you. Thank you. Let's proceed to the roll call. Vote for.'",
        "'speaker_1': 'District one.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'District two. I District three.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District six. I. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and consider a third-party appeal by Supporters Alliance for Environmental Responsibility (APL 21-006);  Adopt resolution approving and adopting an Addendum (EIRA-06-20) to the Program Environmental Impact Report (PEIR) for the City of Long Beach Downtown Plan (PEIR-SCH# 2009071006) relating to the 636 Locust Development (Project) in the Downtown Plan (PD-30) Area and the Downtown Plan Program EIR Land Use Equivalency Program (Equivalency Program), in accordance with the provisions of the California Environmental Quality Act (CEQA) Section 15164 of the CEQA Guidelines and making certain CEQA Findings and Determinations relative thereto, including a finding that the adopted Downtown Plan Mitigation Monitoring and Reporting Program mitigates, to the extent feasible, impacts associated with Equivalency Program projects, in accordance with those measures set forth in the Downtown Plan, and that no new or different mitigation measures are required; and  Deny the appeal and approve a Site P": [
        "'speaker_2': 'All right. We're here just to do item 21.'",
        "'speaker_1': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and consider a third party appeal by Supporters. Alliance for Environmental Responsibility. Adopt a resolution approving and adopting an addendum to the program. Environmental Impact Report for the City of Long Beach Downtown Plan relating to 3636 Locust Development Project and the Equivalency Program'",
        "'speaker_1': 'and deny the appeal and approve a site plan review for a new seven story mixed use building at 636 Locust Avenue in the Downtown Plan Zoning District District one.'",
        "'speaker_2': 'All right. So if it looks like a over and over is required here, work.'",
        "'speaker_1': 'Yes. If you will be participating in this hearing. Do you and each of you solemnly state that the testimony you may give and the cause now in pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God?'",
        "'speaker_0': 'I do.'",
        "'speaker_2': 'I do. Idea. All right, I'll pass it back to city staff.'",
        "'speaker_0': 'I'd like to. I'd like to introduce the planning manager, Patricia Defender, for she'll make the presentation for this item.'",
        "'speaker_3': 'Thank you so much. Good evening, Vice Mayor. Council members. Just making sure you can hear me okay.'",
        "'speaker_2': 'I can hear you. Okay.'",
        "'speaker_3': 'Perfect. Great. Okay. Patricia Devendorf, our planning bureau manager. This item involves an appeal of an action of the planning commission to approve a mixed use project in downtown and an addendum to the Downtown Plan Environmental Impact Report, which cleared excuse me, an addendum to the Downtown San Environmental Impact Report, which cleared both the development project and a'",
        "'speaker_3': 'downtown plan air equivalency program to enable more residential development to occur downtown this year. Addendum in question Because it environmentally cleared both the project and the equivalency program, it is important for future development in the downtown and I will provide more detail about both the project and the equivalency program in this presentation.'",
        "'speaker_3': 'Do I have the ability to control the side? Just want to make sure. Yeah, probably I do. Okay. Thank you so much. So for some background on this. On September 16th, 2021, Planning Commission approved an ER addendum and a site plan review for a mixed use project at 636 Locust Avenue and also received a presentation on the'",
        "'speaker_3': 'downtown equivalency program as an informational item. A nonprofit organization, Supporters Alliance for the Environmental Responsibility spoke at the Planning Commission hearing and opposition to the environmental review process and subsequently filed an appeal within the appeal period. Over the next several slides, I'm going to describe the projects and then followed.'",
        "'speaker_3': 'And following that I will describe the equivalency program. So the proposed project will replace a vacant single storey building with a new seven storey mixed use structure containing 108 dwelling units nearly 1200 square feet of ground floor commercial uses and associated parking.'",
        "'speaker_3': 'The project has a diverse unit mix, ranging from 1 to 3 bedroom units. It also has building amenities that include a community room, fitness center, lounge area pool, outdoor seating areas, rooftop deck and private balconies. The project site is located at the southwest corner of Seventh Street and Locust Avenue in the Downtown Plan Development District.'",
        "'speaker_3': 'The 22,000 square foot site is bounded by Seventh Street to the North Locust Avenue to the west. A two story apartment building to the south and an alley way court to the east. The general plan land use designation for the property is the downtown place site, which allows higher density development.'",
        "'speaker_3': 'Intensity of development. Next slide, please. This slide shows pictures of the existing condition of the site. You can see the existing vacant building that is a former auto facility, auto care facility. Next slide, please. The site is surrounded by a mix of uses.'",
        "'speaker_3': 'Adjacent uses include an elementary school housing, a health care facility and commercial use. Next slide, please. Project Essentials. The project is consistent with a downtown place type and the land use element of the general plan. Project meets the Downtown Plan Development and design standards, including the promotion of mixed use development with pedestrian oriented ground for project, the'",
        "'speaker_3': 'project with conditions of approval with meet the required site plan review findings. The project is designed as designed is harmonious and compatible in terms of design, character and scale of the neighborhood and the surrounding community, surrounding structures and the surrounding community.'",
        "'speaker_3': 'Next slide, please. So now I'll describe in the next few slides equivalency program. So in 2012, the City Council approved the downtown plan, the PD 30 Zoning District and its Associated Environmental Review, which is a program IIR. At that time, the City Council adopted the plan as well as adopted and certified the air to air environmentally cleared'",
        "'speaker_3': 'development anticipated through 2035. The plan filled out year anticipated development is shown on the table on the right so you can see the different land uses that were contemplated as part of the plan and the program e air and the levels of development associated with each of those uses.'",
        "'speaker_3': 'This was what was analyzed in the air. Currently, development projects consistent with the levels of development contemplated by the plan and the air can rely on the program air for their environmental clearance and do not require additional environmental review.'",
        "'speaker_3': 'The mitigation measures identified in the program are are applied to projects as appropriate to ensure individual project impacts are mitigated to the extent feasible. And additional technical studies are sometimes required to analyze project level impacts and ensure that there are no project level impacts that were not identified in the program.'",
        "'speaker_3': 'Air. The Land Use Equivalency Program, which I'll show a little bit more about that in a moment, was prepared to provide development flexibility so that downtown can continue to to respond to market conditions over the buildout duration of the plan.'",
        "'speaker_3': 'Land uses would be allowed to be reallocated among already permitted land uses of the plan, using an exchange factor developed through the equivalency program, which will ensure that projects will not exceed the levels of development that were analyzed in the program.'",
        "'speaker_3': 'IRR for the plan. Because overall levels of development would remain the same. These are supported by necessary technical excuse me, the er addendum supported by necessary technical analysis was prepared to demonstrate that future projects would remain within the impacts analyzed by the program.'",
        "'speaker_3': 'Ah, when the exchange factors were applied. And square footage in one use was reduced in exchange for increases in another use in accordance with sequence guidelines. California Environmental Quality Guidelines. An addendum to the previously certified air was prepared because the changes are technical in nature and based on a determination that the equivalency program would not result in'",
        "'speaker_3': 'any new significant environmental impact or substantial increase in the severity of the impacts identified in the previously certified IIR. In addition, future development will continue to be subject to the Downtown Plan II or Mitigation Monitoring and Reporting Program, and will have to comply with all applicable mitigation measures, as is the case currently.'",
        "'speaker_3': 'Next slide, please. This table represents the buildout that has occurred in the downtown plan area to date. As you can see from the table, the number of residential units anticipated by the plan has been reached due to the housing shortage and a strong demand for housing.'",
        "'speaker_3': 'At the same time, there has been less build out in the levels of their nonresidential use as contemplated by the plan and the air and the air due to reduced demand for office and commercial space as compared to what was anticipated by the plan.'",
        "'speaker_3': 'In order to continue to allow more residential development to be developed in downtown in response to market demand, and in recognition of the fact that due to a number of market forces, there's less demand for nonresidential uses. South Prepare the equivalency program to allow the swapping among the uses and established equivalency factors that will allow for increases'",
        "'speaker_3': 'in the number of residential uses in exchange for commensurate reduction in the amount of nonresidential. Uses. And. So looks like. But this slide shows the exchange factors, if you will, of the plans. So you can see there were several different impact areas that were analyzed as part of the technical analysis for the equivalency program.'",
        "'speaker_3': 'Traffic and noise. Air quality and greenhouse gas emissions. Based on that analysis, traffic and noise were required the highest exchange rate in order to establish that equivalency. And so going forward, the high exchange rate will be used to to allow for increased residential development.'",
        "'speaker_3': 'And this represents a conservative approach to ensuring that the impacts that were analyzed in the EIA are not exceeded. And you can see, for example, that 82 square feet of commercial equals one dwelling unit. Similarly, 315 square feet of office equals one unit or.'",
        "'speaker_3': 'Just over half a hotel room equals one unit. So this is the exchange rate or the equivalency factor that will be used in the future. Next slide, please. This table just provides a an example. If there's a project that consists of 100 residential units, there would be a reduction in order to allow that project.'",
        "'speaker_3': 'There could be a reduction of office of 31,500 square feet, and that would ensure that there the project is staying within the impacts that were analyzed in the air and that we're not exceeding those impacts for the future.'",
        "'speaker_3': 'The. Excuse me with future development. Next slide, please. So just to provide an overview of the equivalency program, equivalency program anticipates a build out of an additional just over 3200 units in exchange for reductions in nonresidential square footage.'",
        "'speaker_3': 'You can see those reductions in the middle column there. Those are the reductions that would be required in each of the nonresidential categories to remain equivalent to an increase in 3200 units. And you can see that that would mean a reduction of approximately 140,000 square feet of commercial, just over 400,000 square feet of office and a reduction'",
        "'speaker_3': 'of 177 guestrooms hotel guestrooms. But also with the increase in housing. There's still an opportunity to develop additional nonresidential uses. And you can see those adjusted capacity for those uses on the floor, on the column, on the right there.'",
        "'speaker_3': 'And this is to ensure that a mix of uses can continue to be developed in the downtown. Next slide, please. So just to cover some of the appeal, the specific appeal points, the appellant is appealing the project and the addendum on the basis that the project and the equivalency program are not within the scope of what was'",
        "'speaker_3': 'analyzed by the previously certified E.R. and the city should have prepared additional separate environmental analysis, a new environmental impact report or a negative declaration. This claim is made on the basis of the points that are shown on the table here.'",
        "'speaker_3': 'Summarized on the left. The appeal points on the left. Provide the staff. Sorry, on the right, provide the staff response. The project is within the scope of the ER because there is no change to the type of uses permitted nor to the overall plan density or building intensity or the geographic area that was analyzed in the original'",
        "'speaker_3': 'air. The idea did consider and rejects an increased residential density alternative, but that alternative was an overall higher intensity alternative that included increased residential density but also contemplated the same or greater levels of non residential density. The equivalency program, as I pointed out previously, would make reductions in nonresidential nonresidential development in exchange for increases in the residential'",
        "'speaker_3': 'development to stay within the overall level of. Development and impacts that were analyzed in the air. The addendum presents substantial evidence for the finding that the equivalency program will have the same or less impacts as the program analyzed in the air.'",
        "'speaker_3': 'The impact of the project and the equivalency program is consistent with the analysis and conclusions presented in the certified air. And no additional findings are required because no new impacts have been identified as a result of the equivalency program.'",
        "'speaker_3': 'And as a result, none of the circumstances requiring a subsequent or supplemental air in accordance with law are present. Next slide, please. In accordance with the school guidelines. On the basis of what I described previously, an addendum to the ER was prepared.'",
        "'speaker_3': 'The addendum was prepared to analyze the proposed project to determine whether the project resulted in any new significant environmental impacts. It was determined that this project and the equivalency program will not result in any new, significant impacts that exceed those that were analyzed in the downtown plan air.'",
        "'speaker_3': 'In addition, future development will remain, will continue to be subject to the downtown plan, air mitigation monitoring program, and will have to comply with all applicable mitigation measures. Equivalency program does not require or involve any amendments to the downtown plan.'",
        "'speaker_3': 'The PD 30 zoning district and none are proposed. The allowable uses and the plans, development standards and overall densities and intensities remain the same. The preparation of the Environmental Impact Report addendum is an administrative process and does not have a public notice requirement or a stipulation period.'",
        "'speaker_3': 'So with that, the five, please. These are the recommendations for council to receive supporting documentation into the record complete. Conclude the public hearing and consider this the third party appeals adopt a resolution approving and adopting the addendum and all of the required finding and to deny the appeal and approve the site plan review for the seven storey'",
        "'speaker_3': 'building at 636 locust and to uphold the equivalency program. And that does conclude this presentation. The applicant is here and the city. The consultant who worked on the environmental analysis are also available to answer any questions if needed.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'All right, let's set up the presentation. Now we're going to go to public comment. And when we're done with that, will close the hearing and have a council deliberation. So do we have any public comment on this?'",
        "'speaker_1': 'Yes. We have public comment on this item. There are two of our panelists, Brian Flynn and Sandy Schmidt.'",
        "'speaker_2': 'Good evening. Can you hear me? Yes. All right. Good. Thank you. Good evening, honorable council members. My name is Brian Flynn. I'm an attorney with the law firm Lowther Drury here on behalf of the Supporters Alliance for their.'",
        "'speaker_0': 'Civility.'",
        "'speaker_2': 'And support of their appeal. The pertinent question here is what level of environmental review sequel requires for this project? For reasons I'll discuss, Safer is not opposed to the project per se, but believes that sequel requires an environmental impact report rather than an agenda.'",
        "'speaker_2': 'So Safer is respectfully request of the Council. Uphold the appeal and refrain from approving the project at this time until anti-air is prepared. So in situations where there's a prior program, the air, which in this case is the 2012 bar for the downtown plan, seek to have standards for what level of review is required for subsequent activities'",
        "'speaker_2': 'when certain factors are met. The sequel requires an air and we think some of those factors are met here. First, the equivalency program and the Seventh and Locust Project are not within the scope of the impacts analyzed in the downtown plan.'",
        "'speaker_2': 'He air the downtown planning air on the analyzed up to 5000 units and the increase in residential use proposed by the equivalency program is outside the scope of the downtown planning air and the addendum is not proper. Rather, an air should be prepared the tiers from the analysis and the 2012 air that can be addendums and proper'",
        "'speaker_2': 'because the air is required for the projects remaining significant and unavoidable impacts. The addendum can see that the equivalency program will result in numerous significant and unavoidable impacts, including air quality, greenhouse gases, public services and traffic. When a first tier EIA, such as the downtown plan, the air reveals significant and unavoidable impacts, and those impacts are not'",
        "'speaker_2': 'mitigated by a subsequent project. Sequel requires in the air any statement of overriding considerations for those impacts. Third, and the air should be prepared because there are significant impacts to air quality that were not analyzed in the 2012 downtown planning air Safer submitted comments from indoor and outdoor air quality experts.'",
        "'speaker_2': 'They found that emissions of diesel particulate matter and formaldehyde would result in increased cancer risk in excess of the threshold set by the Air District. These impacts to human health were not addressed in the 2012, the air or the addendum and should be included any new air for this project for their new mitigation measures available to reduce'",
        "'speaker_2': 'the project's impacts. Such mitigation measures include Tier four final emissions standards for construction equipment and no formaldehyde added products for indoor air quality impacts. These mitigation measures are now commercially available as compared to 2012. With that, I will conclude again.'",
        "'speaker_2': 'To be clear, Safer is not opposed to this project in and of itself. Safer just wants the project to undergo the proper amount of environmental review and make sure all impacts are disclosed and fully mitigated. So Safer is requesting the Council uphold the appeal and not approve the project at this time so that an air can be'",
        "'speaker_2': 'prepared first. Thank you.'",
        "'speaker_4': 'Our next speaker is Sandy Schmidt.'",
        "'speaker_2': 'Let's just let's just clarify before we go to the next point, madam Claire. These are the is the appellants. So they they actually have an extended period of time, is that correct?'",
        "'speaker_1': 'That is correct. Brian Flynn is the appellant and Sandy Schmidt is the applicant. They both get 10 minutes. Mr. Flynn just used his time and the next speaker is Sandy Schmid.'",
        "'speaker_0': 'The applicant.'",
        "'speaker_2': 'Is there any additional public comment beyond that?'",
        "'speaker_1': 'There are public comment. There are two public comment speakers after Sandy.'",
        "'speaker_2': 'Okay. So I'll let so go ahead and let me know when all of that is concluded. Thank you. Hello, this is Sandy Schmid. I am the developer representing the project and not much in the way of comments tonight.'",
        "'speaker_2': 'Vice mayor and council members. Thank you, first of all, for for hearing us and our project. And most of all, thanks to staff for privacy preparing this presentation. It was in-depth in its technical scope and review far beyond my capabilities.'",
        "'speaker_2': 'So thank you to the staff for doing a tremendous job here. It's an old vacant tire shop, and we'd love to, you know, make something which we think has contributed to the to the downtown Long Beach community, and hopefully we have that opportunity.'",
        "'speaker_2': 'So thanks again.'",
        "'speaker_4': 'Our next speaker is Lee Charlie. Your time begins now. You have 3 minutes.'",
        "'speaker_2': 'Hey. Good evening. I just pulled over. I'm actually working. I really appreciate all the data and analysis, but I'm speaking from a lot of residents that live literally three streets down from the Taco Bell, the Ginny Ora Pausa on seventh street and Chestnut and this location, that tire shop is abandoned.'",
        "'speaker_2': 'And right next door there's an abundance of parking. The issues that I raised to the developer is not about the environmental impact, but about the traffic impact. As you know, Seventh Street is the corridor that goes on to the 710 and it's already what we call the Mini Grand Prix.'",
        "'speaker_2': 'And then at about 4:00 on the exit ramp off the 710 coming down sixth Street where my car was totaled last year. And pretty much I would say not exaggeration about every three weeks there are wrecks that go from Magnolia all the way to Long Beach Boulevard on Sixth Street.'",
        "'speaker_2': 'So my question is, looking at the data, 108 units, commercial units. My question is, where did the developer do like the traffic study, for example, how many people and residents will be using cars going in and out? How many residents will now be using this exit non ramp for the 17 to get to work in L.A.?'",
        "'speaker_2': 'Another thing is commercial use. What kind of commercial will it be? Like a grocery store, a shop which will bring even more traffic to the Seventh Street and Sixth Street. So my question is living there, Taco Bell has a lot of foot traffic, Jenny, or a pod that has a lot of foot traffic.'",
        "'speaker_2': 'And now we're having an additional unit with more cars, more traffic, more commercial. So I just asked the city council, are the developer to maybe give us some insight of that? Was there a traffic study done? And then from my understanding with our councilwoman giving us some great information, I believe Seventh Street and Sixth Street are going'",
        "'speaker_2': 'to be close. And so my question then is how will that traffic impact our district and the neighborhood and the well, more well, more city and the north time now that there's no exit an on ramp and we've got a 100 to 135 more cars and people accessing this development.'",
        "'speaker_2': 'So I just raised questions and want to know if possible, did the developer do a lot of traffic impact study? And I hope you have a wonderful evening. Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Bridget de la Toya. Bridget Dilatory. Your time starts now.'",
        "'speaker_0': 'Sorry. I made a mistake. Wrong item.'",
        "'speaker_4': 'Thank you. That concludes public comment.'",
        "'speaker_2': 'All right, closing public comment, bringing it back behind the real council members. And Dana.'",
        "'speaker_3': 'Thank you very much, Vice Mayor. I also want to thank the the staff who have been doing an enormous amount of work on this item. And I also wanted to ask staff a couple of questions, maybe addressing the concerns that Mr. Flynn brought up.'",
        "'speaker_3': 'I wonder if staff is available to address some of those concerns that were brought up for the public to hear. Please. Sure. Thank you, counselor in Kandahar. So good to address in general the issue. As I mentioned, the analysis that was conducted, the technical analysis that was conducted to inform the addendum, the analysis was all about, is'",
        "'speaker_3': 'there are there any new significant impacts that would be associated with the equivalency program that were not identified in the previous air? Or whether there was any increase in the severity of those impacts. A checklist was conducted for every impact area that is analyzed in through as a requirement to figure out all the different environmental impact areas'",
        "'speaker_3': '. And it was determined that there would be no new significant impacts that were not already analyzed in the air, and there would be no increase in the severity of any impacts that were analyzed in the air and that there were no new feasible mitigation measures that were identified.'",
        "'speaker_3': 'For those reasons, it was determined that there would be no additional the circumstances that surround that. Requiring additional environmental impact reports or additional analysis did not exist in this case. And so that that is the conclusion and it is substantiated by the analysis that is part of the public record.'",
        "'speaker_3': 'And in particular, I wanted to just quickly address the the issue of air quality. The Environmental Impact Report that was certified by the council did identify a number of areas that were significant and unavoidable impacts. And that remains the same with the equivalency program.'",
        "'speaker_3': 'So there are no new areas of impact that were not already identified and hence there is not a need for a statement of overriding considerations because the statement of overriding considerations is already adopted by the Council. But there are mitigation measures associated with air quality, in particular construction mitigations.'",
        "'speaker_3': 'And those mitigation measures do require the use of the most up to date equipment that is available for reducing emissions during construction processes. And it does refer to the assumed, which is the Southern California Air Quality Management District, and whatever standards are the relevant standards at the time of construction.'",
        "'speaker_3': 'And we do apply that when we are applying the mitigation measures to the individual projects. Thank you so much for that. And I am very much in support of Stafford's recommendation today, because I know that they've worked very diligently to try to meet all of all of the ten points that were addressed in in the field.'",
        "'speaker_3': 'So. And as you all know, we are in dire need of more housing here in Long Beach. As a big advocate for housing that I am, I must support projects that really lead us in the right direction for housing.'",
        "'speaker_3': 'Housing for everyone. There is with just with this project alone, there is 108 additional dwelling units in the city. And that that comes with additional 135 parking stalls, which is something that is very much needed. This is really a great addition to the downtown area, and I hope that my colleagues will support me in this as well'",
        "'speaker_3': '. Thank you.'",
        "'speaker_2': 'Thank you. Was that a motion councilwoman? Yes. Recommendation. Okay. Yes. Councilwoman Allen.'",
        "'speaker_0': 'Thank you, Vice Mayor, and thank you, Councilman de hop for those questions. I think that this project will bring the much needed additional housing to our downtown area, and addressing our housing shortage in downtown and throughout the city is definitely a priority.'",
        "'speaker_0': 'I will continue to monitor these projects very closely and I just want to thank staff. I want to thank the Planning Commission for their work on this. And I also want to recognize the appellant for bringing their concerns forward.'",
        "'speaker_0': 'The appeal process has prompted a deeper dove into this project, and I definitely appreciate staff taking the time to brief my office and answer our questions. And as chair of the Climate Action Environmental Committee. I definitely take environmental impact concerns very seriously.'",
        "'speaker_0': 'The project is consistent with the PD 30 development standards and the pier that are prepared for the downtown plan. And staff have assured me that this project will not cause no negative impacts upon the environment or the surrounding area, nor would it introduce new uses that are not already permitted by the downtown plan.'",
        "'speaker_0': 'So it is my understanding that the debate, which represents both residents and businesses in downtown, submitted their letter in support of this project. So I will also be supporting this item today.'",
        "'speaker_2': 'It's a fantastic very public. Well, we already did, but we can't say it's time to go for the roll call vote on this.'",
        "'speaker_1': 'District one, district two. I District three i district four I. District five.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute an agreement, and all necessary documents including subsequent amendments, with the California Department of Cannabis Control (DCC), to receive and expend grant funding in the amount of $3,934,773, to support the Long Beach Cannabis Program, for the approximate period of January 1, 2022 through June 30, 2025; and  Increase appropriations in the General Grants Fund Group in the City Manager Department by $3,934,773, offset by grant revenue from DCC. (Citywide)": [
        "'speaker_2': 'All right. Congratulations on your title. Number 22 with.'",
        "'speaker_1': 'Report from City Manager Recommendation to adopt a resolution authorizing the city manager to execute an agreement with the California Department of Cannabis Control to support the Long Beach Cannabis Program citywide.'",
        "'speaker_2': 'Looking for a motion in the circuit. Okay. Uh, Councilman Ranga, I want to speak to your motion. Okay. Councilwoman Sara, I was elevated. I had no clue. I think it's a good project, great sorrow.'",
        "'speaker_3': 'It's great to be able to have additional funding to support our cannabis program. Thank you.'",
        "'speaker_2': 'In fact, the councilman often thank you. Obviously, I support this motion. This is you know, we're not in the business of turning away resources from from the state. Obviously, we have some ambitious objectives here, particularly related to social equity and implementing that here.'",
        "'speaker_2': 'I'm kind of waiting to hear from the city attorney in terms of how and how you envision utilizing these resources to get there, but also support our program. City Manager, you want to give a brief back report?'",
        "'speaker_5': 'Yes. Emily Armstrong will be able to answer some of those questions. Emily.'",
        "'speaker_3': 'There. Can you guys hear me?'",
        "'speaker_2': 'Yeah.'",
        "'speaker_3': 'Okay. Yeah. So the $3.9 million that we're going to be receiving from the DCC will actually go towards the.'",
        "'speaker_0': 'Overall cannabis program.'",
        "'speaker_3': 'So what we're looking to do is to convert the provisional licenses in the state's process to annual. And through that process, we're also looking to streamline our operations and expedite them through the process. And so we're looking to hopefully cut the application process by half and then hire some additional staff in almost every single department with these'",
        "'speaker_3': 'funds. So it'll be a great a great resource for the cannabis program.'",
        "'speaker_2': 'Fantastic. Anything else, Councilman? All right. No, thank you. I appreciate that. And obviously, we will look forward to learning more time moves on. All right. All right, Councilwoman Allen.'",
        "'speaker_0': 'Yeah. Just a quick question. Can you clarify one of the ways in which the software can be used and can the funds be provided to applicants to help defray the business startup expenses?'",
        "'speaker_3': 'So this grant in particular does have some limitations. So this grant is not related to providing direct grants to applicants. This grant, actually, we're going to be hiring staff and consultants to basically help applicants throughout the process. And it does have some limitations in terms of the funding that we can do.'",
        "'speaker_3': 'So this is actually going to hire staff and consultants for regulatory compliance, application processes, things like that. There is some funding that's also going to be going toward website design and technology to hopefully streamline the communications with applicants.'",
        "'speaker_3': 'But it cannot be spent on direct grants or loans or anything like that.'",
        "'speaker_0': 'Okay. Thank you very much.'",
        "'speaker_2': 'Right. Thank you. Let's go to public comment. Very public comment on this item.'",
        "'speaker_4': 'We have one member of the public, Eliot Lewis. Please begin.'",
        "'speaker_2': 'Did you guys hear me? We can hear him. Yeah, no, I just wanted to make some commentary in general. It's nice that we're getting some more funds. You know, the state collects 900 million in taxes. They're redistributing 100 million.'",
        "'speaker_2': 'Not the best system. I really wanted to focus, although I think all taxes in cannabis are too high. I really wanted to focus on the cultivation and tax. I think we should completely eliminate the cultivation tax. We have two really big brands here.'",
        "'speaker_2': 'We're creating great cannabis culture. We have Fresh Bake and we have Wonder Bread all across the state. The governor included up in Sacramento, they're getting rid of cannabis tax. San Francisco's got rid of all cannabis taxes. Sonoma's got rid of cultivation tax.'",
        "'speaker_2': 'Humboldt is right behind it. We continue to tax cultivators at the same rate. Although there's been massive price compression and they're suffering, they're barely keeping their head above water. And again, it's not about me. It's about good policy.'",
        "'speaker_2': 'You know, we don't like paying the retail tax, but it's really cultivation that we need to focus on. Council did a great job of modernizing the other vendors. Now we need to focus on cultivation and you know, depending on what time it is, I don't have an orthodoxy on that.'",
        "'speaker_2': 'I was the one retailer that came out and said, Hey, with the pandemic, we're doing really good. Let's raise taxes temporarily, half a percent. And, you know, like cause and like, you know, of the Rockies and Hershey of Pennsylvania, we're creating a great cannabis culture here.'",
        "'speaker_2': 'Long Beach hashtag farmers is becoming a thing, and we need to cultivate that, no pun intended. And at the end of the day, like Long Beach got put on the map from nineties, rapper Sublime, all of these different things.'",
        "'speaker_2': 'Cannabis culture is going to be part of that. And I think it's really important, you know, more than just the money you got, you know, jobs and everything else at stake. And I want to say that the amount collecting the cultivation tax based on our research is, you know, a very small amount, around $1,000,000.'",
        "'speaker_2': 'You know, we're budgeted for 8 million, we're collecting 10.3 million. And as the reforms come in at the state, I suspect I suspect that number will be more. So stop taxing farmers. We need to modernize the tax code, especially as it goes to two cultivation tax.'",
        "'speaker_2': 'Get rid of it altogether. We got a $3.9 million windfall and this is happening up and down the state. Let's stay progressive on the issue. Let's stay modern and let's stay up to date. I think that's all have.'",
        "'speaker_4': 'That concludes public comment for you.'",
        "'speaker_2': 'All right, members, please cast your vote as well as the roll call vote.'",
        "'speaker_1': 'District one.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District six. I. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'I.'"
    ],
    "Recommendation to adopt a Middle-Income Housing Program to include the policy components included herein.  (Citywide)": [
        "'speaker_1': 'District nine. I. Motion is carried.'",
        "'speaker_2': 'Thank you. With item 23, please.'",
        "'speaker_1': 'Report from Development Services Recommendation to adopt middle income housing program to include the policy components included here in citywide.'",
        "'speaker_2': 'All right. Thank you. I know there's a there's a staff report on.'",
        "'speaker_5': 'Yes. Mayor, vice mayor and members of the council. This is a pretty complex process. We would like to spend some time to go through what we've been working on to try to develop an additional tool for some middle income housing.'",
        "'speaker_5': 'We have, of course, the director of development services who can walk us through the policy and some of the implications and be able to answer questions. Oscar.'",
        "'speaker_2': 'Thank you, Mr. Modica. Please. Next slide. Thank you, Mayor. And members of the Vice Mayor. Members of the City Council. Moderate income households are those households that earn between 81 220% of the area median income. These households are looking for affordable housing as well as others, but earn too much to qualify for the standard subsidized lower income'",
        "'speaker_2': 'housing. City programs have focused on a variety of programs to assist very low and low households. Thus, we have not been able to meet the moderate income housing units required under the current housing element. And the next housing element will require over 40,000 moderate income units.'",
        "'speaker_2': 'In February of 2021. The City Council approved the participation in the case middle income housing program for the purchase of the Ocean Air Apartments for middle income housing on a pilot basis. At that time, the City Council also asked staff to conduct further research and return to council with a proposed Long Beach middle income housing program.'",
        "'speaker_2': 'This presentation summarizes staff's recommended policies, which was prepared with the assistance of HRA advisors who are here tonight to answer any questions and is attached to the council letter that you have in front of you. Next slide, please.'",
        "'speaker_2': 'I would like to provide a brief middle income program overview. There are three primary parties involved in these transactions, which include the JPA and the JPA Act as a sponsor as well as the owner of the project and is also the bond issuer.'",
        "'speaker_2': 'The city is considered the host and can request the sale of the property after 15 years. The developer is a project administrator that is responsible for putting together the deal. These projects are 100% financed by tax exempt bonds.'",
        "'speaker_2': 'Bond terms are typically 30 years. There are two types of bonds associated with these transactions. The first type is a series, a bond. These bonds are intended to acquire the property where applicable for new construction, for financial reserves and other cost.'",
        "'speaker_2': 'The series B bond is another type of bond and that that is provided solely to the project administrator as preferred equity. Next slide, please. The JPA or Joint Powers Authority or the owner has the ability to purchase, own and finance the project, including existing or existing housing or new construction projects.'",
        "'speaker_2': 'Some or all the units are typically restricted to moderate or middle income households. If the city approves the project, it will enter into a public benefit agreement with the JPA, and the JPA will have a property tax exemption during the term of the bonds.'",
        "'speaker_0': 'How?'",
        "'speaker_2': 'Household income restrictions terminate at the end of the bond term, and the city has a right to force the sale of the building after 15 years and realize any net proceeds from the sale after the debt is paid off.'",
        "'speaker_2': 'Next slide, please. This financial structure is relatively new in the long term data and its success is really not available. The financial structure does not rely on the excuse me, it does rely on economic growth to pay off the debt rather than more conventional financing structure.'",
        "'speaker_2': 'So what the city is attempting to do is to with with these programs.'",
        "'speaker_0': 'Is to reduce the risk.'",
        "'speaker_2': 'And provide real, meaningful middle income, affordable units. To accomplish this, the middle income program has been designed to ensure long term housing affordability, ensure adequate long term property maintenance, reduce the.'",
        "'speaker_0': 'Risk of.'",
        "'speaker_2': 'Foreclosure, recover the city's pro-rata share of the property tax revenue, provide oversight and accountability, and provide access for the processing of these requests. Next slide, please. This slide is intended to illustrate all the parties involved as currently structured with other deals.'",
        "'speaker_2': 'The interaction between the city or the host is with the owner. As you can see from the attached illustration, what these policies are intended to do is to provide more, like I said, more oversight and accountability, accountability to the other parties involved in this agreement.'",
        "'speaker_2': 'Next slide, please. So the program, again, as indicated in the report, the program that we are proposing is flexible and we've established a structure that can be tailored to a certain project's attributes. Therefore, we are asking the Council to approve the following policies.'",
        "'speaker_2': 'The first policy is a provision for a requirement of deeper affordability by requiring deed restricted moderate income units that will qualify for the Reno Regional Housing Needs Allocation Credit to maintain the city's housing element requirements. Also, the provisions are intended to rely on or to propose housing affordability that is based upon income state income requirements.'",
        "'speaker_2': 'Although this is a flexible term and we can use other affordability requirements like providing that there's greater affordability in the project field. Another provision or policy is to maintain the city or to recover the city's property tax losses via a host fee.'",
        "'speaker_2': 'And lastly, we have other public benefits, and this is intended to be a bit of a catch all, if you will, again, in order to be able to tailor a transaction to the attributes of the project. And some of the things that we could consider is if a project comes to the city that provides other revenues like'",
        "'speaker_2': 'sales tax. In the case where you have a mixed use project or the preservation of older properties, this will allow for older properties to continue with certain amount of improvements. Next slide, please. In order to implement these policies.'",
        "'speaker_2': 'The program includes bond underwriting standards. These include such things as a host fee, as indicated earlier, to recover the pro-rata share of the city's property tax revenue. It also requires things like a third party appraisal to review the administrator and the and the sponsor or the owner's cause for the acquisition and sale of the property.'",
        "'speaker_2': 'Again, we are recommending that rents be limited to 30% of household income consistent with current affordable housing standards and that net tenants get paid utility allowances as well as other things, including affordable restrictions, to include a minimum 55 year deed restriction on these units.'",
        "'speaker_2': 'Next slide, please. Additional underwriting standards include establishing reserve accounts with escalators to ensure proper property maintenance. Ensuring bond debt service ratios of 1.0 beginning on year one. Minimizing the interest only financing so that we can establish bond amortization at the end of the bond terms.'",
        "'speaker_2': 'The city's ability to review construction costs for new construction projects is also part of the provisions. Underwriting provisions in other provisions are included to reduce debt, maintain a healthy operating expenses and return on the investment. Next slide, please.'",
        "'speaker_2': 'The program also includes standards as well as oversight provisions for such transactions and annual fees for the oversight, such as allowing the city to review the closing cost of the bond transaction, allowing and providing an annual fee that would pay for the city's annual review of the project.'",
        "'speaker_2': 'Making sure that the asset there's at least three years worth of asset management reserves in the project. Provisions in the project deal and making certain that the series B bond not capitalized the interest. Next slide, please. Additional oversight provisions include the city's ability to review and approve any additional debt exceeding $15,000, as well as the ability to'",
        "'speaker_2': 'force the sale of the project after the 15 years of long term and the ability to approve or reject changes to the project team. The project team, including would include the JPA slash owner, the administrator and the property manager.'",
        "'speaker_2': 'Next slide, please. The policies also prescribe qualifications for the middle income team. We are setting certain provisions or standards, if you will, for the JPA. The administrator, the property manager, the property manager, excuse me. And also the provision to include an independent municipal advisor to participate in the transaction.'",
        "'speaker_2': 'Next slide, please. Tenant protection provisions are also included in the policies to prevent the displacement of existing tenants, while ensuring that the rapid replacement of two middle income households and adhering to the OECD's affirmative fair housing provisions, as well as honoring housing vouchers.'",
        "'speaker_2': 'Next slide, please. As envisioned, the program will require significant annual reporting, including a tenant satisfaction survey, household income and rent information. An assessment of the condition of the property in an annual financial report. These reports will be required in the Public Benefit Agreement and the city may request corrective actions based upon the report findings.'",
        "'speaker_2': 'Next slide, please. The program also provides an application and a review process with fees to support Stat's review, including the third party reviews. Thank you. Next slide, please. And I know there's a lot there's a lot here to unpack.'",
        "'speaker_2': 'But at this point, the city's recommending staff is recommending that the city council approve the middle income housing program, as indicated in the attachment to the council letter. That concludes my presentation.'",
        "'speaker_0': 'Staff, including.'",
        "'speaker_2': 'H.R. Nick, are consultant, is here to answer any questions that you may have at this time. Thank you. And I'll just add a comment and then we'll go to Councilwoman Sun Huff, whose maker is cued up to make a motion.'",
        "'speaker_2': 'But I do remember when staff said, Hey, let us have some time, go come up with a policy. Because, you know, the last project was a pilot. And since then, you know, we see that other states, other cities are adopting this.'",
        "'speaker_2': 'And I just want to thank the staff for taking the time to put a policy forward. So what we do is consistent, and I love the things that I heard. Tenant protections are within that. Some of the things that the city values are within that.'",
        "'speaker_2': 'So we're expanding middle income housing while preserving units as well. And I think that's having more tools in the tool belt is certainly important. So I want to go to Councilwoman and they are.'",
        "'speaker_3': 'Thank you, Vice Mayor. For that. And thank you very much, staff, for that presentation. Thank you. As you know, I'm the housing advocate and I truly believe that when we say housing for all that it really means housing for all.'",
        "'speaker_3': 'We need to ensure that we focus on increasing and retaining local employment opportunities in our city and for our residents. And as we continue to work on breaking the generational poverty cycle, that we also plan to expand and build in opportunities for middle income housing.'",
        "'speaker_3': 'Even so, this program is designed to ensure long term housing affordability and maintenance is still a main focus of our city. And this is an area in which our partners that point have been very supportive of. I've as I've mentioned before, I'm a huge supporter of our students and our local university.'",
        "'speaker_3': 'That provide outstanding educational force in our city. Which is why I'm very excited for the partnership between Health, State University, Long Beach faculty and staff for this middle income housing prepackaged in Taiwan. Spin off. Oh, sorry. Sorry about that.'",
        "'speaker_3': 'That's okay. For the middle income housing proposal that has been introduced recently. And I want to make sure that this item supports the this project. Given the opportunity I'm sorry, given the complexity. I'd like to take the opportunity to raise a couple.'",
        "'speaker_3': 'A couple of things. And first, I want to say thank you to staff for all the the work that they have put into this, because they really deep dove deep into this issue. And they've really done a lot of work on this around it.'",
        "'speaker_3': 'And so I really want to say and I also want to thank all those who who have reached out to my office and in support of this and all the letters that I have that I have received. So I'm very thankful for that.'",
        "'speaker_3': 'I would also like to ask staff to come back within 45 to 60 days with an amended set of criteria that distinguishes between grownup construction and acquisition of existing buildings already under the modern income housing program. And in that regard, I'd like to make the following three recommendations for this item.'",
        "'speaker_3': 'First. I'd like to. I'd like us to adopt. I'd like us to adopt the general goals for the middle income housing program set forth by the staff report. Second, I'd like for us to direct city staff to work with Walter for California State University, Long Beach and CSC Aid to move forward with the faculty staff housing proposed'",
        "'speaker_3': 'that submitted by Waterford in September 2021 and to return to City Council within 60 days for final approval. If if the proposal meets the three primary goals set forward in tonight's staff report, aim make the city whole from any projected property tax law to achieve the city's affordability goal and see demonstrate that the property has adequate financial'",
        "'speaker_3': 'reserves and maintenance is required. So. I'd like to recommend that. Direct and direct staff consultant. Eight are and eight to work with the larger development community to refine the most specific of criteria set forward in the h r.'",
        "'speaker_3': 'In a report attached to the staff memorandum for future projects to be considered under the Middle Income Program. Thank you.'",
        "'speaker_2': 'All right. Thank you. I see a motion. I'm going to ask that before your next person. Do you are you clear on what that motion was? I know there was a pretty large, pretty long expanse of motion. Could you just speak to that?'",
        "'speaker_2': 'Yes, Councilmember. I think we're we're clear. We've got 45 to 60 days to come back to take the goals that we provided in the staff letter. And at the same time, consult with.'",
        "'speaker_0': 'Our.'",
        "'speaker_2': 'Waterford and CDR to make certain that we become whole as far as our loss in the property tax revenues and other provisions, and more importantly, to separate between the new construction projects versus existing transfer of existing projects. So I believe I've captured that and we can certainly do that, come back and at the same time and negotiate'",
        "'speaker_2': 'with Waterford on their proposed deal. And what we would bring back to you is policies that either align that hopefully will align with the Waterford project. And so we'll provide that analysis to you in 40 to 60, 45 to 60 days.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Okay. We're going to. Okay, we'll keep we'll keep going. Councilman Austin. I think a council member of the day has put it very, very bluntly and clearly. I mean, obviously, there is a huge need in our city to build housing, affordable housing, workforce housing.'",
        "'speaker_2': 'I think this policy advances that and gives us puts it in a good position to continue to do this, particularly in our downtown area. And I think it's a great place to continue and come back with specific projects in mind.'",
        "'speaker_2': 'So I support the motion to. Right next, we have Councilman Price. Ask me real quick, Justice. Can council members further clarify our interaction with H.R.? And I just want to make sure I understand that correctly. I didn't even understand the question correctly.'",
        "'speaker_2': 'Oscar. Who are you? Do you have a question for the magazine? Yes, the maker of the motion council member. My apologies. If you could just restate the and our ability to work with a consultant as part of your motion.'",
        "'speaker_3': 'Yes. I would like them to work with the water it. Well, with with obviously with staffers, with water, Ford and CSR and all the parties involved so that we can move this project forward.'",
        "'speaker_2': 'And I just want to be clear, Mr. Worsley. What we're talking about is a policy, not a specific project. So the motion here is saying create a separate sort of come back in 45 days with additional research, work with partners, additional research and recommendations around, you know, existing structures that are going to opt into the program.'",
        "'speaker_2': 'But it seems like new construction and all those things, those goals are fine. Let's keep keep here from our colleagues. But I think we should be clear. We're not talking about a specific project today. We're talking about the policy in front of us.'",
        "'speaker_2': 'I want to be clear on that. Councilman Price.'",
        "'speaker_3': 'Thank you, Mr. Vice Mayor. I support the motion wholeheartedly, and I'm super excited to support a project that includes a partnership.'",
        "'speaker_0': 'With State Long Beach Beach.'",
        "'speaker_2': 'Great. Thank you. Come on, Alan.'",
        "'speaker_0': 'Yes. Thank you, Councilwoman de Haas. I agree with everything and I'm really interested in middle income housing. And I know that these middle income housing programs are new and untested and untested. But I think what we have here is a robust a robust and flexible program.'",
        "'speaker_0': 'So I will be supporting this item today and I look forward to future discussions on this topic.'",
        "'speaker_2': 'Great. I don't see any other council comment. We're going to go to public comment now. Any public comment on the site?'",
        "'speaker_4': 'Yes, we have three public comment. Sharon, your time begins now.'",
        "'speaker_2': 'We thank you, Vice Mayor and members of the city council, Alex Charron, speaking tonight on behalf of Waterford development. Very much appreciate the opportunity to speak in support of the policy. We also appreciate the efforts from city staff on Monica, Oscar Forsey, Linda Tatum and their team.'",
        "'speaker_2': 'It's a very complex issue as identified by the maker of the Motion and Waterford as the sponsor and participant in the city's only pilot project in the modern income housing in Oceania supports the policy and the continuing discussion.'",
        "'speaker_2': 'Appreciate the opportunity over the next 45 days or so to engage further with staff on how better to refine and clarify some of the policies outlined in city staff. The Cal State Long Beach proposal was submitted last year, and so our concern when we saw this item was obviously reconciling a project that was already in the pipeline'",
        "'speaker_2': 'with the city's need and understandably so for a larger policy that would cover it in any future projects. We are simply asking and support any decision in movement that would further clarify the distinction of this policy between ground up construction and acquisition type construction.'",
        "'speaker_2': 'We also have put together a number of data points on the Ocean Air Project, which I think would be very informative and appreciate Linda Tatum in her team coming out at the end of last year to tour the facility.'",
        "'speaker_2': 'I think by any metrics, the program has met or exceeded its affordability goals. I would just remind staff that Waterford is in full support of a policy that requires the city to be made whole. We've made that change, obviously, since the Ocean Air Project.'",
        "'speaker_2': 'So any project proposal moving forward should not leave the city in the hole from a tax revenue loss stand basis. And again, appreciate very much your support for this policy, and we look forward to working with you collaboratively.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_4': 'Aren't going to be very visible.'",
        "'speaker_2': 'Public comment.'",
        "'speaker_4': 'Yes. Our next speakers and control. Time begins now.'",
        "'speaker_0': 'Good evening. I don't pretend to understand how this works. I can only go by what I have read in the L.A. Times that, yes, I assume there are some cities that are going with this plan, but there are also cities who have rejected it, such as San Jose.'",
        "'speaker_0': 'I am very much for low cost housing help. But I do not understand helping. Middle income. Unless I can get some help. I'm not with Social Security. I'm. I don't even. I couldn't even qualify for middle income, but.'",
        "'speaker_0': 'What worries me is that. We are giving these. Units. Pass on paying property tax. But as I understand it, then there will be a host fee. So I do not understand. I'd like to know the difference between what a person would pay and property tax and what they have to play with the host with fee if it'",
        "'speaker_0': 'really is advantageous for them. And according to the L.A. Times article, the units at Ocean Air, the one bedroom units, were $600 more than units in surrounding one bedroom facilities. So it doesn't seem like. People that are. Taking advantage of this are really getting much of a deal.'",
        "'speaker_0': 'I think that. The Council needs to really. Have an independent. Advisor on this as to whether this is really going to help with middle income housing and with the ocean there. It's not expanding housing because they're using housing that's already there.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'That concludes all speakers for public comment on this item.'",
        "'speaker_2': 'All right. Thank you. All right. So we've heard from the council staff one more time. Um, staff. Do you have any final comments before you go to them?'",
        "'speaker_5': 'Yes. Vice Mayor. Thank you. So just to sum up what I think we heard, I think I heard support in general for the policy and from taking the next step and move it forward. I think we heard support for construction that if we're doing new construction, that in general those are supportive, but that we have some additional'",
        "'speaker_5': 'work to do on the acquisition projects, which is the ones that Waterford are proposing. And we will certainly engage with Waterford to get some specific comments now that a policy is out in the public. We would welcome any suggestions on specific language, on things that need to be modified, things that would help projects actually get approved.'",
        "'speaker_5': 'And then we would also engage with them to understand concerns and negotiate some additional language, if there are any, that can meet both both parties. The proposal that was mentioned back in September that currently has a lot of good things doesn't match up completely with what we presented tonight.'",
        "'speaker_5': 'So there would be some additional work we'd need to do on the policy before we're able to just move that one forward. And then we would return to council within about 60 days to let you know where we are, what we have agreement on, and what some of the areas would be that council could then consider if'",
        "'speaker_5': 'you were ready to adopt it or if you needed to make more tweaks. And with that, I think we're ready to move forward.'",
        "'speaker_2': 'And thank you. So it is great that we did the pilot, we did a study, we got the study back. We have a new tool now, which is good, and it's going to make the city whole address the concerns that was raised last time.'",
        "'speaker_2': 'So that's why it was also a roll call vote.'",
        "'speaker_1': 'District one, district two. I district three.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District for.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_2': 'Fantastic. Thank you. Next I have item 20. But what's the next time on the list that might might be out of order? What do you have?'",
        "'speaker_1': 'Item 24.'"
    ],
    "Recommendation to authorize City Manager, or designee, to submit a grant application to the U.S. Economic Development Administration through its Travel, Tourism and Outdoor Recreation grant program, in an amount not to exceed $5,000,000, to support the Long Beach Tourism Media and Training Center Project.  (District 1)": [
        "'speaker_2': '24. Let's just go straight down the list.'",
        "'speaker_1': 'Okay. Report from Economic Development and Public Works. Recommendation to authorize City Manager to submit a grant application to the U.S. Economic Development Administration to support the Long Beach Tourism, Media and Training Center Project, District one.'",
        "'speaker_2': 'All right. Waiting on a motion. Okay. We have councilwoman sandy house move. Councilmember during a second councilman woman's day has any comments.'",
        "'speaker_3': 'Just that I'm excited about this. I'm very supportive of this item.'",
        "'speaker_2': 'All right. Thank you, Councilmember Miranda. Anything. Okay. Thank you. All right. Let's go to public comment.'",
        "'speaker_4': 'That's where there are no public comments.'",
        "'speaker_2': 'All right, roll call, vote, please.'",
        "'speaker_1': 'District one. I district to.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District nine.'"
    ],
    "Recommendation to adopt resolution approving the appointment of David Nakamoto, retired annuitant, as an interim appointment to a vacant position during recruitment for a permanent replacement in the Financial Management Department pursuant to Government Code 21221(h) and an exception to the 180-day waiting period for Public Agencies pursuant to Government Code 7522.56 and 21224.  (Citywide)": [
        "'speaker_2': 'I.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_2': 'Thank you. Next item.'",
        "'speaker_1': 'Item 25 Report from Human Resources Recommendation to adopt a resolution approving the appointment of David Nakamoto as an interim appointment to a vacant position during recruitment in the Financial Management Department and an exception to the 180 day waiting period for public agencies citywide.'",
        "'speaker_2': 'All right. We need a motion in the second. Okay. Move. Back. Second, you, Ranga. Uh, and I see Councilman Burrows spoken up about something. Councilwoman Allen would like to speak to this. You just shake your head. Okay. Councilmember Ranga Exactly.'",
        "'speaker_2': 'Okay. Councilwoman Takara I was.'",
        "'speaker_3': 'Just trying to make a motion.'",
        "'speaker_2': 'Fantastic. We've got a public comment.'",
        "'speaker_4': 'There's no public comment for this item.'",
        "'speaker_2': 'Thank you. Roll call. Call Police.'",
        "'speaker_1': 'District one. District two. I. District three. My district for.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District five. All right. District six. I do. Six, seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight. All right. District nine.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to amend Contract No. 33651 with Howroyd Wright Employment, Inc., dba AppleOne Employment Services, of Long Beach, CA, for temporary staffing services, to increase the contract amount by $1,759,500, for a new contract amount not to exceed $20,417,500, and extend the term of the contract to July 1, 2022.  (Citywide)": [
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_2': 'Thank you. Next item, please.'",
        "'speaker_1': 'Item 26 Report from Human Resources Recommendation to authorize City Manager to execute all documents necessary to amend Contract with Apple one Employment Services for temporary staffing services to increase the contract amount by 1,759,500 citywide.'",
        "'speaker_2': 'We need a motion in the second. Move sorrow back your ranga. Is there any public comment on this item?'",
        "'speaker_4': 'There is no public comment.'",
        "'speaker_2': 'Thank you. Let's have a roll call, please.'",
        "'speaker_1': 'District one, high district two. High District three. My district for.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District five I. District six.'",
        "'speaker_3': 'I.'"
    ],
    "Recommendation to receive a report and adopt the proposed Parks, Recreation and Marine Department Strategic Plan 2022-2032.  (Citywide)": [
        "'speaker_1': 'District seven. My District eight. By District nine. Motion is carried.'",
        "'speaker_2': 'Fantastic. Onward to 27.'",
        "'speaker_1': 'Please report from Parks, Recreation and Marine recommendation to receive a report and adopt the proposed Parks Recreation and Marine Department Strategic Plan 2022 to 2032 citywide.'",
        "'speaker_2': 'All right. Let's go ahead to the staff report.'",
        "'speaker_5': 'Yes. I will turn it over to Brant, Dennis and Meredith Reynolds for a staff report. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Modica. Good evening, Vice Mayor. Members of City Council. Served three years of engaging, listening and learning. We're honored to present the final parks, make Long Beach the prime strategic plan this evening. This is an effort that's been informed by a considerable number of partners and stakeholders.'",
        "'speaker_2': 'And despite being interrupted by a pandemic, this provided a unique opportunity to reexamine the important role of parks in community resiliency and recovery. Next slide, please. The plan guides operational staffing and budgeting decisions for the department over the next ten years.'",
        "'speaker_2': 'This plan contains goals, outcomes and actions for how the department prioritizes our work, how we organize our staff, how we decide where to invest, and how we partner with our community with equity as an overarching theme. A department strategic plan is different than a park system's master plan or a plan that addresses the types of programing for'",
        "'speaker_2': 'a particular user group. Although these are important and are referenced in the plan, I'll now turn it over to Park Planning and Partnerships Bureau Manager Nancy Bates. And you're and Deputy City Manager Meredith Reynolds, who had served in that capacity before moving to the city manager's office.'",
        "'speaker_2': 'They'll be co-presenting tonight's brief presentation. Next slide, please.'",
        "'speaker_3': 'So just to provide you a little bit of information of what's in the plan, the strategic plan is to organized, to provide a history of our community and a context for our department in the past, present and future.'",
        "'speaker_3': 'We then focus on the community's feedback, which contributed towards our statement of possibility and values, which we'll get to in a few fights. And lastly, the plan outlines eight goals that will help us achieve our statement of possibility.'",
        "'speaker_3': 'Next slide, please. So we have a lot to be proud of as a department and as a city. Just to give you an example, out of the 100 most populous cities in the country, we ranked 31st in that Trust for Public Land Park Score Index, which is a pretty significant accomplishment.'",
        "'speaker_3': 'But at the same time, we have a long way to go when it comes to Parks to Park Equity, while we have 6.6 acres of parks per 1000 residents in our city. We know that the ratio is much lower for central, west and north Long Beach, where there's a combination of of a few things where you have'",
        "'speaker_3': 'fewer and smaller parks and also high density neighborhoods. This is why equity is such a strong theme that's woven throughout our our strategic plan. Next slide, please. I'll turn this over to Meredith. Thank you. From the beginning, the park's community engagement effort was grounded in best practices, was planned to be accessible and inclusive and centered community voice'",
        "'speaker_3': '. And what began with a very personal approach with in-person outreach at park events in the summer of 2019, became a full pivot to curated virtual engagements after a period of hiatus, while staff was reassigned to support the city's pandemic response in all, the department and engagement efforts connected to close to 400 community groups had over 1600 people'",
        "'speaker_3': 'take our survey. We deployed posters and service stations at community centers and promoted surveys and listening sessions on social media. We even had a strategic plan engagement band visit over 30 community events. And all of this was done in the city's four languages to maximize language access.'",
        "'speaker_3': 'Next slide, please. In the virtual space, we collected surveys and park stories in multiple languages. We had our user groups data and dedicated listening sessions where we shared progress with opportunities for feedback on draft goals and objectives. We engaged in various social media outlets and connected with trusted community partners, asking them to share the opportunity to participate'",
        "'speaker_3': 'in their specific networks. We also recognize that many staff still face a digital divide and divide as creative ways for community members to engage from a safe distance. We added lawn signs with QR codes that connected visitors to online engagement tools while they were safely visiting parks.'",
        "'speaker_3': 'We set up cardboard service stations at learning hubs to reach those who visited these spaces. We produced a Part Stories podcast series featuring some of the department's partners and city staff to share how our department plans partners and produces programing and manages our operations.'",
        "'speaker_3': 'And we engage the Parks and Recreation Commission on several instances to share drafts of our progress. Next slide, please. As a considerable amount of planning went into creating an intentional and meaningful engagement process and participant experience, which was intended to cast a wide net in a way that anyone could feel included, heard and valued.'",
        "'speaker_3': 'This process also had a series of opportunities for input, but participation from department staff who are experts in their field, as well as opportunities for leadership of the department to explore strengths, weaknesses, opportunities and threats. We acknowledge that the interruption of the pandemic had a significant impact on our best laid plans for in-person engagement during the pandemic'",
        "'speaker_3': '. The engagement process was considerably augmented out of an abundance of caution for people's safety, and we instead shifted to virtual spaces to listen and engage. This engagement process provided our team with the opportunity to reengage with those we've had relationships with for many years, to reduce our re-introduce ourselves to those we have limited contact with, and to'",
        "'speaker_3': 'establish connections with those who were new to us. Each of these instances was an opportunity to demonstrate the value of the community's knowledge, and we took each interaction as an opportunity to build trust with these partners. Next slide, please.'",
        "'speaker_3': 'Our process included consulting, consulting other adopted city planners to ensure the goals in these other arenas of city work were incorporated. We know that land use, mobility, climate action, housing, digital inclusion, youth, seniors, animals and racial equity are all interconnected and there are intersectional aspects of all of our work.'",
        "'speaker_3': 'Our process also included researching best practices for similar efforts across the country and from coast to coast. Our pure organizations are engaged in impactful work that we learned from and were able to infuse this learning in the plan.'",
        "'speaker_3': 'Many of these plans had a strong, inclusive community engagement effort, centered equity and community voice, and called for strong support. A partner systems to address issues like climate change, support, mental and physical health and result in greater park equity.'",
        "'speaker_3': 'Next slide, please. In March 2020, when the first cases of COVID were present in Long Beach, Park, staff roles pivoted to shutting down operations at the city's 167 parks and shifted to new operational models. Our parks and open spaces were never so appreciated or heavily used because of the pandemic.'",
        "'speaker_3': 'And while many other places were closed, our parks remain open. Our park and beach maintenance teams devise new parks and beach sanitizing schedules. Signage was placed and replaced, communicating the ever changing COVID guidelines. Our community ambassadors were deployed for the safe use of parks.'",
        "'speaker_3': 'Virtual programing was developed to shift programing online, and our learning hubs provided a safe and free learning space to complete distance learning. Hundreds of staff shifted to work from home schedules or deployed to support other city departments, including standing up and staffing shelters, operating vaccination clinics, eating and contact tracing, and even developing the city's COVID testing program'",
        "'speaker_3': '. During one of the city's most pressing emergencies, department staff met the moment being versatile, resilient and capable of supporting the community when they needed it most. Next slide, please, and I'll turn it back to Nancy. So not too long ago, the city council approved one time dollars dollars towards park maintenance.'",
        "'speaker_3': 'And those dollars were very much needed. But in the long term, we really do need structural dollars to properly maintain our parks at a level that the community expects and deserves. And as you can see from this chart, we fall short compared to the statewide dollars available per acre in terms of park maintenance.'",
        "'speaker_3': 'Also want to add that park maintenance was a very high on the list of concerns and feedback that we received from our residents. Next slide, please. So in addition to the rounds of surgeries that Meredith outlined, we went back one more time after we prepared the draft strategic plan to collect one more round of surveys in the'",
        "'speaker_3': 'four languages. And we collected close to 70 responses at that time, and this helped us further refine the strategic plan. And I also want to add that we continue to hear feedback on our strategic plan, and I would encourage residents to continue to reach out to us with whatever questions and comments that they have.'",
        "'speaker_3': 'Even if the plan is adopted tonight, it doesn't mean that we stop listening to the needs and concerns of our residents and visitors to our city. Next slide, please. Now, speaking of our statement of possibility, it is that we make our parks and beaches safe, welcoming spaces for our residents and visitors.'",
        "'speaker_3': 'Putting people at the center of all we do, including our park users, partners and team members to creative to create inclusive, enriching, healthy communities for all to thrive. And this is something that we've really developed from all the outreach efforts that were described in our presentation.'",
        "'speaker_3': 'And these are based on very specific values that include being effective, thoughtful, transparent, resilient, collaborative, respectful and nurturing among other values. Next slide, please. So the strategic plan itself is organized into.'",
        "'speaker_0': 'Eight goals, with.'",
        "'speaker_3': '24 outcomes that yield 160 action items that are based on what we heard from the Community Stakeholders, survey respondents and also Parks, Recreation and Marine staff. Next find. While you can view all the full details of the plan in the plan itself.'",
        "'speaker_3': 'For anyone listening, just wanted to outline what those are. And our first goal is to provide safe, accessible public spaces, while our second goal is to offer meaningful recreational programing and events. Third, we have prioritized health equity across the city.'",
        "'speaker_3': 'Next slide, please. We also want to build innovating and lasting relationships. That's our fourth goal. And fifth, we have connect internally with the community clearly and transparently. Our sixth goal is to establish an environmentally sustainable park ecosystem. Next slide, please.'",
        "'speaker_3': 'And seventh, we have ensured a diverse and dynamic workforce. And lastly, we have as our goal, to create a financially secure and resilient operation. Next slide, please. And with then with this, I will turn it over to Director Denis.'",
        "'speaker_2': 'Thank you very much, Nancy and Meredith. I'm very pleased on the efficiency that you walk through with very extensive strategic plan. I do want to share that our next steps in implementing the strategic plan will involve breaking down the outcomes and strategies into short, medium and long term phases that can be implemented over the next decade, starting'",
        "'speaker_2': 'with this current year. We will report to our Parks and Recreation Commission on an annual basis. With that, I want to thank the Commission for their ongoing support throughout the plans, development and their future support as we move into the implementation phase.'",
        "'speaker_2': 'I also want to thank the staff and all the community members who got us to where we are today and also City Fabric, who was our consultant on this project. This concludes our presentation and we welcome any questions or comments that you may have at this time.'",
        "'speaker_2': 'So thank you very much. All right. Thank you, Brant and Nancy and Meredith. We're going to go to public comment first before we go to council comment.'",
        "'speaker_4': 'Our first speaker is Denise Bernard Yearwood.'",
        "'speaker_0': 'Hi.'",
        "'speaker_3': 'Good evening right there. I'm a resident of Buffalo and I saw the report we on the west side of me, three or four plans and I have the report. So in regards to this, I believe the government underestimated the funds they needed to acquire additional hardware.'",
        "'speaker_3': 'So I.'",
        "'speaker_0': 'Think that means more and.'",
        "'speaker_3': 'More participating see as the benefit of the physical.'",
        "'speaker_0': 'And mental health of the president. So I.'",
        "'speaker_3': 'Think by allowing lands along the river as he developed for.'",
        "'speaker_0': 'Moving his facility.'",
        "'speaker_3': 'Possibly further statement, support for settling.'",
        "'speaker_0': 'In for air as proposed by the City Park Coalition. Do we.'",
        "'speaker_3': 'Consider developing the.'",
        "'speaker_0': 'Complex at 37 to 1 along the river?'",
        "'speaker_3': 'I've read their statement that using grant funds where the land and I believe.'",
        "'speaker_0': 'There is a platform, there.'",
        "'speaker_3': 'Are plans.'",
        "'speaker_0': 'For the L.A. River basin. So I.'",
        "'speaker_3': 'Strongly urge you to amend the plans.'",
        "'speaker_0': 'By.'",
        "'speaker_4': 'Our next speaker is an Cantrell.'",
        "'speaker_3': 'But evening in Cantrell.'",
        "'speaker_0': 'Speaking for the River Park Coalition, this document makes clear that Long Beach needs to budget more funds for maintenance and acquisition of Parkland. River Park Coalition agrees with the goal goals. Quote Every Long Beach resident has walkable and bikeable access to a neighborhood park and established park equity acquisition guidelines for securing land, for developing new parks and'",
        "'speaker_0': 'open spaces in park poor communities, unquote. River Park Coalition would like to suggest this solution for acquiring park land on the L.A. River. The city should settle the Civic Place, Sequoia lawsuit and do an environmental impact report with the alternative river.'",
        "'speaker_0': 'Using this land is park land purchased the land from the owners using grants. This will help fulfill several of the strategic plan goals. Add more parkland in a park deprived area and as this is pongal land, fulfill the goal to amplify and degenerate people, cultural practices.'",
        "'speaker_2': 'And.'",
        "'speaker_0': 'Connections to the land. This park would be an ideal opportunity to educate on the history and connection of Indigenous people to Long Beach. I urge you to take this last opportunity to obtain this property. Parkland. I'd also like to add that to make Parks safer, I would urge you to bring back the Rangers.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Our next speaker is Anna Christianson.'",
        "'speaker_0': 'Unmuted.'",
        "'speaker_4': 'Yes. You're on mute.'",
        "'speaker_0': 'Hello.'",
        "'speaker_4': 'We can hear you.'",
        "'speaker_0': 'Okay. This is from the lawsuit of Weapons Task Force Sierra Club. Re Indigenous peoples acknowledge the Hodgeman tribe, not only the Tongva as indigenous to Long Beach as they share the Territory, act as caretakers and vendors of the land and waters and regard football as their sacred site.'",
        "'speaker_0': 'Acknowledge that Long Beach is now also home to tribal peoples from throughout the United States and North Central and South America, as well as the Pacific Islands, knowledge that the sacred sites above that includes the lows through those wetlands, a knowledge that from a tribal perspective, taking care of the land means ensuring that it can support life'",
        "'speaker_0': 'for future generations to come. Not only humans, but the whole web of life return parklands to our high human tribe, at least some of them, and enter into management agreements with these entities. Acquire tribal, cultural and burial sites within the city and preserve them as natural spaces, place known sites on city property into open spaces and parklands'",
        "'speaker_0': '. We climate change. Do not add or expand paved areas, buildings, artificial turf, playing fields, plastic grass, seawalls, or the port of Long Beach under open land and waters in the Highlands area or coastal zone communities subject to inundation due to sea level rise.'",
        "'speaker_0': 'Do not add more concession stands re bit venues at the expense of open space repair. The Belmont Pier Re equity prioritize acquiring land and making park improvements in underserved communities. DeLay or deny new projects located in overserved communities until park equity goals have been met.'",
        "'speaker_0': 'Teach everybody to swim for free. Do not rely on the U.S. pools for the general public's use for wildlife and bird. Appear to prioritize making habitat for birds and wildlife in park maintenance and acquisition plans, including along the L.A. and San Gabriel River and in the Lower Cerritos wetlands.'",
        "'speaker_0': 'Folk don't focus only on public access and recreational opportunities, utilizing concessions, especially vet fees for revenue streams or maintaining marine infrastructure and services to maintain boats which focus on the entire ecosystem. Plant trees and groundcover that supports birds and wildlife.'",
        "'speaker_0': 'Reestablish native species. Don't keep trimming trees every single year, erasing wildlife and bird habitats. Don't permit fireworks shows that pollute air and water to harm marine life and disrupt nesting birds, causing them to abandon their nests. Don't use herbicides to maintain parks, marinas or green belt and don't support restoration projects that erase and replace existing wetlands and'",
        "'speaker_0': 'tribal areas like the LC plan for the Lowe's to be those wetlands we go carting your employees. Please do finally provide your 450 part time seasonal employees with health benefits, including paid maternity leave. So thank you.'",
        "'speaker_4': 'Our next speaker is Roger Martin Holman. Our next speaker is David Hall.'",
        "'speaker_2': 'Hi, this is David Hall. Well, Motor City members of the council, I do support the Parks Recreation Marine Strategic Plan. I think it goes far in addressing the lack of our parkland in West Long Beach and downtown Long Beach and along the Los Angeles River.'",
        "'speaker_2': 'I think that parks benefit everybody in the community and we really need parks not only for the youth, but for others, for recreation. We also need parks to improve the air quality, especially in the park communities. You know, what's interesting, I think, is that Councilman Richard Richardson, in the background, you have Martin Luther King.'",
        "'speaker_2': 'And I think that's great because the city manager did a report a year ago for the City Council on Parks across Long Beach, and the inequality of Parkland dates back to the days of segregation. And I think the disparity in Parkland needs to be addressed, and I think we need to remedy it.'",
        "'speaker_2': 'And I really think this strategic plan will go far in correcting this injustice and bringing parks to the people who need it on the West Side and in our park communities. So thank you very much to the Park Department.'",
        "'speaker_2': 'Great job and I encourage you to support this plan. Thank you.'",
        "'speaker_4': 'Our next speaker is David Sonata. Your time begins now.'",
        "'speaker_2': 'Good evening, counsel. My name is Davids and I have the honor to serve as the chair of the Long Beach Parks, Recreation and Marine Department. Tonight, along with my fellow commissioners and staff, we are excited to present support with comments and act on our city's long awaited strategic plan that will lead us forward as a city.'",
        "'speaker_2': 'The Commission applauds the hard work and commitment staff has provided in working with and listening to our city's neighborhoods, underserved communities, and partnering with all departments of the city in keeping park equity open and open space in the forefront while maintaining our high quality of life, safety and healthy choices throughout our park system.'",
        "'speaker_2': 'With that said, our outcomes from this plan will not allow for the status quo. It is imperative we work with our communities to improve upon facilities and programs and serve our public to the best of our ability. This is a lot to unpack in this plan, but it has been 20 plus years since Council last received a'",
        "'speaker_2': 'strategic plan for our Parks Department and is needed to continue to maintain and build on park equity, improve our focus on maintenance of our parks, and continue to provide valued programing and open space with our partners in the communities across the city.'",
        "'speaker_2': 'The importance of our park and beach system and its services show where the public lived during these challenges. Challenging times of pandemic. Parks and beaches are where the public enjoyed family or family open space, mental health and programs for all ages.'",
        "'speaker_2': 'While the department keeps us safe, sane, healthy throughout our day, this is an asset we cannot ignore. At present, we are below the local and national average cost per acre for maintenance of park operations. Maintenance must continually be addressed by council and take a turn toward increased funding and council support to protect one of the city's largest'",
        "'speaker_2': 'assets. With 33,125 acres and 167 parks. In our system, we stand tall as a diverse city. Who knows the importance in providing park and beach access equally to all our citizens and programs of education of value to all ages.'",
        "'speaker_2': 'Tonight, together with my fellow commissioners and the PRM staff, we ask each of you to embrace this roadmap and collectively ask you to receive an app, not just file on the goals and objectives this strategic plan provides with equity and maintenance as top priorities.'",
        "'speaker_2': 'We ask you in your monthly meetings with director Dennis and during the budget process to invest in our neighborhoods and communities, address the inequities that continue to exist in our city, and work toward improving additional funding and available grants for maintenance to improve our park and marine facilities.'",
        "'speaker_2': 'Let's keep our park system up to the standards our city deserves. We respectfully ask the Council to support, discuss and approve this new and engaged strategic plan and receive and continue to act on its content moving forward. Thank you for your time.'",
        "'speaker_2': 'Go.'",
        "'speaker_4': 'Our final speaker is Roger Martin Holman.'",
        "'speaker_2': 'All right. Thank you very much. Can you hear me okay?'",
        "'speaker_4': 'Yes, we can hear you.'",
        "'speaker_2': 'Great. Thank you so much. And thank you, Vice Mayor and members of the city council for hearing us tonight and for your attention to this. I'd like to state that I'm here to align my self with the comments by Ms..'",
        "'speaker_2': 'And Control that were made earlier, and also to speak to the total imbalance of Park Space in Long Beach, West Side, specifically, because that's where I live for among other reasons. But we get the worst of port pollution, perhaps with the exception of downtown, and we have very, very little parking space per resident.'",
        "'speaker_2': 'And we. And we're sitting here while space that is the last possible opportunity for getting more open park SpaceX is on a chopping block and it's really disheartening and frustrating and I'm hoping the city council can do something.'",
        "'speaker_2': 'But again, I would just like to say that the remarks in this country are certainly important. And thank you all.'",
        "'speaker_4': 'That concludes public comment.'",
        "'speaker_2': 'All right, thank you. I'll take you back behind the rail. I did offer some brief comments and we have a long list of council speakers. But thanks to everyone who spoke on public comment and all the hundreds of residents participated in this process over the last, you know, over the last couple of years.'",
        "'speaker_2': 'And thanks to that, I think, you know, it's noticeable to me what your values are through this presentation and this report. I think, you know, I think it's, you know, strategic plans are important. They help to institutionalize, you know, the values and the strategy so that every time a leader comes in, a new staff member comes in'",
        "'speaker_2': 'and the council member comes in, there's always something to work with. You have a general idea of where the organization is heading in part, you know, incredibly important, you know, to the community members and council members. I think what happened was, you know, what happened when we transitioned Highland Park, you know, made more investments into more of'",
        "'speaker_2': 'a regional center with, you know, senior programing youth program. Health programing makes a big difference. And I know that's incredibly important to a lot of folks. I also know that over the years, you know, I've heard things from some staff and others.'",
        "'speaker_2': 'When you raise issues like this, there's a big disparity in parks and open space. I've heard things like, hey, you know, we have a, you know, a quiet moratorium on new parks because we don't have money to maintain them.'",
        "'speaker_2': 'I understand the maintenance issue. We certainly have to do that. But I like this plan, this plant and doesn't hide it. They say right out the gate, we have a problem in north central west Long Beach. Here's what it looks like and it attributed to to history.'",
        "'speaker_2': 'Like the last person who spoke talked about the history. All of these decisions were human decisions, you know, based on land use, where freeways are built, you know, what zoning looks like, land use, all of that created the disparity that we have today.'",
        "'speaker_2': 'So I believe that strategic planning, you know, things, general plans, all of those things are mechanisms that can be used to sort of right the wrongs of the past and help chart a more inclusive future. So from this standpoint, I like that this plan leans into equity and doesn't hide from and so so I want to thank'",
        "'speaker_2': 'staff. There's there's obviously a lot here. I got a chance to peruse it but I got to spend more time with the strategic plan. But from what I see, I think, you know, if we go after, you know, what's called out as the sort of larger vision statement instead of only goals, we can make a real difference'",
        "'speaker_2': '. So those are my general thoughts on the plan. Our first person cued up is Councilwoman Sara.'",
        "'speaker_3': 'Thank you, Vice Mayor. Just to add to what you shared, I want to thank Brant, Meredith and Nancy, as well as all of the PR and staff and all those involved with getting the strategic plan together in the past three year.'",
        "'speaker_3': 'I know it's been a challenge doing the community engagement during the pandemic, especially when you're trying to get them out in multiple languages in the midst of the pandemic. And I just also want to appreciate that equity was mentioned as that being central as part of this plan, and that I think it's really important that we think'",
        "'speaker_3': 'about it in addition to the climate change issue, that's also crucial. Prime is also a crucial partner. And in addition to our Health and Human Services Department in violence prevention and strengthening our neighborhood in our community. So I had a chance to read through it and appreciate the way the goals and the outcomes are aligned.'",
        "'speaker_3': 'And I think that is a good way for us to provide guidance in the way that we can move towards all the goals. And also for me, I look towards how do we ensure equity in all of the parks in central Long Beach.'",
        "'speaker_3': 'And I appreciate, I think that we've already started implementing or using that as a guide to doing to helping to improve our parks from Brent's leadership and improving communications to Senator Lena Gonzales, ensuring that their state funding, as well as our other legislator that ensure that there's investment into our parks.'",
        "'speaker_3': 'So with that said, I wanted to ask a few question and I would make one observation in that with that equity being central to, I think, the framework for this report, I think it's also interesting the number, the demographic of those who filled out the survey.'",
        "'speaker_3': 'So I'll speak to page 135, which the question part 25, it's question 35, which is how much total combined money that all members of your household earn in 2018. And over 50% came from the $100,000 or more income level, while less tend to less.'",
        "'speaker_3': 'I will say 10% or less are $99,999 income level or less. And so my question is when how could we have done better to ensure we had more equitable response from across our different community members and how? And then the second is, how do we ensure that while we have a predominantly number of certain kind of people'",
        "'speaker_3': 'filling out the survey, that it's at least equitably inform how this report was written? Those are my two questions. I want to add a third, but I will wait to see if I have to queue up.'",
        "'speaker_2': 'Yeah, well, thank you. Council ministers Brant. So I do appreciate your your question. And I know there were a lot of factors at the mid-point in our outreach and I realize that when we had attempted to bring this strategic plan for accounts.'",
        "'speaker_2': 'So last July for a variety of reasons, I think for the best reasons, we did have a numerous months to work with all nine of the council offices to really look at avenues or ways that we could reach all corners of the community.'",
        "'speaker_2': 'So I do want to credit a lot of the messaging and cooperation with all of the council offices that I think we did glean a lot of input from many of the community members that early on, you know, even the digital divide.'",
        "'speaker_2': 'I think when we relied a lot on electronic surveys, that that was an obstacle for many. But I also know that through a lot of our stakeholder groups and focus groups that had representations of a lot of the corners of the community, the senior community and youth, that those were reflected in a lot of the goals and'",
        "'speaker_2': 'the values that were generated. It's just that in those circumstances it wasn't as easy to capture, I guess, the family household income levels, although I do feel confident that a lot of those voices were clearly heard by representatives within a lot of those stakeholder groups.'",
        "'speaker_3': 'Okay. Do I have time to ask one more question? This will be my last question. Or should I queue up again because there's no timer? And I'll just ask you really quick is how can we ensure what's the process to getting ongoing feedback?'",
        "'speaker_3': 'I think Nancy shared earlier that we're able to our community members are able to like is that in an email process or is that just call? And Nancy, how do we make sure there's ongoing feedback even though we have a strategic plan now?'",
        "'speaker_2': 'That's that's the next one. This is brand again. So I think on our website and this is our commitment to the Parks and Recreation Commission that we'll be assembling, you know, an annual report on really a daily if not weekly basis.'",
        "'speaker_2': 'So I think most likely on our website, we'll make sure there's a link for continued dialog and input from the community because this will be a work in progress for lots of obvious reasons. And I think, you know, two or three years ago kind of the nature of how the strategic plan was developing certainly took a whole'",
        "'speaker_2': 'different approach as we were reimagining our own programing and our own operations because of the pandemic. And I think since we're not out of that yet, you know, as we enter into the new normal, I think we're going to find a lot of new approaches and a new ideas.'",
        "'speaker_2': 'I know even within the past year, we've had a lot of newer interest in some of our recreational aspects of what we do. There's been a voice for rugby and pickleball. There's a new sport called Tech Ball. Our seniors want to be more active and we really have to be very cognizant of the health protocols, but also'",
        "'speaker_2': 'think about ways that we can keep people healthy and that so we'll be open to, you know, a lot of the new trends and a lot of the opportunities. But I think our department has always prided itself in being a good listener to the community and really, you know, all nine council offices, as we've learned from month'",
        "'speaker_2': 'to month, have been the best, the best venue, our best liaison connection to a lot of residents who really care about the importance of parks and recreation, to build a healthy community and all those great qualities of life that make Long Beach attractive.'",
        "'speaker_3': 'Thank you so much, friend.'",
        "'speaker_2': 'Thank you. All right. Thank you. Yes, that was a very long 5 minutes. Next, Councilman Austin. Thank you. And, you know, there's a lot of good content going on here and a lot of good comments and good questions.'",
        "'speaker_2': 'And so I want to just first say that Parks really do make our city, they make Long Beach. And this strategic plan is very impressive to me on many levels. I want to thank our staff for their hard work with the Parks Recreation Marine Commissioners.'",
        "'speaker_2': 'But more importantly, I want to thank the community who participated in this engagement process, which I think should be really uplifted and saluted for all of the work that has gone into this. No other department in our city is equipped to do this type of engagement, in my opinion, like Parks and Recreation.'",
        "'speaker_2': 'And so they have the the the access and the day to day interaction with so many folks in our city and a very, very diverse and representative diversity in every, every way. I think this strategic plan, it really helps to define our mission that comes to our parks and rec parks for the next several years.'",
        "'speaker_2': 'In the end, it will help us create new opportunities for programing and access across the city. With with equity as the foundation comes to mind. And I'm really, really impressed with that. I'm glad to see that there was some emphasis on maintenance, because I know that that is an issue that my constituents care deeply about.'",
        "'speaker_2': 'We do have great parks. We should look at our parks as assets in care for those assets. And so to the extent we can budget and plan more resources to go toward maintenance, I think that's that's a that's something that we as a council need to take on and deliver for for the city.'",
        "'speaker_2': 'And, you know, there was considerable public comment related to park equity and in acquiring more park space. I just wanted to say, I know this council and my office working with our state legislators and really with our county board of supervisors, Janice Hahn, we were able to secure 11 acres along the river that will be dedicated for'",
        "'speaker_2': 'park space. And I want to make sure that that is you know, that's not missed here. That's not a missed opportunity here. That is, and $3 million from the state of California to help with the planning and development of that space.'",
        "'speaker_2': 'So that is that significant progress that we shouldn't overlook in as we move forward. Again, I really just want to salute the engagement process here. The time that has gone into getting this. This is a three years process.'",
        "'speaker_2': 'And to park and rec directors move on. The staff that had anything to do with this this great document. And it's something that we can definitely build on for years to come. Thanks. Right. Thank you. Before we go to the next one, madam.'",
        "'speaker_2': 'It seems like a few people that queued up either weren't recognized. So after we get done with this, I just want to let folks know I'm going to go back. If you can identify that list when we're done, we're going to bring them up so that they can see.'",
        "'speaker_2': 'You understand that? Madam Court.'",
        "'speaker_1': 'So the individuals who have their hand raised currently, you'd like to call on them after the comments from the council?'",
        "'speaker_2': 'Yeah, I get it. We've changed our format a little bit today, so some folks didn't have the rules. Let's just make sure that they're ready. You can cut off the secret list now, but those people who have their hands raised in queue, please make sure that they get a chance after we're done with this for deliberations when'",
        "'speaker_2': 'we vote. Okay. Next, Councilman Price.'",
        "'speaker_3': 'Okay. Thank you very much. So a couple of things. First of all, a huge thanks to our Prem staff for the presentation tonight. And Meredith, it was nice to have you back for your guest appearance tonight and our Parks and Rec commissioners for all of their participation in this process.'",
        "'speaker_0': 'I think it's been really great.'",
        "'speaker_3': 'There's a couple of things. So in looking at the priorities, I mean, I think. It's really disheartening to see.'",
        "'speaker_0': 'That our maintenance budget is below what the national standard is.'",
        "'speaker_3': 'That's really disappointing to me because I think having safe and clean parks should be a core function of the city.'",
        "'speaker_0': 'And so I think it's.'",
        "'speaker_3': 'Important for us to to figure out I mean, when I looked.'",
        "'speaker_0': 'At the priorities that were listed in the report.'",
        "'speaker_3': 'Maintaining an efficient.'",
        "'speaker_0': 'And fiscally sustainable budget, or I forget which words were used was really like the last priority.'",
        "'speaker_3': 'I think we should figure out how much money it's going to take to create safe park spaces and maintain them.'",
        "'speaker_0': 'And that that that fiscal responsibility for that effort for the city should really be a lot.'",
        "'speaker_3': 'Higher up, in my opinion, because if we can't afford to maintain the parks and have safe parks.'",
        "'speaker_0': 'We're really not utilizing that space and allowing it to be utilized by residents in the way that it should be. So I really want to.'",
        "'speaker_3': 'Talk about that.'",
        "'speaker_0': 'Priority as being an important one. We want to make sure that our residents are feeling safe in going to the park. I think.'",
        "'speaker_3': 'Programing, I mean, when we're talking about concepts.'",
        "'speaker_0': 'Of equity and access programing is really, really important, especially for our youth, but also for our seniors. I think every park in the city should have opportunities for engagement for.'",
        "'speaker_3': 'Our youth and our.'",
        "'speaker_0': 'Seniors. Those are our two most vulnerable communities in terms of isolation.'",
        "'speaker_3': 'And the mental health and public health impacts that come along.'",
        "'speaker_0': 'And they don't have that that recreation and that that stimulus of interacting with others.'",
        "'speaker_3': 'That should be a major priority. And I think that's something that's called out in the report. But really, when we talk about.'",
        "'speaker_0': 'Health and we talk about access and and equity, we really need to be focused on making sure we have programing options available at all of our parks. We've talked a lot about undeveloped land. That's been a topic that's come up a lot to our council.'",
        "'speaker_0': 'And I appreciate Councilman Austin's comments regarding the efforts and the progress that has been made. I'll highlight how I will.'",
        "'speaker_3': 'Highlight also that Assemblyman O'Donnell also has helped us in developing.'",
        "'speaker_0': 'A helping develop some open spaces that weren't previously usable. And hopefully those will be very positive projects. And I look.'",
        "'speaker_3': 'Forward to that. But I'm wondering I'm not sure if there's a motion on this. Vice Mayor Is there a motion yet on this?'",
        "'speaker_2': 'Uh, I don't. I don't believe I heard a motion with Council on the Soros bill. First made one. The verdict. Was that emotion or not? I don't believe that.'",
        "'speaker_3': 'I didn't make a motion.'",
        "'speaker_2': 'I don't want to. Bryce, there's no motion on the floor.'",
        "'speaker_3': 'Okay, so I would make a motion to receive and file. But in addition, I know that the council members representing the.'",
        "'speaker_0': 'Areas where we've talked about a lack of park space are probably plugged into this. But I think for city wide we're hearing enough about it. But in addition.'",
        "'speaker_3': 'To receiving a file, I'd like to direct the city manager to come back to council within 30 to 60 days, whatever is feasible for him. On the feasibility of engaging stakeholders and creating an.'",
        "'speaker_0': 'Open park space plan for the undeveloped areas of land and the areas that we've identified as needing more park space. Which which, per the report in the comments tonight, would be central, west and north Long Beach, just to kind of see where we are with that.'",
        "'speaker_0': 'I know that's something that we've asked the city manager to look into and work on, but it would be nice to get a report back at this juncture now that we have our strategic plan in place. But I have no additional comment.'",
        "'speaker_2': 'Thank you. Next is councilwoman. They.'",
        "'speaker_3': 'Thank you, Vice Mayor. And I would like to second Councilmember Price's motion. And first of all, thank you so, so much to our Parks and Rec, the Marine Department staff. I know that this has been a long time coming, but I'm super excited that we're here.'",
        "'speaker_3': 'I'm really happy to see all of the all of this the excitement around this strategic plan. I think this is fantastic. One of the things that I I also want to point out is that we acknowledge in this strategic plan, we acknowledge that we are on hunger land.'",
        "'speaker_3': 'And that makes me very, very proud that we actually were able to put it into our strategic plan. And a lot of people till this day don't know that. So it's very important to have something like that in there.'",
        "'speaker_3': 'I'm also very proud of the community input that was given. I'm so excited of all the collaboration that went on, especially from our commissioners as well. So thank you. Thank you for all of that. I think that it is very important that we that we acknowledge what a big, big high having open space in our community is'",
        "'speaker_3': ', especially in these last two years, where that's where most of the community felt. See, and when we were forced to be inside, that was so good to be able to have some space to go and be able to social distance and be able to enjoy fresh air as much as we could.'",
        "'speaker_3': 'So I'm very happy about this. I do share the same sentiments when it comes to the maintenance of our parks. I think that we definitely need to make that a priority because I really think that safety and the maintenance of our parks go hand-in-hand because if you have a clean park, I really do believe that it encourages'",
        "'speaker_3': 'more safety around the park. So I really I'm glad that that that was brought up. I think it's very important. I also think it's very important that we bring up a lot of our I mean, that it was brought up that programing is essential, especially for our youth and our seniors.'",
        "'speaker_3': 'I think that that is a fantastic point, and that is usually who is able to take advantage of such programs that we offer. And I think we you know, we have such great programing and looking at the programing through equity lens is going to be highly important.'",
        "'speaker_3': 'And so I'm very happy to see that in this plan. Also, I you know, I wanted to make sure that everybody knows that, you know, all the hard work that has gone into this. And yet, yes, like it was mentioned, we are doing good, but there is a lot of work to do.'",
        "'speaker_3': 'And I am very confident that by adopting this plan, we can move forward and make our parks even more safer, more welcoming, and definitely more space for our residents to come and enjoy. So very, very happy to support the strategic plan for this for for the Department of Parks Rec and.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'All right. Thank you. Next is council member supernova. Okay. Thank you. I have. First of all, great report and very impressive 151 page report. And kudos to the Fort District residents who read it and gave me some questions from the report.'",
        "'speaker_2': 'And I have I'll put it down to two questions. And the first one has to do with the SWOT analysis that Meredith mentioned. So if Meredith still there was 100% of the data derived from the general public in this report.'",
        "'speaker_2': 'SWOT analysis should.'",
        "'speaker_3': 'And the membership for the SWOT analysis was a staff activity. So the particular attachments that are included with the plan were made up of input from the department's leadership team, site supervisors and general staff across the different bureaus.'",
        "'speaker_3': 'We asked similar questions as part of our community engagement sessions, just not in the same framework of a SWOT analysis. So those questions could be a little bit more user friendly for the public that has incredible knowledge, but maybe not intimate staff knowledge.'",
        "'speaker_2': 'Okay. Thank you for that. So this puts the next comment in perspective then. Since the SWOT analysis came from staff, I had questions about placing City Council in the threat category. So if you want to check page 131, it's not that we're doing a bad job that we're going to call it in the column of weaknesses.'",
        "'speaker_2': 'We're actually a threat. So if you look under a Community Recreation Services Bureau. Some of the threats include climate change gangs, drug dealers, drug users, vandalism and city council. So I won't put you on the spot to answer tonight.'",
        "'speaker_2': 'It is a long report. There's a lot of stuff to look at here. But if you could get back to us, what what staff's thinking was in coming up with that scenario, that would be very helpful for us to do a better job of what we do.'",
        "'speaker_2': 'Thank you. All right. Thank you, Councilwoman Mongo.'",
        "'speaker_0': 'Thank you. I want to thank the staff and the community for their participation. There's been a lot of comments and a lot of important things have already been said. But I think that one of the things I've talked extensively about with the community and with our current director is that once the strategic plan is done, I think'",
        "'speaker_0': 'we really need to talk about our Parks master plan in terms of not just the spaces that are undeveloped, but as we look forward in determining which playgrounds need to be replaced, which playgrounds need to be fixed, where we need additional field space, all of those things and the types of amenities that are invested in.'",
        "'speaker_0': 'I think we really need to look at the city and the parks more like businesses do. So you might be super close to something, but the flow of traffic and the way that people drive and the amenities that they visit have a lot to do with different types of patterns that we've learned a lot about through our'",
        "'speaker_0': 'economic development department. And so I'd love to see us next steps move forward with understanding what amenities should be at what parks, and whether are our early education parks, what are our older kids parks? What amenities can be adjacent to each other for parents who have kids of multiple age groups?'",
        "'speaker_0': 'Where are the best places to just have open space? Where are the best places to offer classes? Where are the seniors coming to and from? Where are the bus stops that get people there and so on and so forth?'",
        "'speaker_0': 'So I know Brett and I have talked about this a lot and I've resisted putting forward an agenda item until this would come forward, because I know we've all got a lot that we're digesting and that this was a big project.'",
        "'speaker_0': 'But I look forward to a very robust discussion about those things because council offices and districts they change. But the way people drive to and from schools work where you can take your kids to a park on the way home from school or work, how that all fits together, where practices are, where classes are offered and there's'",
        "'speaker_0': 'a lot to it. And I think we need to do a really thorough job of understanding that. And as we make these major investments and then we can also see we're working on the all inclusive playground at Eldorado, where would the next one be?'",
        "'speaker_0': 'What does that amenity look like? We've talked a lot about adding certain inclusivity swings at certain parks. There needs to be a reason behind a system of why we choose what we choose and where to make really good investments for the future.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Right next is Councilman Allen.'",
        "'speaker_0': 'I thank you, vice mayor. And just also a big. Thank you to Brant and to Meredith and Nancy and just all the community for their involvement. The strategic plan is comprehensive and it outlined all the fantastic achievements of the city.'",
        "'speaker_0': 'So just a big congratulations for getting to this point. And I know it was a big lift. I saw in the plan that Bixby Park was the second most popular park in the city, and it's nowhere near the largest park.'",
        "'speaker_0': 'So I think it just goes to show how vital the urban park and open spaces are important to our residents. And I'm also sure as a result of COVID, that it's much more appreciated and used. I also wanted to say that these survey results validate what I've seen of the condition of our apart and and also the'",
        "'speaker_0': 'beach equipment. It needs some love. And I also want to say really quickly, I just a big thank you to assembly member Patrick O'Donnell. I just have to give him a shout out for our 850,000 for Bixby Park that he was able to secure from from the state.'",
        "'speaker_0': 'That money is going to go a long way in transforming that park very soon. In a big way. Also I want to say to the staff, thank you for responding to all my various questions about how you conducted and incorporated the public outreach plan.'",
        "'speaker_0': 'I had a lot of similar questions as a Councilwoman Alfaro, so I do appreciate all the details and the presentation on Slide 14. You see that goal. One Seek to ensure that all residents have safe, walkable or bikeable access to neighborhood park, which includes adding new park space and poor areas.'",
        "'speaker_0': 'So thank you for that. I do have a quick question. Can you can you just share with me a little bit more about future opportunities to offer concession agreements, some parks, and what those opportunities might look like and how that can help us maintain safe, clean and accessible parks.'",
        "'speaker_2': 'Yeah. Thank you, Councilwoman Allen. That's really a great question. I think, you know, the past year, our entire leadership team has really utilized the pandemic to to look at all of our parks and our services with new opportunities.'",
        "'speaker_2': 'We've really reimagined a lot of the things that historically maybe the community has expected, but there's been a lot of really exciting best practices sprouting up from the pandemic in parks systems all across the country. So I do want to give credit to Nancy and her team, actually, Meredith, when she was our bureau manager for our planning'",
        "'speaker_2': 'and partnerships and initiated a lot of conversations with potential concessionaires, we did do an RFI to see what kind of interest we received scores of really creative possibilities that could be introduced into parks in north to south, east and west, and we'll be embarking on an RFP process shortly to really put a lot more substance to that'",
        "'speaker_2': '. But we really do believe that by introducing a lot of those kind of visitor amenities in our parks, and it's really about serving the public so that they not only come to our parks with they enjoy their time there with their family or just individually.'",
        "'speaker_2': 'And some of the newer recreational opportunities can really enliven some of our parks where we do have challenges, where when we can introduce more positive activity. It really is very, very transformative. It makes our parks more welcoming, more appreciated, respected and actually safer.'",
        "'speaker_2': 'So I'm glad you asked that question. And we do have a lot of those initiatives moving forward. So thank you so much. All right, campers, remember your anger. Thank you. I've been listening to this with somewhat of a.'",
        "'speaker_2': 'Mixed emotions here. In the sense that while my website district has been mentioned quite a bit in terms of being park poor, we do have a West Side plan to get more parking space out there. Land. Land is hard to get, but it doesn't mean that we don't have the effort out there to try to create more'",
        "'speaker_2': 'land. One of the reasons why I voted against the the storage facility and the sequel Environmental Impact Report, there was a vote or two to accept the negative declaration because I felt that if we had a full square air study, it might have come out a little different so that we could create a little bit more park'",
        "'speaker_2': 'space in that area. I'd like to thank Supervisor Hahn for coming through and having identified that in those 11 acres that the Council member Austin mentioned, that we could create more park space. I'm not sure where that status is.'",
        "'speaker_2': 'I know that the Parks Recreation Department has come before and and trying to create the the total plan as to what parks are really park space in perpetuity. I continue to work with Parks Recreation to create more space to create more parks, especially in the West Long Beach area, because that's what we need, that we need and'",
        "'speaker_2': 'and we need, of course, funding and also looking into that. I've been. Several times. I'm talking to our assembly speaker and our representatives in Sacramento about identifying some funding so that we create more parking space as we need a year Long Beach.'",
        "'speaker_2': 'And hopefully we will continue we're going to continue those efforts until we get a real positive response, because that's where that's where the fight is. The fight is funding, and it's not there now, but it doesn't mean that it's not going to be there tomorrow.'",
        "'speaker_2': 'So we continue to work with that and hopefully we can make a difference. That's not to say that this is not a good report. It's not a good a strategic plan. It is. But of course, I hope that we look at it from the fact that it's a document that it contains, that it can be adapted and'",
        "'speaker_2': 'that it can evolve to include a lot of other issues that we've got going here. One of the things that was mentioned before was that we were able to get some. Funding from us. Assemblymember O'Donnell for Bixby Park.'",
        "'speaker_2': 'I had a. I had a. A playground that burned down at the Admiral Kid Park. And unfortunately, those moneys weren't available for that. Although we do have we do have efforts to get some funding for that. But we have to go the route of having a a fundraiser for any donations.'",
        "'speaker_2': 'We shouldn't have to do that every time there's a playground destroyed. We have to have a plan so that when we have our our playgrounds damaged, that we can replace them fairly quickly and not have to wait an insurmountable amount of time to have that equipment replaced.'",
        "'speaker_2': 'So maybe in the future we can look at how we can incorporate some kind of funding mechanism in a strategic plan that would provide some funding in a in a, in a regular basis to address these kinds of issues where we have equipment that needs to be replaced or upgraded so that we don't have to keep our'",
        "'speaker_2': 'kids away for the park and not being able to take advantage of those facilities as well as the other facilities that we have in other programs. So for example, seniors lunch programs, home study, progress, homework sections, those types of things.'",
        "'speaker_2': 'So and I'll leave it at that for now. Thank you. All right. Thank you, Councilman. And they have.'",
        "'speaker_3': 'Thank you, Vice Mayor. I also wanted to point out. Thank you. Thank you, Councilmember Donna, for making those points. I also wanted to share and maybe start to share a little bit more details on the development that is happening on in the first District along the 710 with the Drake Chavez extension and the wetlands.'",
        "'speaker_3': 'I think that that's such an exciting time for for us right now to have that to have that coming and that plan that's been there and it's finally gotten some some funding. So it's coming alive. And also, we have the new Lincoln Park.'",
        "'speaker_3': 'This going to be opened very, very shortly. So really excited about that. So that maybe if you could just briefly touch on on the development of those plans that we have in place already.'",
        "'speaker_2': 'Yeah, sure. That's a great topic, Councilwoman Zydus, and thank you for your leadership and and, you know, linking us to a lot of great community partners. So certainly within the Drake Chavez masterplan or Footprints, there's a lot of exciting movements I know that I'll be must project, which is congruent to that area.'",
        "'speaker_2': 'And you know, with the reconfiguration of of the bridge, the Shoemaker Bridge and the shoreline redevelopment or realignment, it opens up really a brand new canvas to create an even greater sense of place and open space for the West Side.'",
        "'speaker_2': 'Yeah, certainly. It's no secret we're very, very excited about the advent of celebrating and dedicating the new Lincoln Park in a few weeks. You know, unfortunately, with with COVID, it's going to kind of reign us in with what we can actually do.'",
        "'speaker_2': 'But I think, you know, we'll make a virtual celebration and shout out the good news to the community for what I think will be, you know, a flagship of pride and certainly one of the best urban parks in the nation here to to complement the really world class development around Civic Center.'",
        "'speaker_2': 'And, you know, the Billie Jean King Library, it's really the nucleus of a great destination. And I think we're very proud with even our smaller parks, you know, in and around the West Side, that there's a lot of really great things happening.'",
        "'speaker_2': 'I'm really happy with what's happening at the Armory and the adjacent minor park. I think that's really important. I know with redistricting, a lot of boundaries have shifted some of the parts of interest between you and your colleagues.'",
        "'speaker_2': 'But we we continue to look at it as a citywide park system, serving a really great community. And regardless of where the boundaries are, I know each of you are very dedicated and you understand the importance that Parks have been to the community, especially during during the pandemic.'",
        "'speaker_2': 'We a lot of great things happening, a lot of wonderful opportunities on the horizon. And so I'm glad you raised a question. Thank you so much. This is. Thank you, Councilwoman Ciro.'",
        "'speaker_3': 'Yeah. I think I wanted to clarify them the motion on the table at the moment. I think I heard Councilmember Price sharing that it's direct. The city managed to create kind of a report on open space is that the motion could.'",
        "'speaker_2': 'Now they go ahead.'",
        "'speaker_3': 'Face amendments under developed. Okay. I just want to make sure that we don't create more plans when we have them, because we did I think Meredith did the before she left to go into I think to recover working on recovery when I think she created a three alarm beach park acquisition feasibility report that that identified all of'",
        "'speaker_3': 'the potential opportunity. And there's been several other reports that's been done around and just vision plans for spaces and parks like the Drake Chavez the vision plan to know the there's like the river the lower L.A. River revitalization plan that identify opportunity spaces adjacent to the river, uptown open space.'",
        "'speaker_3': 'So so I definitely, you know, and supportive of making sure we identify them. I think that we have and they've been listed here. I think there's over 120 something sites. So I just didn't want to make I just want to make sure we're not doing more redundant.'",
        "'speaker_3': 'And it's really looking into, I think what Councilmember Durango was speaking to is looking at our funding, making sure we are funding and in prioritizing what we want to do. So that's just what I just want. Make sure we don't do it doesn't work and we have the plan already.'",
        "'speaker_2': 'Councilman Austin. Thank you. I'll be really brief. I just want to follow up on those councilmembers and there's a couple of points that she made, but also just, I think. We also need to highlight some of the good work that has actually happened over the last ten years or so in some of these areas that we have'",
        "'speaker_2': 'identified as areas of need. Specifically with the Dominguez Gap, the forest wetlands. Know it's about 70 acres right there of park space that have been developed. It's passive use park space along a river that has been developed over the last ten years because of the city council's dedication and recognizing a need there.'",
        "'speaker_2': 'And so and I said on the lower L.A. River Task Force hand up to this work with a number of different cities and stakeholders in the a year long process, looking at opportunities, as you know, from miles and miles of L.A. River.'",
        "'speaker_2': 'Nowhere no cities have developed like the city of Long Beach has. And not only that, I know Little Springs is also another area which significant acreage has been developed in the central are more city and as part space.'",
        "'speaker_2': 'So in the eighth district alone, 40 acres of new park space and of passive as well as active recreation space has been developed. So I think it's important that we also highlight and celebrate our successes as a city, but also understand that we still have a lot of opportunity to grow.'",
        "'speaker_2': 'And so I highlighted 11 more acres of opportunity space for here in the city. And I see that that that's just an opportunity. Right. I just highlighted that in an area that we're also focusing on. So again, to our Parks and Recreation staff, you all did a great feasibility report about a year ago, came back with good'",
        "'speaker_2': 'information. I think we build on that document. We build on this strategic plan, and we will build an equitable future for our city. Thank you. Right. Thank you. That concludes council comment. We still have six people that that are in line to speak.'",
        "'speaker_2': 'I want to go to staff quickly, you know, in hearing the conversation. I think we want to just make sure that, you know, we acknowledge the good things that have happened, the progress being made. We also don't want to go back and start to reengage stakeholders around work that's already done.'",
        "'speaker_2': 'Council is a day sorry that you know, as it relates to outreach, we've done a lot of outreach, the uptown open space plan. I mean, they've got an American Planning Association word for outreach and identified an inventory of every vacant parcel just in District nine.'",
        "'speaker_2': 'But I know that there's additional work like what Meredith has done and others, but we don't want to do is imply that that work had been done. I think we're at the place now because we've done so much in terms of identifying inventory, as far as identifying vision and engaging the community.'",
        "'speaker_2': 'What we need for the city to do and it's Grant and his budget is to put his money where his mouth is. That's what we truly need to do is now pull the trigger and develop these parks in open spaces.'",
        "'speaker_2': 'And we've seen some great success, but we need to do more, particularly if we know that we have another state budget surplus and there may be additional investments coming down. We know that there was a conversation about earmarks.'",
        "'speaker_2': 'I'm not sure if that's going to happen either. But we just need to make sure as we apply for funds, it reflects what this document actually says and that we're building on the things that are already outlined. Let's go to public comment.'",
        "'speaker_4': 'Dave Shukla, your three minute starts now.'",
        "'speaker_2': 'Good evening. I already to you. You can read it or not. But since we're talking about opportunity space, I like that concept a lot. Uh, it may be redundant given the conversation. I think it's very, very deliberative and, frankly, a productive council conversation.'",
        "'speaker_2': 'Kind of amazing. Um, but the one point that everyone seems to kind of keep in on, and I think that we should underscore is how we acquire. Convert and site land for park space. That's important. It's path constrained not just by things like state budget surpluses and funding cycles, but also some of our fiscal requirements.'",
        "'speaker_2': 'And, uh. You know, maybe those things align with existing development pressures. Maybe they don't. But as. Uh, Councilmember Arun said, you know these. These faces have got to make sense in 20 years scale, 100 years scale. Perpetuity scale.'",
        "'speaker_2': 'Um, and so, yeah, I, I, I just, uh, take this opportunity to shamelessly plug the cows in rulemaking because there's, there's a lot of oil and gas land that was, uh, kind of a parcel that quick and easy in our city's history.'",
        "'speaker_2': 'And unlike most states, we don't have these these setbacks for health and safety. If we were to, uh, based on some special analysis they did of AB 345 a couple of years ago, uh, just in Long Beach, we'd have more land than was bought up and sold back up through already a.'",
        "'speaker_2': 'It could be a lot of land. They don't make more land. You know, like in the Superman films, like Luigi Rizzo was trying to make more land. Like they don't make more land. You could get more land. So yeah, think about that.'",
        "'speaker_2': 'Might be a good time to convert to a livable economy. Uh, thank you.'",
        "'speaker_4': 'Our next speaker is Leslie Gerritsen.'",
        "'speaker_3': 'Hi. And myself. Thank you. What a great report with tremendous information. I'd like to quickly, quickly introduce myself. Leslie Garrett, then. I'm a resident from Reno. I am also a board member of River Park Coalition. And I know we had some wonderful.'",
        "'speaker_0': 'Speech.'",
        "'speaker_3': 'Tonight for those of you who may not be aware of the coalition we formed about a year and a half ago, and we're working diligently on greenspace with the West Side, specifically in response to 37 to 1 specific place.'",
        "'speaker_3': 'We do have pending litigation and we are very hopeful. And thank you for bringing it up. We really want to see that air. That being said, let me go ahead and talk a little bit about the report. I thought it was a tremendous job and we met a lot of work that went into place.'",
        "'speaker_3': 'I know in my community here in Rosarito, our park is utilized what we and fortunately work on the neighborhood list for outreach. So I want to make sure we have that going forward. In addition, one of the things that I really hit home for me was talking about the fact that 14,000 of our trees of 32,000 so'",
        "'speaker_3': 'have are disease dying or being removed. And what I read about the maintenance, which is a huge problem in our city based on looking at that report. So I'm curious when I read about the park impact fees for proposed housing developments in Long Beach.'",
        "'speaker_3': 'They are a source of funding that can be used for the park maintenance.'",
        "'speaker_0': 'There was a Quimby.'",
        "'speaker_3': 'Act passed in 1975 which required developers to set aside land or funds to pay fees for park improvements. So the first park impact fees, they were implemented in our city in 1989. However, these fees have not been increased since 2010.'",
        "'speaker_3': 'So I'm curious, why hasn't that happened? There's a lot of development going on. And the other question I have and don't expect an answer now. Where do those funds actually go? Did they go into the general fund or they go for maintenance?'",
        "'speaker_3': 'And the last what I wanted to make is the fact that there are already a lot of plans that have been in place. I know there was conversation about the lower L.A. River. We had some great meetings this time with Patrick O'Donnell, who's been a supporter of ours and also Councilmember Austin.'",
        "'speaker_3': 'I am really looking forward to seeing some of these plans to come into fruition. And I want to make sure I, as a community member involved in helping make this stuff happen in our community. So thank you very much to the Parks and Rec Department PRM for putting it together.'",
        "'speaker_3': 'I know it was a lot of work and I am excited to identify some of the deficiencies and looking forward to help over the next ten years of these plans. Construction.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'But will the individual with the telephone number ending in 4013. Please press star six your time again to the.'",
        "'speaker_0': 'Hi. My name is. We're not in either. I am with the Hamilton Neighborhood Association. Our neighborhood borders paramount and this. Strategic plan is near and dear to our heart because we have zero accessible. Parkland or open space for the public.'",
        "'speaker_0': 'And I believe I speak for all the North End neighborhoods, starting as well as McKinley. When I speak to the fact we need as much open space and park space as we can get. And I really appreciate the effort that has been put into this by Parks and Rec, and I appreciate the level in which this has'",
        "'speaker_0': 'been presented. I also just want to end with as tag receive, and that's what we have to do now. We can't receive and file. We have to receive an act. We're desperate for open space. We're so desperate that we built we take little tiny areas of our neighborhoods.'",
        "'speaker_0': 'We throw a picnic table on it and a few trees, and we call it our open space and we maintain it as residents. We need this plan. We need it to come to fruition. We also have in plan a Hamilton loop that we have been working on for several years since 2014.'",
        "'speaker_0': 'It's supposed to open up the freeway areas around. The freight around the freeway from Atlantic to Kerry. Vice Mayor Rex Richardson has been a huge supporter with us on this. It's taken the collaboration of Caltrans, the county, the city.'",
        "'speaker_0': 'It's hard to get all these folks together, but I really appreciate the effort that's been put forth and that as well with these plans in place, the strategic strategic plan, as well as the 91 greenbelt plan, we will be able to at least have some open space.'",
        "'speaker_0': 'I hear people talking about maintenance. I agree with that too. But please just understand, there are parts of this city that have zero open space. Thank you for listening. Have a great day.'",
        "'speaker_4': 'Our next speaker is Mariella Salgado.'",
        "'speaker_3': 'Good evening. Thank you.'",
        "'speaker_0': 'I come to you as vice chair of the Parks Commission? We serve as an advisory board to you and our city regarding park lands, plans and improvements and other budgetary priorities. Our parks do not have unions or lobbyists to advocate for its needs or importance in the community.'",
        "'speaker_0': 'Yet it plays a crucial role in the health of our community, particularly for our youth, our 0 to 8 population and zero four seniors. As many experienced in the pandemic, our parks and open spaces became a focal point for health and will also highlight the importance it plays in providing afterschool and summer programing and child care for'",
        "'speaker_0': 'our families. Our park system is one families heavily rely on for recreational opportunities. Affordable programing and an important childcare provider for our workforce, particularly women. This department and our world of commissioners has equal importance and relevance as public safety.'",
        "'speaker_0': 'This plan lays the foundation for future priorities and investments. As such, I'd like to highlight the importance of our approach to advance health equity. A Goal within the Racial Reconciliation Report. You all voted unanimously to advance racial equity in language.'",
        "'speaker_0': 'This initiative also references Park Equity, recognizing the impact of open space on health for those who need it most. Hello.'",
        "'speaker_2': 'We can hear you.'",
        "'speaker_0': 'Oh, I'm sorry. Did you guys hear me earlier?'",
        "'speaker_2': 'Yeah, we heard you.'",
        "'speaker_0': 'Sorry. Um.'",
        "'speaker_3': 'In its current iteration.'",
        "'speaker_0': 'Our commission recommended the park in health equity goal number three to be the primary goal. Its current iteration stays safe and accessible public spaces as a primary goal and in my opinion, maintains the status quo. This plan presents an opportunity for you all to ensure there is a prioritization of projects, investments and programing to address historical disinvestment'",
        "'speaker_0': 'policies and systems that have negatively impacted a majority of our residents across the city. To change the future of park investments, where residents in Long Beach have access to nearly 16 times the park space and those living in Watts, Long Beach and park plants like my car park and masterplan aquatic recreation in North Beach no longer remain'",
        "'speaker_0': 'in planning phases for 22 to 30 years. As a first District resident, our Drake Jarvis Master Plan is well over 25 years old. I also want to add an important plan that was included in the strategic plan is the city's early childhood education strategic plan that promotes the well-being of our 0 to 8 population.'",
        "'speaker_0': 'This plan was not included in this plan, and it should. You see, this plan discusses the importance of increasing the quality of programs delivered to young children, remove barriers to quality, educate early education and access to green spaces regardless of ability and geography.'",
        "'speaker_0': 'Park investments promote positive outcomes for our city. Our parks plays a vital role in meeting so many of our city goals, from health initiatives to economic empowerment and make eating more equitable. You bear the responsibility for.'",
        "'speaker_3': 'Promoting.'",
        "'speaker_0': 'Equitable access to resources and services to minimize the disparities our residents experience. I hope you will consider our Parks Commission recommendation to place equity as the primary goal. Hamilton neighborhood as a comment was submitted earlier. Should have given space.'",
        "'speaker_0': 'But I won't if we do.'",
        "'speaker_4': 'Thank you. Our next speaker is Rae Garbage.'",
        "'speaker_0': 'Good evening. Thank you very much. I am a member of Carp Citizens about responsible planning, Long Beach Reform, Coalition and Neighborhoods First. I also served on the Parks and Rec Commission from 1985 to 1993, and we have the same story.'",
        "'speaker_0': 'We have the same challenges. We had the same issues. I look at listen to you, and I appreciate so much the work that goes into it. But I think what we really have to look at is to stop repeating the problems or glossing over them.'",
        "'speaker_0': 'And then what happens is you get to a budget time and you have to me, you city council have to make budget cuts. And if I understand it correctly, I think we're somewhere between 13 and 30 million deficit this year.'",
        "'speaker_0': 'But regardless, those cuts have to be made and they seem to be made on the backs of Parks and Rec rather consistently over the years. The water budget has not been added to for Parks and Rec and they pay their own water bill.'",
        "'speaker_0': 'The cemeteries, when they were added, they went on the responsibility of Parks and Rec with no increase in their budget. That's something that I really, really ask you as council members to pay attention to when you come up to the next budget period.'",
        "'speaker_0': 'We have places in our city Eldorado Park Area three. The ponds and the walkways are atrocious. They are not accessible. They're dangerous. Those should have been fixed years ago. Shire Park, the pond that has not been functioning as intended for years since I was on the Parks and Rec Commission, the bathrooms in our parks and our beaches'",
        "'speaker_0': 'should not be locked, but they should be maintained. And I know it's all about money. It's all comes down to the dollars. So how we spend it, you know, maybe those priorities need to change. Also, I was reviewing the 2021 salaries last summer, and I found that we have a number of mid-level management people in Parks and'",
        "'speaker_0': 'Rec with fewer worker bees, so the work doesn't get done. So we contract with check that instead of having those people on board that really love their work and took pride in taking care of their city. You know, I know I'm about out of time.'",
        "'speaker_0': 'So, you know, we've lost ten and a half acres, in my opinion, with the Boy Scout Park. We've lost acreage at that. The biggest gap opportunity for both storage. And now there's another seventh District residential project in the pipeline that could be Parkland.'",
        "'speaker_0': 'So I hope that you will look at that when when Councilmember Urunga said land is hard to get. It is hard to get, but we have a lot what we did have a lot of surplus city owned properties that can become pocket parks, not quick sales without some benefit to Long Beach residents.'",
        "'speaker_0': 'And the Trust for Public Lands was a great organization that we tried to work with. Of course, when when times were tough, when we were in the Great Depression area, it was hard. They didn't have the they didn't have the money available to them as well.'",
        "'speaker_0': 'We also were.'",
        "'speaker_4': 'Thank you. That speaker is Laura Summer.'",
        "'speaker_3': 'Yes. My name is Laura Soma. Thank you very much for this second chance of public comment. I would like to point your to page 33 of this plan. There are three excellent maps on the plan, the first one being the Long Beach Red Lighting.'",
        "'speaker_3': 'The 34 years of redlining that Long Beach experienced during the building years of postwar. And then the second map is people of color in Long Beach. And then the third map is called Park Equity. The only correction I'd make on this page is I would title that park in quality because but these three images, I think, tell'",
        "'speaker_3': 'the story of this entire clan.'",
        "'speaker_0': 'And I think the remedies.'",
        "'speaker_3': 'Are pretty clear that we do that. The city does need to support park development in the west, central and north. I do support the motion to have a city manager come back and report if plans are already in place.'",
        "'speaker_3': 'I believe those can be part of the report, but we do have 25 acres, I think currently under a proposal to become an RV park. And turning back to the map with people of color. I'm just looking at this.'",
        "'speaker_3': 'That community want a park or does the community really want an RV storage?'",
        "'speaker_0': 'And I think that's a big outstanding question.'",
        "'speaker_3': 'I'll read a quote from the strategic plan here. It says, There is lack of equity in terms of park space and open land versus East Long Beach. There's so much need in the west, central and north Long Beach.'",
        "'speaker_3': 'Where there are more residents living in denser neighborhoods that each deserve their own Eldorado Park. And I will close with page 102. One of the first actions is to establish Park Equity acquisition. But it says guidelines. But I believe one of those.'",
        "'speaker_0': 'Guidelines is to acquire.'",
        "'speaker_3': 'The park land before. It's built in and covered with concrete. And I think that's why it's applicable. When you're going to build an RV park on 25 acres, you might want to step back and really consider the real purpose.'",
        "'speaker_3': 'Should that be parkland for the community? And then it does say also here in this slide, just partner with the county. And, you know, the county of Los Angeles did a lot of redlining on their own. It was a cause.'",
        "'speaker_3': 'It was a nationwide, horrible phenomenon. But the county I believe the county would thank you.'",
        "'speaker_4': 'Well, the individual with the telephone number ending in 7340. Your time begins now. Please press star six.'",
        "'speaker_0': 'Thank you. This is Karen Recite. I'm president of the Long Beach Gray Panthers. And we appreciate park staff. We see them go above the board, above board and be on their job every single day. And we're we're not in favor of adopting this plan right now because I'm going to address some senior issues.'",
        "'speaker_0': 'We feel that there there are gaps that are missing that need to be included in the plan. And we really appreciate your ability to be open in discussing these issues. If we're talking about equity, you know, there's very little mention of the YouTube community.'",
        "'speaker_0': 'They do use our parks quite heavily or the disabled community, and most of our parks are not really accessible. So these issues need to be included in the plan. We don't think the goals are specific enough. You know, what gets written in is what's going to get done, and if it's not written in, it won't get done'",
        "'speaker_0': '. Are we going to have police in our parks? Are we going to park rangers? I can't go in and out the front door of the senior center because we have people, some.'",
        "'speaker_2': 'Of them drug users.'",
        "'speaker_0': 'And it's not safe. So seniors are particularly targets for people that are looking to do damage. And the there's not really a lot of discussion about what's going to happen with seniors as one of the newest partners for the Parks and Rec.'",
        "'speaker_0': 'So we've been in space at the senior center for four months. We have handed out 400 warm coats to seniors that have to stand out in the cold to get their food during food distribution days. And they didn't have coats.'",
        "'speaker_0': 'So we got them coats. Working with the National Council of Jewish Women and Chase Bank, we distributed help distribute. We paid for 168 Thanksgiving meals. So seniors that came to the senior centers have a Thanksgiving dinner in partnership with Partners Apart, we have distributed 276 dining cards in over 250 grocery cards, and we've done that at 40'",
        "'speaker_0': 'senior centers. We have held a senior center safety forum with the police, got the police more engaged with the senior center and keeping the seniors safe. And we had over 100 attendees and everybody received lunch. We distributed over 1000 caps and scarves to seniors all across the community.'",
        "'speaker_0': 'And these are things that nobody talks about. The grocery cards I could give out probably ten times the grocery cards that we have money for.'",
        "'speaker_4': 'Thank you. That concludes public comment.'",
        "'speaker_2': 'All right. Let's move to the n roll, please.'",
        "'speaker_1': 'That concludes public comment.'",
        "'speaker_2': 'I spoke to a local police.'",
        "'speaker_1': 'District one. My district to.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_3': 'II.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five. I. District six. I. District seven. Art District eight.'",
        "'speaker_2': 'Uh.'",
        "'speaker_1': 'District nine?'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to amend Contract No. 95866000LBPD24750, with the Los Angeles County Metropolitan Transportation Authority, for providing law enforcement services, to increase the contract amount by $3,730,814, for a revised contract amount not to exceed $36,953,404, for the term of July 1, 2017 to June 30, 2022.  (Districts 1,2,6,7,8)": [
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_2': 'Thank you. I think we're on tape now.'",
        "'speaker_1': 'Report from, please. Recommendation to amend contract with the Los Angeles County Metropolitan Transportation Authority for providing law enforcement services to increase the contract amount by $3,730,814. Districts one, two, six, seven and eight.'",
        "'speaker_2': 'We need a motion on the second. Move Austen and Allen during public comment.'",
        "'speaker_4': 'There is no public comment for this item.'",
        "'speaker_2': 'All right. Another thing must be to this. Can we roll? I think just that it is a contract to continue safety along our light rail within our city. I did want to ask the city manager. Are there any significant stipulations in this contract that we need to be aware of or the public need to be aware of'",
        "'speaker_5': '? Um. Yes, in this contract. I think we're good to go. I do want to bring something that is new that came up in December 2021. There has been a new board motion by the MTA to require vaccinations for everybody who is working on the airline.'",
        "'speaker_5': 'So that policy is something that we are actively reviewing and looking at. It's not completely formatted yet, and we will bring that back to you about what any potential implications would be depending on where and, you know, what motions that they have in the city's process of requiring vaccinations.'",
        "'speaker_2': 'All right. Thank you. And I want to know and I know this is important this is important to Mayor Garcia, and he would be here, but he's at US Conference of Mayors this week. And so I just wanted to lift that up.'",
        "'speaker_2': 'But Councilwoman Allen, anything.'",
        "'speaker_0': 'Yes. Just just really briefly, I just want to say that this contract is key to providing rapid responses and safe spaces that I metro trains and platforms that are. And I want to thank Supervisor Janice Hahn for her support of our local law enforcement and providing these services and also to our wonderful Mayor Garcia, for getting this'",
        "'speaker_0': 'contract set up in the first place. Our continued support as we push to increase the quality of life for homeless outreach that is also provided in this contract. And I can tell you, you know, especially living downtown, I know the difference.'",
        "'speaker_0': 'I saw the difference immediately. It was very apparent to me when Long Beach PD took over from the sheriff. So I'm just very proud that we can continue this arrangement.'",
        "'speaker_2': 'Thank you. Let's go to a roll call vote, please.'",
        "'speaker_1': 'District one. High district to.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District three.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'District six. I'm District seven. District eight.'",
        "'speaker_2': 'By.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7187 and award a contract to E2 Contracting, Inc., of Irvine, CA, for construction of the Long Beach Municipal Urban Stormwater Treatment Facility Phase 1C Wetlands Project, in the amount of $2,689,210, with a 20 percent contingency in the amount of $537,842, for a total contract amount not to exceed $3,227,052; and, authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments.  (District 1)": [
        "'speaker_1': 'District nine. Motion is carried.'",
        "'speaker_2': 'All right. Item 29 for your.'",
        "'speaker_1': 'Report from Public Works Recommendation to award a contract to E two contracting for construction of the Long Beach Municipal Urban Stormwater Treatment Facility. Phase one C Wetlands Project for a total contract amount not to exceed $3,227,052. District one.'",
        "'speaker_2': 'Move your rank of second to the very highest council meeting. Rank anything. I yeah. I'm also worked on the reverse amount conservancy was able to acquire $2 million to go towards this project. Very happy to see that it's moving forward with the wetlands component to it.'",
        "'speaker_2': 'Thank you. In fact, the councilwoman said they are.'",
        "'speaker_3': 'Thank you, Vice Mayor, and thank you to Councilmember Dunga for supporting this awesome project. I'm really excited for this project and everything that comes with it. It's been, you know, again, a long time coming, but I think it's going to be one of the most fantastic things that we have in Long Beach.'",
        "'speaker_3': 'So I'm really, really happy to see this project moving forward.'",
        "'speaker_2': 'Thank you, Councilwoman Ciro.'",
        "'speaker_3': 'Yeah. So just out of an abundance of caution, I work for ANSI, who provided the funding for this contract. So I would like to recuse myself from voting on this item.'",
        "'speaker_2': 'Okay. I think you have to exit the meeting.'",
        "'speaker_0': 'Do I hear?'",
        "'speaker_2': 'The second reason for the last meeting. So tonight, Councilman Austin, I just want to throw my support behind this item. This is something that I have also worked on with the Gateway Cities Council, the government, as well as been a long term member of city council.'",
        "'speaker_2': 'This is great to see us putting more investment toward stormwater infrastructure, but at the same time continuing to develop parks basically along the L.A. River. So congratulations to to the city, to the residents, and happy to support this.'",
        "'speaker_2': 'All right. Interesting. I'll offer my comments and support. This is a project that touches every district along the river. There's opportunities not only to clean our clean our water and have a more sustainable system. It also helps us to add some natural wetlands and some of those things.'",
        "'speaker_2': 'Our staff has a photo that they'd like to show if that would be a good time to pull it up.'",
        "'speaker_5': 'Thank you, Eric Lopez. We'll pull that up. And just a real quick rendering. This is a wonderful, wonderful project. The council talked a lot about parks and open space. And this has been a great partnership to be able to take land that is currently not a usable open space and turn it into something beautiful.'",
        "'speaker_2': 'I. Council members, I'm showing the renderings on the map or on the screen as part of the previous action. The actual treatment facility is already under construction, and tonight's action will have kicked off the actual construction of the wetlands.'",
        "'speaker_2': 'That's going to be across the street from the facility that's adjacent to that to the river. This was a former private development parcel that we acquired with grant funding support that we've been working to to empty. And now we'll be ready to demolish the site improvement and create or restore some wetlands with visitor serving amenities, including a'",
        "'speaker_2': 'walking path. So I'll go through some of these renderings to just show the the proposed project and and what we plan for the area to look like once we complete the work. And that concludes that customization. All right.'",
        "'speaker_2': 'Thank you. They look incredible. Look forward to seeing this project and all the enhancements along the river. Let's go ahead and go to public comment.'",
        "'speaker_4': 'There is no public comment for this item.'",
        "'speaker_2': 'Fantastic. Whatever. We'll call the district one.'",
        "'speaker_1': 'High District to.'",
        "'speaker_0': 'High.'",
        "'speaker_1': 'District three. I district for.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Recommendation to receive and file a presentation of the 2021 Gateway Cities Energy Action Gold Award earned by the City of Long Beach for achievements of excellence in furthering sustainable energy goals.  (Citywide)": [
        "'speaker_2': 'One, two. I'm 30. This is our last item, right?'",
        "'speaker_1': 'Correct. We still have open public comment after this item.'",
        "'speaker_2': 'Got it. This is the last one was here, I.'",
        "'speaker_1': 'Report from Public Works recommendation to receive and file a presentation of the 2021 Gateway Cities Energy Action Gold Award earned by the City of Long Beach Citywide.'",
        "'speaker_2': 'All right. But we have report on them.'",
        "'speaker_5': 'Yes, we have a brief staff report and a very quick video should be less than three or 4 minutes.'",
        "'speaker_2': 'Thank you, Tom. We're really proud to present this item today and receive an award. The, uh, the city staff has been working with slightly. What the gateways, cities, councils, government, their energy action committee to meet a series of requirements that are that have made us one of three cities to receive gold status.'",
        "'speaker_2': 'To present the video and say a few words. Today we have Nancy Pepper, the director of Gateway Cities Council, our government that should be on. And we would like her. We would like to invite her to say a few words and then we can show the video.'",
        "'speaker_3': 'Sure getting name right.'",
        "'speaker_0': 'There and council members and Eric, we haven't had the chance to meet but it's nice to meet you this way and thanks for the opportunity to congratulate the city of Long Beach for winning the Gold Energy Action Award for 2021.'",
        "'speaker_3': 'These awards were developed through the.'",
        "'speaker_0': 'City's Energy Working Group to help cities become more energy efficient, more sustainable and save money. We hosted the first Gateway Cities Energy Action Awards in December, and Long Beach, as Eric mentioned, was one of only three cities that won a gold level award for their overall efforts.'",
        "'speaker_0': 'Among other actions, the city was recognized for equitably installing electric vehicle charging stations across the city and for adopting a climate action plan. I believe we have a brief video about.'",
        "'speaker_3': 'The award, so if we can go ahead to that, let's show that and.'",
        "'speaker_0': 'Then I'll wrap up very briefly.'",
        "'speaker_3': 'The Gateway Cities Energy Action Awards, recognize the cities for their actions to improve energy efficiency and sustainability. And we hope they also help motivate.'",
        "'speaker_0': 'Progress through some.'",
        "'speaker_3': 'Friendly competition. Congrats to our 2021 bronze tier winner. And congratulations to our 2021 silver tier winners. And introducing our 2021 gold tier public agencies. City of Long Beach. Long Beach is committed to expanding EV charging options equitably across all communities, with 600 new level two ports in order to empower residents to make the switch to electric.'",
        "'speaker_3': 'City of Lynnwood, the Lucy Avalos Community Center is a shining example of Winwood's commitment to energy efficiency and sustainability a $5 million LEED gold certified facility. City of Paramount. Paramount has begun the process to upgrade to electric vehicles in planning, public works, public safety, community services.'",
        "'speaker_0': 'And administrative services. I am so proud of all the great cities making strides to become more energy efficient and more sustainable by participating in the Cox Energy Working Group. Congratulations to all the cities that have reached the bronze and silver levels this year, and I especially want to congratulate our three gold levels cities Paramount, Lynnwood and Long'",
        "'speaker_0': 'Beach, who reached the highest level of energy efficiency and sustainability and are also climate leaders. Congratulations and thank you for your dedication to energy excellence. Okay. Okay. I just also wanted to mention that we did award a plaque to the city in December.'",
        "'speaker_0': 'I understand that Justin Beck from Public Works has that plaque. I don't know if he's able to hear anyone else from public works are able to show that to the council. But if not, it's really pretty. I hope you stop by to see it.'",
        "'speaker_0': 'And that that concludes my presentation and thanks so much for the opportunity to congratulate Long Beach in my official capacity from the court. But I'm also proud, as a resident of Long Beach, to see the city doing this.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Also. Thank you. We have a motion and a second motion by Councilwoman Allen. You want to say anything?'",
        "'speaker_0': 'Yes. Just real quickly. I love that we are one of only three cities to be awarded this honor. And this just goes to show the great work that we have been doing and just want to congratulate the city staff on their recognition on their recognition and and efforts.'",
        "'speaker_0': 'And you've done a great job, Eric, and I know that moving forward will continue to lead our region on sustainability. So just great job, everyone.'",
        "'speaker_2': 'Do come home in sorrow.'",
        "'speaker_3': 'Yeah. I do want to congratulate Eric and the team at public works for this great recognition as an alternate to the mayor at the Gateway COG. I'm just proud to be able to represent Long Beach as the leader of sustainability.'",
        "'speaker_3': 'And I have my colleague here, Councilmember Turanga, who also sits on Gateway COG as well. And we're proud to be the goal here. Already. So on the record. Thank you.'",
        "'speaker_2': 'Have there been any public comment on this?'",
        "'speaker_4': 'Dave Shuker. Your time starts now.'",
        "'speaker_2': 'Hello? Can you hear me? Yes. Great. Congratulations on the award. I would love to see where those 600 new stations are supposed to be located. I think we just got an email this evening saying that they're going to equitably take input, to equitably distribute them along the equitable lines that Southern California Edison has already centralized their procurement'",
        "'speaker_2': '. I mean, is this stuff we're going to own or not? Are we are we are we hollowed out as a city to the point where we're owned by just like one corporation now? Or. Or do we get to like like own our own stuff and, like, build the Jetsons?'",
        "'speaker_2': 'Kind of like, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa, whoa. What do we get to do? Do we get to keep having a war or for the next ten, 20 years? Well, we're not actually materially reducing our.'",
        "'speaker_2': 'Our emissions load. I mean, you know, what do you want? You want a livable future. You want more awards. I don't mean to rain on the parade, but I. I just, you know, I, I, I keep wondering where, when we're, we're all going to be shown the wisdom of the path and the way and why we've had'",
        "'speaker_2': 'to wait so long to participate in these decisions that affect, you know, basic decisions for some of us. Like, should I go to school here? Should I work here? Should I start a family here? Is this place safe for my parents to have a home?'",
        "'speaker_2': 'And a lot of that information, frankly, you know, it's kind of papered over and I would hope one from the evens that development was development and get. Yeah. Um. So thank you. So, Cal ran for telling the city of beach we're going to apparently do things.'",
        "'speaker_2': 'We could just divide up and do it ourselves. Lynwood and Paramount make a lot more sense. For instance, being part of some municipal or community service aggregation program, maybe it will be DWP outright at this point might just be faster and easier.'",
        "'speaker_2': 'But the one thing that I don't know about these awards, but one thing I'm certain about is I got a lot to think about over the next few months with this place. With this place I grew up in.'",
        "'speaker_2': 'Like being an adult here now, is the 2020s a bit different? Thank you.'",
        "'speaker_4': 'That concludes public comment.'",
        "'speaker_2': 'Fantastic. Let's go ahead and have our.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'K.'",
        "'speaker_1': 'District, too, right? District three.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District nine. A motion is carried.'",
        "'speaker_2': 'All right. Thank you. That satisfies the agenda. We have a number of announcements from some folks who have requested to us around the minute memory and the honor of residents. Let's start with Councilwoman.'",
        "'speaker_3': 'Sorrell.'",
        "'speaker_1': 'Vice Mayor. We still have open public comment.'"
    ]
}