{
    "Recommendation to receive and file a report from hospitality industry representatives on recently released infographic related to their contributions to the Long Beach economy.": [
        "'speaker_3': 'And then we will go ahead and have our budget hearing and we'll have public comment in the city council meeting after that. So let's. Madam Clerk, please go ahead and pull up item number 31, please.'",
        "'speaker_2': 'Communication from Councilmember Super, not a recommendation to receive and file a report from hospitality industry representatives on recently released infographic related to their contributions to the Long Beach economy.'",
        "'speaker_3': 'Thank you, Councilmember Supernova. If you'd like to make that motion, you have the floor. King. I am going to make that motion later. It's not it's not hooking up for me. So it machine's not quite working. But you have a floor.'",
        "'speaker_3': 'All right. Thank you, Vice Mayor. I have just a very brief statement to read prior to the presentation. This will set the stage for our presenters. This agenda item originated a few months ago at a city council meeting during public comment.'",
        "'speaker_3': 'Several hotel employees spoke about workplace issues at some of our local hotels. Whether or not it was specifically stated, I believe the inference by virtue of the fact that they were speaking at the podium is that hotel management was not hearing the concerns.'",
        "'speaker_3': 'That is what struck me as I listened to the testimony. The idea that management wasn't listening did not comport with my experience in working with hospitality industry clients over many years. I have never met anyone in hospitality management who wasn't keenly aware of the fact that they are in a people industry.'",
        "'speaker_3': 'And a corollary to that fact is that employee satisfaction can be directly connected to guest satisfaction. It didn't make any sense to me that management was not hearing and reacting to employee concerns. But I'm not the expert here.'",
        "'speaker_3': 'So I thought it would be beneficial to invite our local industry representatives to present to council in order to benchmark their current initiatives and contributions to the Long Beach economy. So we'll have a total of four speakers. And first up will be Jeremy Harris of the Greater Long Beach Area Chamber of Commerce.'",
        "'speaker_6': 'I don't know. Did you want to?'",
        "'speaker_5': 'Oh, yeah. Yeah. I.'",
        "'speaker_6': 'Test. There we go. Thank you. Council member, vice mayor, council members and city staff. Jeremy Harris, senior vice president with the Long Beach Area Chamber of Commerce. And also, I serve as the staff liaison to the Long Beach Hospitality Alliance.'",
        "'speaker_6': 'I'm here tonight to.'",
        "'speaker_3': 'Talk to you about along with the industry that they represent. It's a pleasure to give a report on some recent.'",
        "'speaker_6': 'Information we and data that we've collected regarding the alliance and the hoteliers.'",
        "'speaker_3': 'And industry that they represent. The Alliance aims to represent local hospitality industry made up of major.'",
        "'speaker_6': 'Hotels in Long Beach area. Many of them are with us here tonight as well. They include the Hilton Hotel, Maya, the Renaissance, Long Beach, Marriott Airport, Holiday Inn.'",
        "'speaker_3': 'Long Beach Airport, Courtyard Marriott downtown, the residence in Marriott Courtyard Marriott.'",
        "'speaker_6': 'Long Beach Airport, Holiday Inn residence in downtown and the residence.'",
        "'speaker_3': 'In airport. To give you a snapshot of who we're talking about tonight.'",
        "'speaker_6': 'These are all good.'",
        "'speaker_3': 'Corporate citizens that provide great paying jobs and call Long Beach Home. We also appreciate the upward mobility they provide in terms of career oriented jobs and while giving back to the.'",
        "'speaker_6': 'Community in various ways, which I know many of us hear about, and we'll hear a little bit more here shortly.'",
        "'speaker_3': 'In fact, before we bring up another speaker, I'd like to share a brief video that was produced.'",
        "'speaker_6': 'Just a few months ago highlighting just a few of our members.'",
        "'speaker_3': 'And what they do.'",
        "'speaker_6': 'For their team members and the community. If we can have the video, please.'",
        "'speaker_0': 'When I started working for hospitality, I have no idea what I was getting into it. But I don't regret a minute choosing this career because it is the best career that anybody can work on. I'm surrounded by people who.'",
        "'speaker_1': 'Inspire me and bring me to the next level.'",
        "'speaker_0': 'It really makes me feel comfortable and empowered.'",
        "'speaker_1': 'To work in an environment like.'",
        "'speaker_0': 'This. Holiday Inn means to me the word holiday, and we take every day like it is a holiday with our guests and also that our associates is like family who is like a family away from my own family.'",
        "'speaker_0': 'Spent a lot of time here and I build relationships not with just my associates, but also with my kids.'",
        "'speaker_6': 'I've been a part of the Intercontinental Hotel family for a long time now, and working at the Holiday Inn here in Long Beach is just very rewarding because it's a wonderful project with the renovation and new restaurant coming up.'",
        "'speaker_6': 'And also, obviously for me, it's a great challenge that I'm facing with with prime me.'",
        "'speaker_0': 'Retro hierarchy. And they load them for me so I can travel hockey therapy, animal, roadside hotel, raffle and Ambien, things like that get that are like on vinyasa that that hierarchy, the lobotomy the Renaissance means for me job security and professionally.'",
        "'speaker_0': 'I've developed myself over the years learning and developing myself, taking care of your guests and taking care of my employees.'",
        "'speaker_7': 'I'm proud to work in this place. We have great opportunities to.'",
        "'speaker_6': 'Grow in this company and also we have benefits. We have a great environment and all those because.'",
        "'speaker_7': 'Our management gave us all the support we need. Our favorite thing about coming to work every morning here at the Holiday.'",
        "'speaker_6': 'Inn is to meet colleagues that are as enthusiastic as myself to get the job done right.'",
        "'speaker_1': 'I think it's really important to.'",
        "'speaker_0': 'Work in.'",
        "'speaker_1': 'An environment that you see as fit for yourself. We are all very much leaders in our own way. We're very unique. We all get along and we are all friends, which is sometimes hard in the.'",
        "'speaker_0': 'Workplace, but at the end makes.'",
        "'speaker_1': 'Coming to work even that more special.'",
        "'speaker_6': 'Thank you. As you see, it's just a snapshot of three of the hotels that make up the alliance and represent the community. To further expand upon our presentation this evening, I'm going to call up Christy Allen, VP of hotel operations for Ensemble Hotels, and Jim of the Hotel Maya.'",
        "'speaker_0': 'Thank you, Jeremy. Thank you, vice mayor and council members. We, the hoteliers, want to take this opportunity before all of you to speak about the collective impact of the hospitality industry within the community of Long Beach. The information behind you on the screen titled Long Beach Hospitality Industry by the Numbers is a snapshot of just some of'",
        "'speaker_0': 'the lesser known attributes of our industry, specifically the hotels that we would like to share with you and ensure that these are at the forefront in any conversations about the hotels and our industry here in Long Beach. Advocacy and advocating for sustaining a collective economic growth for it for our industry is one of the three pillars and'",
        "'speaker_0': 'a focal point in the mission of the Long Beach Hospitality Alliance. You'll see total dollars up there. Transient occupancy tax or TLT, as commonly referred to, is a vital component of our city budget. As you all know, total has been growing the past few years to over $26 million in 2016 through growth in both our hotel occupancy'",
        "'speaker_0': 'rates and average daily rates for Long Beach this year, we are seeing positive numbers that should produce stronger Totti than 2016, which of course is a good thing for Long Beach. Many factors, including the continued investment our owners make an existing hotels through renovations, upgrades and improvements, and the city's investment in our convention center has aided in'",
        "'speaker_0': 'this growth. But while 2017 forecast forecasts may look strong now, we must remain alert to outside influence or government interference with additional laws that could severely impact the health of our hotels and cause issues for not only the hotels but the city.'",
        "'speaker_0': 'In terms of reduced transient occupancy tax, that affects everyone's bottom line. The second pillar of our mission for the alliance is one that always has been and always will be the most important key to our longevity and success investing in our people, our team members through trainings and benefits.'",
        "'speaker_0': 'The numbers you see on the screen are quite revealing. 82% of our hotel employees reside in Long Beach. Almost 50% have ten or more years with their current hotel. I personally have two housekeepers who just pass their 40 year mark at the Meyer.'",
        "'speaker_0': 'Meyer must be a pretty fabulous place to work. Many hotels have second and third generations of family members working in the same hotel from entry level jobs as interns, high school or college students. The hotel industry has been one of the few employers that has always offered incredible opportunity for growth from within.'",
        "'speaker_0': 'In fact, many of the general managers and staff here this evening began their career as hourly employees in a hotel. I myself started as a restaurant hostess. Continuing with supporting our team members. Our alliance has done this through education and professional training in the past year.'",
        "'speaker_0': 'As you'll see on the screen, the Alliance has successfully sponsored professional training courses for over a thousand team members on topics such as recognizing human trafficking, personal defense safety, training, CPR, first aid and emergency procedures during an active shooter or terrorist attack.'",
        "'speaker_0': 'Our trainings have been conducted by professionals and have included that have included the Department of Homeland Security. These trainings are extremely well received and now serve as a hallmark of our ability to leverage our collective energies to develop and protect our team members.'",
        "'speaker_0': 'So much so, we are considering opening future trainings to other businesses in the hospitality industry, such as restaurants and small business or our vendors. The third pillar of our alliance is community service. The very same community in which we do business and provide jobs.'",
        "'speaker_0': 'Long Beach has one of the highest concentrations of nonprofit organizations, and we are proud to partner with many of these organizations by assisting in their fundraising efforts with food and auction donations. Employee participation in various community service events.'",
        "'speaker_0': 'And partnering with these organizations where we can to improve our community. We have done everything from building new playgrounds. To feeding thousands for Thanksgiving at a community center each year, to helping to provide equipment for school gyms, beach cleanups, and providing rooms and meals for families in need at Long Beach Memorial, just to name a few.'",
        "'speaker_0': 'There are literally hundreds of other requests and events we participate in in each of your council districts. Some of these organizations are highlighted in the bottom left of the slide above. Combine all of these efforts with our involvement through our national brands.'",
        "'speaker_0': 'Our hotels have been recognized collectively through our individual hotels. National Brand Awards, the Marriott has received has been recognized for being one of the top 50 companies in the country for diversity. One of the top companies for executive women, the LGBTQ Business Equality Award, an employer of the year from Latina style, a national magazine for professional Hispanic'",
        "'speaker_0': 'women. The Hilton brand has been recognized as a top company for diversity as well. Human Rights Campaign Foundation's Corporate Equality Index of 100 100 Companies Providing the most opportunities for Latinos. Top Diversity Employee As noted by Black Empowerment and Entrepreneur Journal magazine.'",
        "'speaker_0': 'These are just a few of the recognitions and awards. Some of our brands in Long Beach have garnered nationally, as hotels in general are known as a great place to work for many across both our city and America.'",
        "'speaker_0': 'We have a list of benefits also offered among our hotels to our team members on the slide. Our common pillars, as summarized tonight of advocacy, education and community, are not new to hoteliers who are with us tonight. These have been core components of all of our brands, and we continue to strengthen each in Long Beach.'",
        "'speaker_0': 'And while we are certainly competitors, we share a common passion for our team members and the spirit to serve others. It's in the DNA of our industry as well as the DNA in all of us. With that, I'd just like to ask our folks in the hospitality industry that are with us tonight, who work for a hotel'",
        "'speaker_0': ', support our industry or a combination of both.'",
        "'speaker_4': 'To please stand.'",
        "'speaker_0': 'We appreciate all of you who have made the time to be with us tonight. Now you may be seated. Now allow me to introduce to you Jennifer Robinson, who has called the.'",
        "'speaker_2': 'Long Beach Marriott home.'",
        "'speaker_0': 'Near the airport, her career home for 28 years. She started as an hourly employee and now manages their largest apartment in the hotel. Her story is only one that exemplifies what we do each and every day here in Long Beach.'",
        "'speaker_0': 'Good evening, Vice Mayor Richardson and the honorable council members. My name is Jennifer Robinson. I started my career at the Long Beach Marriott in 1989 as assistant restaurant manager. Later, as I grew in my position, I became the restaurant manager and then director of services.'",
        "'speaker_0': 'Restaurant. In 1998, I was promoted and currently working as Director of services. I have worked in the front of the house as well as the back of the house. Each has its own reward, but nothing more rewarding than seeing hardworking people.'",
        "'speaker_0': 'Housekeepers come in each and every day. It was clear that in this industry I was not going to be wealthy in the bank, but wealthy in my heart by simply working with my staff building relationships. Some days that means taking off my jacket and getting in the dirt with them.'",
        "'speaker_0': 'Just to get the job done. When our occupancy goes up, we are able to offer overtime as a benefit by posting the information on the board to anyone who is interested. Just to make it happen for us. And they do that with a smile.'",
        "'speaker_0': 'The training that is offered at the hotel I have been able to promote within the department and then the hotel to supervisory positions and also management positions in our business. We have to be able to depend on each other as family should.'",
        "'speaker_0': 'So more than just 28 year career, it's become a way of life. It's become a family to me. So many times I've been asked, why stay at a location for so long? And in just a few words I can tell you.'",
        "'speaker_6': 'It's the people. It's the.'",
        "'speaker_0': 'Company. The support from my general manager Imran Ahmad, to the Executive Committee on down. It's paramount to what we need to achieve by taking care of not only our guest but as well as our associates. I thank you.'",
        "'speaker_0': 'And now I would like to introduce our general manager, Imran Ahmed, of the Long Beach Marriott Hotel.'",
        "'speaker_7': 'Jennifer. Thank you, Jennifer. Thank you, Christy. Good evening, Vice Mayor Richardson and our honorable city council members, Imran Ahmed, general manager at the Long Beach Marriott, concluding our little presentation. We understand open communication and collaboration between hospitality leaders and the city council members is paramount to have a seamless and solid policy.'",
        "'speaker_7': 'Therefore, we stand here before you to provide you with some specific update on how aggressively we acted upon some of the comments that were made here 18 months ago in public comment and what we have done to enhance our employees public safety seminars.'",
        "'speaker_7': 'As Christy already mentioned, one of the ones that was highly, very, extremely well received by our associates was the one recommended by Councilwoman Mongo in self-defense. Over 600 associates attended that in downtown and in Long Beach Airport. Maryanne Panic buttons were issued to all housekeeping associates.'",
        "'speaker_7': 'Unwanted sexual advances by guests. This is something we do not take lightly. Immediately actions are taken, if there are any. Immediately. There has been some overtime concerns that associates have been asked to work overtime. As mentioned, overtime schedule requests are published.'",
        "'speaker_7': 'If any of our associates can work and help us out. They do so. And over time, compensation is paid in accordance to state and federal laws. Retaliation from management towards associates if they complain about something preposterous. Every hotel in Long Beach and around the country has specifically laid out rules and regulations how retaliation is dealt with within'",
        "'speaker_7': 'the hotel industry. And let me take this opportunity, opportunity to read verbatim from ones that we give to our associates. The hotel, and I quote, the hotel will not tolerate against you for filing complaint and will not tolerate or permit retaliation by management associates or fellow associates.'",
        "'speaker_7': 'Let's make no mistake. Safety and welfare of our employees is very important, and we do not take this lightly. We will choose. Hospitality management and are still here after three decades because we are people centric advocates at core.'",
        "'speaker_7': 'Our guests and our employees are why we choose to lead businesses where we could make a difference. 24 seven. 365. Finally tonight, the Hospitality Associates leaders have come together to remind everyone that we do not need a local ordinance to take care of our employees.'",
        "'speaker_7': 'It is what's required of us as supervisors, managers and owners. I thank you once again for giving us the opportunity. Thank you.'",
        "'speaker_3': 'Councilmember, you want to conclude? Okay. I'd like to thank the speakers tonight and all the folks in the audience, the hotel workers who showed up. Appreciate you being here. And also, I'd like to mention that we appreciate that you were here last week and we weren't able to accommodate you speaking.'",
        "'speaker_3': 'But thanks for being here tonight. I guess that's what we might call a concierge service. So I'd like to turn it over to my colleagues. I would ask for your support on this item. Thank you. Thank you. And I'll just.'",
        "'speaker_3': 'I'll just chime in and say thank you, Daryl, for for this presentation this evening and to everyone who works, no matter what you do. We do understand the importance of this industry here. And we want to say that we do appreciate all of you, whether it's you are the people we interact with on a policy level like'",
        "'speaker_3': 'Kristi or our or Jeremy or the people that we know are doing the hard work on the front lines, the housekeepers and the staff that that make sure that people have a great experience and would praise me. And, you know, we just had our My Brother's Keeper summit at Hotel Maya, which is my favorite hotel in Long'",
        "'speaker_3': 'Beach. And I'm not shy about it. You know, we had My Brother's Keeper Summit, and it was great that folks from all across the West Coast received top notch service in a beautiful waterfront hotel. And we felt good about what that represented, that the fact that there's, you know, that we can offer such accommodations with, you know'",
        "'speaker_3': ', with a certain level of respect for our workforce. And so we're really proud. We're really proud of that. And that's something that I take pride in our city. So we have some comments from the city council here. First, we have Councilwoman Price.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. I share your share in your comments. I have to say a very impressive presentation tonight. So thank you for the Hospitality Alliance for organizing it. This group has really impressed me in terms of how they have been able to collaborate together and provide such amazing benefit to the city.'",
        "'speaker_4': 'The first is to the consumer. The the hotels in the city of Long Beach offer, in my opinion, the best service. And they really have stepped it up in the last few years in terms of decor.'",
        "'speaker_0': 'Food.'",
        "'speaker_4': 'Quality, all the things that visitors to the city are looking for in terms of finding a good destination and a a place to stay that is aligned with the quality of the city in terms of what we're trying to strive for.'",
        "'speaker_4': 'And the hotels have really done that. It's a changing industry. It is changing.'",
        "'speaker_0': 'Very.'",
        "'speaker_4': 'Rapidly. And I think our hotels, through this alliance and through their relationship with our business partners, have really done a good job of staying ahead of those trends and making sure that their employees have job security because the hotels continue to do well in terms of attracting clients.'",
        "'speaker_4': 'So I think that's fantastic. I think it's the community involvement in terms of supporting the council districts in every district is also something that I think makes you you don't just say that you're a good corporate citizen in the city of Long Beach.'",
        "'speaker_4': 'You actually live it. You are vested in our community in everything that you do. You support our community events and programs financially and through our volunteer efforts, which are very much appreciated. And I think that demonstrates not just the words that you're a good corporate partner, but that the actions that you participate in support that.'",
        "'speaker_4': 'I think it's important to also note the presentation and the efforts that are being made by the hotel industry to not only retain good employers and good employees, but to be good employers. I think hearing from Jennifer was really eye opening to me.'",
        "'speaker_4': 'Jennifer to me, is is is the model or the story of what we will want for any industry? I mean, I know tonight we're just talking about the hotel industry, but really, when we talk about the relationship of trust that she's built with her employer, the path of upward movement that's been created for.'",
        "'speaker_0': 'Her, the.'",
        "'speaker_4': 'Opportunities to earn more money through over time for her employees that she talked about, that's not available in every industry. So the fact that you make that available to your employees is is definitely something that is, I think, in my opinion, noteworthy.'",
        "'speaker_4': 'And just hearing her talk about her experience from a firsthand personal level is is really impactful for me. You know, I represent a business improvement. A district that is very much thriving. It's a hospitality based industry in that we have lots of food service opportunities and and business owners in that area.'",
        "'speaker_4': 'And I think hearing some of the commitment tonight from the hotel operators and not just hearing their commitment, but seeing the data in terms of everything they have done to provide a safe work environment that provides for upward movement in a supportive environment is something that I would hope every employee in every industry would have the opportunity'",
        "'speaker_4': 'to be experiencing. So I'm grateful for the presentation tonight. I think taking the proactive steps that Imron talked about in terms of some of the concerns that may be raised on a policy issue and addressing those impracticality, I think speaks volumes to your commitment to being a good employer in the city of Long Beach and above all'",
        "'speaker_4': ', just being a good human being to your employees. I think that's really important. I hope that every employee who's in here tonight feels that with their employer, and if not, what I'm hearing and what I know to be true is that we have in the city of Long Beach employers that are very approachable, at least in the'",
        "'speaker_4': 'hotel industry. Not every employee in every category of workforce has those same protections. And I think at the end of the day, that's that's really important to think about, right. If we're talking about protecting employees, why, you know, it's important to look at just your industry.'",
        "'speaker_4': 'But how about employees all over in every industry? So thank you very much for the presentation. I thank my colleague, Councilman Super for sponsoring this item and I'm glad that all of you are here at council meeting tonight.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman Andrews.'",
        "'speaker_6': 'Yes, thank you, Vice Mayor. I looked up at the clock and I said, oh, not another one. It has a quarter to nine. But that's not that's not it.'",
        "'speaker_7': 'So I wanted to see someone.'",
        "'speaker_6': 'You know. I think it was sort of the court. Yes. So I want to thank Mr. Soup enough for bringing this information forward. I also would like to give a special congratulations to the Hilton choir. Keebler will receive an annual award for the CP and for all of the other hotels who participated in my Given with a'",
        "'speaker_6': 'thankful heart. I want to totally, totally thank you for what you do because you are feeding over thousands of people and not just for the sixth District, but that's for the city of Long Beach. And again, I would think all the hotels who come in and help me with that each year.'",
        "'speaker_6': 'Thank you again very much. And keep up the good work.'",
        "'speaker_3': 'Thank you, Councilmember Mongo.'",
        "'speaker_0': 'Thank you. I appreciate that you took the time.'",
        "'speaker_1': '18 months ago to come in and meet and ask serious.'",
        "'speaker_0': 'Questions about the things that you thought the council would recommend to do to meet the needs of the community.'",
        "'speaker_1': 'And for you to put your money where your mouth is and.'",
        "'speaker_0': 'Train 600 individuals on defensive tactics. And then further to hear that you use.'",
        "'speaker_1': 'The same trainer that the sheriff's department uses to make sure that your staff were getting.'",
        "'speaker_0': 'Quality training, not just a fluff course to meet the perception you actually did the real hard work to bring people together. I talk, I go to the hotels regularly, all of them. I noticed.'",
        "'speaker_1': 'In the video that some of the.'",
        "'speaker_0': 'Shots of those hotels are actually older and you've done significant renovations just even in the last three years. If you haven't been to the new Holiday Inn or the.'",
        "'speaker_1': 'New.'",
        "'speaker_0': 'Restaurant on the top floor, those are all huge improvements to the community. When people drive down the four or five freeway, they see that and it is a icon which has a historical relevance and this city and the management of that hotel has chosen to keep it.'",
        "'speaker_0': 'Not all such organizations have done that. They've knocked many of them down. Every hotel in my district has had major improvements in the last three years, and I can tell that when I walk in the door.'",
        "'speaker_1': 'And I think that that.'",
        "'speaker_0': 'Change on the outside creates a place of pride to work for. And I appreciate that you put that money back into the organization. I'd also say that. You're doing an excellent job if you allow.'",
        "'speaker_1': 'People to volunteer for overtime.'",
        "'speaker_0': 'Because in a lot of industries, even in our own police force, we have order in. We have a need. We have fireworks. There aren't enough police officers to we could not hire enough police officers to meet the demand for some of those peak seasons.'",
        "'speaker_0': 'And the seasonality of the hotel industry has some great, great swings in it. And for you to.'",
        "'speaker_1': 'Be able to offer that kind of opportunity for overtime still.'",
        "'speaker_0': 'Is really, really meaningful. And then thirdly, 82% of your employees are Long Beach residents. Mr. West, would you guess that 82% of our own city employees would be Long Beach residents? Because I think that that might exceed our own numbers.'",
        "'speaker_0': 'Would you do we know? Likely. Likely that. That's impressive. That's higher than anything else. We're working on project labor agreements where we're hoping to get numbers that are much lower and we're not even using just Long Beach zip codes.'",
        "'speaker_0': 'We're using the region. So for you to have an 82%, that really speaks to Long Beach residents that are here day in and day out, playing in our parks, going to our schools, their kids are taking care of because their parents have a place to work.'",
        "'speaker_0': 'And that's that's really impressive. So I want to thank you for the work you've done. I think that it really is a a whole story you've presented here today. And thanks for the 4 million increase in tax revenue.'",
        "'speaker_0': 'We really needed it this year. And if you could just give us a little more next year, we have a small deficit we're facing. So let's get those occupancy rates above 80% and give those employees some opportunity for overtime.'",
        "'speaker_3': 'Second, Councilmember Pearson.'",
        "'speaker_1': 'Yes, thank you. And I want to thank my colleague Mr. Super and.'",
        "'speaker_0': 'All Councilmember.'",
        "'speaker_1': 'Super Rubinoff for highlighting what makes my district really awesome is our tourism and our hotels. I want to thank the Hospitality Alliance for coming in and doing this presentation. I think that we, you know, have been having.'",
        "'speaker_0': 'A lot of discussions about how Long.'",
        "'speaker_1': 'Beach has been changing over the last ten years. And we look at the CVB and we look at our hotels and.'",
        "'speaker_0': 'How much tourism is changing. And I'm proud to say that I've had the opportunity to meet several times with not only the CVB, but almost every single.'",
        "'speaker_1': 'Hotel, major hotel in our city, except.'",
        "'speaker_0': 'For one that's in my district to sit down and talk about that conversation. Right. The fact that we've had.'",
        "'speaker_1': 'Workers come and speak and tell one story and we hear another story and we know that the truth often is.'",
        "'speaker_0': 'Somewhere.'",
        "'speaker_1': 'In the middle. Right. We know that. We know that our job as counsel is to hear all.'",
        "'speaker_0': 'Sides and to sit down and have a conversation.'",
        "'speaker_1': 'About what's best for our city. And I think that's what's been great, is that a lot of the hotel management has sat down and said, we hear these concerns, here's kind of where we're at and where we're going.'",
        "'speaker_1': 'And so I really look forward to continuing this conversation and finding out where is that truth in the middle and great that you guys have put in place.'",
        "'speaker_0': 'Some safety measures and.'",
        "'speaker_1': 'Some trainings.'",
        "'speaker_0': 'The fact that we've had you say 606 hundred people attend a safety class. To me, that's a little bit of a flag that says we need this, right? That when we have.'",
        "'speaker_1': 'Housekeepers knocking on bedroom doors by themselves, we need this training. And so thank you for doing that.'",
        "'speaker_0': 'And I hope that we can figure out, you know.'",
        "'speaker_1': 'Where does that leave our hotel workers feeling today? And is there something that needs to move forward to continue their safety.'",
        "'speaker_0': 'That we can assist with?'",
        "'speaker_1': 'I also want to say that I think that that 82 number, that 82% number, is something that is really great.'",
        "'speaker_0': 'When we worked on Measure.'",
        "'speaker_1': 'N in.'",
        "'speaker_0': '2012, that was part.'",
        "'speaker_1': 'Of the the discussion that we have hotel companies that come in our city and are great and they give us great numbers in total. I'm super glad to see those numbers on the rise, but that we know whenever we pay a hotel worker a dollar and a living wage, that's $3 back in our community and we've seen'",
        "'speaker_1': 'our communities change in the last ten years. And so I really want to thank the hotels for for being here, for being good partners. I haven't had the chance to have you guys volunteer in any of our CD2, you know.'",
        "'speaker_0': 'Clean ups or anything like that.'",
        "'speaker_1': 'So I look forward to that in the future. I think our industry is really strong. I know we have a lot of discussions about new hotels coming to the city, particularly in my district, and some conversations around the top.'",
        "'speaker_1': 'So I look forward to having those conversations.'",
        "'speaker_0': 'With you as well as talking about.'",
        "'speaker_1': 'The industry and the health of our employees that are in the in that industry. And I know that some of the hotels you highlighted up here are also my favorites, the Maya.'",
        "'speaker_0': 'And that you guys have done a really great job of partnering with your employees and hearing from them.'",
        "'speaker_1': 'And so I look forward to some more of that discussion in the future. And again, I want to thank my colleague for bringing this discussion up because it was.'",
        "'speaker_0': 'Part of one of the things that I wanted to bring up.'",
        "'speaker_1': 'And have just this very conversation about the health of our industry and how strong it is right now. So thank you, everybody.'",
        "'speaker_0': 'I'd also like to to say one last thing. A lot of folks know in the room that I probably more.'",
        "'speaker_1': 'Than maybe I think was a.'",
        "'speaker_0': 'Hotel worker. As I write, Councilmember Andrews understands the industry probably more than anybody. But in my nine.'",
        "'speaker_1': 'Years of working with hotel workers, I had the opportunity to do a.'",
        "'speaker_0': 'Day in the life to go.'",
        "'speaker_1': 'In and kind of see what it's like to be a hotel worker. And so.'",
        "'speaker_0': 'I encourage anybody that has.'",
        "'speaker_1': 'That opportunity to do that. And maybe some of hotel management would be open to having us do that with you guys so we can see what it's like to to be in the industry. So thank you.'",
        "'speaker_3': 'Thank you. And Councilmember Durango.'",
        "'speaker_7': 'Thank you, Vice Mayor. You know, one of the things that the Councilmember Pearce brought up was a measure in and I remember that discussion and how divisive it was back in the day about raising the minimum wage of hotel workers to put 1250 or something like that.'",
        "'speaker_7': 'And it was you know, it was very tough and we had to go to the ballot and it won. And one of the reasons why I think that a lot of. Workers living in Long Beach just because of that.'",
        "'speaker_7': 'So I remember basically saying that, you know, the raising the minimum wage is not going to be, you know, the sky is falling. In fact, they probably help our industry because happy worker is it makes for a happy visitor because everybody is just working together to make things better for for the tourism industry.'",
        "'speaker_7': 'I don't have hotels in the seventh District, but I'm sure that they do have a lot of people who live in the seventh District. And I'm sure that having that that salary helps them stay there. And I'm hoping that the hotels, as we move forward, that there would be more opportunities for the management to talk to their'",
        "'speaker_7': 'employees and help them help them get to that place where they would be able to have a living wage so that they can have their families and send their kids to school here in Long Beach, because we have a great educational system, as we know, with the college promise and all the other great institutions that we have'",
        "'speaker_7': 'in Long Beach. So it's a wonderful place to be. And that's because of our salaries, because they're competitive and the sky did not fall. In fact, if these statistics that I saw today are any indication, we're getting better and we're and we're growing.'",
        "'speaker_7': 'And I accredit that a lot also to the to our CVB for going out there and hustling conventions to come to Long Beach and and people who come to LA, which has a great experience to stay in our hotels and enjoying our restaurants and, and being able to have that great experience that we all want everybody to'",
        "'speaker_7': 'have who visits Long Beach. And I think it's part of part of that. And so if we continue to make our employees happy, everybody gets happy and everybody can can live a full Cleo cliche and a wonderful life in Long Beach.'",
        "'speaker_7': 'So I want to thank you, Superar Councilmember, for bringing this forward. It's a discussion that we need to have, a discussion we're going to have again as we move forward. I think it's a is still some consideration. I have I have I've had some a I have two, two members of my family who work in the hotel'",
        "'speaker_7': 'industry. And so I'm somewhat aware of what takes place. And one of the big issues right now is the homeless impact in the hotels and some of the safety issues that that come with that. So I'm hoping that perhaps we can get together and develop a plan or a strategy to address that.'",
        "'speaker_7': 'I know it is. It's citywide, it's regional, there's regional wide as well as how we handle our homeless situation. But when they start affecting our tourism and they start affecting our hotels, that means that we better start getting together and address it in a way that is going to make a significant impact.'",
        "'speaker_7': 'And being able to minimize the impact of homelessness in in our hotel industry and especially especially in the in the downtown area. So thank you for the chamber coming forward. Hotel Maya. Yeah, doing good food out there for a while.'",
        "'speaker_7': 'Going there all the time. But thank you for being here.'",
        "'speaker_3': 'Thank you. That concludes city council comment. And as this presentation was placed on the agenda, we do need to do public comment here. So as any public comment on item number 31, please come forward. Thank you. Just state your name.'",
        "'speaker_3': 'You have 3 minutes.'",
        "'speaker_1': 'So good evening, Vice Chair.'",
        "'speaker_0': 'Long Beach.'",
        "'speaker_1': 'Council Members My name is Alexandra Wayman. I am a research analyst with Unite Your Local 11, the Hotel and Restaurant Employees Union, representing over 25,000 members in Southern California and Phenix, Arizona.'",
        "'speaker_0': 'We agree that, though, that the Long.'",
        "'speaker_1': 'Beach hotel industry has been thriving with huge successes in 2016, which have carried through to 2017.'",
        "'speaker_0': 'The Long Beach Business Journal.'",
        "'speaker_1': 'Reported at the end of last year that 2016 was the best year ever for the tourism and hospitality industry in Long.'",
        "'speaker_0': 'Beach. It is estimated that the.'",
        "'speaker_1': 'Hospitality industry generated $300 million in economic impact to the city.'",
        "'speaker_0': 'As well as $26.6 million.'",
        "'speaker_1': 'In total for the city's general.'",
        "'speaker_0': 'Fund. The downtown Long Beach economic profile, which was created by the city of Long Beach, stated that Long Beach hotels are.'",
        "'speaker_1': '14% increase in occupancy rate.'",
        "'speaker_0': 'From 2010 to 2016, and a 12% increase in total from 2016 to 2017. The Long Beach Business Journal reported.'",
        "'speaker_1': 'In June of this year.'",
        "'speaker_0': 'That the occupancy.'",
        "'speaker_1': 'Rate of downtown Long Beach hotels was 88.7%.'",
        "'speaker_0': 'According to a study done by CBRE Hotels. That's 7% higher than the national average.'",
        "'speaker_1': 'It's reported.'",
        "'speaker_0': 'That 6.8 million people attended attractions.'",
        "'speaker_1': 'Fairs and festivals and.'",
        "'speaker_0': 'Large conventions were booked in 2016 and 2017. It is the work of people like our.'",
        "'speaker_1': 'Members at local level and the people that work in the hotels that make this industry very successful. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening. My name is Natalya Soto. I have worked in the hospitality industry here in Long Beach for about four years now at the same hotel. And yes, it's true. As I started working there, I remember starting as a buster and they had to close a restaurant for dinner where I worked because a business wasn't good.'",
        "'speaker_0': 'And slowly but surely, we started gaining momentum again. And it's it's thriving. So much so that in the last this last summer, I have voluntarily worked about 12 to 14 hour days because it's available to me. Right. But the policy that we have been talked about and it's being talked about here, it's not just about I'm trying'",
        "'speaker_0': 'to gather my thoughts because so much was said that I just feel I'm angry. We talked about the voice of the worker. We talked, you know, super. Now, thank you for mentioning that. We came last week to speak, but we were not given a floor to speak until public comment.'",
        "'speaker_0': 'And we are the people that make this industry run. I am happy every day to get up. It's something I love to do. I went to school for culinary arts and business management and it's what I love. I love to serve the guys.'",
        "'speaker_0': 'I love the Long Beach tourism industry. I resign in Long Beach. I live in Long Beach as well as my coworkers. And it's true. The money that I make in the hotel that I work is a money that I spend in the city that I live.'",
        "'speaker_0': 'It's the money that I spend to pay for my mortgage and the taxes in the home that I own in the ninth District. Hotels have been so successful. Like I said, that it has increased my workload. We work harder to make sure that tourism industry continues to thrive.'",
        "'speaker_0': 'People come back and they are like Nevada. It's nice to see you. I recognize guests now that come year after year and they're happy to see our faces. Our policy is about protecting our workers, not about anything else.'",
        "'speaker_0': 'It's about protecting us. We're not asking for anything crazy. We're not asking for, you know, a raise is like measure. And we're not asking for something that's intangible. We're asking for protection over sexual abuse and overbearing workloads. We're not asking for anything crazy.'",
        "'speaker_0': 'And the pushback to me is outstanding. I don't understand it in this industry and in this day and age in 2017, why is there pushback? And we have to think about it when the numbers show that measure. And there was a pushback.'",
        "'speaker_0': 'And now two years later, clearly because of measure and and policies like that, we are thriving here in Long Beach and we're doing better. You know, I feel like people fear change. But this is not something to fear.'",
        "'speaker_0': 'This is something that we need to move forward on.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Yes, I'm Amy BARTOLONE.'",
        "'speaker_1': 'Born and raised native here in Long Beach. I'm in District seven in the west side of Long Beach.'",
        "'speaker_0': 'I have worked at the Hyatt Regency, Long Beach for ten years. I have birth this child through health insurance, through Kaiser for ten years. Within those ten years, 911 happened. We all know the business, the hotel industry. It plummeted.'",
        "'speaker_0': 'No one was checking and no one was traveling. Everyone was in fear of traveling. And I saw it firsthand at the front desk. And now, as the renovation of the beautification in downtown Long Beach here.'",
        "'speaker_1': 'How everything is so beautiful. Convention center is booming, Hyatt's booming.'",
        "'speaker_0': 'The other hotels, Hotel Maya is booming. This is Zora, by the way. The hotel has been booming. The industry has has definitely increased. However, with that increase meant I have worked six days ever.'",
        "'speaker_1': 'Since, like probably couple a month or two now since it's been so busy. It's an immense amount of population and we're.'",
        "'speaker_0': 'So short staffed.'",
        "'speaker_4': 'And I don't.'",
        "'speaker_0': 'Understand how this is happening, how they're bringing in all of these businesses. But like the workers, we're cleaning more rooms than ever. For the housekeepers, the front desk is short.'",
        "'speaker_1': 'Staffed, even other outlets are suffering.'",
        "'speaker_0': 'And so this government that we're the suffrage that we're going through, we feel it. I feel it.'",
        "'speaker_1': 'I love my city. I go to school.'",
        "'speaker_0': 'Here, born and raised here. You guys need to do something in regards to the hotel workers if even if it's bringing a new hotel and promised the hotel workers in itself to please keep them. Firsthand, because I'm a I'm born and raised in Long Beach and it's.'",
        "'speaker_1': 'Just crazy how people.'",
        "'speaker_0': 'Just forget about the hotel workers and sometimes forget about just working hard. And so living. So thank you. I just wanted to say that.'",
        "'speaker_3': 'Thank you for your testimony. Next speaker, please. Good evening, Mr. Vice Mayor. Members of the City Council, Craig coaching with the downtown Long Beach Alliance. I want to thank the Hospitality Alliance for bringing today's presentation to your attention and certainly to ours as well.'",
        "'speaker_3': 'When it was first seeing it, when it was first formed about a year and a half ago, we had early discussions on how we could play a role and certainly the downtown Long Beach Associates as a business improvement district for downtown I have that has been working with that hospitality industry, the restaurateurs as well as the hoteliers'",
        "'speaker_3': 'for many, many years and since the hospitality alliance has come to fruition and really taken a leadership role in identifying the issues that it's facing. We've had these ongoing discussions relative to safety and security. Our downtown guides work very closely with the Downtown Security Alliance.'",
        "'speaker_3': 'A security alliance was developed for purposes of working with different security companies and for security measures with the private, private sector. That's the hoteliers. That is the restaurant tourists. That's the class-A Class B and Class C buildings downtown that do have their own security teams.'",
        "'speaker_3': 'So we interface with them. We we exchange information with them. We meet with them on a regular basis, and that is in concert with the police department. So this is an organization that we have taken steps outside of our normal public realm responsibilities and really stepped into the private sector opportunities to talk with them, to talk about'",
        "'speaker_3': 'these issues that they're facing on an individual basis and really looking at common denominators across the board. So whatever issues that are facing there are faced with these with these establishments, we want to be able to address them on an ongoing basis.'",
        "'speaker_3': 'And it's something that we have taken very much pride in and certainly taken policy at work rather rather than just ignoring them. So again, the business improvement district is at the forefront. It is working with these private sectors as well as the the companies that they're working with to bring a safer and certainly more advanced downtown to'",
        "'speaker_3': 'our entire community. Thank you. Thank you for your testimony. Next speaker, please.'",
        "'speaker_7': 'Good evening. My name is Hamid Raza. I'm at the Long Beach Marriott. I'm not a good speaker, so. Excuse me. Just wanted to address the concern. Just the. The lady is for the kid that she's working for the Long Beach Hyatt.'",
        "'speaker_7': 'And, you know, we love accolades. We love all the employees as as a hotel. I'm the CFO at the Long Beach Marriott. So health is a union hotel. They do not follow them. By the way, Councilman Tonga, the minimum wage is about $11 and something since they let one in $14.25 US nonunion hotels, we are 100% full'",
        "'speaker_7': 'measure and we are increasing the wages 2% every year. Right now it's I think 1428 but union veteran not trying that they're paying the payments. The waiters, they're making $11 an hour. You know, how come my question to you guys are, how come unions are not following the minimum wage?'",
        "'speaker_7': 'You are saying that, you know, are everybody, all the employees are benefiting from measuring? That's incorrect. The people who are working for the Union Hotels, they're not making 14, 28 an hour. They are making $11. And sometimes I would say less than that, you know, so the anybody any hotels, a union hotel, that's why she has a'",
        "'speaker_7': 'safety concern, because they might not have attended all those safety trainings we offered because they don't care. They are Union Hotel. They are exempt. They can do whatever they want. They can make them 14 hours a day. That poor lady was working.'",
        "'speaker_7': 'Get here 14 hours a day. None of my employees work more than 8 hours if they want to. If they choose to work, they can work maybe an extra hour, you know. But, you know, if you're a union, how come you give them a clear check?'",
        "'speaker_7': 'Go ahead. You can make them in three rooms, you know, is that what we are looking for? Is that for the benefit of the people or is it hurt for some specific group are offering your services too. So so I just wanted to answer that that she is the Hyatt is a union hotel.'",
        "'speaker_7': 'That's why they can do whatever they want because any ordinance you guys pass, there is an exception in there that union hotels are exempt from merger and or any measure you pass. So please go back to where everybody is equal.'",
        "'speaker_7': 'All the employees we take care of every one of them. I take care of them for their safety, for their security. You know, the minute somebody complained, this person told me this, we expel that guest from our hotel.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'Thank you. And that concludes public comment. Thank you, everyone, for for attending. And I do want to clarify a measure in was passed by voters not a city council ordinance just let's clear the voters Long Beach adopted measure in so so at this point members okay we have one more person Councilwoman Mongeau.'",
        "'speaker_1': 'Since you mentioned that measure was passed by the voters, would it be a possibility up to this board to ask all hotels.'",
        "'speaker_0': 'To pay the same rate? I know that the measure and give an exemption, but I mean, I hope that when the.'",
        "'speaker_1': 'Groups come back to this body over the next several weeks that those.'",
        "'speaker_0': 'Hotels can choose to pay more and they.'",
        "'speaker_1': 'Can negotiate with their their labor groups to offer them that opportunity, because that that seems just unfair, that they're not getting that, especially if the discrepancies are no.'",
        "'speaker_0': 'Longer there. When I saw the board, it says that they're getting medical and and days off and sick days and all of that with the new state law. So I'd be interested in more information on that at a future date.'",
        "'speaker_3': 'Councilman Pearce.'",
        "'speaker_1': 'I don't want to carry this on too long, but I do want to answer the question in two ways. One, for any changes to be made to measure, I would have to go back to the voters to when it says union exemption, it's given to that hotel for those workers to make a decision if they want to'",
        "'speaker_1': 'unionize or not. And then there's a process of negotiation where they negotiate their wage and their benefits, just like we do at the city. I think if we continue to have these conversations, it would be really beneficial to not just kind of put numbers out.'",
        "'speaker_0': 'There and make assessments, because I've talked to.'",
        "'speaker_1': 'Many Hyatt workers that make 15 an hour and above. So if we do this, we just need to have these conversations in real numbers and have reports on what. And I don't think that wages are actually anything that anybody's talking about, but I just want to make sure that it's rooted in fact and not some assumptions.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'I'd be happy to sit down and learn more about that, because I think that what they were being talked about was the minimum. And I know the.'",
        "'speaker_1': 'At every location in any employer, there's people.'",
        "'speaker_0': 'At the bottom and there's all the strata of all the way up to the top. Similarly to Jennifer climbing her way to the top. So learning about that. Think you.'",
        "'speaker_3': 'Thank you, members. Please cast your vote. Yes. This has received far.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you. So we will move on from the less controversial item of the night. So next, we will move on to our consent calendar. And that is except item number 13. We're going to hold that back so that we can we can discuss that item so we can pull up the consent calendar.'"
    ],
    "Recommendation to authorize City Manager, or designee, to accept $5,000 in award funds from the Institute of Museum and Library Services, for being the recipient of the 2017 National Medal for Museum and Library Service; execute any documents necessary for the administration of this award; and  Increase appropriations in the General Grants Fund (SR 120) in the Library Services Department (LS) by $5,000, offset by award revenue.  (Citywide)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you, Madam Clerk, please read item 13.'",
        "'speaker_2': 'Please report from Library Services Recommendation to accept 5000 in award funds from the Institute of Museum and Library Services for being the recipient of the 2017 National Medal for Museum and Library Services Citywide.'",
        "'speaker_3': 'Thank you. And we'll we'll have a staff report and so Glinda so Mr. city manager the floor.'",
        "'speaker_6': 'So mayor vice mayor council members thank you very much for this opportunity. We just want to highlight that our city library system has participated in the 2017 National Medal System for museums and Library Services across America. We're just notified that we were one of the top five library systems in the entire United States, so that I'm going'",
        "'speaker_6': 'to turn it over to our excellent library director to tell us what that means. Glenda, where to go?'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson, City Council, and thank you both for those kind words. Good evening, everyone. The 2017 National Media Medal sorry for museum and library service is the nation's highest honor given by the federal government and recognizes the extraordinary civic, educational and economic contributions of your Long Beach Public Library to our community.'",
        "'speaker_0': 'This award also celebrates our significant community partnerships with Long Beach Unified School District, the YMCA, Early Childhood Education and Safe Long Beach, just to name a few. I also thank the Long Beach Public Library Foundation for funding our Family Learning Centers, studios and other initiatives.'",
        "'speaker_0': 'I was able to attend the award ceremony last month at the National Archives Museum in Washington, D.C., with community member Bryant Beane, who volunteers his time to teach camera classes on Saturdays at the Mark Twain Library. Please see your program booklet for more information.'",
        "'speaker_0': 'In addition to the National Medal, we can receive a $5,000 award, which is on tonight's Agenda for Your Consideration. I was deeply honored to accept this medal on behalf of the women and men of the Long Beach Public Library.'",
        "'speaker_0': 'It is a testament to the services and resources that they provide to our residents every day. I also greatly appreciate your support of our department that drives our commitment to help our residents reach their personal and educational goals.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you. And before we go to city council, I'll just so I see that there was a request for the Library Foundation to speak. I think we can take that now before we open up city council comment.'",
        "'speaker_0': 'Good evening. Thank you for the opportunity to speak.'",
        "'speaker_1': 'My name is Kate Islam, the executive director of the Library Foundation. For 20 years, our sole mission has been to advocate for and raise funds.'",
        "'speaker_0': 'For.'",
        "'speaker_1': 'The Long Beach Public Library. Over those two decades, we've had the pleasure of working side by side with the talented men and women of our libraries. These library staff members have dedicated their lives to improving literacy.'",
        "'speaker_0': 'In Long Beach through winning this.'",
        "'speaker_1': 'Prestigious award, which they very much deserve.'",
        "'speaker_0': 'They've won this prestigious award because.'",
        "'speaker_1': 'Of their programs that serve youth families, veterans, seniors, the disabled and everyone.'",
        "'speaker_0': 'In between. Our library staff are truly.'",
        "'speaker_1': 'Worthy of this National Medal for Museum and Library Services and this recognition from the city council. I appreciate it. Thank you to all the staff of the Long Beach Public Library for all your hard work every day serving our community and to the board and staff of the Long Beach Public Library Foundation, as well as our donors'",
        "'speaker_1': 'and the library patrons. We couldn't be more proud of you all. We should all be very proud of.'",
        "'speaker_0': 'This recognition, this national.'",
        "'speaker_1': 'Recognition. And I'll take great pride in what our libraries have turned out to be. Thank you.'",
        "'speaker_3': 'Thank you. So I'll offer my congratulations. So, you know, since we've had the new Michelle Obama Neighborhood Library, I've experienced firsthand the transformative power the libraries have on a community. So and I can tell that it's really a true partnership.'",
        "'speaker_3': 'It's not just, you know, just just Glinda alone. This is, you know, her entire staff, the librarians, the foundation, the donors, the friends, all these people work really closely together to make sure that we have a quality, well-funded, well supported library.'",
        "'speaker_3': 'And so this is congratulations, well-deserved. There's a whole list of of council members who like to speak on this. We'll start with the maker of the motion, Councilwoman Price.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. I completely agree with those comments. Congratulations to you, Glenda, and your entire team. I think that we are very fortunate because we have the foundation who's so actively involved. And but for the foundation, the our ability to be able to progress with our library services would would be significantly hindered because they are'",
        "'speaker_4': 'a really a great ally and partner and really part and parcel of the success of the of the program that we have here. I'm you know, everybody knows I'm a huge supporter of of the libraries, my my kids and I often go to the Sunday library hours.'",
        "'speaker_4': 'And today my son was at the Michelle Obama library actually, because three books that I reserved online were not available at my local library. So he went there and sent me pictures and was loving it. So I think I think it's fantastic that we can use the technology to find out what our library has and be able'",
        "'speaker_4': 'to expose our kids and people of all ages in the city to the great services. I will say I'm not sure where that $5,000 is going, but I having spent a lot of time on our website, I think there's some opportunities there to make it more user friendly in terms of where what book you're requesting and where'",
        "'speaker_4': 'you want it sent and when to go and pick it up. It's not it's not as easy to figure out as one would predict. And I say that from my own personal experience, trying to figure out the site.'",
        "'speaker_4': 'So maybe doing some application based upgrades might be good because I think that'll make us even even better and more prepared for the trends in library services. And it'll get us really ready for main library when it opens so that we can really showcase our offering.'",
        "'speaker_4': 'So congratulations to in your team. This is amazing. It gives me a great pride to have a library that's a national awardee in our city. So thank you very much.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_5': 'Thank you. And I'll be short as usual. But I do wanted to offer my congratulations to Glenda and the Library Services Department and are your supporting cast of The Friends, the Foundation. Library Foundation and the patrons who throughout the city who patronize the library.'",
        "'speaker_5': 'Obviously, our library services are doing great work and they're getting a recognition that this council already knew that you were already one of the best. And this is why we continue to to support our libraries with the budget, and we will continue to do that.'",
        "'speaker_5': 'I again wanted to just offer my congratulations and keep up the great work.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'What a great honor it is when you read through this. Picture of you in the in the handout. It really talks about the amazing things that your team are doing, and we really appreciate that. I, too, have checked in and out some books lately.'",
        "'speaker_0': 'I use the online digital library as well, but I use it for audiobooks. And so it is always just so easy and convenient to download them right there. And I never have to.'",
        "'speaker_1': 'Even go to a library to pick.'",
        "'speaker_0': 'Them up though. I have picked up a few that you did not have an audiobook version. I'm just.'",
        "'speaker_1': 'So proud of you and all the things you're doing and to see the collaboration across with.'",
        "'speaker_0': 'Nonprofit partners in a meaningful way. We as a council didn't have to ask you to do that. We didn't have to come up with a process for you. You guys just went out there, and the good work of the librarians and their relationships have been so strong.'",
        "'speaker_0': 'So congratulations to you and all of them.'",
        "'speaker_3': 'Thank you. Councilmember Pearce.'",
        "'speaker_0': 'Yes. I also wanted to.'",
        "'speaker_1': 'Echo the same and just say that it even highlights more the fact that libraries are the core of our communities. I drove by Alameda Library the other day before it opened and there was a line outside of a library in the middle of the day.'",
        "'speaker_1': 'I loved.'",
        "'speaker_0': 'It.'",
        "'speaker_1': 'I might have known half the people in that line. But it's great to see the partnership. It's great to be able to see so many advocates on council for more library access. I know I grew up going to a library and never having books that we owned in the house, but only library books.'",
        "'speaker_1': 'And I look forward to hopefully getting to a place where we can have more access to libraries for all of our youth. So thank you guys very much. And congratulations, everyone.'",
        "'speaker_3': 'Thank you, Councilmember Sabrina. Thank you. And congratulations. I did want to give a shout out to fourth district resident Bryant Ben, who went back to Washington to receive the award with Glenda Williams. And we actually featured you two in our July 28th newsletter, complete with a link to the video where you get the award from Cokie Roberts'",
        "'speaker_3': '. So if you'd like that link, just contact our office. And Bryant is a fourth District resident, but he conducts his program in the sixth District. So I have to talk to Mr. Andrews about that. Thank you. Thank you.'",
        "'speaker_3': 'Councilmember Urunga.'",
        "'speaker_7': 'Thank you, Vice Mayor. I had the honor of attending a foundation event that earlier this summer, and I was when I was told that the library had won its war. And being there, I saw so many librarians attending that event.'",
        "'speaker_7': 'And that is where the rubber meets the road. It's with our librarians and the great work that they do, working with our kids, working with our adults, making sure that the programs are in place, and making sure that all the materials are readily available and can be found.'",
        "'speaker_7': 'So I want to congratulate not only Library services England Garland, of course, as their leader, but all the librarians who work in our system. Congratulations to all. You earned it.'",
        "'speaker_3': 'Thank you. Councilman Gonzalez.'",
        "'speaker_4': 'Congratulations as well. I think this is an.'",
        "'speaker_1': 'Amazing success with.'",
        "'speaker_4': 'Both in partnership with.'",
        "'speaker_1': 'The foundation.'",
        "'speaker_4': 'And our library. And just reading, Glenda, your.'",
        "'speaker_1': 'Quote that we also.'",
        "'speaker_4': 'Want to go beyond our walls to meet them in the community, I think is is definitely what the Long Beach libraries do, is going out in the community to ensure that.'",
        "'speaker_1': 'Kids everywhere around the city are able to check out books, but also have that whole.'",
        "'speaker_4': 'Experience. And your Instagram is the best.'",
        "'speaker_1': 'Because I love the book Face Thursdays or whatever you do. It's another way of engaging our residents.'",
        "'speaker_4': 'So thank you all.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Councilmember Angel. Yes. And again, I want to just give our kudos to you, the fine work that you're doing, because you find out in certain areas where kids will never get a chance to fly, go anywhere with a book, will take you all over the world.'",
        "'speaker_6': 'And I want to thank you again for giving us that opportunity, you and your staff. Congratulations again.'",
        "'speaker_3': 'Thank you. And once again, congratulations to everyone on this well-deserved award. Is there any public comment on item number 13? Seeing nonmembers, please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you. At this time, we'll we'll go ahead and take up our budget hearing. Madam Clerk, you want to read that?'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing and grant an Entertainment Permit with conditions on the application of Toshco, LLC, dba The Good Bar and Eatery, 3316 East 7th Street, for Entertainment Without Dancing.  (District 2)": [
        "'speaker_2': 'Madam. Item to, item to.'",
        "'speaker_3': 'Let's have item number two.'",
        "'speaker_2': 'Please report from financial management recommendation to receive supporting documentation into the record to conclude the hearing and grant an entertainment permit with conditions on the application of the good bar and eatery at 3316 East Seventh Street for Entertainment Without Dancing District two.'",
        "'speaker_3': 'Thank you, Mr. City Manager.'",
        "'speaker_6': 'Our Deputy City Manager.'",
        "'speaker_3': 'We have an oath right now. City Attorney. I'll give that to Kevin.'",
        "'speaker_6': 'Okay. Kevin Okay. Got it.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_3': 'Vice Mayor. Thank you.'",
        "'speaker_7': 'City Manager West We before we get started, like to have the clerk administer the oath on the side.'",
        "'speaker_2': 'Can the appellants please stand?'",
        "'speaker_5': 'Thank.'",
        "'speaker_2': 'Do you and each of you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so.'",
        "'speaker_0': 'Help you God.'",
        "'speaker_7': 'Okay. Thank you, city clerk. The staff presentation tonight is going to be delivered by Miss Sandy Palmer, purchasing and business services manager for the Financial Management Department. I'll just turn it over to Sandy.'",
        "'speaker_1': 'Good evening, Honorable.'",
        "'speaker_0': 'Vice Mayor and members of the City.'",
        "'speaker_4': 'Council. Tonight you have.'",
        "'speaker_1': 'Before you an.'",
        "'speaker_0': 'Application.'",
        "'speaker_4': 'For Entertainment Without.'",
        "'speaker_0': 'Dancing for Toshiko LLC. Doing business as the good bar and eatery located at 3316 East Seventh Street operating as a bar tavern lounge in Council District two. All the necessary departments have reviewed the application and are provided their.'",
        "'speaker_2': 'Recommended conditions as.'",
        "'speaker_1': 'Contained in the hearing packet.'",
        "'speaker_0': 'I, as well as the police department, stand.'",
        "'speaker_2': 'Ready to answer any questions.'",
        "'speaker_1': 'Council may have, and that concludes staff's report.'",
        "'speaker_3': 'Thank you. Was there any public comment on this hearing? Now will be the time to come forth. Thank you. State your name. You have 3 minutes to address the council. Sure.'",
        "'speaker_6': 'My name is Andy Carter. I'm one of the partners and owner of the Good Barn Eatery. This is my business partner, and he's also a business owner of the Good Barn Eatery with his mom. That's right up there.'",
        "'speaker_6': 'She's one of our business partners and his wife. We are Long Beach residents, born and raised, went to school here, went to college here. Now we have some small families here. We have multiple businesses here. Him and his wife also on a very successful salon, but I'm not sure.'",
        "'speaker_6': 'My wife and I are on a speech pathology clinic up in Bixby because we have one in Garden Grove as well. I own a real estate investment holding company and we just love 100. So we spend all the time, all our money in Long Beach.'",
        "'speaker_6': 'We're just super grateful to have the opportunity to have this like wonderful places. But since early sixties, you know, just kind of continue. It wasn't the nicest place in the neighborhood for a long time. We busted our butts and got it really cleaned up and made it really nice.'",
        "'speaker_6': 'We actually went out and got some really nice chefs from Long Beach to kind of come in and do all of our consulting for our menu. And all of the neighbors are thrilled because they wouldn't go in there before it, and now they're in there maybe once or twice a week.'",
        "'speaker_6': 'So it's been really nice.'",
        "'speaker_3': 'Does he do anything.'",
        "'speaker_6': 'That, you know, they had an entertainment.'",
        "'speaker_3': 'License there since the beginning, and we're just trying to continue on. Unfortunately, entertainment licenses are not grandfathered in and it's a new license every time we've had it for just a little over a year. And we're looking forward to providing a place for music and entertainment for Long Beach, which I think Long Beach really needs more places'",
        "'speaker_3': 'like that. And right now, is it a good bar? Okay. Councilmember Pierce.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'I thank you guys for coming tonight. I used to live across the street from the bull bar. Yes. So I did dare to go in. Right. And I have been in your establishment several times. The Seventh Street Collaborative actually holds their meetings there.'",
        "'speaker_1': 'And you guys have done a fantastic job with programing, with food, with everything. And so I wholeheartedly support this and look forward to seeing you guys continue your success.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_7': 'Thank you. Thank you, Councilwoman Gonzalez.'",
        "'speaker_0': 'Collect to see.'",
        "'speaker_4': 'People from Long Beach, you know, investing and continuing to invest. So I'm sure you'll do great.'",
        "'speaker_1': 'And great success to.'",
        "'speaker_4': 'You. Congratulations.'",
        "'speaker_3': 'Thank you. Thank you. So I probably should have closed the hearing before they spoke, but the hearing is now closed. Thank you. So seeing no further public comment or council comment members, please cast your vote.'",
        "'speaker_0': 'Motion case.'",
        "'speaker_3': 'Congratulations. Thank you, Madam Clerk. Let's move to item number 16, please. Now, let's do public comment. Let's do public comment. Beginning of the council meeting. So we have a number of speakers here. I'm not sure who's still here, but we'll go ahead and read through the list.'"
    ],
    "Recommendation to declare the City-owned property located at 1675 Santa Fe Avenue, Assessor Parcel Number 7432-006-914 as surplus; authorize City Manager, or designee, to execute any and all documents necessary, including a Purchase and Sale Agreement, with Woodcliff Corporation, a California corporation, or Assignee, for the sale of the Subject Property in the amount of $1,200,000; and, accept Categorical Exemption CE 17-168.  (District 1)": [
        "'speaker_3': 'What a fantastic conclusion of public comment. Thank you so much, Zoe. So at this point, we'll move forward. We have item number 16. Madam Clerk, would you please read.'",
        "'speaker_2': 'A report from Economic and Property Development recommendation to declare the city owned property located at 1675 Santa Fe Avenue as surplus and execute any and all documents necessary with Wood Cliff Corporation for the sale of subject property and the amount of 1.2 million.'",
        "'speaker_2': 'District one.'",
        "'speaker_3': 'Now there's a bunch of these, right? There's more than one. Is it possible to like. Councilwoman, you wanted to speak to all of them at once? Yes.'",
        "'speaker_7': 'Just know we're going to have to take them each individually on the sale and the vote.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Well, I was just thinking the comments.'",
        "'speaker_1': 'Right. That's fine.'",
        "'speaker_4': 'The comment?'",
        "'speaker_0': 'Yeah, well, no.'",
        "'speaker_3': 'I think. Councilwoman, you've got the.'",
        "'speaker_4': 'Floor.'",
        "'speaker_1': 'Thank you. Well, Sergio, if we can go over just a quick staff report on this particular.'",
        "'speaker_4': 'Location, I just want to make sure.'",
        "'speaker_1': 'I'm wrapping my head around what will be happening there.'",
        "'speaker_6': 'Sergio Ramirez. Thank you. Good evening, Vice Mayor and honorable council members. The this item and.'",
        "'speaker_7': 'Actually the following three items pertain to the disposition of successor agency properties. As you know, we are in the process of selling former RTA properties per the Longreach Property Management Plan. These properties were taken out to RFP back in March 2016 but unsuccessfully sold in that time.'",
        "'speaker_7': 'Subsequently, the properties were assigned to Leon Associates, a professional real estate brokerage firm, for the solicitation of offers via the open real estate market. The subject property before you is approximately 38,000 square foot lot 1675 Santa Fe and is owned industrial Leon Associates received an offer for 1.2 million from Wood Cliff Corp. for the development of an'",
        "'speaker_7': 'industrial incubator industrial complex.'",
        "'speaker_6': 'By the site.'",
        "'speaker_7': 'If approved, the plans will be submitted to development services for approval through the city's entitlement process. And we recommend approval of the disposition.'",
        "'speaker_0': 'Thank you. I just had a question as to what.'",
        "'speaker_1': 'We what we're defining as incubator spaces is.'",
        "'speaker_7': 'Definitely the the applicant has has agreed to try to promote the sale or lease of these spaces in compliance with the livable well West Long Beach implementation plan to try to encourage entrepreneurs and startups for these spaces.'",
        "'speaker_0': 'Okay, great.'",
        "'speaker_1': 'So it is what I'm thinking. It's an entrepreneurship incubator and from what I understand, I think would Cliff is the same.'",
        "'speaker_0': 'Group who constructed the Michelle Obama library.'",
        "'speaker_7': 'That is correct. The owner of Wood Cliff is actually a developer, a contractor, general contractor.'",
        "'speaker_6': 'And acted as a general contractor for the Michelle Obama Library.'",
        "'speaker_0': 'Wonderful. Okay, great. Thank you.'",
        "'speaker_1': 'Very much. I appreciate the work on this.'",
        "'speaker_3': 'Fantastic. Is any public comment on item number 16 saying nonmembers, please cast your vote.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents, and any needed subsequent amendments, with the Department of Defense through the Office of Economic Adjustment, to accept funds totaling $1,342,406 funded by the Community Economic Adjustment Assistance for Reductions in Defense Industry Employment, to continue implementation of a project that addresses the economic and workforce impact of the C-17 plant closure; execute an agreement, and any needed subsequent amendments, with project partners in the amount totaling $1,125,000, for the period of January 1, 2017 through December 31, 2017; and  Increase appropriations in the Community Development Grants Fund (SR 150) in the Economic and Property Development Department (EP) by $1,342,406, offset by grant revenue.  (Citywide)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Next we have item 20.'",
        "'speaker_2': 'Report from Economic and Property Development Recommendation to execute all documents with the Department of Defense through the Office of Economic Adjustment to accept funds totaling 1,342,406. To continue implementation of a project that addresses the economic and workforce impact of the C17 plant closure citywide.'",
        "'speaker_3': 'Thank you, Mr. City Manager.'",
        "'speaker_6': 'Yes, we have Nick Schulz, the director of our Workforce Investment Board, who has worked to get this grant from the Department of Defense. Nick, so good evening, Mr. Vice Mayor and honorable members of Council. This is actually a phase two of our economic adjustment project here in the city of Long Beach.'",
        "'speaker_6': 'As you may well may well be aware, our first.'",
        "'speaker_7': 'Project was for a total of about.'",
        "'speaker_6': '4 million, just under $4 million. And that project, integrated direct services to dislocated workers created a master plan for our C-17 plant and surrounding parcels to ensure future users would maximize economic benefit of the facility. Work product from phase one included again a master plan.'",
        "'speaker_7': 'Document to help guide decision making concerning site use. Once Boeing Corporation has ultimately vacated the site, it created an.'",
        "'speaker_6': 'Online skills transfer platform.'",
        "'speaker_7': 'To help impacted workers prepare for.'",
        "'speaker_6': 'New employment and opportunities that looked at special.'",
        "'speaker_7': 'Zoning and planning activities.'",
        "'speaker_3': 'Prepare to prepare the site.'",
        "'speaker_6': 'For future use and it created an economic and labor market study to analyze and help identify impacted firms and help them transition successfully from suppliers of Boeing into other available markets.'",
        "'speaker_7': 'Phase two of the project will bring the city just over $1.5.'",
        "'speaker_6': 'Million and will build on the efforts.'",
        "'speaker_7': 'Of our Phase one approach. And the major phases to be included of this Phase two project.'",
        "'speaker_6': 'Include expanding the economic analysis to better understand the.'",
        "'speaker_7': 'Impacts of the C-17 to the closure to the city a.'",
        "'speaker_6': 'Few years out, the ultimate economic well-being and condition of the workers who have been impacted and continuing efforts to support and transition the supply chain away from aerospace and defense opportunities into other market opportunities.'",
        "'speaker_7': 'As well as completion.'",
        "'speaker_6': 'Of planning and site analysis to guide any future development on the site. I can speak further about any of those elements if you have any questions.'",
        "'speaker_3': 'I think we're okay, but good job tonight. Is any public comment on this item?'",
        "'speaker_0': 'In the supporting material for the agenda. It says earlier this year, OCA, which is the federal government, notified Pacific Gateway that the city would receive additional funding of one and a half million dollars plus to continue and expand the project for this new round of grant funds.'",
        "'speaker_0': 'Pacific Gateway will work with various businesses to assess their economic competitiveness, conduct, asset mapping, and support the city's modified planning and zoning documents. I don't think I heard that in that description. So the federal government notified a local business that the federal government is sending money to the city of Long Beach to give to local business so'",
        "'speaker_0': 'they can contract with two additional businesses to support planning and zoning changes now being considered. Why is the federal government providing money to higher businesses? To be a proponent of pending laws which should be supported locally. Why is the federal government including intruding through three businesses in a matter that needs to be supported or opposed by the'",
        "'speaker_0': 'citizens of this city and our city council? I strongly oppose acceptance of these funds. Thank you.'",
        "'speaker_3': 'Thank you for your testimony and seeing the federal public comment. Members, please cast your vote.'"
    ],
    "Recommendation to receive and file the Fiscal Year 2017 Second Budget Performance Report.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': '21 Please report from Financial Management Recommendation Receive and file the fiscal year 2017 second Budget Performance Report Citywide.'",
        "'speaker_3': 'Thank you, Mr. City Manager. Can we have a brief staff report, please?'",
        "'speaker_6': 'Leah Erickson.'",
        "'speaker_0': 'Good evening, Vice Mayor, Members of City Council. This is the second performance report for fiscal year 17, which covers the first eight months of the year. And this information that is in this report is consistent with the projections used for the fiscal year 17 in the manager's proposed 18 budget.'",
        "'speaker_0': 'So general fund revenues are expected to end the year lower than expected due to a one time drop in revenue. This is due to a $5.4 million decline from successful property tax appeals by companies in the harbor area.'",
        "'speaker_0': 'This results in a one time large revenue impact as well as smaller ongoing revenue reductions in future years. Partially offsetting the shortfall are higher than estimated property tax revenues and oil revenues, which are coming in at $45 a barrel instead of 35 a barrel.'",
        "'speaker_0': 'On the expenditure side, we're projected to end the year with the savings rate under budget. This includes factoring in unbudgeted medical marijuana expenses. It is expected that general fund departments will save the point 5% of their budgeted appropriations per the city manager's request.'",
        "'speaker_0': 'And given the revenue shortfall, departments have been asked to save additional funds above those 0.5% targets to mitigate the revenue shortfall and end the year in a balance. So it's expected that with this approach, the city could ultimately end the year with a small surplus.'",
        "'speaker_0': 'However, at this time, the General Fund is not projected to have significant zero funds available and may not have any additional funds left over four 5% for unfunded liabilities or any funds for FY 18 one time uses. Also, measure a ballot initiative was passed for this year and we have 35.6 million of anticipated revenues this year.'",
        "'speaker_0': 'And so to date, as of as of June 30th, 15.2 million in revenue has been received and the 11.2 million has been expended and 8.5 encumbered are obligated for ongoing and one time public safety and infrastructure purposes. While these revenues are in line with estimates during this ramp up period, it is a new revenue source and so'",
        "'speaker_0': 'it's being closely watched from other funds. There are no revenue concerns and no significant issues identified for expenditures. While all revenue is coming in higher than projected, as mentioned, the revenue is being used to offset previously mentioned shortfall in the general fund revenues.'",
        "'speaker_0': 'So therefore only a small surplus is possible for uplands and in the Talents Fund. The overall status of the fund makes it unlikely that any additional capital funding will be available at the end of 17. But we will know more at year end close as it continues to closely monitor revenues and expenditures for the remainder of the'",
        "'speaker_0': 'year and report any significant changes. This concludes the staff report and I'm available for any questions.'",
        "'speaker_3': 'Thank you. And then I go to Councilman Andrews, just your good Councilwoman Price.'",
        "'speaker_4': 'Thank you very much, Mr. Vice Mayor. So, Miss Erickson, that was a really fast recitation. And I understand, given the hour, the night, that this seems kind of like an important topic to me. So I know that you reached out to all the departments to ask for us to reduce our budgets, and that was including city council'",
        "'speaker_4': '. Can you tell me, did did all the council officers participate in that?'",
        "'speaker_0': 'It is my understanding that they are.'",
        "'speaker_4': 'Okay. And and I know we did that last year as well. Right. Okay. So that's I think that's great. In terms of the surplus, you said that we're it's possible we'll have a small surplus at the end of the year.'",
        "'speaker_4': 'Is that correct?'",
        "'speaker_0': 'That is correct. If departments are able to meet their savings targets and save additional funds, we should have you know, we should end the year in balance or have a small surplus. You know, there is a risk, though, that it could could be a small shortfall.'",
        "'speaker_0': 'And that's why we're watching it very closely and asking departments to save more.'",
        "'speaker_4': 'And so what is that amount?'",
        "'speaker_0': 'The small surplus. Right now, we're actually officially estimating zero. So no, no funds available. No extra funds available and no shortfall.'",
        "'speaker_4': 'Okay. And so when will you know whether there will be a surplus, if at all?'",
        "'speaker_0': 'So really, we it takes a while to close our books. So we come back to city council in February, but we'll have a better feel of probably in November if there's going to be a major problem. If there was a major problem, that's why we do have an operating reserve and the operating reserve is used for these'",
        "'speaker_0': '. And it's unanticipated one time or mid-year shortfalls that we did that we had with revenue. We're hopeful, though, that between other revenues coming in higher and department savings that will that will end the year in balance. Okay.'",
        "'speaker_4': 'And I just want to note one thing, and that is, you know, we talk a lot about the Tidelands funds. And sometimes people say, well, we don't have a Tidelands Fund in our district. There are different enterprise funds in various districts that you can benefit from those funding sources and some where you can.'",
        "'speaker_4': 'We talked about it earlier tonight in terms of grant moneys and things available. But I just want to just so that we're clear the bathrooms and all the things and the parks and the things that we normally maintain through the Tidelands Fund in in 17, we don't expect to have any capital improvement, but we will still have'",
        "'speaker_4': 'operating. So a small amount of operating moneys coming in.'",
        "'speaker_0': 'Councilwoman Price We have 1.5 million of capital investment planned in the 18 proposed budget using funds available in Tidelands. But there is no anticipated any additional surpluses at this time. But that also could change when we do year end.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'Thank you. I appreciate that. I will not ask any more questions. Thanks.'",
        "'speaker_3': 'Thank you. Next, we have Councilor Mungo.'",
        "'speaker_0': 'You mentioned a reduction in property tax revenue from a port port from port related locations that did a property tax appeal. What year was their appeal? Was it a multi-year refund that impacted an end to future fiscal years?'",
        "'speaker_0': 'Include the new adjusted rate. Councilwoman Mingo. So it was over several fiscal years, I believe at least three might have been four when you count the current fiscal year. And so that's why it is considered a one time hit.'",
        "'speaker_0': 'But we do believe that that appeal alone, those appeals alone could result in about $1,000,000 of ongoing revenue shortfalls. And that is hopeful that that it would be offset by other properties going up higher than anticipated. So right now, that's something that we are concerned about and we're watching for FY 18.'",
        "'speaker_0': 'And then also, there could be additional appeals filed. And so we're we're looking at that as well. And the.'",
        "'speaker_1': 'Volatility of those properties also can be.'",
        "'speaker_0': 'Restored at the same rate in which they were decreased.'",
        "'speaker_1': 'So let's make.'",
        "'speaker_0': 'Sure to keep track of both sides of it. Correct. Okay. Wonderful. Thank you.'",
        "'speaker_3': 'Thank you. Any public comment on this item saying please cast your vote.'"
    ],
    "Recommendation to approve Update to Long Beach Airport Minimum Standards for Aeronautical Activities.  (District 5)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you. Number 22, please.'",
        "'speaker_2': 'Report from Long Beach Airport. Recommendation to approve an update to Long Beach Airport Minimum Standards for aeronautical activities District five.'",
        "'speaker_3': 'Thank you. How about a brief staff report?'",
        "'speaker_6': 'Just Romo can handle both item 22 and item 23. They're both airport.'",
        "'speaker_7': 'Related. Good evening, Vice Mayor, members of Council. The item before you is a request to update the airports minimum standards. Essentially the provisions developed by at airports sponsor to ensure the safe, efficient and adequate services are available to aeronautical users.'",
        "'speaker_7': 'They must be reasonable and not unjustly discriminatory in line with FAA policies.'",
        "'speaker_6': 'And they should also be periodically updated.'",
        "'speaker_8': 'Which is why we're bringing them forward for your consideration.'",
        "'speaker_6': 'And it's part of our effort to support the overarching.'",
        "'speaker_7': 'Goal of leveling the playing field among all the aeronautical businesses at Long Beach airports. I'm here to answer any questions you may have on this item.'",
        "'speaker_3': 'Thank you, Counsel Mulder.'",
        "'speaker_0': 'I appreciate meeting with you on this. And I am glad we're updating the standards for pre-check. It's keeping ahead of it.'",
        "'speaker_3': 'Thank you, Councilman Austin. Fantastic. Any public comment on this item saying no members, please cast your vote.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a License Agreement with Crown Castle NG West, LLC, a Delaware limited liability company, for the non-exclusive use of City-owned properties for wireless telecommunications facilities for a ten-year term.  (Districts 1,2)": [
        "'speaker_3': 'Thank you. I think we're just going to keep going. Is there only public comment on this item saying no members, please cast your vote. Motion carries. Thank you, Mr. Romo. Number 24, please report.'",
        "'speaker_2': 'From Public Works recommendation to execute a license agreement with Crown Castle and G. West for the nonexclusive use of city owned properties, for wireless telecommunications facilities for a ten year term District one and two.'",
        "'speaker_3': 'Thank you. There is a brief staff report on this.'",
        "'speaker_6': 'Craig Beck.'",
        "'speaker_8': 'Good evening, Vice Member, Members of the City Council. Just real quickly. We're excited to bring this item before you this evening. The city staff has been working diligently with the telecommunications industry to bring forward small cell. And as you know, many people are using smartphones these days, mobile web browsing, video streaming, and that has led to the'",
        "'speaker_8': 'need for more data. The telecommunication companies are trying to address this by filling gaps in their cell sites with micro cell. And what that really means is they're they're asking the city to use our assets, primarily our street light poles, to place antennas and equipment that will allow them to have these facilities in place.'",
        "'speaker_8': 'We have worked we have a number of applications pending. The first application is before you this evening with a license agreement with Crown Castle. Crown Castle will install the equipment and essentially lease it to an operator like an AT&T or Verizon.'",
        "'speaker_8': 'One thing we would like to do to clarify the recommended action before you this evening is that this particular item is for 21 city owned sites. I want to make sure that we have that clarification in place, because it is likely that will we will we will be bringing additional Crown Castle applications to you in the future'",
        "'speaker_8': '. And so this particular license agreement is for those 21 sites. The sites are primarily located. If you look at Exhibit A, they are down in our city's waterfront. So Shoreline, seaside, etc., primarily, they're down in the waterfront. I would add that your staff is working closely, both planning and building and public works, to bring forward a master'",
        "'speaker_8': 'license agreement that would help streamline the entire licensing process for the telecommunications company companies plural. We do have multiple companies that have filed applications that staff is working with. We anticipate that that master license agreement will come before council, hopefully before the end of this calendar year.'",
        "'speaker_8': 'That concludes the staff report.'",
        "'speaker_3': 'Thank you, Mr. Beck. If there's no objection, we'll just go to public comment. Any public comment on this item saying no members, please cast your vote.'",
        "'speaker_2': 'Councilwoman Price. Motion carries.'"
    ],
    "Recommendation to increase appropriations in the General Services Fund (IS 385) in the Technology and Innovation Department (TI) by $24,724 offset by the First Council District one-time infrastructure funds transferred from the Capital Projects Fund (CP) in the Public Works Department (PW) to support the purchase of two outward facing security cameras to be installed at Washington Middle School in the First Council District.": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you. I'm number 32, please.'",
        "'speaker_2': 'Communication from Councilwoman Gonzalez recommendation to increase appropriations in the General Services Fund in the Technology and Innovation Department by $24,724, offset by the first Council District one time infrastructure funds to support the purchase of two outward facing security cameras to be installed at Washington Middle School.'",
        "'speaker_3': 'Thank you, Councilwoman.'",
        "'speaker_4': 'I just wanted to say briefly thank you to the Long Beach.'",
        "'speaker_0': 'Unified School District.'",
        "'speaker_4': 'Superintendent and board members on and also.'",
        "'speaker_1': 'My council colleagues on the Joint Youth.'",
        "'speaker_4': 'Committee. This is something that.'",
        "'speaker_1': 'We needed to do for Washington middle school students to keep them safe.'",
        "'speaker_3': 'Thank you. This is great use for one times. Is there any public comment on this saying no members, please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_3': 'Thank you. So now we're on to our final public comment section. If there is any remaining public comment from members of the council, now will be the time to come forward. You have 3 minutes.'"
    ]
}