{
    "Recommendation to request City Attorney to prepare an ordinance establishing a temporary Transactions and Use (Sales) Tax for general purposes at the rate of 1% for six years then declining to .5% for four years on the sale and/or use of all tangible personal property sold at retail in the City, to be placed on the ballot at the June 7, 2016 municipal election, and any and all documents related thereto. The tax will sunset after 10 years;  Request City Attorney to prepare a \"rainy day\" fund ballot measure so that the first 1% of any new revenue source created is placed into a special fund to be used to offset the impact of future recessions; and  Request City Attorney to prepare an advisory resolution to accompany the Transactions and Use (Sales) Tax to specify the council's intention to prioritize infrastructure repairs and restoration of public safety resources when allocating those funds.": [
        "'speaker_0': 'Thank you, Steve. That concludes public comment. We're going to go to the regular agenda now. We're going to go ahead and. Give me 1/2, please take up item number 25. Madam Clerk.'",
        "'speaker_1': 'Communication from Councilman Austin. Councilwoman Gonzalez, Vice Mayor Lowenthal and Councilmember Richardson. Recommendation to request the city attorney to prepare an ordinance establishing a temporary transfer transaction and use sales tax for general purposes at the rate of 1% for six years, then declining 2.5% for four years on the sale and or use of all tangible personal property sold'",
        "'speaker_1': 'at retail in the city to be placed on the ballot at the June seven, 2016, municipal election. The tax will sunset after ten years and request the city attorney to prepare a rainy day fund ballot measure and request the city attorney to prepare an advisory resolution to accompany the transaction and new sales tax.'",
        "'speaker_1': 'To specify the Council's intention to prioritize infrastructure repairs and restoration of public safety resources.'",
        "'speaker_0': 'Thank you. I'm going to. I'm going to turn this over to the maker of the motion, which is council member Austin. Councilor Austin.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And I just want to take this opportunity to just mention as I talk to residents throughout my district and throughout the city, for that matter, the issues that I hear more about most about our fixing our streets, sidewalks and alleys and restoring the cuts that were made to public safety over the past ten'",
        "'speaker_4': 'years. These these are priorities for our residents. And they are looking to their elected representatives, their city council, to show leadership on this issue. These are the issues that our residents want the city to be tackling tonight. We will take the first step to giving our residents saying what kind of future they want for our city.'",
        "'speaker_4': 'The city of Long Beach has been fiscally prudent and made significant reductions to stay within budget over the past several years. We've partnered with our employees to save more than $250 million over ten years on pension cost. The city has eliminated more than 700 positions, including 200 police officers and more than 80 firefighters.'",
        "'speaker_4': 'Further reductions and efficiencies have been implemented throughout the city. But while we have worked to stay within our budget, our infrastructure and public safety resources are falling short of what is needed. We have a $2.8 billion in infrastructure needs over the next ten years, and we're falling further behind each year.'",
        "'speaker_4': 'Every year we come up short in investing in our infrastructure. The cost to upgrade our streets, sidewalks and alleys only increase. Trends in cities across the state are showing a rise in crime. And in Long Beach, we're not immune to that trend.'",
        "'speaker_4': 'We need additional police to combat this increase in crime. We also need to restore fire staffing to maintain our 911 paramedic response times and public space safety stations across the city. That's why this proposal is supported by our mayor and two former mayors, Mayor O'Neill and Foster as well.'",
        "'speaker_4': 'This is a temporary measure that will end in ten years, but will allow us to make key investments in public safety and infrastructure. I personally believe our residents are looking to this council to make bold steps to address these pressing needs and that our residents should be given the opportunity to have a say in the future direction'",
        "'speaker_4': 'of our city. We have to control our own destiny here. And for that, I would ask for full support of this council, for this motion. Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Austin. Councilmember Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. So I want to I want to first thank Councilman Austin and the rest of the council members for for for bringing this forth to the city council. I want to thank Mayor Garcia and and Mayor Foster and Mayor O'Neal for asking the city council to weigh in on this issue.'",
        "'speaker_3': 'I've been on the council for just shy of two years, but I worked here prior to that. And I think it's pretty clear folks have seen what we've come through and the decisions that the council has had to make in terms of our budget.'",
        "'speaker_3': 'And but the fact is, we can't keep up with our failing infrastructure. It's our streets, our sidewalks. They're falling behind. We need to make sure we make these investments. And I think our residents are expecting us to to take on these challenges.'",
        "'speaker_3': 'We've talked about crime increasing. I'm concerned about what we've what we've seen in terms of the the data and the statistics and to ignore it. It doesn't doesn't it's not a prudent strategy. So we need to make sure we make those investments in our police officers.'",
        "'speaker_3': 'We've talked about paramedic, the changes in our paramedic staffing and all those different things. And we know that our firefighters are dealing with unprecedented call volumes, that those call volumes are increasing. They're not diminishing. And yet we're dealing with, you know, not enough resources to make sure that we keep our 911 response times low.'",
        "'speaker_3': 'So so that said, I think this is it's reasonable. I think it's modest. And and I think it's the right thing to do for us to put this forth to the voters. So, again, thank you to the to our council colleagues for for bringing this forward.'",
        "'speaker_3': 'And thank you to Mayor Garcia for putting together this framework for us to take these additional steps. So I'm going to be voting in support of this tonight.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'Thank you. Many of you know that I'm a no new taxes kind of person. I've had lots of discussions with members of the community today. I believe that even when we have good intentions, good intentions can go bad.'",
        "'speaker_1': 'In a lot of our discussions this week, I talked with taxpayers and they believe in their right to choose and I want to support that. And I also believe in oversight. And while this council can provide oversight, if taxpayers vote in this increase, it is with them that we also want to give access and oversight.'",
        "'speaker_1': 'And so I hope that I can be supportive of this motion tonight. So I've come with a friendly amendment that would bring me to be a supportive member. And I think that my community would appreciate that, that if we added some language that said, at the end of the item, there's a end to that sentence, I would'",
        "'speaker_1': 'add, which would be reviewed by a five member citizen oversight committee in advance of utilization. So that that review would then come back to the council and we would know it before approving the utilization of those funds, but that we would be providing that access to hold us accountable, that we actually do spend the money on the'",
        "'speaker_1': 'things that we say we're going to spend them on. It's tough when it's a general fund tax increase and the money goes into the general fund and there's no restrictions. This would at least provide the oversight that I think would make taxpayers more comfortable and them to be more supportive of those infrastructure needs.'",
        "'speaker_1': 'And I also hope that in the long run, to not get us into this position again, that we start treating infrastructure as ongoing costs, streets and sidewalks and building maintenance and any nonprofit board that I sit on. If we know that an air conditioning has ten years of life left in, it cost $20,000.'",
        "'speaker_1': 'We start putting away $2,000 a year now. So I'm in big support of the 1% rainy day fund. And knowing and understanding, though. 1% might not be what the amortization of those maintenance costs would be. So we need to get there eventually.'",
        "'speaker_1': 'But this is a good first step.'",
        "'speaker_0': 'And so the friendly amendment is to also include the creation of a citizen's oversight committee. And that would be added to to the measure. And from what I understand, Mr. City Attorney, I'm assuming if that was done, you would come back to the council probably with more information about citizen oversight committees as far as best practices and'",
        "'speaker_0': 'what's going on right now in the state and locally. Is that correct?'",
        "'speaker_4': 'That is that is correct.'",
        "'speaker_8': 'As I understand the motion, it would be a community advisory committee, and I'm not sure that there is any distinction in what you just said, Mayor, but that's what I think.'",
        "'speaker_0': 'We're talking about the same thing. Yes. Okay. Mr. Usted.'",
        "'speaker_4': 'I. I will accept that unfriendly amendment. I think it is. It is a smart approach. We should have some civilian oversight. I was I've always been a big fan of that. Thank you, Mr. Mayor.'",
        "'speaker_8': 'Council members. If we could just get a little clarification on what the advisory commission would be or committee would be. It appeared to us in the conversation that they would direct the staff on.'",
        "'speaker_0': 'How to spend funds. So I think now, I mean, they legally wouldn't be able to direct.'",
        "'speaker_1': 'So I guess I would think that every year when we get towards budget season, all the departments bring forward how they plan to spend their budget. And I would guess that any moneys associated that come in through this $0.01 would be monitored and allocated on an annual basis, even if we pulled in, let's say.'",
        "'speaker_1': 'A certain amount of money, we might be able to spend that money in that year because you can only repair so many streets at a time. So I think department heads bring that forward and they review it.'",
        "'speaker_8': 'And so the council would approve a budget and the oversight committee would guarantee that the funds are being spent specifically for those projects that the council approved for.'",
        "'speaker_0': 'And let me actually make also I know what comes with my money's going. Let me let me let me make to make a recommendation here. I think there is actually there are best practices for citizens oversight committees out there.'",
        "'speaker_0': 'There's actually state regulation that actually approves how some of these work. And so what I think I think the idea what Councilman Longo wants to do is absolutely correct. I support it 100%. What I like to see if the city attorney can come back and then bring in front in front of the council what our best practice'",
        "'speaker_0': 'citizens advisory committees do. I know that Long Beach Unified has one. Long Beach City College has one. It's pretty boilerplate. They're great committees are great oversight methods. And I don't know if Councilman Mongeau agrees with that.'",
        "'speaker_1': 'Absolutely. I'd prefer to use best practice than recreate the will.'",
        "'speaker_4': 'Okay. We can we can certainly do that.'",
        "'speaker_0': 'Okay, Mr. Austin.'",
        "'speaker_4': 'And I'm fine with that. I like the idea of looking at best practices and having something come back and looking at and debating at the fine points of that. Then great.'",
        "'speaker_0': 'And I and I want to thank Councilman Mongo for, for bringing this forward. I know you've been an advocate on that on that issue. I think I've heard that a lot in the community. And so I appreciate that.'",
        "'speaker_0': 'I also just want to add and then I'm going to go to Councilmember Super and here is, I think this measure and I think it's important to have a citizen's oversight component and committee made up of citizens is great but just also want to add that we will also as part of this and as of any measure'",
        "'speaker_0': 'that would come before us, the city auditor will also, as part of this measure, will also be conducting regular and routine annual looks and audits of what is happening with the funds. And so it's we have that that audit piece will always be part of this.'",
        "'speaker_0': 'It's appropriate, but so will this additional layer, which is the Citizens Oversight Committee. So I'm very supportive of both. And thank you, Councilman Mongo and Councilmember Austin for our for doing that. Next is Councilmember Super now.'",
        "'speaker_10': 'Thank you, Mayor.'",
        "'speaker_3': 'And thank you, Councilmember Mongo for bringing.'",
        "'speaker_10': 'This item forward, this friendly amendment. This is a condition that that would be a contingency that I would have to have in place to support this. I'd just like to ask the city attorney to weigh in on what the procedure is.'",
        "'speaker_10': 'I know we have to turn this around quickly, but this is just a first step. And if if Mr. Barkan can elaborate on what he brings back next week and and how we get a second vote on this.'",
        "'speaker_8': 'Mr. Mayor and members of the city council, if directed this evening, it would be our intention to have something back on the agenda for you next week for first reading. Tonight's motion takes a majority of the council five votes.'",
        "'speaker_8': 'But in order to put this item on the ballot, you would need six votes from the city council next week for first reading and then the following week all ordinances.'",
        "'speaker_4': 'For the ballot under the.'",
        "'speaker_8': 'Election code or urgency ordinances. So we would have a first reading next week and then we always do the city does.'",
        "'speaker_4': 'A second reading on March 1st.'",
        "'speaker_8': 'So there will be two more opportunities for the Council to.'",
        "'speaker_4': 'Look at this item. But it's our.'",
        "'speaker_8': 'Intention to bring it all back to you next Tuesday.'",
        "'speaker_10': 'Okay. Thank you. That's that's a perfect explanation. Also, before we get into the weeds on the formation of the committee, I think that general purpose is that and what my constituents have told me, they want the money to be spent on infrastructure and public safety.'",
        "'speaker_10': 'And that's the whole job of the oversight committee to to look after that. That's it. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Price.'",
        "'speaker_5': 'Thank you. So I just had a couple clarifying questions just regarding. The the accounting and how it is that we track the money. So perhaps staff could assist me with with these questions. How does the the money from the sales tax increase get tracked in regards to our general fund?'",
        "'speaker_5': 'I know it gets put back into the general fund, but we're going to continue to be a city and do all the things that we do as a city, purchase new vehicles, go through labor contracts, do all the things that we would normally do with the budget that we have.'",
        "'speaker_5': 'So how do we get to a place where the money that is coming in from a proposed increase is tracked separately to make sure that it's not spent on things such as raises, you know, new fleet vehicles, equipment, etc..'",
        "'speaker_4': 'Our finance.'",
        "'speaker_8': 'Director and deputy director John GROSS and Lynn Erickson.'",
        "'speaker_4': 'Will handle those questions. Thank you. I'll try to answer that. The you're correct. The money will likely come in to the general fund. We will identify it as separately, so we will be able to know to the penny how much money has come in tracking for infrastructure?'",
        "'speaker_4': 'We should be able to easily track that money. We always track all infrastructure projects. To give you an example of where it becomes a little more problematic, but I don't think it's going to be a serious problem, is let's say that we use the money and council approves money to hire more police officers, for example, which ten'",
        "'speaker_4': 'police officers? Let's say it's ten police officers. You could pick any number you want. Those police officers, maybe they go on vacation. Maybe there's someone who eventually leaves and we replace that person in time. That becomes a tracking issue.'",
        "'speaker_4': 'I've done that issue before. We've had where I came from previously. We had a ballot question that did a similar thing and we used various methods to track it that met audit requirements. And that's what we would do in this case.'",
        "'speaker_4': 'And I think the direction from council is to report that to the citizens group and we we would it's not going to be an exact accounting methodology because it's technically impossible to do that. But there are other methods that will track that we will use probably.'",
        "'speaker_4': 'h.R. Our data depends on what what council wants that money used for, but it certainly is a solvable problem and we will solve it and it will be reviewed by the citizens committee as well as our auditors.'",
        "'speaker_5': 'Because, you know, I'm thinking down the road here and, you know, we're going to continue to do things that we do as a city. And what I don't want is the appearance that any sort of new tax revenue is being used to augment the functions of the city that weren't behind the intent of the the that the'",
        "'speaker_5': 'sales tax measure. So, for example, I don't want residents to say, oh, you know, police department has, you know, this well, that's probably a bad example because that's public safety. Let's say, you know, Parks and Rec has a new vehicle that they're using that's really fancy and top notch.'",
        "'speaker_5': 'And we didn't really need that. They probably used our tax dollars to purchase that. Or, you know, this this new labor contract was approved there, probably used our tax dollars to do that. So I want to make sure that there is a mechanism in place to be able to assure the residents that that's not what happened, that'",
        "'speaker_5': 'that that the business of being a city is going to continue regardless of any sort of measure. And we'll be able to do that. Yes. Okay. And then the other question I had is, have we given any thought to what the plan will be in ten years in regards to any structural obligations that we've taken on in'",
        "'speaker_5': 'regards to public safety funding, let's say?'",
        "'speaker_4': 'In. I think what you're referring to is we're talking about a temporary tax that will sunset in ten years and automatically go away. And I think the key issue in looking at that is that this city has always had a structural budget that makes it a a point to for council to but but has to balance the'",
        "'speaker_4': 'budget every year and structurally balance it every year. I think we would continue to do that and council would continue to do that as we get towards if we're spent all the money, for example, if it's spent on infrastructure, it's not a not an issue.'",
        "'speaker_4': 'If it's spent on other things that is ongoing, then I would expect that council, as it always does, will be looking at the budget situation as we get towards that. See, have revenues gone up enough to cover that it will be a year by year basis that council will have to look at as we have done in'",
        "'speaker_4': 'the past.'",
        "'speaker_5': 'And of course, as we get close to that, that end of that ten year period, 2 to 3 years out, we could start really looking at the budget and determining whether or not, for example. Seats that employment positions that are maybe going to be open as a result of retirements maybe don't get filled or things of that'",
        "'speaker_5': 'nature in order to make sure that we're not in a position at the end of the ten year mark where we're we're faced with a problem budgetary gap in regards to having to cover positions that we have filled.'",
        "'speaker_4': 'That is correct. And it could be that revenues will go up. It could be revenues will go down. We just don't know. But, yes, just looking at it, as you've described, for whatever solutions there are available will be what we will have to do.'",
        "'speaker_5': 'Even if it means possibly having to go down a number of public safety officers in terms of not filling positions in order to make sure we're not overbudget.'",
        "'speaker_4': 'I'm it's whatever council will decide to do with the budget.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up is Councilmember Ranga.'",
        "'speaker_4': 'Thank you, Mayor. Excuse me. I am really pleased that we included incorporated in there a oversight committee. When I was a trustee at City College, we had a similar bond measure go to before before the public, and it was overwhelmingly accepted.'",
        "'speaker_4': 'And I think one of the one of the the benefits of that was that it had an oversight component to it, where citizens could look at the projects and either recommend pursuing that project, continuing it, or looking at it another way.'",
        "'speaker_4': 'I really do believe that we need that kind of participation from our community in terms of looking at that. I also very pleased at the fact that there's going to be a sunset on this. But the challenge with the sunset will be those that are somewhat referred to by a councilmember price is that if we start incorporating'",
        "'speaker_4': 'or using some of these towards salaries or towards building positions, that we might put ourselves in a in a hold sort of speak in respect to now that we have these additional employees, who what are we going to do with them when the tax goes away?'",
        "'speaker_4': 'So it's going to take a lot of close monitoring. Obviously, we're going to have to really be prudent in how we expand those funds. It would be also it would behoove the council to look at the progress we are making with with these monies in regards to making a significant impact on our infrastructure and making an impact'",
        "'speaker_4': 'on re constructing or reinstituting some of our police and fire services back into back into service. It would be my expectation that after six years it goes to it goes down by a point, half a percentage point by.'",
        "'speaker_4': 'And that would also give us the additional four years of being able to plan ahead. Now being able to look at where we're at and then being able to adapt once we reach that that point in time when we have to solely, you know, cut that cut that out in terms of depending on it as a budget'",
        "'speaker_4': 'resource. So I like the red like the plan, I like the the component, the oversight and the fact that it does have a sunset. And I will be supporting this on this recommendation. Thank you.'",
        "'speaker_0': 'Thank you. Thanks, Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I just wanted to communicate my support for this item and thank Council member Austin for bringing it forward. Thank you.'",
        "'speaker_0': 'Council member Andrews.'",
        "'speaker_9': 'Yes, I would like to close sentence for my vice mayor because I think this is a great solution to get our additional police officers and, you know, off the streets and more fire response like a fireman and emergency services.'",
        "'speaker_9': 'Well, and you know, and especially dealing with the infrastructure, because a lot of the individuals that live in our district think that infrastructure comes once every five years. But I think with the with the tax increase of this type will help us all know that we can get these things done before that cycle comes around.'",
        "'speaker_9': 'So I think Council Austin and the mayor bringing this up and I totally would support it. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_5': 'Yes. I want to thank Councilman Austin for bringing this forward as well. I didn't have too many questions, just more comments. And, you know, I know it's been decades since we've conducted a ballot initiative such as this. And I know that with the growing need for infrastructure, all of us have received plenty of calls on alley repairs'",
        "'speaker_5': 'and in streets and sidewalks. And we do need more police officers and paramedic units out there. And so I think this is just one small part in which each of us can play to be able to contribute to the greater benefit for for our city.'",
        "'speaker_5': 'I think we certainly deserve it. I know this is a little bit scary for some people, but I think that this is something that the you know, we're looking at and and taking, you know, a very cautious approach.'",
        "'speaker_5': 'And I believe the first I was kind of taken aback by the Citizen Advisory Committee, not really understanding exactly what it would do. But I am looking forward to hearing more from our city attorney next week and all that will entail.'",
        "'speaker_5': 'And also, I definitely know our city auditor will be very involved in the process and I certainly respect her expertize. So I look forward to more information. Thank you.'",
        "'speaker_0': 'Thank you. Before we turn over to any public comment, I'm just going to make a few comments on on the on this item as well. I want to just start off by thanking Councilmember Austin and the others who have signed on to support this.'",
        "'speaker_0': 'This is a very big step. It's an important step to give voters the choice. And this is really about voter choice and giving them the opportunity to invest in their future and in their city. I especially want to thank Mayor Bob Baxter and Mayor Beverly O'Neill for joining me in supporting and proposing this measure for a citywide'",
        "'speaker_0': 'vote and conversation. I think that if you think about the two decades of leadership that both Mayor Foster and Mayor O'Neill have witnessed and led, I think you see a time in our in our history where there was always a need.'",
        "'speaker_0': 'I think they both recognized that the need existed when they were here, and they recognize that the need still exists today. They also understand, like I do, that every single day that we don't invest in our infrastructure. It gets more expensive the following day.'",
        "'speaker_0': 'And the more that we continue to put aside the important investments that we need to make in our public safety officials, firefighters and police officers, the more dangerous our community could become. And so I really appreciate and I want to thank this council for taking this issue to the voters.'",
        "'speaker_0': 'I also want to note that I think it's very important to reinforce I'll say it today, I said it in the past and will continue to say it. The intention of this measure and this measure is to fund two key areas.'",
        "'speaker_0': 'One is to make a historic investment in our city's aging infrastructure. And two is to ensure that we maintain and support our police officers and our firefighters that are out there every single day in very tight budget situations.'",
        "'speaker_0': 'And there's no question that we need to support those two organizations. I've also publicly said that I believe our top two. Initial restorations need to be. The engine in Belmont Shore and the restoration of South Division for a police department.'",
        "'speaker_0': 'And as we know, this isn't a geography issue. It's an issue when we handle both those. The entire city system on both the fire side and the police side become stronger and become safer for all of our all of our residents.'",
        "'speaker_0': 'There are no question that there are other restorations that are important. There are no question that there are other needs in those. But those are my two initial top priorities as presented to to the Council. I will also just note that this is going to really transform our city when it comes when it comes to construction and'",
        "'speaker_0': 'rebuilding our streets, sidewalks, alleys across the city. And it's going to be a very exciting time for the city if voters decide to support this. And really what is what will end up being to voters the cost on a on a monthly basis, the cost of a Starbucks coffee?'",
        "'speaker_0': 'That will be the cost of this of this increase. And so I want to I want to thank you for bringing this for bringing this forward. I think it's a great investment in in the city. And as a reminder, as mayor, I know it's also my responsibility to present the budget to the council.'",
        "'speaker_0': 'It's a it's then the council's responsibility to adopt it. And you can take it to the bank that I as this budget will be presented if this measure passes with a focus on those two items, infrastructure and public safety.'",
        "'speaker_0': 'So thank you. And with that, any public comment, please come forward.'",
        "'speaker_10': 'Good afternoon, Mr. Mayor and City Councilor Gary Shelton, 240 Chestnut Avenue. I'm here sort of speaking on behalf of folks like myself who can't afford a Starbucks coffee. One thing that I can say that I haven't heard this evening is any clue as to the amount that this one penny is going to amount to over a year's'",
        "'speaker_10': 'time, let's say. I don't know and my friends don't know. Are we talking about $38,000 or are we talking about $38 million? Somewhere in between, somewhere above or less? I want to also say that you're missing politically a tremendous opportunity here to avoid sending this out to the public with a yes or no up or down vote'",
        "'speaker_10': '. There are other ways and yet friendly amendment tonight to the writers of this to bring it back to you. You know, they're going to have to have this ready by Friday to get it out to us next week.'",
        "'speaker_10': 'So they might as well do a little bit more work between now and Friday. You have another way to go. What we're dealing with here is the folks who can't afford that Starbucks coffee have somewhere around 600 to 1200 dollars, maybe a month, in expendable funds left over after they pay their needed payments, rent, so forth.'",
        "'speaker_10': 'Every single dollar of that is taxed in sales tax. We spend all our money on sales tax. That's what's called a regressive tax. That's exactly what sales taxes are. We have nothing left over that is not taxed at that 10%, which is what you want to have on on on our tax roll.'",
        "'speaker_10': 'So what that means is that you're trying to balance the gap in this budget, not to say that you don't need the public safety funding and the street repair funding, but you're trying to balance the need for that on the backs of the folks who can't afford to pay it.'",
        "'speaker_10': 'That's what I'm trying to get to you. So what do you do? You ask a city attorney to come up with some second alternative that is not a regressive tax. I don't know what it would be. I don't know what it would really be a humanistic increase in the uut that would still let folks like me, senior'",
        "'speaker_10': 'citizens, get some of that money back. I don't know if it might be a luxury tax on perfumes and yachts that are sold here in Long Beach. I don't know what it would be. It's not my job to know what it would be.'",
        "'speaker_10': 'It's my job to stand here and tell you that a regressive tax can be voted down as soon as the people understand that the poor folks are the ones that are going to be paying it. Again. We don't even know how much tax it is.'",
        "'speaker_10': 'I can't go out and get a Starbucks coffee unless somebody gives me a gift card. So to say that that's all it's going to cost me, it goes right over my head. I'm sorry, but come up with an alternative way and they got the wise nurse there to do it so that it's not simply an up or'",
        "'speaker_10': 'down vote, but you'll still get somehow the money you need to close that gap. Thank you very much.'",
        "'speaker_0': 'Next me, Will.'",
        "'speaker_4': 'Yes.'",
        "'speaker_10': 'Joe Sopel You have a name on file, Mr. Mayor.'",
        "'speaker_4': 'City Council Member Staff You as a council are going to want to sell this. The Republic of course you want. You want it to pass. A lot of things that were said here tonight were very good. I would like to.'",
        "'speaker_8': 'Add on this.'",
        "'speaker_4': 'Price to your friendly amendment. Not exactly sure how to say this, but in ten years you're not going to be here in ten years. I will. And this temporary tax will still be here. Besides watching how this money is spent, we also have to watch how to replace it.'",
        "'speaker_4': 'Because in what, six years it's going to drop down to a half a percent. Well, you have to get some kind of mechanism going to replace whatever amount this 1% of the tax will be. And then the next four years, if we're going is going to have a sunset clause, we have to replace that half a percent'",
        "'speaker_4': '. So sitting up here, being public.'",
        "'speaker_8': 'When when politicians talk about a tax that has since a sunset clause in it.'",
        "'speaker_4': 'That's hard to believe. But I believe you. But we have to find some way to replace it, not just say, Oh, it's going to be gone. Public safety is going to cost less money. Officers are going to be there's going to has to be more officers.'",
        "'speaker_4': 'In ten years, won't crime increase? I hope not. But it will. So putting a sunset clause on this. Maybe we should start telling the truth.'",
        "'speaker_8': 'Truth?'",
        "'speaker_4': 'Either there's no sunset clause on it and let this tax live or die with the truth. Or create something that's going to replace this percent. You know, we as a real estate agent, we're always marketing ourselves. We want you to call us.'",
        "'speaker_4': 'So we have to.'",
        "'speaker_8': 'Talk about how great we are, what we do different, or.'",
        "'speaker_4': 'Why call us. The City Council needs to start telling the citizens of Long Beach shop this shop. Long Beach shop, Long Beach shop Long Beach. I don't hear that. And it's not going to.'",
        "'speaker_8': 'Take a big budget to do that because.'",
        "'speaker_4': 'You reach out.'",
        "'speaker_8': 'You get a bill in the mail.'",
        "'speaker_4': 'There's a lot of ways you reach us. You got to keep saying that. It's to our benefit to shop Long Beach. But I don't hear it. Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Sopo. Next speaker, please.'",
        "'speaker_10': 'John Deeds again. Don't know who the famous man was, but somebody said the pathway to hell is lined with good intentions. And that's all your measure has, is intentions. No guarantees whatsoever. The only guarantee is that of a tax increase should this pass.'",
        "'speaker_10': 'Secondly. Business friendly, which you'd want us to leave. You are begins with being consumer friendly. This is not consumer friendly. This makes Long Beach businesses and it puts them at a disadvantage. I can easily see that people will take their money and spend it outside of Long Beach.'",
        "'speaker_10': 'They'll go to Signal Hill to go to Lakewood. Lago to Cerritos. Just to say 1%. Or after you get 2% out of shape with Orange County, they'll go to SEAL Beach, Los Al Garden Grove, Westminster can very easily.'",
        "'speaker_10': 'Rule of unintended consequences. This thing might actually wind up costing you money. I can count well past five. I know you're going to be unanimous in putting this on the ballot, but above and beyond that, and someone along the lines of what Gary Shelton was talking about, I see this as nothing less than an open declaration of'",
        "'speaker_10': 'war on senior citizens and retirees. You may think that the Great Recession is over. It's not for us. The only person behind that real that has any age on me is Dee. You've got one year on me. And I can tell you from my perspective.'",
        "'speaker_10': 'People are trying to live on fixed incomes and retirement. The purchasing power of our dollars is declining at right about 10% a year. And we have no hope of any significant increases whatsoever. I'll share something personal. I'm very heavily invested in California municipal bonds.'",
        "'speaker_10': 'I used to have a bunch of bonds, real fat coupon rates, some as high as six and a half, 7%. All those bonds have been called. I have to struggle to get two and a half percent on tax free bonds now.'",
        "'speaker_10': 'Where is the money supposed to come from for senior citizens to pay for this? I would anticipate that every senior citizen with a car and half a brain will take their money outside of Long Beach and spend it where their body will go it.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Yes. Larry Bolen, another senior citizen, back again. Folks, any of us who have ever taken a class in economics knows that this is a regressive tax. And I and I cannot believe the number of you who I know care about poor people, about the seniors, would actually, rather than look within the city for cost savings, go outside'",
        "'speaker_10': 'and make a regressive tax on the very people you're trying to protect. I just told you about my $17,000 a year tax because of my and my insurance. We have the food, the minimum wage we're having. This is a regressive tax.'",
        "'speaker_10': 'Look, folks, we pay as a city $18 million a year more to predominantly fire and police for a overtime. System that does not meet federal standards. You know about that, right? That consultant said there's 18 million. Why don't we take that 18 million at four or five years, five or 6% a year, and reduce our firefighters and'",
        "'speaker_10': 'police back to what other firefighters and police make instead of having overtime start, then minute the seconds that they go over there shift. 18 million a year. How about looking at the ambulance service, going to private ambulance service revenue after the service handles 3 million people in the county of L.A. and you look at all the the'",
        "'speaker_10': 'taxes both fixed and and non fixed for the ambulances. Do you know that we have 23 fire stations, non-medical fire calls for about 8500. Last statistics I saw. Divide 8500 by 365. You know what you get 23. That means our fire stations right now going to fires have one call per station per a 24 hour period.'",
        "'speaker_10': 'For non-medical calls. Why don't we just have the county take care of it? We're out of the fire business, folks. We can save four or $5 million there and reinvest that money in new paramedic vans. More paramedics take the paramedics that are on those fire engines.'",
        "'speaker_10': 'You get them off the fire engines into a paramedic under the health department. However, have the medical people run the paramedics. But what, you never brought up any cost savings from here? And I know we have council members who have said that you will not be in favor of cost savings if it means you lose jobs.'",
        "'speaker_10': 'Well, we're not a full employment society. The Soviet Union was there, gone. Former Union of Soviet socialist republics had full employment. We don't use the last time I looked. We didn't. Thank you very much. Thank you. Bad idea.'",
        "'speaker_0': 'Next speaker, please. This are your last speaker. Looks like Mr.. Good to you.'",
        "'speaker_6': 'Very good. You, Kirk, as he addressed a number of items. First of all, I think to demonstrate good faith, what you should do with them pledge for the rest of your term. That you will spend no dollars whatsoever traveling.'",
        "'speaker_6': 'Period. You will Skype. That's it. Number two, work in conjunction with the city auditor and go back to all of the properties that you gave away willy nilly. Through redevelopment. Look at it and then go back intact. I would call it an ops tax.'",
        "'speaker_6': 'Folks, we made a mistake. We gave it to you a little too low. So here's what you really owe us and collect that way. See what happens there. The second thing to consider is reducing the size of the council.'",
        "'speaker_6': 'Cut it down and eliminate a full time mayor. If we're in that dire situation, and I really believe we are. And we've been I've been coming to these meetings since off and on since 1977. And we always have these problems.'",
        "'speaker_6': 'Period. So somebody has got to step up to the plate. And I would suggest, again, you go to the city auditor. Let her take a look at the list that you handed out. And I even, quite frankly, go back to those two pieces of property that Bob Foster gave away, the one awesome piece of property that nobody'",
        "'speaker_6': ', nobody wanted. And before the ink was dried, Tom Dean made a million bucks on it. And then two months later, they discovered it had a sibling. Must have been but ugly because it only one for $0.08 an acre.'",
        "'speaker_6': 'And you sold the American Hotel. For $1. $1. I'll always remember that because that was at the same time that. The Secret Service. Trying to chip away at the ladies of Cartagena. And they were hadn't such enough businesspeople to hold out for their price yet.'",
        "'speaker_6': 'Long Beach did $1 for a piece of property that's a 42nd Walkman. First plate for an. Ocean Boulevard. So again, the most strict the most stringent recommendation would be go back with the city auditor, review all of those.'",
        "'speaker_6': 'Properties. See what can be done about going back and doing a mea culpa. We made a mistake. Go forward. Thank you. The last the last thing would be. Don't have a tax. Rather have it a voluntary tax. People want to pay when they go up.'",
        "'speaker_6': 'See what happens. You never know.'",
        "'speaker_0': 'Thank you. That concludes public comment. We're going to go to a vote. Just one clarifying question, Mister City Attorney. I know that I think there's a question was brought up, but the actual item today clarifies that this is a six year, 1%, four year half, and then it's over.'",
        "'speaker_0': 'And the council cannot extend that. The only group that could ever extend anything beyond a sunset would be the voters themselves. So it's a ten year temporary period.'",
        "'speaker_8': 'That's my understanding. Absolutely. Would be will require a vote of the people to do anything after the ten year period.'",
        "'speaker_0': 'Okay. Thank you. Members, please go ahead and cast your vote.'",
        "'speaker_1': 'I smell a long bow. Yes. Motion carries.'",
        "'speaker_0': 'Thank you. Madam Kirk. Next item, please.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing and grant an Entertainment Permit with conditions on the application of Ebell Long Beach, LLC, 290 Cerritos Avenue, for Entertainment With Dancing, operating as a Hall Rental.  (District 2)": [
        "'speaker_1': 'Item number one, the hearing. This hearing requires an oath. A report from financial management. Recommendation to receive supporting documentation into the record. Conclude the hearing and grant an entertainment permit with conditions on the application of APA Long Beach to 93 Days Avenue for entertainment with dancing operating as a Hall Rental District two.'",
        "'speaker_1': 'Please raise your hand. You and each of you do solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_7': 'Thank you. And the items in District two would either one of the makers mind if I actually made the motion? Oh, I'm sorry. What I. I'm looking at a delayed. Okay. While we're waiting, is there a staff report?'",
        "'speaker_8': 'Yes, Madam Vice Mayor, members of the council. This item will be. The staff report will be given by Jason MacDonald, our purchasing and business services manager.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_4': 'Mayor. Council Members. Jason MacDonald, Purchasing Business.'",
        "'speaker_10': 'Services Manager for the Financial Management Department. Tonight you have in front of you the application for entertainment with Dancing for Ebell, Long Beach Limited Liability.'",
        "'speaker_4': 'Corporation to 19 Cerritos Avenue in District two for entertainment with dancing operating as a hall rental. All of the necessary departments have reviewed the application.'",
        "'speaker_6': 'The application and proposed.'",
        "'speaker_4': 'Conditions are contained in the packet that was provided. We are prepared to address any questions.'",
        "'speaker_10': 'Or concerns along with the police department regarding the application or conditions. That concludes our.'",
        "'speaker_4': 'Report. Our office has received.'",
        "'speaker_6': 'One communication via.'",
        "'speaker_4': 'Email opposing the applicant.'",
        "'speaker_7': 'Thank you. I'm wondering if there's any public comment on this item. Hearing item one. Okay. Seeing that, I just wanted to welcome Alan Dunn and the E Bell to the community and thank him for investing in our city.'",
        "'speaker_7': 'I don't know if. If the gentleman's here today. There you are. Thank you. I appreciate that. Thank you. I think we all know that The Bell is a very historic feature and fixture actually in the Almeida's speech neighborhood.'",
        "'speaker_7': 'And I'm very glad to see it continue to operate as a venue for those very, very special life occasions that are celebrated there. Thank you for being a good partner to the community, and I know you'll continue to work to hear the community with regards to what concerns they might have.'",
        "'speaker_7': 'Parking's always an issue which you'll hear about, and I think you're aware of that, and you will help mitigate that to the extent possible. With that councilmembers, I'd like to make the motion to approve. Would the conditions. And then there's been a second members.'",
        "'speaker_7': 'Cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Thank you, Madam Clerk. Are we on consent?'"
    ],
    "Recommendation to request City Manager to provide the City Council with an update regarding where the City is at with the Request for Proposals process for consulting services related to updating the City's gateway signage program.": [
        "'speaker_1': 'No, we are. We actually voted on consent earlier. Okay, now we're on to the regular agenda.'",
        "'speaker_7': 'Regular agenda? All right. Would you read the item, please?'",
        "'speaker_1': 'Sure. Item ten Communication from Councilman Price, Councilmember Superdad, Councilwoman Mingo and Councilman Andrew's recommendation to request an update regarding where the city is at with the RFP process for consulting services related to updating the city's Gateway Signage Program.'",
        "'speaker_7': 'Councilwoman Price.'",
        "'speaker_5': 'Thank you. Is there a staff report on this item?'",
        "'speaker_8': 'Yes, there is. Mayor and City Council would be happy to give an update of where we are. If you recall in the budget that the Council passed in October, there was direction to start an effort to improve our gateway signage.'",
        "'speaker_8': 'Shortly thereafter, the city put the city staff put together a scope of work to put out for a consultant. We're actually looking at three different components within that study. One would be for gateway signage at our Gateway areas, and we've done some initial survey work to determine what we have at our gateway areas and provided that as'",
        "'speaker_8': 'part of the RFP. We're also looking at how to improve our parking signage in the downtown. That would be a second component as that's been a focus of the city and the city council to try to improve some of the parking wayfinding in downtown.'",
        "'speaker_8': 'And the third is we have a condition of approval for our beach projects to try to make our beach signage a little bit more easy to follow and how to direct people to the beach. That's a third component.'",
        "'speaker_8': 'We did a survey of all of our signs in the downtown area and did a survey of all of our beach signs and then released a request for proposals in December that closed the end of December. In January, we received proposals from from several firms.'",
        "'speaker_8': 'We have seven proposals that have been received. And staff are reviewing those and expect to do interviews of the top candidates in the next week or so. And then we'll get back to the city council with recommendation for an award for a selected firm.'",
        "'speaker_8': 'Once we know what the costs are and and what who the selected firm would be, we'd be back to the city council. And that concludes the staff report.'",
        "'speaker_5': 'So would the selected firm be in charge of all three of those components, Gateway Beach and Parking?'",
        "'speaker_8': 'Yes. We are asking a firm to be able to bid on all three of those. We'll see if they choose to bid on just one or so, but we expect them to choose to bid on all three. What's important is that there will be different timelines for all three.'",
        "'speaker_8': 'We want to be we've heard that the focus from the council really is on the gateway signage. And so we know that will be prioritized. And those are also going to be different funding sources. So we want to be able to separate those three different efforts.'",
        "'speaker_8': 'But it would be one firm so that there is a consistent standard and so that the beach signs look very similar to the parking signs look similar and complement our gateway signs.'",
        "'speaker_5': 'And are we going to have the recommendation from staff come back to council the same way we normally do when we have responses to proposals? Or will the Council have the opportunity to maybe hear from the the top two bidders?'",
        "'speaker_5': 'Let's say, because this is a very creative project and it really is is not something that we might be able to quantify so that the creativity of the company, the vision that they have for Long Beach, their connection to the city, the understanding of the need for us to have a brand and that kind of thing might'",
        "'speaker_5': 'all be factors above and beyond just what the cost of the project might be.'",
        "'speaker_8': 'So you're absolutely correct. In an RFP, cost is one of the factors, but it's not the sole factor. So we're not required to go with the low bidder. When we do a request for proposals, we are looking for a service and we're looking for something that complements and meets our goals and our objectives.'",
        "'speaker_8': 'So we would be going through a staff evaluation process of those seven proposals, we would be bringing back a recommendation. We certainly could bring back some additional information about some of the other vendors that were that were proposed and provide some additional detail on why we recommended one over the other and why we feel that they're the'",
        "'speaker_8': 'best fit. Given the Council's goals and given that creative aspect that you mentioned.'",
        "'speaker_5': 'And if Council wanted a presentation from the recommended bidder in terms of what was involved in the scope of their their response to the RFP, could we request that at that time or in advance of that?'",
        "'speaker_8': 'And so we'll talk a little bit with the city attorney with purchasing on on when you see that you're normally making an award. But we can certainly I think the intent is to try to get some information about what who they are and what they do and what their level of expertize is.'",
        "'speaker_8': 'So I think we'd certainly be able to find something to meet your needs there.'",
        "'speaker_5': 'Okay. I mean, the only concern that I have is this is a very creative process kind of, you know, certainly not at the at the level in terms of project costs as the Civic Center was, but certainly something that we want to reflect the spirit of the community.'",
        "'speaker_5': 'And so picking a vendor that we think gets what we're trying to do with this, with this concept is important. And I mean, I don't even know who sits on the committee that makes the recommendation, but I think council should have a say a little bit in terms of what direction we're headed with the company that we're'",
        "'speaker_5': 'going to partner with. This is a very long term partnership and whatever they come up with is going to last for many decades. So.'",
        "'speaker_8': 'So I think part of what is important tonight is hearing that passion from you and from the city council. If that really is something that you want us to focus on, we need to hear that and that know that that's important.'",
        "'speaker_8': 'And so as staff, as we go through our selection process, we definitely, you know, we'll keep that in mind that this is we're looking for somebody that really can embody who we are as a city and not just create a sign and walk away, but rather somebody that really understands this that we will certainly be looking for'",
        "'speaker_8': 'that. And that kind of input is helpful as we go through that, that interview process and brings forward a recommendation to the City Council.'",
        "'speaker_5': 'And have we identified a funding source for the actual gateway signs at this point or no?'",
        "'speaker_8': 'So in the city manager's recommended budget to the council, the mayor and council that was adopted, there was a $400,000 item for this, for it would it would be for the study and for the implementation. And so we don't have a cost yet for what the study would cost versus the versus the full implementation.'",
        "'speaker_8': 'And then we would be looking for some tidelands funds to be able to do the beaches and some of the parking funds for the parking study and the components. So that'll be part of our recommendation. When we come back is what are the different funding sources, what is the cost of the RFP?'",
        "'speaker_8': 'And we want to be able to do it in phases if if something is is bid and it's too high and we don't have the funds to do that, we would certainly go back and and try to negotiate something that's a little bit more palatable and and within our means.'",
        "'speaker_5': 'And if you could just remind me, I think when we were talking about the Gateway signage item, we were talking about signage at the gateway to the city from other cities. So where we border with another city, making it very clear that they've now entered the city of Long Beach and having some sort of a consistent signage'",
        "'speaker_5': 'throughout the city that indicates to the person that's driving into the city that they've now entered a new city. And that's what we're talking about when we're talking about gateway signage.'",
        "'speaker_8': 'Yes, that's correct. We've done a survey in off the top of my head. I believe it's about 27 sites that we've already identified. And we do have some signage out there already. So we do have signage that we've done in the past.'",
        "'speaker_8': 'We're looking to refresh that, to have a new image, to look at those sites, but then also to look at other sites that potentially have been missed or haven't had those improvements and get an inventory of what kinds of signs can go there.'",
        "'speaker_8': 'There is there's Caltrans rules, for example, on what types of signs can go where and what types and what monuments. And there's lots of different components, lighting, you know, what they should look like, how they should look like.'",
        "'speaker_8': 'So that's part of the effort that'll that the firm help us with.'",
        "'speaker_5': 'And what about branding? What are the signs going to say? Because I know in the third district they say we're the aquatic capital of the world right now.'",
        "'speaker_8': 'They say a lot of things. We have a number of different signs. And in the past, it's it's really been based on funding source rather than a consistent methodology. So we do have one or two that say aquatics capital of America, because they helped pay for those.'",
        "'speaker_8': 'Yes, we do have some that say the most bike friendly city because those were paid for by bike dollars. And that was part of our bike bike branding. We do have the international city is that we were the international city.'",
        "'speaker_8': 'We are the international city. So part of our charge to the consultant is look at and it's a it's different than a branding exercise that by itself can be several million dollars to create one brand for the city.'",
        "'speaker_8': 'But it's try to get a consistent feel and look and also look at those slogans. Should we have a slogan? If we do, what should it be? Should there not be a slogan? I look at best practices for these types of signs and give us some some examples of what the what that final word product could be'",
        "'speaker_5': '. And is that going to involve any sort of community outreach? Because I can tell you that aquatics capital of America, as well as probably other organizations, are going to want to be involved in providing some input in regards to whether or not there are slogans and where those are place.'",
        "'speaker_5': 'So what kind of community outreach are we envisioning for this process.'",
        "'speaker_8': 'As we haven't gotten quite to that level of detail yet. We want to see what they're proposing and building through the process, but we can certainly look at some type of input, whether it's in meetings or whether it's some type of online input or some gathering.'",
        "'speaker_8': 'Part of their charge is going to be to look at all of the different ways that we brand ourselves. So there are lots of different stakeholders. There's Aquatics, Captain America, CVB has a very big interest in this, the DOJ and the downtown.'",
        "'speaker_8': 'Our beach groups are going to be very interested, so we want to basically get some information on kind of what what is important, but then really trust kind of this team who does this to try to figure out how to how to best give us a brand or assign a not a brand, but a sign that kind'",
        "'speaker_8': 'of reflects who we are as a community and and then know bring that, that recommendation.'",
        "'speaker_5': 'Great. Thank you.'",
        "'speaker_7': 'Councilwoman Mongo.'",
        "'speaker_1': 'As I appreciate the thorough staff report. Thank you.'",
        "'speaker_7': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'Yes. Thank you for a lot of your questions, Councilman Price, and for bringing this forward. I, too, would like to, you know, just hear more information as we get closer to these seven potential business owners to see what type of branding.'",
        "'speaker_5': 'I know in the downtown area, we are creating a brand new sign that will be installed in May. So I'm wondering how that also affects branding in and around the city, and I'm sure that will be incorporated. Is that correct?'",
        "'speaker_8': 'So that design is actually still moving forward. And so that's kind of designed I think part of their challenge is going to be to look at things that are already existing like that sign and and find a way to get something that unifies a lot of those.'",
        "'speaker_8': 'So it may not be the exact sign because if we just picked one, you know that there's so many different things that that that show who we are as a community. But I think their challenge will be to look at all those existing things that when we do something in an uptown, we do something on Pine Avenue'",
        "'speaker_8': ', kind of take the best elements and try to create something that, you know, that clearly says this is Long Beach when when you see that sign.'",
        "'speaker_5': 'Okay, great. And then I think on my other questions were answered. But final question is how much emphasis did we put on local businesses ensuring that, you know, someone? I think there was an agenda item we put forward.'",
        "'speaker_5': 'Well, Councilman Price may have put forward some time ago. And I had emphasized, especially when we go out to RFP, you know, creating some sort of local components and show we're getting that that business.'",
        "'speaker_8': 'So we do recognize that we have a lot of talent in our city. And so whenever we do have RFP is we we not only encourage people to sign up with RFP, but we also have a specific outreach to local firms.'",
        "'speaker_8': 'And so when the council letter comes back, whoever the item is that was selected, we will definitely make a point of showing, you know, what we did for that kind of local outreach to make sure that we've got that we at least made sure that everyone was aware of what we were doing before they before they had'",
        "'speaker_8': 'a chance to decide if they wanted to submit or not.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Council member your income.'",
        "'speaker_4': 'Many years ago when we created these gateways. Signage. Um. Um. Items that are out there. I was part of a committee at that time. I think it was put together by the by the Chamber of Commerce. They I was president of the Hispanic businesses at the time, so I was invited to participate in a review of of'",
        "'speaker_4': 'what types of signage we wanted to to create. And so I was I was a participant in that. And it was quite, quite a good process in terms of being able to review the types of signage that we wanted to come up with and create and then had a saying adopt it.'",
        "'speaker_4': 'So I do encourage the the participation of a lot of people out there who might be interested in in seeing what type of signage is being proposed and what type of signage we want. But I'm not sure at that time because obviously I was not on the city council this back in his mid-eighties or so early nineties'",
        "'speaker_4': 'when we did this. If the city council got an opportunity to review what the program was going to look like, I certainly would like to have that opportunity to review what's what's being proposed and perhaps have some input.'",
        "'speaker_4': 'When obviously, when I was a member of the Board of trustees, along with City College, we went through the same thing. We looked at different types of designs and different project. It was more of the branding type of effort at that point.'",
        "'speaker_4': 'But the board did review and look at different proposal, different propositions or proposals out there in terms of what would be. That would fit the vision and the mission of the college as well as as the trustees of what they wanted to see.'",
        "'speaker_4': 'So I would I would want to at least if if not a public display of what works or what might not work, maybe an opportunity for the city council to review what's out there, because it will be signage that's going to last for quite some time anyway after I'm gone and people are going to look at that'",
        "'speaker_4': '. So it's going to be iconic. I would think I would want it to be anyway. So if we can have some kind of methodology to participate in that process, I would really welcome that as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Richardson.'",
        "'speaker_3': 'Thanks, Mr. Mayor. Tom, is there is there a way that our business districts can sort of piggyback on this and, you know, if they want to, for example, the Uptown Business District has been working for a while on a wayfinding sign concept for the Atlantic corridor.'",
        "'speaker_3': 'And it seems to me if the city is doing the same thing, maybe our business district can save a little money and maybe, you know, piggyback on this consultant and work out something else. Is it is is anything like that possible or can that be arranged?'",
        "'speaker_8': 'So I think we very much agree with that, is that we would want if somebody else in our city wants to use this service, whoever it is that we end up picking, that there are would not only be economies of scale, but I think it would also make creative and artistic sense so that we don't have someone'",
        "'speaker_8': 'starting with a completely different sign in one area. Even if it's not a city sign, we'd like them to to speak to that. So we'll be definitely as we go through the process of selecting somebody, asking them about that and if there's somebody ready to go right now, they can you know, they can talk to them.'",
        "'speaker_8': 'And if not, I think we'd encourage the firm to be open to, you know, seeing that this could be a larger effort. And my guess is most firms would be very open to that because it means additional work for them and and give a good price.'",
        "'speaker_0': 'Kate, thank you. Public comment on this item.'",
        "'speaker_10': 'Well, good evening again, Mayor. City Council. My name's Gary Shelton. I'm here representing West Gateway Community Association and other folks in the neighborhood that I live in. I need to throw myself at your feet in an act of contrition, because I do not know anything about the April 21st motion or action that was taken by city council'",
        "'speaker_10': 'to put this into into motion. I can see, or at least I glean from the staff report, that the August 10th memo was a to or from or whatever you call those things that that we typically don't see out here in the public.'",
        "'speaker_10': 'And so this has gotten to the point where I believe in understanding some of the conversation that the business community, one or two, at least neighborhood communities who have been working on signage for some time may be at the point where they need to say, Hey, we've done a lot of work on this.'",
        "'speaker_10': 'Can our design be included in this somehow? Can you include can we include you in our design? Something like that. There's been some hiccup, perhaps in public awareness of what's going on, but here we are today and that's just fine.'",
        "'speaker_10': 'One of the things I mentioned, West Gateway Community Association. I wanted to let you know that we have and we're very proud of our our new and it's proprietary our new logo. And I think you might recognize some of the imagery on it.'",
        "'speaker_10': 'We're the West Gateway to downtown Long Beach and have been recognized by the downtown Long Beach Associates. That neighborhood called West Gateway for quite some time. Sometimes it's confused with West End, but it's West Gateway. Nevertheless, we're one of the 27, I assume, areas which do have current existing signage.'",
        "'speaker_10': 'We have some signage up across the street from the courthouse on Broadway and so on. And I would recommend or would have recommended had we had the opportunity. And maybe now is the time. The only time I have to suggest that neighborhood logos such as ours could be included on the citywide branding, something like Welcome to Long'",
        "'speaker_10': 'Beach, the International City. You've arrived to West Gateway or something of that nature. The reason I suggest that is because we all have done so much work. We all do identify closely with our neighborhoods in the city and would really appreciate the opportunity to go forward even early on in this process.'",
        "'speaker_10': 'It seems like there's evidently seven responses to the RFP that have been received but not looked at. Mr. Modica suggested he didn't know if they were bidding on one, two or all three of the components. The gateway component is the one that we're most interested in.'",
        "'speaker_10': 'Thank you and appreciate any way you can come back to us for our additional feedback.'",
        "'speaker_0': 'Any other public comment, please come forward.'",
        "'speaker_6': 'Or you do click as the address. I want to again suggest, but when this did first come up that we take a look at it and a paradigm that would come with some funding from the state and the feds.'",
        "'speaker_6': 'These are the is the roundabout or traffic circle, which, as I pointed out at the time. Is has really a very interesting and you should Google it if people have not done a Google roundabout or Long Beach traffic circle and that we could get state and federal monies, I believe on that.'",
        "'speaker_6': 'I've already talked to the state. We can certainly get some city state money on it. That has a link to a direct link to a federal highway called Route six, which prior to for the two thirds of the first century, was the major East-West route.'",
        "'speaker_6': 'It had a auspicious name, I think. Grand Army of the Republic, because it was used by the Union Army during the Civil War. And at the end of that route, sex is at the end of Cape Cod. And if you go Google it, you'll see there's a sign there that says references route sex and it's historic aspect'",
        "'speaker_6': 'and says it's 363,652 miles west to Long Beach, California. And it's got the sign of that was paid for by the feds or the the historic society and on the in. Massachusetts. So I think those federal funds are there and also the state funds.'",
        "'speaker_6': 'And that also would tie in to this cannon that's been floating around. It's connected to the Civil War. Another suggestion, sort of. Off the wall. That would go set national if not international recognition, recognition on the side. Long Beach, California.'",
        "'speaker_6': 'We're bankrupt. We need your money. Please come spend. Bail us out. Something along the lines of take it to the comic level.'",
        "'speaker_4': 'Although.'",
        "'speaker_6': 'It certainly isn't a you know, it's the truth. Tell the truth. We put that out there, see what the reaction is. We'd certainly get media attention. Think.'",
        "'speaker_0': 'Any other suggestions or comment on this item saying Nonmembers, please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Next item.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-6942 for construction of the Convention Center-Performing Arts Center Pedestrian Bridge on Seaside Way project; award the contract to Powell Constructors, Inc., of Fontana, CA, in the amount of $8,636,496, and authorize a 7.5 percent contingency in the amount of $647,737, for a total contract amount not to exceed $9,284,233; authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto; and accept Categorical Exemption No. 13-118.  (District 2)": [
        "'speaker_1': 'Report from City Manager. Recommendation to award a contract to Pelican Constructors for Construction of the Convention Center Performing Arts Center Pedestrian Bridge on Seaside Way. Project for a total contract amount not to exceed 9.2 million.'",
        "'speaker_0': 'District two. Okay. There's a motion in a second base. Mayor Alonso.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I know that we have a staff report, so if we can hear that, that'll be great.'",
        "'speaker_0': 'Absolutely. Mr.. Mr.. West, this is very, very exciting as it is. This is.'",
        "'speaker_4': 'Incredibly exciting.'",
        "'speaker_8': 'This is going to.'",
        "'speaker_4': 'Be a landmark in the downtown for our convention.'",
        "'speaker_8': 'And visitors bureau bureaus and all that. I'm going to give this over to Tom Modica, who's been heading up Tidelands, and he'll give the staff report with Eric. Thank you, Mr. Mayor. Members of the council as the city manager and the mayor mentioned, and Vice Mayor Lowenthal, I'm sure, is about to mention.'",
        "'speaker_8': 'This is an incredibly exciting project. We have been looking at how to provide some better connectivity down at our convention center. We have a tremendous amount of visitors down there every single year. But if you've ever been down there, you'll notice that times it's very difficult to get from one side of the convention center over to the'",
        "'speaker_8': 'Terrace Theater. Those are two of our are major attractions. And right now the way to get there is to go down the stairs on seaside way kind of back through the back alley is what it feels like in order to get back up into the convention center.'",
        "'speaker_8': 'So in a partnership with the Convention Visitors Bureau, the Convention Center with Vice Mayor Lowenthal, with the mayor, with our city manager, we've really looked at try to re-envision what that could look like and come up with something spectacular that we could be very proud of as a city and also help boost our convention business.'",
        "'speaker_8': 'So this is going to be an asset that will actually help bring in money. It's paid for by Tidelands dollars. And I'd like to turn it over to Eric Lopez, who's going to give us an overview of what the bridge is going to look like and what the major details are.'",
        "'speaker_8': 'So, Eric. Thank you, Tom. And an honorable mayor. Members of the city council. The project is located on Seaside Way between the existing convention center, public promenade and the Convention and the Performing Arts Center Plaza. Currently there is an existing system of bridges and access ways that link the major cultural and civic institutions along Ocean Boulevard and'",
        "'speaker_8': 'Shoreline Drive. As depicted in the pictures on on these lights. The seaside. Seaside way in itself suffers from major disconnection and a lack of flow between the different facilities, which affects the convention centers ability to book additional business.'",
        "'speaker_8': 'The bridge will fill this major gap in the network. The design intends for the project. It draws inspiration from the city's history as a major seaside town and is formally conceived as an abstraction of a breaking wave. What a deck that is composed of multifarious strands of elements paving, seeding and landscape that simulate a boardwalk environment.'",
        "'speaker_8': 'And I will now show you one of the renderings.'",
        "'speaker_4': 'The the bridge will feature.'",
        "'speaker_8': 'Unique LCD lighting accent elements, and it will serve as a gathering space, not just as a as a means to get in from and to the different convention center and performing arts facility. So here's a rendering from the deck.'",
        "'speaker_8': 'This is adjacent to the existing Salvation Army building. Looking westward, as you can see, there are benches, the landscaping. This is a rendering of the daytime hours. We expect up to 1.8 million people that visit our facilities annually to to enjoy this.'",
        "'speaker_8': 'This is a new location at nighttime. The bridge is designed to consist of both a combination of security, lighting and lead. The color changing lights.'",
        "'speaker_4': 'Will be able to be programed.'",
        "'speaker_8': 'For to showcase a different variety of color schemes. And things. Some important facts about the project. It's estimated to cost for construction alone, $9.3 million. The number of existing users that would directly benefit is 1.8 million. In addition to any other visitors that that may visit the the bridge.'",
        "'speaker_8': 'It is designed with the intent of being 100% walkable and will include amenities like drinking fountain as well. The total length of the bridge is approximately 600 feet. It is estimated to be completed in the first quarter of 2017 and it is definitely going to increase the area's connectivity and the flow between the different convention center complex'",
        "'speaker_8': 'facilities. This concludes the presentation. Thank you, Mr. Mayor and Vice Mayor. I'd also like to really thank the vice mayor for constantly keeping this as one of the priorities for the for the Tidelands area. And during the difficult time when we had to actually reprioritized Highlands dollars, really looking and making some sacrifices and some other projects in'",
        "'speaker_8': 'order to make sure that this project was able to move forward and is going to be a tremendous asset to our downtown. And with that, we're available to answer questions.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales. Actually, the first thing that you want to. I'll go to four.'",
        "'speaker_7': 'I did. Thank you. I just wanted to have the staff presentation first. I wanted to thank the staff as well as our development team that will be doing the adjacent development for. Really hanging in there for several years on this issue.'",
        "'speaker_7': 'I think it dates back beyond 2012, but 2012 was probably the first time we had heard from the TED conference in a really solidified way how difficult it was to access the different assets that they used during their conference.'",
        "'speaker_7': 'And CVB has been really clear about how much more marketable and functional our conventions would be if we had those. And so all of these secret pathways that we all know and we know how to get to from in and around the different bridges and the different hallways and stairways and all of that is as quaint as'",
        "'speaker_7': 'it is. I realize how exhausting that could be for someone that's absolutely new to this city. And so I'm very pleased with this. I'd like to thank the Convention Visitors Bureau for being a good partner in sharing with us how what are the different things that we could do to actually improve the assets and services that we'",
        "'speaker_7': 'offer to the public and to our residents? And and really just to improve the accessibility and walkability on this not only on this pedestrian bridge, but it talks to the entire narrative that we have going on in downtown development, that it is a walkable place.'",
        "'speaker_7': 'I'd like to thank staff, especially those that worked on the Tidelands projects, especially Mr. Lopez and his team, for looking at this bridge as not just a access way from point A to point B, what else can be done that in a downtown environment, you have to have multiple uses for each of the assets that we install'",
        "'speaker_7': '. And I'm really, really, very pleased and proud to see the benches and the fountain, the drinking fountain opportunities, just spaces that can be used in different ways. 600 feet may not seem like a lot, considering 5280 feet would be a mile.'",
        "'speaker_7': 'But it is a lot. It's quite a lot. And I, I envision that we will use this space and the community will come up with interesting ways to use the space, just as they did with the with the promenade and how they're not just walking through it, but looking at it as opportunities to create a public living'",
        "'speaker_7': 'room. So I expect this to be a part of our public living room. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Richardson.'",
        "'speaker_5': 'You mean Gonzales?'",
        "'speaker_4': 'So, yeah.'",
        "'speaker_0': 'My bad. I'm Councilwoman Gonzalez.'",
        "'speaker_5': 'That's okay. I just simply wanted to say congratulations to city staff and Vice Mayor Lowenthal, who I know has been very involved in this process and downtown continues to look better. I'm glad we're finally at this point. So thank you.'",
        "'speaker_0': 'Councilman Richardson.'",
        "'speaker_3': 'So I just want to say this. Look, this is spectacular. I really I really think this looks great. I had a tough time figuring out where exactly it is. But I think between Pat and myself, we figured out where this thing is going to go.'",
        "'speaker_3': 'I think something to note, which actually makes me pretty excited, is that these architects. SPF, these guys are the same folks that are designing the new Highland Park Community Center. And by this standard, I mean the fact they were to take something very simple and really make it beautiful and elegant and something inviting.'",
        "'speaker_3': 'And I love the term public living room. I think that's great. I think we have a lot of stuff to look forward to with our proposed Highland Park Community Center. If this is any way, by any means, a standard.'",
        "'speaker_3': 'So thank you so much and congratulations to all.'",
        "'speaker_0': 'Catherine Andrews.'",
        "'speaker_9': 'Yes. Thank you. You know, I'm looking at this and I think this is fantastic. But as you know, I'm always looking at where are the jobs coming from? How many jobs would be created from this situation and where are they coming from?'",
        "'speaker_8': 'So this is one of the projects that will be covered by a project labor agreement. So we do have local jobs that will be associated with this and tidelands. The definition is is a little bit broader than our local one, but we will be looking at local jobs, as many as we can for this and for the'",
        "'speaker_8': 'number of jobs. I'll ask Eric Lopez if he has an estimate. We have the number of jobs that it will help retain for workers that are residents of the city of Long Beach. And that number is five. Five full time construction jobs for residents within the city of Long Beach.'",
        "'speaker_8': 'There's going to be hundreds more construction related jobs than for the overall project. And those would fall under the region, the regional part of the project labor agreement.'",
        "'speaker_0': 'But the regional also could be Long Beach people too.'",
        "'speaker_8': 'So absolutely.'",
        "'speaker_0': 'They certainly think five is not completely accurate, I think.'",
        "'speaker_8': 'So five has to do with it. When we look at our bidder, they actually have we asked always ask them how many jobs do you currently employ in Long Beach? And so that's that number, that's five. As we go out and look for jobs, those hundreds of jobs that we'll be constructing and will absolutely be trying to'",
        "'speaker_8': 'get as many as Long Beach opportunities as possible to and we'll be using our play as well.'",
        "'speaker_9': 'I guess I just like to get a chance to speak with you on that, if you don't mind. Thank you.'",
        "'speaker_0': 'Thank you. Any public comment on this bridge? Come forward, please.'",
        "'speaker_10': 'Thank you so much, Mr. Mayor. Gary Shelton. Again, I wish the two empty seats were filled so that this could be completely unanimous. I'm so excited about this project. I want to mention to you briefly to tell a short story, if I can.'",
        "'speaker_10': '15 years ago, some of you might recall when when I had my wheelchair and I was learning to walk and stuff again and and going up and down, seeing from ground level Ocean Boulevard and noticing a whole bunch of signage, advertising signs in the in the front yards of the the high rises on Ocean Boulevard between Alamitos'",
        "'speaker_10': 'and Golden. And I thought, hmm, okay. So I wonder what this is all about. And I and I learned that that 80 foot strip inward from the curb line is Linkin Park and Santa Cruz Park. And that those signs were in encroaching encroaching into that parkland.'",
        "'speaker_10': 'And so I created a community event called Picnic in the Park, and it was a beautiful, sunny Saturday afternoon. There were 200 people that were throwing volleyballs and playing croquet and having picnics and and this and that simply to illustrate to the folks that lived in those buildings that they had a front lawn that was a park'",
        "'speaker_10': 'that they were entrusted to maintain as a park. The Victory and Santa Cruz Park guidelines include the area above sea side way on the top of the bluff as a public property and any buildings that have been built there since the time of the instigation of Victory Park and Santa Cruz Park guidelines have to have that as'",
        "'speaker_10': 'open space and open to the public. This, I got to tell you, folks, is without any kind of an argument, the most forward looking, dynamic, appearing addition to the city in compliance with the Victory Park guidelines that maybe they didn't even know that that's what they were doing.'",
        "'speaker_10': 'But this is such an exciting thing and I am so glad to be able to anticipate now. I think we've got nine folks there, nine folks to vote for it. Thank you so much.'",
        "'speaker_0': 'Any other public comment?'",
        "'speaker_6': 'I echo the comments about the Victory Park and an important the nice job the community has done on that. I wish you people were here about 20 minutes ago when we were talking about the budget situation and the financial crisis this city faces.'",
        "'speaker_6': 'I fully support the visitors and the convention bureau, but we are not in a position to spend $9 million at this time for a project like that. The convention bureau has built the convention center has been here. As long as I've been here.'",
        "'speaker_6': 'And people have always found a way to it. Period. So until such time as we are in a financial position to do so. I would shelve these plans. We don't have the money. Again, go back and listen to the tapes for those people who were here about 20 minutes ago or 40 minutes ago when we were discussing'",
        "'speaker_6': 'the budget. And maybe you'll get a better understanding of what the concern is. In addition, if you want to know what it looks like. I just invite you to come down here some evening at Lincoln Park around the library and see what's here after 6:00.'",
        "'speaker_6': 'Or on Saturday or on Sunday. And that's what you will see gathered around that new walkway. And if you don't. Think that you really have no understanding of human use patterns and so forth. Thank you.'",
        "'speaker_0': 'Thank you. Before we go to the vote, just as a reminder, this is the Tidelands Fund. This is not the general fund. And so very different funding sources. Members discordant Castro votes coming from.'",
        "'speaker_1': 'Councilman Andrews. Motion carries.'"
    ],
    "Recommendation to adopt Specifications No. RFP CM16-059  and authorize City Manager to execute a contract, and any amendments thereto, with Dentons US, LLP, of Washington, DC, for federal legislative representation services, in an annual amount not to exceed $138,000, for a period of one year beginning March 1, 2016, with the option to renew for two additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'That's the.'",
        "'speaker_0': 'Next item.'",
        "'speaker_1': 'Please report from City Manager Recommendation to execute a contract with Dentons US. For Federal Legislation Legislative Representation Services in an annual amount not to exceed $138,000 citywide.'",
        "'speaker_0': 'Mr. West.'",
        "'speaker_4': 'Diana Tang will present this exciting report. We have a new lobbyist.'",
        "'speaker_5': 'Mayor, members of the City Council. We are pleased to be bringing to you Dentons as the firm that staff is recommending for our Federal Legislative Advocacy Services in DC. Staff issued a request for proposals in.'",
        "'speaker_7': 'December.'",
        "'speaker_1': '2015 and evaluated five firms. We chose Dentons based.'",
        "'speaker_7': 'On their qualifications and costs for.'",
        "'speaker_5': 'Services. Dentons is the largest law firm in the world, and John Russell has put together a strong bipartisan.'",
        "'speaker_1': 'Team to advance.'",
        "'speaker_5': 'The city's legislative agenda. John and his colleague Derry Saga is here tonight with us, and I would like to invite them to say a few words.'",
        "'speaker_4': 'Well, good evening, Mr. Mayor. Members of the council, it's a pleasure to be with you here tonight, not the least of which, because there's no ice and snow on the ground, which we left yesterday. We stand before you representing a core team of 25, 25 advocates in Washington and a team of 125 to participate in the public'",
        "'speaker_4': 'policy and regulation practice at Dentons. All stand ready and willing to serve you. More importantly, all are excited to serve you. We know that our job means our clients are the city's citizens. And we humbly accept that mantle.'",
        "'speaker_9': 'Very.'",
        "'speaker_4': 'Thank you. Hi. Excuse me. I'm Darry Sragow.'",
        "'speaker_0': 'I don't live in Washington and I don't lobby. I'm the managing partner of the Los Angeles Office of Demos, which, as you heard, is the largest law firm in the world. And I spent much of my life running political campaigns in California.'",
        "'speaker_0': 'I met a gentleman by the name of Alan Lowenthal in his in his campaign headquarters in 1998, when he aspired to be a member of the state legislature and worked very extensively around the state, used to work in the U.S. Senate.'",
        "'speaker_0': 'And my role here will primarily.'",
        "'speaker_4': 'Be to be the.'",
        "'speaker_0': 'Person you can reach on California time on the ground locally while John Labor is in Washington DC with the team as you.'",
        "'speaker_4': 'Heard of a couple of dozen lobbyists to take care.'",
        "'speaker_0': 'Of your needs in in the nation's capital. Long Beach has a story to tell. It has money to ask.'",
        "'speaker_4': 'For to help.'",
        "'speaker_0': 'With the funding needs of the city. John and I have been sitting through the entire council meeting hearing about those needs, and we are honored and pleased to have been chosen. Long Beach is a place that is very.'",
        "'speaker_4': 'Intriguing to us, very frankly, to.'",
        "'speaker_0': 'Carry your banner in Washington. And we look forward to being helpful to you. So thank you. Thank you. I'm a conservative, Councilman Richardson.'",
        "'speaker_3': 'Thank you, Mayor Garcia.'",
        "'speaker_0': 'And please go ahead, you guys grab a seat. Thank you very much.'",
        "'speaker_3': 'So so again, thank you. I want to thank staff Diana Ting for really making sure that the federal pledge committee was being engaged in this process. You know, I serve as the Fed, the Fed, the chair of our Fed large committee, our federal legislative committee.'",
        "'speaker_3': 'And I think that our agenda has been I mean, our committee has worked really hard to make sure it's reflective of this sort of dynamic and innovative council and have ideas that come out of this council. I think this is a necessary change to bring on a new firm with the energy and the wherewithal to really keep'",
        "'speaker_3': 'up with this agenda. Long Beach is a large city and we help drive the national conversation on a number of really important, critical issues from goods movement to climate change, a number of other things. You know, Long Beach's advocacy was important in how we were able to help support dedicated freight, get into the six year transportation bill'",
        "'speaker_3': '. We can do that uniquely because we are a port city and we're important. So I think it's important that that we brought these guys in. I'm really excited. I did have a chance to meet John and Dairy just prior to this meeting, and I think they're really excited and they they really have a sense of what our'",
        "'speaker_3': 'priorities are as a council. I think they're excited to work with us, and that's really important to have a group that really doesn't see us simply as another name on the list, but really an opportunity to really build something special here with us.'",
        "'speaker_3': 'So again, I'll be voting in support. I encourage my colleagues to vote in support. And welcome to the team.'",
        "'speaker_0': 'Thank you. Next up is Councilwoman Gonzalez. Sorry, Councilwoman Mongo. Nancy, I skipped the last time I was moving you up.'",
        "'speaker_1': 'Thank you. I had a great opportunity to meet with our new team today, and I am very excited about the possibilities. I think that they are in tune in understanding what Long Beach needs. I think they are going to be great boots on the ground in DC and advocating for us.'",
        "'speaker_1': 'I know I spent a good amount of time talking with them about C-17 and the transition and jobs for our community and that that's a priority. Infrastructure, of course, is a priority for our port and ensuring that those one in eight jobs that are here in Long Beach stay in Long Beach.'",
        "'speaker_1': 'And knowing and understanding what those needs are to make sure that our tax money comes right back here to the great city of Long Beach. So I look forward to working on dynamic and thought changing legislation that can really move the dial for us across the country.'",
        "'speaker_1': 'And I look forward to their ideas and working with the think tanks and so on and so forth and DC, I think that'll really step us ahead of the game in terms of the next allocation of funding and where we're going with that.'",
        "'speaker_1': 'So thank you for your ideas. Thank you for your input and I really appreciate that. We're going to be working with you.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_5': 'Q And as the third member of the Federal Legislative Committee, I also encourage support from my council members to vote in favor of this. I think it's it's wonderful a change of pace for us as we've gone to meetings in D.C. and talked about many of our priorities, which are very important.'",
        "'speaker_5': 'I know I've often encouraged my council members to my colleagues here to think about the west side of the city and Shoemaker Bridge. And I know Diana has been wonderful at help and helping push that. In terms of transportation, we've gone to the Department of Transportation and talked about that in length.'",
        "'speaker_5': 'And so I look forward to working with you. I really do. And I know we'll be meeting soon as well. Appreciate it.'",
        "'speaker_0': 'Thank you. Any other public comment? Hi. On this issue on the on the on this contract. Right. Or is it just a general public comment?'",
        "'speaker_2': 'Yeah. It's, uh.'",
        "'speaker_0': 'If it's okay, if it's if it's general, we're going to have it at the end of the meeting. There'll be general public comment. If it's on this item, you can you can come now.'",
        "'speaker_2': 'Oh, good. Thank you. I'm going over.'",
        "'speaker_0': 'Okay. Thank you. Mr. Good. You.'",
        "'speaker_6': 'This has to be, I think, the single most intelligent thing that this council is having at this council has ever had before it. And I fully support it. I'd like to suggest you amend the motion. To point out and to ensure that there will be a correlative elimination of any travel.'",
        "'speaker_6': 'To Washington by any council person. But but there will be a correlative allowance for increased in Skyping period. These people. And I haven't worked with them before. But in the previous lobbyists we've had, they've been very effective and the last thing they need is some political hack coming a trailing along on a route on a political junket'",
        "'speaker_6': 'period. So to show the good faith. What you should do is amend the motion. That each of you pledged. Never, ever to use taxpayer money to go to Washington. And. Skype. All you want. Period. Don't get in their way.'",
        "'speaker_0': 'Thank you. See no other public comment. Members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive and file the Fiscal Year 2015 Year-End Budget Performance Report, and increase appropriations in several funds across several departments for various purposes to reflect final expenditures and carryover clean-up.  (Citywide)": [
        "'speaker_0': 'Well, Mr. Good, he wants to Skype into the meetings is what he's working to. We're now moving on to the next item.'",
        "'speaker_1': 'Please report from Financial Management Recommendation to receive and file the fiscal year 2015 year end budget performance report and increase appropriations in several funds across several departments for various purposes to reflect financial expenditures and carryover cleanups citywide.'",
        "'speaker_9': 'Is there somebody born in this place?'",
        "'speaker_4': 'Yes, there is. Leah Erickson, our deputy finance director.'",
        "'speaker_1': 'Good evening. Good evening, Mayor and city council. This is the urine performance report prep by 15 for the period ending September 30th, 2015. It reports that our performance for the fiscal year 15 and also includes a few technical adjustments for the year.'",
        "'speaker_1': 'Generally, the report is good news. Citywide urine spending came in under budgeted appropriation for the general fund and for all other funds. After factoring in into technical adjustments in the general fund, department spending was under budget due to some 14 and 15 fiscal year budgeted one times that could not be spent by year end due to the'",
        "'speaker_1': 'timing of projects being extended and savings for most departments, including the police departments, plan savings that has already been included in the budget to cover a portion of the Academy class scheduled to begin in April of 16. On the revenue side of the general fund, revenues did exceed estimates primarily due to some one time revenues, including revenue'",
        "'speaker_1': 'from the realignment of funds from a ground lease at the park. State reimbursements for mandate related costs incurred prior to 2014 or 2004, and reimbursements for wildland fire deployments. In addition, there were structural revenue growth in areas such as property tax, transit occupancy, tax, electricity related revenues and business license tax, among others, which has been factored in'",
        "'speaker_1': 'the projection shown in November or ever. Overall, the general fund had a 4.2 million surplus and there was also a surplus of approximately 900,000 in the Uplands Oil Fund in accordance with City Council policy. The city manager is proposing that 5% of those surpluses in both the general fund and uplands be set aside for unfunded liabilities.'",
        "'speaker_1': 'The city manager has also proposed setting aside funds for conducting two police academies in 16 and funding for a police department police department pilot program for additional helicopter flight hours, and also setting aside the savings from the legislative and city auditor's departments.'",
        "'speaker_1': 'After the recommended use of funds available, the remaining ending funds available for the general fund is approximately $1 million. This provides the ability to cover the election cost of any potential city wide revenue measure that may be put on the ballot for June.'",
        "'speaker_1': 'Lastly, there are some technical adjustments for appropriation increases offset by revenue and budget reallocations in Parking and Business Area Improvement Fund and the Community Development Grants Fund. This concludes the staff report and I'm available for any questions you may have.'",
        "'speaker_9': 'Thank you, Councilman Rich.'",
        "'speaker_3': 'Thank you, Leah. Mr. West, thank you so much for for presenting this. Let me just take a look at this again. So I think it's fantastic that we're making these investments because we have saved this money and congratulations and great work on saving this money in the last fiscal year.'",
        "'speaker_3': 'I think it's important to note, and I think this is a is prudent that we're maintaining this 5% policy on unfunded liabilities. In terms of the I see we have extra hours on our police helicopter into academies. I think that's certainly in line with the theme that we've had tonight.'",
        "'speaker_3': 'I think setting aside funding for these other purposes and and in terms of the election is good. So I guess my question would be, after those are set aside, we make those allocations. Are there was there anything left over that the city council can allocate, let's say, on a divided by nine basis to make.'",
        "'speaker_1': 'Councilmember Richardson there is at ending funds available projected of about $500,000 in the general fund, which we do recommend as a minimum funds available, especially since oil prices are or were closely monitoring oil prices this year. So at this point, we are not recommending allocating any of that those funds available.'",
        "'speaker_3': 'Help me understand that. So there's $500,000 left over and you're saying we're going to put it in a reserve or what are you saying we do with that?'",
        "'speaker_1': 'Council member we're using we're just keeping that unspent in case there are problems with oil revenues that happened later. Oh, okay.'",
        "'speaker_3': 'I get it. I'm good with that. Thank you.'",
        "'speaker_0': 'Councilman Mongo.'",
        "'speaker_1': 'Thank you, John and Leah. Excellent presentation and well-written document. I think that maintaining our prudent fiscal practices is warranted, and I hope the Council will be supportive of maintaining that. Thank you.'",
        "'speaker_0': 'Thank you. Any public comment on this item? St Andrews cast your votes.'",
        "'speaker_1': 'Councilman Andrews motion carries.'"
    ],
    "Recommendation to adopt Specifications No. RFP AP15-153 and authorize City Manager to execute a contract, and any amendments thereto not exceeding the authorized amount, with ABM Parking Services, of Los Angeles, CA, for airport parking operations and management at the Long Beach Airport, in an annual amount not to exceed $1,054,122, with an annual increase no greater than the Consumer Price Index adjustment, authorize a 25 percent contingency in the amount of $263,531, for a period of three years, with the option to renew for two additional one-year periods, at the discretion of the City Manager.  (District 5)": [
        "'speaker_1': 'Motion carries. Item 15 Report from Long Beach Airport Recommendation to execute a contract with ABM Parking Services for airport parking operations and management at the Long Beach Airport in an annual amount not to exceed $1 million. City District five Councilman Mongo.'",
        "'speaker_1': 'So I'm hoping that the staff report includes the $40,000 a month we'll be saving.'",
        "'speaker_4': 'Brian Francis will give that staff report.'",
        "'speaker_9': 'Awesome.'",
        "'speaker_3': 'Good evening there, Garcia. Members of council this evening were requesting city council approval to enter into contract negotiations with ABM Parking Services to provide airport parking operations and management of the airport's public parking facilities. These operations comprise lot A, Lot B and the employee parking lots.'",
        "'speaker_3': 'The airport worked with the purchasing department and advertised a request for proposals on August 27th, 2015 of nearly 4000 potential proposals. 37 download of the RFP for the local outreach was executed via the purchasing department as well. Eight proposals were received on October 15th, 2015.'",
        "'speaker_3': 'Each complete proposal was evaluated by a selection committee based on demonstrated competence, experience and performance of comparable engagements. Reasonableness of cost expertize and availability of key personnel, financial stability and conformance with the RFP terms. The committee determined that ABM Parking Services of Los Angeles, California offered the best proposal to provide the service at Long Beach Airport.'",
        "'speaker_3': 'ABM operates at airports nationwide, across the spectrum in terms of size. It is provided parking management services at an airport for the past decade and has maintained a good level of customer service throughout. The intent to award was posted by the Purchasing Department on January 12th, 2016 and no protests were received by the January 17th deadline.'",
        "'speaker_3': 'The contract is for a period of three years and an amount not to exceed $1,054,122, with a 25% contingency in the amount of $263,531. Requesting authorization of a 25% contingency as we feel it is the appropriate and necessary amount to accommodate additional services requested of ABM during the life of this agreement, which may include software upgrades, replacement'",
        "'speaker_3': 'of equipment, staffing, augmentation and unforeseen maintenance and repairs, among other things. And it's Councilwoman Mongo. I mentioned at the beginning of this item, the current contract amount or the current amount that we're paying on an annual basis is roughly $1.5 million.'",
        "'speaker_3': 'And again, as presented to you this evening, this contract is for a three year period of three years and an amount not to exceed $1,054,122 per year. So that would be a savings over the current arrangement. And that concludes my staff report.'",
        "'speaker_1': 'So I want to thank you for your work on this. I know that this hadn't been scheduled and or executed in quite a long time. I feel that in the amount of time we've been working together, we've been reconciling many issues that hadn't been touched in quite a long time, and I hope to wrap many of those'",
        "'speaker_1': 'up shortly. I know that there were questions related to the proposal and the lack of innovation and or technology in it. But I will say that while I wish there was more technology, I think that while the airport is running in the lean as it can possibly be, I think that the movement towards a reduction in cost'",
        "'speaker_1': 'is really a good step in the right direction. I think that's the way that the bid should be cherished and that since it is only a three year, that the airport will look very different in three years, hopefully in terms of the economy and hopefully oil prices and we'll see what that looks like.'",
        "'speaker_1': 'And then perhaps people will be driving their cars and parking them at the airport again, which will then increase our revenue in parking, which is currently down. So while I was in many discussions today with airport stakeholders and residents who live near the airport specifically asking about those technologies, I think at this time this is the prudent'",
        "'speaker_1': 'way to go. And I will be asking my colleagues to support this item.'",
        "'speaker_7': 'Thank you, Councilwoman Mongo. Councilman Austin.'",
        "'speaker_4': 'Yes. Thank you very much. I am to pleased to see that this will this contract will actually save us as a city. But I think it saves us as an airport because as I understand it, the revenues for this, for the airport parking stays within the airport fund, is that correct?'",
        "'speaker_4': 'Yes, sir, that's correct. All right. So there is no tangible benefit to the general fund for this contract, right?'",
        "'speaker_3': 'That is correct. The all the revenues generated from parking services, as well as other revenue generation on airport remain at airport. Aside from the various arrangements we have with other city departments for for services rendered.'",
        "'speaker_4': 'Okay. Thank you. I'll be supportive of this because I think it's a prudent move for the airport, but I just wanted to make that distinguishable difference. Thank you.'",
        "'speaker_7': 'Thank you. Is there any public comment on item 50? CNN members cast your vote.'",
        "'speaker_1': 'Basically alone, though.'",
        "'speaker_7': 'I mean. Yes.'"
    ],
    "Recommendation to receive and file the application of LB Beadels, LLC, dba The Breakfast Bar, for a premise-to-premise and person-to-person transfer of an Alcoholic Beverage Control License, at 70 Atlantic Avenue.  (District 2)": [
        "'speaker_1': 'Motion carries. Item 16 report from police recommendation to receive and file the application of the breakfast bar for a premise. The premise and person to person transfer of an ABC license at 78 Atlantic Avenue District two.'",
        "'speaker_7': 'Thank you, sir. Staff Report.'",
        "'speaker_4': 'Commander Conant. Good evening, honorable mayor, vice mayor and City Council. Item 16 is an application for a type 47 on sales. ABC License for a restaurant. The restaurant currently operates under a Type 41 license authorizing the sale of beer and wine.'",
        "'speaker_4': 'The license will authorize the furnishing of beer, wine and other distilled spirits to the patrons.'",
        "'speaker_3': 'The police department.'",
        "'speaker_4': 'Has conducted and concluded their investigation and does not anticipate any adverse impact with the issuance of this license. That concludes my report and I'm available for any questions.'",
        "'speaker_7': 'Thank you. There's been a motion and a second. Is there any member of the public that wishes to address the Council on this item? Seeing None members cast your vote. Councilmember Richardson.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive and file the application of Beer Belly, Incorporated, dba Beer Belly, for an inter-county premise-to-premise and person-to-person transfer of an Alcoholic Beverage Control License, at 255 Long Beach Boulevard.   (District 2)": [
        "'speaker_7': 'Thank you. Item 17.'",
        "'speaker_1': 'Report from police recommendation to receive and file the application of beer belly for an Inter-County premise to premise and person to person transfer of an ABC license at 255 Long Beach Boulevard, District two.'",
        "'speaker_7': 'Thank you, sir. Staff Report.'",
        "'speaker_4': 'Commander Konate. Honorable Vice Mayor City Council Item 17 is an application for a Type 47. Person or person premised the premise on sole ABC license for a restaurant. The police department has conducted our investigation and do not anticipate any adverse impact to the for the issuance of this license.'",
        "'speaker_4': 'That concludes my staff report and I'm available for questions.'",
        "'speaker_7': 'Thank you. And I just wanted to make some comments. I'd like to welcome the owner and Jimmy Horn, who's in the audience today and to I'd like to welcome to the neighborhood and thank you and your wife for investing in Long Beach for their second restaurant.'",
        "'speaker_7': 'The first one is in Koreatown. And thank you also for taking the time to meet with my staff about verbally and sharing a little bit about your vision. I think you when you look around, you'll see how very fitting it is.'",
        "'speaker_7': 'And so we appreciate your focus on food and craft beverages. Aside from fitting in really beautifully with our craft beer and foodie culture, I do look forward to having our folks come join you at some time. More and more, our downtown is expanding.'",
        "'speaker_7': 'I think it's really become a very welcoming place. And you probably saw the L.A. Times article a couple of weeks ago about the craft brew culture shaping up in our town. So thank you. I'd like to thank you for really your confidence in our city and with this council and and prior members have done to make this'",
        "'speaker_7': 'a very welcoming place for business as well as for entertainment and residents. And so it's that full 24 three shift culture, not quite 24 hours, but close enough that I think will make our downtown very exciting. So with that, there's been a motion and a second.'",
        "'speaker_7': 'And I also want to encourage you to stay in touch with our office. I think it's a great start. And as you continue to expand in your patronage there, it'd be nice to have that contact. Members, cast your vote.'",
        "'speaker_7': 'I'm sorry I didn't call for public comment. Is there any member of the public who has to address this council on this item? Seeing none. Members, cast your vote.'",
        "'speaker_2': 'Councilman Andrews.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive the application of AI California, LLC, dba Aldi, for an original application of an Alcoholic Beverage Control License, at 4580 Atlantic Avenue, determine that the application serves the public convenience and necessity, submit a Public Notice of Protest to ABC, and direct City Manager to withdraw the protest if a Conditional Use Permit is granted.   (District 8)": [
        "'speaker_1': 'Motion carries. Item 19 Report from Police Recommendation to receive the application of Aldi for an original application of an ABC license at 4580 Atlantic Avenue. Determined that the application serves the public convenience and necessity. Submit a public notice of protest to ABC and direct City Manager to withdraw the protest if a conditional use permit is granted.'",
        "'speaker_1': 'District eight.'",
        "'speaker_4': 'Councilman Austin Yes, I am very excited about this new development. I'd like to welcome the very first Aldi to Long Beach. It'll be located in the big Knowles or just next door to the biggest we no shopping center.'",
        "'speaker_4': 'This is actually one of three new grocery stores coming to the eighth District this year. This conditional conditional use permit for this Aldi is scheduled to be heard before our planning commission this Thursday. So while the City Council must vote to protest the ABC license this evening due to a lack of a copy, the protest may be'",
        "'speaker_4': 'withdrawn very shortly if the CP is granted it. And so therefore I would ask for your approval of the staff recommendation.'",
        "'speaker_7': 'Thank you, Councilmember Mongo.'",
        "'speaker_1': 'I support the new development.'",
        "'speaker_7': 'Thank you. So any member of the public that wishes to address Council on item 19. Seeing None members cast your vote.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7012 for Orange Avenue, between 52nd Street and 64th Street; award a contract to Sequel Contractors, Inc., of Santa Fe Springs, CA, in the amount of $2,333,215, and authorize a 10 percent contingency in the amount of $233,322, for a total contract amount not to exceed $2,566,537; authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto; and consider Categorical Exemption No. CE 14-125 (15301, Class 1).  (Districts 8,9)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_7': 'Item 20.'",
        "'speaker_1': 'Report from Public Works and Financial Management. Recommendation to award a contract to school contractors for street improvements on Orange Avenue between 52nd Street and 64th Street for a total contract amount not to exceed 2.5 million District's eight and nine.'",
        "'speaker_7': 'Councilman Austin.'",
        "'speaker_4': 'Thank you. And this is another very exciting development for Uptown. This will this this contract will really, really help make a big difference on Orange Avenue. We spent a lot of time today talking about infrastructure needs. And this will address serious infrastructure needs in an area that is long overdue for for resurfacing and repair.'",
        "'speaker_4': 'And our residents up there are very excited about the prospect of having a new street on Orange Avenue, both in eighth and ninth District. And so I would ask for your support for this.'",
        "'speaker_7': 'Councilmember Richardson.'",
        "'speaker_3': 'Well said, Councilmember Austin. I think we should note this is this is a two and a half million dollar investment into North Long Beach is a very important Orange Avenue is a very important corridor. This is from the Carmelita goes to Grant Elementary School.'",
        "'speaker_3': 'This has bicycle enhancements and a number of other things that are really important in that area. So so this is this is really good. And I look forward to cutting the ribbon on this in partnership with Councilman Austin.'",
        "'speaker_7': 'Thank you. Is there any member of the public that wish to address the Council on item 20? Seeing none. Members Cast your vote.'"
    ],
    "Recommendation to authorize City Manager to execute an amendment to Agreement No. 23214 with Tiburon, Inc., to provide software support services for Computer-Aided Dispatch and Records Management Systems, in an amount not to exceed $402,327 for an additional 12-month term through February 2017.  (Citywide)": [
        "'speaker_1': 'Councilman Mongo. Motion carries. Item 21 Report from Technology and Innovation Recommendation to Execute an amendment to Amend Amendment to agreement with Tiburon to provide software support services for computer aided dispatch and records management systems in an amount not to exceed $402,000 citywide.'",
        "'speaker_7': 'Is there a staff report?'",
        "'speaker_4': 'Our Technology Innovation Director, Brian Stokes. Vice Mayor, member City Council before you is a recommendation to authorize the City Manager to execute an amendment to the agreement of 2321 four with Tiburon to provide software services for our CAD system, our records management system in an amount not to exceed $402,327.'",
        "'speaker_4': 'It's for a 12 month term, and I'm available for any questions after that.'",
        "'speaker_7': 'Thank you, Councilman. Councilmember, Your Honor.'",
        "'speaker_4': 'Thank you, Mayor. This is an important tool that our police department uses. And in tracking the vehicles and other. In other issues that the cap comes out to. I strongly support them. Thank you for the opportunity to comment.'",
        "'speaker_7': 'Councilman Andrews. You too. Thank you. Is there any member of the public that wish to address Council on item 21? CNN members cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to adopt resolution increasing appropriations in Fiscal Year 2014-2015 in the Water Fund (EF 310) in the Water Department (WA) by $6,500,000.  (Citywide)": [
        "'speaker_7': 'Item 22. Yes. No.'",
        "'speaker_1': 'Yes. Yes. Report from Water Recommendation to Adopt Resolution Increasing Appropriations in Fiscal Year 2014 2015 in the water fund. In the water department by $6.5 million citywide.'",
        "'speaker_7': 'Is there a staff report? I don't see the water department here.'",
        "'speaker_4': 'We can have one. The water? What's your.'",
        "'speaker_1': 'Name?'",
        "'speaker_7': 'I'm sorry. I see you.'",
        "'speaker_4': 'Are our new water director. Fresh. Brand new. Chris Garner.'",
        "'speaker_2': 'Still the wet.'",
        "'speaker_10': 'Still wet behind the ears. But I'm.'",
        "'speaker_4': 'Here. Good evening.'",
        "'speaker_10': 'All this is is a we're asking for an appropriation increase for six and a half million dollars.'",
        "'speaker_4': 'The good news is this was fully reimbursable by the Y replenishment district.'",
        "'speaker_7': 'Thank you, Councilman Andrews. Okay. Councilmember Richardson. Fabulous. Is there any member of the public that wish to address Council on item 22? Seeing None. Members Cast your vote. Motion carries.'"
    ],
    "Recommendation to request that District One's carry-over funds from 2014-2015 in the amount of $29,102 be directed to the district office budget. These funds will be used for District One community and neighborhood events and meetings.": [
        "'speaker_1': 'Item 23 Communication from Councilwoman Gonzalez recommendation to request that District Ones carryover funds from the 2014 2015 fiscal year in the amount of $29,102 be directed to the District Office budget.'",
        "'speaker_7': 'So staff report.'",
        "'speaker_4': 'This is a request from District one to carryover funds that aren't going to be utilized for infrastructure for other purposes.'",
        "'speaker_7': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_5': 'Yes. And I think this was just in response to a changed policy that we had from the city manager's office. So that's what we'll be doing. Thank you.'",
        "'speaker_7': 'Councilmember Richardson.'",
        "'speaker_3': 'I support it and I anticipate a bunch of these coming forth with this new change in policy. But I'm glad to see it being worked through.'",
        "'speaker_7': 'Thank you. I appreciate that as well. Is there any member of the public that wish to address Council on hearing item number 23? Seeing None members cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to adopt resolution in support of National Teen Dating Violence Awareness and Prevention Month in February.  (Citywide)": [
        "'speaker_7': 'Item 24 has been withdrawn and we've taken up item 25. Item 26.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to Adopt Resolution in support of National Teen Dating Violence Awareness and Prevention Month in February Citywide.'",
        "'speaker_7': 'Thank you. It's an emotion and a second. Councilmember Richardson.'",
        "'speaker_3': 'Moved to support.'",
        "'speaker_7': 'Councilman Andrews. All right. So any member of the public that wished to address council on item 26. Seeing None members cast your vote.'",
        "'speaker_1': 'Councilwoman. One motion carries.'",
        "'speaker_7': 'I believe that is it for a formal agenda?'",
        "'speaker_4': 'Yes.'",
        "'speaker_7': 'New business. First for public comment.'",
        "'speaker_1': 'First public comment.'",
        "'speaker_7': 'If there's any member of the public that wish to address council during this time. General public comment please come forward and do so. Did you have comments? You did.'",
        "'speaker_2': 'The man was in the long range. I just want to say hi to Stacey and home over there. Tell me. Tell you how. Because Deandra in the city council support. No. Yeah. A lot of support from the party.'"
    ]
}