{
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and adopt resolution continuing the Fourth Street Parking and Business Improvement Area assessment for the period of October 1, 2015 through September 30, 2016; and authorize City Manager to extend the agreement with the Fourth Street Business Improvement Association for a one-year term.  (District 2)": [
        "'speaker_4': 'Thank you. I'd also like to make another announcement, and that is that hearing item three has been withdrawn and item 16 will be considered under the consent calendar. So, Madam Clerk, hearing item.'",
        "'speaker_1': 'One. Report from City Manager Recommendation to receive supporting documentation into the record, conclude the hearing and adopt the resolution. Continuing the Fourth Street Parking and Business Improvement Area Assessment for the period of October 15 through September 16, and authorize the City Manager to extend the agreement with the Fourth Street Business Improvement Association District to.'",
        "'speaker_4': 'Leicester City manager. Assistant City Manager.'",
        "'speaker_2': 'Vice Mayor Lowenthal, members of the City Council. The staff report will be provided by Mike Conway, Economic and Property Development Director.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you very much. This item is the annual approval of the Fourth Street Parking and Business Improvement Area Annual Report and Ongoing Assessment. On August 11, 2015, City Council approved a resolution granting approval of the annual report and set today's date for the public hearing.'",
        "'speaker_2': 'The recommended action on this item continues the assessment for another year. There are no proposed changes to the basis of assessment nor significant changes in the proposed activity. Therefore, staff requests that City Council received the supporting documentation on the record.'",
        "'speaker_2': 'Approve the resolution, continue the letter of the assessment and authorize the city manager to extend the agreement for one additional year. And this concludes my report.'",
        "'speaker_4': 'Thank you. I don't believe there's an oath required here, so I'd like to move to receive supporting documentation, conclude the hearing, and adopt the attached resolution, and authorize the city manager to extend the agreement with Fourth Street Business Improvement Association for a one year term.'",
        "'speaker_4': 'There's been a motion and a second. Is there any member of the public that wish to address Council on hearing item one? SINGH None. Members Cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and adopt resolution continuing the Belmont Shore Parking and Business Improvement Area assessment for the period of October 1, 2015 through September 30, 2016; and authorize City Manager to extend the agreement with the Belmont Shore Business Association for a one-year term.  (District 3)": [
        "'speaker_4': 'Item two.'",
        "'speaker_1': 'Report from City Manager Recommendation to receive supporting documentation into the record, conclude the hearing and adopt resolution can continue in the Belmont Home Parking and Business Improvement Area Assessment for the period of October 15 through September 16th, and authorize the city manager to extend the agreement with the Belmont Shore Business Association District three.'",
        "'speaker_4': 'Staff Report.'",
        "'speaker_0': 'Vice Mayor Lowenthal Members.'",
        "'speaker_2': 'Of the City Council. The staff report will be provided by Mike Conway, Economic and Property Development Director. Thank you very much. This item is the annual approval of the Belmont Shore Parking and Business Improvement Area Annual Report and Ongoing Assessment.'",
        "'speaker_2': 'On August 11, 2015, City Council approved a resolution granting approval of the annual report and set today's date for the public hearing. The recommended action on this item continues the assessment for another year. There are no proposed changes to the basis of assessment nor significant changes in the proposed activities.'",
        "'speaker_2': 'Therefore, staff requests that City Council receive the supporting documentation into the record, approve the resolution, continue the levy of the assessment, and authorize the city manager to extend the agreement for one additional year. This concludes my report.'",
        "'speaker_4': 'Thank you, Councilwoman Price.'",
        "'speaker_6': 'Thank you. Vice Mayor. I have moved to approve this recommendation. Belmont Shore is a stellar example in the city of Long Beach of what a successful business improvement district can do to energize a business corridor. Recently, Second Street has attracted notable restaurants such as St and Second Nicks on Second and Simmons's.'",
        "'speaker_6': 'Additionally, we have had a great balance of local retail as well as nationally recognized chains. The Belmont Shore Business Association hosts many family friendly events like Stroll and Savor the Chocolate Festival, the car show, which we recently had, and of course, the annual Belmont Shore Christmas parade.'",
        "'speaker_6': 'I want to recognize Deedee Rossi, the executive director of the Belmont Shore Business Association, and President Mike Sheldrake with Polly's Gourmet Coffee for their dedication to this business district. I also want to acknowledge the diligent efforts of our city staffer Jim Fisk for his hard work in supporting this organization.'",
        "'speaker_6': 'Their collective hard work and that.'",
        "'speaker_1': 'Of the SBA board clearly drives the success.'",
        "'speaker_6': 'Of the Belmont Shore Business District, and we thank them very much. I'm happy to approve this recommendation or move it forward.'",
        "'speaker_4': 'Thank you. Councilwoman Price, is there any member of the public that wished to comment on hearing item two seeing none. Members Cast your vote.'",
        "'speaker_1': 'Councilwoman Mongo. Councilmember Richardson. Motion carries 9080.'",
        "'speaker_4': 'Thank you. That is all we have for hearings. Next is our consent calendar items four through 11 and item 16. And is there any member of the public that wishes to address the Council on consent? Motioned by Councilman Austin and Councilmember Richardson.'"
    ],
    "Recommendation to approve the use of Sixth Council District Fiscal Year 2015 one-time infrastructure funds in the amount of $10,000 to fund community improvement, healthy eating, and community engagement activities in the Sixth Council District for a two-year period.": [
        "'speaker_4': 'Thank you. I appreciate that clarification. And that concludes public comment on items not on the agenda. We've done consent items for three, 11 and 16. Madam Clerk, next item. Is 12.'",
        "'speaker_1': 'Item 12 Communication from Councilman Andrew's Recommendation to approve the use of Sixth Council District Fiscal Year 2015. One time infrastructure funds in the amount of $10,000 to fund community improvement, healthy eating and community engagement activities for a two year period.'",
        "'speaker_4': 'There's been a motion and a second. Is there a staff report? Or Councilmember Andrews.'",
        "'speaker_9': 'Thank you. Thank you, Vice Mayor. You know, the sixth District is part of the home of approximately 50,000 residents. As the host of many outstanding institutions and public facilities. Districts are also rich in culture, due in large part it is rich in ethnic diversity.'",
        "'speaker_9': 'While there is much to celebrate their continued challenge, such as healthy eating choices, access to healthy food and healthy activities. We also like food services, grocery stores and farmers markets where residents can buy a variety of fruits, vegetables and whole grain.'",
        "'speaker_9': 'A low fat diet produce instead. Residents, especially those without reliable transportation, may be limited to shopping at a small, neighborhood, convenient and corner store, where fresh produce and low fat items are limited, if available at all. For this reason, I would like to use a portion of my.'",
        "'speaker_9': 'District wide 15 one times. Infrastructure funds to transfer to the Department of Parks, Recreation and Marine to provide much needed community farmers markets that provide healthy choices as well as healthy activities and encourage residents to exercise. This I would like to move, you know, if I can get okay from the council.'",
        "'speaker_4': 'So there's been a motion and a second. Councilmember Your Honor, did you want to address the motion as well? Okay. Is there any member of the public that wish to address Council on item 12? Seeing None members. Cast your vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to consider naming the Center Theatre to be renamed the \"Beverly O'Neill Theatre\" in honor of her contributions to the City of Long Beach.": [
        "'speaker_4': 'Thank you. Item 13.'",
        "'speaker_1': 'Communication from Vice Mayor Lowenthal. Recommendation to approve a deviation from existing policy and procedures for naming of city owned land, buildings and facilities to allow the Center Theater to be renamed the Beverly O'Neill Theater in honor of her contributions to the city of Long Beach.'",
        "'speaker_4': 'Thank you, Madam Clerk. I'd like to thank the International City Theater for suggesting that the Center Theater be named after former Mayor Beverly O'Neill for her lifelong dedication to the city of Long Beach. With us in the audience, we have several members of the act board, and they may not all be here at this time, but we'",
        "'speaker_4': 'were expecting Jim Pruitt, the act board vice president. Dr. Minnie Douglas, A.C.T. Board Vice President. Dr. Felton Williams Board Member. Steve Dodge Board Member. Julie Larkins Board Member. Karen Deci Ikt Artistic Director and Producer. Dennis Negros Icon Staff.'",
        "'speaker_4': 'Amanda Soto I City Staff. And Jan from Camerata Singers. As my colleagues know, Long Beach has an administrative policy that guides the naming of land, buildings and facilities affectionately called 8-7. It is customary for City Council to name parks and other city assets in the honor of individuals no longer with us, but the policy does not allow'",
        "'speaker_4': 'for exception does allow excuse me for exceptions in cases where council deems it appropriate on the basis of a significant contribution to the nation, state or city of Long Beach. Former Mayor O'Neill certainly fits in this category for all of us.'",
        "'speaker_4': 'That have benefited from her four years of dedication to education in Long Beach through Long Beach City College and Cal State Long Beach and her leadership as mayor during some of Long Beach, his most difficult years as the city and its economy, struggled with the departure of the Navy and aerospace jobs.'",
        "'speaker_4': 'As we continue to experience the benefits of her good work in support of nonprofits, arts, culture throughout the city during her lifetime, Beverly O'Neill has exuded a sense of optimism, competence and grace. I've always thought that she put Long Beach on the map at a time when many people did not know if we were Long Beach, California'",
        "'speaker_4': ', or Long Beach, New York. And she did this in approaching challenges and inspired our city to believe in itself. And that's something that's palpable. Here is her ability to have inspired our city, to believe in ourselves. So we are indebted for her work as a public servant.'",
        "'speaker_4': 'Now, the timing of this item is such that if Council and the Housing and Neighborhoods Committee approved the name change, it can actually occur immediately, since there's construction currently taking place on the exterior of the center theater building.'",
        "'speaker_4': 'So with that, I'd like to make a motion to approve the changing of the Center Theater to Beverly O'Neill Theater and send the recommendation to the Housing and Neighborhoods Committee. There's been a motion and a second councilmember. Your.'",
        "'speaker_3': 'Thank you, Mayor. I'm proud and honored to second this motion. You said at all in your presentation that there's no question that the Beverly O'Neill has been an icon for Long Beach and it's well-deserved and earned. And I completely support this motion.'",
        "'speaker_4': 'Thank you, Councilwoman Pryce.'",
        "'speaker_6': 'Thank you. Thank you, Vice Mayor Lowenthal, for bringing this item forward. I consider Mayor O'Neal to be a mentor, and I am happy that we are honoring her work with the arts community and the city of Long Beach.'",
        "'speaker_6': 'Mayor O'Neal was instrumental in guiding the city after the Navy left Long Beach by focusing on the three T's tourism, trade and technology. Mayor O'Neal was a visionary leader, and she had shaped our economy today by making important investments in our airport, the port of Long Beach, our convention center, and numerous organizations that she touched during her'",
        "'speaker_6': '12 year tenure as mayor. I am honored to support the renaming of the theater in honor of Mayor O'Neal. She is beloved in our city, and I'm so proud to have her as a resident, to have her as a mentor and to be able to take this step.'",
        "'speaker_6': 'So I thank you for bringing this forward.'",
        "'speaker_4': 'Thank you. Councilman Andrews. Yes.'",
        "'speaker_9': 'Yes, thank you, Vice Mayor. I, too, would like to thank you for bringing this, you know, to the diocese. Beverly O'Neal was one of our city's greatest mayors, you know, to this day. She is still working for Long Beach.'",
        "'speaker_9': 'And I remember how she led Long Beach through the transformation from a Navy town to a tourist destination, a hub for international trade. She took on the challenge to let our city into a new direction. Mrs. O'Neal will always be the favorite of mine, and she always will be.'",
        "'speaker_9': 'Polly's Geographic. I'm in favor of this item. Thank you.'",
        "'speaker_1': 'Councilwoman Gonzales Yes, I am working with the ICC board members Karen and Jim and Dr. Williams. It's been a pleasure and I'm so very glad that we're here at City Council now talking about renaming this after Beverly O'Neil.'",
        "'speaker_1': 'And I look forward to many years with them, with you all and talking about the wonderful theater. Councilwoman Mongo I too, am here to support renaming the Center Theater for Beverly O'Neil. She has been a mentor and a leader for this city that we should all be very proud of.'",
        "'speaker_1': 'And in addition to being a holly jackrabbit, let's not remember that she's also a Long Beach City College Viking.'",
        "'speaker_0': 'Oh, sure.'",
        "'speaker_4': 'And so it starts. Councilman. Councilman Austin.'",
        "'speaker_8': 'Thank you very much. I want to also thank you, Vice Mayor Lowenthal, for bringing this forward. I want to thank the act board of directors for having the vision to honor such a I'm such a such a hero, hero in our community.'",
        "'speaker_8': 'Beverly O'Neal is is arguably the most one of the most respected elected officials ever to serve the city. She served with grace and honor, and she put Long Beach on a national map in a lot of ways. She's my favorite mayor because she appointed me to a commission that got my my my public service career going here'",
        "'speaker_8': 'in the city of Long Beach. And so I thought support this 100%. Thank you.'",
        "'speaker_4': 'Thank you, Councilmember Richardson.'",
        "'speaker_7': 'I also rise in support of this. And I want to acknowledge Vice Mayor Lowenthal for for understanding that our code doesn't allow doesn't stop us from, you know, recognizing people have done who have done really special things in our community.'",
        "'speaker_7': 'And I think this is very appropriate to do so. So so thank you so much for for really exercising the right that the city council has to do that.'",
        "'speaker_4': 'Thank you. There's been a motion and a second. Is there any member of the public that wish to come forward and address council on this item?'",
        "'speaker_1': 'I'm Karen Deci, artistic director and producer of International City Theater. And I appreciate this vice mayor and city council for.'",
        "'speaker_4': 'This opportunity.'",
        "'speaker_1': 'And to speak on this subject. Beverly O'Neill has devoted her life to public service, as many of you have stated, and is appreciated for many things on many levels. Her appreciation and support of arts and education, her understanding of what it does for our community, our children and our future are truly noteworthy, especially as it applies to'",
        "'speaker_1': 'renaming the theater. Theater is art, and theater is about education. Theater supports a more educated and a more harmonious society. As you know, International City Theater's home is at the Center Theater. The board of directors and I hope you will support this change.'",
        "'speaker_1': 'The center theater name has no significance to the facility or the community. Renaming it the Beverly O'Neill Theater is appropriate and is fitting recognition for a very deserving woman. It is a wonderful way to say thank you to someone.'",
        "'speaker_4': 'Who has loved and.'",
        "'speaker_1': 'Cared for this city and its residents for so long. I want to thank you for supporting this on behalf of the board and myself. Thank you so much.'",
        "'speaker_4': 'Thank you, Karen. Seeing no furthers speakers members, please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you.'"
    ],
    "Recommendation to authorize City Manager to execute the Eleventh Amendment to Contract No. 31687 with Bellingham Marine Industries, Inc., for Phase 8 of the Alamitos Bay Marina rebuild project, and increase the contract amount by $28,636,597, plus a $1,431,830 contingency, for a total contract amount not to exceed $96,555,525;  Execute the Third Amendment to Agreement No. 29587 with Concept Marine Associates, a Division of TranSystems Corporation, for continued construction management of the Alamitos Bay Marina rebuild project; increase the contract amount by $1,463,060, for a total contract amount not to exceed $8,036,549; and extend the term to December 31, 2019; and  Increase appropriations in the Marina Fund (TF 403) in the Parks, Recreation and Marine Department (PR) by $49,244,796, offset by bond proceeds.  (District 3)": [
        "'speaker_1': 'Item 14 Report from Parks, Recreation and Marine and Financial Management. Recommendation to execute amendments to contract with Bellingham Marine Industries and Concept Marine Associates relating to the Alamitos Bay Marina. Rebuild Project and increase appropriations in the Marina Fund in the Parks Recreation and Marine Department District three.'",
        "'speaker_4': 'Thank you. And I know Councilwoman Price has a presentation to make, so if I can turn it over to her.'",
        "'speaker_6': 'Thank you very much, Vice Mayor. I want to first acknowledge Rick Jerry, who is here, he's the chair of the Marine Advisory Committee. And I want to thank him for his service and for everything that he's done to support this process.'",
        "'speaker_6': 'I also want to recognize the hard work and dedication that Parks Recreation and Marine Director Steven Scott and our Marine Bureau Manager Alveda Hallinan have displayed during the rebuild of our marinas a major undertaking and one of the largest infrastructure projects that the city has embarked upon.'",
        "'speaker_6': 'The city of Long Beach has the largest municipality managed marina in the United States. Our marinas are in the best location in California as vessels are protected by a series of offshore breakwaters and natural bays with easy access to open water and sailing conditions that are nearly perfect year round due to prevailing winds.'",
        "'speaker_6': 'All three of our city's marinas were originally built in the 1950s and the 1960s, and our occupancy rate has remained steady at 98% and 2005 and 2007. The city rebuilt the downtown marinas, and in 2011, construction started on the Alamitos Bay Marina, Bellingham Marine.'",
        "'speaker_6': 'The company completing this major infrastructure project is the global leader in design, manufacturing and construction of marinas. Bellingham Marine enjoys an unrivaled reputation within the industry and has installed more than 20 million square feet of concrete floating docks throughout the world.'",
        "'speaker_6': 'Reconstruction work has included demolition of existing wooden docks, removal of piles, dredging, installation of new piles, assembly and installation of concrete docks, upgraded utilities at the docks, as well as restroom and parking lot rebuilds. The magnitude of this project has required the Marine Bureau to.'",
        "'speaker_1': 'Temporarily.'",
        "'speaker_6': 'Relocate boat owners during reconstruction. Reconstruction includes demolition of existing wooden docks, removal of piles.'",
        "'speaker_1': 'I think already set those.'",
        "'speaker_6': 'To date, we have completed basins one, four, five and eight. Basin two is planned to be completed by spring 2016, and Basin three will be completed by December of 2017, followed by Basin six and seven in December 2018.'",
        "'speaker_6': 'The total estimated cost to rebuild the Alamitos Bay Marina is $110 million. I want to thank John GROSS and Alveda Hannan and Hallinan for working so closely with one another when we earlier this year approved.'",
        "'speaker_1': 'The.'",
        "'speaker_6': 'The bond sales. They have done a fantastic job. And I'm so grateful for their their service and their commitment to this project. Thanks to our chief of staff, Julie Maliki, we have a short video that we'd like to show regarding the rebuilding process for Basin four, which is the basin located next to the Long Beach Yacht Club'",
        "'speaker_10': '. Instead. You. And of course. This move. Your face. Really? See. Running away.'",
        "'speaker_6': 'Julie That was awesome. I'm wondering if that song is part of Julie Maliki's playlist. I would have gone with more of a Spanish flare song, but that was good. I liked it. Thank you very much, Julie, and the team that she assembled to put this video together.'",
        "'speaker_6': 'Honestly, this project is so amazing. The marinas look wonderful. Almost brought me to tears to watch that video. I'm so proud to have that in the city of Long Beach. Boat owners all around the region thank us and are so appreciative for this process.'",
        "'speaker_6': 'We are way ahead of so many other marinas and still offering these these spaces at a very reasonable cost to to the user. So I am so grateful for that. I'm not sure if there's a staff report. I just kind of took over.'",
        "'speaker_1': 'But I.'",
        "'speaker_2': 'Can't remember. I think you covered it very well and we're available to answer questions if needed.'",
        "'speaker_6': 'Thank you guys very much. This is such a pride for the city of Long Beach. I'm so grateful for your leadership. And Elvira's very balanced. Mechanisms that she uses to make sure that boat owners are treated consistently and fairly.'",
        "'speaker_6': 'I'm so grateful for that. I think that's a very important attribute to bring to the position. So thank you, Alveda.'",
        "'speaker_4': 'Thank you. There's been a motion and a second. Is there any member of the public? Well, Councilwoman Price, I'm sorry.'",
        "'speaker_6': 'I forgot to mention one thing. I would be remiss not to mention that my colleague, council member, Iran is on the Coastal Commission and I thank him for all the approvals that made this project possible because without their support, we would not be able to do these great things with our properties along the coast.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_4': 'You can speak on this item.'",
        "'speaker_1': 'Yes, I was going to.'",
        "'speaker_4': 'Okay.'",
        "'speaker_1': 'Thank you. Diana Le Jean. I think it's just really brief. I've seen a figure here of $96 million.'",
        "'speaker_4': 'Almost.'",
        "'speaker_1': 'Close to $100 million. Is that what it is? I'm. I'm just sorry. I'm just having such a hard time with that. That amount of money. It's beautiful. I mean, there's no question about it, but I'm having a really hard time understanding $100 million.'",
        "'speaker_1': 'And yet here we're we I mean, on some boats and a luxury item when people who are sick and and we're we're arguing about you know it will be coming up but I'm just amazed at the amount of money being spent here when we're we're worried about a fairly small amount of money facilitating people who are really'",
        "'speaker_1': ', really sick. So I just.'",
        "'speaker_4': 'Had to say that. Thank you. Thank you. Next speaker, please.'",
        "'speaker_5': 'Hi. My name's Stephanie Dawson. So I'm a resident of Second District. I'm just struck by the kind of contrast that was created today. We had the chief of the Housing Department talking about a 120 day wait list for applicants, which I will add there is a they have not accepted more people on the waitlist since 2007.'",
        "'speaker_5': 'As a result of this, we're now subsidizing essentially the cheapest rent in the city of Long Beach by providing $100 million to dredge this and reformat this marina for boat slips that costs $500 a month. So in the era of a fort, when we're in desperate need for affordable housing, when people are losing their homes because they're'",
        "'speaker_5': 'being priced out of the city of Long Beach. $100 million would go really, really far to developing places where people can actually live.'",
        "'speaker_6': 'Councilman Price. Thank you. If I could just have staff educate the folks regarding where the money for the marina rebuild came from. I think there's some confusion, miscommunication there.'",
        "'speaker_2': 'Thank you. Councilmember Vice Mayor. Yes, we'd absolutely like to do that. This is a completely restricted fund. This is the Marina Sub Fund of the Tidelands. This is money collected by boat owners and can only be used for boat owner purposes.'",
        "'speaker_2': 'It could not be used for any of the other purposes that we would use in the city. So none, no general fund funds were used, no tidelands dollars with the exception of marina funds in the sub funding of the Tidelands Fund.'",
        "'speaker_4': 'Thank you. I appreciate that. There's been a motion and a second. Is there any member of the public that wishes to address Council on item 14? See none. Members cast your vote.'",
        "'speaker_1': 'Councilwoman Mango's, Councilman Andrews. Motion carries.'"
    ],
    "Recommendation to receive and file the application of Phatreeya, LLC, dba Naree Thai, for an original application of an Alcoholic Beverage Control License, at 555 East Ocean Boulevard, Suite 101.  (District 2)": [
        "'speaker_4': 'Item 15.'",
        "'speaker_1': 'Report from police recommendation to receive and file the application of Maritime for an original application of an ABC license at five, five, five East Ocean Boulevard, Suite 101 District two.'",
        "'speaker_4': 'Thank you. I'd like to make the motion to approve. To receive and file the application for an original ABC license. It's been in motion. And a second. So staff report.'",
        "'speaker_2': 'Deputy Chief Hendricks can provide the staff report.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Good evening, Vice Mayor. Members of the Council. The item before you is an original application for a type 41 on sale beer and wine license to be used at a restaurant at 555 East Ocean. Police Department does not anticipate any adverse impact to the community or to city services.'",
        "'speaker_2': 'This concludes the staff report.'",
        "'speaker_4': 'Thank you. Is there any member of the public that wish to address Council on item 15? Seeing nonmembers cast your vote.'",
        "'speaker_1': 'Councilman Andrews. Motion carries.'",
        "'speaker_4': 'Item 16 was taken. Item 17.'"
    ]
}