{
    "WITHDRAWN\nRecommendation to receive supporting documentation into the record, conclude the public hearing, and deny an appeal/protest by Lennar Multifamily Communities (LMC), of the imposition of a Park and Recreation Facilities Fee, pursuant to Chapter 18.18, of the Long Beach Municipal Code, for the Oceanaire Project, at 150 West Ocean Boulevard (SPR1411-01, Mitigated Negative Declaration 03-15, dated June 1, 2015).  (District 2)": [
        "'speaker_0': 'And so I'll make note of when she when she joins us. And also, we're going to we have three hearings which were going to begin with a meeting with like we like we normally do. And I'll begin with hearing item number one, Madam Clerk.'",
        "'speaker_2': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and deny an appeal. Protests by Lennar Multifamily communities on the imposition of a park and recreation facility fee for the Ocean Aire project at 150 West Ocean Boulevard, District two.'",
        "'speaker_0': 'Thank you, Mr. Parkin.'",
        "'speaker_1': 'Thank you. Mayor, just on a housekeeping matter for the teleconference for the city council district three, that all the votes this evening must roll call vote. Yep. And also that that location is open, even though the councilmember may be joining us later if the public is participating from that location.'",
        "'speaker_1': 'I don't know why they would be doing that at this time of night in Greece, but if they are, it is open and it will be open through the entire part of the meeting. So just for the record, we're saying that.'",
        "'speaker_1': 'And then one last item. In the closed session this evening, the council, by a vote of 5 to 0, authorized the city attorney to file an amicus brief with the United States Supreme Court in the matter of the Department of Homeland Security versus the Regents of University of California, dealing with the DOCA issue.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Pearce.'",
        "'speaker_4': 'Yes. I'd like to make a motion to postpone this item until August 13th.'",
        "'speaker_0': 'So there's a motion in a second to postpone this item, the hearing hearing on about 1 to 1. So to continue the item until August 13th is for public comment on the continuation motion. Seeing none members, please go and cast your votes.'",
        "'speaker_2': 'Councilwoman Pierce.'",
        "'speaker_0': 'Yep. By roll call.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'I'm Councilwoman Price. Councilmember Supernova.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Councilwoman Mongo.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'Vice Mayor Andrews. Yes. Councilmember Younger Councilman Austin. Councilmember Richardson.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 21.15.870; Table 32-1 of Chapter 21.32, Table 33-2 of Chapter 21.33, and Section 21.45.130; and by adding Section 21.15.875, all relating to drive-through facilities, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'Great motion case. Moving on to hearing item number two.'",
        "'speaker_2': 'Report from Development Services recommendation received supporting documentation under the record. Conclude the public hearing and adopt a negative declaration. 03-19 Declare Ordinance Amending Title 21 of the Long Beach Municipal Code relating to the drive thru facilities. Read for the first time and lead over to the next regular meeting of the City Council for Final Reading and adopt'",
        "'speaker_2': 'a resolution directing the Director of Development Services to submit the ordinance amendments to the California Coastal Commission citywide.'",
        "'speaker_0': 'Thank you. We turn this over to staff for the full report. Thank you.'",
        "'speaker_5': 'Thank you, Mr. Mayor. First, if we can get the clicker for the slides to be able to advance the presentation from the clerk or from the tie in the back. And the staff report will be given by Linda Tatum, director of development services, as well as Christopher Coons, our planning bureau manager.'",
        "'speaker_6': 'I'd like to turn this presentation over to our planning manager, Christopher Koontz, and the planning team that also includes our advanced planning officer, Patricia Defender for.'",
        "'speaker_7': 'Good afternoon, Mr. Mayor, and members of the Council. We are back with the proposed permanent regulations for how the city will regulate drive thru facilities. As a reminder, this effort began in July of 2018 and that it went through the typical planning process.'",
        "'speaker_7': 'It did have a non typical step. We were in front of you in April of this year for a moratorium request. You asked us to work expeditiously and we are here two months ahead of schedule. Back to present our final regulations to you this evening.'",
        "'speaker_7': 'Existing regulations in terms of drive thru facilities in the city are uneven. Restaurants in commercial zones are subject to a copy process, whereas banks and other facilities are subject to AUP process in certain industrial areas. Drive thru facilities are able to go in as a matter of right, but in other locations, not if they're within 300 feet'",
        "'speaker_7': 'of residential district. The action in front of you tonight cleans up that inconsistency and provides what we feel are contemporary and appropriate regulations for all such facilities throughout all of the city. The map on the left gives you an idea of under the status quo regulations where drive thru facilities are allowed in both red and gray and'",
        "'speaker_7': 'on the right gives you an idea of where our existing drive thru facilities are. On the right is important because when we talk about new regulations, those are going to apply largely to new facilities. So those in excess of 100 existing facilities will be able to continue to operate in their current locations.'",
        "'speaker_7': 'As I mentioned, there are 116 and fast food drive thru facilities throughout the city. They're in every district and every part of the city. This effort was initiated due to an increase in the number of applications for additional new drive thru facilities.'",
        "'speaker_7': 'While such facilities provide convenience to the consumer. They also have impacts in terms of pedestrian safety, traffic and queuing night, the noise and pollution. And with our mobility element as well as our most recent land use element, there's a concern that this style of development is inconsistent with our goals and policies for the city.'",
        "'speaker_7': 'So diving into that a little bit further, our current regulations do not. They're over 20 years old. They do not align with the best practices in the city's policy documents in terms of addressing quality of life, sustainability and design drive through as they go in and pedestrian oriented areas or mixed use areas.'",
        "'speaker_7': 'It cannot only create hazards and collisions between pedestrians and motorists, but may also inhibit the city's housing and economic goals over time. The land use element and urban design element encourages mixed use corridors to accommodate housing and mixed use rather than single use drive thru facilities.'",
        "'speaker_7': 'This slide just gives you an overview of there are positive impacts associated with these facilities, including convenience and speed, as well as while we do not is not within our regulations. Many of these provide lower cost, affordable options to consumers.'",
        "'speaker_7': 'There are also the negative impacts that we've talked about in terms of air quality, safety, noise and opportunity cost for what could have otherwise gone in on that site. So what do we do through the process over the last year?'",
        "'speaker_7': 'We've come up with proposed regulations that better define all drive thru facilities and require a conditional use permit in all locations throughout the city. The process by which planning staff and the Planning Commission make a decision on any given application is through what are called findings.'",
        "'speaker_7': 'This action will change the findings required to approve a drive thru facility and those findings will better address negative impacts and reference the design of the facility today under the status quo. Our findings only regulate the length of the queue for the cars and the location and orientation of the menu board.'",
        "'speaker_7': 'So these are the proposed findings in front of you without reading through all of them. I just want to be clear that there is a focus on design. So even in those locations where a drive thru facility might be appropriate, such as adjacent to the freeway or on a site that can't support another use, this will allow'",
        "'speaker_7': 'us to achieve a higher level of design and safety for the public, including the patrons of these facilities. These new findings will require consideration of tradeoffs and will allow staff and the Planning Commission ultimately to provide a more nuanced side by side analysis and allow these facilities where they're appropriate and guide them to locations such as shopping'",
        "'speaker_7': 'centers and freeway adjacent sites. One of the findings that is part of this regulation is a departure from how we typically regulate land use because it will look at what we call opportunity cost. So this just shows you on a site that is 30,000 square feet, you might get on the upper end, a 4000 square foot drive'",
        "'speaker_7': 'through a facility with about 25 parking stalls. That's a floor area ratio of 0.13 or sort of a low usage of the land. And we would compare that not to the land being vacant, but to what else could be placed on that site.'",
        "'speaker_7': 'So in this case, a three storey townhome project would yield about 30 housing units with some ground floor retail. So in that case, the findings would suggest that is not an appropriate location for the drive thru facility. This map on the left shows again, we saw this earlier.'",
        "'speaker_7': 'All of the locations in gray and red where drive thru facilities are permitted today, applicants will be allowed to apply in all of those locations going forward. But when we look at the findings on the right, it just gives you a preview of those locations that staff thinks are most likely to support additional drive thru facilities.'",
        "'speaker_7': 'And those are those locations where it's a more automobile oriented location or other uses are not permitted or it's in a shopping center or a freeway adjacent. So with that, we've worked expeditiously, but really tried to take into account the impact that this counsel provided a couple months back.'",
        "'speaker_7': 'We've brought two regulations that do not prohibit drive thru facilities but provide a much more effective and focused permitting process to get the design of those facilities and location of them correct. We would ask you to adopt the ordinance that has been prepared by the city attorney and to forward this item to the California Coastal Commission for'",
        "'speaker_7': 'their certification within the coastal zone. If this code amendment is adopted tonight and then goes on to second reading, it would end the existing moratorium, most likely 30 days after the second reading. And for those applications that were already in process, which were attached to the minute order when you did the moratorium.'",
        "'speaker_7': 'Those would be processed under the old rules because those were the rules that existed on the day that they filed their application. So with that, we would be glad to take any questions that you may have.'",
        "'speaker_0': 'Thank you. There's emotion and a second concern for Pierce.'",
        "'speaker_4': 'I want to say how much I appreciate you guys doing a quick turnaround on this. I know that it's been in the works for a long time. I fully support I'm going to vote yes tonight. I look forward to hearing if community has any comments and look forward to hearing my my colleague's comments.'",
        "'speaker_4': 'I did have a question sort of related to this. If we're denying projects because there's a higher and better use, which I support, and how long like, say, that property stays vacant for three years, that we don't have a developer that comes on that.'",
        "'speaker_4': 'Is there a time limit that we're assessing for that? I just know we have a lot of vacant spots in my district.'",
        "'speaker_7': 'So thank you for the question. Council Member So there is not a time limit baked into the ordinance, but staff through practice would look at in an economic cycle. So in a five year period and when we talk about opportunity cost, it's not just could something else theoretically go there.'",
        "'speaker_7': 'It's when you look at market conditions, when you look at the physicality of the site and what is there a viable alternative use, not just is there, you know, sort of someone has an idea. So we would put all of that into the soup and take a look.'",
        "'speaker_7': 'And I think, you know, we're looking at the narrow issue of the drive through facilities this evening, but there's a number of issues with the vacant lots in your district, and we'd be glad to have a separate conversation.'",
        "'speaker_4': 'About and I know I believe Councilmember Austin had done an item around vacant lot, so I look forward to getting that item back because it's definitely an issue that we want to talk about. I think this is great.'",
        "'speaker_4': 'You know, I'm a single mom and so drive thrus are something that unfortunately I use from time to time. But knowing the health impacts, not only of the space that they use, the environmental damage that's done, but also often the food is a challenge.'",
        "'speaker_4': 'One other question. When we talked last time, we also talked about bikes and pedestrian access to two drive thrus. And I know you referenced where that where they're located throughout the city, but is there any other design implementation around bike accessibility or pedestrian windows?'",
        "'speaker_4': 'Good afternoon. Councilmember is Patricia Defender for yes. The design guidelines which will be coming to you at a later time, they'll be going to the Planning Commission and we can give you a presentation on those. Those will require a number of different site planning measures and the contemplation of walkup windows and other outdoor dining and facilities that'",
        "'speaker_4': 'would serve pedestrians are part of the design, would be part of the design guidelines, and we'll be looking for those things in future developments. Thank you, guys. Job well done. I look forward to the vote.'",
        "'speaker_0': 'Thank you, Councilmember Councilman Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I, I you know, I got to tell you, this was a really quick turnaround, and it seems like you've done what the council had asked you to do. There's one area on page nine that I'd like just a little bit more clarity on.'",
        "'speaker_1': 'I know one of the significant issues was that some of these uses are over concentrated in certain areas, in certain communities within Long Beach. I see bullet number seven says that that will now be a factor, you know, a finding as we consider drive thru.'",
        "'speaker_1': 'So how is that actually going to happen? I see it as it's not located in an area of existing overconcentration and not located within a 500 foot radius of the school or park. And I know as relates to liquor stores and things like that, typically if there's, you know, there's a guideline that says that there are more'",
        "'speaker_1': 'than this many licenses, then it's subject to be protested. How would this process work for drive thrus or would it be similar?'",
        "'speaker_7': 'Thank you for the question, Councilman Richardson. So it would be similar, but it would be a departure. One of the issues we have in the alcohol regulation as we look at the census track, so that presents problems because you may have a liquor store across the street that's in a different census track, but it's not captured.'",
        "'speaker_7': 'So what would we what we would be doing is asking the applicant on any one of these applications to show on a radius map how many existing drive thru facilities are within 500 feet and 1000 feet of the facility.'",
        "'speaker_7': 'And looking at that close proximity and it will require some nuance because those facilities that are, for example, within a shopping center or a place like the town center in Councilmember Mungo's district, you know, don't contribute to overconcentration in the same way that freestanding facilities that break up the rhythm of the street do.'",
        "'speaker_7': 'So all of that will have to be analyzed. They'll be guidance provided in the application forms from that department, but that doesn't go into the text of the ordinance.'",
        "'speaker_1': 'Thank you. And I'd like to just follow that. I think you're right. It's treated differently in certain certain communities because they're designed differently. And, you know, you know, a drive thru in a large town center is not going to have the same impact as a drive thru, you know, on a main and main corridor, let's say, in'",
        "'speaker_1': 'North Long Beach. So I'd like to follow that. And the last thing I'll say is that I think this is certainly a step in the right direction. We know that there's certainly a need for other business types, grocery stores, neighborhood serving markets, pharmacies and in typically in banks.'",
        "'speaker_1': 'And the the drive thru has been a tool for us to be able to get a bank, our first bank in our district. We needed to put the drive through ATM in order to get the bank. But there's no need really for drive thru restaurants.'",
        "'speaker_1': 'There's plenty of drive thru restaurants. So as long as we maintain that flexibility to say as an economic development tool to bring a pharmacy to your community, yes, your pharmacy can have a drive thru or as an economic development tool to bring a bank into your community.'",
        "'speaker_1': 'Your bank can have a drive thru ATM, but it would be treated differently with a drive thru restaurant. And as I understand it, you know, what we're doing here doesn't stop us from continuing to sort of differentiate between the two.'",
        "'speaker_1': 'Correct?'",
        "'speaker_7': 'That's correct. It's that's exactly what's in front of you.'",
        "'speaker_1': 'Great. Then I support this. Thank you.'",
        "'speaker_0': 'Thank you. Let me go to a public comment and we'll go back to the council. Is your public comment on this item? Okay. I'm going to close the speakers list. I've got two items, two members for public comment and I'm close to two speakers.'",
        "'speaker_0': 'So I have four and that's it. I'm closing the speakers. Please come forward.'",
        "'speaker_1': 'Okay. All right. Good evening, Mayor. Members of the city council. It's a pleasure to be here this evening. My name is Steve Gerhart and the executive director of Walk Long Beach. We, too, would like to thank staff for the expeditious effort to bring this item forward and generally were very pleased with what has been put into the'",
        "'speaker_1': 'regulations. As was stated in the staff report, we're focusing on design. One very important piece that's missing is the design guidelines. So one of our requests would be that the moratorium be in place until the design guidelines are available.'",
        "'speaker_1': 'We would want to lift up this comment that you had, Councilmember Pearce, about keeping the businesses open for walkers and pedestrians and people that just live nearby and don't need to drive. Finding number six, serving locals who choose to walk and bikes.'",
        "'speaker_1': 'We do have one small fix to the finding, a number eight. It currently states the general plan or economic blueprint. We think that should probably be an and or it could be in either of those two documents. We look forward to the implementation of this ordinance.'",
        "'speaker_1': 'And again, we think that the design guidelines, the devil's are in the details, and that's really what staff is going to be using to make sure that the walkup windows, their access from the street is there and that really this item is not fully cooked until those are available.'",
        "'speaker_1': 'So with that, thank you very much and we are very much in support of this item.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, Mayor and City Council. My name is Hilda Guyton. I live in the ninth district. I would like to thank the city staff for the great work they did in the short period of time about the drive thru regulations.'",
        "'speaker_4': 'The drive thru report being presented to the City Council today has brought out information. I was not aware of a new racism concern. The regulations are good, but the amount of drive thrus in the 9805 area is almost double in comparison of the other zip codes in the city having equal regulation a modest amount about around the'",
        "'speaker_4': 'city in a scenario with big disparities, making it inequitable and discriminatory toward the 90 year area. It is important for the city to implement stronger regulation, to close the gap in the disparities and prevent nyayo free from increasing the amount of drive thrus over the past year.'",
        "'speaker_4': 'I and the Latino members, along with other Long Beach community members, has been working with the city through the U. I plan a plan I never thought how would you pronounce it? Through the plan to change this zoning for the Atlantic and Artesia corridors.'",
        "'speaker_4': 'Even though the draft documents call for a long drive through zoning along the corridors, they are many more corridors and areas where these developments can pop up and continue affecting the environment and the public health of Long Beach residents.'",
        "'speaker_4': 'My group and I are looking forward to keep working with the city and our plan on changing the zoning for the 98 of my area. But in the meantime, I sincerely request the Council to extend the drive thru moratorium for the 95 zip code and to new regulation that addresses the inequalities in the amount of drive thru'",
        "'speaker_4': 'between the 98 of Frye and the rest of the city. And the new plan recommendations are in place. Thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker.'",
        "'speaker_1': 'Good afternoon, Mayor. City Council. My name is Kirk Davis. I archaic as I know they spelled it wrong last time. I live in the ninth district and I've been on top of this issue pretty much from the beginning.'",
        "'speaker_1': 'I'm very thankful for city staff, for the work they've done in a short period of time, and it's nice that they were able to show the inequity between the 905 area code and the other 12 area zip codes in in Long Beach, showing that we have 26 drive thrus, over 115 that were listed in the report.'",
        "'speaker_1': 'I was hoping that the moratorium would stay on the drive thru until the general plan comes into effect and until the YOU plan recommendations come into effect, because that's going to really affect how the things come up. It also brought up in the report how there was an increase in the amount of drive thrus applied for.'",
        "'speaker_1': 'And I think that it is in direct relation to the fact that there's going to be a new general plan. So if the moratorium can be extended for the whole city, I would please ask that the moratorium can be extended to the April five area code until the general plan is passed and until all the up plan'",
        "'speaker_1': 'recommendations are put into force. Thank you.'",
        "'speaker_0': 'Thank you. And our last speaker.'",
        "'speaker_8': 'Good evening, Mayor and city council. My name is Ailsa Chang with Long Beach Forward. We'd like to thank the mayor, the council and especially the staff for bringing these regulations forward so quickly. Long Beach Forward was a part of the Advocate Coalition to request a moratorium on the drive thrus.'",
        "'speaker_8': 'And again, thank you all so much for acting on that moratorium so quickly. Our primary goal for this item and for the city as a whole is healthy, equitable land use. To this end, and as my colleagues Hilda and Kirk just mentioned, page two of the staff report is telling, the highest concentration of drive thrus is in'",
        "'speaker_8': 'the 90805 zip code in.'",
        "'speaker_4': 'North Long Beach.'",
        "'speaker_8': 'That's 22% of all drive thrus in the city. This is just one of many, many examples of disproportionately unhealthy and incompatible land uses in low income communities of color. So with that, we look forward to working closely with the mayor, the council and the city staff to.'",
        "'speaker_4': 'Strengthen the planning policies and processes, including through the land use element.'",
        "'speaker_8': 'And community driven zoning code updates. Thank you.'",
        "'speaker_0': 'Thank you. That concludes public comment on this hearing. Let me turn this back to the council and Councilwoman Mongo.'",
        "'speaker_8': 'So I really want to thank the development staff. I think you've done excellent work. I was I was in alignment with Councilmember Super and I in that there already is a process. And so I was not sure that we really needed the moratorium, but I'm glad that it came back so quickly.'",
        "'speaker_8': 'I think that the work you did is great. I think there's a couple of things that I see coming into the city and quite frankly, retail as a whole that need to be considered. More and more, the drive thrus are being faced with the inability to serve customers fast enough, and they're doing parking spots and drive up'",
        "'speaker_8': 'delivery. And I think we really need to talk about that. I can give you a couple of examples of locations where the drive up spot is actually not very conducive to the pedestrian walkways. It also means that once they pull into the mobile ordering parking spot, they then can't get out because the drive thru backs up past'",
        "'speaker_8': 'them and now they can't get in or out of these spots. And so I don't know what kind of process we could have to help them identify when they're taking a parking spot out of parking. What does that mean?'",
        "'speaker_8': 'Because when they were approved, they had a certain number of parking seats that was spaces that were required. And now they're taking four or five, sometimes even six parking spots. I'd also like to say that not all drive thrus are created equal.'",
        "'speaker_8': 'You take the town center, the number of seconds it takes, or the Chick fil A to serve a customer is almost a third of what it takes in an out to serve a customer. So now you have a concentration of drive thrus that are actually blocking each other because one business is far superior in its turn times'",
        "'speaker_8': '. And so I don't know what kind of incentive programs we can have for getting cars through the line quicker so that we have less idling vehicles and less impact on the community because those are a major impacts. We also have major retailers that have no current drive thru component doing drive up and I think that we might'",
        "'speaker_8': 'need to look at some signage about turning off your engine. So Target, Wal-Mart, Vons, Ralphs, they're all doing drive up and pick up your groceries. All of those are coming into play in my district. We're getting the Wal-Mart drive up later this year.'",
        "'speaker_8': 'People often sit there idling their vehicles, and if we could come up with some universal signage that could be required as a part of the drive thru slash drive up regulation might be helpful if we see another phase of this come forward.'",
        "'speaker_8': 'I appreciate that. When this came for the first time, I wasn't as prepared for knowing and understanding the need. I appreciate the education, both from the city staff and from the community. I think that in talking with our businesses and our drive thru owners, that's given me the time to learn a little bit about the push through'",
        "'speaker_8': 'times and things like that. And so I would encourage you guys, if you're interested in meeting with some of those store managers and owners of franchises, that could be helpful as well. But I think that the starting point here is fantastic.'",
        "'speaker_8': 'I'm comfortable adopting this tonight. And then would it be possible to make it a friendly to come back with some of those drive up things, Councilwoman Pearce. It would just be at the direction of council that that would come back maybe even through a two from four if you thought another zoning change was necessary.'",
        "'speaker_7': 'City Council Member Thank you so much for the question. If if it's acceptable to the Council as part of this action, there are design guidelines that will come back to the Planning Commission, and we really rely on the Planning Commission to make those fine level details.'",
        "'speaker_7': 'And the issue that you discussed is an ongoing issue all over the city, even for places that have nothing to do with drive thru and that they are blocking off their parking for their sort of mobile order pick up.'",
        "'speaker_7': 'And it's. So that is an issue that that the department is trying to address. And we will be presenting those solutions to the Planning Commission. And I think our preference would be to provide you that information in a TFF rather than making a change, because these issues change over time.'",
        "'speaker_7': 'So it may be best not to memorialize it in that code, but rather in our operating regulations.'",
        "'speaker_8': 'I think that's fantastic. I think there's just one last thing, which is as the costs of owning and operating a business are changing and growing, one of the things that has recently been brought to my attention is that a restaurant will sublet itself out on non-peak hours or actually have a second like online only secret restaurant operating'",
        "'speaker_8': 'out of the same location. And so sometimes a business that has no mobile component of it may actually have one. And I don't know how through business licensing we can address that. But just something to bring on your radar.'",
        "'speaker_7': 'Yeah, we can talk with business license about that.'",
        "'speaker_8': 'Thank you. Great work.'",
        "'speaker_0': 'Thank you, Councilwoman Councilmember Supernova.'",
        "'speaker_1': 'Thank you. I'd also like to start by commending staff for a great work, great report, working expeditiously. I think the original proposal was for a one year moratorium and that was cut in half to six months and then you've cut it in half again.'",
        "'speaker_1': 'So great job on that. I do have only one question for staff involving the report. And to answer you can be, I don't know, or zero or a whole number. How many drive thru mortuaries are there in Long Beach?'",
        "'speaker_1': 'Drive through mortuaries.'",
        "'speaker_6': 'What we do not have any here in the city of Long Beach, there is one in a neighboring community that we're aware of.'",
        "'speaker_1': 'Okay. So how many in the state of California?'",
        "'speaker_6': 'You know, I don't know.'",
        "'speaker_1': 'I said that was one option for an answer. So thank you.'",
        "'speaker_6': 'But we have we did a field trip to visit the drive through moratorium in a neighboring city. So we know it exists.'",
        "'speaker_1': 'Okay. But it is it will be at this passes tonight that will be part of our municipal code drive thru. Mortuaries are mentioned in this item. Yes. Okay. So I don't want to be too repetitive and what I said at the first meeting, but I stand on everything I said that night in April and that is I'",
        "'speaker_1': 'represent the fourth Council District. I realize the fourth Council District is very unique. We've had tremendous success under the current rules. We've had drive thrus and the right places. And I think Steve Gerhart would would agree with me that the traffic circle is not pedestrian friendly.'",
        "'speaker_1': 'And so that's where they went. We had a record number of them. And you talk about vacant lots and abandoned buildings. We had three abandoned buildings there. I see our former East division commander there. And that was a nightmare.'",
        "'speaker_1': 'And one abandoned building was abandoned for ten years, a bank building right next to Smart and Final and all that has been revitalized. We have three drive thrus in that area a bank, a pharmacy and a food restaurant.'",
        "'speaker_1': 'So based on the fact that the oh, and we've also in the fourth District, we stopped a drive thru from going in Del Taco. So based on the tremendous success we've had under the current rolls, I'm not going to vote for the recommendation.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Richardson.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I wanted to just chime in, so I heard a lot about 90805. You're absolutely right. There's some characteristics about 90805 that that really stand out. And so one that we should know is that it's the largest zip code in our city by a lot.'",
        "'speaker_1': 'So number one, if you think about our population per the last census and I only five is 93,000. Was it 93,524 people? That's a fifth of the city's population is generally a fifth of the city. Whereas if you think 90802 is 39,903 is 32,009 over the fourth 40,000.'",
        "'speaker_1': 'We're double the size of all zip codes and 905. A lot of people don't know that there are there's a need for a deep, deep look at 90805 in terms of planning and land use. And that's why over the last 3 to 4 years, we've really been focused on identifying the funding to create a plan, the uptown'",
        "'speaker_1': 'planning, land use and neighborhood strategy. So we've we've received funding both from Caltrans and from SCAD, and we're in the middle of the second phase of that project now. And that program essentially takes a deep dove planning lanes along North Long Beach that has never taken place before.'",
        "'speaker_1': 'Look at everything from liquor stores to drive thrus and all of these things. So now is the time for all that to happen. So I wanted to just acknowledge, you know, when we say it's a big number, we know that what are we doing about it?'",
        "'speaker_1': 'A plan is how we sort of figure out our rules of the road moving forward. And also we have to start treating 925 kind of like a town. It's a fifth of city's population the size of every city, if not larger than every surrounding city that we have.'",
        "'speaker_1': 'Right. The size of Compton, Carson, larger than, you know, Paramount, Bellflower, Lakewood. And it's one zip code within our city. And so we have to put more attention on these issues in our community. So I wanted to just lift that up because I saw it came up a few times in public comment.'",
        "'speaker_1': 'Yes. The drive thrus and liquor stores and all these other other things are a problem, but also the lack of the things that we have, which is why we need to address it from a planning level standpoint. Thanks a lot.'",
        "'speaker_0': 'Thank you so much. And Councilman Pearce.'",
        "'speaker_4': 'Yes. I just wanted I maybe I didn't write it down, but the timeline for planning and next steps, I want to make sure we know what that is and that we're trying to move quickly on that. And yeah.'",
        "'speaker_4': 'So Patricia defender for the the ordinance would be adopted if if it's approved today it would be adopted it would be effective about 31 days after the action of the council. The design guidelines will follow very shortly on the heels of this.'",
        "'speaker_4': 'And as I mentioned, I think I misspoke a little bit, but it will be going to planning commission because their guidelines are not code. So we could find a way to update the council when that is released. But I would just wonder, do you guys have a date for that?'",
        "'speaker_4': 'Yeah, I think in the next couple of months we will I mean, have that done and to the planning commission. Okay. So this is my my urging us to get that done sooner rather than later. Yeah. I mean we have drafts now that are in review.'",
        "'speaker_4': 'It could be sooner than that. But just two months possibly just doesn't anyone do this. Okay. Okay. Thank you. But it's good to know that this would go into effect 21 days after after the vote today, 31 days.'",
        "'speaker_4': '31 days. Thank you.'",
        "'speaker_6': 'Appreciate. After the second reading.'",
        "'speaker_0': 'Yes, it had to be at once. A second reading is over. Okay. There's a motion and a second roll call vote. Uh, District two. Three. District for.'",
        "'speaker_1': 'NE.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing and grant an Entertainment Permit with conditions on the application of Grand Investment Group, dba The Harbor Bar, at 130 Pine Avenue, for entertainment with dancing.  (District 2)": [
        "'speaker_0': 'District five. District six. Yes. Seven by eight and nine motion carries. Moving on to hearing at number three, Madam Clerk.'",
        "'speaker_2': 'Report from financial management recommendations received supporting documentation into the record, conclude the public hearing and grant an entertainment permit with conditions on the application of grant investment group DBA, the Harbor Bar at 130 Pine Avenue for entertainment with dancing dessert.'",
        "'speaker_0': 'Thank you, sir. A short staffed presentation.'",
        "'speaker_5': 'Yes, we are. We will have a staff presentation from Brett Jacks, our business services officer, and Emily Armstrong from the Business Licensing Division.'",
        "'speaker_2': 'There's also an oath required for this hearing.'",
        "'speaker_4': 'Yeah. So.'",
        "'speaker_2': 'Please raise your right hand. Do you and each of you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_4': 'Sorry. Good evening, honorable mayor and members of the City Council. Tonight you have before you an application for entertainment with dancing for Grand Investment Group doing business as the Harbor Bar located at 130 Pine Avenue, operating as a restaurant with alcohol in Council District to all of the necessary departments have reviewed the application and have provided their'",
        "'speaker_4': 'recommended conditions as contained in the hearing packet. I, as well as the police department, stand ready to answer any questions Council may have. And that concludes South Report.'",
        "'speaker_0': 'Thank you. Councilmember Pierce.'",
        "'speaker_4': 'Yes, I just want to thank staff. I've received no opposition to this, no emails, no calls against this. So happy to vote yes tonight and we'd love to have a second on it. Thank you.'",
        "'speaker_0': 'Okay. We can get a second on this is a public comment on this, seeing no public comment. I will take a roll call vote district to. District three District 456789 Cape motion carries. We are going to be doing, I think majority of people here are for the MacArthur Park vision plan.'"
    ],
    "Recommendation to receive and file the MacArthur Park Vision Plan;   Adopt resolution authorizing City Manager, or designee, to allow the Los Angeles Neighborhood Land Trust (LANLT), on behalf of the City of Long Beach, to submit a grant application to the California Department of Parks and Recreation, for the first phase of the MacArthur Park Vision Plan Implementation Project; accept said grant, if awarded, in an amount of $8,500,000 in Statewide Park Development and Community Revitalization Program funding; execute all documents necessary to accept the funds; negotiate and execute a Turn-Key Agreement with LANLT for the development of MacArthur Park improvements; and  Accept Statutory Exemption SE-19-159.  (District 6)": [
        "'speaker_0': 'So why don't we do that next, which is item 37, if we can get the court to read that?'",
        "'speaker_2': 'Report from Parks, Recreation and Marine Public Works. Recommendation to receive and file the MacArthur Park Vision Plan. Adopt a resolution to submit a grant application to the California Department of Parks, Recreation and Recreation for the first phase of the MacArthur Park Vision Plan Implementation Project.'",
        "'speaker_2': 'Except, said Grant, if awarded in an amount of 8,500,000 District six.'",
        "'speaker_0': 'Well, thank you. Let me turn this over to Vice Mayor Andrus.'",
        "'speaker_3': 'Yes, thank you, Mayor.'",
        "'speaker_0': 'I would actually. I'm sorry. Vice Mayor. Mr. Modica, do we have a staff report first?'",
        "'speaker_1': 'Yes, we do. The we have our parks. Our Parks Rec, a marine director here at the moment, and also bureau manager Meredith Reynolds. If one of you guys could present the presentation, this is a real exciting opportunity.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening, Mayor. Member City Council. We're very excited this evening to put before you the MacArthur Park vision plan. This is a project that is been part of a community process, an inclusive and multilingual community process to identify the vision for MacArthur Park, which has not had a vision plan in the past.'",
        "'speaker_4': 'In your packet you have the full vision plan, but just wanted to highlight a few things as we move toward this grant application and the process that was done began in January and is sitting here with you all this evening.'",
        "'speaker_4': 'I included some significant site analysis, park audit, walk, audit, several community workshops in partnership with the L.A. Neighborhood Land Trust, AOC, seven and Friends of MacArthur Park and City Fabric. Many of who are here this evening and through this process, we were able to identify ideas from the community that turned into prioritized ideas that turned into and'",
        "'speaker_4': 'coalesced around a vision plan for MacArthur. This timing was very important. I in particular, because there is an opportunity for some grant funding, some state grant funding through Proposition 68, the State Park Fund, which is due in the beginning of August, and allows for us to ask for $8.5 million to build out the first phase of that'",
        "'speaker_4': 'vision plan. In particular, some of the amenities of the community identified as priorities were walking path and fitness loop around the park and some expanded programmatic areas adjacent to gamba with theater connecting the building online cultural center to gumbo theater with some new area for program programing, restrooms and a lobby, an expanded playground, a relocated court, and'",
        "'speaker_4': 'some reconfigured parking that adds some additional actual park space to the park. So there are a handful of really great things that are included in this plan in particular, and in your packet you have that map of the concept as well as some cost estimates, next steps.'",
        "'speaker_4': 'And for the community, this was something that was very important that they were able to have a lot of ownership over in terms of identifying what was important to them. So if I can have all of our partners stand up, our superheroes from MacArthur Park are here.'",
        "'speaker_4': 'Thank you for being here this evening. They may opt to speak with you, but with that, that concludes staff's report.'",
        "'speaker_1': 'Yeah. Okay.'",
        "'speaker_0': 'Well, thank you. Let me turn this over to Vice Mayor Andrews.'",
        "'speaker_3': 'Thank you, Mayor. I first before we get started, I just want to first congratulate and let everyone know who was involved in this process. You know, the SATs that you came out and really put a lot of effort and energy into this.'",
        "'speaker_3': 'And I think through all of that, we were able to come up with is, I think, an excellent plan. It's going to really benefit, you know, MacArthur's Park. So by that, I just want to thank Mr. Myatt and the planning team at the Parks and Recreation and Marine for their diligent work in bringing this vision plan to'",
        "'speaker_3': 'us. When we started this discussion last year, we hoped that we could come up with a good plan but make others part, and they have crafted one that exceeds all of our expectations. Of course, they did not do this by themselves.'",
        "'speaker_3': 'The community came forward and was an active part of the planning process. And I want to thank the Friends of MacArthur Park and the AOC seven for their participation. And they are here tonight dressed in blue, as I am myself, to show support to the park and its future.'",
        "'speaker_3': 'I would also like to thank Alex and the team at the City of Fabrics. I attended that. I attended their engagement and meetings were impressive by their professionalism and the ability to get people involved as we go forward and apply for the grant funding.'",
        "'speaker_3': 'I have the utmost confidence in the L.A. Neighborhood Land Trust and their abilities to make this vision a reality. And I ask my colleagues for their support on this item. Thank you guys very much for being here today.'",
        "'speaker_0': 'Thank you, Vice Mayor. Councilmember Pierce.'",
        "'speaker_4': 'Well, I want to say congratulations to getting to this point. AOC seven. I get to share some in my district and you guys are a model neighborhood association and you consistently fight for your neighborhood. You fight to get grants, you consistently fight to make sure that you get every crosswalk that you deserve.'",
        "'speaker_4': 'And I'm so proud that I get to have some sharing of that with you guys. While this park is not in my district, I know that everyone has worked really hard on it and we need to improve our park system as much as we can not only expanding greenspace, but making sure that there's ample space for everybody'",
        "'speaker_4': 'of every ability to come and enjoy that park. So congratulations on the partnership and congratulations to to District six for getting this point wholeheartedly. Support this. Thank you.'",
        "'speaker_0': 'Thank you. Let's do public comment. If you're here for public comment on this item, please come forward. Yeah. I'm going to go ahead and close the speakers list. One, two, three, four, five speakers. And the speakers list is closed.'",
        "'speaker_0': 'All right. Whenever you're ready.'",
        "'speaker_4': 'Oh, Silva. They made Garcia an honorable city council members. My name is read out loud. I am a resident of Not Long Beach. I am the graduate of UCI this year in public health policy. I am here in front of you tonight to voice my absolute support for the master plan of improving MacArthur Park in the Sixth'",
        "'speaker_4': 'District. Even though I am living in Long Beach, I got involved a lot in the sixth District, such as chair planning, neighborhood cleanup, attending many AOC, seven meetings and other city events. With all this involvement, I really pay close attention to MacArthur Park.'",
        "'speaker_4': 'This neighborhood park is in a center of diverse communities, not just only the Cambodian community. A lot of children are living around this park and they need to get out of their houses to play and spend their time in the park after school hours and on the weekend.'",
        "'speaker_4': 'However, the environment and the aspect of the park are not well equipped to fit the children needs. We love to see our children grow in a safe and healthy environment so they can have a strong and healthy physical and mental growth because it will lead to their success in their school academic achievement become healthy, happy and productive'",
        "'speaker_4': 'at all. I am asking for Mayor Garcia and all of the City Council support for this matter, for our community and our children of the sixth District. Thank you. She will have something to say in camera. And I also translate her in English.'",
        "'speaker_4': 'So I'm committed to all loop. So I crank up location and look at the architecture architectural walk right from my nose and got the emoji. Hi. I'm lonely. Arms up. I'm waiting. Am I on your room? Canoga bottom.'",
        "'speaker_4': 'I know much of what I know, Paul. No, no, no, no, no. Paul. How I do it, I'm told. Hi, Nick. I'm doing them all by. Yeah, I know. AOC. Then pretty many don't make your stride in your own control.'",
        "'speaker_4': 'I'm below yous on cap, Robert Carson and lo yo. I look so I could look you like Garcia. And look, I was captain or John Walker. Look, all I know, pop art, pop like normal people. Morgan, he's a hack.'",
        "'speaker_4': 'Then go out there, run like Nelson got deep and whinny me in the circle. People are me and Captain. Follow me and call me Jack or Ryan so you can monkey with him. So I'll go along with Michael Garcia.'",
        "'speaker_4': 'I mean, look, Johnson got bigger, so right now we translate. She said, Hello, Mayor Garcia and Honorable City Council member. My name is right from. I am the resident in the district and I've been living in Long Beach for 39 years.'",
        "'speaker_4': 'I've been involved in many events such as beach cleanup, neighborhood cleanup, street cleanup, strip tree planning, and attend many AOC seven events. I support Mayor Garcia and the Honorable City Councils for the Master Plan of improving MacArthur Park in District six.'",
        "'speaker_4': 'For our community and the children who live in this street and to improve their physical and mental health in order to achieve a higher level of education. Uh, thank you, Mayor Garcia and the council members. Thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker.'",
        "'speaker_4': 'Good evening. Mayor Garcia and City Council. My name is Mary Simmons. I'm super excited to be here. This is like a dream come true for me. Although I've been advocating for MacArthur Park for a number of years now, but in the last year, working on this vision plan with Parks and Rec, Meredith City Fabric, the Land, Neighborhood'",
        "'speaker_4': 'Land Trust and Vice Mayor's Office, it's been amazing. So I'm here just to make it short and sweet and to say, please receive and file this vision plan for MacArthur Park. Thank you very much.'",
        "'speaker_0': 'Thank you so much. Speaker, please.'",
        "'speaker_9': 'Okay. I'm sorry. I'm in a cry. You made me cry. Sorry. Good afternoon or good evening. City Council members and mayor. My name is Lucille Torres. I'm a lifelong, lifelong, lifelong Long Beach resident, a parent and educator and AOC seven board member.'",
        "'speaker_9': 'I'm here to advocate for the MacArthur Park Vision Plan. As a child, I was fortunate to be able to walk safely to MacArthur Park with my brothers and sisters. Summer lunch and play on the rocket ship. Yes, this was my perk for my entire life.'",
        "'speaker_9': 'However, today I'm here as a co-chair of Friends of MacArthur Park, representing the neighbors that surround our park. Our journey to improve our park began seven years ago, first advocating for homeland facility improvements. Later, we collaborate with Sixth District to renovate our playground.'",
        "'speaker_9': 'Both improvements have had a positive impact on our community. Nevertheless, we knew that MacArthur Park needed more to become a central location for our neighborhood gatherings, a place to advocate for our residents health, fitness, and a place to program.'",
        "'speaker_9': 'To program. To program. To offer to all all ages. All ages. Sorry about that. So we continue our journey to improve our park. Researching, grants, calling, emailing. We found the Trust for Public Land, which inspired us to seek funding and resources within our community.'",
        "'speaker_9': 'This is truly a grassroots effort by encouraging one neighbor at a time to share their vision for a new and improved MacArthur Park. Friends of MacArthur Park walk the surrounding areas of MacArthur Park, passing out fliers, listening to neighbors concerns, developing solutions.'",
        "'speaker_9': 'Collaboration is a key component of friends, a MacArthur Park collaboration with neighbors, collaboration with neighborhood nonprofits, associations in our area. My Parents Association Midtown Bid My Town Inc, UCC and AOC. Seven Parks and Playgrounds are the souls of our cities and we need to treat them as such, nourish our parks, and create inclusive, plowed playgrounds for all'",
        "'speaker_9': 'our children that play friends in MacArthur Park, or continue advocating for more funding and collaborating with our hidden for our hidden gem, which is MacArthur Park. Please approve our vision plan in order to ensure a positive future for MacArthur Park and create a safer community for all.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_8': 'Good evening again. Mayor and city councilor Ailsa Chang with the Long Beach Forward. I just want to stand in strong solidarity with all of the MacArthur Park neighbors and stakeholders. And it's personally gratifying for me as a former staff member and advocate of the Los Angeles Neighborhood Land Trust to see this vision plan come to fruition.'",
        "'speaker_8': 'I think it just underscores the value of community based and community driven planning and development. This this is what inclusive and this is what equitable development looks like, especially in neighborhoods that face disproportionate and negative land use impacts and fewer infrastructure investments.'",
        "'speaker_8': 'So again, just very excited to stand in solidarity with my colleagues today in favor of the MacArthur Park vision plan. Thank you.'",
        "'speaker_0': 'Thank you so much. And the last speaker comes first.'",
        "'speaker_4': 'Good evening, Mayor. City Council, ladies and gentlemen. My name is Citizen and I am the chair of Cambodia town ing. Tonight, my boards and I are here to support the MacArthur Park Vision Plan. It will provide new walking trails that encourage healthy outdoor exercise, which help to decrease obesity and other adverse mental health impacts in our community'",
        "'speaker_4': '. It will also provide the community an opportunity to experience open space and recreation. In the past three years, Cambodia count ING had to move our annual culture festival from MacArthur Park into the parking lot of the Mark Twain Library.'",
        "'speaker_4': 'Because the park was so either so dusty or muddy. We support the MacArthur Park region plan to include more grass, tree, a playground and outside stage. We are looking forward to more the annual Cambodia Town Culture Festival back to the park.'",
        "'speaker_4': 'We also hope to bring back the Cambodia Town Parade in April 2020. Therefore, we would like to request the Mayor and member of the City Council to approve the MacArthur Park vision plan tonight. Thank you.'",
        "'speaker_0': 'Thank you so much. That concludes public comment. We have a motion and a second on the floor. I just want to add, I thought having looked at this plan, I think the community's had a really great job. Obviously, there's a lot of community love for the park.'",
        "'speaker_0': 'I think, Vice Mayor, I know you've kept me in the loop in our office and the plan itself, you can tell, is very thoughtful. And so I just want to congratulate all the stakeholders and the neighbors, the folks that were involved on that on the planning side and the and the organizing side.'",
        "'speaker_0': 'So now it's all about implementation and the next steps, but excellent job by the community. So congratulations. And with that members, we're going to catch our votes. I also will note that Councilman Price is on the line. And so I will we will be doing roll call and she should be joining us.'",
        "'speaker_0': 'So roll call, please. District two. District three. I District.'",
        "'speaker_1': 'Four. All right.'",
        "'speaker_0': 'District five. District six. Right. Seven.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Eight. And nine motion carries. Thank you graduations to the community. Okay. We had we are now going on to we have a couple more items here. Let's we're going to do public comment. Mr. Goodhew and then Paul Workman and then Andy, I believe it's passage of I apologize if I mispronounced it.'"
    ],
    "Recommendation to direct City Manager to explore expanding its partnership with Ring, LLC to increase the number of security devices in the City to enhance neighborhood security.": [
        "'speaker_0': 'We are. That concludes public comment. We know we have someone here that has to do has to head out. So we're going to move on and do item 29. Vice Mayor Andrews, this is the ring partnership. Yes.'",
        "'speaker_2': 'Item 29 is a communication from Vice Mayor Andrews Councilwoman Price Councilmember, a recommendation to direct city manager to explore expanding its partnership with RING to increase the number of security devices in the city.'",
        "'speaker_0': 'Vice managers.'",
        "'speaker_3': 'Thank you very much. I just want to bring this to everyone's attention because, in fact, I think it's very important that all our community, you know, be aware or abreast of what we're trying to do here. So I would like first to think, councilman.'",
        "'speaker_3': 'Councilwoman Price and Councilwoman, your anger for cosigning on this item with me. I also want to thank Karen Edwards and the Wrigley neighborhood for inspiring this item and working with my office to see it comes to fruition. The intent of this item is to increase the number of ring devices in the city across all the neighborhoods.'",
        "'speaker_3': 'Because of the more eyes we have in our community, the more crime we can deter and prevent. I really want us to focus on bringing these doorbells to neighborhoods who may not have the financial means to acquire them.'",
        "'speaker_3': 'And I'm looking forward to incorporate aspects of our digital inclusion works. So I'm hoping we we soon can see more online neighborhood patrols and that we see a reduction of crime like mail theft by vandalism and garage break ins.'",
        "'speaker_3': 'Thank you very much. And there's any questions. I do have someone here would be able to answer. Go ahead.'",
        "'speaker_0': 'Excuse me. Thank you, Vice Mayor. Councilmember Arango, the second.'",
        "'speaker_1': 'Thank you, Mayor, and thank you for bringing this forward. And, of course, the young lady brought it forward with a bright idea. I think this is a wonderful way to help our public public safety personnel with fighting crime.'",
        "'speaker_1': 'This was especially came to the focus right around the holidays when a lot of people would leave their packages around and the porches. And there were a lot of opportunities for, well, crime to opportunity, where you have people walk up into porches and you steal those items.'",
        "'speaker_1': 'I think that with this program, we would see a great reduction in that in that type of theft. And I'm really pleased to have this kind of like public and private partnership with Ring to provide this kind of public safety enhancement.'",
        "'speaker_1': 'And I want to thank you, Dot Vice Mayor Andrews, for bringing this forward.'",
        "'speaker_0': 'Thank you. Thank you. Vice mayor, country councilwoman Price.'",
        "'speaker_11': 'Hello. Thank you. I wanted to also thank Vice Mayor Andrews for bringing this forward. I also want to note that I believe it was two meetings ago that we approved the merger between our police department and ring. So that data that is provided data can be provided by ring to the police department, which I think is a'",
        "'speaker_11': 'really great development. I think, you know, as we're developing new ways of confronting crime, technology will allow us to expand our reach in terms of the ability to solve crimes and identify perpetrators. I'm happy to sign on to this item and I look forward to further benefit from the trends that we're seeing today in terms of residents'",
        "'speaker_11': 'using video doorbell technology to identify perpetrators. I'm excited to see that the use of this can be expanded and further encourage residents throughout the city to use this technology. And I also want to note that in the third district ring technology and the video footage from the ring devices has been a topic that has been discussed at'",
        "'speaker_11': 'many community meetings with our police commander. And we do know that they have been helpful in identifying perpetrators of the theft that occur on porches. Package theft, two things of that nature. So I am very in support, very much in support of this item.'",
        "'speaker_11': 'And I thank the vice mayor for bringing it forward.'",
        "'speaker_0': 'Thank you, Councilwoman. Council member Peirce.'",
        "'speaker_4': 'I want to thank you guys too for bringing this forward. I had several conversations literally the day before I saw this agenda with our constituents about how we can reduce some of the costs. So I definitely support this item.'",
        "'speaker_4': 'I'd love to see if there's opportunities. I know that now that our police department can work with Ring, maybe there's some opportunities for grants or funding that might come from our police department or through our police department for a program like this.'",
        "'speaker_4': 'So thanks, guys.'",
        "'speaker_0': 'Thank you. Councilmember Austin.'",
        "'speaker_1': 'Yes. I want to thank Council Member Andrews for bringing this forward. I think this is a very innovative way to keep our neighborhood safe and promote safety and throughout our communities here, throughout the city, particularly in some of those areas that are economically disadvantaged.'",
        "'speaker_1': 'I was curious to see if I did have a question for your staff regarding the scope of this. Is this just for a relationship or M.O. you with Ring? Because I know there are other providers out there that provide these same types of services.'",
        "'speaker_5': 'So, Councilmember, we understand the request to be one specifically to ring. We if you'd like us to look at some others we can or if anyone is interested in this, we understand that we have a little bit of a different relationship with Ring than we do with anyone else because of that M.O., you and they actually are'",
        "'speaker_5': 'the only one that we're aware of that has partnered with cities so far. So if someone has someone else that we could be talking to, well, we're going to be doing a review of this and bringing you back to from for about how you could do that partnership.'",
        "'speaker_1': 'Great. Thank you very much. I'll be supporting in any way, though.'",
        "'speaker_0': 'Thank you. Listen, I just want to also add, I think vice mayor and council members and everyone that's been involved, this is a great technology and opportunity for us. I think this is a really exciting way to also link up community safety and ensuring that people are a part of the the whole safety team.'",
        "'speaker_0': 'I think the great opportunities between the police department and these partnerships with the neighborhoods and obviously with this great new network. And so I'm excited to support this. I think it's a great idea as well. So thank you, Vice Mayor, again for another good item tonight and for the councilmembers that were involved in this as well.'",
        "'speaker_0': 'And so as your public comment on this item, please come forward.'",
        "'speaker_9': 'Good evening, Mr. Mayor, and members of the City Council. My name is Kathleen O'Daniel. I'm in the seventh District. I got an email from my councilman to come, and here I am. What I have might be a little tangential, but I'm here because of my experiences going door to door to get out the vote for working in'",
        "'speaker_9': 'campaigns of politicians and also doing voter registration and the fact that so many people don't have working doorbells. So there's a lack of communication in those households to people in their own community. And some people don't want it.'",
        "'speaker_9': 'They tell me if you're not from Publisher's Clearing House, get off my porch. You know, so I'm not always welcome. But I think having a working doorbell that has these other security advantages is fantastic. And I think it will also help in our efforts to increase the vote, which we know is very critical.'",
        "'speaker_9': 'So thank you for your consideration.'",
        "'speaker_0': 'Then we will go ahead and cast your votes for the Oracle district to. District three.'",
        "'speaker_1': 'Eye for eye.'",
        "'speaker_0': 'Five, six, seven, eight, nine. And motion carries. Thank you. I if I can get the consent calendar, please. And we're going to all of them. But item 12, if I can get a motion in a second for all but item 12.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract with Los Angeles Truck Centers, LLC, of Whittier, CA, for the purchase of Sterling and Autocar heavy-duty truck parts, in an annual amount of $160,000, with a 15 percent contingency in the amount of $24,000, for a total annual amount not to exceed $184,000, for a period of two years, with the option to renew for three additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_0': '5i6, seven, eight and nine. Motion carries. Now we'll be doing item 12.'",
        "'speaker_2': 'Report from Financial Management Recommendation to adopt resolution to execute a contract with the Los Angeles Truck Center for the purchase of Sterling and Autocar heavy duty truck parts for a total annual amount not to exceed 184,000 citywide.'",
        "'speaker_0': 'I do need a staff report, Councilman.'",
        "'speaker_4': 'I have two questions for public works. Doesn't have to be on the finances. I see him waving.'",
        "'speaker_1': 'We have Dan Berlin, the fleet manager, and also Craig Beck, the public works director, so far away.'",
        "'speaker_4': 'Thank you. I just you know, last week we were out on Broadway almost every day last week walking and doing an audit of the neighborhood. And we noticed on one of the streets that had just had street sweeping that we still had a lot of debris.'",
        "'speaker_4': 'So I just wanted to hear from public works about the future of our of our trucks. And I know that that we talked very briefly, but just a quick moment for my constituents to hear from you.'",
        "'speaker_0': 'Sure, Councilmember. Happy to. I think really what you're referring to is the type of fleet that we deploy out for street sweeping. And we've been working closely with our fleet services folks to identify a replacement sweeper for some of the recently purchased I'll call them vacuum sweepers.'",
        "'speaker_0': 'So many people are used to the traditional style of street sweeper that we've we use. And in many places in the city that have large brushes in the back and those brushes allow us to collect more debris than the vacuum sweepers that we've been deploying in certain areas of the city.'",
        "'speaker_0': 'So one of the challenges right now is ensuring that we can identify a model that gets through CARB, the Air Resources Board, they have to approve new motors. And so we're waiting on that final approval. And once that happens, will we'll have an order placed for new replacement sweepers.'",
        "'speaker_4': 'Great. Thanks. And the reason why I pulled the item is because it was, you know, making another purchase. And we wanted to make sure that we were still looking to the future of the best sweepers that we could possibly handle.'",
        "'speaker_4': 'So thank you for taking a moment. Vote yes. Appreciate it.'",
        "'speaker_0': 'Thank you. So there there is a motion and a second there's any public comment on this consent calendar item. Seeing none, we are going to go ahead to a roll call District two three. I.'",
        "'speaker_1': 'I. Five.'"
    ],
    "Recommendation to adopt resolution calling for the placement of a General Tax Measure on the Ballot of the March 3, 2020 Special Municipal Election for submission to the qualified voters of the City of Long Beach an amended ordinance to extend and adjust the rate of a Transactions and Use Tax, and making findings of fiscal emergency pursuant to California Proposition 218;": [
        "'speaker_0': 'Six, seven, eight and nine. All right. Okay. Next up will be that motion carries what we're now doing. Item 30, please.'",
        "'speaker_2': 'Communication from city attorney recommendation to adopt a resolution calling for the placement of a general tax measure on the ballot for the of the March 3rd, 2020 special municipal election to extend and adjust the rate of transaction and use tax and making findings of fiscal emergency pursuant to California's Proposition to 18, adopt a resolution providing for the'",
        "'speaker_2': 'filing of primary and rebuttal arguments and adopt a resolution requesting the Board of Supervisors to consolidate a special municipal election for one local initiative measure to be held on March 3rd, 2020, with the statewide primary.'",
        "'speaker_0': 'Okay, thank you. There is. And we have it unless there's any objection. We want to hear the staff report again from last week and no one's less. A customer wants to hear it again. I think we just go and go to the second vote.'",
        "'speaker_0': 'So why don't we go ahead and if the public comment on this item. Casey to members of the public. I'm going to close the speakers list. After these two three members of the public. And then I will close the speakers list.'",
        "'speaker_1': 'Okay. Thank you, sir. Jim Foster, president of the Long Beach Post. I come before you again to give my full support for this measure, really on five different levels for us staffing, equipment, facilities, technology and our mission and our mission being a community hospital and all the services that it provides not just to us but to fire'",
        "'speaker_1': '. Also, the staff report last week was fantastic. It describes a number of staffing positions that we will lose as a result of the loss of measure. It impacts us on multiple levels in each of your districts. The equipment that we're getting with body cameras, the radio systems that we have to have our facilities with specifically for me'",
        "'speaker_1': 'is the academy, which needs some desperate help. Our technology, which is coming in droves from the state and unfunded mandates of things that we have to do to accomplish, in fact, a requirement from the federal government that provides some compliance with our technology systems that we have to do.'",
        "'speaker_1': 'These are all items that the community benefits from. In fact, I can't think in my history here of any other measure that where the taxpayers got more bang for their buck and just things they can touch and hold and see and feel the impact of where these tax dollars are going.'",
        "'speaker_1': 'So again, I encourage your vote on this. I think this is a great event for the community, really, something they can celebrate in the future to see all of the benefits they gain from these dollars being spent. So thank you, sir.'",
        "'speaker_0': 'Thank you very much, Mr. Foster. Next speaker, please.'",
        "'speaker_1': 'Get my notes here. My name is Randall Chesky. My address is on record with the city clerk. I'm here. Thank you for having me. Honorable Mayor and City Council. I was actually here for another item, but this.'",
        "'speaker_7': 'Was very much related to what I was here.'",
        "'speaker_1': 'For. I am speaking on behalf of the permanent extension of this, the measure A This provides essential resources to many of our infrastructure improvements, our parks or recreational activities or libraries, and provides very important funds for making making repair, necessary repairs, improvements.'",
        "'speaker_1': 'It's essential resource for when we're looking at grants outside of our general fund, when we're looking for local dollars.'",
        "'speaker_7': 'To make competitive.'",
        "'speaker_1': 'Applications, whether it is for parks, whether it is for a street.'",
        "'speaker_7': 'Improvement at the federal, state, local.'",
        "'speaker_1': 'Level. So I encourage you to continue with this resource. It allows our our departments to.'",
        "'speaker_7': 'Better.'",
        "'speaker_1': 'Plan and make strategic investments for improvements, whether it is for MacArthur Park or I think there is another park plan ahead of you on this agenda. These are really important resources. I do encourage you to continue supporting it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Roski. In our last speaker.'",
        "'speaker_1': 'Rex Pritchard, President, Long Beach Firefighters Association. I can't thank you enough for staff council and the mayor and bringing this item forward and making this measure permanent. I echo the same sentiment President Foster had with the poet. This is vital for all of us.'",
        "'speaker_1': 'Now, as you drive through Long Beach, you see the improvements that are being made with measure, whether it's the restoration of Engine eight, Rescue 12, homeless engagement. In response, our Hart team the countless. Every budget this council has brought forward has been restoring public safety resources.'",
        "'speaker_1': 'And this council has been very responsible in using and spending those dollars. This is a proactive approach of keeping Long Beach dollars in Long Beach. And for those people who may not be supportive of this and some of the naysayers out there, and a year from now, they are going to be coming back saying thank you in'",
        "'speaker_1': 'bringing this forward, because if this council wasn't acting in the fashion they are and getting ahead of this, there will be other governmental agencies who are going to take these sales back, sales tax dollars that we're paying now, and they're going to get moved to another agency outside of Long Beach.'",
        "'speaker_1': 'This is a proactive approach and ensuring Long Beach Dollar stay in Long Beach. And I am just thankful that you are bringing this forward and I encourage our residents to vote for this because this is going to be vital in everything that is going on.'",
        "'speaker_1': 'You drive down 15th Street in seeing what is going on, on 15th Street, everything that's going on on the east side. And the most important thing, community hospital, that is a vital, vital part of the 911 system that we need to have your Long Beach firefighters and paramedics and EMTs as we are driving East Side residents all'",
        "'speaker_1': 'the way to memorial across town. Community hospital is vitally important to the nine 1 to 1 system. It's part of our team. So thank you for bringing this forward. And we look forward to the residents making this permanent.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes public comment. Councilman Richardson. No. Vice-Chair Andrews. Yes.'",
        "'speaker_3': 'I just want to say a lot of individuals, I especially when you have your two heads here, come and speak on something so important. When we talk about infrastructure and we have a person from the community letting you know that our our money that's going into $8 is just showing you what they do in the community.'",
        "'speaker_3': 'A lot of people ask, what is all this construction going on? That is your taxpayers money at work? And I just want to thank everyone for just letting you know that what you're doing. Don't think that we're just taking your money and just running away with it.'",
        "'speaker_3': 'We're doing things with Measure eight is a reason for that. And I want to thank our public for voting on that measure. Thank you very much, Mayor.'",
        "'speaker_0': 'Thank you very much. Councilman Price.'",
        "'speaker_11': 'Thank you, Mr. Mayor. I do have a question. I know that when we voted on measure the last time I'm putting it on the ballot, we had a resolution. Can staff give me an insight into whether or not we'll be amending that resolution to include community hospital and when that will happen?'",
        "'speaker_5': 'Mr. MODICA Yes, Councilmember, you're correct. There's a number of actions that you take. The ones right now we're doing this the same way we did measure, which is you're putting this agenda, this on the ballot, and then there will be a second resolution that is the intent to spend.'",
        "'speaker_5': 'And so if we get direction tonight for this to go on the ballot and one of the staff recommendations was to include community hospital, we would bring back that resolution to the council at a later date. And like we and it has been set yet maybe a month or two.'",
        "'speaker_11': 'Okay. And the other question that I had is, will we continue to have an oversight committee to ensure that expenditures are consistent with the intent of the council and consistent with the resolution that will be adopted in the future?'",
        "'speaker_5': 'Absolutely. That has not changed. They've met ten times already in the past three years, and every single year they not only review and give us give us input, but they also take actions and votes to make sure that when we are proposing that to you in the budget and you adopted, that those are consistent with the resolution'",
        "'speaker_5': '. They actually have their next meeting already scheduled for August 29th, and we're going to continue those meetings.'",
        "'speaker_11': 'Okay. That's great. Thank you, Mr. Moto. So I do have a couple of comments that I want to share. Um, I'm going to be supporting this item tonight, and one of the multiple reasons why I'm going to be supporting this item tonight, first and foremost, is going to be our need to contribute our portion to the reopening'",
        "'speaker_11': 'of community hospital. That is a new development since the passage of Measure H that the east side of Long Beach has now to deal with. We know that we had 27,200 emergency services.'",
        "'speaker_0': 'Consumer prices.'",
        "'speaker_11': 'Have increased. Yes.'",
        "'speaker_0': 'We we lost you there for about 10 seconds, but you're back on.'",
        "'speaker_11': 'Okay. So ambulance transportation times have increased 10% since community hospital closed. We know that in order to reopen the facility, we are going to need to be involved in a cost sharing with the network provider and we need to make sure that we have funding in place for that.'",
        "'speaker_11': 'As we move forward with those discussions and that process, which itself is a very lengthy and multiple regulatory agency involved process, and so we need to have that funding set aside and a plan in place of how we're going to continue to meet our responsibility as a partner in the endeavor to reopen the hospital in 2016.'",
        "'speaker_11': 'When the voters approved Measure A. One of the biggest concerns that my constituents shared with me was that we were going to be having the highest sales tax in the city of Long Beach as compared to cities within the region.'",
        "'speaker_11': 'And at the time, what I shared with my residents and something that I'll continue to share today is that, you know, we're looking at as well, we're talking about our sales tax measures, our sales tax numbers. We're looking at a point in time.'",
        "'speaker_11': 'If you look at what's going on throughout the state of California, the challenges and opportunities that have been presented to the various municipalities throughout the state, it's not surprising to see that sales tax numbers have changed not just since 2015, but that the trend is that they're continuing to change.'",
        "'speaker_11': 'In fact, in looking at the cities in the region that have a 10.25%, we've got Burbank, Compton, Covina, kind of. Hey, Culver City, Glendale, Glendora, Hawthorne, Lawndale, Monrovia, Pasadena, Pico Rivera, Pomona, Santa monica and South Gate. These are all cities within the region that have the same sales tax measures that we do.'",
        "'speaker_11': 'And the reason for that is because they have a lot of the same opportunities and challenges that we're seeing with our budget and with the the the needs of the community. I think one of the key factors for me in deciding to support this was that because state law places the total cap on sales tax at 10.25%'",
        "'speaker_11': 'for local taxes, an extension of Measure A, we need to take that cap into account. The proposed extension would levy a point 75% tax from 2023 to 2027. Then when Measure H expires in 2027, that rate would be 1%, the same amount levied from 2017 to 2023.'",
        "'speaker_11': 'We know that there are other government agencies considering sales tax ballot measures, which is an act that would use up to 0.25% remaining under the cap after 2023. So the sales tax rate in Long Beach after 2023 would continue to be 10.25.'",
        "'speaker_11': 'But the 2.25% increase would not be spent locally. And that's a huge, huge consideration for me. We have restored a lot of services in terms of public safety. For me, that's key. The fact that we're going to be able to finally have a body worn camera program in the city of Long Beach is it's just so long'",
        "'speaker_11': 'overdue. I cannot say enough about the need for us to include that technology in our current policing model. The fact that we don't have it right now is disappointing to me. And the fact that we are going to have it is very for me, it's a very positive step in the right direction.'",
        "'speaker_11': 'So for me, the fact that we have restored Engine eight and multiple other fire resources throughout the city, the fact that we've continued to add police officers every year and fire resources has been a tremendous benefit to my resident.'",
        "'speaker_11': 'You know, one of the things that the residents tell me all the time is we need more police officers, we need more police officers to address the issues we're dealing with, with a lot of the homeless unintended consequences of homelessness that we're seeing.'",
        "'speaker_11': 'And what I tell residents all the time is, you know, this is homelessness is not an issue. That is a police that has a police solution attached to it. Enforcement is not the solution. But I do know that it gives at least the residents in my district a lot of comfort to know that police officers are out'",
        "'speaker_11': 'there, ensuring that people are offered services and ensuring that people are held accountable when they violate the rights of others, whether that's in the form of theft, whether it's in the form of quality of life type crime. And so seeing more police officers out there patrolling the streets, seeing more police officers be proactive in enforcement action, has'",
        "'speaker_11': 'been something that has been very positive in my district. And we cannot we absolutely cannot afford to go backwards in terms of our resources. We need to ensure that we maintain the resources that we have restored. And finally, I mean, when I took office in 2014, we were paving about two strips per year in each district.'",
        "'speaker_11': 'It was very, very depressing to go to a community meeting and tell them that no streets in that neighborhood were going to be getting paved that year. It was great if the community meeting that you were at happened to be one of the ones where the streets that are getting repaved situated in.'",
        "'speaker_11': 'But for the for me, there's 21 community organizations in the third district. So we were able to pave one or two streets per year, which which meant that somewhere between, you know, 19 to 28 community organizations, there was no good news to share.'",
        "'speaker_11': 'That has changed a lot since the passage of Measure eight. We've been able to pave so many streets and address a lot of immediate needs in terms of street repair that we were not able to do before. Of course, I hope that measure funding in in the future is used for alleys and sidewalks throughout the city.'",
        "'speaker_11': 'I do not believe that it is fair to persistently tell residents that they're going to have to wait on alleys because there are alleys and worse conditions, because I do believe that we need to figure out a way to allocate that infrastructure money equally throughout the city so that every district and every resident feels the benefits of'",
        "'speaker_11': 'the measure. $8 in their neighborhood. And so for me, making sure that alleys throughout the city are given priority is important, because I understand that the condition of alleys is very much something to be evaluated in perspective. But when you have an alley with multiple potholes and flooding, it's hard for you to say, Well, you know what'",
        "'speaker_11': ', I'm going to drive through this flooding and I'm going to drive through these potholes every day because there are dirt alleys that need more attention than than my alley. While I understand that concept, that sounds fair. I think people have a hard time supporting attacks, as they should, when they're not seeing the immediate benefits of it.'",
        "'speaker_11': 'So that's one area where I hope that the resolution will include equitable distribution of funds for alleys and sidewalks. With that, I thank my colleagues for indulging me and allowing me to share my comments on this very important issue.'",
        "'speaker_11': 'This is an issue that I have received a lot of feedback from my residents on. I am a broad currently, but it was important to me to weigh in on this issue so that the record is clear in terms of my desire to continue to maintain the resources that we have restored and to do whatever we can'",
        "'speaker_11': 'possible to ensure that our contribution to the reopening of community hospital is secured in the form of a future revenue projection. Thank you very much.'",
        "'speaker_0': 'Thank you very much, Councilwoman. Let me let me just cut to close. Let me just add, I want to just first thank the staff and the attorneys. I know you've all worked very hard on getting this. I particularly want to thank Amy Webber from your team, Mr. City attorney, who's just a superstar and your office and consistently'",
        "'speaker_0': 'does a great job. Can we just give her a round of applause? Because, see, this stuff is actually it's a lot of hard work. And, and she does a really great job for you and your team. Mr. City Attorney So I just wanted to thank her.'",
        "'speaker_0': 'I also want to thank our our departments, I think particularly on police and fire and public works. You have all been great stewards of some of these resources in the past and what we've done, including the other departments that have seen the benefits and we know that will continue.'",
        "'speaker_0': 'And so just excellent work and we look forward to ensuring that these resources stay in Long Beach and don't go to other outside agencies. And I think that's critical for us moving forward. And so thank you for to all for for moving this forward.'",
        "'speaker_0': 'So with that, I'm going to do the roll call vote.'",
        "'speaker_3': 'Before we get started, could Amy stand up about 20 minutes and speak to us?'",
        "'speaker_0': 'Thank you. Thank you, Miss Weber. And so with that, let me let me go into the roll call vote. So District two, District three.'",
        "'speaker_11': 'I.'"
    ],
    "Recommendation to adopt resolution establishing an annual special tax of $0.14 per square-foot for Community Facilities District No. 2007-2 for commercial properties in Belmont Shore for Fiscal Year 2020 and authorizing the Los Angeles County Auditor-Controller to be included on the 2019-20 Secured Tax Roll.  (District 3)": [
        "'speaker_0': 'District four i. District five I. District six. District seven i. District eight. And District nine. Thank you. Motion carries. Thank you for for passing that. And we will be moving on to the next item, which is going to be item 41.'",
        "'speaker_0': 'You the Missouri.'",
        "'speaker_3': 'You please.'",
        "'speaker_2': 'Report from Public Works recommendation to adopt a resolution establishing an annual special tax of 0.14 per square foot for commercial properties and Belmont Shore for fiscal year 2020, and authorizing the Los Angeles County Auditor Comptroller to be included in the 2019 2020 secured tax role District.'",
        "'speaker_8': 'Three.'",
        "'speaker_3': 'Whoever we put in there.'",
        "'speaker_1': 'Craig Beck, our public works director.'",
        "'speaker_11': 'And I have a few questions for staff.'",
        "'speaker_3': 'But excuse.'",
        "'speaker_2': 'Councilman Price has a few questions. Her staff.'",
        "'speaker_1': 'We could have the questions and then Craig can answer them.'",
        "'speaker_3': 'Are you okay? Go ahead and start.'",
        "'speaker_11': 'Okay. Okay. Thank you very much, Mr. Vice Mayor. Um, so, Mr. Beck, I do have a few questions that have come up on this, and I'm hoping you could clarify them for me. Um, what's the Belarus Fund used as the primary source of repayment of the bond?'",
        "'speaker_11': 'Or were Mr. revenues used?'",
        "'speaker_0': 'Councilmember Price. We conducted a review of the Mallory's funding. It collects roughly, say, 65 to $70000, depending on where the assessment rate is set. Our debt service on our bonds is currently about $270,000, so it's really a mixture.'",
        "'speaker_0': 'The Melrose collected again about 65 to $70000, and then the rest of that is supplemented with parking meter revenue.'",
        "'speaker_11': 'Okay. So my understanding is that, um, the revenue sources for the annual payment obligations are 200,000 from parking meter revenue. And then the risk assessment. Is that right?'",
        "'speaker_0': 'Fairly close again. The Melrose Sets collected its first pledge to the debt service, and then the parking meter revenue makes up the difference, and that difference is roughly $200,000.'",
        "'speaker_11': 'Okay. Was the Belarus Fund used to pay back public works for the immediate improvement and instead of the meter revenue.'",
        "'speaker_0': 'Councilmember. No, that is not accurate. Again, the assessment for the Melrose is being used for debt service. We utilize parking meter revenue to do the improvements along the Second Street corridor that address the medians and the landscaping and the lights and some of the other enhancements that were made.'",
        "'speaker_11': 'Okay. I think that's a really important point. So it's it's a it's an unequivocal no. The reason the median repayment was budgeted as the parking meter funds budget, the Melrose Assessment was not used for the meeting. Is that correct?'",
        "'speaker_0': 'Yes, Councilmember, that's correct.'",
        "'speaker_11': 'Okay. Um. We have heard some concerns about that. There was supposed to be $700,000 in the Mallory's account. Can you shed some light on that?'",
        "'speaker_0': 'Councilmember I heard that, but as far as we understand, that is not correct. There was an initial bond offering of about $5.4 million when the bonds were issued in the Melrose was generated. Since then, we've been making repayments to the bond structure.'",
        "'speaker_0': 'And as mentioned, we're collecting roughly the 65 to $70000. What we are proposing with this action is that we would set the assessment at $0.14. This is a $0.01 decrease from the current fiscal year, which was set at $0.15.'",
        "'speaker_0': 'We anticipate that.'",
        "'speaker_11': 'Okay.'",
        "'speaker_0': 'So I was just going to say, we anticipate the $0.14 will generate roughly $69,000.'",
        "'speaker_11': 'Okay. So tonight's action would actually be decreasing it from the present 50%.'",
        "'speaker_0': 'That is correct. If Council approves this item, it would decrease the assessed rate from $0.15 to $0.14.'",
        "'speaker_11': 'Okay. What is the military spending paying for currently?'",
        "'speaker_0': 'Councilmember. Currently, all the funds have been expended except for roughly $70,000. It can be used for any parking improvement within the within the district. So most of the funding has already been expended. And at this point, we're just making debt service payments.'",
        "'speaker_11': 'Okay. And one of the requests that I had from stakeholders in my district was to continue this item to a later date. Is that possible? And if it's not, why is that?'",
        "'speaker_0': 'Councilmember Yes, we understand that request came forward. Unfortunately, we need to have this item addressed this evening because we have to have information to the county assessor by the end of the month to be able to put the assessment on the rolls.'",
        "'speaker_0': 'If we do not take action tonight, then the rate would stay at $0.15 for the next year.'",
        "'speaker_11': 'Okay. And then another area where we had a lot of concerns from some of the stakeholders was on the topic of notice. Can you please share to the best of your ability what the notice requirements are when there is a change in the rate?'",
        "'speaker_11': 'And, you know, maybe some historical perspective on when the rate has been changed and what type of outreach has been done.'",
        "'speaker_0': 'Well, I'll do my best. I don't have a long history with this item. I can tell you that the the assessed assessment rate was about $0.12 for a number of years. Recently, we were finding that there was a gap in the amount of money raised to be able to make the payments.'",
        "'speaker_0': 'So there was a recommendation to increase the $0.15. I believe city staff could have done a better job reaching out and educating the stakeholders about that increase. Unfortunately, that was not done. So you are trying to do that this year.'",
        "'speaker_0': 'There is not a noticing requirement, but it certainly is a best practice. That we would work with the stakeholders whenever a changes made.'",
        "'speaker_11': 'Yeah, I agree. And, um, this is obviously something that was initiated by staff and presented to our office as basically a. A necessity and not something that we had too much discussion or outreach on. So I think moving forward, it would be a best practice for us to engage a little bit earlier if there's going to be'",
        "'speaker_11': 'any rate adjustments. I'm happy to see that the rate adjustment that we're voting on tonight is actually a decrease and that it's getting us closer to the 12% rate that we had for a number of years. And in the future, should there be any sort of rate adjustment?'",
        "'speaker_11': 'I think it would be important for us to maybe have some discussions or or maybe even an outreach meeting in advance of it coming to council. But I know that you share that that intent with me. So moving forward will make sure that we do that.'",
        "'speaker_11': 'In regards to tonight's item specifically, are you able to give any sort of prediction as to whether there will be another rate change in the next year or two?'",
        "'speaker_0': 'Councilmember. I'm not in the prediction business, but my anticipation is that we would leave it at $0.14.'",
        "'speaker_11': 'Okay. So that so it would not be appropriate for me to ask you to predict what streets are going to get repaved in the next few weeks either.'",
        "'speaker_0': 'Maybe once you return from vacation, we can have that discussion.'",
        "'speaker_11': 'That sounds good. Excellent. Thank you very much. I have no additional comments or questions.'",
        "'speaker_3': 'Thank you, Mrs. Rice. Would you like to continue, Mr. Craig, with your report? Oh, is that it?'",
        "'speaker_0': 'Vice Mayor I think that we covered all the outstanding questions. I'm happy to go in more detail if the council would like, but I'm fine at this point.'",
        "'speaker_3': 'Thank you very much. Councilman Orson. Fine, Councilman Ewing. Okay. Do you have any public comment in this? Could you please. Come on. State your name. You have 3 minutes.'",
        "'speaker_1': 'Sure. Okay. Son I can feel District six. I'll be curious to hear from Mr. Beck about in regards to the roots of this area. You brought up the being decreased from $0.15 to $0.14. I just happened to find online the hundred and 12 page report done by the legal counsel that initiated the original one.'",
        "'speaker_1': 'I think it's Quinn Quint something Quentin related when you you know, I'm just curious about Proposition 218, which is how this even comes into effect when you change the the tax, the amount of tax for this, which is basically a parcel tax when you change the amount.'",
        "'speaker_1': 'Isn't there supposed to be some type of like a two thirds approval from voters? That's a question I have. And also, is this decrease within the tax? Because according to the series 29, the expectation for these bonds, it's supposed to be about 75,000 for 2019.'",
        "'speaker_1': 'Is there any kind of, you know, evaluation in regards to the new development on the second PCH that's coming along? Just curious about these things. Thank you.'",
        "'speaker_3': 'Thank you, sir. Did you want any answers to those questions or are you just. All right. Wonderful. Thank you very much. Anyone else? Fine. We can go to the vote. This is why.'",
        "'speaker_1': 'I did want to get some clarification.'",
        "'speaker_3': 'Okay. Councilman, Arson.'",
        "'speaker_1': 'City manager. Mr. West, can you answer the question regarding the requirement for a two thirds majority? Sure. Mr. Beck can answer.'",
        "'speaker_0': 'Sure. Council Member Austin Council Regarding the community's comment. This is an assessment for a specific number of parcels. This is not a citywide assessment. If you think of it, the mailroom is I like to use the term set up similar to kind of in a way where certain property owners are paying rent and those dollars are only'",
        "'speaker_0': 'used within within certain boundaries. And I think the question was put out, does does the development of the second impact have an impact to this? And as.'",
        "'speaker_1': 'Of now, this.'",
        "'speaker_0': 'Project is not within the jurisdiction of these properties.'",
        "'speaker_1': 'Thank you for answering that. And I was clear. I just wanted to make sure that the public was as well. Thank you.'",
        "'speaker_3': 'Thank you. I'm sorry I am on public comments on this item. If not, we will go to the vote just to go. District to district three.'",
        "'speaker_11': 'I.'",
        "'speaker_1': 'For.'",
        "'speaker_8': 'I5ii.'"
    ],
    "Recommendation to adopt resolution to Denounce Georgia's Living Infants Fairness and Equality (LIFE) Act (HB 481) and Alabama's HB314, Immediately Suspend Official Travel to Georgia, Alabama and any other State which Adopts Similar Heartbeat Legislation and Imposing Financial Sanctions until Such Time as the New Law is Revoked, Amended, or Struck Down.": [
        "'speaker_3': 'Think District six, seven, eight, nine. Designate. Yes. Thank you. But. We move on now to item 43, please. Do you please with the 1843.'",
        "'speaker_2': 'Communication from City Attorney Recommendation to adopt resolution to denounce HB 41 and HB 314 immediately suspend official travel to Georgia, Alabama and any other state which adopts similar heartbeat legislation until such time as the new law is revoked, amended or struck down.'",
        "'speaker_3': 'By UMD to have a public opinion. Any public comment on this item? We're going to the public purse, if not anyone. Congresswoman, first. Okay, Congressman, your anger. Okay, fine. We can take a vote. District one. District two, District three.'",
        "'speaker_3': 'I. Just before. I. I. I. I.'",
        "'speaker_1': 'Seven i.'",
        "'speaker_3': 'Eight and nine. You. Now we're going to move. And now we're going to move back to. Let's see. I think when we were back to 30.'"
    ],
    "Recommendation to receive and file a report from the City Manager on earthquake preparedness in Long Beach, including but not limited to the Alert Long Beach system, seismic studies of buildings in the city, and general readiness for natural disasters.": [
        "'speaker_1': 'Item 28.'",
        "'speaker_3': 'Item 21. Okay. Now we're going to move back to item 28. That would be. She please.'",
        "'speaker_2': 'Item to item item 28 Communication for Mayor Garcia Recommendation to receive and file a report from the City Manager on earthquake preparedness in Long Beach.'",
        "'speaker_3': 'Right to have a report on that week.'",
        "'speaker_5': 'Mr. Vice Mayor, members of the city council. This was an item that the mayor has put on to really educate the community about what the city does in during an earthquake. So we obviously had those two right on the fourth and the 5th of July.'",
        "'speaker_5': 'Rest assured. Ah, we were responding. We were. Everything was working the way that it should. And we'd like to really take this chance to hear from Reggie Harrison on behalf of our departments about what it is that we do during an earthquake, what we recommend to the public on how they can help.'",
        "'speaker_5': 'And also talk a little bit about seismic resiliency hearing from development services. So with that, I will turn it over to Reggie Harrison, our director of Disaster Preparedness and Emergency Communications.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_10': 'Thank you. Thank you, Mayor, and members of City Council for this opportunity to present this update to you. Seismologists have for years been predicting a strong earthquake to impact this area. City staff has taken those predictions seriously at the beginning of the year, at the beginning of fiscal year in October.'",
        "'speaker_10': 'The city hosted a Homeland Security Executive seminar attended by our management team, all department heads, including the Port and Water Department. We were joined by 60 other participants, including including the L.A. and Orange County Sheriffs, the L.A. City Police and Fire, the FBI, National Guard and others.'",
        "'speaker_10': 'We brainstormed around a catastrophic event that would require all of our collective efforts, like an earthquake. We put it we put into practice the lessons learned from that seminar that day. To be clear, earthquakes cannot be predicted, not even by the famed Southern California seismologist, Dr. Lucy Jones.'",
        "'speaker_10': 'What we do know is that we live in an area prone to earthquakes, and we need to be prepared to survive as individuals, as a family and as a city. So on July 4th, a 6.4 magnitude earthquake rattled.'",
        "'speaker_10': 'Southern California was the largest earthquake that we had experienced in the last 20 years. The quake struck near the city of Ridgecrest and in Kern County, which is about 160 miles northeast of Los Angeles. People, however, felt the effects of that earthquake from Las Vegas to Phenix to Ensign out of Mexico.'",
        "'speaker_10': 'Then one day later, on July 5th, a magnitude 7.1 earthquake struck the exact same area. That the second earthquake was larger, higher in magnitude, and the first was alarming even to seismologists and of course, to many residents. There is no doubt had either one of those earthquakes hit closer to the metropolitan Los Angeles area, there would have'",
        "'speaker_10': 'been injuries. Compare this to the 1994 Northridge 6.9 magnitude earthquake, which killed 57 people and caused billions of dollars in damages. In Long Beach. We train our staff and work with our residents to be prepared for all hazards.'",
        "'speaker_10': 'Of course, we live on the Pacific Rim and with that comes the rest of us tsunami or sea level rise. We are responsibility for securing the twin ports of Long Beach and Los Angeles. And with that comes terrorist threats and natural and man made disasters, as well as we're responsible for the Los Angeles and Long Beach airports'",
        "'speaker_10': '. Again, terrorist attacks and natural disasters are major concerns there. Now, an earthquake is the most probable disaster that we face in this area because of the many earthquake fault lines that crisscross the region. Many fault lines are near Long Beach, including the Newport-Inglewood, Palos Verdes and Cabrillo Fault Lines.'",
        "'speaker_10': 'And you see some of those fault lines depicted there in that picture. The city has many disaster preparedness and response plans that comport with the Department of Homeland Security and FEMA's national standards. All of our plans have been approved by FEMA.'",
        "'speaker_10': 'The fact that we have plans that have been approved by FEMA allows us to be able to apply for additional grants as well as for disaster response reimbursement. Community outreach is one of our major priorities, and we take a whole community approach to disaster preparedness and train our staff and residents to be prepared for all hazards, whether'",
        "'speaker_10': 'preparing for an earthquake or tsunami. Having a family emergency plan is one of the most important things we can do. The plan should include where to meet if the family is separated, and a communications plan for contacting a relative who lives outside of the impacted area.'",
        "'speaker_10': 'And we also encourage residents to think about their pets as well. What are the needs of pets? We've we've seen across the country that people tend not to evacuate from their homes. And unless they're sheltered in us, their pets can also travel with them.'",
        "'speaker_10': 'We encourage residents to become members of certain, to be trained in areas to promote self-sufficiency. Residents should take disaster related first aid classes from the Red Cross and other providers. The really Long Beach, the the very Long Beach Disaster Preparedness and Resource Fair is one of the largest of its kind in California.'",
        "'speaker_10': 'Last year, we attracted over 3000 attendees for this event, the fire department said. And the Department of Disaster Preparedness. Our primary organizers for the event were representatives from across Southern California attend this event. The Red Cross. Los Angeles County Resources.'",
        "'speaker_10': 'The National Guard. SoCal, Edison and other utilities are there. We have events that include first aid demonstrations, emergency vehicle displays and preparedness booth for various vendors. This is a much sought after event. Representatives from Cal Lewis often come down to this event to just experience how large of an event this is.'",
        "'speaker_10': 'This year's event will be held on September the 28th at Cal State University, Lombardi's campus. Earthquake preparedness, in particular before an earthquake. And I talked about some of these already before the shaking begins. We should have family plans, go kits in place, and especially for an earthquake, secure, breakable items and large items that tend to fall over'",
        "'speaker_10': 'and of course, take first aid classes during an earthquake. I think we all know the drill. We practice that the last couple of weeks I believe now since the earthquakes to drop, cover and hold on drop to the floor and cover your neck and head and hands and get under a table and just hold on until the'",
        "'speaker_10': 'shaking stops. Running out of a building is not recommended. It's not a good idea as objects attached to buildings tend to fall off. In fact, the only people that got killed in the Paso Robles earthquake back in 1992 were people who ran out of the store and got hit by falling debris from the store after an earthquake'",
        "'speaker_10': '. As a time to check for injuries to your family and neighbors, turn off gas only if you smell leaking gas and listen for updates from the city and be prepared for aftershocks. One of the programs that we are really promoting with neighborhoods and a number of you council members have seen me make presentations on this program, which'",
        "'speaker_10': 'is really your Long Beach neighborhood. Recent events across the country have shown that the new first responders in the immediate aftermath of a disaster are fellow neighbors. Neighbors helping neighbors is the basis of the map. Your Long Beach neighborhood program that we are encouraging residents to participate.'",
        "'speaker_10': 'And through this program, we teach residents to understand and identify the risks in their neighborhood. Who are the elderly, the mobility impaired, the residents that are dependent on electrical medical equipment, and then to also identify the resources that they have in their community, who other residents that have plumbing skills, electrical skills, who's that neighbor that has every'",
        "'speaker_10': 'gadget in his or her garage that you can imagine? Who are the retired nurses and teachers? And so through this approach. Neighbors develop a plan for how they will help each other until a police and fire personnel arrive.'",
        "'speaker_10': 'They identify a meeting place who is going to check on the elderly, the children who are home alone, who will make rounds to determine if gas lines are busted. I place at each of your chair a backpack that we intend to be able to distribute a few to the neighborhoods that successfully go through this program, where this'",
        "'speaker_10': 'does take work on the part of our neighbors where we have staff that's available to assist with that. Alert. Long Beach is the city's emergency mass notification system. And you'll recall during the power outage in 2015, system did not service our community well.'",
        "'speaker_10': 'We have a new system in place that we implemented shortly after the 2015 power outage. This is a system by which we would notify our residents what has happened. What first responders are doing and what actions our residents should take to protect themselves.'",
        "'speaker_10': 'Residents do have to sign up for alert based to be able to receive voice, text or email messages. During the Ridgecrest earthquake, we sent out three messages through this system and one of them for the first time ever, we sent a message to the entire database in the city of Long Beach, 197,000 phone numbers.'",
        "'speaker_10': 'We had a 45% rate reach and we gained 6000 new contacts either text voice or email contacts to the system. We have made signing up even easier for residents. You can easily sign up for alert lobbies by simply texting alert L.B. to 99411 and a sign up link will be sent to you.'",
        "'speaker_10': 'It's as simple as that to be able to receive these emergency notifications. Shakealert. L.A. is a relatively new app that has just come out. It was in effect prior to the Ridgecrest earthquake. Our residents need to download this app to be able to provide a warning of a pending earthquake.'",
        "'speaker_10': 'Lambie's beta tested the technology behind this app for the previous four years. We have confidence in it that it works. The public facing app test that has been released is set at a 5.0 and above earthquake. Hence, we did not receive an earthquake warning through the system for the Earth for the Ridgecrest earthquake.'",
        "'speaker_10': 'However, the city of Los Angeles has reset that threshold now, so it's a much lower threshold so that the notice would be sent out. The system provides information and English and Spanish is available on for iPhones or Android.'",
        "'speaker_10': 'You have to download that app and the city and the county and the city of Long Beach. Disaster preparedness will continue to work to perfect this notification system. We recently completed the development of a crisis communication plan, working with a consultant and a city manager's peer and peers from across the city.'",
        "'speaker_10': 'This plan provides guidance for the coordination of communications during during a crisis. The plan considers all communication platforms, including social media, media and press releases. The plan is also sensitive to the needs of our non-English speaking residents and those with other disabled access and functional needs.'",
        "'speaker_10': 'This slide provides an outline for how incident manager incident response flow works from the street level up to the federal government. The slide also depicts the scalability of this federal system. Every incident, regardless of the size, utilizes the incident management system.'",
        "'speaker_10': 'Every department has staff that has been trained in the system. Police and fire have personnel that have received advanced training and all has an incident management system. Often are all hands. Teams are requested to go out to assist other jurisdictions outside of the city of Palm Beach.'",
        "'speaker_10': 'Our fire department plays a critical role in in the event of an earthquake. A priority for them is to ensure the safety of their equipment or apparatus that it is not so that they're not stuck in firehouses. They're responsible for making critical facilities checks.'",
        "'speaker_10': 'And as you can see from the previous slides, fires do erupt during an earthquake. And so they all have a primary role of controlling those fires. Similarly, the police department, the police are our eyes and ears out on the street.'",
        "'speaker_10': 'They provide us with situational awareness in terms of what's going on across the city. The police would coordinate evacuations if necessary. Police would also enforce any curfews that may be established by the city council and much, much more responsibilities.'",
        "'speaker_10': 'Public Works has a responsibility to ensure the free flow of traffic by removing debris that might hamper first responder police, fire, emergency medical personnel. They also have a responsibility to check critical facilities. I hope the Human Resources Department is responsible for coordinating mass care and sheltering sites if necessary.'",
        "'speaker_10': 'The city health officer would issue orders regarding air quality or boil water any of those issues related to health. Our city health officer would have that responsibility. And with that, I'm going to turn this presentation over to Linda Tatum.'",
        "'speaker_6': 'Thank you, Reggie. I will be covering some of the proactive activities and a little bit of the history regarding the city's efforts regarding seismic activity. And the first is a just a piece of trivia in history regarding the 1933 Long Beach earthquake.'",
        "'speaker_6': 'It was that earthquake that where there were over 100 deaths caused and and more than $40 million in damage. And interestingly enough, the the deaths were caused by people leaving the buildings and being hit by falling debris. But as a result of that earthquake, the good that came out of it were two really critical pieces of seismic'",
        "'speaker_6': 'legislation. The first was the Field Act. And what that did was establish or was the basis for the city's office creation of the state's Office of State Architecture. And that's the entity at the state level that actually permits and approves all of the state facilities, as well as critical care facilities, things like hospitals and schools, again, public'",
        "'speaker_6': 'schools and hospitals. The second provision in the legislation was the Riley Act, and that was the legislation that required all cities and counties to regulate building construction. So it was a very early days of the California building code.'",
        "'speaker_6': 'So the very first and most vulnerable buildings that occur during that are that are damaged during seismic activity are what we call the unreinforced masonry building. So essentially buildings that are the brick buildings. And back in 1971, the city did an inventory of all of its masonry buildings, and it was a voluntary program for the property owners'",
        "'speaker_6': 'to actually seismically reinforce those buildings. And it was amended in 1976 to make that a mandatory requirement for owners of those buildings to upgrade those buildings with retrofits. And from this program, the city did an inventory, and of the 936 buildings identified, the vast majority were actually repaired, but a significant number, over 300 were actually demolished.'",
        "'speaker_6': 'And the very last building that was completed under this program, which took a number of years, was the Masonic Temple that's located on Locust Avenue, one of the city's historic buildings in the downtown, and that was retrofitted as recently as 2007.'",
        "'speaker_6': 'So I talked a little bit about the soft story buildings. That's the I'm sorry, I talked about the unreinforced masonry. Another very vulnerable building that we have to deal with here in the city are what we call soft story buildings.'",
        "'speaker_6': 'And those are essentially buildings that where there is no attachment to the foundation. And this photograph here that shows the tuck under parking, that's essentially what the type of construction that we mean when we talk about soft story building.'",
        "'speaker_6': 'As you recall, during the the 1994 Northridge earthquake, that's when the city first implemented a voluntary program for other types of vulnerable building construction. And the slide here shows a list of those buildings. But of course, they include single family residential buildings that were not at the time they were constructed many years ago under the building codes'",
        "'speaker_6': '. They were not required to be attached to the foundation. So that's one of the major categories. And then I talked about the soft story buildings. Again, this is an example of those were the the building the wall of the building is not attached to the building foundation.'",
        "'speaker_6': 'And there are a couple of other types of vulnerable construction types. And after the Northridge earthquake, that's when the city required these buildings to be seismically retrofitted. I'm sorry, a voluntary program for these buildings to be retrofitted. So what I'd like to talk about here is one of the city's efforts starting in the late 1990s, which was'",
        "'speaker_6': 'an assessment district. It was the city's first attempt to try to establish a funding source for buildings that were damaged or buildings that were built under former building codes that were not seismically anticipated to withstand substantial earthquake activity.'",
        "'speaker_6': 'They created an assessment district and that covered about over 500 residential structures. And this was, again, some of the older, more vulnerable buildings built under older building codes, essentially pre 1934 buildings. And after the initial assessment, we added additional 65 units to this assessment district.'",
        "'speaker_6': 'So the results of the assessment district were mixed because of some of the extensive work that needed to be done to some of these buildings. There were definitely some some issues with the buildings. Some of the property owners were able to complete the seismic retrofits without any issues.'",
        "'speaker_6': 'But there were a number of problem areas where the scope of the retrofits were more substantial than the property owners could handle. That resulted in some some cases where a few property owners actually lost their properties. And this effort actually continued until I'm going to say about the mid-term, early to mid 2000s.'",
        "'speaker_6': 'But that program and that assessment district is is no longer active. So that's kind of a lesson learned for the city, because as we go forward, we'll be looking to make sure that any future program that the city structures will take into account the kind of the potential funding sources.'",
        "'speaker_6': 'And we'll be looking for ways to incentivize for property owners to be able to complete the the necessary retrofit. So this next slide just gives you a list of some of the buildings throughout the state of California that have actually undertaken a number of different approaches in terms of how they've addressed having their building inventory, in terms'",
        "'speaker_6': 'of a number of different approaches and how they funded, whether they provide incentives. So there is a lot of good information in some of the cities that have started programs. And as we go to the next step and try to and start to craft our program, we'll be looking carefully at each of these programs and making sure'",
        "'speaker_6': 'that we establish best practices from among the cities that do have active programs. And I think as anything, we'll just need to be aware that there is no magic bullet. There is no one city that has a perfect program.'",
        "'speaker_6': 'I think, like most of our other efforts, will need to look carefully at the city of Long Beach. We're different from many other cities in the state. We have an older building stock and our income levels aren't necessarily what some of the other cities that have more aggressive programs.'",
        "'speaker_6': 'So we'll be looking at all of those factors. So again, the next steps for us, once we get direction from council, we will be looking at picking up a program, an effort we started initially back in 2018, which is a scope of work that brings on board a consultant to take a look at the inventory of these'",
        "'speaker_6': 'buildings so that we have a comprehensive inventory of the vulnerable buildings. We would then look to expand that scope of work to include having someone take a look at possible funding options again so that we can provide an incentive to property owners to support their retrofit activity.'",
        "'speaker_6': 'And we've had a very last year's effort. There was a preliminary price tag to do this work at 1.1 million. But again, we'll be going back to relook at that scope, seeing if there are some ways to make sure we get a very complete list of that scope of work with the added benefit of having them look'",
        "'speaker_6': 'at funding sources and hopefully try to get a better value on that. But we'll be doing that through an RFP process. So we'll be again looking at that and looking at other cities programs to make sure that we establish a program that that works very specifically for the city of Long Beach.'",
        "'speaker_6': 'And again, just to close out here to talk about some statewide legislation that was previously considered, this was the AB 2681 that was proposed to require local and state reporting of the inventory program for for building. And that's the type of program we're going to be taking a look at.'",
        "'speaker_6': 'That bill was vetoed by the governor. So it's not a requirement. But again, we think it's best practice isn't something that the city should be moving forward on. And again, there are other proposed legislation regarding seismic resiliency. And we, through our city manager's office, will be continuing to track those bills.'",
        "'speaker_6': 'I'll turn it over now to Craig back to complete the presentation.'",
        "'speaker_0': 'Thank you, Linda. I think we have seen that the outline this evening is really focused on all the opportunities that exist relative to preparing and preparing one's residents to be safe. But we just wanted to spend a brief moment highlighting some of the critical infrastructure that we have in Long Beach and what we're doing to make sure'",
        "'speaker_0': 'that it's safe for continued use. So we know right now that there is over 200 facilities in the city that we would consider a critical facility. So these are our fire stations, our police headquarters, our pump stations, our water and energy resource utilities.'",
        "'speaker_0': 'Certainly our city hall and other important government buildings. And then we we know we've identified some weaknesses, in particular some of our bridges. It's surprising to think, but we have over over 100 bridges in this in Long Beach, 131 that are owned by the city.'",
        "'speaker_0': 'So we need to start being diligent in analyzing those bridges and making sure that they're safe so we can provide access if we were to have a major event in the city. We want to make sure public safety can can get to those.'",
        "'speaker_0': 'But recently, as detailed, there's new building methods that really focus on the resiliency of a city facility. And I think the first city facility that really employed a lot of this was our echo. So there was actual rockers put within the building foundation.'",
        "'speaker_0': 'So it can kind of move independent from any motion that might happen in that was typical in an earthquake. Certainly our public safety building retrofit addressed many of those things, shoring up that structure and making it much more earthquake resilient.'",
        "'speaker_0': 'Our new passenger concourse at the airport is another example of where we strengthen the facilities and really build them from a place where we're understanding what earthquake motion does to a building and what improvements you can do in a building to help.'",
        "'speaker_0': 'You can never prevent 100%, but you make it much more resilient and much more likely to survive a major event. I really wanted to spend just a moment highlighting our City Hall and our main library. I know this council in the council before this this seated council really weighed heavy on this question about how safe is the'",
        "'speaker_0': 'current city hall. And we know we have some seismic challenges in this building. And so when we took on the the project to build a new civic center and in particular a new city hall, seismic resiliency was one of the key issues that we looked at and that we really put within the entire RFP process.'",
        "'speaker_0': 'And when we we selected and finalized the layout of the building, it's really a matte foundation designed. So both the Port Tower and the City Hall Tower function together. And as far as resiliency, it was imperative that we are able to re-occupy the building in no more than five days of a major event, and that we would'",
        "'speaker_0': 'be operational to the public. No, no more than 30 days from a major event. So that is built in and built into our contract with plenary. The project company in charge of the facility. And if for some reason they aren't able to meet those standards and they need to provide alternate space for us to look at them'",
        "'speaker_0': '. So we take this all very seriously as we design any new project, any new facility, earthquake strengthening and resiliency is important to the project components. And just wanted to convey to not only the council but the community listening this evening that we are making our new facility stronger and any retrofit of an existing facility is done with'",
        "'speaker_0': 'earthquakes in mind. I'll pass it back over to you.'",
        "'speaker_10': 'So I've got the, the last line for presentation as a summary slide. The recent earthquakes really did crack our California cool over the 4th of July weekend. They motivated a lot of residents to get prepared. We saw an uptick in the number of residents who signed up for alert Long Beach.'",
        "'speaker_10': 'We saw an uptick in the number of residents visiting our website, looking for information. And then just anecdotal, just being out at department stores, hardware stores and others. You saw residents there getting fire extinguishers, water, gloves. It's never too late to get prepared.'",
        "'speaker_10': 'City department plans continue to evolve. The newly developed crisis communication plan allows us to quickly and effectively get messages out to our residents. Our first responders work as part of a regional response network to ensure we have resources necessary to manage an incident.'",
        "'speaker_10': 'And we take a ground up approach to disaster preparedness, starting with individual and family preparedness and working our way up through our neighborhoods and the city. We have to accept that we live in an area that is prone to earthquakes and we have to do our part to be prepared for it.'",
        "'speaker_10': 'Being prepared mentally and physically for whatever may come is what it's all about. We need to be ready to help ourselves and then each other. That concludes staff report. Various representatives from various departments are available to answer questions.'",
        "'speaker_0': 'Thank you very much. I want to thank the entire team. I think that was a very extensive and good report and a great update on our emergency disaster preparedness response, particularly to Mr. Harrison and your team. And also, of course, the entire public safety network that we have through public works and planning.'",
        "'speaker_0': 'And so are really, really important for us to always get updates on this. Just a few, a few comments. So I had asked Mr. West to kind of bring this back and to prepare a presentation, because I think it's important to put it out there and continue to put that information out there.'",
        "'speaker_0': 'We had a pretty, I think, you know, serious scare recently with with the quakes. And I think that it certainly got people's attention. It's certainly got my attention. And I was reminded as I had conversations with the chief and Mr. West and others in the minutes following both of the quakes, that that this information is really important'",
        "'speaker_0': 'to review and to practice and to continue to review and to keep going through our our our our our preparedness consistently. A few things I want to note. I do. We made an effort the next day to increase our alert Long Beach sign ups and we doubled them or doubled more than doubled them, which I think is'",
        "'speaker_0': 'really important. I want to encourage residents to please sign up for alert Long Beach, and I want to encourage staff to continue at every possible event to continue to to do that. I want to ask Mr. West also, we need to make a personal appeal to our city employees there, 6500 of them.'",
        "'speaker_0': 'They should all be on alert. Long Beach. And the fact that we have how many folks signed up already to have 10,000 folks signed up, maybe on alert. Long Beach, is that right, Mr. Harrison? On the cell phone.'",
        "'speaker_0': 'Of course, we can we can call, I think, over 150 or 160,000 or whatever the number is. But we need to I would expect that that all of our city employees would be interested in being on that system.'",
        "'speaker_0': 'And so there needs to be an internal effort to do that. And so I would hope we would do that. I'll also just add, I think that our our cert operation teams and the fact that ready Long Beach and those groups are out so consistently in the community I think is really great to see.'",
        "'speaker_0': 'I see them in all the events in the community functions, so I think that obviously should continue. It. We continue to promote those that work. I wanted to just note. I'm not sure. Maybe, Mr. Modica, you could you can answer this.'",
        "'speaker_0': 'You and I talked about this some. So our our resiliency program, I just want to make sure that I know that that that issue has been before the council, before we discussed it. We want to I want to make sure that the timeline I know we still have it may be possible to your timeline to complete that'",
        "'speaker_0': 'work. And I really would like to see that moved up if possible. I know it's a lot of work. I know it's not easy, but I think that that that's just a little bit longer than that I think most of us would like.'",
        "'speaker_0': 'And so maybe you can get back to us on an expedited timeline and what that would look like. But I think we need to cut that, you know, cut that in half, hopefully, and and get something in front of this body as to what the next phase of this is.'",
        "'speaker_0': 'In addition to that, I will say that I want to commend the city, because we the first thing that we have done is kind of taking care of our own buildings and facilities. And so the fact that in two weeks we are moving out, we're moving out all of the employees in this building, which is a structurally'",
        "'speaker_0': 'unsound facility into a facility that is to the latest standards on earthquake preparedness, I think is really important. And I'm glad that we're making repairs across the city on so many public buildings to to continue that work. But I do I do think that whether it's, you know, the Los Angeles program or or the Santa monica program'",
        "'speaker_0': ', there are other programs that are out there. And I just want to I want to make sure that we adopt a program. I think it's that's that is important. And I know that funding is always a concern on the on the private side for for for property owners.'",
        "'speaker_0': 'And we certainly don't ever want to overburden property owners. We also don't want to. We also want to make sure we do everything we can to to ensure safety and the continuation of of of every person and life.'",
        "'speaker_0': 'And so don't want to repeat the disasters that we've had in the past as well. And so the last thing I'll say is I have been so impressed with our emergency response when we've had these incidents that have not in most cases been major.'",
        "'speaker_0': 'But what what happens in the way the PD and the fire department and public works and everyone kind of rolls out these plans is really impressive. Has been impressive for me to see as mayor and and to follow.'",
        "'speaker_0': 'And so I just want to commend the team. And and I think we just got to redouble our efforts and really focus on this. I know that, you know, interest in this sometimes wanes from from from from time to time because there may not be the emergency in front of us, but we just got to be vigilant'",
        "'speaker_0': 'constantly on this issue. And so I want to thank the staff. I'm sure Mr. Murdoch could want to add anything to that, but I think you guys are pretty on top of it.'",
        "'speaker_5': 'And there's a good comments and we agree on the study. So, yes, it does take some time to do an inventory of everything as we go back out and relook at the scope of work would be happy to look at what we can do in different chunks and we also want to really focus on that.'",
        "'speaker_5': 'How do we get those economic solutions? Because that's something that we heard last time that we didn't quite have worked out.'",
        "'speaker_0': 'And maybe and maybe maybe it's done in those chunks. Right. And so we can get to some of the, the, the the lower hanging fruit and quicker.'",
        "'speaker_5': 'We'd be happy to look at phasing that so that we can do something a little bit different.'",
        "'speaker_0': 'Thank you, Councilmember Erika.'",
        "'speaker_1': 'Thank you, Mary. And I certainly have to agree with the last point you made in regards to the response of police and fire and this last event that we had, the updates that were given to us in regards to their checkpoints and to going to public facilities, ensuring that they were secure and no damage had been caused'",
        "'speaker_1': 'by the quake that that happened at Ridgecrest. One of the most important things about this report here, and I really want to commend staff for putting this together. It's very thorough. It covered practically all points that you would want to hear, including that as you were going through the report.'",
        "'speaker_1': 'I think we should probably get a little historical perspective on Long Beach and where we were back in 1933 to the present. And you did that. And I think that was important because it's always is that, you know, would you learn from from from your moment in history?'",
        "'speaker_1': 'One of the points that I see here also, although we may be encouraging, of course, our residents to send up to emergency to the emergency alert system. I think it's important that we have this kind of report yearly, maybe even twice a year, because of the you never know what a disaster is going to hit.'",
        "'speaker_1': 'And just being at the forefront of our minds is always important. So, I mean, I hope that we can maybe not as extensively, maybe once every two years, but I think every year we should have some kind of preparedness report such as this.'",
        "'speaker_1': 'I know we do it at our events that we're going to be having that the Cal State, Long Beach. But, you know, not everyone attends that and not everybody is is aware of what we might have available for them.'",
        "'speaker_1': 'So I think that having this kind of report to seek answers is important. But more importantly than that, I think we need to engage our media in regards to getting them to also post some of these recommendations for public safety.'",
        "'speaker_1': 'Also getting the alert system published through a PSA or event or through other kinds of media that we could use for them to alert the residents that there is this system available for them where they can get this kind of information.'",
        "'speaker_1': 'And, of course, the the extended resources that we have with Facebook and everything else that we use. I think as we move into our into the technical era that we are in using all these different mediums and platforms to expand the information, to make people more aware of the issues that are out there in terms of public'",
        "'speaker_1': 'safety and disasters, both natural and manmade, that we keep them aware and abreast of what's going on in our in our system. So, again, I want to just commend staff for a very thorough report. And I know when you look at police affairs, they're always conducting exercises and sometimes they seem redundant and they seem like boring.'",
        "'speaker_1': 'But that's how we get to do the bit. That's how we get to be the best we are. It's practice and it's practice all the time. And while it may be look routine, you never know when that practice is going to become a reality.'",
        "'speaker_1': 'So thank again. Yes.'",
        "'speaker_0': 'Thank you very much, Councilmember Pierce.'",
        "'speaker_4': 'I yes, I want to thank you, Mayor, for agenda raising this so quickly. It was definitely something that we had talked about a ton in my district. Doctor, disaster preparedness has been a key issue for the second district.'",
        "'speaker_4': 'We have the coastline, we have our downtown. We have many senior homes, high rise buildings in our district. So I want to thank you guys for this. We're constantly having this conversation. And right after the quake, we had our third roundtable of senior residents that were meeting about how we can improve their lives.'",
        "'speaker_4': 'And one of the biggest issues that they all hooked on to was the fact that most of them lived in a high rise building and none of them had been through a drill in their building. And so I know I quickly grabbed your ear a minute ago, but could you walk through for us, are there requirements for'",
        "'speaker_4': 'residential, high rise buildings to have any kind of drills?'",
        "'speaker_6': 'No. There are currently no city regulations nor state regulations that we're aware of that would make that a requirement on building owners.'",
        "'speaker_4': 'So that is something that, you know, I know it's not in your report. I think it's your report. Fantastic. I really echo the comments about trying to get a quick timeline to have an assessment of those buildings. But in the meantime, we know that what they said with this last quake is it could be five years of'",
        "'speaker_4': 'having, you know, the ripple effect from that. And so what are we doing to make sure that our residents, not only at our neighborhood meetings, because there's a population that's engaged and there's a population that works two and three jobs or they're elderly and they don't get out of their building.'",
        "'speaker_4': 'And so I have a real concern that, you know, say that the next big one is here, that we have a lot of people that maybe they went out and bought their kit, but they've never done it. I mean, how many people sat there during the quake and just looked at everybody and didn't get under a table'",
        "'speaker_4': 'and didn't do the things that we know we're supposed to do? And so I, I will come back, and I hope that we can work together on trying to explore what options we have, particularly for our downtown, where we have senior high rise buildings and older buildings.'",
        "'speaker_4': 'And what we are doing to really whether it's annually, whether it's whenever new people move into a condo, what can we do as a city to really make sure that we're engaging with our constituents and that they're practicing their plan?'",
        "'speaker_4': 'Because I think if we really understood how many people have gone through a drill, know where the exits are, we would be pretty disappointed just because our lives are so busy from the from just a quick search at the Internet, looking at all the studies.'",
        "'speaker_4': 'Residential high rises are the least prepared. And so whatever we can do to make sure that we address that would be fantastic. I had another question on the right of your neighborhood, which, mind you, is all our downtown picture.'",
        "'speaker_4': 'So just making sure. What does it take for a community to get one of these presentations? How long does that take? How long does it take to set one up?'",
        "'speaker_10': 'I'm glad you ask that question, Councilmember. We have staff that has been trained and and are going through a training process to be able to conduct these meetings. The meetings actually take place in the neighborhood. Lead resident will invite their neighbors over to their house, living room, garage, lawn, wherever that might be.'",
        "'speaker_10': 'And the discussion would take place that I described in regards to identifying the resources and the rest and who's going to do.'",
        "'speaker_1': 'What.'",
        "'speaker_10': 'After a disaster. So the map here, Long Beach neighborhood is patterned off of a longstanding map, your neighborhood program that's been in existence for a while. We have the city of Long Beach has teamed up with the city of Los Angeles and the county of Los Angeles to roll this program out countywide so a neighborhood can be'",
        "'speaker_10': 'whatever it is. So we can map your high rise. Right. We can map your apartment building. So certainly the people, residents in your district that we have a tool available for them. I would also just and with your prior questions, encourage residents to also participate in the Great California shakeout.'",
        "'speaker_10': 'And maybe that's something that we can promote more so that we can get to residents, so that they do practice that drill on a on an annual basis with which we can set up a competition among the districts and see how many people can sign up for it.'",
        "'speaker_10': 'You've done Facebook stuff with us in the past, and we're certainly willing to do those. And again.'",
        "'speaker_4': 'Yeah, that's great. Yeah, we've definitely we try to. My goal is to do a disaster preparedness video every quarter. But again, we get so busy that we let the disaster just kind of sit in the background. So I like those ideas.'",
        "'speaker_4': 'I would want to make sure that we have benchmarks that we're meeting. And so for me, I mean, my number one goal is as soon as you guys are ready that every one of my neighborhood associations and my business improvement district, I have 16 different groups that identify themselves that way in my district would get that done'",
        "'speaker_4': 'as soon as possible. So my team is always here to help. But whatever we can also do to reach those buildings that are hard to get into, that have ways that don't. I mean, most of these senior buildings, we had a large conversation about it because they have a management company that's in there providing them those services'",
        "'speaker_4': '. Even when we've had the city go in, they haven't allowed us to do presentations and things like that. So for some of those troubled buildings, we need to figure out how we make that a requirement, particularly, I think, for our senior building.'",
        "'speaker_4': 'That so many of those people in those communities are most vulnerable and might have disabilities or mental health challenges and are just our most vulnerable. So whatever we can do to to have that discussion in the future, I welcome that.'",
        "'speaker_4': 'So thank you, guys. Again, this was a thorough presentation. Look forward to keeping disaster preparedness as a priority.'",
        "'speaker_0': 'Thank you, Councilman Austin. Thank you, Councilmember Supernova.'",
        "'speaker_1': 'Thank you. This is going to be very specific, probably not the best venue for it, but I didn't think about it until this item came up tonight. But I it brought back my memories. So the night of the earthquake, I think the alert went out at 10:41 p.m. that police and fire personnel were going to be assessing'",
        "'speaker_1': 'damage in the city. And I'm one just philosophically, I want more information, not less. That's my idea. But I question that when at I think it was. 12:36 a.m. an alert went out with the same intensity of any emergency that public safety officials have completed.'",
        "'speaker_1': 'The infrastructure checks, no reported damages have been received and in the city of Long Beach, unless new information becomes available. This will be the last update. So that's essentially an all clear update, but it comes in the wee hours of the morning with that same kind of intensity.'",
        "'speaker_1': 'So I don't know if I assume protocols are established about how these things go up, but that's that's some input I'd be willing to meet on a committee or whatever, like how will we want to lay this out?'",
        "'speaker_1': 'And for an all clear message, I'd be willing to wait till the morning. I think Mayor Garcia sent out a comforting message about 9:30 a.m. That was that was a good timing. Thank you.'",
        "'speaker_0': 'Make it, councilmember. Councilman Mongo.'",
        "'speaker_8': 'Thank you. I enjoyed the presentation. I appreciate the increase in uptick in the enrollment. I was at concert in the park at the time with approximately five other 5000 other residents, and I thought that it was a great opportunity to talk with neighbors about being prepared.'",
        "'speaker_8': 'I think one of the things that we often forget until we have a power outage or any of those things, is that you need to be able to provide food and water and save yourself for many days. And I think that your group is doing a great job, especially our CERT teams, in getting out and communicating that'",
        "'speaker_8': 'to the community, in going into the details of the presentation and talking about bringing back some guidelines to help get the city infrastructure, the infrastructure within the city at a high level of preparedness in case of an emergency.'",
        "'speaker_8': 'I had read some things that I'm not clear on, but maybe you could help that. Many of the roofs in the region are all flat, so helicopters could land on them for rescues. But that in actuality, I'm internationally when these incidents occur, they don't actually use those helicopter pads for those things at all.'",
        "'speaker_8': 'And some cities, including Los Angeles, have actually changed the requirements and allowed for variances. And so. We might want to look at making those adjustments at this time if we have policies in place that are based on misinformation, I'll give an example.'",
        "'speaker_8': 'We don't stand in doorways anymore when there's an earthquake. That's not the protocol. And yet there are still people and teachers out there who haven't gotten the new updates to know that now you want to be underneath the desk or adjacent to a desk so that if something falls, you can be protected.'",
        "'speaker_8': 'So for that, I would also say that if there are any other earthquake guidelines in the city, that we could look at them and see if there are any that aren't fact based that we could erase them from from the.'",
        "'speaker_8': 'The ordinance or codes or whatever, so that the city can again, if safe, resume our economy and resume and increase our iconic skyline. Thank you.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_3': 'Yes, thank you, Mayor. Mrs. Tatum, Mr. Beck and Mr. Harris, after the report in which I just heard, I think all of us can go home and sleep very. Safely tonight because that was a fantastic report and more information.'",
        "'speaker_3': 'I know A people hear that and they adhere to that. I know they will be able to get to any other quick that we have. Thank you, individuals, for giving us that fantastic report. Thank you again.'",
        "'speaker_0': 'Thank you. Just a quick note, just on behalf of the planning staff, I was talking to Councilman Mongo. I know that we a few years ago changed our our codes at the city and to align with some of what other downtowns are doing.'",
        "'speaker_0': 'These are relate to construction of roofs and giving the ability for for design that are not just, you know, flat helicopter pads. And so that's been changed. And that is why you are now seeing building designs with pointy roofs and spires and other things that are coming to the downtown.'",
        "'speaker_0': 'It was a big pet peeve. Councilwoman, go.'",
        "'speaker_8': 'That's great to hear. Maybe, perhaps we can also allow the places you already have, the flat roofs with helicopter pads defensively, put outdoor furniture and start utilizing that space more effectively. Because as I look out the windows of the new city hall next week or two weeks from now, and as I look at any other tall building'",
        "'speaker_8': 'in the city, there's a bunch of numbers on the tops of buildings with no furniture and no enjoyment. And I know there's a limited amount of downtown outdoor space. Let's start giving them the ability to use that space effectively.'",
        "'speaker_0': 'Thank you. Is there any public comment on the side of city seeing none or is that public comment? Please come forward.'",
        "'speaker_10': 'No. They had to do a lot of work up there.'",
        "'speaker_8': 'That's right. It could happen, but only after.'",
        "'speaker_12': 'Good evening. Tiffany Davie, resident of the fourth District. I want to thank you all for a very comprehensive report. I was looking forward to this. I actually started training with the California Specialized Training Institute the beginning of this year and with L.A. City EMT.'",
        "'speaker_12': 'So when we had this opportunity during this emergency to kind of see the language system in place, I received reports of 1041. I know. Was a little bit late, but the all clear going through felt like any time for that news was great.'",
        "'speaker_12': 'I look forward to the community partnership meeting that I believe was scheduled for the 18th and just in case, I didn't see that in the report, but it's now the 25th. Okay. And that's from 1 to 3 p.m..'",
        "'speaker_12': 'Okay. As well as perhaps more engagement for Stop the Bleed trainings. And there's also a mass. Mass casualty exercises in August. I learned of that at the Met Court kickoff of the year. So I just wanted to know if that could be updated on the website as well and just look forward to being able to find the'",
        "'speaker_12': 'crisis communications plan as well as an updated hazard mitigation plan that reflects the new development that's taking place over the past five years. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Dave Shukla, Sun File, thank you very much for the presentation. So very informative. A couple of brief comments. First, an inventory of seismically vulnerable buildings in Long Beach is crucial, even if that doesn't move on state or county levels.'",
        "'speaker_1': 'It's important to know what here could potentially be affected. Bridge collapse. Also in disaster scenario planning is very instructive for traffic flow, but it's not the only impact. In my neighborhood, we're right by the Newport-Inglewood fault line and there's a lot of critical infrastructure that could severely limit ingress and egress out of the county.'",
        "'speaker_1': 'And it's important to kind of think through and these are exercises, you know, just look at a map. Cross some lines of what would we do? They're pretty easy to think through, but harder to actually implement in the way of practice.'",
        "'speaker_1': 'Councilwoman Pierce's point about requiring multifamily property owners to drill for seismic or other disasters is pretty intriguing. I would like to see a way that that that could actually be made amended, but not just for. For Senior living, but also for a lot of the high rises we have downtown and some of the workplaces as well that'",
        "'speaker_1': 'are in some of these taller buildings. Lastly, a ground up approach or actually not. Lastly, sorry, one other point that a councilmember your group made was that we need to kind of wideband all the technologies that we get information out.'",
        "'speaker_1': 'One that we didn't hear that much about, especially older folks, still turn to handy dandy AM FM radio and being able to get information out across a variety of platforms is important. It's also important to recognize that. What your neighbors tell you is more likely than not going to be what sticks in your head.'",
        "'speaker_1': 'And so that brings me to the last point, which is the grownup approach is to be commended. And that's why it's absolutely crucial that we continue to support our program. Thank you.'",
        "'speaker_0': 'Thank you. Our last speaker.'",
        "'speaker_1': 'Hello. Good evening. My name is Johnny Wallace. I'm a resident of the seventh District and I am actually a graduate of the CERT program with Long Beach Cert. And although I was not here for the first earthquake and I got a lot of, you know, a lot of people asking me if I was I was actually studying'",
        "'speaker_1': 'abroad when the first earthquake happened and I was talking with someone and they were like, oh, I'm glad you are here, because, you know, it could have been bad with that. And I was really like, I want it to be here, you know, to help if, you know, if I mean, luckily there wasn't any structural damage or'",
        "'speaker_1': 'anything like that that was too major. Um, but I would have liked to be here to help. Um, after I. Completed the CERT program. I actually went back to my neighborhood. It's actually right next to the Goldstar Manor.'",
        "'speaker_1': 'It's for veterans and a lot of elderly people live there as well as in my my neighborhood as well. But I actually went back to my neighborhood and did a presentation with the help of firemen from. You know that helped that help with the cert program by the name of JC Heflin.'",
        "'speaker_1': 'And they came by and gave them some first aid kits. But after the presentation, I, you know, gave my residents, the residents of my neighborhood survival kits. And that's all great. But I wanted to know, are there any plans on setting up neighborhood preparedness officers and are there any plans to establish new leadership roles within the communities'",
        "'speaker_1': ', people that actually know the community outside of cert? Are there any opportunities to learn how to do better presentations and inform the community? Um, you know, all throughout Long Beach, I wanted to just know how to. You know, touch up on that because I was actually kind of in that California cool.'",
        "'speaker_1': 'You know, even though I wasn't here, I was still in that California cool because nothing had happened for some time. But as we know, you know, seismologists are predicting that artists are anticipating a greater threat from earthquakes in the coming years.'",
        "'speaker_1': 'So, you know, we're definitely trying to get ready, going to get ready for that. But, yeah, I want to keep my keep my neighborhood alert before a disaster like this. And. Yeah, thank you.'",
        "'speaker_0': 'First of all, thank you for doing it for us and for your interest. I think it's great to have folks that are out there volunteering and doing that work. So I just want to thank you also. I I'll make sure that we get get back to you in, Councilman.'",
        "'speaker_0': 'I think if you're not connected already, maybe someone from your team can go over there or someone from staff so that we can connect. These are some good ideas and some areas we're going to kind of close the loop on, I think, with certain fire and some other folks.'",
        "'speaker_0': 'And so maybe we'll do that. Councilman, we will connect with you in just in just a minute.'",
        "'speaker_1': 'Yeah. I want to thank you for stepping up also with a third program. One of the things that we're trying to emphasize more nowadays is that, you know, although neighborhood watch programs have gone away, that would have been a good resource for people to get information about such things.'",
        "'speaker_1': 'We are now encouraging more and more to our police department, community watch, neighborhood watch programs where you could get your neighbors, get updates on what's going around in your neighborhood in terms of public safety. But it's also a good avenue to talk about earthquake preparedness or disaster preparedness as a whole.'",
        "'speaker_1': 'So let me get your information and I will get back to you in them. And we have in the West Long Beach area, we had the West Long Beach Association. I would recommend that you attend one of those meetings.'",
        "'speaker_1': 'Our police officer and our neighborhood watch and our community watch person is always there to talk about what's going on in the neighborhood, in the area and give updates. So that would be I would strongly encourage you do that as well and we'll give you those dates when the West Palm Beach Association meets.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes we're going to take a roll call vote. Councilman Pierce. I'm sorry, district two. District three for.'",
        "'speaker_11': 'I.'",
        "'speaker_1': 'Okay. That's three, four.'"
    ],
    "Recommendation to receive and file the Drake Chavez Vision Plan;    Adopt resolution authorizing City Manager, or designee, to submit a grant application to the California Department of Parks and Recreation for the first phase of the Drake Chavez Vision Plan Implementation Project; accept said grant, if awarded, in an amount of $8,500,000 in Statewide Park Development and Community Revitalization Program funding; execute all documents necessary to accept the funds for the implementation of the Drake Chavez Vision Plan; and  Accept Statutory Exemption SE-19-191.  (District 1)": [
        "'speaker_0': 'Five, six, seven, I eight and nine. Okay. That motion carries for the seat in front of the report. Thank you very much. We're going to item 36 now.'",
        "'speaker_2': 'Report from Parks, Recreation and Marine and Public Works recommendation received and filed the Drake Chavez Vision Plan Adopt resolutions to submit a grant application to the California Department of Parks and Recreation for the first phase of the Drake Chavez Vision Plan Implementation Project.'",
        "'speaker_2': 'Accept, said Grant if awarded in an amount of eight 8,500,000 District one.'",
        "'speaker_0': 'So why don't we let me just have staff maybe kind of briefly go through this. I know I've had a chance to review it already, but if I can just make it brief, please.'",
        "'speaker_1': 'Gerardo and.'",
        "'speaker_0': 'Meredith.'",
        "'speaker_1': 'Yes. We're excited about this opportunity to pass it on to the Meredith friends.'",
        "'speaker_4': 'Good evening, Mayor. Members. City Council. This item is to receive and file the Drake Chavez vision plan along with authorization to submit a grant for Prop 68 State Park Bond. If you recall, in 2010, the Drake Chavez masterplan was completed.'",
        "'speaker_4': 'That was followed by a series of community stakeholder discussions, which was really focused on amassing properties for park purposes that would connect Cesar Chavez Park to Drake Park through the development of wetlands and passive and active open space.'",
        "'speaker_4': 'There was a big effort by the city over the coming years to purchase just over 15 acres of property in the Drake Chavez neighborhood through grants and local funding. This master plan has been in existence for quite some time, but since that those purchases have been made, many new projects have begun to impact the future park parcels'",
        "'speaker_4': ', including projects like the Long Beach Must the 710 realignment proposed by the California Department of Transportation and the Schumaker Bridge Replacement Project and the Drake Chavez Vision Plan worked to incorporate all of these new projects in addition to new feedback from the community and this vision plan updates that original plan.'",
        "'speaker_4': 'This is a guide, kind of a visionary document that guides future improvement at these acquired and undeveloped park parcels, as well as the future improvements to Drake Park and Cesar Chavez Parks to address the needs of the community.'",
        "'speaker_4': 'So our effort included all of those different things, which is included in your packet as the ultimate vision plan. But there's a one particular parcel we focused on very specifically for the 8.5 million grant dollars, which is the parcel at 970 West Chester, which currently is the home to the MTA bus lot, that was one of the'",
        "'speaker_4': 'parcels that was previously bought in anticipation of connection of those parcels to those parks. Through this community process, it was inclusive and multilingual. Our Parks Department partnered with the first Council district, the Wilmore Heritage Neighborhood Association, Communities with Power to Change the nonprofit.'",
        "'speaker_4': 'Katie, who Paola is here as a representative, and we'll speak with you here momentarily, as well as public health advocates, where we conducted this community engagement for the Vision Plan over a series of nine public workshops, the community developed multiple project priorities, three community sourced vision concepts, and ultimately voted on their priorities for the final vision plan'",
        "'speaker_4': '. Four That parcel of the MTA lot. The first opportunity for funding for this comes through Prop 68, the State Park Fund, which the grant is due here shortly. And that is what we've been working toward for the vision plan and for this particular property for the first phase of that development.'",
        "'speaker_4': 'This particular grant is really focused on open, active, outdoor space. So in the plan for this property, in your packet you will see an open grass area, playgrounds, walking, jogging trail, picnic areas, shade structures, outdoor fitness equipment and a variety of sports amenities.'",
        "'speaker_4': 'Park completion of this grant application. Should we be successful? Those would be the first steps to move forward with our community through a follow up community process. With that, that concludes staff's report. And we're here available for any questions.'",
        "'speaker_0': 'Thank you. Let me just make some comments. I've been working on the Drake Park Master Plan since I was on the city council or before that, a community community activist. And this is I know this plant obviously very well and I'm very, very excited about us moving forward.'",
        "'speaker_0': 'A couple of things. I'll just I just want to add, you know, one, I think when we first started this many years ago, it was really important for us to get the active pieces done. And we obviously working with Councilman Gonzales, just getting the soccer field, the the initial soccer field done, the walking the walking paths.'",
        "'speaker_0': 'We work with Wilmore also to do some landscaping work throughout the area and make some connections, particularly with some of the D.G. we put out there. And there's been so much improvement from where it is today, from where it was ten years ago when a lot of the work initially started, but really glad that we're moving forward'",
        "'speaker_0': 'on this grant. And in addition to the grant, I know that the port at the port already worked with with our office in being very supportive of our efforts at the Colorado Lagoon. We worked with Councilwoman Price and staff to ensure a substantial investment in the Colorado Lagoon, and that is something we've been working on for a'",
        "'speaker_0': 'few years and I've already had some preliminary discussions and with the port as well. And so the next what I expect will be important investment from the port will be my request to the to the Drake Chavez vision masterplan for the connection of Cesar Chavez to the rest of of Drake Park.'",
        "'speaker_0': 'And so I look forward to championing and getting this project done for the community. It connects with our vision for the L.A. River, and it connects with plans and communities and working on for a very long time, at least at least close to a decade since I remember our parks team being there every step of the way'",
        "'speaker_0': '. And so with that comes of Pierce.'",
        "'speaker_4': 'Yes, I. The second park I spend the most time at is actually Drake Park. So while it's not in my district, it's one that's near and dear to my heart. My daughter first went down a slide for the very first time.'",
        "'speaker_4': 'So congratulations again to a community that's done this work. Congratulations, everybody. It's been building on this for so long. I look forward to the next steps.'",
        "'speaker_0': 'Thank you accounts from Councilmember Richardson. As for public comment, please come forward.'",
        "'speaker_1': 'Hello. My name is and I can feel District six. I think this is a, you know, a great, greatly needed an improvement in the neighborhood. I grew up going to the part jam that happens at Drake Park. I know that for.'",
        "'speaker_1': 'Statewide when Mr. De Leon, when he brought this in to the Senate, you know, Greenspaces are very much a needed necessity in areas that don't have it, such as this part of the First District. But it's also important to note that we don't just build these green mausoleums.'",
        "'speaker_1': 'That's what I like to call the parks in Long Beach. A lot of them are just green mausoleums, meaning that they're just edifices that are celebrating space. But we don't necessarily provide budgeting or funding towards programing, cultural events, and in particular parkson's in in the city.'",
        "'speaker_1': 'So maybe if Parks and Recreation, in addition to taking over that lot, that empty lot, which is which is nice, it's bad to look at. We can also provide some funding for programing in this area that isn't just like the municipal used using that space or I know I appreciate the the center there that's named after Mr.'",
        "'speaker_1': 'Peyser. But, you know, it would be great if we, you know, have programing such as like, you know, there's a lot of graffiti artists in that area. You know, we can utilize them. You know, it could team up with L.A. Metro instead of having people on the trains.'",
        "'speaker_1': 'Maybe they can around the parking lots there, they could be able to do some of the work that they do in the same places like at MacArthur Park. You know, there's a lot of graffiti artists that use Homeland and teach art and painting to the children and neighborhood.'",
        "'speaker_1': 'You know, it's great to have children use these spaces, you know, beyond just having these spaces and beyond just having wetlands. It's great to have children outside in the spaces all year long, not just when it's the summer.'",
        "'speaker_1': 'So great that we're expanding the park and I'm glad the wetlands are being developed. But also I'd like to see more emphasis by Parks and Rec towards providing funding in these parks so that we can have children and adults and everyone outside, you know, whether it's movies in the, you know, movies in the park, a variety of'",
        "'speaker_1': 'ways to utilize it. Thank you so much.'",
        "'speaker_0': 'Thank you so much. Next week, please.'",
        "'speaker_4': 'Hi, my name is Mariella Salgado and I'm from the First District. I also serve as a Parks and Rec commissioner and I wanted to say something.'",
        "'speaker_8': 'That I remember at one of the meetings. I think Meredith might find it humorous, too. Kathleen Irvine, who is the president of the Walmart Neighborhood Association, said, I just want this project to be done before I die. And it really kind of brought to light to me how long people have been working on it.'",
        "'speaker_8': 'So I appreciate Mayor Robert Garcia mentioning in that because it's been a long collective effort. Um, I wanted to speak.'",
        "'speaker_2': 'A little bit about.'",
        "'speaker_4': 'In addition to kind of piggy bank a what this gentleman said is.'",
        "'speaker_2': 'We know the importance of early education, parks, programing, arts and music and it's proven effect reduce negative health impacts, crime and ability to stimulate growth. Children most in need of arts and music instruction have been the least likely to have access to it.'",
        "'speaker_2': 'Less fortunate children have been receiving what I'd call the emergency room approach to education, one that addresses.'",
        "'speaker_4': 'Sorry I lost my place. One that addresses on the parts of a child thought to be the.'",
        "'speaker_2': 'Most dire need of attention and subject to state exams.'",
        "'speaker_8': 'Math, reading and writing.'",
        "'speaker_2': 'I've seen it as a school, say council member at Edison Elementary, the fourth lowest performing.'",
        "'speaker_4': 'School.'",
        "'speaker_2': 'In the school district. I've seen it in early education as part of the Long Beach Early Childhood Education Committee. Those in low income communities have less access to high quality childcare in great public spaces, including green space. And I've seen it as a Parks and Rec commissioner where we have the least green.'",
        "'speaker_8': 'Greenspace per 1000 residents.'",
        "'speaker_6': 'So I really look forward to this project and like I strongly believe.'",
        "'speaker_2': 'That equity is the way forward.'",
        "'speaker_8': 'And I really hope that.'",
        "'speaker_6': 'This project.'",
        "'speaker_4': 'And we get.'",
        "'speaker_2': 'Awarded and moves forward and continues to.'",
        "'speaker_6': 'Add greenspace for our.'",
        "'speaker_8': 'Kids and yes, programing. Thanks so much.'",
        "'speaker_1': 'Thank you. Thanks, Speaker, please. Good evening, Mr. Mayor and council members. My name is Patrick Goddard and I'm a resident of the fifth District. I support the vision plan for the Drake Chavez redevelopment and the authorization to seek grant funding.'",
        "'speaker_1': 'As a skateboarder and parent of a skateboarder, my interest is in the potential for a new skate park within this project. Drake currently has a skate spot that is old and outdated, so a new skate park as one of the new amenities is very welcome.'",
        "'speaker_1': 'Skate parks are some of the most well-used features and parks in Long Beach, while we have nine skate parks currently. Long Beach is a large city with a large amount of users of our skate spots. The more terrain, so to speak, the Better Hawaiian Gardens and Harbor City are examples of nearby cities with newer skate parks are'",
        "'speaker_1': 'very successful. Harbor City's new skate park, in particular, has generated a lot of buzz and has been an instant hit with the skateboard community. I would love to see a well-designed, well built skate park built as part of this project.'",
        "'speaker_1': 'Goes without saying. But the area surrounding Drake and Chavez is well deserving of all new park amenities, not just a skate park. And I look with great excitement to see what unfolds with this development. Thank you.'",
        "'speaker_0': 'Thank you. Next week.'",
        "'speaker_4': 'Hi. Good evening. My name is Paula mendez. I'm here with Concrete Design Initiative, which Meredith mentioned was one of the partners on this project, were new to this long standing community effort that has been going on. But we're very excited about what we've been able to create together in partnership with the Parks Department and with the members'",
        "'speaker_4': 'of the community and the community groups. I'm here to express support for the park and the broader Tree Harvest Vision plan. And I wanted to reiterate from what Meredith said, the strong role that community members played in this process.'",
        "'speaker_4': 'We were able to bring together groups in the community that have traditionally been very active and very vocal, along with groups whose voices have not always been heard. And this has allowed us to create a plan together.'",
        "'speaker_8': 'That will benefit.'",
        "'speaker_4': 'This diverse community, particularly the youth and families. I also wanted to highlight a couple of additional comments that we heard from community members throughout this process that are outside of the scope of the grant at hand, but that I wanted to make sure we captured moving forward as this longstanding process continues.'",
        "'speaker_4': 'First, to echo a previous comment that we heard tonight during public comment, programing would really greatly benefit this area and was strongly desired by community members, particularly to keep youth and teens out of trouble. And I would urge members of this council to encourage and support programing, as well as the participatory processes and community based planning processes'",
        "'speaker_4': 'that have led to the identification of these needs and these ideas. And secondly, particularly as the first Council District is filled, I would also encourage the Council to consider additional measures that could be implemented in this area moving forward to prevent any displacement or potential displacement of residents that could occur as an indirect result of developing this'",
        "'speaker_4': 'new park. During the process, I heard concerns from many community residents around increasing rents in the area, causing people to have to move further away from the neighborhood, severing local ties between residents and, you know, sometimes causing people to move out of the city.'",
        "'speaker_4': 'We heard concerns from the very residents are involved in creating this park that they don't know if they will be able to stay around long enough to benefit from this park that they themselves are shaping for their children.'",
        "'speaker_4': 'Some residents suggested creating a Latino cultural arts district, which could be guided by a local Latino Cultural Arts Council. And I would urge the city council here to consider this or other appropriate solutions to prevent any displacement before it starts.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'You so much. There's emotion in a second. Please cast your votes through roll call, please. District one. I'm sorry. District to District three.'",
        "'speaker_11': 'II.'",
        "'speaker_0': 'District.'",
        "'speaker_1': 'Four, High.'",
        "'speaker_0': 'District five. Hi. District six. District seven I District eight, District nine Motion carries. Thank you. We'll be doing now. We're going to be moving on to item 38, please.'"
    ],
    "Recommendation to receive the results of the ballot tabulation from the City Clerk, the tabulator, for the proposed Mosquito and Vector Control Program (VCP) Benefit Assessment District; and\n\nIf a majority protest does not exist, adopt resolution approving the Engineers Report, confirming diagram and assessment, and ordering the levy of the VCP Benefit Assessment for Fiscal Year 2019-20; or\n\nIf a majority protest does exist, the City Council cannot take action on the resolution.  (Citywide)": [
        "'speaker_0': 'Eight and nine. Motion carries. Keep going back up to. We have three other items. Item 32 Madam Clerk.'",
        "'speaker_2': 'Report from Health and Human Services recommendation to receive the results of the ballot tabulation from the City Clerk for the proposed Mosquito and Vector Control Program Benefit Assessment District. And if a majority protest does not exist, adopt a resolution approving the engineer's report and ordering the levy of the VCP benefit assessment.'",
        "'speaker_2': 'Or if a majority protest does exist, the City Council cannot take action on the resolution citywide.'",
        "'speaker_0': 'Thank you. I'll go ahead. I know that the city staff had asked, wanted to see if the if people wanted to form a better control district, had asked the community if they were interested in it. They are not interested.'",
        "'speaker_0': 'They don't want to form a vector control district. And so we won't be forming one. And that's and that's okay. So I don't know if you want to. Go ahead. Madam Clerk.'",
        "'speaker_2': 'The results of the ballot tabulations show that the total percentage of yes ballots weighted by assessment was 45.76%. The total percentage of no ballots weighted by assessment was 54.24%. There is a majority protest.'",
        "'speaker_0': 'Okay. Thank you. Any public comment on this CNN district to receive and file? District three.'",
        "'speaker_11': 'II.'",
        "'speaker_0': 'District four, District five. I'm sorry. Councilman, do you have a comment?'",
        "'speaker_8': 'I just thought it was important that this does not impact. 90808 which is already covered by L.A. County. But I'm an I.'",
        "'speaker_0': 'Okay. District six. District seven. District eight, district nine. Thank you. Next item is item 34. I'm sorry, 33.'"
    ],
    "Recommendation to authorize City Manager, or designee, to submit a grant application to the Federal Aviation Administration, for the of capital improvements to Taxiway C; accept said grant, if awarded, in an amount up to $25,000,000 in Airport Improvement Program for Fiscal Year 2019 funding; and, execute all documents necessary, including any amendments, to accept and expend the funds.  (District 5)": [
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you, guys. Have it. Next up is 34.'",
        "'speaker_2': 'Report from Long Beach Airport. Recommendation to submit a grant application to the Federal Aviation Administration for for the capital improvement to taxiway C accept said Grant if awarded in an amount up to 25 million District five.'",
        "'speaker_0': 'I know, I know we're anxious here but really briefly staff do you talk about why this is important? Because I thought it was is it's good for the council to make sure.'",
        "'speaker_1': 'Claudia Claudia Lewis, come on down there, our interim airport director. Why is this important?'",
        "'speaker_8': 'While we're waiting for her to come on down. Come on down. What a great job she's been doing as the interim airport director. Accessible, knowledgeable, very professional. Just. I've had so much great respect for you in the short amount of time, how seriously you've taken this and what a fantastic job you've done.'",
        "'speaker_4': 'Thank you. I appreciate that. Honorable mayor and members of the council. This is very important to us. This funding will go towards rehabilitation of Taxiway C, one of our largely used taxiways. We're currently on a two year program for grant funding.'",
        "'speaker_4': 'That's why this amount is fairly large. But with your approval, we can accept this grant money and continue to improve the airport and create the best passenger experience, both airside and landside. Are there any questions?'",
        "'speaker_0': 'Any questions? CNN Councilman Mongo has a comment.'",
        "'speaker_8': 'Maybe I was just commenting on how great of a job she did and I wasn't cleared. So I'll just say it again.'",
        "'speaker_0': 'I think.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'I think there's no public comment. Councilman, actually in motion in a second district, too. I disagree. High District.'",
        "'speaker_1': 'Four.'",
        "'speaker_0': 'High District five six, seven, eight, nine. OC motion carries. 0a9 was an I. I think that is all of the agenda items are correct, Madam Clerk. Yes. Okay. So we're going to go now to the second public comment period, because any items that are not on the agenda.'"
    ]
}