{
    "Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $250, offset by the Fourth Council District one-time District Priority Funds transferred from the Citywide Activities Department to provide a contribution to Partners of Parks for the Ranchos Cars & Coffee Event; and  Decrease appropriations in the General Fund Group in the Citywide Activities Department by $250 to offset a transfer to the City Manager Department.": [
        "'speaker_1': 'Communication from Councilman Super Na recommendation to increase appropriations in the General Fund group in the city manager department by $250 to provide a contribution to partners of Parks for the Rancho Cars and Coffee event. Communication from Councilwoman Allen.'",
        "'speaker_1': 'Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $1,000 to provide a donation to Carlo Creative LLC for Absolute Best of Long Beach Awards 2022 Communication from Councilwoman Allen Recommendation to Increase Appropriations in the General Fund Group in the City Manager Department by $5,000 to provide a donation to the LGBTQ Center'",
        "'speaker_1': 'for Long Beach. And communication from Councilwoman Price in Councilman Austin. I'm sorry, that was it. Just those three items for the fund transfers.'",
        "'speaker_0': 'All right. Thank you. Any public comment here?'",
        "'speaker_1': 'No public comment. Okay.'",
        "'speaker_0': 'Saying nonetheless, cast our vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_0': 'Thank you. We have a presentation. Let's go ahead and queue up our presentation on U.S. Navy Embark program. Councilwoman Allen.'"
    ],
    "Recommendation to adopt resolution in support of the formation of the Lower Los Angeles River Recreation and Park District; direct the City Clerk to file the Resolution with the Local Agency Formation Commission; and, authorize City Manager to approve the final District Boundary Map on behalf of the City.  (Citywide)": [
        "'speaker_0': 'All right. Sign up now. All right. Thank you so much. We're going to move on with the agenda. We're going to take item 20 that was pulled from consent. If you want to recuse yourself at this point.'",
        "'speaker_4': 'Yes, I'm going to recuse myself out of an abundance of caution as I work for RDC. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Item 20 is a report from Parks, Recreation and Marine recommendation to adopt a resolution in support of the formation of the Lower Los Angeles River Recreation and Park District Citywide.'",
        "'speaker_0': 'All right. Is there a second on this motion? Okay. Any public comment here?'",
        "'speaker_1': 'No public comment.'",
        "'speaker_0': 'Let's go ahead and have our vote.'",
        "'speaker_1': 'Councilman. Super not. Motion is carried eight zero.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and adopt the hearing officers recommendation to revoke business license number BU21903666 issued to SOCAL Equity Holdings, LLC, located at 214-216 Atlantic Avenue, Long Beach. (District 1)": [
        "'speaker_0': 'Thank you. I think we're going to go ahead and just take care of our one hearing that we have and then we'll get to the request to move up items. So let's hear hearing 24.'",
        "'speaker_1': 'There are two hearings this evening, 24 and 25.'",
        "'speaker_0': 'I understand one was going to be Paul, correct? Well, we'll get to that when we get to it here in 24.'",
        "'speaker_1': 'Report from Financial Management Recommendations received supporting documentation into the record. Conclude the public hearing and revoke business license issued to SoCal Equity Holdings, LLC. District one There is an oath required for this hearing.'",
        "'speaker_0': 'Thank you. Let's go ahead and conduct our oath.'",
        "'speaker_1': 'Do you and each of you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_0': 'Thank you. Tom, you have the floor.'",
        "'speaker_4': 'Yes, we have Tara Mortenson here. She's the business services manager from Financial Management, and she will be providing a brief staff report. Good evening, Mayor, and members of City Council. The action before.'",
        "'speaker_5': 'You tonight is a recommendation that.'",
        "'speaker_4': 'You adopt the appeal hearing officer's recommendation to revoke the commercial industrial space.'",
        "'speaker_5': 'Rental business license issued to so-called equity holdings located at 214 to 16.'",
        "'speaker_4': 'Atlantic Avenue. This item was originally heard by a different hearing officer.'",
        "'speaker_5': 'On August 18th, 2021.'",
        "'speaker_4': 'The property owner followed the appropriate process to request an appeal.'",
        "'speaker_5': 'Of the decision. A second hearing was held on February 9th, 2022.'",
        "'speaker_4': 'After a thorough examination of the evidence occurred and with additional evidence being.'",
        "'speaker_5': 'Considered, along with testimony from.'",
        "'speaker_4': 'All parties, including city staff and the property owner and staff. The appeal hearing officer came to the same.'",
        "'speaker_5': 'Conclusion as the first with a finding in favor of the revocation of the business license.'",
        "'speaker_4': 'That concludes my staff report. Deputy City Attorney Art Sanchez.'",
        "'speaker_5': 'And I are available for any questions.'",
        "'speaker_0': 'Thank you. We're going to go to public comment. Is there any public comment on this hearing?'",
        "'speaker_1': 'Jorge Larios, please step to the podium.'",
        "'speaker_2': 'Good evening. Members of the City Council. My name is George Larios. I represent and also the owner of SoCal Equity Holdings. And I just wanted to kind of, you know, state that, you know, at that time, you know, when the incident happened, you know, I am a license holder with the state of California, hold a delivery license'",
        "'speaker_2': 'and hold several licenses here in Long Beach. And I felt like things were done unfair. There wasn't really physical evidence found inside the unit. They found my transportation vans with product for delivery, and I had total license in place as I presented out to all the members of the city.'",
        "'speaker_2': 'And I feel like there wasn't even witnesses stating what there were. No pictures are all they found inside was basically equipment and packaging, which I currently have, because I do have operations here in Long Beach. I hold four licenses and I also have 16 in play here in Long Beach and also currently working with social equity applicants'",
        "'speaker_2': 'for provide space on some of my properties. They didn't deny the fact that I was there, but I do hold state license and I see that there is not really a I. First they said that I was conducting illegal business and now it turned into a legal business conducted illegally here in Long Beach.'",
        "'speaker_2': 'I had a witness of mine that's here today. And and he stated that Laurie Moss was basically lying, saying that he said that that I was running illegal delivery when when I wasn't. And there was really no physical evidence found inside other than the scale and some crumbs inside the property.'",
        "'speaker_2': 'There was no physical witness that came and no witnesses became foot in front to state that I was one illegal visitors and nothing activity whatsoever. But the transportation vans that I have, I conduct business here in Long Beach.'",
        "'speaker_2': 'I conduct business in up north and I do frequent deliveries here in Long Beach. And we always have a safe place to pull over when we have to eat. When my drivers have to put gas.'",
        "'speaker_6': 'In, I felt that, you know.'",
        "'speaker_2': 'Them parking in my property, why they why they get some lunch, use the restroom so they can make their way up to the city of Davis of North is more safer than parking the street and, you know, us getting robbed.'",
        "'speaker_2': 'So that's all I got to say. Thank you.'",
        "'speaker_0': 'Thank you. Any additional public comment?'",
        "'speaker_1': 'That concludes public comment.'",
        "'speaker_0': 'We'll take it back behind the rails there. A second on this motion. Okay. It's been moved and seconded. Councilman's and house. We'd like to speak to your motion.'",
        "'speaker_5': 'I guess first I'd like to ask, um, city staff if you can probably share a little bit with us some of the findings and evidence that you might have. Or the process that you went through.'",
        "'speaker_3': 'So, Councilwoman Zendejas.'",
        "'speaker_2': 'I'm the one that actually handled the hearings, both for the initial hearing to revoke the license and then the appeal that was filed on behalf of the business license holder and conducted that hearing as well. What was discovered was.'",
        "'speaker_3': 'A a business.'",
        "'speaker_2': 'Location where there was a lot of activity happening outside of the.'",
        "'speaker_3': 'Rear of the.'",
        "'speaker_2': 'Location, which was to 14 to 16 Atlantic Avenue. Business license investigators were received a complaint regarding that activity. An investigation.'",
        "'speaker_3': 'Was conducted.'",
        "'speaker_2': 'And an inspection was scheduled and this was back in December of 2020. And when inspectors arrived, they couldn't enter the premises. They contacted the property owner to gain access. There was a series of delays.'",
        "'speaker_0': 'But when they eventually entered the premises, they discovered.'",
        "'speaker_2': 'Well, when they had to come back to the premises that same day.'",
        "'speaker_3': 'They discovered.'",
        "'speaker_2': 'People emptying out.'",
        "'speaker_3': 'Boxes of cannabis product out of the out of the.'",
        "'speaker_2': 'Address and and loaded into vans that were parked in an adjacent parking lot. And there was information that was obtained from one.'",
        "'speaker_3': 'Of the workers that was unloading the product out of the address to the loading.'",
        "'speaker_2': 'Van, saying that they.'",
        "'speaker_3': 'Were instructed to empty out the location of all the marijuana product. And so there was also information relating to a.'",
        "'speaker_2': 'Discussion between Mr. Larios.'",
        "'speaker_3': 'Who you heard public comment from and that business license inspector Lauri Vos regarding entry into the premise, but also the a comment.'",
        "'speaker_0': 'Regarding what.'",
        "'speaker_3': 'The inspectors.'",
        "'speaker_2': 'Found when they came back and Mr. Laurel's and for Ms. Voss which she testified to during the hearing that.'",
        "'speaker_3': 'That he had to make money somehow and that, you know, he had other open applications, which he does have a number of open applications.'",
        "'speaker_2': 'At the time.'",
        "'speaker_3': 'With the city. And so he had to make money somehow.'",
        "'speaker_2': 'And so that's, you know, basically what he was doing. Then he admitted that to his Voss. There was also additional information that came out during the hearing that indicated that illegal or unlawful packaging of marijuana product was occurring at that apartment location.'",
        "'speaker_2': 'So that's generally, you know, a brief synopsis of what came out during the hearings.'",
        "'speaker_5': 'I think you can. Can someone also explain the difference between a local cannabis license and a state can minibus license and what proceeds may be city attorney or.'",
        "'speaker_0': 'So the.'",
        "'speaker_2': 'State, the state canvas, and so SOCO Equity Holdings.'",
        "'speaker_3': 'LLC.'",
        "'speaker_2': 'And its principals. Mr. Larios.'",
        "'speaker_3': 'I think.'",
        "'speaker_2': 'One of the entities and Mr. Larios is a.'",
        "'speaker_0': 'Principal.'",
        "'speaker_3': 'Of, does have a delivery.'",
        "'speaker_0': 'Cannabis delivery license.'",
        "'speaker_2': 'That cannabis with the.'",
        "'speaker_3': 'State that cannabis delivery license is.'",
        "'speaker_2': 'Based in Davis, California, which is up in Northern California.'",
        "'speaker_3': 'And that is the license that.'",
        "'speaker_0': 'He's describing to.'",
        "'speaker_2': 'Counsel today that he had when all this occurred. And the city's position is well. So let me step back to answer counsel on this question, and that is.'",
        "'speaker_3': 'A state delivery license is allowed to deliver.'",
        "'speaker_2': 'Anywhere within the state. So that would include a local jurisdiction here in the city of Long Beach. The city of Long Beach has not.'",
        "'speaker_0': 'Has not.'",
        "'speaker_3': 'Allowed delivery services to occur other.'",
        "'speaker_0': 'Than.'",
        "'speaker_2': 'From retail dispensaries. And so we are in the process.'",
        "'speaker_3': 'Or the Office.'",
        "'speaker_2': 'Of Cannabis Oversight is in the process of amending that in relation.'",
        "'speaker_3': 'To the social equity.'",
        "'speaker_2': 'Ordinance that is going to come before council, I think, next month. And then at some point that.'",
        "'speaker_3': 'Delivery is going to be opened up to all.'",
        "'speaker_0': 'Delivery.'",
        "'speaker_3': 'Or all delivery or.'",
        "'speaker_2': 'All cannabis businesses separate and apart from social equity. So that but because Long Beach doesn't have a local ordinance allowing for delivery.'",
        "'speaker_3': 'There is.'",
        "'speaker_0': 'A, I guess, a little bit of a gray area.'",
        "'speaker_2': 'And that in that situation.'",
        "'speaker_3': 'However, if you are going to use a. A property.'",
        "'speaker_2': 'Location to assist in conducting a business, you do have to have a license.'",
        "'speaker_3': 'With the city to do that.'",
        "'speaker_2': 'If I could add to that real quickly, Councilwoman, the the hearing officer.'",
        "'speaker_3': 'Of both the original hearing and at the appeal hearing upheld the evidence and found that at all times there was no adult cannabis related business license in place for the property to satisfy the requirements of Long Beach Municipal Code.'",
        "'speaker_2': 'Chapter 5.92. 210a And that he was this business was in violation of that. And they upheld that decision both at the appeal and at the original hearing.'",
        "'speaker_5': 'Thank you. I'm a huge cannabis equity advocate and I am someone who always wants to see this industry to, you know, thriving here in Long Beach and out of respect to all of our cannabis businesses. It's important that we take a careful look into these matters, because the last thing we want is for local cannabis businesses that'",
        "'speaker_5': 'are doing everything, you know, legally, that they feel that we're letting someone get away with not doing it legally. So for that, I want to thank the staff and and all everyone involved for really shining a light on this matter and will continue to be an advocate for cannabis equity.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Price, anything?'",
        "'speaker_4': 'No, thanks. I support Councilman Zendejas.'",
        "'speaker_0': 'Thank you. Let's have a roped up. Excuse me. I keep saying a roll call vote. I'm used to virtual meetings. Let's go ahead and cast our vote.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and grant an Entertainment Permit with conditions for Entertainment without Dancing to Long Beach Tiki, LLC, dba The Bamboo Club, at 3522-24 East Anaheim Street.  (District 3)": [
        "'speaker_1': 'Motion is.'",
        "'speaker_0': 'Carried. Thank you.'",
        "'speaker_1': '25 Please report from Financial Management recommendation to receive supporting documentation into the record, conclude a public hearing and grant an entertainment permit with conditions for entertainment without dancing to Long Beach, Tiki, LLC District three. There's also an old Councilwoman Price.'",
        "'speaker_4': 'I believe this item was going to be pulled. Right. Okay. Thank you.'",
        "'speaker_0': 'There's a motion to continue the item.'",
        "'speaker_3': 'No. We're planning to remove this item and then we will bring it back in May, most likely.'",
        "'speaker_0': 'I'll second that. All right. Let's have any public comment on the motion to withdraw.'",
        "'speaker_1': 'Mr. Sun, I can say did sign up for public comment? Would you like to comment on the special withdrawal?'",
        "'speaker_0': 'Okay. Thank you. All right. Let's cast our vote.'",
        "'speaker_1': 'Motion is carried.'"
    ],
    "Recommendation to request City Manager to work with the Public Works Department and Parks, Recreation and Marine Department, and in conjunction with Community Partners, to identify funding and begin pre-planning efforts to develop a park vision plan for Martin Luther King Jr. Park and report back within 90 days.": [
        "'speaker_0': 'All right. We're now going to go to item 31, Martin Luther King part.'",
        "'speaker_1': 'Communication from Councilwoman Sarah Vice Mayor Richardson Recommendation to request City Manager to work with the Public Works Department and Parks, Recreation and Marine Department and in conjunction with the community partners to begin pre-planning efforts to develop a park vision plan for Martin Luther King Jr Park and report back within 90 days.'",
        "'speaker_0': 'Thank you, Councilman Ciro.'",
        "'speaker_4': 'Thank you, Vice Mayor. And so I want to thank you for signing on to this item. I'm just so excited to be able to present this item, to identify funding and to begin the pre-planning. This has been identified as a need in a district dialog I've had in the past year, and I see that this is possible'",
        "'speaker_4': 'because it happened in Highland Park where we had the Doris Topsy Alva Community Center. We have the just recently named Ron Areas Health Equity Center. We also have a central health facility and I believe that's a model and what we could do and I think creating this vision plan is much needed because we haven't seen improvement in'",
        "'speaker_4': 'this park at this historical and cultural park in a long time. So in the past year, unfortunately, due to the vandalism, the statue, MLK statue was restored and little upgrades have been made. But more needs to be done.'",
        "'speaker_4': 'And it needs to be done with the community. It has to be a community driven vision, and that is part of the planning that is going to happen after we get a report back from the departments and how much it'll cost and what it will take.'",
        "'speaker_4': 'But I also want to thank the multi-racial coalition that have submitted a letter of support for this vision plan. Latinos in Action. My Girls in Action. Elite. Skills Development. City Fabric. Forgotten Images. I'm going to name all of them because I don't want to, you know, leave anyone out in their support.'",
        "'speaker_4': 'You see United Cambodian community as well as I think we have a few individual pastor. Well, Willie, Larry McIntyre from Grace Memorial Baptist Church. So I want to just thank all of you, all the residents, for voicing this need and this long overdue investment in central Long Beach.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. I'll speak up as a seconder. I think you have to start with a vision and that in the money follows. When we started at Highland Park, the idea was our community center was failing. You know, we had every winter when it rained, we had to close down the social hall and but we brought the community'",
        "'speaker_0': 'together and we started with the vision for the center. And then that developed into a vision for the park. And then that developed into a vision for the whole uptown area, the uptown open space plan and those visions.'",
        "'speaker_0': 'They won awards and they led to money. Today, if you go there, you know, a 95 year old community center has been redone and facilities been added and it's beautiful. The doors topsy over community center. That was an $11 million investment and the vision plan that happened just a few years prior.'",
        "'speaker_0': 'And then just yesterday, we open the Rainforest Health Equity Center. It was a facility center that we invested $5 million into. But what's really important is what we put inside the programs and services inside. So things like the fatherhood initiative, things like, you know, My Brother's Keeper, My Sister's Keeper and our office youth development clinic.'",
        "'speaker_0': 'The things that, you know, particularly it was important to have in part because there's, you know, five city halls closed north lobbies that are all in city hall. So it made it more accessible for people to go to the area they know to get the city services.'",
        "'speaker_0': 'So I personally think I support where you want to go, but I think it's important. You know, King Park is like, you know, it's an important, iconic part to the city and it needs to be invested in and treated as such.'",
        "'speaker_0': 'And so I'm happy to support this vision and I look forward to what comes next in terms of the actual millions of dollars it's going to take to make the park into what it what it can be. Next, we have a councilwoman.'",
        "'speaker_0': 'So you want to go to the comment. Okay. We'll go to public comment. Madam Clerk.'",
        "'speaker_1': 'Well, the first five speakers please lineup. Tim Gilmore. Russell Waters. Ginger Moore. Franklin Sims. Marc Anthony Hall.'",
        "'speaker_2': 'So there's talk. Hello. My name is Tim Gilmore. I am a member of the Midtown Neighborhood Association, president of the Long Beach Poly Alumni Association, Inc.. 5013329. I'm talking to you about the support for Mr. Leonard Adams program, which is the basketball court construction, which will benefit our kids and help it.'",
        "'speaker_2': 'In my case, Park is a part of Sully Soros Item 31 Work Vision Plan. I've known Mr. Adams basically for about six years. We've gone out and he's done his his backpack school program, and I've had a lot of respect for that.'",
        "'speaker_2': 'And in those three years we discussed possibly doing something for basketball courts. But since we had COVID and my health condition, we kind of had to put that on on hold for that. But I'm starting to get back to things.'",
        "'speaker_2': 'And in March of second, we met at a Denny's restaurant, and we really rekindle the idea of doing it. I've been doing some research here and finding out basically what the cost and basically comes out to about 250.'",
        "'speaker_2': 'Okay, to about 400. I did Masco, I called the basketball vendors and such. So I've been doing some research on it as well as talking to the city planner, which is Nancy Conlin Arrows and Joy Contreras, the public works group hopefully going to have a meeting this week.'",
        "'speaker_2': 'It's such an I really would really love to see if we can get this doable. I do think is this.'",
        "'speaker_1': 'Mr. Gallo, your time has expired.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_1': 'Next speaker is Russell Waters.'",
        "'speaker_2': 'Hi. Nice to be here. To all the council members, we appreciate you, Dr. Sorrell. We love you so much. Thank you so much for this right here. My family has been in the city of Long Beach since before Long Beach was Long Beach.'",
        "'speaker_2': 'We did not come to Long Beach. Long Beach came to us and we have never my family has been serving that community on that street for over 115 years. Chris and Baptiste started in my great, great, great grandfather's living room in 1907.'",
        "'speaker_2': 'We fought to get over. There was a court battle just to get there. We have never in the 115 year period that we've been there serving had the kind of support that we have received from you in the last year of your since you were elected.'",
        "'speaker_2': 'I'm going to calm down, but I get emotional every time I talk about this. What you've done is incredible. I'll be back to say more about what I have to say about. But we're just proud of you. You're the crown jewel of our community, and we are proud of you.'",
        "'speaker_2': 'I'm to you next. I'm going to come back. My time is up. Oh, have I got a mouthful for you? Mary's in De Vos. Thank you very much. We're in full support. And that's next.'",
        "'speaker_1': 'You're more.'",
        "'speaker_5': 'Hello, council members. I will not be as.'",
        "'speaker_2': 'Passionate as the last gentleman, but.'",
        "'speaker_4': 'My name is Ginger Moore and I work with Elite Skills, a nonprofit, and we currently occupy an office space at Kings Park.'",
        "'speaker_5': 'Parks and Rec are near and dear to me because my father for over 20 years worked for Parks and Rec. And so now, as an adult, to be back at one of the parks that I frequented as a child, it's it's a big deal to me.'",
        "'speaker_5': 'And Kings Park has so much potential. And I'm here in favor of item number 31 and the beautification process.'",
        "'speaker_4': 'Or the planning.'",
        "'speaker_5': 'Stages of this. I drive up every day and I'm so proud to be there.'",
        "'speaker_4': 'And I.'",
        "'speaker_5': 'Know what it could be, he said.'",
        "'speaker_4': 'You were the crown jewel growing up. Kings Park was our crown jewel.'",
        "'speaker_5': 'So we're excited to be here today and look forward to what's to come. And we are fully support we fully support you in this. And we would look we look forward to being part of the planning process. So thank you.'",
        "'speaker_5': 'And again, you have our support.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Oh, my name is Mark Hall. I was born and raised in Long Beach, California is right across the street from the park. Our crown jewel was Herb. He built the park when it was Real Street Shack. African-American men underserved over there.'",
        "'speaker_2': 'All we see is soccer year alone, so we must connect with the true Negroes. My family been all industry for 85 years. You helped build up stained a church about a dare. We we've been underserved. So I represent reset we grassroots movement.'",
        "'speaker_2': 'We like to be a part of rebuilding or not rebuilding fixing. We must dialog to make it right. Dang. They write right now. Thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_1': 'Franklin Sims. The next five speakers after Mr. Simms is Leonard Adams, Nina Younger, Bridget Jones, Sharon Diggs Jackson. And since I can say.'",
        "'speaker_2': 'This agenda item is about a vision plan for King Park. You can't have a vision.'",
        "'speaker_5': 'Without telling the.'",
        "'speaker_2': 'Truth. Councilwoman Sauro said that the Dr. King statue had been restored after being vandalized. That is not true. And I'm concerned that when you go throughout the vision, if you didn't start with the truth, then what are we going to end up with?'",
        "'speaker_2': 'This is a bust of Muhammad Ali. It was sculpted by the same man that sculpted that statue of Dr. King that sits at MLK Park. That sculptor came to Long Beach after it was restored. And that artist stood right in that park.'",
        "'speaker_2': 'He looked at it and I said, Mr. Stokes, has the statute been restored? He said. I want to weep, Franklin. It has not been. He was called by the city after it was vandalized with Nazi symbols. He told the city what to do.'",
        "'speaker_2': 'They did not. If you have a vision, you have to tell the truth. The Martin Luther King Park must be restored and that statute must be restored. And there are people behind me who won't take no for an answer.'",
        "'speaker_2': 'Thank you, Alex. Police. Good afternoon. City Council. Thank you for allowing me to speak tonight. I am a long time resident of the sixth District. I am also a former city and city employee with 40 years of services.'",
        "'speaker_2': 'And as I retired, I never quit working for my neighborhood or my city. You got a gentleman was talking about mean giving backpacks, giveaways out for the school kids in my neighborhood. But also during my time when I spent with the city, I spent ten years at Martin Luther King's Park and I thought that park would have'",
        "'speaker_2': 'absolutely nothing for years and years with no development. There was also a problem with having outdoor outdoor equipment. There was no outdoor equipment other than a swing and a playground. So if we look at all the rest of the parks around the neighborhood, Martin Luther King Park is not equal to them.'",
        "'speaker_2': 'You can go almost to any park and it's a major civil rights park is named after Dr. Martin Luther King's Park. We are trying to figure out why does this park doesn't have a basketball court. It's the only major park.'",
        "'speaker_2': 'I guarantee you. I guarantee you get in your car and drive around anywhere and you're going to see a basketball court on any major park except for Martin Luther King tomorrow. As a problem with that. As city council members, I believe that all of you guys.'",
        "'speaker_1': 'Should be.'",
        "'speaker_2': 'Proactive in your job, because when you stood up there, you said.'",
        "'speaker_1': 'Mr. Adams, your time has expired.'",
        "'speaker_2': 'Basketball.'",
        "'speaker_0': 'Thank you. Basketball court. Hear you loud and clear. Thank you. Next speaker, please.'",
        "'speaker_1': 'Nina Younger. Bridget Jones, Sharon Diggs, Jackson Anderson, I can say.'",
        "'speaker_2': 'Good evening, counsel. My name is Nina Younger. I live at 924 East Damian Street, right in the center about three blocks from Kings Park. I've been in the area for over 50 years. Definitely we need.'",
        "'speaker_5': 'To.'",
        "'speaker_2': 'Bring up our park. Just like the gentleman before me said. There's no basketball court, there's no sports in our park. We used to have sports. We used to have baseball games. There's nothing more than that. I would like to see in our vision a black history museum right there at that park.'",
        "'speaker_2': 'You are a black artist, pop up so that we have lots of talented people in our district. It'd be nice to show our artwork, what we do, our community. There's going to be a new 68 unit housing being built right.'",
        "'speaker_5': 'Behind my house. Well, in front of my house behind it.'",
        "'speaker_2': 'Now my ocean breeze is gone and I feel bad for the aging on that corner. They have nothing to go to or anything to do. I'm just pleading with the Council to end this vision, make sure that you get the community input.'",
        "'speaker_2': 'We know what we need in our area and we would like for you to help us. If we're going to support you, we'd like for you to support us. Thank you so much for your time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good afternoon, City Council. My name is Bridget Jones. I am advocate for community organizations across Long Beach. I really feel that in the essence of a vision plan, it is imperative that you incorporate stakeholders. In this particular case, the immediate stakeholders are the residents that surround the park.'",
        "'speaker_5': 'There really does need to be a Phil proof system that allows their vision to be heard. I understand that emails go out and there are different things in place, but you do have to consider that not everyone is privy to email.'",
        "'speaker_5': 'Not everyone has the capability to utilize or access whatever tools that you are using. So please, in your planning and your vision planning, please make sure that you are using tools that the community can access and that they really are a part of the vision because the vision is not clear if they are not included.'",
        "'speaker_5': 'Thank you for your time.'",
        "'speaker_0': 'Thank you so much. Next speaker.'",
        "'speaker_2': 'Please. Good evening.'",
        "'speaker_4': 'Vice Mayor and City Council. My name is Sharon Diggs Jackson.'",
        "'speaker_2': 'I am currently the program director for the.'",
        "'speaker_5': 'Black Resource Center, which is located at 1133 Rear Street. And I just want to offer some words of support for the motion. Thank you, Councilmember Ciro, for moving it forward. But I want to make sure we also include the Central Facility Center.'",
        "'speaker_5': 'We just moved into the Center.'",
        "'speaker_2': 'For the Black Resource Center.'",
        "'speaker_5': 'And my staffer and I spent the last month cleaning up the space, painting, organizing it because the facility had sat vacant for more than almost three years.'",
        "'speaker_2': 'So we want.'",
        "'speaker_5': 'To make sure that it's part of the visioning plan, that it also includes the Central Facility Center.'",
        "'speaker_4': 'There are nonprofits.'",
        "'speaker_5': 'There are resources that want to operate out there, who want to be able to serve the community. And we want a world class facility.'",
        "'speaker_2': 'In which to do it. When that center was originally opened.'",
        "'speaker_5': 'Having grown up here in.'",
        "'speaker_2': 'Long Beach, I remember the.'",
        "'speaker_5': 'Day that it opened and when Clarence Smith was so excited about it. So we want to bring it back to where it was again. Martin Luther King Park is near and.'",
        "'speaker_2': 'Dear to our community.'",
        "'speaker_5': 'We want to be part of the visioning process there. If you can't find.'",
        "'speaker_2': 'Somebody, give us a call. We'll make sure that we can put.'",
        "'speaker_5': 'As many people on whatever commission our committee that.'",
        "'speaker_2': 'You are trying to plan to move forward with this.'",
        "'speaker_5': 'Project. I also want to just give a minute and say thank you to the council. It's only befitting that item number two tonight actually addressed an issue dealing with Constance Oden in the Oden family.'",
        "'speaker_2': 'Those of us who grew up here and know Connie. We know that she.'",
        "'speaker_5': 'Gave her heart.'",
        "'speaker_2': 'And soul to.'",
        "'speaker_4': 'King.'",
        "'speaker_5': 'Park.'",
        "'speaker_0': 'Thank you so much. Next, people, please.'",
        "'speaker_2': 'Is the snake less than I can say? Sixth District resident. Thank you to our sixth district office of Dr. Sara for bringing this item up to council. It's imperative that this park is rekindled as it currently stands. It's essentially a green mausoleum.'",
        "'speaker_2': 'It's a dead space. There's no programing with respect to this park that truly benefits our community. And as you can see from the rest of my neighbors, I live just a few blocks away from the park, as well as going to church just a block away.'",
        "'speaker_2': 'We want to have community input towards what this what this has to be for us and the community. There's a lot of stipulations and areas that we feel like is currently the case with the park. I think a lot of people have named the the outside of basketball court.'",
        "'speaker_2': 'For me, it's imperative that city races control a perpetual lane from Boys and Girls Club. They are not speaking to the community. We live in a zip code 90813 where the per capita income is $17,000 and for lane charges over $20 for people in the neighborhood to engage with publicly owned, city owned property.'",
        "'speaker_2': 'I'm a property owner in the area. It makes no sense that the children in our community have to pay to use a city owned property. That's number one. So we needed to wrest control of the Boys and Girls Clubs and mandate of that because they're not doing right by us.'",
        "'speaker_2': 'And finally. Well, there goes the time. Thank you. The last thing is that with community partners, the trickle down Reagan economics days are over. There's a plenty of community based organizations who are here. We need to be compensated for it.'",
        "'speaker_1': 'Thank you. Next Speaker Freddy Johnson. Sean Earle. Shannon McLucas. Sean Olds. Daniel Pickens. Michela Palmer, Freddy Johnson.'",
        "'speaker_2': 'Hello. Good day. Good evening, counsel. Great to hear you speak me know most of you. Let's get to the point. We're suffering in that area. There is no structure. There's no financial backing for that structure. Okay. All of you were children.'",
        "'speaker_2': 'All of you had a part to play. These are the people that I am speaking to. If you ever were a child, it becomes at this moment, it's your responsibility to make sure that environment is better and they have better choices to make regardless of the situation.'",
        "'speaker_2': 'We've all come from things, but better is a choice, and the environment for that better to breed is these areas. They're not being considered or understood. They're being overlooked because we're overlooking it. You understand what I'm asking? The better is the choices we make in here.'",
        "'speaker_2': 'All of us were children. The children should not have to fight for the right, for choice to be a success and whatever role they choose. The basketball courts. There's one pool table. There's no physical anything inside these places.'",
        "'speaker_2': 'But if I went to Signal Hill Park, I can be a doctor in that park. Kings Park need to be that because kings still for every race in here. So how could that park not have more value than anything?'",
        "'speaker_2': 'He gave his life for the betterment of the culture of every class of people. Let's look up and stop looking down.'",
        "'speaker_0': 'Thank you. Next speaker, please. Yes, sir.'",
        "'speaker_2': 'Hello. My name is China. I also grew up in Long Beach, right around the corner from King Park. And when we were growing up in King Park, we used to swim and there used to be a little white pool.'",
        "'speaker_2': 'And we loved to get in that pool, even though the kids might urinate or suddenly that.'",
        "'speaker_0': 'Pool we got in anyway. And it was.'",
        "'speaker_2': 'Double the initiation. You wasn't from that neighborhood if you hadn't swim there, that little pool. You know what I mean? And I think the programs at the park had it days is what when we because we all grew up in the community turned us down different roles but it was those programs that was started at a young'",
        "'speaker_2': 'age that helped us when we got older, to be able to come back to our senses and to become mature men and grow up. And our kids today are missing that. They have no programs. They don't even have free lunch.'",
        "'speaker_2': 'They have a big, beautiful pool now in King Park that the children in our community can't even get in because the parents don't make the the amount of money it makes to be part of the Boys and Girls Club.'",
        "'speaker_2': 'And we need grassroots people to be up there.'",
        "'speaker_0': 'Volunteering and.'",
        "'speaker_2': 'Interacting with them kids. Because a lot of the times when I was in the streets, it was people that worked at that park and in the programs that see me like, Boy, you better get home. And I would respect that and I appreciate that and our kids need that back.'",
        "'speaker_0': 'Thank you. That speaker, please.'",
        "'speaker_2': 'Hello. My name's Shantel and I'm here to let you know that I respect all the names that you named FAS. The people that volunteered and sent in letters. And they are nonprofit to support Kingsport. But it's a shame that there was no black organization that wrote in to support Kingsport.'",
        "'speaker_2': 'And it's a shame, you know, my father took me to this fort and he told us what Dr. King meant to him and how Dr. King meant to us as a whole. Dr. King stood up for us all.'",
        "'speaker_2': 'He stood up to support each other. And when we stopped supporting each other. That part is a reflection of what the community is right now. The community is poor now and they don't have nothing to lose because they don't know nothing else.'",
        "'speaker_2': 'But I know better because my father took me there and he raised me there to show that I know better so that I can do better. The kids, they don't know better. Sorry. Not going to do better. Council.'",
        "'speaker_2': 'Everybody. You're letting us down. And I'm responsible for that, too. We got to we got to stand up. We got to stand up for our community. We got to stand up for our family member. But you continue to turn the back.'",
        "'speaker_2': 'No soul. The same souls that you're turning your back on, they're going to be forced out and they're going to be in your neighborhood and they go have a day. They're not going to care. They knock on Kerry and will be right at your door.'",
        "'speaker_0': 'Thank you. Speaker, please. Madam Clerk, can we just read off the next few to the line up coming for.'",
        "'speaker_1': 'Miss McLaren, MC Lucas, Daniel Pickens and Mikayla Palmer.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Vice Mayor, council people I encourage.'",
        "'speaker_2': 'You to support.'",
        "'speaker_5': 'With the sixth district council is trying to do.'",
        "'speaker_2': 'I'm probably.'",
        "'speaker_5': 'One of the few that was there when they broke the ground.'",
        "'speaker_2': 'Breaking park.'",
        "'speaker_5': 'When they open the doors. It's a very much needed thing. I grew up in Long Beach all my life. I run a nonprofit called Forgotten Images. It's really, really needed.'",
        "'speaker_2': 'My daughter.'",
        "'speaker_5': 'Her first job. Was working at King Park as a camp counselor. Please include the community in this planning.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Let's speak to police.'",
        "'speaker_5': 'Hello. I am Akeelah Palmer and I'm going to talk about why softball should be in parks and in afterschool programs. Some parents cannot afford the actual sports park so kids can get some exercise while having fun. They should also be in after school programs.'",
        "'speaker_5': 'So while parents are working, kids can have fun and do an activity. Instead of kids being at home getting zero exercise, they can always go to a park to get exercise and have fun.'",
        "'speaker_0': 'Thank you. Good job.'",
        "'speaker_2': 'Thanks, Speaker, please. Good evening, counsel. My name is Daniel Pickens. I've been a resident of Long Beach for approximately seven years. I came here shortly after my term with the ninth US Marine Corps and I want to say that Long Beach has been very beautiful.'",
        "'speaker_2': 'The bay has been very kind. It's open me with warm arms. The residents, the community take very they took very much pride inside of their city. And I see that they are in a constant pursuit of doing more and more for the city.'",
        "'speaker_2': 'Me being the resident right there on 1904. Lemon I was literally living right next to Martin Luther King Park. So I saw everything that I went through through the course of the last seven years from the good, the bad and the ugly.'",
        "'speaker_2': 'You know, they removed a lot of the drug usage over there, and I see that it is on its way to improvement, but I know that there's a lot more that that could be done. You know, I had a child that I was mentoring over the last couple of years who was a resident over there.'",
        "'speaker_2': 'You know, he kind of fell prey to the structures of, you know, gangbanging. But, you know, nonetheless, I see him constantly trying to do more for himself. But I feel like if we implement more programs over there in Martin Luther King Park, if we give more opportunities for kids to be able to actually do affordable things, we'",
        "'speaker_2': 'utilize our resources to the best of our abilities. And we just overall as a community try to show that we really do care about our city. Then I felt that would be what Martin Luther King's dream to use.'",
        "'speaker_2': 'It's been 54 years in a day since his assassination. I'm going back in. Please. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Hello.'",
        "'speaker_2': 'City Council. Some of you guys know me. Some of you guys don't. I'm Jeremiah. I just wanted to put my $0.02 in. Even with me being a college student. Long Beach City College. Some of the some of the elders at Kings Park were kind of tell me, boy, go ahead and put that out and go back to'",
        "'speaker_2': 'class. It goes perfume, but go back to class. And even as I as I got older, I started having more children. And that would be the place I can take them that I would know will be affordable and feasible within my.'",
        "'speaker_6': 'District, you know, so just kind of take it into consideration. It's not really for us.'",
        "'speaker_2': 'It's for the next generation. And we're laying down the groundwork. Thank you.'",
        "'speaker_0': 'Thank you. All right. That concludes that concludes public comment. Thanks to everyone who spoke up. We're going to now take it back behind the rail. Councilwoman Zendaya's.'",
        "'speaker_5': 'Thank you and vice mayor and thank you, Councilwoman Sarah, for bringing this item forward. And thank you, all of you who came out to speak. I think that it's very important to hear your voices. And, you know, one of the things I admire a lot about you, Councilwoman Sarah, is that, you know, you really want to invite'",
        "'speaker_5': 'the community and then welcome them to participate. So I know that I know that that's something that I totally admire about you. So I'm glad that you guys are here and we can, you know, connect and steps. Really great.'",
        "'speaker_5': 'I know that MLK Park is such a valuable space to all of us in the city, not only because it's home to our beloved statue of Dr. King, but also because of all the that it offers to the surrounding community.'",
        "'speaker_5': 'And it can be a place where it offers a lot more. And I know that Councilwoman Sarah is going to bring that. Martin Luther King Park is has been one of the closest parks to my district with a swimming pool.'",
        "'speaker_5': 'And a lot of my district residents like to go over there. So because of that, it also is super special to me as well. I'm super supportive of this vision that empowers the community and and, you know, the neighbors for to be able to have a more positive light shone on this park and be able to create'",
        "'speaker_5': 'more opportunities for the community surrounding it. I'm really looking forward to receiving this report back and to hearing about all the possible outreach efforts to get the community informed and involved. And I think that this is a first step in the right direction.'",
        "'speaker_5': 'So I'm fully supportive of this item. And Councilwoman.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Allen.'",
        "'speaker_4': 'Yeah, thank you, Vice Mayor. I just want to say thank you to everyone that came up here and commented. I was really, really moved. I love King Park. You know, I grew up I went to poly and and back in the day, I represented my friends, the student body president back in the eighties.'",
        "'speaker_4': 'And me and a lot of my friends. I was an athlete, but a lot of us spent some time at King's Park, a lot of time at King's Park. And I became keenly aware that it was not like other parks.'",
        "'speaker_4': 'I know in 1996, they added a pool they dumped. They've done some things there, but not enough. Not enough. And I stand with you. I just want you to know you're right, Dr. Ciro. Councilwoman Sara is amazing, and I stand with you and beside you on everything that we can do to make sure that we get you'",
        "'speaker_4': 'basketball courts, that we that we get just all the programing that our kids, my kids now your kids deserve. And so thank you, Councilwoman, for bringing this item forward. And you just let me know how I can help.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_6': 'Thank you. And I also want to thank you for bringing this item forward. I really want to appreciate the community for coming out and speaking out. It's not every day that we get a community here behind an asset like King Part King Park is a is a jewel, is a treasure, is a core kind of cultural community'",
        "'speaker_6': 'space in the central area, sixth district. And what we heard tonight was love and pride of community. And obviously, as a city, we need to be supporting those efforts. I heard a lot about the visioning and what that means, and I do want to just give Steph the opportunity to to address what a visioning process actually looks'",
        "'speaker_6': 'like. Is there anybody here who can address that? Just briefly.'",
        "'speaker_3': 'Yes. Our director of public works, Brant Dennis, and our director of public I'm sorry, Parks and Rec and Public Works, Eric Lopez can help talk about that. Thank you, Councilman Alston. So in general terms, when a request for a vision plan originates on, the dais such as this one will immediately work with the community to develop a'",
        "'speaker_3': 'scope for exactly what that vision plan will entail. Some of our parks do have established master plans or vision plans, so that's actually the foundation for a good starting point. But some of those plans are decades old. And as we know, the neighborhoods and the demographics and the recreational needs around each park certainly changes with the times'",
        "'speaker_3': '. So I think engaging with a consultant group, whether they typically are urban planners or landscape architects, that's kind of in their professional wheelhouse to help lead the community engagement and outreach. But I think the points that the community voiced tonight were excellent in terms of making sure we understand the right vehicles, the right techniques to make sure'",
        "'speaker_3': 'every voice is heard. And I know with COVID waning, our ability to get together in person is a really a positive thing. And I think most of our community meetings, when we can meet the neighbors in the park, walk and talk and envision together, that's a really positive approach.'",
        "'speaker_3': 'But we certainly work very closely with our colleagues at Public Works so that whatever visions are established, we know that things like historic properties and infrastructure, utility needs and other things that have changed with the times in terms of accessibility and in terms of accessibility, also want to mention how committed we are to language access.'",
        "'speaker_3': 'So any of our parks that we begin to communicate outwardly through surveying website invitations to contribute ideas and even an in-person meetings will be following all of our language access protocols.'",
        "'speaker_6': 'Thank you. And so Parks and Rec, you all kind of facilitate the visioning process and public works will actually implement the visioning process.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_3': 'Councilman. And Public Works gets involved in the very beginning. We want to make sure that as we create the plan, as we listen to the community, as we learn what works, what doesn't work, of how our communities have evolved, have changed.'",
        "'speaker_3': 'You know, there are there are there's there's a lot of important information that comes out of the planning and visioning process that directly informs the actual technical work that comes with actual constructing the projects. So we're we're we're happy to be a partner here.'",
        "'speaker_3': 'We're happy to connect with the community, to work with all the organizations and individuals that that want to be engaged and participate and to to look at what opportunities exist to make this existing park better. So public works where the excellence in construction.'",
        "'speaker_3': 'But we also like to be involved in a beginning.'",
        "'speaker_6': 'Well thank you. I just wanted to just re-emphasize that this is going to be an inclusive, engaged process with the community and that that visioning process for basketball courts or whatever the vision that you may have as a community, you will have the opportunity to participate and engage in with the planners when we get to that point'",
        "'speaker_6': 'also. I know I have one at a time here, but Cob City Manager, I know during our budget process we set aside some funds to to restore the statue, and I believe those funds were already spent. So can you is there money already identified that we could actually put toward this visioning process to pay for it in'",
        "'speaker_6': 'our fy22 budget? Excuse me. Yeah.'",
        "'speaker_3': 'So that's part of the request that we've been tasked with today is to figure out the funding, figuring out the. The feasibility.'",
        "'speaker_0': 'Okay, folks, just. We hear you. Let's hear from the city manager.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Yeah. So there certainly is money that was set aside through which I believe was measure eight for the park. So that was set aside in the last year's budget. I did hear the question about the parade money. That money is actually restricted for special events.'",
        "'speaker_3': 'It can't be used for other things that some voters have put that restriction on it. But that's the task that you've been giving us tonight is figure out of the funding strategy. Come back, talk about what the plan would be and identify those resources.'",
        "'speaker_6': 'Okay. And then lastly, I just want to just say, again, King Park is a special place. Children grow up in that part. My kids spent many, many summers with Miss Connie at the summer summer daycare programs. It's a special place for me and my family.'",
        "'speaker_6': 'And so I'm happy to support this item. And I think we should put the resources behind, you know, a great visiting plan. Thank you.'",
        "'speaker_0': 'Thank you. Next is councilman, your anger.'",
        "'speaker_3': 'Thank you. And I want to thank everyone who came out today. Spend a few hours with us here out of your personal time to come and share your your vision for what the park should be.'",
        "'speaker_2': 'I think you've already made some suggestions.'",
        "'speaker_3': 'And I think that the city council has heard them, staff has heard them, and I'm pretty sure that they're going to be incorporated. MLK Park is special to everybody. It's special to me many years that they're going to go MLK Park for.'",
        "'speaker_6': 'Celebrations.'",
        "'speaker_2': 'For.'",
        "'speaker_3': 'MLK Parade.'",
        "'speaker_2': 'Day and the events at the Park for Juneteenth celebrations out there as well.'",
        "'speaker_3': 'And I'm looking.'",
        "'speaker_2': 'Forward to.'",
        "'speaker_3': 'Reactivating MLK Park to getting it back where it needs to be. And and I definitely support this item.'",
        "'speaker_2': 'Thank you, Dr. Sorrell, for bringing it forward.'",
        "'speaker_6': 'Because obviously it.'",
        "'speaker_3': 'Is a.'",
        "'speaker_2': 'Gem, a jewel of the sixth District, and we need to make it so. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_4': 'Thank you and thank you for bringing this item. I, too, am very supportive of it and I appreciate all the comments from the members of the audience tonight. I do have a question for our staff. Why isn't the pool accessible to the community?'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Yeah, that is a misnomer. The Boys and Girls Club has no role with the pool, so it's a city pool, just like Silverado and Belmont pool. So we can help explain that will work with the council office to make sure there's no misunderstanding regarding access to King Pool.'",
        "'speaker_4': 'Okay. And I know a few years ago we brought an item forth to make sure that swimming for seniors and children was offered at a reduced rate throughout the city. Is that in effect at Kings Park?'",
        "'speaker_3': 'Yes, that's still in fact, yes.'",
        "'speaker_4': 'Okay. And what is the rate?'",
        "'speaker_3': 'I don't know what that is offhand. I'm sorry.'",
        "'speaker_4': 'All right. Because I want to make sure that it's affordable and it's something that everyone can afford because that is a beautiful pool. And I know that we want to make sure the youth is using it. And it's a it's a much needed asset.'",
        "'speaker_4': 'But I'm very supportive of this item, and I'm really happy to have heard from everyone in the audience tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_5': 'Thank you. I am so supportive of park programs and visioning such as this. A few years ago, there's a couple of agenda items I think should be talked about. One is that there was an agenda item brought forward where we talked about what does community engagement mean and what does involving the community mean and what does it'",
        "'speaker_5': 'mean to notify the community? Is it via every door direct mail where you get a postcard in your mailbox that lets you know about a community meeting? Is it only using Twitter and Facebook? That's probably not the best sources.'",
        "'speaker_5': 'But we as a council said we want to hear from the city what they believe community engagement means. Then on a case by case basis for programs such as this, we want to see why you chose what you chose, to make sure that it aligns with the council person's expertize in knowing and understanding his or her community'",
        "'speaker_5': 'to make sure that that is the best way to get a hold of and engage the constituencies. So first and foremost, thank you all for being here. This is the first step of being engaged. Second, let's make sure that we use the systems that we created to ensure that the community has clear expectations of how they can'",
        "'speaker_5': 'and can't be reached and how they can and can't be involved, and that they know that they're not showing up to meetings that are useless, that they give input that is not implemented. We want that to be implemented.'",
        "'speaker_5': 'And then finally, there was another agenda item that I brought forward regarding park advocacy groups, and we have a great partner in a nonprofit organization called Partners of Parks. Earlier tonight, Councilmember Supernova gave funding to that organization to help a community group and parks on my side of town, probably because I brought the item and I really'",
        "'speaker_5': 'pushed for it. Each park has a group of six or seven people that consider themselves the park advocate for Wardlow Park or whatever they are, and they're people who live near the park, the people who are impacted the most by the park, or a person who might live adjacent or be a part of a program that has'",
        "'speaker_5': 'insights into the programing at the park that the community believes is the right person to be there. And Brett Dennis from Parks and Rec has worked to have some staff members available to engage with and provide those resources immediately.'",
        "'speaker_5': 'We shouldn't have to wait a year for a visioning process for you to get some of the resources that you need today, including but not limited to visibility and transparency about who's renting your park and how often and what does that mean and who is limited to access, including but not limited to the pool.'",
        "'speaker_5': 'When we brought forward an item to reduce access costs for the pool to either two or $4, I can't remember one. It's $1.'",
        "'speaker_4': 'For admission.'",
        "'speaker_5': 'The other three to 2 to $3 is covered by partners of parks through grants that they write. And so having them at the table and having them to help raise funds, they just helped raise funding for Admiral Kidd Park.'",
        "'speaker_5': 'And they're here to be an advocate for you and support you as well. And and we're here to help. And I am so proud of all of you for being here tonight. And I am 100% behind supporting Councilman Sorrow and all of you in getting not only a basketball court, but if you want.'",
        "'speaker_5': 'I was really supportive of midnight basketball. We needed it more of our parks. And while I appreciate that, I hear that the city is going to bring midnight basketball and house. I think that there's something to be said for asking the community what they want, if they want to continue to use some of the nonprofits that are'",
        "'speaker_5': 'providing those services and why before we just bring it in-house on our own and make those decisions. So I only have a little bit of information about that, but I'd like to dig in more at my next Parks and Rec briefing to better understand where we are on that and what I can do to support both Councilman'",
        "'speaker_5': 'Zendejas and Councilman Sorrell. Thank you. And the community.'",
        "'speaker_0': 'All right. Thank you. Before we hand it to Councilwoman Sorrell to close out, I want to thank everyone for stepping forward. What I heard today was a beautiful vision for the park. And if you want to see that vision implemented, you have to stay engaged.'",
        "'speaker_0': 'You heard, you know, the entire city council, black plurality of the city council expressed their support for King Park. But at the end of the day, the priorities need to come up in the budget when it comes time for funding.'",
        "'speaker_0': 'That's when we have to pay attention. The vision is key, but you all want to see the vision be implemented, so we have to make sure the dollars reflect those values. That's what's incredibly important. And so I'm happy to support this.'",
        "'speaker_0': 'I know it's possible. It's a great park. I've seen transformations at the Forest Park, Highland Park. It does not take that long. You can do some immediate work. You can get long term things like community centers and all sorts of things.'",
        "'speaker_0': 'But it really is really important to center on community activism. So you're going to have to. Going back to city council around budget time. That's my recommendation to you. And that said, I'm going to hand it back to Councilman Sauro to close it out.'",
        "'speaker_4': 'Yeah, I just want to express my deep appreciation for you to come out and share your thoughts that those feedback is what? The visioning processes. Hearing what hasn't been done. Hearing the historical disinvestment that's been made. Right. And that's what this process is.'",
        "'speaker_4': 'It's hearing. What does it take to make you feel like this is a community park that is fit for your children, our elders. Right. I hear you about making sure we're knocking on doors and reaching out to people like Miss Alice Robinson.'",
        "'speaker_4': 'She doesn't check emails. She doesn't even she she is old fashioned phone. And that's what my staff does. We call people and we also doorknock, I think now that things are getting better, that's what I also plan to do to reach out to people.'",
        "'speaker_4': 'And that's the work I love. I come from community organizing. I've been a labor organizer and I'm here to bill, you know, 100%, here to Bell. And, you know, I know what it's like to come from a place where, you know, I, I, I come to this with love because I know what hate does, right?'",
        "'speaker_4': 'I've been a child of genocide survivor. I've seen what hate has done in my community and what's even brought my family and my community here to the US. So I have no room for that. I have room for love and have a room for building and that's what I want to do in our community together with everybody'",
        "'speaker_4': '. So that's the spirit that I want us to take with this visioning. I'm going to be I'll give you my full commitment to be part of that process, detailed in and out. So I look forward in us doing report back and engaging with you and how you were able to come out.'",
        "'speaker_4': 'I hope to continue this process because this is what it takes. So thank you and thank you to my council colleague for your support and staff as well.'",
        "'speaker_0': 'Thank you. Council member Sara was go ahead to our vote.'",
        "'speaker_1': 'Motion is carried.'",
        "'speaker_2': 'Thank you.'"
    ],
    "Recommendation to request City Manager work with the Director of Parks, Recreation and Marine as well as the Long Beach Pickleball Advisory Group to develop a plan for the future of pickleball in Long Beach including; the feasibility of, converting all tennis courts to dual use courts, creating dedicated pickleball courts, developing a minimum amount of storage at each park for equipment, and exploring further partnerships with local schools for joint use of LBUSD tennis courts. This report back to City Council is requested within 60 days.": [
        "'speaker_0': 'Let's go ahead to item 30, please.'",
        "'speaker_1': 'Item 30, communication from Councilwoman Price. Councilwoman. Recommendation to request city manager to work with Director of Parks, Recreation and Marine, as well as the Long Beach Pickleball Advisory Group to develop a plan for the future of Pickleball in Long Beach.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. So I want to thank an advanced city staff for bringing this item forward. And I want to thank the members of the audience who are here tonight to talk on this item. I will say that I believe our Parks Rec and Marine director is already way ahead on this item.'",
        "'speaker_4': 'This item tonight is really more of a status report of what he's already been doing and an opportunity for us to all understand what he's doing as he and how he's going to be directing his efforts in the future.'",
        "'speaker_4': 'I'm going to turn it over to our PRM director, Brant Dennis in a moment to talk a little bit about what he's already been doing on this item and the progress that he's made. But I want to thank the Pickleball Advisory Group and members of whom are here tonight for working collaboratively with Brant Dennis on this plan'",
        "'speaker_4': 'and the updates that we're going to receive tonight. They've been a fantastic partner to the city and put in a lot of work over the past six months to enhance access to the sport of Pickleball in the city of Long Beach.'",
        "'speaker_4': 'I want to go ahead and turn it over to our PRM director to perhaps give us a little bit of an update of what you're working on. And then if it's okay, I'd like to turn it over to public comment.'",
        "'speaker_0': 'Sure.'",
        "'speaker_3': 'Thank you. Councilwoman Pryce. So the history for at least what we call our Long Beach Pickleball advisory group is about six months old. It was brought to my attention, and I should give a personal disclosure. I do love Pickleball.'",
        "'speaker_3': 'I experience that in Florida with my retired mother. And it's a great sport for active adults. And actually, I've enjoyed seeing a lot of our pickleball enthusiasts introduce it to young people when they happen. Chance walk by and hear that melodic sound of the ball against the paddle.'",
        "'speaker_3': 'So, but yeah, about six months ago I was able to be introduced to what I would call kind of the core leadership across the community. There were a little nucleus groups of pickleball enthusiasts that were playing primarily Bayshore and Marina Vista Park and College Estates Park, but also during the COVID era.'",
        "'speaker_3': 'It was not unusual to see a lot of folks that love Pickleball out with chalk or tape, kind of making their own pickleball court lines on open, hardscape spaces. And they had their own portable pickleball nets in the trunks of their SUVs or cars.'",
        "'speaker_3': 'So that that told me a lot. And one of my partners, a parks board members, invited me to go over to SEAL Beach. And that was quite revealing when I was introduced by one of the council persons to their approach to introducing and meeting the need of pickleball at SEAL Beach.'",
        "'speaker_3': 'Over half of the people that were participating there were actually Long Beach residents. So I thought that spoke volumes about the unmet need here in our city. For Pickleball, we have 67 tennis courts and one pickleball court. So we really embraced the willingness as volunteers for for these representatives to help form the Long Beach Pickleball Advisory Group'",
        "'speaker_3': '. And they really rolled up their sleeves. Over the past half year. We've done a lot of research. They've gone out to a lot of our parks and evaluated opportunities, what we call low hanging fruit, to look at ways that we could maybe with dual striping of of underutilized sports courts or actually transferring some other park areas.'",
        "'speaker_3': 'We have some multi-use sports sports courts that, again, because they're not heavily use are opportunities. But we also looked at some permanent dedicated pickleball areas and I think that's actually the best final solution or landing point. I know we've had some identified tension in some of our parks where we would encourage shared use.'",
        "'speaker_3': 'We've tried to post some suggested hours, days of the week where they could share that. But it's just a difficult thing when we don't we're not out in person managing our park sites. But this is a great request.'",
        "'speaker_3': 'I think certainly within the next two months, our group can kind of polish off what we think would be a citywide master plan for pickleball. But again, that will identify and again thanking the Long Beach Pickleball Advisory Group a lot of what we identify as short term wins.'",
        "'speaker_3': 'Probably the biggest breakthrough recently was having conversations with Long by Long Beach Unified School District to see if some of their court spaces might be opened up, at least on weekends for access for some of the use for Pickleball.'",
        "'speaker_3': 'So again, we'll pull this all together, but with appreciation publicly, I just want to acknowledge all of the the volunteers who have served and been really great resources and subject matter experts and. It's understatement to say they're passionate because they really love their sport.'",
        "'speaker_3': 'So that would be my update.'",
        "'speaker_4': 'Thanks. Thank you. Mr. Dennison, my understanding is that throughout this process, you've been briefing council members in the Park Rec and Marine Commission.'",
        "'speaker_3': 'Well, the Parks and Recreation Commission's monthly meetings, I've kept them apprized of all of our planning initiatives.'",
        "'speaker_4': 'Great. So I know we're going to turn it over to the audience in a minute. But as part of this report back, I'd love to know specifically what the feasibility is of turning some of our unused hockey courts into a pickleball courts, dedicated pickleball courts.'",
        "'speaker_4': 'And then I'm not sure if any council members have specific requests in terms of courts in their own districts. But I'd love for you to engage in some outreach before you come back with the plan, with some of the tennis groups to see about where we have two courts, like a tennis court and a pickleball dual use'",
        "'speaker_4': 'court about transitioning one of those dual use courses like Marina Vista to one pickleball court and one tennis court. But I don't want to do that without outreach to the tennis community. So if that could be included in the report back, that would be great.'",
        "'speaker_3': 'Certainly.'",
        "'speaker_4': 'Thank you. Thank you.'",
        "'speaker_0': 'All right. Well, go to public comment. Madam Clerk.'",
        "'speaker_1': 'There are 12 public comment speakers. Gary Ballard, Jacqueline Jones, David Anderson, Samuel Tanguy, Lee Swain, can you please line up?'",
        "'speaker_0': 'We don't necessarily have to be in order if you're up. You can just come forward. Okay. The first person to hear. Fantastic.'",
        "'speaker_2': 'Yes, sir. Hello. My name's Gary Ballard. I'm a USA AP Pickleball ambassador, and I'm also on the Long Beach Pickleball Advisory Board. I live down the street from College State Park, where I first learned what pickleball was and how to play.'",
        "'speaker_2': 'There's been a group playing there for 15 years. There's open play on Monday, Wednesday, Friday, Sunday from 9 to 12. During this time, anyone could show up and play in a game. Many other days and times, private groups can play on open play days.'",
        "'speaker_2': 'Many times we had 35 people show up to play at six courts. I've collected 122 names of players using the courts for pickleball, many of them three or four times a week. Up until two years ago, players had to bring their own nets in their own cars.'",
        "'speaker_2': 'Now we're fortunate enough to have a city approved storage box on site where we can store nets, balls, barriers and a leaf blower. We use the leaf blower to blow out the courts every other day. I have about three or four new people every week asking me how they can learn the new game.'",
        "'speaker_2': 'In the summertime, courts are going to get busier. We need more courts throughout the city to accommodate the amount of people that want to play. We are the only park in the city as restrained both tennis and basketball courts for multi-use with pickleball.'",
        "'speaker_2': 'We are the only park that has signage stating pickleball days and timed. Pickleball is a new, unique game where you can have fun at any skill level. You can show up by yourself and get into a game. It's very social and active.'",
        "'speaker_1': 'Mr. Ballard, your time has expired. Thank you.'",
        "'speaker_0': 'Thank you. Let's kick off, please.'",
        "'speaker_4': 'We were told you have.'",
        "'speaker_5': '3 minutes.'",
        "'speaker_0': 'When there's more than.'",
        "'speaker_5': 'Two and a half.'",
        "'speaker_0': 'Yes, it is 90 seconds when there are more than ten speakers.'",
        "'speaker_1': 'There are 12 speakers signed up to speak on the side of council protocols.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'You know, we do drugs.'",
        "'speaker_4': 'Yeah. We, we thought we.'",
        "'speaker_5': 'Dropped enough to have 3 minutes to speak.'",
        "'speaker_1': 'I mean, 12 speakers on the list, ma'am.'",
        "'speaker_5': 'Okay, well, come on up. This is Milano. I'm from the Marina Vista Group Dolphin. Stand up and recognize yourself. And my name is Jacqueline Jones. She's our youngest player and I think our oldest player is here. Surely I won't tell you how old she is, but I want to thank you for giving us this time.'",
        "'speaker_5': 'And right off the bat, I just wanna say I was really touched by the Martin Luther King Group. And we have offered as a pickleball community to go out anywhere in the park and share our sport with people, to support young people and to start up groups with retired people, whatever.'",
        "'speaker_5': 'So remember us when you start building programs at Martin Luther King, we're out there to volunteer. So my name is Jaclyn Jones and I live in District four and I was introduced to Pickleball in a free weekend clinic at a park a few years ago.'",
        "'speaker_5': 'And since then I've been playing four days a week because I just can't give it up. Today, I want to share about some of the things that happened at Marina Vista. Since of my time has been cut. I got to go really quick.'",
        "'speaker_5': 'I want to say there's four things that we need over there. We need pickleball lines and a gate added to the East Court installation of equipment box. It's urgent because I haul six nets around in my car and I physically can't do that much longer and permission to hang our paddleboards up and to have our signage changed'",
        "'speaker_5': ', to amend, to have pickleball there. So we support what Dennis has been doing to help us. And this is an activity that creates an environment that is healthy to anyone's community. We're a diverse group of people can come together and spend hours socially on the court and off the court.'",
        "'speaker_5': 'So Alan has some things she wants to give you. I don't know. She has to give to the city council, which seems to have to pass out to everybody. So thank you for sure.'",
        "'speaker_0': 'You can just pass it on to the clerk. Absolutely.'",
        "'speaker_5': 'Thank you. All right. Thank you. Let me jump back then. Okay. So I am a U.S. ambassador for Pickleball and I've been playing it bring to Vista exactly one year ago to this month, my husband and I invited a group of people walking by to join us to play pickleball.'",
        "'speaker_5': 'And last month, this group had over 500 participants. Yeah, 500 participants. And they're sending money with each Friday from 9 to 12. And during that time, I've been tallying up how many people are coming to play. We've had about 80 tennis players there and we get along great with them.'",
        "'speaker_5': 'Even though it is a first come, first serve situation. We have a lot of pickleball players that also play tennis and we switch back and forth with all of them, but we would like to have that file amended where it does say that Pickleball is allowed there because of this kind of growth.'",
        "'speaker_5': 'We started as Beginners, a group just this past week. We already have 12 people in that group of four volunteers that help support that. On two more additional days. On therefore days, we have two more days where people are coming to support those groups.'",
        "'speaker_5': 'So you can see how it blooms and it grows and it blossoms with interest continued to grow after that pandemic, it's clear that the permanent courts are needed at Marina Visa and to accommodate an increasing number of people.'",
        "'speaker_5': 'Somedays there's 50 players sitting around all on the inside edges of the court.'",
        "'speaker_1': 'Waiting for.'",
        "'speaker_5': 'Their turn to rotate in minutes. It's, I'm hoping, six sets of.'",
        "'speaker_4': 'Well, we.'",
        "'speaker_0': 'Certainly.'",
        "'speaker_5': 'Security box so I can leave equipment here. And I always feel fantastic.'",
        "'speaker_0': 'Thank you so much. Paddles up. All right, paddles up. All right, just. Just a moment. I just want to clarify. Thank you. I just want to clarify with the crooks. So we reduced the number so we can go to 3 minutes for everyone.'",
        "'speaker_0': 'Fantastic. Yes, sir. You're a next.'",
        "'speaker_2': 'David Anderson, an ambassador with the USA Pickleball Association and also a member of the Pickleball Advisory Group. Thank you very. Thank you very much, council members, for allowing the Pickleball community to speak directly to you. That's important to us.'",
        "'speaker_2': 'I've been trying I've been playing pickleball for a little over three years. It's one of the most exciting sports that I've ever played. It's very easy to learn and very addicting. I totally support the local efforts in various neighborhoods to beautify secure equipment, obtain proper signage, and add more courts.'",
        "'speaker_2': 'These are areas where Pickleball has taken root and flourished the Steve Lee area, Bayshore, etc.. But I would also like to see and promote pickleball in other areas of Long Beach that have not heard of pickleball or not or or is not as affluent as these areas.'",
        "'speaker_2': 'Long Beach is a very diverse city, and I do hope that this great sport can make its mark on other areas with permanent courts for all. As an avid pickleball player, including tournaments and recreational play, in order to play on premium courts, I've been I've had to drive as far north as Pasadena and as far south as'",
        "'speaker_2': 'Tustin, Newport Beach and Irvine. When I speak of premium courts, I'm talking about permanent courts, which are the gold standard in pickleball. If if the community has nice pickleball courts to play on, the players will come. The players will definitely come.'",
        "'speaker_2': 'I spoke to Steve Sutton, who is a regional director with the USA Pickleball Association before I came here. And he said, the bottom line is that if you build the courts, the players and the tournaments will come. Right now, Florida is the capital, the Mecca, if you will, of pickleball.'",
        "'speaker_2': 'They have they hold host tournaments, that number. We have registered players as high as 2000 or more. And they are some of their venues have 64 courts and they are building more courts as we speak. I would like to see Long Beach to be the mecca of pickleball for the West Coast.'",
        "'speaker_2': 'That's what I would like to see. That's that's that's that's my vision. And this is a huge moneymaker for Long Beach. I can't say that it's going to compare to the Grand Prix, but it'll be up there, you know, in time if we get behind this vision.'",
        "'speaker_2': 'In closing, one of the most memorable times excuse me that I've had in Pickleball was introducing Pickleball to the 49 year camp at Cal State Long Beach, working with the young people there. That was a very, very exciting because they are the future of the sport.'",
        "'speaker_2': 'I'd love to see. Long Beach to be a capital of a factory, if you will, for breeding good pickleball players. Thank you.'",
        "'speaker_0': 'Thank you. All right, next speaker, please.'",
        "'speaker_2': 'Good evening, counsel. My name is Samuel Tongo, and I'm a banker by profession and also a business owner with my latest venture being a pickleball based clothing, athletic, athletic clothing brand. My wife, Kelly and I moved to Long Beach from L.A. in 2020, mostly to be closer to the ocean.'",
        "'speaker_2': 'We just we discovered plenty of recreational activities in the area and got into paddleboarding, surfing, golf and even boating, hoping to make new friends who share our passions, which we did. But it wasn't until we discovered pickleball at the magic began to happen.'",
        "'speaker_2': 'Seldom do we leave the courts without exchanging phone numbers with other players and arranging to play again. Almost all our new friends in the past two years were met on the pickleball courts. And almost all our existing friends have since caught the pickleball fever.'",
        "'speaker_2': 'Unfortunately, most of them are white and weren't able to come up with this, but they sent me as a representative. Long Beach has an abundance of natural landmarks, but it's usually the people that make a place. A Long Beach is no different.'",
        "'speaker_2': 'For Kelly and I, it was pickleball that wove our social fabric around us ever more, more strongly to the Long Beach community. The past two years of the global pandemic have exacted a steep social cost. As the world emerges from the pandemic, we have much to make up for heightening the need to invest more in activities that'",
        "'speaker_2': 'will connect us, connect people and help us make up for the lost social years. They see that every system is perfectly designed to achieve its current result, and it's no accident that Pickleball is having its moment and growing as fast as it is.'",
        "'speaker_2': 'It's just a sport for a time, for such a time as this. They used to say, build it and they will come. But now conventional wisdom says if they come, build it. And so I implore this council to seize this moment and make the investment necessary to ensure that the residents of Long Beach have the outlet that'",
        "'speaker_2': 'they need for their pent up social, emotional and physical energy. And a new public square in which to build relationships that will drive our community forward. Thank you. Thank you. Let's figure, please. Good evening, city council members, and really thank you for your service.'",
        "'speaker_2': 'And Brant, thank you for all the work that you've put into this. My name is Lee Swain. My wife Elaine and I love Pickleball as just about everybody else and still in the audience does. Since the beginning of the pandemic, we noticed that people are seeking new outdoor activities that are easy to learn and fun for family'",
        "'speaker_2': 'and friends. Pickleball has satisfied this need by enriching social and wellbeing opportunities in many communities throughout Southern California. I've seen firsthand how much the sport of Pickleball has benefited people of all ages and backgrounds, both physically, socially, including my own family members.'",
        "'speaker_2': 'My request is that the entire Council support the development of both short term and long term, and a long term plan to develop first class permanent pickleball courts in Long Beach, basically to satisfy the current and future demand of this incredibly inclusive and fun sport.'",
        "'speaker_2': 'And if you haven't tried Pickleball, I truly recommend that you and your family try it. It's really amazing. Due to its popularity and rapid growth. With nearly 5 million Americans now playing throughout the country, many jurisdictions around the county or the country have already completely converted tennis courts into pickleball courts.'",
        "'speaker_2': 'I am respectfully requesting that you consider the addition of pickleball lines to many of the tennis courts throughout the city to provide maximum benefits to the community and consider permanent pickleball courts at places like Marina Vista, Somerset and College Estates Park that are already very well used for Pickleball.'",
        "'speaker_2': 'I've played at all those courts and they're really deserving of some permanent facilities. Thank you all very much for your support. I really appreciate it. Thank you, Brant, as well.'",
        "'speaker_0': 'Thank you. Next treatment, please.'",
        "'speaker_2': 'Hello. I just wanted to put things into perspective a little bit locally following the statistic that we were given that there's one pickleball court in Long Beach and 60 or so tennis courts. There are 26 pickleball courts in SEAL Beach.'",
        "'speaker_2': 'And SEAL Beach has a population of 1/20 of Long Beach. They have 26,000 people. And Long Beach has 470,000 people. So I'd really urge the Council to earmark some funds. One last thing. Pickleball is growing at 39% per year in the United States.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, Vice Mayor and City Council members. My name's Ed Tang. I'm a resident mystic three. I've been playing pickleball for almost three years now. I'm part of the Long Beach Pickleball Advisory Group. I really speak on behalf of the Long Beach residents that do not play in Long Beach because we don't have dedicated permanent courts majority'",
        "'speaker_2': '. The majority of us are high level players, over 50 of us. And we play anywhere from SEAL Beach, Tustin or Irvine, Newport and Huntington Beach. If there were permanent dedicated courts in Long Beach, I am sure that majority of us will come to Long Beach and play in Long Beach.'",
        "'speaker_2': 'We would love to see Long Beach to be the hub of Pickleball. We have the potential to do that. But a simple analogy if you're a high level basketball player, you're not going to play on a basketball court with a temporary basketball net and backboard that you buy at Walmart.'",
        "'speaker_2': 'You want something sturdy built specifically for basketball, and that's the same way when it goes for Pickleball. So today I'm going to make this brief. I look forward to the day where I and other Long Beach residents are not playing in Long Beach.'",
        "'speaker_2': 'Come back to Long Beach and play pickleball. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please. Well, just just a moment, Madam Clerk. What are you keeping track? Okay, we have three more.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'We have three more speakers Mark Leonard, Stephen Kelton and a malian brown. Is that correct?'",
        "'speaker_0': 'Yes. Okay. For more. Fantastic. Thank you. You have a source?'",
        "'speaker_2': 'Okay. Good evening, council members.'",
        "'speaker_6': 'My name is Joseph Anselmo, resident of Signal Hill and Long Beach for 22 years. I wholeheartedly support this plan for dedicated pickle ball court development.'",
        "'speaker_2': 'Honestly, the sport efficiently utilizes a very small footprint to include and engage a large number of players at all levels of age and skill. Accommodating four pickleball courts to one tennis court, the sport really provides and promotes exercise, competitive camaraderie, and just a lot of fun for a lot of people.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Let's keep the police.'",
        "'speaker_2': 'Hi. My name is Steven Kelton. I've lived in Long Beach since 1987. I'm all in favor of the permanent court site. Would be great. I want to speak more directly to Somerset Park. If you see the Signal Tribune, we had a reporter there Saturday.'",
        "'speaker_2': 'She did a great article in the Signal Tribune. We do encounter some issues with tennis players. We get there early. We all bring our own nets. We check out our courts, and then the tennis players say, Well, you get one hour.'",
        "'speaker_2': 'I said, Well, there's 30 people here. If we you know, if we want to play your game, we put 30 rackets up here and be here a week. We don't want to do that. We want to get along with them.'",
        "'speaker_2': 'We think immediate would be nice if we had multi-use to those courts, tennis courts. We also use the volleyball court, whichever available, and we just chalk it on when it rains, we reach it. Sometimes we have four courts, 25, 30 people playing there on Saturday morning at 9:00 Thursday morning, maybe 15 or 20.'",
        "'speaker_2': 'And we do run into actually three people, but I see their point. It's a tennis court. It says tennis. Doesn't say anything about pickleball. And I just would like to avoid the argument if we could put signs up identified as a multi-use court.'",
        "'speaker_2': 'And then if they're there, we wait our turn like everybody else. But it would be great for Somerset Park. I invite you all to come out. Beginners, new people, brand new. We have rackets you can use. Come on out and enjoy it.'",
        "'speaker_2': 'I think you'll like it. So that's my piece. View.'",
        "'speaker_1': 'Mr. Benefield? Robert Benefield, correct.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'He is the last speaker.'",
        "'speaker_2': 'So Robert being installed, I represent over 80 people who play regularly at Bayshore Playground. Last November, Parks and Recreation Marine resurfaced and re striped the baseball courts and allowed us to post signage and install a storage locker which greatly improved our utilization of the facilities.'",
        "'speaker_2': 'I want to thank you for that, Pickleball, as you've heard. Pickleball is the fastest growing sport in the United States. It creates community outdoors and the fresh air and sunshine, which we have a lot of here in Long Beach.'",
        "'speaker_2': 'It also is an economic engine, as you've heard, people make friends. They go out to dinner, to the theater and to concerts here. I've also I'm also on the Pickleball Advisory Committee, and we've worked with Brant on a master plan.'",
        "'speaker_2': 'I really want to urge the city to act quickly on the low hanging fruit. Simple things keep bathrooms open on the weekends. Add permanent courts at Marina Vista in Somerset, as you've heard, because we know there is demand there.'",
        "'speaker_2': 'Dual stripe basketball, tennis and sports courts for pickleball throughout the city. And when there is demand, then we can convert those to permanent courts and importantly, install signage wherever there's dual courts. Longer term, more expensive items should also be considered by the city.'",
        "'speaker_2': 'The Bayshore Roller Rink, as Councilwoman Price has mentioned, would be a great pickleball facility. Pickleball courts at Billie Jean King and Eldorado tennis centers would be great. And as I mentioned, Prim should monitor the dual striped courts. So where there's demand, we can then follow that up with permanent courts.'",
        "'speaker_2': 'Permanent courts are really about equity and fairness. So some of us can afford to bring our nets, but not the vast majority of of members of the citizens. And as Jacqueline Jones mentioned, we have volunteers ready to provide clinics throughout the city to help learn the sport.'",
        "'speaker_2': 'So on behalf of the residents of Long of Long Beach and our Pickleball Clubs, I want to thank you. And if I could just take a moment, maybe everybody here who's supporting item 30, if you could stand. Great.'",
        "'speaker_2': 'Thanks a lot. Thank you.'",
        "'speaker_0': 'All right. Because that's how to satisfy public comments.'",
        "'speaker_1': 'Public comment.'",
        "'speaker_0': 'Councilman Pryce, back to you.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. I'm going to turn it over to Councilman Mungo as the second part of the motion. I just want to thank everybody for coming out. Really appreciate it.'",
        "'speaker_5': 'So I've had the great pleasure to meet some of you via phone, via in person. And then more recently. Many of you know, my husband has become addicted, despicable. He was at College Estates Park on Monday morning. He's on paternity leave one week out of the month.'",
        "'speaker_5': 'And the first thing he does on Monday morning is he goes in place pickleball. So he is the I think you many of you have seen me sitting on the side of the court. My brother and him are out there playing.'",
        "'speaker_5': 'But I will say that when we were first introduced to pickleball from my sister in law and I love my sister in law greatly, she had a shirt on that said, I'm sorry, I can't. I'm playing pickleball. And I thought, what kind of crazy obsession could she have gotten into so young?'",
        "'speaker_5': 'And where are we with this pickleball thing? And they tried to argue that pickleball is the new tennis. And I said, my brother tried to argue that roller hockey was the new whatever when my brother was involved in roller hockey.'",
        "'speaker_5': 'But that fell out. And here we are. But Pickleball is on fire and going nowhere. I hope that Pickleball is considered for the Olympics. I feel that it is a amazing opportunity to really display a sport that goes from very, very young to very, very old.'",
        "'speaker_5': 'In my own neighborhood at the there's a school in my neighborhood surrounded by houses. And on Saturday, Saturday mornings, there are a bunch of Long Beach lifeguards, actually, who bring their nets onto the parking lot and start pickleball tournaments on parking lots now.'",
        "'speaker_5': 'And so I can see the growth and support, but those parking lots only work if you live close enough that you can get home and get a bathroom. And so some of the things that I've kind of talked about is that, yes, I believe in supporting the growth of pickleball.'",
        "'speaker_5': 'And I think we need to add at least 20 permanent courts across the city. But I'm typically not a big supporter of taking from one to give to another. And so what I would love to see is adding three tennis size courts to Eldorado, but chucking them out for 12 court, 12 pickleball courts, because pickleball courts are'",
        "'speaker_5': 'so much smaller. I'd love to see a reservation system and a trust fund where similar to tennis you pay. I don't know what it is $2.25 for an hour of a court time, which split over four people is almost nothing but that that money stays in pickleball because right now that money at the Eldorado Tennis Center pays'",
        "'speaker_5': 'someone to go clean off the courts every week, every day, every morning at 6 a.m.. There's a guy with the blower blowing off the leaves of the tennis courts. And while it's great that you do that today, that's not sustainable in the long run.'",
        "'speaker_5': 'There needs to be a system in place that is protected, that ensures that you have the long term resources to maintain the bathrooms and have the blowers and to replace the nets and to add shade structures that that tennis has always had.'",
        "'speaker_5': 'And tennis has two trust funds in the city. And I'd like to also see in this report back the discussion of a trust fund for Pickleball. I'd also like to see now that I've been to the Pickleball courts, I have seen how the reservation system goes and the competitive nature of getting on a court and what that'",
        "'speaker_5': 'looks like and how that all plays out. I have advocated in the city for many, many years about transparency of reservations, and we currently have a system where you can see when someone reserves a birthday party in the park.'",
        "'speaker_5': 'That's great. We need to have that same transparency of reservations for courts across our city, and it needs to be a system that's easy to use similar to, well, hopefully easier than our golf system, reservation system. But that gives a benefit to a resident card.'",
        "'speaker_5': 'Resident card holders in the city of Long Beach have a benefit to Long Beach golf courses. As a resident of the City of Long Beach, you should have a benefit of first priority to reserve pickleball courts in the same way that if you're a member of the military, my husband gets first reservation for a golf time at'",
        "'speaker_5': 'the Navy course, and we need to look at what that looks like long term so that Long Beach residents have that benefit to get these courts. So I'd like to see. 20 new courts permanent in 12 months. And then I'd like to come up with not all of them, but some of them having a reservation system that'",
        "'speaker_5': 'allows for I don't know if it's a dollar an hour or a quarter, whatever it is, to make sure that there's some money set aside that every year we're investing back in the growth of pickleball, because I see Pickleball taking the country by storm and by 2028, I don't know where we'll be, but I imagine that it'",
        "'speaker_5': 'could be one of those exhibition sports at the Olympics, and I'd be very supportive.'",
        "'speaker_0': 'All right. Thank you. So how does that my my support here what an enthusiastic bunch this is. And I'll tell you, look, I think from the last two presentations, it's very clear that residents are hungry for recreation across the city.'",
        "'speaker_0': 'And so I well, I certainly welcome this. And you never know what that spark is going to be. You know, I remember we did a community garden and all these volunteers who cared about community gardens came out and it became we started building community gardens everywhere because there was such enthusiasm and you never know what the spark'",
        "'speaker_0': 'is going to be. I like what Councilmember Mongeau said about, you know, ultimately become an Olympic sport. You know, Billie Jean King learned to play tennis at Home Park in North Lawn Beach. You never know where the talent is going to be.'",
        "'speaker_0': 'So someone's playing pickleball out in park. Who knows what the future could be. So, Councilmember Price, thank you so much. I think it's a great idea. And let's go ahead and go to our vote.'",
        "'speaker_1': 'Cantons and Das. Motion is carried.'"
    ],
    "Recommendation to request City Manager to work with the Long Beach Police Department to present a report to City Council on statistics and impacts of ghost guns; and, the feasibility of developing additional ordinances to criminalize the possession, sale, and/or manufacture of ghost guns and ghost gun parts.": [
        "'speaker_0': 'All right, we. Announce the vote. Okay. All right. Item 29, please.'",
        "'speaker_1': 'Communication from Councilman Price. Councilman Austin Recommendation to request city manager to work with the Long Beach Police Department to present a report to City Council on Statistics and Impacts of Ghost Guns and the feasibility of developing additional ordinances to criminalize the possession, sale and or manufacture of ghost guns and ghost gun parts.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_4': 'Thank you, Mr. Vice Mayor. And I believe our police department is here tonight to help do a presentation on this topic. So just a little bit of background on this topic. I am a member of the Public Safety Committee and I did request that this item addressing ghost guns specifically be presented to the Public Safety Committee.'",
        "'speaker_4': 'So and I started that process in January. And in late February, the committee heard a report on ghost guns. And the results of that presentation by the police department was eye opening. And frankly, in my opinion, one of the biggest public safety concerns facing our state right now.'",
        "'speaker_4': 'It may be facing other states, but I don't know the stats on other states. I just know that in the state of California, the number one public safety threat right now is ghost guns. So our police department brought back the presentation and staff presented to us some.'",
        "'speaker_4': 'Facts about ghost guns. And we talked a little bit about legislation that's going to be coming forth to the state for consideration. The item tonight that's before you has nothing to do with the state legislation. It really is just a report back for us about the feasibility of developing additional ordinances locally to criminalize possession, sale or manufacture'",
        "'speaker_4': 'of ghost guns. And I imagine that with this directive, city staff would go back then and work our police department, work with our city prosecutor to come up with potential legislation that we could take up in this area.'",
        "'speaker_4': 'Specific to go scans, those scans. A lot of people don't know what they are. And I know there's going to be a presentation by the police chief. Is that correct? Is there going to be a presentation tonight or.'",
        "'speaker_4': 'No?'",
        "'speaker_3': 'We weren't planning on a presentation tonight, but we can answer a couple of questions if there are some from the council.'",
        "'speaker_4': 'Okay. Sounds good. No problem at all. I know there was a presentation done at the Public Safety Committee on it, so it goes on. A lot of people don't know what they are, but they have. Obviously, there's no background checks required for ghost guns.'",
        "'speaker_4': 'There's no serial number required or on ghost guns. There's no mechanism, legal mechanism to obtain ghost guns. They're purchased online primarily. And we have seen just in the city of Long Beach alone a huge increase from 2020 to 2021 on the number of ghost guns that were seized in the city of Long Beach in 2021.'",
        "'speaker_4': 'We seized 185 ghost guns in the city of Long Beach as opposed to 83 seized in 2020. We had in terms of citywide shootings, 453 in 2021 and 396 in 2020. So we can see that there's an increase in shootings, but certainly a huge increase, double of ghost guns that are being used in some of the offenses'",
        "'speaker_4': 'that we're seeing. Unfortunately, the reality of ghost guns is that anyone can buy a ghost gun with no background check, making it easier for prohibited possessors or anyone intending to commit a crime to possess or access a gun.'",
        "'speaker_4': 'We've seen a number of California cities take important steps to increase enforcement on ghost guns, and I'm hoping that the council will join me tonight in requesting this report come back so that we can make a determination as a council whether or not to adopt some sections into our local city ordinance that address ghost guns specifically.'",
        "'speaker_4': 'I think the urgency of this item is clear in light of the events of the last few days, in light of the increase in gun violence and in light of the seriousness of gun violence and the impact that it has on victims and their families.'",
        "'speaker_4': 'And so I ask my council colleagues to support this item. Again, this item doesn't deal at all with state legislation. It's just talking about ghost guns and our efforts to legislate them and add more sanctions to the ordinances that can be adopted by municipalities to address ghost guns specifically.'",
        "'speaker_0': 'All right. Thank you, Councilman Austin.'",
        "'speaker_6': 'Thank you. And I second this this motion proudly. You know, gun violence is a it's a problem in our city. We're reading and hearing about gun violence every day. And they are real victims. They're impacted by by gun violence.'",
        "'speaker_6': 'And to the extent that we can minimize, eliminate access to these illegal guns or the manufacturing of these illegal guns, I think we'd be doing something tremendous. I I'm looking forward to this this report coming back, because I know we're going to be taxing our our police department to to be very innovative and and to solve something'",
        "'speaker_6': 'that no one has been able to solve up to this point with with an ordinance. But if we sit by and do nothing and we're not doing our justice to to the victims and we're not doing anything to improve public safety in our city.'",
        "'speaker_6': 'And so I give this this motion, my full support, and I say my colleagues do as well. Thanks.'",
        "'speaker_0': 'All right. Thank you. Is public comment on this?'",
        "'speaker_1': 'Yes, there are three people, Kathy. Family. Thank you. Brian Martinez and son, I can say thank you.'",
        "'speaker_5': 'Thank you, everybody.'",
        "'speaker_2': 'For being here. Let me start off with I am part of an organization.'",
        "'speaker_4': 'Parents of Murdered.'",
        "'speaker_2': 'Children.'",
        "'speaker_5': 'It's been around for 43 years. And I'm the leader of the Los Angeles chapter.'",
        "'speaker_2': 'Which covers all of L.A. County. I am not speaking.'",
        "'speaker_5': 'On behalf of the organization today. I am speaking on behalf of myself.'",
        "'speaker_2': 'Who've lost.'",
        "'speaker_1': 'My nephew.'",
        "'speaker_2': 'And a cousin to gun violence, and two other cousins were murdered in the harbor area.'",
        "'speaker_5': 'I say the organization that I am part of to validate that I.'",
        "'speaker_2': 'Am an advocate for survivors of.'",
        "'speaker_5': 'Homicide. And we need to take this very seriously.'",
        "'speaker_2': 'I'm going to throw a number out there. And I don't know if many of you know there are currently 5600 unsolved murders in the county of L.A.. Throw the factor of unaccountable, untraceable ghost guns and that number is going to increase.'",
        "'speaker_2': 'So I'm here to beg you to please do all that.'",
        "'speaker_5': 'You can do.'",
        "'speaker_2': 'So that I don't have to sit.'",
        "'speaker_5': 'Across the table.'",
        "'speaker_2': 'From another mother or a father or a brother or a child and listen to them year after year after year cry because.'",
        "'speaker_5': 'Somebody made a decision to take their life. My organization does not speak on gun control, but we're talking about illegal guns.'",
        "'speaker_2': 'So, yes, my organization.'",
        "'speaker_5': 'Is behind.'",
        "'speaker_2': 'This. This ordinance, we would say, yes, we got.'",
        "'speaker_5': 'To get these illegal guns.'",
        "'speaker_2': 'Off the street so that when a murder does occur.'",
        "'speaker_5': 'We can trace it back to whoever did.'",
        "'speaker_2': 'It and hold them accountable.'",
        "'speaker_4': 'For the murder.'",
        "'speaker_2': 'So I beg you to please keep that number in mind. I believe I'm.'",
        "'speaker_5': 'Preaching to the choir. I think you probably.'",
        "'speaker_2': 'All feel.'",
        "'speaker_5': 'The way you feel.'",
        "'speaker_2': 'I sat here and I listened about the.'",
        "'speaker_5': 'Martin Luther.'",
        "'speaker_4': 'King Park.'",
        "'speaker_2': 'Those kids.'",
        "'speaker_5': 'Need parks.'",
        "'speaker_2': 'So they're not on the computers. Later, trying to learn how to make ghost guns. Okay. That's the reality.'",
        "'speaker_4': 'Of where we're at.'",
        "'speaker_2': 'These kids have too.'",
        "'speaker_4': 'Much time on their.'",
        "'speaker_1': 'Hands.'",
        "'speaker_5': 'They don't have anybody watching over them. And they need.'",
        "'speaker_2': 'Good places to go so they don't.'",
        "'speaker_5': 'End up on this end of the spectrum. So I beg of you, please. I represent thousands of I sit on the National Board of Trustees for the organization. We represent thousands of homicide survivors across the country.'",
        "'speaker_4': 'But right here in L.A., there's quite a few.'",
        "'speaker_2': 'And I.'",
        "'speaker_5': 'Beg you to please do anything.'",
        "'speaker_4': 'And everything you possibly.'",
        "'speaker_1': 'Can.'",
        "'speaker_2': 'To get these guns off the street. Thank you very.'",
        "'speaker_5': 'Much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Thank you, Chairman and Council. My name is Brian. I'm the language deputy for assembly member Mike Gibson of the 64th District. Mr. Gibson was pretty elated when he saw this would be in the agenda today and he wrote a letter and I will not worry it to the Council on this subject.'",
        "'speaker_2': 'Letter of Support for Council Item 22 383 Report on Ghost Guns and Feasibility of Ordinance Strengthening Enforcement. Good evening, Council. I applaud and fully support the City of Long Beach in its process to create a local law that would criminalize the production and possession of ghost gun parts.'",
        "'speaker_2': 'Despite reforms to regulate them, Ghost continue to be a pervasive issue for local governments across the U.S. So much so that President Biden and the Department of Justice have proposed the rule change to federally redefine the term firearm to encompass its parts and kits such that they are regulated and require a background background check and serialization.'",
        "'speaker_2': 'Two days ago, we had a mass shooting just blocks away from the California state capitol. President Biden has once again called on for more reforms, this time for all of California to formalize a statewide band on ghost guns.'",
        "'speaker_2': 'Let me be clear this isn't a new issue. After numerous attempts, I was able to propel AB 879 into law. This California law required a state background check for individuals seeking to purchase firearms and receivers. It requires the Department of Justice to electronically approve the purchase or transfer of firearm parts through a licensed vendor.'",
        "'speaker_2': 'It also requires the sale of firearm frames and receivers to be conducted by a licensed firearm precursor parts vendor. Unfortunately, as the problem has worsened, it's clear that a more aggressive framework is necessary to prevent the continued proliferation of these weapons into our communities.'",
        "'speaker_2': 'Therefore, I stepped up to the plate and introduced just this year, AB 1621, which will completely ban ghost guns in every community statewide. Support from our city of Long Beach is critical in making this band a reality for every community in our state and joining alongside of other communities like San Diego, San Francisco and Oakland, which have'",
        "'speaker_2': 'levied citywide bands that make it illegal for any resident to possess or buy these weapons. We need all hands on deck to eradicate gun violence with our communities, wildfire in the 64th District and those alike. And as the assembly member always says, it takes a village.'",
        "'speaker_2': 'Thank you very much and I appreciate the opportunity to speak.'",
        "'speaker_0': 'All right. Thank you. Next speaker, please.'",
        "'speaker_1': 'Listen, I can play in the audience. He's the last speaker that concludes public comment on this item.'",
        "'speaker_0': 'All right. Back behind the real Councilman Price.'",
        "'speaker_4': 'Thank you, vice mayor. And I know I apologize. I thought the presentation that we had at public safety would be shown tonight. And that was my fault for my lack of clarity. But I'm not sure if the camera can pick up on this.'",
        "'speaker_4': 'But a ghost gun is just it's it can be made through a 3-D printer. It can be made using plastic. And now there are 3-D printers that can actually make make it using metal. But it's just different gun pieces that are molded and printed.'",
        "'speaker_4': 'And the most common model that we see right now is our Glocks that are made. And the interesting stat that I found in Long Beach last year was that of the ghost guns that were found to have been used in crimes.'",
        "'speaker_4': 'Two were in homicides, 21 in assaults, ten in batteries are threats criminal threats PC for 22, as we call them for and robbery carjackings, two in sexual assault, four in domestic violence, four in non-injury shootings. And this was the most interesting stat that I found, 116 were sold, possessed or illegally carried.'",
        "'speaker_4': 'That just means there's people, more and more people walking around armed with ghost guns, which to me was the scariest stat found property. There were five suicides. There were four. That's a particularly hard reality for me to understand because you can purchase these online with no background checks.'",
        "'speaker_4': 'And I don't know how many of you know of children who were youth who committed suicide just in the last few years as a result of COVID and used a gun to effectuate that intent. And I do know a youth that that happened to a very good friend of ours.'",
        "'speaker_4': 'And so the fact that they're easy, so easy to access is really concerning to me. I try really hard not to exaggerate things, but I will tell you, this is the number one ghost guns are the number one public safety threat facing our state because they're so easy to acquire.'",
        "'speaker_4': 'And all of the measures that we've put into place to make sure that the wrong people don't have access to guns are completely eliminated through ghost guns because anyone can purchase a ghost gun. And so I think we need to do everything we can as a city to try to regulate and sanction the possession of ghost guns'",
        "'speaker_4': 'and ghost gun parts. And I look forward to our police department coming back with a report that hopefully covers the same topics we covered at public safety and beyond. Thank you very much.'",
        "'speaker_0': 'All right. Thank you as well. We already had council comment. Okay. Let's go ahead. Talk to our vote, please.'",
        "'speaker_1': 'Councilmember under. Motion is carried.'"
    ],
    "Recommendation to direct City Manager to work with the Department of Health and Human Services to provide an update on progress of the Citys REACH Teams, explore the feasibility of expanding the program in FY 2023, and report back to City Council and the Public Safety Committee within 60 days.": [
        "'speaker_0': 'All right. Thank you. We're going to go to item 32, please. Thank you.'",
        "'speaker_1': 'Communication from Vice Mayor Richardson, Councilwoman Allen, Councilwoman Sara recommendation to direct City Manager to work with the Department of Health and Human Services to provide an update on progress of the city's REACH teams.'",
        "'speaker_0': 'Fantastic. Thank you. This request is a this is a request for an update from staff on an important program that the city has been developed in development for for quite some time. We know that the situation of homeless on our streets is incredibly significant and important, and we know from previous homeless counts that a significant driver is'",
        "'speaker_0': 'mental health and behavior abuse and substance abuse and things that require a certain level of of care. And in fact, 36% of individuals experiencing homelessness suffer from mental illness in our city. We began a few years ago looking at alternative models and initially was the heart teams and the heart teams were successful and and, you know, and'",
        "'speaker_0': 'we deployed them during the reconciliation plan. There was the framework for reconciliation, those significant calls for alternative response models. And one that continued to come up was cahoots. Cahoots in Eugene, Oregon, cahoots. Cahoots, cahoots. Well, the city didn't quite do cahoots, but we did something pretty close to it and we framed it as a pilot.'",
        "'speaker_0': 'And it was necessary. It was referenced within our plan. And and that pilot is finally up and going. But I can tell you, there's certainly you know, it's been about a year since we initiated this and we are very close to a launch and we know that we were expecting to hear an update.'",
        "'speaker_0': 'And so the idea here is we would like for staff to come back with a report rooted in data, tell us how the program is doing, what the next steps for the program is. Is there additional opportunities with some of the work that we're doing now around localizing mental health and bringing down additional support from the county'",
        "'speaker_0': 'and state? And could we? What is the city's plan, city's current plan, based on data to expand the program to meet greater need. And so we would love to to see this report come back to the city council, and particularly in the context of how we can expand the program within FY 2023.'",
        "'speaker_0': 'I think, you know, we've had we've talked about homelessness a number of times in the last, you know, few years. In the last six months, I think the entire city council has said this is a top priority for the entire city council.'",
        "'speaker_0': 'And it's April and we talked to think it was maybe January about this program. And so we would just like to have an update on where we are and, you know, see a more formal public sort of launch of the program and some plans on how, based on the data and analytics that we see, how we can'",
        "'speaker_0': 'have a greater impact within the community. And so that's the gist of this this request tonight. So I'm happy to make this motion, and I'll go to Councilwoman Sorrell.'",
        "'speaker_4': 'Vice Mayor. I support this item in the last public safety committee meeting. There was an item to do a report on the interdepartmental team in addressing homelessness, and we did get a little bit of information about how the team work.'",
        "'speaker_4': 'And I think it's so important that people do know how our interdepartmental team work and that most of the calls do come in to our BPD. But at the same time, a lot of it can go into the REACH team for an emergency.'",
        "'speaker_4': 'Or how do we send dispatch, you know, clinical social workers and many other people that can be the first responder. So I look forward in getting a more in-depth report back in how this will be set up and how it's going to go.'",
        "'speaker_4': 'So support this item. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Price.'",
        "'speaker_4': 'Thank you. And thank you so much for bringing this item. I know that we started first talking about these types of models back in 2017 with our item that was entitled Comprehensive Approach to Homelessness. And then of course, in 2020, we talked about reach specifically.'",
        "'speaker_4': 'But the question that and I think this is a great item and I look forward to the report back. The question that I have and I know I shared this with Tom and Mr. Chandler earlier today, sitting as the proxy on the Commission to End Homelessness in Orange County and going out with the Street Outreach Team on'",
        "'speaker_4': 'a regular basis. What can we do to include some more information on what type of flexible funding our street outreach teams have to assist those with whom they engage in the at the street level on diversion. And I'm not talking about criminal diversion, but I'm talking about diversion in terms of helping that in the context of homeless'",
        "'speaker_4': 'outreach, helping that individual go back to where they last felt safe, whether that's getting them a haircut, providing them new clothes, giving them a good meal, allowing them to get to a place where they feel confident again to go and do a job interview or go and see their family and things of that nature.'",
        "'speaker_4': 'The street outreach definition of of diversion. I know that one of the biggest challenges for street outreach teams all over is whether or not we have flexible funding for that. Do we have that? Do outreach teams have that?'",
        "'speaker_3': 'So we actually have Kelly Collopy and Teresa Chandler available by phone. If Kelly, you can start in. Tracy, you can jump in.'",
        "'speaker_4': 'Good evening, council members.'",
        "'speaker_2': 'So the funding that we.'",
        "'speaker_4': 'Have right now for the team.'",
        "'speaker_5': 'Is specific funding for positions. And then we do have access to some grant funding that we support with.'",
        "'speaker_2': 'Case management and ongoing support as we.'",
        "'speaker_5': 'Engage them.'",
        "'speaker_2': 'Within the department. So that's the funding at this time.'",
        "'speaker_5': 'So if.'",
        "'speaker_2': 'Folks are willing to engage with us, they're ready to come in, participate with the.'",
        "'speaker_4': 'Multi-Service Center.'",
        "'speaker_2': 'We sort of braid the funding that we have to be.'",
        "'speaker_4': 'Able to do.'",
        "'speaker_2': 'That huge management connection to service connects with the family and all the things.'",
        "'speaker_5': 'That that you're.'",
        "'speaker_2': 'Currently discussing along the way. But that's that's about as flexible as the funding comes that we have right now.'",
        "'speaker_4': 'Okay. Thank you for that. Ms.. Collopy, I hope that when the report comes back and I really look forward to reading it, that we can talk about what other options are available for that flexible funding. Because, you know, I've personally seen that flexible funding be the difference between someone being willing to accept a service and someone saying'",
        "'speaker_4': ', no, I'm not interested just because it's an additional measure of credibility and trust that gets someone to that next step. And so I'm just curious, you know, if there's any opportunities, I'm sure there are not opportunities that we haven't pursued, but if there are any opportunities that we can pursue in terms of grant funding or even working'",
        "'speaker_4': 'with private entities or non-profits to identify some of that flexible funding that can help with street level diversion. Again, not the criminal justice diversion, but in the context of outrage. So hopefully that's included and I really look forward to the report back and seeing what we can do to help support outreach teams.'",
        "'speaker_4': 'And as I've mentioned to the city manager on several occasions, figuring out how we can increase the number of reach teams and the hours that they work. It would be fantastic to have one in each council district so that they can do targeted engagement or directed engagement to particular hotspots for a consistent period of time over the'",
        "'speaker_4': 'course of, let's say, two weeks. I know from my own personal experience doing this work as part of my day job, I know that it makes a really big difference when there's that consistent, repeated outreach. And I know that our outreach team also believes that, but unfortunately the resources aren't there.'",
        "'speaker_4': 'So hopefully the council can help make those resources a reality. And thank you, Vice Mayor, for bringing this item.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_4': 'Thank you, Vice Mayor. I appreciate you bringing this item forward. It's a great item and I'm happy I've signed on to it. Staff is seeing very positive outcomes from outreach teams, and having greater availability to provide services would be helpful.'",
        "'speaker_4': 'We need to pay close attention to the data. You know what's working, what's not. And also so we can, you know what's working for directed engagement like council woman Price said, I think all of that is important. These teams have the potential to reduce the burden on important public safety resources by instead routing appropriate public safety and'",
        "'speaker_4': 'outreach staff. We already know that calls for service numbers have been increasing rapidly over the years, and by expanding our reach teams, we can help correct that trend and ensure that emergency resources are most appropriately routed. I'm also by expanding expanding our teams.'",
        "'speaker_4': 'We can better serve our homeless community as well. So thank you very much.'",
        "'speaker_0': 'Thank you. Councilman Austin.'",
        "'speaker_6': 'Yes. Thank you. So I like the idea in the spirit and the motion and the direction that we're going in. I just wanted to clarify with Steph, how long have we had reach in implementation?'",
        "'speaker_3': 'Kelly.'",
        "'speaker_2': 'At the read was funded and.'",
        "'speaker_1': 'A 21.'",
        "'speaker_2': 'Budget.'",
        "'speaker_4': 'It has been in.'",
        "'speaker_2': 'Implementation in at least for about the past year. It's been difficult to get the mental health conditions in public health. Nurse But we had two full teams. We had one public health. Nurse We even we are currently hiring that we have two mental health clinicians, currently a public health nurse, and then their engagement with our outreach workers'",
        "'speaker_2': ', they're currently engaged.'",
        "'speaker_4': 'Right now.'",
        "'speaker_2': 'Ongoing with 50 with 50 people experiencing homelessness.'",
        "'speaker_6': 'I so that's that's encouraging. And and I think if we've learned anything about our our homeless outreach and services approach here is that we have had to be flexible and adaptable to the circumstances and our resources. And so the I know the request, the item request for us to to look at expanding on this.'",
        "'speaker_6': 'I just wanted to know that we have the data to support actually doing that and moving forward. I think I think it it assumes that that our program is optimal and working to the to the expectations that we we want as a council.'",
        "'speaker_6': 'And so unless somebody else has seen data to to support does that council. Councilman Richards interview. Is there data readily available?'",
        "'speaker_0': 'I think the request is for some data, but I think Mr. Mota could probably talk about maybe how we would approach this.'",
        "'speaker_3': 'Yes. So. Which is something we are very excited about. We do think it's going to be a very effective model. It builds on all the homeless outreach that we've had before. So we've had always had homeless outreach workers that have been out on the street.'",
        "'speaker_3': 'And we have that data. We have some data from when Hart was doing this, but Hart was doing a little bit different. This is an enhancement on where Hart is. And so our plan is to bring this back.'",
        "'speaker_3': 'The request tonight is to bring back some additional data and show you what we've been able to accomplish so far. It is still just getting started. We're actually still waiting on equipment. The pandemic wasn't kind to us in terms of even just being able to order some of the equipment for the trucks and that type of thing'",
        "'speaker_3': '. We plan a major launch probably in the next, you know, month, month and a half to be able to really educate the public about this and about what they do and what they can they can accomplish. And then start looking at that data.'",
        "'speaker_3': 'And I've heard loud and clear from all nine of you about the importance of of the ability to to address issues with homelessness. And I'm also personally interested about trying to get more dispatch resources so that we have people you can talk to, not just during business hours, but maybe even outside of business hours, because a lot'",
        "'speaker_3': 'of the calls we get, we're already working on that case or we already have visited that person three or four times. But we need the ability to tell somebody that and let them know that that has been worked on.'",
        "'speaker_3': 'So interested in that. And then also in looking at the swing shift and trying to get resources that are not just in the morning hours but also in the evening and weekends. So we have a lot of work to do and we're planning to look at this in the budget as well.'",
        "'speaker_6': 'I think that's a great I certainly support the item and like I said, I support the direction. I just don't want us to jump into assumptions without ensuring that we are evaluating the data and making good informed decisions.'",
        "'speaker_6': 'And and if we need to tweak our, our model right to ensure that that we're getting the optimal results, we need to have that that flexibility to do so. Thank you.'",
        "'speaker_0': 'Fantastic. Thank you. Councilmembers in Dallas.'",
        "'speaker_5': 'Thank you, vice mayor, for for this item. And Councilwoman Allen and Councilwoman Sara, as the item mentions, our homeless crisis is a consistently urgent matter that requires an intersectional approach. In Long Beach, we are constantly addressing our homelessness situation through multiple approaches and often times because our teams are so busy doing amazing work, we fall short on'",
        "'speaker_5': 'communicating those city efforts and actions that are being made every single day. I think these types of updates are important because they help not only to identify every areas of possible improvement, but to also showcase ongoing projects. It also informs our residents about all the efforts that we are making as a as a city.'",
        "'speaker_5': 'I also do want to take a moment to thank our team for all the incredible work and outreach that they've done for our neighbors experiencing homelessness. It's really valuable work that they do on a daily basis. So thank you.'",
        "'speaker_5': 'Thank you for that. I think having them as an alternative response team to police is a critical step in reforming how we respond to crisis and ensuring our responses are aligned with the vision and we've heard from the public and with our racial equity and conciliation plan.'",
        "'speaker_5': 'I do have a question for staff or maybe for Kelly. If we've had again, it's a data question. If we have a number that we could share in regards to how many nine, one, one calls or calls have been made to our bridge team and our MSE team so far since each has been implemented.'",
        "'speaker_5': 'If that's something we have available.'",
        "'speaker_4': 'I don't.'",
        "'speaker_2': 'Have those data at this time, but it's.'",
        "'speaker_5': 'Something.'",
        "'speaker_2': 'That we can bring back as part of the.'",
        "'speaker_5': 'Report. Thank you. I think it was incredibly valuable to be able to bring this item forward. Many of our our neighbors are experiencing homelessness at. And we really, really need to make sure that we pay close attention to them.'",
        "'speaker_5': 'Those those people might be even suffering from mental illness. And I think that it's very, very important that we, as the city and city leaders look into that and try to provide as much resources as we can. So thank you very much for this item.'",
        "'speaker_5': 'Very supportive.'",
        "'speaker_0': 'Thank you, Councilmember Sabino. Thank you. I'd just like to add a component here. And I discussed this with the city manager yesterday and Theresa Chandler, but my colleagues didn't hear it and Kelly Colby didn't. But at a certain.'",
        "'speaker_2': 'Point, these cases.'",
        "'speaker_0': 'Can be handed off to the L.A. County Department of Mental Health.'",
        "'speaker_2': 'And that's where our office loses track.'",
        "'speaker_0': 'And city manager just mentioned, like a case might already be in the system. And that's great. But they're going to folks are going to.'",
        "'speaker_2': 'Contact our office. So maybe through reach, if they are updated.'",
        "'speaker_0': 'With what's going on with L.A. County, maybe that information then can get back to the counsel office.'",
        "'speaker_2': 'As an update.'",
        "'speaker_0': 'So that's point, Tom.'",
        "'speaker_2': 'I know you.'",
        "'speaker_0': 'Know what I'm talking about, so I think we're good. Thank you. All right. Thank you. I'll just summarize with I think I think there's a lot of exciting work happening around what we're doing. Councilman Suber, now, a few weeks ago had hey, how can we look at care court?'",
        "'speaker_0': 'Last year, we began a process of engaging directly with the mental health department around localizing mental health. And they're having those roundtables now and looking at what local control we can have. I think that's incredibly important. I think, you know, when we think about the work we've done on shelters, the work we've done on Project ROOMKEY, but'",
        "'speaker_0': 'really mental health is where we need to do work. And it seems like there's attention in the state. The county is engaged. We've got some innovative models. So I think the idea here is let's get this. You know, this program has been going for about a year.'",
        "'speaker_0': 'So it's time for the city to have, you know, a report, think about a data driven approach to how we can build on this program. I don't think it should be an arbitrary number of how many units or whatever.'",
        "'speaker_0': 'Let's see what the data says, the meters, and see what the gap is so that we can, you know, work toward that goal. I think what it is, is like having a comprehensive approach, a real comprehensive approach to really tackle the mental health crisis in the community.'",
        "'speaker_0': 'And so I want to thank you, thank you, my colleagues, for their support. And let's go ahead and go to our vote on this. Oh. Public comment.'",
        "'speaker_1': 'There is no reason for this item. For the record.'",
        "'speaker_0': 'It's no public comment. Fantastic. All right. Let's go ahead to our vote.'",
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Interesting. All right. There's one, two, three, four more items to go with. Have item three, please.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7177 and award a contract to All American Asphalt, of Corona, CA, for the Market Street Pedestrian and Streetscape Project, in an amount of $7,394,311, authorize a 12.5 percent contingency in the amount of $924,289, for a total contract amount not to exceed $8,318,600; and authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary subsequent amendments;  Increase appropriations in the Capital Projects Fund Group in the Public Works Department by $6,071,837, offset by $2,838,000 of State Local Partnership Program Funds (LPP) and $3,233,837 of Federal Congestion Mitigation and Air Quality Improvement Program (CMAQ) funds;  Increase appropriations in the Capital Projects Fund Group in the Public Works Department by $6,071,837, offset by transfer of $2,838,000 State Local Partnership Program Funds and $3,233,837 of Federal Congestion Mitigation and Air Quality Improvement Program funds from the Capital Projects Grant Fund; and  Accept Categorical Exemption CE 21-1": [
        "'speaker_0': 'All right. Item number 35, please.'",
        "'speaker_1': 'Report from Public Works recommendation to adopt plans and specifications and award a contract to all American asphalt for the market street pedestrian and streetscape project and a total contract amount not to exceed 8,318,600. And accept categorical exemption. S.E. 21-01-100 District.'",
        "'speaker_5': 'Eight.'",
        "'speaker_0': 'Thank you. Who's been moved and seconded and you want to say anything else when asked if.'",
        "'speaker_6': 'Sure. I'm happy to see this this motion and item come forward. It's been about eight and a half years in the making and something that many residents in North Long Beach, in my district, the great eighth District, have been looking forward to for many, many years.'",
        "'speaker_6': 'And so I would not do it just if I did not allow Mr. Lopez in Public Works segment, Mr. City Manager to give a brief report on this matter.'",
        "'speaker_3': 'Thank you, Councilmember Austin. We are extremely excited to be here today. This has been a huge priority. There are four major corridors that we've been really investing in strategically. It's been a market. It's been Artesia, it's been Anaheim and Studebaker.'",
        "'speaker_3': 'And this is the one that we're just so excited to be delivering today. So I'll turn it quickly to Eric Lopez. Thank you, Tom. Vice Mayor, members of the City Council. The limit of our Market Street project goes from city edge to edge, so it's one of our bigger corridor projects that we had in the wild in'",
        "'speaker_3': 'a while. 2.2 miles. Overall, we're looking at existing conditions that are deteriorated, are in need of major improvement, major investments from sidewalks to the roadway itself to path of travel, improved lighting. There's really a whole lot of different areas that we're going to be investing in.'",
        "'speaker_3': 'The all of these all of these improvements are made possible by a variety of funding sources that I will get to. But I want to show what some of these are going to look like. So here's an example of both buyouts at select locations.'",
        "'speaker_3': 'We're going to make the crossings at certain intersections safer, and we're also going to be able to build different classes of bike lanes to reinforce, depending on on where we're at, we're in Market Street. We're also going to be investing in high visibility crosswalks and rectangular, rectangular, rapid flashing beacons throughout the corridor.'",
        "'speaker_3': 'And a lot of path of travel improvements, a lot of sidewalk work, new curb ramps are relocating some of the fire hydrants. And we're we are going to be able to expand the length of sidewalks at various locations.'",
        "'speaker_3': 'Streetlight improvements, not just for the street, but also on the sidewalk and the pedestrian corridors. That's a that's an important part of the project as well. I'm not going to focus too much on on on the design, but we wanted to show at various locations the existing condition and with the improvement that we're going to implement.'",
        "'speaker_3': 'So it is going to differ from the L.A. River to Long Beach Boulevard. We have one solution from Long Beach well over to Orange Avenue. We have a different solution. And and there are slight variations as we go through the corridor.'",
        "'speaker_3': 'Major corridor projects are usually require various funding sources to really bring them together. And so we have a series of different sources that we've been able to accumulate in order to fully fund the project and allow us to proceed.'",
        "'speaker_3': 'The recommendation today is to award a contract to all American asphalt, and our target schedule is to break ground in May and our estimated completion target is around the fall of 2023. That concludes our presentation.'",
        "'speaker_0': 'So Councilmember, I'd.'",
        "'speaker_6': 'Like to just thank you for the presentation, but I would be remiss if I didn't thank the many residents who who advocated to to make changes started with the request for a street light. And it grew and the need grew and the working with staff, public works.'",
        "'speaker_6': 'And we worked with many folks over the years, many of them who are not with us today. But a lot of hard work and effort went into this with public outreach. And I think we've had, you know, at least a half a dozen or more public outreach sessions with residents.'",
        "'speaker_6': 'And this project will impact a number of neighborhoods in North Long Beach, the the heart neighborhood, the Jackson Park neighborhood, the Adams neighborhood, the in the Virginia Village neighborhoods and Sutter, all of these neighborhoods will be impacted. And I think it greatly the character greatly improved as a result of this project.'",
        "'speaker_6': 'So I'm excited to break ground and see the finished product and I would ask my colleagues to support this matter.'",
        "'speaker_0': 'Thank you. All right. I'm going to have my kudos here in the this is an exciting project. Congratulations, Councilman Austin. I know you and the community have worked really hard on this. And I'll tell you, between this project and Partizan project both happening this year, it's going to make a huge, huge difference.'",
        "'speaker_0': 'And so this is certainly an incredible upgrade, doesn't it tie in to the is there a connection to the river?'",
        "'speaker_6': 'There could be a connection to the river. I think it ends at the L.A. River. Absolutely.'",
        "'speaker_0': 'Absolutely.'",
        "'speaker_6': 'No, don't don't forget to mention that we did pretty good work on South Street as well.'",
        "'speaker_0': 'South Street was a little more, more to do, but absolutely lots of corridor. And you got to work cut out for us.'",
        "'speaker_6': 'And.'",
        "'speaker_0': 'Along looking right and the level that's right so so he says an on and I lot to do so thank you so much every public comment here.'",
        "'speaker_1': 'No public comment on the.'",
        "'speaker_0': 'Site. All right let's. Members please cast your vote.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract, and any necessary documents including any necessary amendments, with Petrochem Manufacturing, Inc., of Carlsbad, CA, for furnishing and delivering as-needed premix rubberized emulsion aggregate slurry (REAS) and related equipment, on the same terms and conditions afforded to the City of Los Angeles, in an annual amount of $1,000,000, with a 20 percent contingency in the amount of $200,000, for a total annual contract amount not to exceed $1,200,000, until the City of Los Angeles contract expires on December 31, 2022, with the option to renew for as long as the City of Los Angeles contract is in effect, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_1': 'Motion is carried eight zero.'",
        "'speaker_0': 'All right. 36, please.'",
        "'speaker_1': 'Report from Public Works recommendation to adopt a resolution authorizing city manager to execute a contract with petrochem manufacturing for a total annual contract amount not to exceed 1,200,000 citywide.'",
        "'speaker_0': 'All right, the second. Public comment.'",
        "'speaker_1': 'Dave Shukla.'",
        "'speaker_0': 'Dave Shukla.'",
        "'speaker_2': 'Good evening. I'm not too stunned, but the process by which this slurry is made.'",
        "'speaker_0': 'Is not too dissimilar.'",
        "'speaker_2': 'From what's made with the ash from the surf. And I'd just like to.'",
        "'speaker_0': 'Know.'",
        "'speaker_2': 'If this, uh. Our features of the built environment that we would like to have around the children and other growing things. Uh, you know, 2040, 2050 thereafter. Thank you. Thank you.'",
        "'speaker_0': 'Thank you, members. Please cast your vote.'",
        "'speaker_1': 'Motion is security at zero.'"
    ]
}