{
    "Recommendation to request City Manager to study feasibility and explore support or financing options in for the creation of a Latino cultural district and a mixed-use small business economic development hub significantly similar to the El Mercado de Long Beach proposal supported by Centro CHA, and suggest support from upcoming grants and revenue including recovery investment funds, Measure US funds, and other grants that support health and equity for our Latino communities.": [
        "'speaker_3': 'Public comment is complete. We're going to go to the items that have the most folks right now signed up. So I we do item 22/1.'",
        "'speaker_0': 'Item 22 Communication from Councilwoman Zendejas, Councilwoman Allen, Councilwoman Mango Councilmember Urunga Recommendation to request City Manager to study feasibility and explore support or financing options for the creation of a Latino cultural district and a mixed use small business economic development.'",
        "'speaker_3': 'Okay, Councilwoman Zendejas.'",
        "'speaker_1': 'Thank you, Mayor. At this moment, I would like to ask if we could please hear public comment on this item, if there is some.'",
        "'speaker_3': 'Madam Clerk.'",
        "'speaker_4': 'Yes. Our first speaker is Alan Armijo.'",
        "'speaker_3': 'All right. Good to hear.'",
        "'speaker_4': 'Yes. Please begin.'",
        "'speaker_3': 'Thank you. Hi, I'm Alan Ami Hope.'",
        "'speaker_2': 'Local business owner of Ami Enterprises, Inc. I'm calling in to express support of item number 21, Dash 018 and the Long Beach. The ongoing pandemic and protests for social justice have focused a spotlight on our communities of color, not because the events exposed disparities and inequalities in these communities, but because they proved the disparities and inequalities exist'",
        "'speaker_2': 'and are ongoing, if not systemic. Please read Jessica Container's Concept Paper Report on Ricardo The Long Beach. This project takes a lot of boxes for helping our Latino community achieve what a lot of people take for granted because of better access to opportunity.'",
        "'speaker_2': 'Keep in mind that Jessica did not write this concept paper overnight. It is a 20 year work of devotion to helping a Long Beach Latino community prosper and thrive.'",
        "'speaker_3': 'And whose time has come. I encourage the City Council to study, fund, implement and develop The Mikado of Long Beach.'",
        "'speaker_2': 'There's enough intelligence, talent and work ethic in the Long Beach Latino community to make this a success. But it requires financial and governmental support to get it off the ground. To sum up my support in an equation economic opportunity plus business and property ownership equals economic and social justice.'",
        "'speaker_2': 'It only gets better from there for everyone.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Chris Chavez.'",
        "'speaker_2': 'Yes, I may heard. Yes.'",
        "'speaker_4': 'Please begin.'",
        "'speaker_2': 'Yes. Thank you. Yes. My name is Chris Chavez. I am actually resident of the sixth district. I want to state my support for item 20 10182, which would start the process of creating as Mercado the Long Beach. This project will better serve languages Latino, Latina, Latin, its community, which comprises over 42% of the city's population.'",
        "'speaker_2': 'Working with a trusted community partner like Central Cha is vital in ensuring the Mercado is culturally appropriate. Inclusive and helps address the community's needs is also important to note that the Mercado could provide a convenient, accessible location for community organizations and services.'",
        "'speaker_2': 'Creating a place like the Mercado de Long Beach is important for historically underinvested. Neighborhoods such as Park is isn't a census tract that ranks in the 90 to 90 fifth percentile of column virus screens disadvantaged communities. Lastly, while measure US is a potential source for funding of the project, I urge you to carefully consider how any project'",
        "'speaker_2': 'addresses the community's environmental, health and or youth and economic employment needs. Given the limited funding. I do think that this is a good potential source for it, but certainly want to see that funding used in the most effective way possible.'",
        "'speaker_2': 'Thank you for your time.'",
        "'speaker_4': 'Thank you. Our next speaker is David Selzer. David Selzer.'",
        "'speaker_2': 'Mary Garcia, members of the city council and city staff. My name is David Salazar. I'm a resident of District five. I speak tonight as a longtime board member of Central Cha and the founder and executive director of the Long Beach Community Design Center.'",
        "'speaker_2': 'The creation of a remarkable mixed use project in a Latino cultural district is an idea whose time has come. The project has been talked about in the Long Beach, Mexican-American and Latino community since the 1980s. You have before you tonight is the.'",
        "'speaker_1': '2021.'",
        "'speaker_2': 'Class 2.0 version of that dream. The project has equity at its core. It will provide affordable housing, workforce development, health services, retail, commercial, all within a district that will showcase the city's vibrant and historic Mexican-American and Latino community.'",
        "'speaker_2': 'Presently, there is not an established commercial area that represents a city burgeoning Latino population in our government. Cultural district will provide identity and recognition for this population and can.'",
        "'speaker_4': 'Be integrated.'",
        "'speaker_2': 'Into the city's downtown, core and waterfront. The creation of place is critical at this moment in establishing a center, a hub for the Long Beach Latino community to call home. But it will also serve as a regional economic generator, offering residents, visitors and tourists an authentic cultural experience.'",
        "'speaker_2': 'In summary, the combination development of the Mercado Mixed Use Project and the designation of the Latino Cultural District will provide the following creation of a community of community, wealth and self-determination.'",
        "'speaker_1': 'Affordable workforce.'",
        "'speaker_2': 'Housing, entrepreneurial and small business opportunities and economic development. Mexican-American and Latino heritage recognition and identification and equity. And just as important, the creation of a place that promotes art, culture and social space. Thank you for your consideration.'",
        "'speaker_4': 'Thank you. Our next speaker is Jessica Quintana. Jessica Quintana. Our next speaker is Lourdes Ramos.'",
        "'speaker_1': 'Hello. Hello.'",
        "'speaker_4': 'Hi. Please begin.'",
        "'speaker_1': 'Okay. Hello. My name is Lord. This grandma signed the Brazilian SEAL at Mola. The Museum of Latin American Art here in Long Beach is an honor to support the proposal to develop a civility study to understand the need for a Latino district in Long Beach.'",
        "'speaker_1': 'We will also like to express our interest to be an active part of this process agrees align with our mission and enforce doors, inclusion, diversity and equity among all on the presented communities. In language, it is cause for celebration that at the time when the Mola began the 24th anniversary and after two years of planning for the'",
        "'speaker_1': 'future expansion of the museum, the possibility arise of contributing to the development of the great Latino District of Art Cultural Corridor that will provide more opportunity for the benefit of all in Greater Long Beach. We hope that we can building up this dream together.'",
        "'speaker_1': 'And thank you for your attention. Bye bye.'",
        "'speaker_4': 'Thank you. Our next speaker is Megan Anaya.'",
        "'speaker_1': 'Hello. My name is Megan and I am and I am speaking on behalf of Central Trust. Today I am here in support of the miracle of the Long Beach, a mixed use Latino Economic Development Cultural District. Now it's important to remember that we need to support our Latino community here.'",
        "'speaker_1': 'Our community our Latino community in Long Beach is a powerful and resilient force in the local economy. They represent over 40 nearly 43% of the city's population, with 198,872 citizens residing within the city. Now, these this population also represents 42.6% of the residential labor force.'",
        "'speaker_1': 'So the workforce in Long Beach and of the Latinos working in Long Beach, that's a 70% labor force participation rate, which is amazing in the economy. But we have to remember that in order for this group to continue to thrive and contribute to the local economy, we must proportionately support them by dedicating resources and allocating them towards'",
        "'speaker_1': 'projects like Medicaid or to make sure that there's continued success within this community. So to give you an understanding of what this community means to Long Beach, in our 2019 report, we discovered that of the $90 billion generated in the local Long Beach economy, 34.3 billion is directly contributed from Palm Beach working Latino residents.'",
        "'speaker_1': 'And of that, 13.7 billion was contributed by our Long Beach immigrant population in our Long Beach Latino resident immigrant population. So overall, the Latino population in Long Beach supports 38.1% of Long Beach total contribution to the greater region.'",
        "'speaker_1': 'And we need to make sure that we have a space dedicated and carved out to this resilient group because there are no existing spaces within the city to dedicate to our Latino youth families or small businesses or individual to make sure that they can have the strength and prosperity to continue to grow within our community.'",
        "'speaker_1': 'Additionally, we find that 16% of our Latino families are living in poverty. And that's representative of over 6273 families within the city. Further, there are additional economic disparities faced by our community that we hope that this Mercado and this economic district can help us support.'",
        "'speaker_1': 'And when it comes to digital access gaps, we see that our Latino residents have less digital access than our other residents within within Long Beach. We see that there's a health disparity among our Latino population, and this has only been exacerbated by the past year and the effects of the COVID 19 virus.'",
        "'speaker_1': 'And not to mention.'",
        "'speaker_4': 'Thank you. Our next speaker is Jessica Quintana.'",
        "'speaker_1': 'Hi. Good evening there, Garcia. Members of the city council. City Manager Tom Modica. My name is Jessica Quintana and I'm the executive director of Center Cha and we are so excited for this item to be presented before you today.'",
        "'speaker_1': 'I know you heard speakers before talk about all the needs of the Mercado project, but we just want to also provide how important this establishment of a Latino cultural district will serve to connect the development of the El Mercado mixed use development and become a designation that offers a vibrant collection of retail, commercial housing, art, cultural venues'",
        "'speaker_1': 'and businesses that respect the history and cultural values of the Long Beach Mexican-American Latino community. Presently, there is not an establishment commercial area that represents the city. Latino community, which stands at 42% and growing of the population. A cultural district will provide identity and recognition for this population and can be integrated into the city's downtown, core and'",
        "'speaker_1': 'waterfront. The creation of this place will not only be a showcase for the vitality and spirit of a Long Beach Latino community, but will also become a regional economic generator offering visitors. And tourists, an authentic cultural Latino experience.'",
        "'speaker_1': 'I just want to take this time to thank our two champions. I'd like to thank Councilmember Mary, Cynthia House and Councilmember Stacy Mango for being bold and taking this project forward. As you heard in previous comments, this is not new.'",
        "'speaker_1': 'This hasn't been discussed overnight. This initiative has been well over 25 years in our community. And so I just also want to thank Cindy Allen and Councilmember Roberto Ranga for signing on to this initiative, because it really takes innovation to be able to bring forward a project like this.'",
        "'speaker_1': 'And we are pleased to be working in partnership with our city, with our economic development, with the director John Kiser and Sergio Ramirez. Projects like this only come about through through community and public partnership. And so we'd just like to thank them for their innovation and understanding our community demographics and the need of how we are going'",
        "'speaker_1': 'to really look at how this pandemic has really impacted our community and looking at a long term economic recovery for our community. So I just want to thank you so much again. Thank everybody for their leadership. This means so much to our community and we look forward to moving this project forward.'",
        "'speaker_1': 'So thank you so much.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. Barb, back to you. Councilman's in the house.'",
        "'speaker_1': 'Thank you very much, Mayor. And I'd like to thank all of the people who spoke or in support of this item and met up over Long Beach is an exciting vision that has been happening for years in the city of Long Beach.'",
        "'speaker_1': 'We have one of the biggest and biggest Latino communities here in the city of Long Beach. So it is with no doubt why this would come up over and over throughout the years. I think that the timing is is perfect right now.'",
        "'speaker_1': 'I think it's it's long overdue. And it's time that we move with something for such a great project. It's going to be a mixed use project that would include and not be limited. And we have to tell them we're an item number 22 that they get through others.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_3': 'Someone's on the on the line. Please, please mute. Councilman, please go ahead.'",
        "'speaker_1': 'Thank you. Like I was saying that this project will not only be to restaurants, grocery store, commercial housing, entertainment, but also so many other social services that will be available. One of the most exciting things that is happening is that right now we're also working on the development of our Latino Cultural Center in the Cesar Chavez Park'",
        "'speaker_1': ', which is an amazing thing to be part of right now. So I'm really excited that we're going to be bringing this together side by side. I feel that this is perfect timing for it. I really want to thank Councilmember Mongeau for her contribution to this and Councilmembers Allen and and around that.'",
        "'speaker_1': 'Thank you so much for for joining in on the mission of this project and for councilmember long up for your vision as well on this project. I know that so many community members, especially Center Cha, have been working on this for a very long time.'",
        "'speaker_1': 'And so I just, you know, I'm I'm grateful that the time has come and I'm grateful that we are able to move forward on this item. I also wanted to to have a little bit of clarity on the on the funding that I know that part of the funding we were hoping that we could look at and'",
        "'speaker_1': 'measure us. And I know that measure us is mostly for four years and stuff like that and health and climate. But there are other, other appropriate funds that we could look into. So I don't want to limit ourselves.'",
        "'speaker_1': 'So as we do this to really be studies, let's not limit ourselves to the funding and let's explore all possibilities because this is going to take a really a city effort to create something like this. It's going to be huge.'",
        "'speaker_1': 'I can already see it. It's going to be attracting so many people, not only locally here from Long Beach, but it's going to be attracting people regionally. And I can I can see how much it's going to drive our economic our economics here in the Long Beach.'",
        "'speaker_1': 'I mean, just just imagining and just gives me so much excitement. So I'm really looking forward to it. And I'm to invite to hear from my council colleagues as well on this item, and I'll come back to it as well.'",
        "'speaker_3': 'Thank you. Customers in the US accountable mango.'",
        "'speaker_1': 'Thank you, Mayor. Thank you, Councilman Sun Hoss. I'm so proud of so many district residents who have really championed this for many, many, many years. I want to recognize Suzanna Edman and David Mercado and Carmen Perez. And I also believe Cynthia Cordero, just so many of our Latino Latina leaders have really championed this and it is their'",
        "'speaker_1': 'work that has come to fruition. I am just a supporter here in ensuring that their voices are heard and that we here can work towards ensuring that cultural districts across the city for not just the Hispanic community have been invested in, but at this time we need to focus that and the resources where they are most needed'",
        "'speaker_1': 'and the time has come, as Councilman Sun has said, for this community to have an area that really supports the growth and flourishing and respect. And I can't think of the word that I had in mind, but to ensure that that goes on for generations to come.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. But Richardson.'",
        "'speaker_2': 'They queued up to lend my voice in support of this this item. I think it's a great way to demonstrate creative ways to boost our local economy. We have to play to our strengths, our cultural districts, create a safe place for culture and music and art and food and commerce and exchange and overall community.'",
        "'speaker_2': 'And the more we can play to our strengths in areas, particularly in areas that have had longstanding economic issues or or over time, they haven't grown in the same ways that other areas have. This is a great way to invest in those communities.'",
        "'speaker_2': 'So I certainly support this. We had a good, healthy conversation in the Economic Development Committee today about this and economic zones and cultural zones across the city. And so I'm certainly happy to support this. I want to congratulate and thank council members and De Haas and your contributions, Councilmember Mongo and all the signers, because I think this'",
        "'speaker_2': 'is a great item and I look forward to walking through McCardle some day and with my girls and talking about the process to get there. So I'll certainly look forward to supporting this. Thanks.'",
        "'speaker_3': 'Thank you, Councilmember Ringo.'",
        "'speaker_2': 'Becky Baron. I want to thank all the councilmembers who have spoken in favor of this item. It's a wonderful we had a discussion about this about a week and a half ago or so. And that and that was part of that discussion as well as people have seen.'",
        "'speaker_2': 'This is not new. It's it's it's a project that it's been many years in the making. And it's one of those situations where the timing was perhaps not right 30 years ago or so. It was in 1930, mid eighties, where an idea like this concept of this would feature was first brought forward, but the stars were not'",
        "'speaker_2': 'aligned. And I think that now we have the stars aligned, we have the right people in the right places doing the good things. And I think that once we are concluded with the study, we can move forward with an actual project that will bring people to the region to learn more about the Latino culture.'",
        "'speaker_2': 'In all its grandeur and amazement, we have also a New Zealand American. I'd like to see how we can connect art into this project as well. I think it would be very important. This is art and food and culture is very important to the Latino community and it would be a wonderful addition to have that inclusion as'",
        "'speaker_2': 'well. So I'm very supportive of this and I'm so happy to be here. Be able to vote on this project is something that I didn't have an opportunity to do back nearly 30 years ago, which is coming full circle for me.'",
        "'speaker_2': 'So thank you for bringing this forward to Mary and Stacey and all the Crusaders on this. So it's a wonderful opportunity to move the community forward. Thank you.'",
        "'speaker_3': 'Thank you. Next up is Councilwoman Allen.'",
        "'speaker_1': 'Thank you, Mayor. I also want to thank Councilmembers and de Haas and Mongo and your ranga for bringing this forward. I'm just happy to support it. And I absolutely agree with so many of the comments that were made.'",
        "'speaker_1': 'It's the time has come to invest in this dream that so many people have advocated for years. So this is got to be a great day for all of you. You should be proud. Your hard work and your advocacy paid off.'",
        "'speaker_1': 'And I just strongly support small businesses and business hubs and the disproportionately impacted areas. And having been a small business owner myself, I know that there's a lot of value in these community business hubs, and seeing more minority owned businesses encourages local entrepreneurship and provides jobs and also help small businesses grow.'",
        "'speaker_1': 'And I also believe that this is going to be an amazing economic generator for the city. And I also would like to see other institutions, including Lola in the second District, included in the feasibility process. So, again, congratulations.'",
        "'speaker_1': 'You all happy to support this. Thank you.'",
        "'speaker_3': 'Thank you. I come to him in sorrow.'",
        "'speaker_1': 'Thank you, Mayor. I want to also express my support for this item and how excited I am to see this come in this form of a not only cultural center, but an economic development component, too, and really lifting out to address various equity issues in the Latino community.'",
        "'speaker_1': 'And I think it's just a great way to create inclusion in our city, to celebrate and really reflect the diversity and the population that has lived here and has contributed greatly to this amazing city that we live in.'",
        "'speaker_1': 'So I just want to also make sure to thank council members than they have for leading the item with Councilmember Roberto Urunga and Councilmember Mongo and Allen and as well as Central Park are leading the efforts. And I also just want to make sure we have a process that will also include many of the other various Latino'",
        "'speaker_1': 'businesses and nonprofit groups that I think will be able to just work together. In addition to Mal as well. So thank you very much and thank you to staff for working on this item as well.'",
        "'speaker_3': 'Thank you, Councilwoman Pratt. This.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I just wanted to chime in and say that I support this, too. And Councilwoman I mean, Councilman Ranga recently said something. He was obviously not the first to say it, but it really rings true on this.'",
        "'speaker_1': 'He said, build it. They will come. And I thought, you know, when we're talking about integrating our diverse communities in the city of Long Beach, how wonderful it is to have spaces that have their own character, their own offerings, their own vibe.'",
        "'speaker_1': 'And that celebrates the rich diversity and culture of all parts of our city, and have that as something that every resident in the city can enjoy. And I love that the small business aspect of it and supporting our small business owners enough in a corridor like this.'",
        "'speaker_1': 'So thank you very much, Councilwoman Sunday House and the Cosigners for bringing this forward. I wholeheartedly support it.'",
        "'speaker_3': 'Thank you and catch me. Ringgit, did you queue up again? I'm sorry about that.'",
        "'speaker_2': 'No. But I do want to have a final comment in the sense that the. Perhaps stop and look at the archives when we brought the Lusk Center back in around 1987, 88 around there. But we did the study with them.'",
        "'speaker_2': 'Many very well known to take in the area at the time. I led that that group and we came up with a plan. But again, it was the right time to witness people of a council that were supportive of it.'",
        "'speaker_2': 'And so it was sort of put on a shelf. And I was wondering if we could have staff look at the archives and dusted off and and see what would be presented back then as part of the place, giving the historical perspective.'",
        "'speaker_2': 'You know, the more things change, the more they stayed the same. And so I'm pretty sure that there's some material in there that would be of help in getting this project off the ground. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Thank you. And unfortunately, Councilmember Durango, you didn't have the last word. I guess we cued up the cued up after you. But I did want to express my my support for this this item, obviously. Thank you. Council members and de Haas Co endorsers of the sidewalk.'",
        "'speaker_2': 'Anytime we can celebrate culture and memory that with economic development, we're winning as a city. And so this is a a a motto I think that we should look at. I did I know we were all in support of this and we will vote in support of this.'",
        "'speaker_2': 'But I did have a question for staff. I'm related to the process in terms of how the feasibility study will be conducted and with stakeholder groups and would be this be engaging our Economic Development Commission.'",
        "'speaker_4': 'Yeah. Council member this is John Kaiser. I'm here with Sergio Ramirez and this is this is a great project for economic development. So typically what what we would do is we would start with a market analysis in taking a look at potential stakeholders as well as community needs and perform some community outreach.'",
        "'speaker_4': 'And then we would engage with some financial analysis to to see what the different recommended areas might require. Of course, we want to look at land use and zoning, so we would work with our partners over in development services to take a look at the different uses that are currently allowed for those areas that are recommended.'",
        "'speaker_4': 'And and then we would come back to the City Council with some recommendations. So it would take, you know, a couple of months to, to do this the right way and engage with the community and different stakeholders. But this is something that per the Council direction, we would get together with the city manager and put together a'",
        "'speaker_4': 'process with some of those timelines and resources that are needed as soon as possible.'",
        "'speaker_2': 'Well, thank you for that clarification. And I think I heard one or two of the commenters mentioned ideal locations. Have we? Are we there yet? Or is that part of the feasibility study? Yes. So I'll just tell you.'",
        "'speaker_2': 'I know of a couple of excellent business corridors in the eight district. That would be awesome candidates. I just wanted to throw that in there.'",
        "'speaker_3': 'Thank you. Customer Supernova.'",
        "'speaker_2': 'Thank you. I just wanted to thank all those who brought this forward. And I really do appreciate the longevity of the project here. The infrastructure project came up and 20 years on. And so I really appreciate the fact that 30 years old and no one lost sight of that.'",
        "'speaker_2': 'So congratulations and thank you for being able.'",
        "'speaker_3': 'Thank you. Councilman's in Dallas.'",
        "'speaker_1': 'Thank you, everyone, for your comments and your support on this. Again, there reconfirms how the timing is is perfect right now for for bringing a study forward on this amazing project. I also wanted to give a big shout out to some of the supporters that have been supporting this for a while, like Senator Lena Gonzalez, who continues'",
        "'speaker_1': 'to be a champion and continues to be supportive of the first District and having something like this in the first District would be super amazing. I also want to thank our school board member, Juan Benitez, for for his support on this item as well.'",
        "'speaker_1': 'The him being part of this district is very important to have his support. I also want to thank our trustee for one city college, Linda Chico, who continues to support this item as well. These are elected officials who continue to support the Latino community in any way possible.'",
        "'speaker_1': 'And I think it's super important that that we as a community unite and become very inclusive of all the organizations that represent Latino the Latino community, in order to make this a very successful project going forward. So I look forward to the visibility study and I can't wait to see what staff will come up with because I'",
        "'speaker_1': 'have full confidence that they are going to bring back something amazing working with all of the stakeholders. So again, thank you. Central charge for board meeting on this as well. And I look forward to working with you hand in hand on this.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you. And I just wanted to just add, of course, my thanks to everyone and most importantly, all the community members that have been advocating and really working and fighting for this project for so many years, particularly central GI and all the community organizations that have been involved.'",
        "'speaker_3': 'This process and especially thank you, Councilman in the House. I want to thank Councilman Mongo, who is very involved in the development of this and the other folks that are on the item as well. Councilman Ranga, Councilwoman Allen.'",
        "'speaker_3': 'Thank you, everyone, to supporting this this project. I think it's going to be fantastic. And thank you all for working on it so much. And with that, we've done public comment. Let's go ahead and go to a vote.'",
        "'speaker_4': 'District one. I District two. I District three.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District four. I. District five.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'District seven. I. District eight.'",
        "'speaker_2': 'District nine.'",
        "'speaker_4': 'I know she carries.'"
    ],
    "Recommendation to direct City Manager to identify within 90 days the additional resources needed to implement changes from the Long Beach City Auditors Library Services Performance Audit of 2020 Operations to meet the access and equity flaws identified.": [
        "'speaker_3': 'Thank you. Let's go on now and move on to item 17.'",
        "'speaker_0': 'Communication from Councilman Price. Councilmember Your Anger. Councilwoman Sorrow. Councilman Austin recommendation to direct City Manager to identify the additional resources needed to implement changes from the City Auditor's Library Services Performance Audit of 2020.'",
        "'speaker_3': 'Councilwoman Price.'",
        "'speaker_1': 'Thank you, Mr. Mayor. This item was coauthored by myself and Councilman Aranda, and it's really premised upon the auditor's findings in regards to our library services and areas where we can improve access and usability by our citizens and those visiting the city who want to use the library.'",
        "'speaker_1': 'It's especially important right now, I believe, for us to take a look at our library services and make sure that we are serving the public in the best way that we can. Given the increased reliance on technology being provided through our libraries for access for people, for employment, for schooling, and access to materials that are maintained by'",
        "'speaker_1': 'the library, for everyone who is looking to do a lot of the work and virtual learning that they're doing these days. I think it's really important for us to notice that we have an incredible library system in the city of Long Beach, but it is underfunded.'",
        "'speaker_1': 'We have not placed enough resources into the library to account for the changes in user trends involving the library and the changes in technology and the need for us to be able to be flexible and adapting to what it is that the users of the library need.'",
        "'speaker_1': 'One of the areas that's been very important to me in terms of library services is identifying hours for the library that are useful and meaningful to residents. I really laid out a great summary of our current system and how it is not meeting to the best of its ability, the needs of all residents throughout the city.'",
        "'speaker_1': 'And so this item really asks the city manager to look at our current library services to see what services can be reallocated or modified within our existing budget to improve access to the library by all of our diverse communities, and also to look forward to the years to come in terms of what kinds of resources will be'",
        "'speaker_1': 'needed for our library to be able to meet industry standards, best practices in the area of library services. So let me turn it over without saying too much more to Councilmember Ronda, who can speak to this item as well.'",
        "'speaker_1': 'And I do want to thank in advance our library services director who met with us and I mean her her feedback and her work with the libraries has been phenomenal. So, Ms.. Williams, we thank you for being open to some of these changes and being willing to work with us on how we get there.'",
        "'speaker_1': 'So I turn it over to Councilman Ronda.'",
        "'speaker_2': 'I came here.'",
        "'speaker_3': '100%. And you're teed up, Max, of course.'",
        "'speaker_2': 'Why is want to be glad I didn't get to build the protocol. Thank you. A customer of rice for introducing the topic and thank you for your work on this. As we get through the wordsmithing and cooperated trying to get the items as strong as we possibly could.'",
        "'speaker_2': 'I want to also thank Councilmember Sorrow and Austin for joining us on this item. It's important to have the support and also acknowledge that they also know that there has been some issues with this. Of course, this would be here without the great work of our city auditor, no doubt, and the hard work of our staff and'",
        "'speaker_2': 'looking into library services and and how we could make it better. It's not that we want to find any any issues or any areas of concern, but they do come up and they rise up. And some of them were quite, quite outstanding to us in regards to access, especially when we're not talking about all the hours, but'",
        "'speaker_2': 'in terms of access to non-English speaking materials as well as programs and and the lack of adaptive technology for persons with disabilities and the fighting system that we find has been very harmful, especially to communities of color. I would think that hopefully with the additional review that we're going to be doing, that we can look at those'",
        "'speaker_2': 'areas that are going to be most impacted, and especially to disenfranchized and communities of color. And one of the ones that stands out the most is obviously the the filing system by that is disproportionately harmful in communities of color.'",
        "'speaker_2': 'And what we might want to look at is basically as we eliminate fines, let's get the books back. I mean, basically, we're looking at areas of of of be we need our materials. And when there is a fine system that punishes people and makes people not want to returnable because of the fines and the way they accumulate'",
        "'speaker_2': 'and just become basically untenable, that basically we could look at a way of having a buy in forgiveness, just return the materials and we're forgiving or we refreeze it and you'll be forgiven. But we so that we can get the materials back and be available for reuse and other people can take advantage of those as well.'",
        "'speaker_2': 'So be I would be very strong in supporting a system such as that. But then again, we need to look at what's going on and how we can best implement such a program like that. I know that it would have some financial impacts for the library, but then again it's about materials, access and as well as being'",
        "'speaker_2': 'able to be a service to our community or that we can only be a safe haven for them to study, but also to to learn. So I'm looking at, well, as the possibility of getting more bilingual staff and obviously with bilingual material and being able to provide greater opportunities with technology as well so that we can expand'",
        "'speaker_2': 'and grow our library system as much as possible. So with that, I'll I'll leave it to my other colleagues. I know they want to come in as well. Thank you.'",
        "'speaker_3': 'Councilmember Zendejas. Actually. I'm sorry. I'm sorry. Who's next? Contrary. Ringo went next up. Yep. Comes from San Diego. Sorry about that.'",
        "'speaker_1': 'Thank you, Mayor. I really want to thank. My colleagues were bringing this item and our city auditor and staff for this, especially for their focus on addressing equity and access to our amazing libraries. Before I was a council woman.'",
        "'speaker_1': 'Part of my background is that I volunteered in our former main library in what was what has become the Center for Adaptive Technology, our cat center, working with the disability community on things like closing the digital divide and building access to city resources for people who may not be able to do so anywhere else.'",
        "'speaker_1': 'So I know firsthand how critical we services are. And it pains me greatly that that we don't have a library in our first district and that we still have such a long way to go to creating access for our community that deserves this in my district.'",
        "'speaker_1': 'As we work to expand the services available in our libraries, I think that we need to remember and address that there are many residents of our city that don't have access to libraries near them or near where they live.'",
        "'speaker_1': 'And in many cases there are the exact communities that are that would benefit greatly from having access to tools like computer labs with all the other services and resources that are libraries can provide as we continue to address everything through a lens of equity.'",
        "'speaker_1': 'I think that part of that should be considered how we can work on expanding our libraries to those who currently have the least access to libraries due to geographic or technology or language barriers. I know that funding is limited, and that is the piece of that of the conversation and one that has been a barrier in these'",
        "'speaker_1': 'plans in the past. But it is my hope that we can prioritize efforts as we begin to see the effects of federal relief spending. And we can continue to put the services first as we build our city back and stronger together.'",
        "'speaker_1': 'So I'm really thankful for this item. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Sara.'",
        "'speaker_1': 'You mayor. I want to thank our coauthors, Councilmember Women Price and Councilmember Ranga for bringing that item forward on this. Libraries have a very special place in my heart and childhood because it's one of a safe place I went to in order to get services and to be able to just have a place to go to while'",
        "'speaker_1': 'I was waiting for my parents to pick me up. And so I know that that's also true for many of the residents, the libraries that are in my district. I think the two most widely used is Mark Twain and BURNETT given the density of around the area.'",
        "'speaker_1': 'And so I'm very supportive of identifying additional resources that can allow us to address some of these critical issues listed. And we're seeing that obviously libraries during this pandemic is beyond just a place to check out books. But it has been a place that people have been using to connect to the Internet, to print out materials and'",
        "'speaker_1': 'furthermore just places for homework assistance. And I think it has the potential to do so much more to address many of the needs of the surrounding community, particularly even just for business owners as well, should they need, you know, workshops that are needed to help them recover, to even potentially down the line, just a variety of workshops'",
        "'speaker_1': 'that help meet the needs. So that's why I'm very supportive of this item and look forward to seeing report back in 90 days about ways that we can address it. So thank you so much.'",
        "'speaker_3': 'Thank you, Councilmember Austin.'",
        "'speaker_2': 'I thank you, Mr. Mayor. And I also want to thank Councilmember Price for bringing forth this very thoughtful item. I also want to lift up and thank our city auditor for in her office for doing the audit and making the recommendations.'",
        "'speaker_2': 'It just shows that our city auditor's office is is is hard at work and always looking to improve governance and efficiencies and in our city. I wanted to to ask, because I think most of the recommendations here are laudable.'",
        "'speaker_2': 'These are these are items, obviously, I signed on to in support of this item. So I support, but I wanted the city manager to just explain to the council, if you can, what steps have already or we are already doing through the budget recommendations for FY 21.'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Thank you very much, Councilmember.'",
        "'speaker_2': 'As part of the FBI 21 adopted budget, there was a direction to really study additional hours. The council was very interested in looking at what else we can do with our hours and our library system. There was a proposal in the F 21 budget to do something along those lines, but it was it just wasn't quite ready'",
        "'speaker_2': 'at the time for the council, I believe. So we are bringing that back. We'll have some additional information probably in the next couple of weeks. And then we've also been working really closely with the auditor on these, looking at doing as many as we can within our existing resources.'",
        "'speaker_2': 'And then we'll report back on what other resources we might need to take the next step through the F 22 budget process. Thank you. All right. Thank you. And I thought I remembered discussing library hours and looking at that, but that didn't make it in the process.'",
        "'speaker_2': 'That's great. I'm glad we're looking at it now. I'm sorry if I wasn't clear. I did for you. That was part of the point 21 I'm direction was not to move forward with the staff proposal at the time, but to then look at other models and come back with you with information.'",
        "'speaker_2': 'So that's what we are reporting back in the next couple weeks. Okay. Thank you so much.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Thank you. Council members pricing your engi and our auditor on this. I took a minute and it it's very interesting bringing it to my attention. I hadn't taken time to read it, but I read the entire audit and and I'll tell you something, certain things and I certainly appreciate, one, the fact that we're'",
        "'speaker_2': 'raising up and we need to do this better and more often. But we're raising up the needs of individuals with disabilities. And that's referenced in this item and is referenced here. The status and the efforts within our Library Services Department to do so.'",
        "'speaker_2': 'I also want to sort of elevate you and Councilmember Rosario mentioned this, but grow the library's continues to evolve. And we know that. I mean, people use it. The library's as a computer lab, a workforce center, all of those things.'",
        "'speaker_2': 'And the Obama library in my district has certainly been an example. We've done everything from community gatherings to, you know, everything has been the heart of the community because we've opened it. And so as we reevaluate some of these recommendations, I think we should take off the shelf.'",
        "'speaker_2': 'The conversation here was a proposal, and it was readjusting some of our hours. But what it did was. Placed social workers before the library in order to take an affirmative step toward providing more, more comprehensive services out of libraries.'",
        "'speaker_2': 'Now, with the exception of what Mary mentioned, council members say they have mentioned the first district. The libraries are generally in every part of our town, even in areas where we don't have other things like. You know, I learned recently that the West Side has no computer lab.'",
        "'speaker_2': 'North Long Beach has no workforce center. It's changing, but we all have libraries. So I would love to see as a part of this how we can make sure that we bring some of those elements, social worker peace, which didn't make it into the audit, but it has come up at city council.'",
        "'speaker_2': 'I think it was a year ago it came up to City Council as an effort identified for social workers and how to be social work workforce. Not quite sure, but I want to see some affirmative steps to providing services that are lacking in the community, because I think there's going to be much more needed and significantly more'",
        "'speaker_2': 'need for that in the recovery. So again, I think this is a great item and I'm happy to support it and I look forward to the report that comes back. Thanks.'",
        "'speaker_3': 'Thank you. Vice Mayor. Well, let's go ahead and go to public comment. As we go to public comment, I know that our city auditor, Laura Dowd, wanted to say a few words. So let me turn it to her and the clerk, if you can do public comment, please.'",
        "'speaker_1': 'Oh, thank you, Mayor. And I wanted to thank all the council members all for your very kind comments and supportive comments and for Councilwoman Pryce and Councilman Urunga and council member and Austin and Councilwoman Sorrell for this item as well.'",
        "'speaker_1': 'I just wanted to add how fortunate we are here in Long Beach to have 12 beautiful libraries that provide such valuable services to our community. One of the things I'm really pleased with on this particular audit was that our auditors conducted seven focus groups with community members and interviewed several stakeholder group representatives to understand the community needs'",
        "'speaker_1': 'and the community wants. So this we started this audit before COVID at a time when we were able to meet face to face with several of the focus groups and and listen to them and to their needs. And I want to thank also the our department head, Glenda Williams, for her support during this during this audit and'",
        "'speaker_1': 'the great input that she gave to us. And I'm I'm very pleased with these recommendations. And I will just say one thing that most of our recommendations there were 2929 of them in. And Glenda agreed with all of them.'",
        "'speaker_1': 'Most of the recommendations have to do with using existing resources that do not require additional resources. The one that does require that has to do with resources is the not collecting or waiving the overdue fines. But we found that the cost that's being spent on collecting fines really outweighs the benefits.'",
        "'speaker_1': 'The revenue of the revenue received that a portion of the library's time is devoted to collecting overdue fines and reconciling the money. And if this were eliminated, the staff time of the library clerk clerks could be reallocated to the patron services and provide more provide greater benefit to the patrons who need their services.'",
        "'speaker_1': 'So we are also recommended that they keep the lost or damaged items. So if somebody, you know, damages or loses something, that they would pay for that. But with the waiving of the overdue fines, we felt that this would eliminate that.'",
        "'speaker_4': 'Barrier for those so that.'",
        "'speaker_1': 'They so everybody could have access to the wonderful materials that our library has. And we also recommend that the library, you know, continue to promote themselves to the community and in our focus groups. Several of the people were unaware of all the wonderful services and programs that they offer.'",
        "'speaker_1': 'So we want to do a better job at promoting our wonderful libraries and everything that they have to offer to our community. So thank you again for this for your support on this.'",
        "'speaker_3': 'Thank you. Let's go to public comment, Madam Clerk.'",
        "'speaker_4': 'Our first speaker is Barbara Sosa.'",
        "'speaker_1': 'Good evening, Mayor and City Council Member. Me? Good. And you're here.'",
        "'speaker_4': 'Yes. Please continue.'",
        "'speaker_1': 'Thank you. I am Barbara Selzer, president of the Friends of the Library. Thank you for allowing me to speak with you this evening. The friends of the library are in favor of the recommendation, asking the city manager's office to pursue additional resources specifically for the library and to implement the audit recommendations.'",
        "'speaker_2': 'We.'",
        "'speaker_1': 'System has absorbed recommendations.'",
        "'speaker_4': 'Barbara Sosa. We'll go to our next speaker and come back to her. Our next speaker is Lizette Flores. And Lizette Flores. Please unmute yourself and begin. Our next speaker is Nicole Ballard.'",
        "'speaker_1': 'Good evening. My name is Nicole Ballard, president of the African American Heritage Society of Long Beach. Our organization supports the preservation of the African American Resource Area at BURNETT Library and the special collections within the Long Beach Public Library.'",
        "'speaker_1': 'I wholeheartedly support this item and thank City Council for bringing it forward. The library is needed now more than ever to support Long Beach families affected by the challenges of distance learning and record unemployment. The city auditor's recent report of the library adequately highlights the barriers to accessibility and equity caused by cuts made to the library's budget'",
        "'speaker_1': 'through the years. Our organization was in fact founded because of budget cuts back in 1997. Our wonderful director, Glenda Williams, the librarian and staff, do amazing work with the little resources they are given and need additional support to meet the increasing demand.'",
        "'speaker_1': 'Thank you for your time and consideration.'",
        "'speaker_3': 'Thank you. I'm sorry.'",
        "'speaker_4': 'We'll try Barbara again.'",
        "'speaker_3': 'Okay.'",
        "'speaker_4': 'Barbara Sosa.'",
        "'speaker_1': 'Hello? Can you hear me? Yes. Great. Sorry about that. Good evening, mayor and city council members. I am Barbara Sosa, president of the Friends of the Library. Thank you for allowing me to speak with you this evening. The friends of the library are definitely in favor of the recommendation, asking the city managers offer office to pursue additional'",
        "'speaker_1': 'resources specifically for the library and to implement the audit recommendations. We would be willing to help if we can. We all know the library system has absorbed reduction in its annual budget for more than 12 years, and yet the demands of the residents have only increased, especially from the underserved communities, the Asian, Black and brown and seniors'",
        "'speaker_1': '. And with the current pandemic crisis, library supporters are afraid it will take a long time to reestablish even the previous service levels for 11 branches and be made to be open to everyone five days a week. I could say more, but I know I'm speaking to the choir.'",
        "'speaker_1': 'The Mayor and city council have always been library supporters. Please pass this recommendation. Thank you for your attention and consideration.'",
        "'speaker_4': 'Thank you. That concludes public comment.'",
        "'speaker_3': 'Thank you. I just want to add again, I want to think, of course, first and foremost, that the auditor and her team and I've always shared with her that the the the great thing about audits and why we welcome them is because they're focused on improving services and making sure that we are making improvements to departments and'",
        "'speaker_3': 'that we have a voice and a group of folks that are always looking from a different perspective on how we can do better. And I think that's one of the great things for those of us that appreciate, like, good democracy and good government having a a full, robust city auditor's office with a strong auditor that is going'",
        "'speaker_3': 'through and performing these audits is really good government. And I just want to thank Laura and have thanked her personally many times on this this issue. But to her whole team, they work really hard. And Councilwoman Pryce, thank you.'",
        "'speaker_3': 'You've always been a strong supporter of the auditor and for all of everyone that signed on to this great item to bring forward. And we look forward to to this item as well. So with that, we do have a councilman Price, did you have any additional comments?'",
        "'speaker_1': 'No, thank you, Mr. Mayor. Actually, one thing I would like to make sure that the city manager is really prioritizing what changes we can make with our existing budget. Now, in terms of some of these access issues, and I know I talked with him offline about this, but you know, it may be that in terms of hours'",
        "'speaker_1': ', we need to do some surveying and data collection to figure out, you know, whether evening hours are preferred in one area versus weekend hours in another. Maybe we need to shift some of the resources. And I know he has committed to me personally that they'll look at all of that.'",
        "'speaker_1': 'But I just wanted to make sure that that I publicly stated that as well. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Please cast your votes. Real call.'",
        "'speaker_0': 'District one. I district to.'",
        "'speaker_1': 'High.'",
        "'speaker_0': 'District three. High. District four.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six. I. District seven. By District eight.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $1,500, offset by First Council District One-time District Priority Funds transferred from the Citywide Activities Department for the 2021 HOPE Latina Empowerment Day; and   Decrease appropriations in the General Fund Group in the Citywide Activities Department by $1,500 to offset a transfer to the City Manager Department.": [
        "'speaker_3': 'Thank you. With that, let me go ahead and turn over to the next item we're going to do item 14.'",
        "'speaker_0': 'Communication from Councilwoman Zendejas Councilmember Urunga recommendation to increase appropriations in the City Manager Department by 1500 for the 2021 Hope Latina Empowerment Day.'",
        "'speaker_3': 'Councilman.'",
        "'speaker_1': 'Thank you, Mayor. I just really wanted to thank staff and my colleagues for their support on this item. The COVID 19 pandemic has forced a lot of events in our city to be canceled and scaled back, which is why I think it's so important that we use the resources we have to support our community organizations as they'",
        "'speaker_1': 'continue to do the work that of activating our neighborhoods. This is especially true for Latino and Latina residents, and I'm so proud to partner up with the work that Hope is doing on behalf of our families and our city.'",
        "'speaker_1': 'I want to say thank you to hope. Thank you very much.'",
        "'speaker_3': 'Thank you. And there's a motion in a second by Councilman de house. Second because we ranga. I don't believe there's any public comment. Roll call votes.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four. MY District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven. District eight.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District nine.'"
    ],
    "Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $500, offset by the Fourth Council District One-time District Priority Funds transferred from the Citywide Activities Department to provide a donation to Partners of Parks for AOC7s Quarantine Food Project benefitting Fourth District residents; and  Decrease appropriations in the General Fund Group in the Citywide Activities Department by $500 to offset a transfer to the City Manager Department.": [
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you. Item 15.'",
        "'speaker_0': 'Communication from Councilman Super Na recommendation to increase appropriations in the City Manager Department by $500 to provide a donation to Partners of Parks for AOC Sevens Quarantine Food Project benefiting Fourth District residents.'",
        "'speaker_3': 'Controversial or not.'",
        "'speaker_2': 'Thank you. I'd like to thank the AOC seven Neighborhood Association for organizing this effort. And this will bring enhanced food security to Fourth District residents within their neighborhood association said. Appreciate your support.'",
        "'speaker_3': 'Thank you. And can I get a second, please?'",
        "'speaker_1': 'Second.'",
        "'speaker_3': 'Okay. Just make sure you go to the Q system. Second by Councilwoman Allen. There's a motion in the second. There's no public comment. Members, please go ahead and cast your votes.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'It's my.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'District nine. I motion carries.'"
    ],
    "Recommendation to request City Attorney to prepare a resolution in support of women, LGBTQIA+ and other employees who have filed complaints of harassment by various employees of the Metropolitan Water District of Southern California and supports the calls for a Joint Legislative Audit Committee.": [
        "'speaker_3': 'Thank you. Item 16, please.'",
        "'speaker_0': 'Communication from Councilwoman Price. Councilwoman Mango. Councilwoman Sauro. Councilman Austin. Recommendation to request City Attorney to prepare a resolution in support of MWD employees filing harassment complaints.'",
        "'speaker_3': 'Thank you. This is who is the lead author on this. He went second this councilwoman Price.'",
        "'speaker_0': 'Yes. Councilwoman Price.'",
        "'speaker_2': 'Yes, please.'",
        "'speaker_1': 'Thank you very much, Mr. Mayor, and I'd like to urge my colleagues to support this item. But before I make any of my own comments, I want to say first, is there any public comment on this item?'",
        "'speaker_3': 'I believe we have some. Madam Clerk.'",
        "'speaker_4': 'Yes. Our first speaker is Greg O'Shea.'",
        "'speaker_2': 'In the first District. Yes, sir. Thank you, Mr. Mayor. Honorable council members. But in this regard, see, I'm the president of the Water Management District Local to that city, and I want to express support for this measure. It goes without saying, given the reason that how difficult the difficulties that public employees face in the areas of sexual'",
        "'speaker_2': 'harassment and workplace. Discrimination. And I think it would be an expression of respect for the employees of the Metropolitan Water District and for your own employees, for you to take a stand against this sort of behavior and to let them know loud and clear that this will not work.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Daniel De La Cruz.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_4': 'Please begin.'",
        "'speaker_2': 'Yes. Good evening, Honorable Mayor and the city council. My name is Daniel Dela Cruz. I'm a resident of our district for formal ABC Local 3620 President and Current AC 3634 member. I'm here because of the situation that an article came out three weeks ago.'",
        "'speaker_2': 'An investigation by the L.A. Times revealed a pattern of rampant sexual harassment, bullying, discrimination and retaliation at the Metropolitan Water District of Southern California. This appalling abuse in the workplace must be thoroughly investigated, while the review initiated by the MWD board.'",
        "'speaker_2': 'OPI and committee is a positive start. M MWD workers need a full comprehensive investigation into any and all misconduct taking place at the MWD. Not a process that is limited in scope and may be inadequate. We cannot allow these severe problems to be quickly swept under the rug.'",
        "'speaker_2': 'Every worker deserves a fair, safe and equitable workplace. And if incidents of misconduct take place, their stories must be taken seriously. That's why today I'm joining MWD workers in calling for California state auditor to complete their own ideas into the abusive workplace culture at the MWD.'",
        "'speaker_2': 'Workers need the full comprehensive review into these matters that was promised and is so desperately needed. Abusers and their enablers must be held accountable for their actions. And the MWD must institute structural reforms that increase oversight to ensure reports of misconduct aren't ignored.'",
        "'speaker_2': 'A state audit is the only way to provide justice for these workers and to ensure this type of abuse never happens again. Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Gina Chavez.'",
        "'speaker_1': 'Believe me, Mayor Garcia. Oh, I'm sorry. Can you hear me?'",
        "'speaker_4': 'Yes. Please begin.'",
        "'speaker_1': 'Okay. Good evening, Mayor Christian Council members. My name is Gina Chavez and I'm a plant mechanic at Metropolitan Water District. I'm also the first woman and first Native American Hispanic graduate from the Apprenticeship Mechanical Program, one of two women still working in their field at MWD.'",
        "'speaker_1': 'And more recently, I'm one of the women who have come forward in the two 1221 LA Times article to speak about the corrosive work environment under MWD Executive Management. I'm speaking to item number 16 and continuing from Ellen Mackey's written comments.'",
        "'speaker_1': 'MWD cannot continue to waste ratepayers money on abusive management. Further background In November 2020, the Women's Caucus, together with three board members Sylvia Belen, Charles Trevino and Don Ortega, strongly requested an independent outside investigation of a culture of abuse at MWD.'",
        "'speaker_1': 'Not only the desert, but all the facilities. We specifically stipulated a thorough, full investigation that ranged freely to include every witness and issue raised since then. Not only were Trevino and Ortega removed, it seems this investigation itself has been compromised through interference from MWD board chair and MWD executive management.'",
        "'speaker_1': 'We are requesting this Council send a message to the MWD board that you, number one, support an independent outside investigation that is uncompromised and without interference. Two, to support the request for a state audit which complements the independent investigation.'",
        "'speaker_1': 'And three, support the SB 331 that nullifies nondisclosure agreements which silences MWD victims. As MWD faces the selection of a new general manager and increased legislative scrutiny due to the workplace abuses, it is critical that Long Beach is informed regarding these issues.'",
        "'speaker_1': 'Abusers and their enablers must be held accountable for their actions, and MWD must insist to structural reform that increases oversight to ensure reports of this context are not ignored. A state audit is the only way to provide justice for workers workers like me to ensure this type of abuse never happens again.'",
        "'speaker_1': 'We thank Council member Suzy Price and the rest of the Long Beach Council, city or City Council members to move and support Resolution 20 10167. In addition, I invite you to listen to an interview with Claudia Stamper on the KUCI Assa Leader from two 2321, and you'll hear more about her experiences firsthand.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you. Let me go ahead and go back to the council. I have council member Austin.'",
        "'speaker_1': 'Actually, Mr. Mayor. Can I say I wanted to reserve my comments till after public comment? Can I say a few words as a start? Thank you. Thank you.'",
        "'speaker_3': 'So much. I think we'll go to Councilman Price and we've go to Councilman.'",
        "'speaker_1': 'Thank you very much, Mr. Mayor. So as many well, most of the council members know now and members of the public who may not know, there have been recent reports, substantiated allegations by female and LGBTQ plus employees who are working in nontraditional female jobs of the Metropolitan Water District of Southern California regarding allegations of workplace harassment and'",
        "'speaker_1': 'bullying. The incidents have been highlighted in recent L.A. Times news articles, as well as discussed by Assembly members and state senators in our capital. Unfortunately, sexual harassment in the workplace and especially in the construction and building trade environments is well known and often reported reality.'",
        "'speaker_1': 'There are numerous white papers that have surveyed women in nontraditional roles and the experiences that they have that prohibit them from thriving in those environments. The reason this issue is important to me and why I've brought it forward is because what these women are requesting and again, several of the allegations have been substantiated.'",
        "'speaker_1': 'So this isn't at this point an issue of he said she said, but rather substantiated allegations that these employees really want to have a fair process in adjudicating. And that's really what I support. I very much support and ask my council colleagues to support a resolution that offers these workers, as we would want for any workers in'",
        "'speaker_1': 'any environment that's public serving, to provide a fair process that's objective and not designed to reach a particular conclusion. I know that the state legislatures who have weighed in on this issue have recommended that the Joint Legislative Audit Committee provide an oversight or a review of this particular issue in order to provide a fair process to the'",
        "'speaker_1': 'people who have been harassed and bullied and have raised those concerns. Now, I just want to make one thing very clear, and I know those who read the agenda items read this. I don't want to really repeat it to them.'",
        "'speaker_1': 'But just to be clear, this agenda item does not seek to interfere in any manner with the operations of MWD. It's not the role of the Long Beach City Council to tell another entity or another operation how to run its practices.'",
        "'speaker_1': 'But and nor does this resolution seek to prejudge the veracity of the allegations of bullying or sexual harassment or workplace discrimination. It doesn't even serve to render an opinion on whether any wrongdoing occurred. The purpose of the resolution is simply to demonstrate that the Long Beach City Council stands in support of and with the women and LGBTQIA'",
        "'speaker_1': 'plus employees who worked in these nontraditional roles and serve the public through their service, in their desire to receive a fair process and a thorough consideration of their allegations and concerns. We stand in support of their ask and their passion for having a fair process in which to voice their story and be able to have some spotlight'",
        "'speaker_1': 'on what they experience and that hope that that objective overview will result in a positive impact for these individuals as well as for the organization. So I ask my colleagues to please support this item.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'I thank you, Mr. Mayor. And I want to thank Councilmember Price for bringing forward this item and it really articulating why it's so important for us to support this. This request requesting a resolution in support of an intimate pendant audit at MWD, I think as Meredith.'",
        "'speaker_2': 'I am very disturbed and concerned by the recent press reports regarding complaints being really not fully investigated or that the feeling of that employees, that these complaints are not being fully investigated. These are are women who work in nontraditional work environments.'",
        "'speaker_2': 'When you say nontraditional work environments to understand where the Metropolitan Water District work environments are, the work sites are, they are in some of the most obscure places in our state. And that should be taken into consideration in places that are not easily accessible or or at all.'",
        "'speaker_2': 'And at this this city council has a strong history of supporting workers, women workers in distress and experienced in abusive work environments. These are very serious allegations based in the Metropolitan Water District that our city should take very seriously as well.'",
        "'speaker_2': 'And so I am happy to support this, I think.'",
        "'speaker_3': 'Thank you. Next up is on the kill list. Sorry about that. We have councilwoman in the house.'",
        "'speaker_1': 'Thank you, Mayor. And I am so very grateful to Councilwoman Price for bringing this item today. And these reports of harassment will be far from shocking to most, if not all, of the women listening tonight. And it's important that we voice our commitment as a city to changing that.'",
        "'speaker_1': 'It is my hope as a unified council and government and city government that we can demonstrate with our words and our actions that we have an obligation to end harassment against women and the LGBTQ community and everyone who has been a victim of mistreatment in the workplace.'",
        "'speaker_1': 'I have never been a big fan of women in nontraditional roles. And but these are some of the consequences that unintended consequences that happen in these roles, and that shouldn't be. So I'm very, very proud of Councilwoman Price for bringing this item forward.'",
        "'speaker_1': 'And I hope that the whole council is able to support this item going forward. Thank you.'",
        "'speaker_3': 'Thank you. Council member Ringo.'",
        "'speaker_2': 'Thank you, Mayor. As far as I'm concerned, any job for anybody is intolerable. It should not be tolerated anywhere. Employee. Supporter wouldn't say thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Allen.'",
        "'speaker_1': 'Thank you, Mayor. And thank you, Councilwoman Pryce and the Cosigners, Austin, Mongo and Ciro for bringing this forward. You know, items like this are just long overdue. And everyone should have, you know, should be working in a safe working environment.'",
        "'speaker_1': 'And what this resolution does, it sends a clear message that harassment of any kind is unacceptable and it will be investigated and it will not be tolerated. And I completely support this president and this resolution.'",
        "'speaker_3': 'Thank you, Councilwoman Ciro.'",
        "'speaker_1': 'You, Mayor. I want to thank Councilmember Price for bringing the item forward and having me join her and as well as the cosigner. You know, I'm just disheartened that even after we've had such strong vocal movement towards against harassment, that not only females but also LGBTQ, I feel class workers face.'",
        "'speaker_1': 'And so I I've appreciated that, you know, we are taking a stance. And I hope that all of my councilmember colleagues will support the item as well, that we continue to take a stance against sexual harassment in all workplaces and all industries, regardless of where they work.'",
        "'speaker_1': 'And I also just want to speak that at some point I hope that these roles within as we encourage women to work more in these STEM industries is that they become less of what is described for people as nontraditional roles and that they become traditional as somebody who went on the STEM pathway.'",
        "'speaker_1': 'I hope that we make it more inviting and that it may make it more inclusive for all genders to be able to work in a way where it doesn't distinguish them from what is traditional or not. So. So I am supportive of this item and thank you very much.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_2': 'Thank you, Mr. Mayor. So, you know, we're a large city and the region pays attention to the statements that we make. And, you know, this water district, it's a large regional water district. And we again, we're engaged in a number of different regional boards.'",
        "'speaker_2': 'And I think this makes sense to pass this resolution to state that, you know, this is something that certainly deserves a statewide audit. And, you know, the things accused the things accused are very serious. And we should be on the right side of this and encourage this agency and the state to take appropriate action.'",
        "'speaker_2': 'So I certainly think this is an appropriate move for us to make, given our significance in the region, second largest city in the region. So I think it's important for us to do and I'm happy to support this.'",
        "'speaker_2': 'Thanks, Councilmember Price, another great item. Thanks a lot.'",
        "'speaker_3': 'Thank you. That concludes the Council comments. We have done public comment and we will do a roll call vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. I. District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six. I. District seven. By District eight. District nine. High motion carries.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to submit a grant application to the California Department of Parks and Recreation for funding under the Statewide Park Development and Community Revitalization Program, for the first phases of the Drake Chavez Vision Plan Implementation Project and MacArthur Park Vision Plan Implementation Project (Projects); and, if awarded, execute all documents necessary to accept the funds in an amount up to $8,500,000 for each Project, for a total grant funding amount of up to $17,000,000 for the Projects.  (Districts 1,6)": [
        "'speaker_3': 'Thank you. We're going to quickly do item 20, please, and then we'll go back up to the last two items.'",
        "'speaker_0': 'Item 20 Report from Parks, Recreation and Marine Recommendation to adopt a resolution to submit a grant application to the California Department of Parks and Recreation for funding under the Statewide Park Development and Community Revitalization Program Districts one and six.'",
        "'speaker_3': 'Thank you. Have a motion by Councilmembers and House. Can I get a second, please? Can I get a second, please? Second by Councilwoman Allen. Councilman is in the house. Give any comments?'",
        "'speaker_1': 'Yes. I just want to say how excited I am about this grant application. And I'm unbelievably grateful to our director, Dennis and his team for the work that they have done on behalf of our parks and especially our great Chavez vision plant here in the First District.'",
        "'speaker_1': 'These are both areas of such high need in our city with so little access to green space. And I know that personally, the Drake Park mission plan is something I've been absolutely thrilled about since before I was on council.'",
        "'speaker_1': 'Seeing this project take its first steps towards fruition has been wonderful for our Willmore neighborhood and our Parks and Public Works team have done an amazing job with with the place, like the local park connection. We still have a lot of work to do and to address that an equal and equal equities in our city, especially as'",
        "'speaker_1': 'it relates to park access. But these visions will more well, we'll need a little bit more work, you know, and creating access to high quality, accessible and equitable park space in Long Beach is is something that we're working towards.'",
        "'speaker_1': 'So I'm really excited about that. Thank you all so much for your hard work on this item and I'm so incredibly excited for the future of this. So thank you.'",
        "'speaker_3': 'Mr. Motorcade. Did you have any anything you want to present on the staff side on this or.'",
        "'speaker_2': 'That's up to the council? We can do a short presentation by Mr. Brant or Mr. Dunn. Sorry, on this. It's both this and MacArthur Park and he can park. No.'",
        "'speaker_3': 'Let me go. Let me go to Councilman. Sorry was a second. Just some comments, councilwoman.'",
        "'speaker_1': 'Oh, no, I was going to ask if we could have stopped your presentation before then.'",
        "'speaker_3': 'Let's do that. Mr. Motor. After a short presentation.'",
        "'speaker_4': 'Mr. Dennis. Thank you, Manager, America, honorable mayor and members of council. Both of these projects earlier tremendous examples where establishing a shared vision by engaging with the community have provided the foundation for the pursuit of significant grant funding.'",
        "'speaker_4': 'So for for the direction of his vision plan in particular, should the department be successful in receiving the eight and a half million dollars in grant fund? It will bring some tremendous recreational amenities in terms of the early phases of the overall parks development, and it includes a whole array of things and especially to be appreciated during'",
        "'speaker_4': 'this COVID era by the community where there's a focus on fitness equipment, improved sports courts and athletic fields, landscaping, but also things like community gardens, I think for sustainability purposes and just the connectivity and giving people in some of the higher density neighborhoods, some open space and some opportunities to really build community in their neighborhood.'",
        "'speaker_4': 'Park MacArthur Park again is another great example. Over in Council District six of a similar process, we're developing a shared vision with communities. Input is once again providing the foundation for excellent appeal for an additional eight and a half million dollars in grants.'",
        "'speaker_4': 'In that particular park, there'll be specific renovation of the playground area and expansion of open play for both active as well as passive enjoyment in the park perimeter. Walking trails and multipurpose walkways are proving to be very important for individuals fitness.'",
        "'speaker_4': 'And we also look at investing in outdoor fitness equipment and other opportunities for, again, the community together to really become more resilient, getting to know their neighbors. So these are both excellent examples, but we do appreciate the council's support for us to pursue these grant funds.'",
        "'speaker_4': 'That concludes my presentation. Lester Energy Questions. Thank you.'",
        "'speaker_3': 'Councilman Sara?'",
        "'speaker_1': 'Yes, Mayor. I was wondering if we have public comment on this item. And then I would like to make my remarks. And that's okay.'",
        "'speaker_3': 'Sure. We do have public comment.'",
        "'speaker_4': 'Our first speaker is Chan Hobson.'",
        "'speaker_1': 'Hello? Hello? Do you hear me?'",
        "'speaker_4': 'Yes. Please begin.'",
        "'speaker_1': 'But every mayor, Robert Garcia, city council members and city manager, Tom wanted them. My name is Ken Hobson. I'm a resident of the city of long before for a year. I am the executive director of the Smart Parent Association.'",
        "'speaker_1': 'My office is in the district about a mile away from MacArthur Park. My oldest son grew up with that park. I just thought I'm 20. Specifically for city staff to find funding for the Park Vision Plan Implementation Project.'",
        "'speaker_1': 'MacArthur Park is my goal and it badly needed improvements to accommodate the community. The community within the one mile radius in the area makes up 17% of the population, making it one of the most densely populated area in the city.'",
        "'speaker_1': 'I was so happy to participate in the visioning process for the park because it never had a vision plan and I am so excited to hear that the staff involved will find funding to implement the plan. Thank you to the city along with Parks, Recreation, Marine and all the partners 87 Friends of the Park, the Los Angeles'",
        "'speaker_1': 'Neighborhood Land Trust and City Fabric for the hard work, participation and commitment to finishing the plan. Thank you to Councilwoman Farrow for her support and dedication to ensuring them through our path and quality of life for people in this state.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Mary Simmons.'",
        "'speaker_1': 'Yes. Good evening, Mayor Garcia and city council members. My name is Mary Simmons. I live in the sixth district and I fully support item 20. Specifically for city staff to find funding for the MacArthur Depart Vision Implementation Project.'",
        "'speaker_1': 'MacArthur Park is my park and that I go to and needs improvement badly. I actually live across the street from the park. This community, the community within one mile radius of the area, makes up 70% of the long, long beach population, making it one of the most densely populated areas in the city.'",
        "'speaker_1': 'I will say I was happy to be able to participate in the visiting plan for MacArthur Park because I'd never, ever had a vision plan. I'm so excited to hear that the staff will work to find funding for the implement to implement the plan.'",
        "'speaker_1': 'Thank you to moms. Long beaches, parks, regs, Marines, all the partners, AOC seven Fred, the MacArthur, Los Angeles Neighborhood, Land Trust, the fabric and all our local stakeholders for their hard work participation and. Commitment to finishing the plan.'",
        "'speaker_1': 'Let's continue to bring resources to a to the park and finish the plan. Two weeks ago, we had an amazing vaccination clinic at MacArthur Park. And I would like to commend Councilwoman Julie Sorrell, her staff, as well as the entire health department, for a job well done.'",
        "'speaker_1': 'We vaccinated 400 residents at MacArthur Park and thank you, Councilwoman Julie Barrow, for your support and dedication to ensuring we improve our parks and quality of life for the people.'",
        "'speaker_2': 'Of the Sixth District.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_4': 'Thank you. Our next speaker is Melissa Williams.'",
        "'speaker_1': 'Hi, my name is Melissa Williams and I live in the sixth district with my husband and my two children. And I wanted to speak in support of the finding funding for the MacArthur Park Vision Plan Implementation Project. As the other commenters have mentioned, this is a very dense part of Long Beach.'",
        "'speaker_1': 'Many of us live in multi-family homes without a lot of outdoor space for children and families to use. The park is kind of the center of our neighborhood and it is in dire disrepair. In spite of the condition the park is in, it still continues to host very important cultural and neighborhood events such as the vaccine clinic'",
        "'speaker_1': 'that Mary mentioned. I would I was very excited when I found out that there is a vision plan to improve the park. So I'm really happy that the city council and the city staff seem willing to support those efforts to find funding.'",
        "'speaker_1': 'And I think that this kind of thing is especially important in the pandemic with the children not in school, to have a place where families can go. I want to thank all also the partners. Long Beach Parks and Recreation and Marine, the AOC Seven Neighborhood Association to do really wonderful work around here.'",
        "'speaker_1': 'Friends of MacArthur Park and the Los Angeles Neighborhood Land Trust and City Fabric for all of their support to helping to make our our district better. And also Councilwoman Shirley Sara, for all of the great work that you've done in our area to really improve conditions and equity for our residents.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you. Our next speaker is Rocio Torres.'",
        "'speaker_1': 'You. Good evening, Mayor, and good emergency council members. My name is Joe Theaters. I live in the second district and MacArthur Park is my childhood park and it is still my park. Believe it or not, 47 years I've been here and I've never had a vision in crime for my part.'",
        "'speaker_1': 'So I support item number 20 specifically for City to find funding for MacArthur Park's visioning plan and implementation project. I was glad to be able to participate in the process for MacArthur Park Visioning Plan because it had never been done before.'",
        "'speaker_1': 'Thank you to the city of Long Beach, Parks and Recreation and Marine and all the partners that champion for our Park 87 Friends of MacArthur Park, the L.A. Neighborhood Land Trust and City Fabric for their hard work and participation and commitment for finishing the project.'",
        "'speaker_1': 'Thank you for Councilwoman Susie Saal for continuing to champion for our park. She helped us with the visioning plan and information that we needed. And MacArthur Park is a beautiful park in a beautiful place. Let's continue to reactivate our park.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Back then to go back to Councilwoman Sara.'",
        "'speaker_1': 'Thank you, Mayor. And I want to just thank all of the committee members who made their public comment. And I feel that they've said a lot of things that I would have said and that I continue to want to have them lead this process, as they did with the visioning, with our partners.'",
        "'speaker_1': 'So so I want to thank again, just reiterate, thanking the studio staff at Parks Rec and Marines and our amazing neighborhood group, AOC seven. That's just really been, you know, making sure that we address so many of the issues in our parks and our neighborhoods.'",
        "'speaker_1': 'And the Friends of MacArthur Park and the L.A. Neighborhood Land Trust and City Fabric for helping to really just get feedback from such a wide variety of groups. I saw many seniors sitting with younger generation and talking about what they really like to see at this park.'",
        "'speaker_1': 'And I also want to mention this is also my neighborhood park. I live in the 9.13 area. It's really like within walking distance from me. And I'm just disheartened that we continue to have porta potty bathrooms that have been there for a long time to variety amenities that I think could be much improved, which is why I'",
        "'speaker_1': 'really look forward to working with our partners on the ground, as well as our city staff to look for funding so that we can make improvements and really improve the quality of life of everyone around the area. So thank you so much.'",
        "'speaker_3': 'Councilman Allen. Now?'",
        "'speaker_1': 'Yeah, I didn't have any comment. Sorry about that.'",
        "'speaker_3': 'No problem. I mean, I just want to add great projects both obviously. Certainly that the Drake Chavez project has a special place in my heart. Having worked on that, in fact, in my predecessor worked on that project as well.'",
        "'speaker_3': 'And it's been a long time coming just building that part kind of piece by piece, and it looks so great now. I love seeing the soccer fields, love seeing the connections, how well the Willmore neighborhood is and such a great job.'",
        "'speaker_3': 'And the community with that and folks like Kathleen and Jim and Cheryl and and so many others that have played such a vital role in in getting that park to where it's at a and Diane and so many others so just happy to see this where it's at.'",
        "'speaker_3': 'So with that, I'm sorry. The councilman. Thank you.'",
        "'speaker_1': 'Thank you. I just want to our staff where we were on budgeting to replace and repair the bathrooms so that they won't have porta potty bathrooms.'",
        "'speaker_2': 'This time. I got it. We do have a budget. A project was added into Measure A, I believe, about a year and a half ago, something like that. And it's in design and it's more important.'",
        "'speaker_1': 'Wonderful. So I'm just going to speak to and I know after I made this comment last time, I got a text from Council Vice Mayor Richardson supporting what I'd said, and I think that it's important to say it again.'",
        "'speaker_1': 'The park bathrooms are part of a critical infrastructure across our city for our families. That was prioritized by this council in a previous council action related to measure A for other measure funding as it became available. And as I said in the Infrastructure Committee meeting earlier today, when when other proposals are brought forward that are in opposition'",
        "'speaker_1': 'to the original intent of the Council, we should also at least be brought the list of things that are not getting funded that would have been funded by the previous council action. Because when you see projects like this one that are just so critical to a community like park bathrooms, I can tell you today I was at'",
        "'speaker_1': 'a park and I saw multiple city staff stop on their break because they need to take a bathroom break. And they're an infrastructure across our city, not only for families, but for our city workers. And some of them are in such horrible disrepair that we just need to continue to invest in these park bathrooms across our city'",
        "'speaker_1': '. They're just too important. And so thank you to the community who partook in the visioning process. It will come out to be amazing, but those amazing amenities are only possible when bathrooms function and are kept and maintained in an appropriate manner.'",
        "'speaker_1': 'So thank you so much to everyone for all the great work and congratulations to Councilwoman Sara. It'll be a great, great project.'",
        "'speaker_3': 'The Mercedes. Cast your votes. Roll call.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six. I District seven. By District eight.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Ocean carries.'"
    ],
    "Recommendation to request City Manager to identify and implement health and safety protocols to allow the Mayor and City Council to resume in-person Council meetings within 30 days.": [
        "'speaker_3': 'Thank you. With that, we are going item 18, please.'",
        "'speaker_0': 'Communication from Councilman Austin, Councilman Super and Councilman Mongo. Recommendation to request city manager to identify and implement health and safety protocols to allow the mayor and City Council to resume in-person council meetings.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Right. Thank you, Mr. Mayor, and thank you for indulging me. I want to thank my colleagues, our council member, Supernova and Mongo for joining me on this item. I think it's been on now been almost a year since we've been meeting via teleconference, and there's certainly good reason for that as we needed to avoid gatherings as a'",
        "'speaker_2': 'result of the COVID 19 virus. But many of us, as we have experienced over the year, would participate in city council meetings remotely. There are frequent technical barriers to our current set up. We've seen numerous challenges, whether it's dropped Internet or phone connections, actually mixing both speaking one muted outside distraction and of course, the inability for the'",
        "'speaker_2': 'public to actually see us or for us to see each other as we engage in deliberations. Unimportant city matters, as are. The vaccination process is moving forward, including with most of us on city council. It is important that we begin having this conversation about how we begin to return to conducting the city's business in person.'",
        "'speaker_2': 'The goal here is to improve transparency and promote good government while being able to work in a more collegial manner. As city council members and elected officials, this recommendation is not meant to put any city employees, any of our legislative staff or staff in that matter, or the public at risk.'",
        "'speaker_2': 'The council meetings are currently being conducted with the limited number of city staff in the council chambers, as is while also observing safety protocols. And so we're simply asking and I'm simply asking the city manager. These protocols can be implemented in a way that would allow our body or mayor council to also be president one location as'",
        "'speaker_2': 'we conduct our city business. There are other cities as well as the state legislature in Congress. I think that we can look to to provide some models as to how this can take place. And I'm actually pleased to have see some additional steps being taken over the past few days that would actually help provide additional transparency for'",
        "'speaker_2': 'council meetings beyond the current model. I want to thank you, Mr. Mayor and Tom, for thinking and working to provide video access to the public. I do believe that this will be a step in the right direction. But I also want this this item to move forward as Long Beach and our region continue to move forward with'",
        "'speaker_2': 'vaccinations and reducing the spread and risk of COVID 19. We should be engaged in discussions as to how we should, and we are engaged in discussions on how we are open in our schools, our workforce and our economy.'",
        "'speaker_2': 'And as we're having those discussions, we should also be considering how we can safely begin to reopen and reengage with transparency in our city government. And I believe we need to plan accordingly. And this is more written in a way, in requesting the city manager to give us a plan and, of course, move it forward so that'",
        "'speaker_2': 'we don't. So we have some some direction. I look forward to the discussion this evening on the item and our request council support.'",
        "'speaker_3': 'Is there is there a second on the motion? Second buy comes from mango. Comes from a mango.'",
        "'speaker_1': 'No, thank you. I want to thank Councilmember Austin for bringing this item forward. I know that on some committees we're able to see each other, but the public can't see us. I think that there's a lot of transparency that comes with the ability to see one another.'",
        "'speaker_1': 'I was at my field office today in the park and many residents very far apart popped by and said hello and are feeling very protected by their vaccine. And I know that not all of our city staff have been able to get that vaccine yet.'",
        "'speaker_1': 'However, I'm sure that the city manager can come up with a way for all of our employees to be safe and for there to be additional transparency. Thank you.'",
        "'speaker_3': 'Thank you. Councilor Marie Ringo.'",
        "'speaker_2': 'Thank you, Mayor. It's have a couple of questions and then a couple of comments. Where are we right now in the tears? Are we still in the purple way for days? Yes. L.A. County, of which Long Beach is tiered for for those types of openings, is still in the purple tier.'",
        "'speaker_2': 'Is there any expectation there will be going to be a Renteria offensive? Potentially. We've been tracking the trends for the county and if it continues on the same downward trend, we could reach the seven 400,000 case limit. You know, the next probably week or two weeks and then there's a two week process to two opens later in'",
        "'speaker_2': 'March, potentially we could be in the red. And where are we in regards to scheduling or vaccination? So that we were able to early on identify a number of employees as emergency workers. That was a very difficult exercise.'",
        "'speaker_2': 'You know, we want to get all of our employees vaccinated. We were hoping to do all 6000 right up front, but clearly there was not enough vaccine to do that. We went through a prioritization process and looked at employees that were emergency responders and also ones that were really dedicated to COVID efforts and were able to get'",
        "'speaker_2': 'a number of them done. Over the past week or two, we were seeing a lot more vaccine coming out. We're also getting the ability now to classify more as emergency workers. And we do believe the state is also going to starting expanding some of those near those categories, hopefully in the next week or so, so that we'",
        "'speaker_2': 'can begin to do more. So right now, I would say more than half of our employees do not have access to the vaccine. I would just give you some examples about probably most of the department directors that attend meetings are not vaccinated.'",
        "'speaker_2': 'Some are, but a lot are not, and some of their support staff are not as well. So we still have a ways to go before we can have, you know, all of our staff able to be vaccinated. Okay.'",
        "'speaker_2': 'Is there any requirement since this is a change to some work in the working environment of our employees? Zero requirement for us to get our unions to the challenges of find this meeting for or whatever we have to do, meet and confer.'",
        "'speaker_2': 'Anytime we're changing working conditions, we look at each one individually. Some of the staff who operate know this. You know, the council chambers, you know, have been operating the council chambers, but obviously in a teleconference format and not a full format.'",
        "'speaker_2': 'So we do need to talk about any major changes with our unions. I would make that determination and then sit down and do some meeting. Okay. So I'll read you correctly that we have not had a discussion of of it.'",
        "'speaker_2': 'We have not done any meeting. Confer on this now. Okay. Well, if we are not fully vaccinated, we have not had a beautiful immunity, so I can't stay away. So I would if I can, I would like to make such a motion to go to a video call to that topic until that time when we can.'",
        "'speaker_2': 'We're going to talk face to face with it.'",
        "'speaker_3': 'Okay. Think just just to be clear, so contrary to so I think you are second to the motion to just do the video. Is that what you said exactly?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Okay. Is there a second on that motion? Vice Mayor Richardson That's the second version. Richardson of Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. And, you know, I think we can. I want to start off just asking staff just how would you go back to the original motion? Because I don't want to dismiss the sentiment here. I think the sentiment here is that you want to get back we want to get back to in-person meetings because of the'",
        "'speaker_2': 'value that that it brings. And I think the readiness that I have is that I think that should be guided by both health and logistical health guidance, logistical guidance. And so I want to ask more specifically to our city manager, what would be the logistical or health concerns with returning within 30 days, the in-person meeting?'",
        "'speaker_2': 'So we've been taking a look at this. There are a number of things we would have to do to be able to resume in-person meetings or new video. It is it is easier to turn on video using the current WebEx system if we just use the exact same system that we're all using now, we're able to then'",
        "'speaker_2': 'turn on that video if we bring back the council in-house. We would need to do a couple of things. We'd have to run a video system of the cameras in the chamber so that everyone can see that. And that takes certain staffing.'",
        "'speaker_2': 'We would then need to have a call in line as well for city staff, because we would have to have a number of staff still who aren't vaccinated and are comfortable coming in, be able to call in and then have the public line as well to make sure that they have that.'",
        "'speaker_2': 'So that does take some technological support. We also want to make sure that all of the council have, you know, for the video option, have the access to a good, strong Internet connection and have that tool that you need.'",
        "'speaker_2': 'Often it's easier to do video and not audio and not just video. And so that's something we got to work on as well. And then as raised and we got a note from our unions today that I think you want to confer and discuss some of this.'",
        "'speaker_2': 'We would need to do that as well. Great. Thank you. So I would say I think the sentiment the sentiment is right. I think two things would need to happen. I would just ask Councilman Granger that the fact that he's n but I think, you know, we're part time, our staff is full time.'",
        "'speaker_2': 'You know, Congress, state legislature, L.A. City, they're all full time. The dynamics are completely different. So to go back to in-person meetings, I think we would need to actually talk with you. We definitely need to do that. So I would say, can we include one for staff to begin that conversation?'",
        "'speaker_2': 'Because we don't want that to delay the process once we get to the place of reopening. I think secondly, as it relates to the video, I think that's again, something we can do now. I think that's what the substitute motion is.'",
        "'speaker_2': 'I think the video we can do, we can do that. I was ready to do that already. I think we do that now. But the in-person meetings, we need to figure out those logistical issues and we need to to make comparison to things.'",
        "'speaker_2': 'I would ask you them compare and then give us a to run for on what considerations need to be factored in in order to pull the trigger. So is it is it certainty? Is it vaccination details? Is it, you know, how we're going to handle public comment, all of those things, putting the two front four.'",
        "'speaker_2': 'So we do we have a better picture of this. And so those will be the two additions that I would offer to Councilman Rankin.'",
        "'speaker_3': 'Read Manga.'",
        "'speaker_2': 'Was that a political question? That's a that's a friendly one to meet and confer and to to do a true form for on what needs to happen. Yep. Well, I guess I wasn't clear. My line of questioning was obviously that we need we need to step back to maybe we need to have a meeting with the unions'",
        "'speaker_2': 'and we need to work out the logistics of of the meetings. And until those are addressed and I feel safe and our staff feel safe and go to in-person meetings. But if if going to a TFF is essential to clarify this paper, I certainly support that.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Okay. So that's the motion in the second on the floor. Let me move on to the next next speaker councilman's in the House.'",
        "'speaker_1': 'Thank you very much, Mayor. Like Councilmember and Vice Mayor Richardson said. I think that the original motion, you know, I do agree with the sentiment. I think we're all ready and willing and eager to to go back to our city chambers and conduct our meetings.'",
        "'speaker_1': 'I think a year has exhausted all of us. But I think that we need to do that with all the safety measures in place. And right now, I don't think it's safe. I also think it's very important, since our staff would be with us, that they also are vaccinated.'",
        "'speaker_1': 'If we're asking them to come back. So I am supportive of the step motion. I know I've been pushing for video for several months now and so I'm glad that we are looking into that right now. I know that also one of the things that I've been advocating for is easier access to public comments.'",
        "'speaker_1': 'I know that it's it's easier for residents who are more tech savvy to be able to access public comment. But I know that even in my district, even the most tech savvy residents, that I have also had difficulties.'",
        "'speaker_1': 'So I look forward to being able to explore that option of being able to have easier access to public safety. And I know that I'm working right now with city clerk to figure out easier ways of being able to bring about easier access to our public comments.'",
        "'speaker_1': 'Because I do think that it's very important that we are on video and that we are seen through video. But I also think it's equally as important that we hear from our constituents and that we give them the opportunity to be able to do a public comment if they so do wish to do so.'",
        "'speaker_1': 'So I'm I'm excited that we're moving forward and hopefully one day we will soon. And I do see that as the end of the time. And then the tunnel, the light at the end of the tunnel, I do see that light.'",
        "'speaker_1': 'So hopefully we will be in our city chambers soon. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Allen.'",
        "'speaker_1': 'Yes. Thank you, Mayor. I just want to say, I certainly understand the activity and the technical issues that we all experience, especially the public, and that that can be frustrating. And I certainly can't wait for things to get back to normal and get back in the chambers and have being a newly elected councilwoman that I'm just excited'",
        "'speaker_1': 'to be in front of that community and just to have that face to face time with my colleagues. But I just don't believe that the time is right. I think that, you know, we have been offered counsel. Folks have been offered to be vaccinated.'",
        "'speaker_1': 'But our support team and I don't believe the city clerk's office has been vaccinated yet either. And. And I also agree that it's important that we hear from our from our labor unions and how this could impact their membership.'",
        "'speaker_1': 'So, I mean, I did receive a letter today from Richard Chavez from A.I.M., and this is one thing he said in this letter. He said. He said, We believe that bringing folks back without any science to support the safety of this action is wrong.'",
        "'speaker_1': 'And we believe that an item like this requires a robust conversation. We cannot and will not allow our members lives to be gambled with. And I certainly and I know I know I can imagine anyone who wants to gamble with any of anyone's lives.'",
        "'speaker_1': 'And we definitely want to to see, you know, the staff vaccinated before we open up the chambers to the public. So I can totally support the substitute motion. And and I look forward to getting on video.'",
        "'speaker_3': 'Thank you, Councilwoman Zorro.'",
        "'speaker_1': 'Thank you, Mayor. I, too, also support the substitute motion, because I think that first and foremost, the safety of all staff, especially members of, you know, of our union as well, are taking into consideration when not only the council member asks, but there's so much more that takes to run a council meeting that we have to consider'",
        "'speaker_1': 'and that I believe it's important and I want to uplift what council members and they have said about making sure we continue to put public commenting process that's accessible and is easy and not just technology wise but language wise as well in the forefront of everything we continue to do, whether it is the teleconference, the video and'",
        "'speaker_1': 'hopefully in the future in-person. So I again just believe that it continues. I support the video and that we need to make sure we have extensive conversation about about it before we go in-person. So thank you.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_2': 'Thank you. We have heard from the public comment yet, but I do want to just say that I do appreciate the sentimental considerations from most of my colleagues who we've heard speak already. I think there's been some some some misunderstanding in terms of intent.'",
        "'speaker_2': 'I want to just say that I knew that agenda izing this item would create an uncomfortable kind of conversation. But, you know, we all ran for office and any time we are before the public, even on the council dais, it's not a comfortable situation.'",
        "'speaker_2': 'And and so the intent behind city council meetings are not supposed to be be comfortable. We but we should be safe. That is something that I think we all agree on. I will claim some success on this item since we are moving toward being more transparent and more accountable.'",
        "'speaker_2': 'And that means video access to our meetings that that that is a I'm thrilled with the direction that we're moving in. And I think I mentioned that. And so the substitute motion I will support, but I would have supported that is a friendly.'",
        "'speaker_2': 'Had I been given the opportunity to do that and pointing I want to point to the to the Ms. Allan called it the AM Union. The the the meeting our process is is directed oftentimes by policy, directed by council and direction, by the city council.'",
        "'speaker_2': 'And so should we move forward, whatever we're moving forward, that that process is going to be what it is anyway. And so I think, you know, we do a pretty good job of engaging with our city representative employees unions.'",
        "'speaker_2': 'We should continue to do that, but moving forward with this process in any way. And so I'm going to support the substitute on the on the floor. I mean, I do not need to there's no reason for me to to die on the sword over having in-person city council meetings.'",
        "'speaker_2': 'But I do think we should be thinking about this. We should be planning for that in which we should be transparent with the public in terms of give it an expectation on what that looks like. We are moving forward.'",
        "'speaker_2': 'We are we are leading our our vaccine rollout. Many city employees already are vaccinated. And I don't you know, everyone has people privacy. And so no one knows exactly who has been vaccinated. But I do expect over the next few weeks, 3 to 4 weeks with the vaccine that we know we're we're supposed to be getting, we'",
        "'speaker_2': 'should be in very good shape within the next 30 to 45 days. And so hopefully we can revisit this conversation very soon.'",
        "'speaker_3': 'Thank you. We have one member of the public for public comment.'",
        "'speaker_4': 'Yes. Michelle Baker.'",
        "'speaker_1': 'Good evening. My name is Michelle Baker and I'm a resident district two and a business owner District three. I agree with Councilmember Austin's comments to have a plan to return to in-person meetings. Most council members have been vaccinated and there's only three meetings per month.'",
        "'speaker_1': 'Although the public can't attend, in-person meetings should be video live streamed and public still should be able to provide comments even if you don't approve this item. It is imperative that city council video streams are meeting. Most other government entities have WebEx Zoom video meetings, including L.A. City Council and the Coastal Commission.'",
        "'speaker_1': 'Even the DNC held their convention on Zoom. I have reached out to the city clerk several times inquiring about video stream meetings or told them July. Yes, it's up to the mayor to decide. And it's ultimately the decision of the council as a whole, the whole of the WebEx video meeting.'",
        "'speaker_1': 'I don't understand why there is reluctance to hold video meetings and most other government entities have been doing them for months. Transparency is crucial and it's an open society and people need to know that their council members and mayor are listening to them.'",
        "'speaker_1': 'Video streaming ensures that the Long Beach community can see their representatives in action and see what's going on in the city. Thank you so much and hope to see you live too.'",
        "'speaker_4': 'Thank you. That concludes public comment.'",
        "'speaker_3': 'Thank you, Councilman Price.'",
        "'speaker_1': 'Mr. Mayor. So I agree that we should proceed with the video access if we can, but I'm not clear because there was a lot of dialog. How long that will take for our city team to be able to make that technology work for all of us and for the public.'",
        "'speaker_3': 'Yeah, and let me let me. That's a good question, actually, for for the clerk and Councilman Price, if you don't mind, we could ask the crowd and ask the same thing. Madam Carter, Della Garza, if you're if you're if you're available.'",
        "'speaker_3': 'I know that I know you've been working on this video kind of transition for a few weeks. And I know Mr. Modica had mentioned to me a couple of weeks that there were there were some some tie issues that you guys were trying to figure out with software.'",
        "'speaker_3': 'Can you maybe update the council on kind of where that's at? Because I know that your team's in working on that.'",
        "'speaker_0': 'Yes. Thank you, Mayor and Council, we have been working on this for a few weeks and we were able to meet last week with tech and innovation on Friday and determined that there is a way to move forward using WebEx and showing the video.'",
        "'speaker_0': 'So we're fairly confident if we do some testing with the council and make sure that the Internet speed and the equipment is adequate, that we'll be able to do that going forward. And again, it's just a matter of when we can work with the council offices and determine if the equipment is sufficient and get this going.'",
        "'speaker_0': 'So we feel we feel really good that we can make this happen pretty quickly.'",
        "'speaker_3': 'And Madam Clerk, just to clarify also Councilman Price's question, I think what you had mentioned to me is that you think in the next meeting or two that you'll have everything kind of tested. And then whatever software that I think you guys were looking at buying or or you guys were looking at some kind of text back'",
        "'speaker_3': 'in back of the house piece that you needed to add is would be in place, is that correct?'",
        "'speaker_0': 'So there is a piece of equipment or some software that we're looking at for translation services that won't be ready within the next couple of weeks. However, that will not prevent us from moving forward showing WebEx video on screen.'",
        "'speaker_0': 'We we feel fairly confident in the next week or two we can get the equipment distributed to the council members and get it tested and verify that everybody's connection is sufficient. We should be able to do that. Absolutely.'",
        "'speaker_0': 'The soonest would be next week, but it might be the week after if we can't reach out to all the council members and get that situated.'",
        "'speaker_3': 'Thank you, Councilman Price. Giving back to you. Sorry. Councilman Price.'",
        "'speaker_1': 'So, Mr. Mayor, you you have my question answered, so I'm fine, thank you.'",
        "'speaker_3': 'Okay, great. There's a motion. Any second members, please go ahead and cast votes. It's a substitute motion.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two. I District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'II.'",
        "'speaker_0': 'District five. I District six i district seven.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'District eight, district nine.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to receive a report and confirm the proposed Long Beach Animal Care Services Strategic Plan.  (Citywide)": [
        "'speaker_3': 'Thank you. Item 21, please.'",
        "'speaker_0': 'Report from Parks, Recreation and Marine recommendation to receive a report and confirm the proposed Long Beach Animal Care Services Strategic Plan Citywide.'",
        "'speaker_3': 'Thank you. And we're going to go ahead and turn this over to staff. We know that there's a full.'",
        "'speaker_2': 'Presentation on this. Thank you, Mr. Mayor. Members of the council. Yes. We do have a fairly in-depth presentation to go over our strategic plan for Animal Care Services. This has been the culmination of several years of work with our community members and the department.'",
        "'speaker_2': 'It started with an audit from the city auditor to really encourage us to do a strategic plan. So to ask you through what those recommendations are. This was in front of the council back in December, and the council has to spend a little bit more time going out to the community.'",
        "'speaker_2': 'We did that in February and we had some more community meetings back now to present it. So I will turn it over to Brant, Dennis and his team to present their strategic plan for your consideration.'",
        "'speaker_4': 'Thank you, city manager Monica. Good evening, honorable mayor and council members. I'm joined this evening by Stacie Daines, our director of Long Beach Animal Care Services, which provides outstanding services not just to the residents of Long Beach, but also to several surrounding communities.'",
        "'speaker_4': 'So with that, I'd like to turn it over to Stacey for a presentation this evening.'",
        "'speaker_1': 'Thank you, Brant. And what an interesting time we live in right now. I really want to just think you are honorable mayor and council for your continued service and leadership to our community, especially in these uncertain and trying times.'",
        "'speaker_1': 'I'm here this evening to share with you the current draft of the strategic plan as it was developed in cooperation with the Mayor's Animal Care Visioning Task Force. So this evening's report will include an update on recent operational changes and impacts, as well as an historical perspective on the shelter.'",
        "'speaker_1': 'In addition, I'll share with you the development of the strategic plan, including a brief overview of that plan and what are some of our next steps. And then I'll be happy to take questions, Brant and I, after the at the end of the presentation.'",
        "'speaker_1': 'So I do definitely want to acknowledge the efforts of our mayor, Robert Garcia, in his establishment of the Mayor's Animal Care Visioning Task Force, and certainly each of you council members for your support of Long Beach Animal Care Services.'",
        "'speaker_1': 'Without your support, this plan and that task force would not have been possible. So you should know that each task force member really deserves a great deal of time spent recognizing their efforts in our community in addition to their work on the task force.'",
        "'speaker_1': 'This task force worked hard for two years and struggled personally and professionally with the questions posed to them by the community and one another. They remained engaged in agonizing conversations about what kind of shelter their community deserves, and they faced harsh criticism on all sides and persevered to help bring this plan to life.'",
        "'speaker_1': 'And I know this council understands the journey of the task force, because you've faced and been engaged in much of the same. And your work, too, has been critical to reuniting and creating thousands of happy beginnings for pets and their families.'",
        "'speaker_1': 'In just the last two years alone, you've continued to support animals in the shelter and our community by approving the addition of a full time registered veterinary technician, a full time veterinarian, a full time volunteer coordinator, a full time adoption clerk, a full time marketing staff.'",
        "'speaker_1': 'And in May, our City Council adopted the Compassion Saves operational model that calls the shelter and the community to save all healthy and treatable animals. And now this year, you've provided additional skilled veterinary resources that will allow us to continue to provide life saving outcomes for animals.'",
        "'speaker_1': 'So I want to share with you admissions to our backs and our admissions have followed national trends of reductions year after year. Spay neuter laws, breeding laws, licensing laws, and a lot of hard work from the animal advocacy community and rescue groups, as well as generous support from shelter donors have contributed to the reduction of animal intake'",
        "'speaker_1': 'at the shelter from over 10,000 dogs and cats in 2010 to a little less than 4000 in 2020. Now, a lot of that has to do with managed intake and COVID, but we think that that could be sustainable.'",
        "'speaker_1': 'And with those reductions in shelter admissions, shelter deaths have also fallen exponentially. By comparison, Alberts more aggressively pursues live outcomes for animals than any time in its history. And animals that were killed without outreach to the community are now stabilized.'",
        "'speaker_1': 'They're treated and they're made well. And when this is not practical to do in the shelter, rescue groups are engaged for their assistance in securing positive outcomes for the most medically and behaviorally, challenging animals in our community and our rescue partners should be absolutely recognized and honored for their very significant contribution to unprecedented SAVE rates of Long'",
        "'speaker_1': 'Beach Animal Care Services. By rescuing these animals, they are forever changing the fabric of what compassion means for our community. Today, compassion saves. Operational model is working. No longer are people only looking for the most perfect of pets in shelters and rescue.'",
        "'speaker_1': 'People actively want to help those animals that are less fortunate and who may need lifelong management. This work would not be possible without El Doc's willingness to first save these animals and without our rescue groups ability to support their loving homes and working together, we have been able to save 98% of the animals in our care.'",
        "'speaker_1': 'Historically, for decades, the Long Beach, the city of Long Beach has provided animal control services to the community. Our original shelter. Was located on Willow Avenue and it housed the city stray an abandoned animals. They were cared for for up to 72 hours.'",
        "'speaker_1': 'And if they weren't taken by their owners in that time period, they were killed in accordance with and by direction of California state law. But, you know, this was true for 90% of all animals entering animal control shelters in California prior to 2000.'",
        "'speaker_1': 'Communities were also demanding that animals be saved and not killed and destroyed as many laws dictated. The outdated laws were being rewritten. New laws were being created to protect animals. And these laws would replace the edict of killing and destroying unwanted animals with the call to adopt all healthy animals and treatable animals if they could be made'",
        "'speaker_1': 'healthy. At this time, the Society of Prevention of Cruelty to Animals Los Angeles expressed to the city their serious interest in establishing a presence in Long Beach, and in 1998, agreements were signed and a partnership or a joint venture was sort of created.'",
        "'speaker_1': 'These agreements emerged before a tumultuous backdrop of the animal welfare movement. Animal control was moving to animal care, and shelters were rejecting the catch and kill model of the past. And this movement became known as the no kill movement.'",
        "'speaker_1': 'The PD, Pitchford Companion, Animal Village and Education Center, also known as the Village, opened its doors. Then in 2009, this Council enacted major improvements in Long Beach Municipal Code. And those changes have had dramatic and lasting impacts on shelter operations and the lives of animals in our community.'",
        "'speaker_1': 'Long Beach Animal Control officially became Long Beach Animal Care Services in 2010. Long Beach Animal Care Services implemented an adoption program, and that continues to grow from 150. The first year to now, we are adopting over 1000 animals a year.'",
        "'speaker_1': 'In 2013, we implemented a volunteer program to enhance the care of animals in the shelter, to include enrichment and socialization above and beyond the cleaning and feeding provided by staff. And now, today, nearly 300 volunteers contribute nearly 13000 hours of loving life annually to the care and keeping of the animals in our shelter.'",
        "'speaker_1': 'In 2014, we began to create partnerships with other animal welfare and rescue organizations who would assist with the medical and behavioral rehabilitation of animals to place thousands more. And then in 2017 to 2020, the city really ramped up its efforts to enact true shelter reform.'",
        "'speaker_1': 'In 2017, in response to the community's growing concern that despite its best efforts, our backs continued to fall far behind the policy set by the state of California that no healthy or no treatable animal should be killed in the shelter.'",
        "'speaker_1': 'The city auditor retained the services of Jbr Shelter Strategies to bring the operation of El Bax, to review the operation of El Bax and to determine what efforts might be enhanced to bring about better outcomes for shelter animals.'",
        "'speaker_1': 'And that review was conducted in two phases. The first phase focused really on shelter operations, while the second phase focused on staffing and resources that were already in place, as well as what resources might be needed to provide an acceptable standard of care for animals.'",
        "'speaker_1': 'Over 200 recommendations were made in over 14 areas of operation, so it was quite extensive and a bit overwhelming. Those recommendations were broken into immediate, short term and long term priorities, and the most urgent and necessary recommendation in the first phase was really an identity for the shelter, which included developing a mission and a vision and a'",
        "'speaker_1': 'strategic plan. While the second phase really focused strongly on underscoring the need for increased and more developed staffing, regardless of what direction Long Beach Animal Care Services decided to go in. And then in 2018, in response to this, Mayor Robert Garcia convened the Mayor's Animal Care Visioning Task Force.'",
        "'speaker_1': 'And this was represented by 20 members of various stakeholders, including reputable and local animal rescue, welfare organizations, shelter volunteers, animal advocates. And this group met in a public forum each month to find a path forward for El Box and some key areas.'",
        "'speaker_1': 'The task force focused on were the recommendations, of course, made in the audit. Growing and expanding the Long Beach Volunteer and Adoption Program. What was the relationship and agreements between the SPCA and what was the viability of no kill in Long Beach?'",
        "'speaker_1': 'And it was clear that the top priority that could address all of the other goals of the task force was to develop a mission and vision for BAX, and a strategic plan would be necessary. The department hired Jbr to lead the strategic planning efforts because of their previous experience knowing about Albert's operation in partnership with the Odyssey'",
        "'speaker_1': 'Group, who also provided consultants that are well-respected animal welfare professionals with proven track records of success in bringing about systemic change in shelters to improve and save lives. The development of that strategic plan included a review of the audit conducted by the city auditor.'",
        "'speaker_1': 'There was also a public meeting held on March 3rd that invited the community March 3rd, 2019, that invited the community to give feedback on the kind of shelter they would like to become. Feedback was welcome for weeks to follow in preparation for two strategic planning workshops that were held separately in May 2019.'",
        "'speaker_1': 'One day long workshop was held with the task force and a two day long workshop was held with Long Beach staff, animal care services staff. And then in 2019, Long Beach City Council adopted the operational model as a framework for the strategic plan called Compassion Saves, and it strives to expand what can be done to not just'",
        "'speaker_1': 'stop the killing of animals in the shelter, but really to imbue our community with compassion for people and animals. Compassion drives the work that is necessary to save lives, including foster care. Adoption of pets falling. Terrorism, donor funding and a lot more.'",
        "'speaker_1': 'And it is compassion upon which the success of the plan rests. The working the working group met weekly and reported regularly to the task force. The task force meetings were really focused primarily on the progress being made in developing the strategic plan to ensure the plan remained relevant and on track for final approval, as well as to'",
        "'speaker_1': 'give the community an opportunity to provide timely feedback during the development process. The final rough draft of the plan was reviewed by the task force in a public meeting on July six, 2020 and was approved by the task force in another public meeting on September 11th, 2020.'",
        "'speaker_1': 'This draft plan was then provided to certain stakeholders in October, and those stakeholders included Long Beach staff or volunteers, rescue and transfer partners, certainly anybody who requested it. And then other engagement opportunities were made possible through two public meetings held in February.'",
        "'speaker_1': 'This plan is publicly available on Long Beach Animal Care Services website for anyone to review. Individuals can complete a survey that captures specific ideas and thoughts about the plan. In addition, an email is also provided on our website to allow for sort of a free form of gathering feedback about the plan.'",
        "'speaker_1': 'These mechanisms will be made available for the life of the plan, so the questions or concerns or ideas can be captured in a timely fashion. This data may also be used to help further develop the current plan or or really to help shape the next one.'",
        "'speaker_1': 'So our vision is simple and clear, and that is that Long Beach is a responsible, compassionate and informed community working together for the health and welfare of its animals. This vision can be realized when we accomplish the mission of compassion saves, which is that we ensure that compassion saves by supporting the people and animals of our communities'",
        "'speaker_1': 'through outreach, education, guidance and support services. We protect shelter animals by creating an environment of care through enrichment and innovative programs. And that's really what this plan is all about. It's all of the things that we need to do to accomplish that mission.'",
        "'speaker_1': 'There are five strategic goal areas. The first one is that the shelter is an animal welfare centered operation. Next is outreach and engagement and also financial sustainability, life saving and staff development. The first strategic goal is that our operation is healthy for animals, and this means that animals receive the care necessary for their age, their health and'",
        "'speaker_1': 'behavior status according to national guidelines and best practices. And that we're not just sort of making things up as we go, but it's evidence based and that they experience the shortest shelter stay necessary. This is accomplished through several strategies, and the first is ensuring all programs in operation have data analytics that measure our success and program effectiveness'",
        "'speaker_1': '. Pathway planning, housing plans and communication strategies will also ensure a healthy and short shelter stay. Our second strategic goal is that EL supports and engages the community and this is a very robust portion of our plan in order to support and engage the community.'",
        "'speaker_1': 'El Bax must provide contemporary animal care services. These services are comprehensive adoption and volunteer programs. Pet Surrender Intervention. Connection to resources for low cost medical and spay neuter services. Pet friendly housing behavior and training help. These are all important aspects of providing contemporary animal services over abandonment and relinquishment of pets.'",
        "'speaker_1': 'All that's also needs to increase accessibility to awareness of and compliance with lax services and city ordinances. This can be accomplished through effective marketing and communication strategies. And finally, humane education. Another strategic objective has long been a foundation for helping a community develop a humane ethic not only toward animals but towards each other.'",
        "'speaker_1': 'Making human humane education available through El Box will fill a much needed gap in our community. These are real equity issues for our city, too. The same individuals that struggle with education, housing, health care and employment are the same individuals that struggle with providing necessary and mandated care for their pets.'",
        "'speaker_1': 'The third strategic goal is that Lubbock's operation is sustainable. We've been working to establish effective ways to manage our current agreements with SPCA, to maintain the integrity of our operation, and to ensure that the compassion service model of operation is able to be fully realized.'",
        "'speaker_1': 'In addition. Back. Is conducting a budget gap analysis to determine what opportunities exist, to reposition staffing, to provide services for the community in line with compassion saves. And there are several key positions or responsibilities necessary to fully implement compassion saves, especially in the areas of foster care, behavior and enrichment.'",
        "'speaker_1': 'Fundraising goals and strategies are also needed to help provide sustainability and compassion saves model. We have already begun work with the Bureau of Park Planning and Partnership to identify this for Alberts. The fourth strategic goal is that programs improve and save lives.'",
        "'speaker_1': 'El Bax has provided life saving programs out of necessity and response to need. And these programs need structure and more communication between the shelter and those that use them. These programs need to enter their next stage of development, and this includes adoption and rescue and transfers or volunteer program, as well as a comprehensive foster care program.'",
        "'speaker_1': 'They need guidelines, process and resources to help animals who are saved by them, but also to provide clarity and ease of use for those that are using the programs. This effort will be enormously important in ensuring our community and stakeholders can have confidence in our programing.'",
        "'speaker_1': 'And then the fifth and final strategic goal is that all operation is healthy for people providing our staff and volunteers with updated and clear policies and procedures, relevant job descriptions, solid professional development and training programs and wellness programs that help them build resiliency and deepen their engagement with their work is fundamental to the success of any plan'",
        "'speaker_1': 'for Long Beach Animal Care Services. Our next steps include continuing to provide platforms for our community to engage with us. We are in the process of reviewing feedback that we receive and we look forward to your continued support as we finalize and implement this important plan.'",
        "'speaker_1': 'An important part of any strategic plan is really keeping it alive and accountable in front of the community so they can participate in progress and celebrate the plan. So I thank you for hearing this report and on the hard work and dedication of the Mayor's Animal Care Visioning Task Force and shelter staff.'",
        "'speaker_1': 'We are open for your questions.'",
        "'speaker_3': 'Well, why don't we go to public commenters? We have a good list of public comment. Let's go through all those.'",
        "'speaker_4': 'Our first speaker is Carol Peterson.'",
        "'speaker_1': 'Hello. Like I commented on a public forums held on for the 13th and 17th. I have a concern with the very beginning of the strategic plan, the mission statement. It says that the shelter will ensure compassionate saves by supporting the people and animals of the community through outreach, education, guidance and support services.'",
        "'speaker_1': 'It doesn't say that we protect shelter animals by creating an environment of shelter, enrichment and innovative programs. That's kind of a red flag for me. The last time I heard Innovative in relation to the shelter was UCLA entered into a partnership with the US, promising to deliver innovative and revolutionary care.'",
        "'speaker_1': 'We all know how that turned out and ordered, resulting in 186 recommendations to improve. I know Long Beach didn't want to commit to don't kill. There weren't even any vocal advocates on the task force. And what concerns me about the mission statement is that nowhere does it say we will save lives.'",
        "'speaker_1': 'Instead, it links compassionate cities with outreach, education, guidance and support services. This just doesn't seem specific enough with respect to animals lives, and to say that the shelter will protect and care for the animals is necessary as stated in the audit.'",
        "'speaker_1': 'But again, it's not the same as saving lives. Language is important and it needs to be specific in writing. Take best friends, for instance. Their mission statement says they want to end the killing in America shelters. That seems to be pretty clear about saving lives.'",
        "'speaker_1': 'I would have liked to see specific language in our mission statement that above all else, right up front lets the community know that old access about save lives. To do that, a comprehensive adoption program is vital. It needs to be a direct function of shelter policies.'",
        "'speaker_1': 'Instead, goal number four in the strategic plan titled Life Saving is all about transferring, fostering and volunteering again. Nothing about adoption. In fact, I only saw the word adoption mentioned a few times in the entire plan. Yet a comprehensive adoption program independent of SPCA is what many people have advocated for years.'",
        "'speaker_2': 'It would.'",
        "'speaker_1': 'Seem again throughout this process that engaging the public for feedback.'",
        "'speaker_2': 'About the.'",
        "'speaker_1': 'Development organization and fulfillment of the strategic plan was all for show. Because I wrote the original draft with subsequent drafts of the strategic plan, not much changed. This seems troublesome to me, especially for the animals, but also for the city council.'",
        "'speaker_4': 'Thank you. Our next speaker is Joanne Weiss. Joanna.'",
        "'speaker_1': 'Oh, thank you. Thank you, counsel, for your time this evening. I'm very concerned with agenda item 21, which seems to have suddenly changed to receive and confirm. It would be helpful to understand what that exactly means. That's why I'm asking that we make some motion to change it, to receive and file, which is what we have been'",
        "'speaker_1': 'told for since back in December, that this was just a draft plan and it was only to be received and filed for the intent of disbanding the task force. So this confusion, this confusion of what the agenda item is to occur tonight, and there are 21.'",
        "'speaker_1': 'It mentions that. The plan is to be move forward that the. They're looking for city council to move forward with the plan. And I that again is vague and I'm not sure what that means to move forward there.'",
        "'speaker_1': 'The public only have an opportunity for the very first time. I know there's been mention of other meetings, but that is not the case. I want to go on record to make that very clear. February 13th and 17 was the very first time that the community was allowed to give input, and that was only last week.'",
        "'speaker_1': 'So we were told that the plan was draft and there would be further revision because the plan is not ready to be anything but received at this time. So the question is, is ethical or is one of the core values listed in this plan?'",
        "'speaker_1': 'Yeah. If there was something changing the motion to approve and make this a final strategic plan, that's very concerning on the plan. This is the mark beginning with this nebulous, confusing and mean on a mission of vision statement.'",
        "'speaker_1': 'There's no goal for spay neuter, which is the biggest gap in our city. Adoptions is hardly mentioned, which is again very troublesome. The metrics and deadlines have been removed between years and waiting over a decade for a meaningful strategic plan.'",
        "'speaker_1': 'The audit in 2017 pointed to significant issues. Yet we do not see a spreadsheet of any sort where lists the audit items and a checklist confirming they have been addressed in the plan. There's no SWOT analysis that I can see in every strategic plan.'",
        "'speaker_1': 'Processing would have a SWOT analysis. I don't see any industry trends that would collected. We don't need to reinvent the wheel. There are many shelters out there already doing have robust adoption programs. And also missing is that any strategic plan has goals and objectives.'",
        "'speaker_1': 'And then you would see strategy, action, steps and deadlines. There's no strategy action. Again, I said the metrics are missing. So this plan is extremely nebulous. Goals that should be included on maximizing adoptions and are homing. That's not mentioned.'",
        "'speaker_1': 'We could go on and on. But, you know, the public is the main major stakeholder here and only having opportunity last week.'",
        "'speaker_4': 'Thank you. Our next speaker is Christine O'Malley.'",
        "'speaker_1': 'Hello. I'm a third district resident the last 67 years, and I'm concerned about the cell backs plan to enter into any operating agreement with SPCA, PCAOB. More than a year ago, in January 2020, there was an extensive discussion at City Council about allegations of bad behavior by SPCA, L.A. That was precedented.'",
        "'speaker_1': 'That was preceded by several other meetings in 2018 and 19 about problems with SPCA, L.A. As a result of those meetings and through those meetings, the public was informed that SPCA, Ala. Was unilaterally deciding policy at our shelter, had been operating businesses without business licenses, was creating a hostile work environment at El Beck, and had multiple other'",
        "'speaker_1': 'violations of the lease between the city and IL, including not allowing IL backs to use common areas that it had a right to use under the lease and not providing keys to common areas as required by the lease.'",
        "'speaker_1': 'It was also taking the adoption fees generated from L backs animals which should have been put into an account to funding for spay neuter at El Beck. Council member Susie Price at the January 21st, 2020 council meeting expressed serious reservations about entering into any further agreements with a partner SPCA a that was violating terms of their original'",
        "'speaker_1': 'agreement. Is that still a concern? Councilmember Elston specifically asked for an audit of SPCA, Ella's operations and finances. Has that occurred? The public has heard nothing but these requests. Excuse me. About these requests. No audit has been done on SPCA, only that the public has been informed of a number of council members at the January 2020 meeting'",
        "'speaker_1': 'noted that SPCA has not been a good partner to Albert. We need three things here in Long Beach. Number one. We need our backs to be completely independent of SPCA. Number two, we need the city to enforce the terms of the lease.'",
        "'speaker_1': 'And number three, we need the city to require SPCA to provide reports on all of its intakes and outcomes, including adoptions, euthanasia, transfers, etc., to the city. That is the only way that we know that our shelter animals are receiving the proper care and treatment that they deserve and that the taxpayers want.'",
        "'speaker_1': 'This just makes no sense. This plan. Another issue with the item is the enormous emphasis on licensing in this plan. On Plan Page seven, it says the city wants to increase license sales by 50% or.'",
        "'speaker_4': 'Thank you. Our next speaker is Michele Baker.'",
        "'speaker_1': 'I want to thank the mayor and city council for taking animal care so seriously. You have made so many positive changes and really listened to constituents. However, tonight I am asking that you don't confirm back certification until changes are made to the plan.'",
        "'speaker_1': 'Hyper. Typically, in a meeting two weeks ago with other residents, we had many questions that were not addressed or included in this plan. The plan is ambiguous without any specific metrics. I'm also very concerned about recent animal policies that Lufthansa's implemented in the last year, especially in regards to stray cats.'",
        "'speaker_1': 'The shelter is not being transparent. With intake and released numbers, public records are taking weeks to get a response and there is confusion. And who's managing the shelter in the volunteer program? Lessons confirmed to me on email today that implement and manage intakes and said that California does not mandate that shelters have to take in stray cats'",
        "'speaker_1': 'unless they are injured. What does that mean? That goes against Hayden's law and other California welfare laws. Currently, the shelter has around 12 cats, which is low because intake is low. Opacities requiring people to make appointments to turn in strays, including filling out paperwork before an appointment will be issued.'",
        "'speaker_1': 'They're even making it more difficult to turn into a stray cat, encouraging people to leave the cat where they found it. This is a best friend's coffee and it is. You can make it look better. Let's intake better outcomes.'",
        "'speaker_1': 'What is happening is we have more cats roaming in the neighborhoods and searching for food and being vulnerable to coyotes. Look at next door and see the daily concerns about stray cats in different neighborhoods manage intake and dubious arts programs.'",
        "'speaker_1': 'What Orange County Shelter did a couple of years ago until they were sued? San Diego Humane Society was served this week for similar policy. I'm asking for clarification. L Beck's current policy and also an update on SPCA. Intel Backs Contract with City Council.'",
        "'speaker_1': 'Asked for an update almost a year ago. Please do not comply with plan until we have some clarification. Thank you.'",
        "'speaker_4': 'Thank you. Your next speaker is Patricia Turner.'",
        "'speaker_1': 'Good evening, Mayor and City Council. My name is Patricia Turner. I'm the director of No Kill Long Beach. Our organization has been advocating for a no kill shelter since 2012. I'd like to address the strategic plans take on adoptions in a town hall meeting back in 2014.'",
        "'speaker_1': 'Mayor Garcia promised over 200 animal advocates that he would put in place a robust adoption program. A well-articulated, fully developed adoption program is one of the key programs that every animal shelter should have. And that adoption program is noticeably missing from this plan.'",
        "'speaker_1': 'In fact, adoptions are only briefly mentioned, and the few actions listed with regard to adoptions do not directly increase adoptions. Among the actions mentioned are customer satisfaction surveys, communications volunteers and the shelter beautification plan. Those are good plan, but the most important ones that directly increase adoptions are missing.'",
        "'speaker_1': 'Some areas need to have weekly offsite adoptions in order to place animals into good homes. They also need to have local adoptions that take animals to neighborhoods around Long Beach, making it easier for people to adopt. Albert's received a mobile adoption ban as a donation.'",
        "'speaker_1': 'A few years ago, that mobile adoption ban, which was valued at $100,000, is not mentioned in the plan. In addition, a robust adoption plan has daily or weekly goals for adopting out animals. These are also not articulated in the plan, nor are our plans for low cost adoptions or frequent ongoing adoption promotions and events.'",
        "'speaker_1': 'With all due respect, it is not possible to adopt animals out by indirect means, such as giving surveys and improving the look of the shelter, both of which are prioritized in the plan. Garcia You made a promise to the people of Long Beach to have a strong adoption program.'",
        "'speaker_1': 'However, what we are seeing here is essentially the same plan. Long Beach has always had to act as animal control and allow us to do the adoptions with no transparency from that agency. Folks in Long Beach have been asking for a no kill shelter with a strong adoption program for 12 years now.'",
        "'speaker_1': 'The city organized a public feedback meeting in March of 2019 that was overwhelmingly dominated by people who wanted a no kill shelter that is separate from SPCA, L.A. and their requests have seemingly fallen on deaf ears. It's time for Long Beach to do the right thing and stop saying all that says animal control and a cash cow'",
        "'speaker_1': 'with all of the licensing that they're asking us to do, which all goes straight to the general fund, which many people don't really even realize does not go to the shelter and make back into the proactive, animal friendly, lifesaving and transparent no kill shelter that people and taxpayers in Long Beach want.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Thank your next speaker is Wendy Aragon. Wendy Aragon.'",
        "'speaker_1': 'Thank you. Good evening, honorable mayor and city council members. My name is Wendy Aragon, president of Pet Assistance Foundation and a Long Beach resident. Of the third district. We recognize the great amount of work and time involved in developing the strategic plan.'",
        "'speaker_1': 'We applaud the plan for its recommendations to improve excuse me, improving adoptions, fostering and shelter care practices. However, we do see some major problems in two fundamental areas the proposed managed or limited mission and the Community Cat Rescue Relief Program Manager should mission is not managed or limited admission is not open admission.'",
        "'speaker_1': 'We know COVID understandably had an impact on how admission is handled, but we have been told the practice will likely continue indefinitely because, quote, it seems to work well for the shelter. And of course, limited admission greatly inconveniences residents turning in owned animals and strays, especially those good Samaritans who go out of their way to rescue an'",
        "'speaker_1': 'animal from a dangerous situation. Many people don't have the capacity to keep strays or the time to show up for appointments and fill out extensive paperwork. We have knowledge of cases where people have waited 4 to 5 days to relinquish a stray.'",
        "'speaker_1': 'Second concern is a community cat program where friendly to feral cats and kittens over 12 weeks of age are being released into areas that come. They come from without caretakers to provide food, shelter in a safe area with neighborhood approval.'",
        "'speaker_1': 'We are very aware of the suffering endured by these cats in areas where the community cat programs abound, such as Orange and Riverside counties. Tragically, these community cat programs present an exemplary modeling for the public to think it's okay to abandon their cats.'",
        "'speaker_1': 'The proponents of this program, in conjunction with big humane organizations, argue forcibly about the success of these release programs supposedly grounded in best practices and research, while negating the profound humane issues involved. We want to see our shelter address the root cause of overcrowded shelters, pet overpopulation.'",
        "'speaker_1': 'It is through education enforcement of our very progressive laws and convenient low cost land neuter services that will ultimately prevail in modeling a meaningful life release rate that reflects humane reforms in addressing pet overpopulation. At this point in the discussion, we recommend that the strategic plan be put on, receive and file.'",
        "'speaker_4': 'Thank you. That concludes public comment for this item.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_2': 'Thanks, Mr. Mayor. My comments are short. We've seen a lot of this presentation last time this came around. I want to thank Stacey. You obviously have demonstrated your passion here. I thank you for acknowledging that this is a living document.'",
        "'speaker_2': 'There's clearly more work to do. I think the community wants to see a more rigorous effort around adoptions, and that's going to have to be demonstrated. And so we look forward to regular updates on how we can do that.'",
        "'speaker_2': 'I'm also interested in, you know, we've talked about this in the past, you know, stray animals in a minor way till five. It's still still a problem. I know that we've been knocked off course in many ways on a lot of our priorities with COVID 19.'",
        "'speaker_2': 'So the more that we can talk about how this impacted our ability to respond and how we can get back on, you know, get back on track for the future, I think is good. Regular communication with the council on how we're doing would be good.'",
        "'speaker_2': 'I just want to see how we can continue to invest in mobile, mobile adoptions and things like that. So I want to see, you know, what lens are based on budget discussions and all of those things. But I think this plan, the city council should adopt this plan and we can always add or make adjustments to this'",
        "'speaker_2': 'plan. But this is this is a strategy. That's what they said. Any given through, they can make adjustments to this plan. And so I think we need to make the move forward and adopt this tonight. So that said, I move.'",
        "'speaker_2': 'Staff recommendation. Thanks.'",
        "'speaker_3': 'Okay. I have a second or a councilwoman. Go second.'",
        "'speaker_1': 'Yes, Mr. Mayor. I had tried to remove the item, but that's fine.'",
        "'speaker_3': 'Did you have any comments, Councilman?'",
        "'speaker_1': 'I do.'",
        "'speaker_3': 'Sometime ago.'",
        "'speaker_1': 'Thank you. First, I want to recognize the task force, the volunteers in the rescue groups. This has been a huge and. A huge left for the community and I'm really proud of the work that's been done. I do appreciate a lot of community comment today and I know that there are a lot of things that continue to'",
        "'speaker_1': 'change, and I don't know that the community or even the council have heard back on a lot of the things that have made progress over the last several months. The real dialog has been around COVID and vaccinations and the sick humans, and so that the animal progress has maybe not been front and center, and so we can'",
        "'speaker_1': 'do a better job with that. I think that that kind of ties into providing the communication toolkit to the Parks and Rec team to ensure that they are able to provide that kind of use the to utilize the toolkit to share that information across the community.'",
        "'speaker_1': 'I know that community meetings have been held and I appreciate that. I would like to differentiate something. So I'm in my full time job. We've been going through strategic planning, and I think that's something that I didn't hear in the plan today, which would really fulfill the needs of the community is a 100 year purpose.'",
        "'speaker_1': 'Now I get a mission and I get strategies and goals and I know that in my discussions with Mr. Denis that is coming next. But first, before you even get to the mission, you really need to talk about, one, your purpose.'",
        "'speaker_1': 'And a lot of what I'm hearing from the community are things that aren't potentially executable in the next five years under certain restraints and commitments that previous councils had made. But I will offer the following. I listened to the community and I had not written down 100 year purpose or anything related to it before the community comments'",
        "'speaker_1': 'started. But it really tried to pull some pieces from the things that you each said. And I think what you're looking for is that you're you were hoping that the mission would be more of this kind of 100 year purpose, all backs becomes or is at that time you'd say 100 year X is the premier proactive, independent'",
        "'speaker_1': ', humane reformer of lost or abandoned animals and the educator and supporter of responsible animal caretakers in Long Beach. That kind of says a lot of things, right? We heard a lot about being proactive. We heard about our independence from SPCA, L.A. We talked about the humane components of our education program, both in the community and the way'",
        "'speaker_1': 'we treat animals in our shelter, including veterinary care. We talk about how we take care of lost or abandoned animals and how we support animals that are already in homes in the community. I can't tell you how often I hear about irresponsible pet ownership and really that us helping an animal find a home is not the end'",
        "'speaker_1': 'of our relationship with that that pet caretaker. And so I think that that's just a baseline and maybe the animal task force could add to it or that staff could contribute. But I think that the community really wants to hear that there is a long term vision, as was articulated by the council at previous meetings of a'",
        "'speaker_1': 'proactive, independent, humane organization. And I know we're growing into that, and I want to appreciate Stacy for her work. This has gone through many iterations. It has been a really, really great process, a lot of community input and all of that.'",
        "'speaker_1': 'While she was working on that, many of you know, she has many agenda items that are due back to the council any day now, including the revision to the commitment to adopt policy, the changes that have happened already with our relationship with SPCA, L.A., I know a lot of you are asking for an audit or those kinds'",
        "'speaker_1': 'of things, but independent organizations don't have to provide those to us and they're not required by the contract. And for that, you should be angry at councils of the past that allowed that to happen. And many of those people still live in our city and we have to take heed from the lessons of the past in every'",
        "'speaker_1': 'decision that we make at the Council so that we don't set up future councils or situations such as this. And I know that there are many controversial issues before the Council on a daily basis and relationships with major entities on other assets in our city.'",
        "'speaker_1': 'And we look to this relationship with animal control, we look to our relationship with the Queen Mary. We look to our relationships across the city that we're in, in hopes of drawing both reflection and strength moving forward. So for that, I want to say that please don't despair that there is still progress moving forward.'",
        "'speaker_1': 'I am in contact with animal care regularly. We were just over at the shelter. I don't remember how many days ago. And my husband was there.'",
        "'speaker_2': 'With.'",
        "'speaker_1': 'An animal that needed help of the port. And I get to see the volunteers that are there on a daily basis. They're working with the animals, they're running the dogs. And when they get a big dog or an animal, that perhaps the volunteers that are there aren't able to.'",
        "'speaker_4': 'Go for 5 minutes before.'",
        "'speaker_1': 'Thank you. They call in additional tears who may have kind of been out of the loop during COVID. So I appreciate that. Thank you for all the progress you've made. And as you can tell, I'm a big supporter of this item.'",
        "'speaker_1': 'And thank you.'",
        "'speaker_3': 'Thank you. Truman Price.'",
        "'speaker_1': 'Okay. Thank you, Mr. Mayor. So I do have a couple of questions based on the community comments. The first question I have is what is the status with the SPCA, L.A. issues that we talked about at our last meeting?'",
        "'speaker_1': 'Not our last meeting, but the last meeting where we discussed this and some of the potential issues with the contractual relationships. Yeah. Councilwoman Pryce, thank you so much for asking your question. This is Stacey. We have been meeting regularly with the SPCA to sort of go over the agreements and attempt to really get on the same page'",
        "'speaker_1': 'and determine what is needed in order to do that. So I am happy that our last meeting was very productive and we were able to identify what we think is really sort of holding us back. And I think this council, as well as me and SPCA, have all recognized that this agreement as as it was drawn is'",
        "'speaker_1': 'probably not the agreement we would draw today, but it's the one we have. And so it's really about making it work and making it be relevant and finding out how how that is or is not the case. And that's been very, very challenging.'",
        "'speaker_1': 'So we do have some forward movement. We will be working together with the SPCA to ensure that all of the parts of the agreements are actually there. I don't know if you know, but some agreement or some exhibits are not.'",
        "'speaker_1': 'We don't have them. So we're in the process of really working on those things. So I'm encouraged by our last meeting. And I guess that's that's what I have to say about that. Do you have any. No, no, I think I think I think forward movement is good.'",
        "'speaker_1': 'And I think that's what we were all hoping for, understanding that there were a lot of concerns, both from the operation side in the city, but also from some community concerns. So I'm happy to hear that there is some forward movement and I'm okay with that as long as you're letting us know that it continues to be'",
        "'speaker_1': 'a forward movement. The other I would also I'm sorry. Councilmember Prentice, I also want to let you know that I've been working closely with the director, Brant Dennis, and he's been working closely with the city manager. And both have been very supportive and very, very much concerned about making sure that this is right and it's going in'",
        "'speaker_1': 'the right way. So there isn't a sense that anything is being put off or there's a back burner other than what typically is happening with COVID. So I just want our council to know that that this is first and foremost inter as far as animal services is concerned, and our director is very much aware of that and'",
        "'speaker_1': 'supporting our efforts. Okay. Thank you very much. I think I'm probably going to run out of time in just a minute here. But there was some community concern regarding whether this is a received file item. It's my understanding that it is a receive and file item, that this is the plan.'",
        "'speaker_1': 'The plan can be modified, it can be tweaked. It can it can contain additional inputs in the future, is my understanding? Correct.'",
        "'speaker_4': 'Councilmember this is City Attorney Park and the the item this evening is a report to confirm the proposed Long Beach Animal Care Services Strategic Plan. And so you're basically adopting it this evening. But as you also said, and I think the maker of the motion mentioned also that it can be amended and modified at any Tuesday meeting'",
        "'speaker_4': 'at the direction of the council.'",
        "'speaker_1': 'Okay. So this this document that we would be confirming, it's this is the strategy and the vision that at this moment we want to move forward with. But this strategy can be modified based on community inputs, based on the directors observations, the directors operational recommendations, things of that nature.'",
        "'speaker_1': 'I just want to make sure that it's not set in stone, that it is something that it's a it's a it's a plan, but it's not that a such a plan that it can't be modified.'",
        "'speaker_4': 'That that's correct. However, it couldn't be modified by the public or by the director. It would have to come back to.'",
        "'speaker_2': 'The council and five votes could modify it.'",
        "'speaker_1': 'Okay. So Councilmember.'",
        "'speaker_2': 'This is Tom Urquhart. I think that's absolutely right. The strategic plan would be the plan to modify it. There's still going to be lots of different things that we work on. Three Animal Care Services. So this isn't an operational plan where it's down to every single task that is done.'",
        "'speaker_2': 'That is really the responsibility of Stacie and her group and Grant. But there's going to be lots of things that will continue to be worked on. All of our adoption programs and all of the things that council has talked about, about, you know, getting an operational agreement.'",
        "'speaker_2': 'Let's be clear, those are all going to continue.'",
        "'speaker_1': 'Okay. And I appreciate that. And I know, Ms.. Daines, you talked about the community outreach process. Many of the residents who called in tonight for public comment are third district residents. I think they identified themselves as such and they meet regularly.'",
        "'speaker_1': 'They're very active in the conversation. And I want to make sure that they're heard and they continue to be heard. So in terms of moving forward, to the extent they feel more input from them, would would make this plan better or or enough input wasn't.'",
        "'speaker_4': 'Your 5 minutes are up.'",
        "'speaker_1': 'Okay. Let me just finish this question. What are there opportunities are there for for potential modifications if parts of the plan need to be tweaked or are, that's brought to your attention? So I think those modifications would be based on, you know, data collection and, you know, how programs are effective or not effective.'",
        "'speaker_1': 'So it's really going to happen as the plan is unfolding and as we are actually engaging with our community, because it's not something that Animal Services does in a proactive way. We're very reactive. So I think it's important that there's an update provided on a quarterly basis about where we're at with the plan and that we're sharing'",
        "'speaker_1': 'all of that with our community and engaging with them and hearing, you know, what's happening and not just a handful of folks, but people who are really the ones who need the services that we are providing or not providing.'",
        "'speaker_1': 'Okay. So my time is up, but I'm going to queue up again because I do have a follow up on that.'",
        "'speaker_3': 'Councilwoman, why don't you go ahead if it's just one question, go ahead and just do the follow up on that question.'",
        "'speaker_1': 'Thank you very much, Mr. Mayor. So is it possible, since we're going to be having quarterly updates, is it possible can this council request a community meeting prior to the next quarterly meeting? Our quarterly update to get input from what's going right, what's not going right that can be included in the quarterly report.'",
        "'speaker_2': 'This is Don. Can I suggest that the first one be maybe more like six months or so? If we did a meeting and for a quarterly report, we'd be setting, you know, there's not going to be a whole lot to report back in about two and a half months or three months.'",
        "'speaker_1': 'You're right. I think that report right now. I agree with that. I agree. I just want to make sure and I agree. Six months would be ideal, but it could we could we commit for a community meeting to really get feedback because there are a lot of people who don't feel like they were heard.'",
        "'speaker_1': 'And I just want to make sure they have an opportunity to be heard before the quarterly update or the six months. This is Stacey. You know, I I'm very open to that in terms of engaging our community with animal services.'",
        "'speaker_1': 'And so I think that that is something that we can do as a department more frequently than it necessarily needs to go to council for, you know, review, as Mr. Modica was suggesting. So. Sure. So we're great. That's a wonderful thing to do, especially in the beginning phases of this plan as we're rolling out and progressing.'",
        "'speaker_1': 'Okay. So so then we can we don't that doesn't that that community feedback doesn't have to be at the council level. In fact, I'd prefer it not be because there are going to be details and things that that you and your team are going to understand and be able to have meaningful conversations with the community on that'",
        "'speaker_1': 'council may not necessarily have the expertize on. So could you just house those and just before you report back to the council? Absolutely. Fantastic. Thank you very much. I appreciate that. Thank you, Mr. Mayor.'",
        "'speaker_3': 'Thank you, then, Councilwoman Allen.'",
        "'speaker_1': 'Yeah, I thank you, Brant and Stacy and everyone from the Animal Care and our parks team for this report. I do also agree that I think it's important that we keep our community engaged. I do have a really quick question.'",
        "'speaker_1': 'One of my residents raised this question about turning around stray animals. So can you clarify whether residents need appointments to turn in stray animals? Some residents are concerned that requiring appointments and and paperwork for stray animals will result in less animals being cared for.'",
        "'speaker_1': 'And so can you address that question, please? Sure. So anyone can certainly bring a stray animal to the shelter or turn in a stray animal. We've always required paperwork. People do have to show us their government issued photo ID and we have a process that we go through when we're interviewing them to determine what's going on with'",
        "'speaker_1': 'an animal so that we can accurately look for its owner or place that animal. If an animal is sick or injured, those animals can come right in. If somebody is not able to take care of an animal for a few days to see if they can locate the owner, which is a far more effective way to reunite'",
        "'speaker_1': 'an animal with its owner, is that it stays where it was found for 2 to 3 days before it comes to the shelter. Neighbor owner returner owner. Return rates are 4 to 5 times higher than at a shelter.'",
        "'speaker_1': 'They're significantly reduced when an animal is removed from its community and placed into a shelter, and the chances of reunification go from about 80% in a neighborhood to about 20% in the shelter. So it's being done because it's best for the animal.'",
        "'speaker_1': 'However, if someone doesn't feel safe or they're not able to adequately care for an animal or they just simply don't want to, they absolutely can bring an animal to the shelter. We are going to ask them if they can make an appointment with us.'",
        "'speaker_1': 'But if they absolutely refuse and they say no, then we will help them. Great. Thank you.'",
        "'speaker_3': 'Thank you very much. With that, we will we have a motion and a second. So please go ahead and cast your vote. Roll call.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven. District eight, District nine.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Great. Thank you very much. We are moving on to new business, starting off with Councilman Alan.'"
    ]
}