{
    "Recommendation to request City Manager to draft a letter of support for SB 54 (Allen)/AB 1080 (Gonzalez), regarding statewide efforts to phase out the sale and distribution of single-use plastics in California by 2030.": [
        "'speaker_1': 'Thank you. Now we're going to move to item 13 1:00, please, with item.'",
        "'speaker_0': 'Item 13. Communication from Councilwoman Gonzalez. Councilmember Peers. Councilwoman Price. Councilmember Suranga. Recommendation to requires city manager to draft a letter of support for SB 54 and SB 1080 regarding statewide efforts to phase out the sale and distribution of single use plastics in California by 2030.'",
        "'speaker_1': 'Thank you. And also, like say a few words before we, you know, do public comment.'",
        "'speaker_7': 'Yes. I just wanted to first provide my gratitude and thanks to a few members of the community who've been strong supporters of our sustainability practices and policies here in the city of Long Beach. First to our friends at El Goleta, as well as Surfrider and the Sierra Club, as well as Long Beach, 350 and Long Beach Environmental'",
        "'speaker_7': 'Alliance. Together, they have helped us not only eliminate Styrofoam containers and go through that process, but they've really built a whole framework and system around sustainability efforts as well as our sustainability commission and department. Thanks to all of them.'",
        "'speaker_7': 'Just to give you some some preliminary information that we have so far right now, we actually have just relative to the Styrofoam ban. We have more than 50 early adopters of the foam free HLB initiative. 50 businesses that have said yes to the foam free initiative prior to the inaction.'",
        "'speaker_7': 'And we're going to see more through implementation of this entire program. We also have a great program now called Bring Your Own Long Beach to encourage residents to bring you reusable to-go items to reduce our dependance on single use plastics.'",
        "'speaker_7': 'And the state is now mandating or looking at mandating opportunities to phase out single use plastics and go to reusable, recyclable and compostable by 2030. I know that everybody looks at this as very ambitious, and I know that we can do it.'",
        "'speaker_7': 'And Long Beach has absolutely been a leader. We also have about 15 businesses certified as green businesses in about 50 more in the pipeline. So I know absolutely we can do it. Our our state officials, Senator Ben Allen and Assembly member Lorena Gonzalez were the authors of this.'",
        "'speaker_7': 'And I ask my colleagues to support, I think my colleagues that have supported already. Council member Janine Pearce, Council Member Susie Price, council member Roberta Turanga. And I hope the others can support and I'll answer any questions if you have them.'",
        "'speaker_7': 'But thank you so much.'",
        "'speaker_1': 'Thank you, Councilman Pearce.'",
        "'speaker_5': 'I want to thank my colleague for once again leading on making sure that we clean up our environment. And I want to thank city staff that has really made Long Beach a model. I know that we went through a lengthy process to ban polystyrene and recognize that because of those efforts, we are at a place where the'",
        "'speaker_5': 'state is looking at expanding, cleaning up our environment. So I want to thank you and hopefully our council can support this and I look forward to hearing from community.'",
        "'speaker_1': 'Thank you, Councilman Price.'",
        "'speaker_7': 'Thank you. I, too, want to thank Councilman Councilwoman Gonzales for bringing this item forward. I like this legislation because of the amount of time that the phasing and the implementation process will take. I think that will allow everyone the opportunity to plan for the changes, which I think is very important.'",
        "'speaker_7': 'Obviously, the premise of the legislation is solid and something that we all believe in here in the city of Long Beach. It's always the rollout that has unintended consequences. So I like the lengthy rollout on this, giving everyone the opportunity to prepare for and plan ahead.'",
        "'speaker_7': 'So thank you. And I support this item.'",
        "'speaker_1': 'Thank you, Councilman.'",
        "'speaker_9': 'During the debate tomorrow night to where I thank Councilwoman Gonzales for bringing this forward as a member of the Coastal Commission, I get to see a lot of what's taking place out in the oceans. And there's this big garbage patch they call the great garbage patch out in the North Pacific that is just the size of the'",
        "'speaker_9': 'state of New York, not even plastic and in a great majority of that plastic or straws. So hopefully we can, with this legislation, make a significant impact in that we may not be able to clean up the great garbage patch, but at least we won't add to it.'",
        "'speaker_9': 'And I hope that with this legislation and I support that we can make a significant impact on it. And I also I unashamedly want to invite you to coming up in the next few months or so, we're going to have a beach clean up day here in Long Beach.'",
        "'speaker_9': 'And I hope you all are able to join me to go down the beach and let's clean up all that plastics down there. Thank you.'",
        "'speaker_1': 'Very much. Thank you. Councilman Cipriano.'",
        "'speaker_2': 'Thank you. I just have a point of clarification I'd like to have on the item and it might be phased in in a later date. But do you know, are retail sales included that would prohibit sales of EPS like on shore store shelves like Target or Smart and Vinyl?'",
        "'speaker_2': 'And if it is like is it later downstream or do you know?'",
        "'speaker_7': 'The on our current ban. Are you referring to this is these single use plastics which is aside from expanded polystyrene will be shook up but the expanded polystyrene from what I understand. I don't know that it includes the large facilities.'",
        "'speaker_7': 'We just included the small businesses that would be implemented 18 months from. I think. When did we enact that? It was September of last year. I want to say I might my dates are getting.'",
        "'speaker_11': 'Yes, if my memory is correct. We did the large first we did the city. So city is already in effect for.'",
        "'speaker_1': 'Polystyrene ban we just.'",
        "'speaker_11': 'Implemented in March for the large restaurants. I believe that was 100 and above. And then.'",
        "'speaker_9': 'Later, I think.'",
        "'speaker_1': 'In.'",
        "'speaker_2': 'The fall, we're looking.'",
        "'speaker_11': 'At the smaller businesses.'",
        "'speaker_1': 'The smaller restaurants.'",
        "'speaker_9': 'To be come into compliance phase.'",
        "'speaker_2': 'Three. So so my question I will be asked this question like that's I just want to be clear, I'm staying in support. But I just I know I'll ask this if it'll apply to products sold at retail, if you know.'",
        "'speaker_7': 'Yeah, it should. Right now, I think that they're just looking at that. So that's something that we can include, if you'd like to. It's part of our state legislative agenda as well.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'All right. Thank you.'",
        "'speaker_1': 'All right. Thank you. Are there any a public comment on this item? Please come forward. Very good he. Fully supportive of this concept and I today just happened to be and I wonder where why we call these strawberries and I picked these up today and just have a great bargain.'",
        "'speaker_1': '$0.99 over here in superior market. Try it, try it out. But I fully support that. And if you haven't done so, Google straws and you'll see the type of straws that are available that will not hurt the environment.'",
        "'speaker_1': 'It really surprised me getting inside of that there. You can use them at home, restaurants can have them or whatever but Google and study it for yourself. Thank you Mr. good you next week you.'",
        "'speaker_5': 'Good evening. Council Members Vice Mayor South and James Stellar Sewer District two resident. And I am the outreach and partnerships manager for Grid Alternatives and I've presented before on all our efforts around solar. But this is really important.'",
        "'speaker_5': 'So thank you to Councilmember Lena Gonzalez and to all that have been working to ban Styrofoam and plastic, single use plastic. This is really important. I think that Long Beach leads the way in many, many ways throughout the state of California, in our efforts to reduce greenhouse gas emissions, to reduce pollution, trash and especially plastic.'",
        "'speaker_5': 'You go to the beach to any of our beaches and I am such a nerd. I take my little bag with me and I'm constantly picking up plastic and it's a never ending job. So I appreciate all the the clean ups to that take place, but we have to stand in front of the other cities.'",
        "'speaker_5': 'We have to be at the forefront. And we really have to take this seriously because climate change is not going away. It's speeding up. In fact, you can turn on the TV any any day of the week. You can see a.'",
        "'speaker_1': 'Post.'",
        "'speaker_5': 'About, you know, the the the ways in which our environment is being impacted by Styrofoam by plastic. So I appreciate everyone supporting this letter of support and for your efforts to combat climate change and greenhouse gas emissions. Thank you.'",
        "'speaker_1': 'Thank you very much, Janie. My part of public comment not to please cast your vote.'",
        "'speaker_0': 'Councilmember Austin wishing Karis.'"
    ],
    "Recommendation to receive and file a presentation providing an update on the status of LB COAST.  (Citywide)": [
        "'speaker_1': 'Thank you. Now we'll move up to item 15 with the clerk. Please read the item.'",
        "'speaker_0': 'Item 15 is a report from financial management. Recommendation to receive and file a presentation providing an update on the status of Long Beach Coast City Way.'",
        "'speaker_1': 'Could I please get a thank you? That's very councilmembers.'",
        "'speaker_12': 'So thank you for giving us this opportunity tonight. I'm here tonight to give us a brief report, along with some of the department heads on perhaps the largest technological effort the city has done in its history. We're talking about a ERP or an enterprise planning resource enterprise resource planning system.'",
        "'speaker_12': 'So these are done by all big cities and all big corporations throughout America and throughout planet Earth. So again, this is something we've been doing for about the past three years, and we're very close to turning it on.'",
        "'speaker_12': 'For as long as i've been here. We've used the same financial h.r. And payroll systems.'",
        "'speaker_9': 'In fact.'",
        "'speaker_12': 'In the 1990s we installed 1970s technology. And it's a good thing that they made things the last back then because we've been pushing the limits of how long these systems can hold in place. Under City Council's direction, we've been implementing a new ERP system under the project name Long Beach Coast Finance Director John GROSS, Human Resource Director'",
        "'speaker_12': 'Alex Vasquez and Technology and Innovation Director Lia Erickson are supporting this project as sponsors. And they're here tonight with several members of the broader project team to share details about the exciting milestone for the project as we're getting ready to turn it on.'",
        "'speaker_12': 'Dozens of staff have been diverted from their normal operations. It's been important that we do this because we want the system to utilize institutional knowledge about our operations and because when the vendor and consultants leave, we want our own staff to fully understand and know how the system operates, how it's been built and all that.'",
        "'speaker_12': 'Citywide operations have had to be responsive and nimble, managing the heavy workloads. As a result, we're operating a little slower than usual because of this program. It's much harder for staff to take on special projects as we were having to pitch in to carry the burden for everyone.'",
        "'speaker_12': 'There is continued work to be completed for our payroll and budget phases, as well as ongoing maintenance and upgrades as the system continues to evolve and will not be stagnant like the old systems. So I want to personally thank everyone in the audience.'",
        "'speaker_12': 'This is a small portion of everybody that's been involved in the system who's directly working on the project, and all those who are back in the home departments picking up the load, working for long hours and helping the city move forward.'",
        "'speaker_12': 'With that, I want to turn it over to our leader, John Groce, to lead us through this presentation. John. Thank you. Well, tomorrow we go live. I mean, that's really the most important thing we can probably say today.'",
        "'speaker_12': 'We go live with the soft launch of phase one of this project that Pat's talk to you about. We're implementing a major new financial and payroll system. This first phase is financial. It is a major step in having Long Beach at the forefront of modern technology and to support our constant effort that Pat talked about it becoming'",
        "'speaker_12': 'more efficient and more productive all the time. The huge accomplishment that we're talking about is the result of a project and a project team working on LBE coast. It is a top city council priority and it started in 2014 when you funded the project.'",
        "'speaker_12': 'Of course, be cost stands for something. It stands for Long Beach, City Operations and Strategic Technologies, a very obvious name, all because project purpose is the implementation of Tyler Technologies, Munis Integrated ERP system, and ERP stands for Enterprise Resource Planning.'",
        "'speaker_12': 'And it really means any integrated system that manages a large, complex government administrative operation. And that's what this system does. We have in the audience, as Pat said, just a few of the people working on the project. And like me, they're wearing the colors of the project and you'll see our lanyards.'",
        "'speaker_12': 'And if you guys can all stand who are in the project standing for a little bit, we. These these are just some of the people on the project team. They include members of the steering committee. And there's a list here.'",
        "'speaker_12': 'This is just the committees and the leadership committee, the coordination committee, the focus group members, department liaisons, administrative operating officers, financial service officers, the super users training coordinators, the module team and the module team leaders. The technology and innovative staff that support the operation.'",
        "'speaker_12': 'And last and not least, Tyler Technologies personnel who have worked with us throughout the entire time. So it's you'll hear tonight about some of their amazing, amazing work. We have put over 140000 hours into this project, and we're just at phase one of three phases, 140000 hours.'",
        "'speaker_12': 'We cannot thank these dedicated people enough for their work and blood, sweat and tears in their brainpower in configuring the systems, testing, training, putting in hardware and keeping it operating and solving the many issues that come up on a daily basis.'",
        "'speaker_12': 'So thank you. And you can up thank you very much. And I'm going to turn this over for a few remarks from Leah Erickson, our Director of Technology and Innovation.'",
        "'speaker_5': 'Thank you, John. So, L.B. Coast is the largest technology project the city's ever undertaken, and it is a multigenerational generational leap forward in modernizing our business processes. As I mentioned.'",
        "'speaker_7': 'We were using 1970s mainframe.'",
        "'speaker_5': 'Technology and we implemented it in the nineties and it included things like blue screens, a use of function, keys to navigate and paper timesheets. So now we're going to a modern system that will be efficient and meet our needs into the future.'",
        "'speaker_5': 'The All Because Project addresses the.'",
        "'speaker_6': 'Fact that our current systems are so old they're not even being.'",
        "'speaker_5': 'Supported by our the software vendor. And these old non supported systems place the city at risk of inability to meet basic administrative needs and.'",
        "'speaker_6': 'Even at risk of.'",
        "'speaker_5': 'A system failure. So the new Munis ERP system is modern, and because it's modern, it requires modern technology systems and networks, which.'",
        "'speaker_6': 'Thanks to the critical technology, needs.'",
        "'speaker_5': 'Funding provided by City Council.'",
        "'speaker_6': 'The Technology and Innovation Department has been and is in the process of implementing this system, also gives us modern productivity AIDS, such as the ability to use handhelds, tablets.'",
        "'speaker_5': 'Barcodes and scanners.'",
        "'speaker_6': 'Lastly, the system.'",
        "'speaker_5': 'Will continually be updated by Tyler and our team and upgraded to allow us to continuously move forward and.'",
        "'speaker_6': 'Make sure that we're never in the position again of.'",
        "'speaker_5': 'Using decades old ERP technology. I'd now like to turn the podium over to Alex Vasquez, our human resources director.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Leah. We're pretty excited. This new.'",
        "'speaker_6': 'ERP system is.'",
        "'speaker_5': 'Going to affect all 23.'",
        "'speaker_6': 'City departments, including Harbor, Water and elected offices. Most of the administrative functions in the city are going to be impacted on the financial side.'",
        "'speaker_5': 'There will be a new purchasing system.'",
        "'speaker_6': 'A new system for paying bills, a new accounting system, and a new budget system and an inventory system as well. And these are just some examples. On the.'",
        "'speaker_5': 'Other side, the system will.'",
        "'speaker_6': 'Allow us to maintain employee information. There will be an employee self-service function that allows employees to access information.'",
        "'speaker_5': 'About.'",
        "'speaker_6': 'Their payroll and other information. And there will be a position control.'",
        "'speaker_5': 'System as well for payroll. The new.'",
        "'speaker_6': 'System will include a timekeeping and payroll processing system.'",
        "'speaker_5': 'That will help us update and function more.'",
        "'speaker_6': 'Efficiently if more efficiently. Our 6000 employees will use the new system for timekeeping and payroll purposes, and we estimate that over a thousand employees will use this system on a daily basis.'",
        "'speaker_5': 'To do their work.'",
        "'speaker_6': 'On a day to day basis.'",
        "'speaker_5': 'I want to.'",
        "'speaker_6': 'Acknowledge some of the members of the h.r. Payroll phase two team that weren't able to be here today. They're actually at a training conference that's being conducted by our ia europe vendor Tyler Technologies. They would be here tonight, but as I indicated, they're at the conference.'",
        "'speaker_6': 'So as a substitute we included a picture of them and they're here.'",
        "'speaker_5': 'With us, of course, in.'",
        "'speaker_4': 'Spirit. Yeah.'",
        "'speaker_5': 'So I'd like I'd like to turn it over back over to John.'",
        "'speaker_12': 'We thought. Thank you, Alex. We thought it would be useful to just kind of briefly describe the four stages that this project team has been going through. And we'll go through startup design, implementation and operations. That startup stage for B coast included 12000 hours to develop 3800 specifications, prepare an RFP research vendors and then select a vendor'",
        "'speaker_12': 'just to get a vendor on board. Once that happened, we moved into the design stage was a major effort for Phase one financials, the chart of accounts, which is the single most important part of any financial ERP system to develop.'",
        "'speaker_12': 'That chart of accounts took four months to develop. We are currently in the design stage for phase two h.r. Payroll. That's another big deal that is going on. And we're moving into the implementation stage for phase one, which is because we're going live the operations stage, which I don't want to underestimate will begin soon after go live'",
        "'speaker_12': '. That's when we start to normalize things. We have to go through a stabilization period. We'll have some bumps along the way and staff will get more comfortable with the new system. But we want to move into operations as soon as possible and build this into our normal functions without having to use a project.'",
        "'speaker_12': 'I've introduced to the project team and the many people who directly support the project. This project has taken key people from operations and Pat has talked about that mostly on a full time basis and sometimes at this point for two years or more.'",
        "'speaker_12': 'Other staff who are not working on the project have had to fill in and they've had to assume more responsibilities and more workload. There are 56 people on the project team. 35 of them are regular city employees. We have 46 liaisons in the various departments, 115 super users who are going to help train everybody else, 23 training'",
        "'speaker_12': 'coordinators. And there are also, as I said, many staff filling in as backfilling. I hope and trust that the many people working on the project are finding it rewarding and rewarding experience. They certainly are gaining a unique experience.'",
        "'speaker_12': 'It's once in a lifetime and at the same time they are helping to design and implement a complex and sophisticated system that will keep the city moving forward for the next 20 to 30 years. They're getting that opportunity.'",
        "'speaker_12': 'They also get the opportunity, which they can't possibly miss, of having more frustrations than they would ever want to think about there there in any major ERP system. And there's a lot of stress. So even though it is a valuable and rewarding experience, most including me, never want to go through this again.'",
        "'speaker_12': 'But I'd like to introduce now Elizabeth Haynes, who is the Financial Systems Project Lead, who will discuss the many subsystems associated with the project and then introduce you to a few people who have worked on the project.'",
        "'speaker_6': 'Thank you, John. Hello. I'm Elizabeth Haines, and I'm the bureau manager for the Financial Controls Bureau in Financial Management. And I'm assigned full time as the Phase one financials.'",
        "'speaker_5': 'Lead on this project.'",
        "'speaker_6': 'And while John may not want to do this again, this is my second time around as I served on the team that implemented our current financial system in the late nineties. So it's especially exciting to witness the launch of this modern, fully integrated Tyler Munis system.'",
        "'speaker_6': 'The Tyler Munis ERP system has many subsystems and functions. Many of the 27 subsystems and functions shown on this slide require implementation stages similar to what John has described. Designing and implementing each of these 27 subsystems and functions is a substantial effort.'",
        "'speaker_6': 'I'm going to invite some members of the project team to speak about their experience on the project. Now the first speaker is Glenda packing, and Glenda is an example of the type of dedication that our team members have.'",
        "'speaker_6': 'She was working until 2 a.m. this morning, resolving an implementation issue that was potentially impacting our move to go live. Glenda will briefly talk about the chart of accounts and the general ledger module. Glenda.'",
        "'speaker_5': 'Thank you at least a bit.'",
        "'speaker_0': 'Hello. I'm Glenda.'",
        "'speaker_5': 'Packing in. I'm the accounting officer of the comptroller's office of this man, Financial Management. And I'm assigned full time as a general ledger module lead for the project. I turn up accounts, provide a basic structure for the way the financial data is.'",
        "'speaker_5': 'Enter into an accounting system without an excellent chart of account, no financial management system will work well or efficiently. The new munis system required an account number that is 40 digits long and has a structure completely different from that of the Old City's legacy system.'",
        "'speaker_5': 'It takes.'",
        "'speaker_6': 'Months to create the new.'",
        "'speaker_5': 'Structure to meet the complex city's needs. But after we created the charge of account, we had to crosswalk or translate the old account structure to the new structure. In numbers. We crosswalk 475,743 accounts element combination into 105,147 for child accounts.'",
        "'speaker_5': 'That was a lot of work and it took us a long time. Now I would like to invite Ireland Crabtree to discuss the project and watch Wachtel.'",
        "'speaker_12': 'Thank you, Glenda. Hello. My name's Arlen Crabtree. I'm the grants and projects officer in the Budget Office of Financial Management, and I've been assigned full time as the module lead for the Project and Grants module. The Tyler Munis ERP system has a project ledger, which is a separate accounting structure from the Munis general ledger that Glenda just'",
        "'speaker_12': 'told us about. The Project Ledger is often described as the single biggest change from our current financial system. There was no project, ledger and our old accounting system as such. The Project Ledger is an entirely new concept for Long Beach and offers the city many new management and control opportunities for both projects and grants.'",
        "'speaker_12': 'Determining the best approach for the use of the project letter was a huge undertaking. Many of the accounting structures and processes used had to be designed from scratch. This was a major challenge and it took many staff hours to design and test the concepts involved.'",
        "'speaker_12': 'The city has over 2000 active projects and 400 active grants. The conversion of the city's existing projects and grants was a tremendous effort for the team and our departments. During the course of the conversion, we created over 11,000 project expense accounts to track expense activity and 3600 project funding source accounts to identify offsetting funding sources for project'",
        "'speaker_12': 'expenses. Long Beach, it's worth noting, is the largest grant conversion that Tyler Technologies has ever done. I would like to now invite Jennifer to request.'",
        "'speaker_4': 'To speak about budgeting.'",
        "'speaker_5': 'Thank you, Arlen.'",
        "'speaker_7': 'Good evening. I am Jennifer Rodriguez and I am a.'",
        "'speaker_5': 'Budget analyst in the Budget Office of Financial Management, and I am assigned full time as the module.'",
        "'speaker_7': 'Lead for Phase one.'",
        "'speaker_5': 'Budgeting. Even though the implementation of the new budget.'",
        "'speaker_0': 'System.'",
        "'speaker_7': 'Is in a future phase three, I and the budget team have been heavily involved in both Phase one and Phase two, because the.'",
        "'speaker_5': 'Budget module uses elements from both of these phases.'",
        "'speaker_8': 'Because it uses.'",
        "'speaker_5': 'Information from both phase one and.'",
        "'speaker_7': 'Phase two. We are having to.'",
        "'speaker_5': 'Develop a complex conversion process that converts not only old data to the new system, but also maintains both legacy and new accounting structures to ensure systems are fully functional. Until phase three, there are over 100,000 lines of budget balances that had to be converted, utilizing the accounts that Glenda mentioned, as well as over 2400 projects and grants'",
        "'speaker_5': 'that Arlan referenced. This is just an example of an intense prefatory work needed for the budget process, phase three. And that phase has not even started yet. Now, I would like to invite Dana Anderson to.'",
        "'speaker_7': 'Speak about phase.'",
        "'speaker_5': 'Two, the human resources payroll portion of the all cost.'",
        "'speaker_6': 'Project. Thank you, John. I am John Anderson, the labor relations manager in the Department of Human Resources, and I am here to represent the team working on phase two, who's at the tyler technologies conference?'",
        "'speaker_1': 'The h.r.'",
        "'speaker_6': 'Payroll team have made it a priority to develop stakeholder and working groups to support system design. One of the team's key efforts have been met with staff from various city departments to vet requirements and establish components that can be universally applied while also fitting into the unique needs of each department.'",
        "'speaker_6': 'An example of one of the many items that the team is considering with the operating departments is finding ways to provide online services for employees when much of the city's workforce does not have access to a work computer.'",
        "'speaker_6': 'The h.r. Payroll face to face two team is confident that when h.r. Payroll goes live, there will be an increased functionality and enhanced features for all employees. Now I would like to invite Tera van Andel to speak about the critical function of change management for the Libby Coast project.'",
        "'speaker_5': 'Thank you, Dana. I am Terry.'",
        "'speaker_6': 'Van Andel and I am the Business Process Improvement Officer and the Financial Controls Bureau of Financial Management. And I am assigned full time as the change management lead for lbe coast staff readiness as one of the most critical elements for the success of any ERP project.'",
        "'speaker_6': 'In addition to readiness, that gives our employees both the technical ability and functional skills to operate the system, we also work hard to provide psychological readiness to my change management team and change management terms. People need to move through five stages to be psychologically ready for a major implementation.'",
        "'speaker_6': 'Awareness, desire, knowledge, ability and reinforcement. Our team is focused on moving people through these stages of accepting change. Some of the ways we've done that include developing and preparing a network of individuals throughout the city to serve as conduits between the project, team and department.'",
        "'speaker_6': 'We also are facilitating events and conversations for people to learn about the project, including town halls, departmental meetings and system demos. And we also are creating and implementing many communication vehicles such as newsletters, paste up fliers and a robust intranet page.'",
        "'speaker_6': 'We feel very good about what we've been able to accomplish in a high intensity environment with constrained resources. Now, I would like to turn it over to Desiree Gutierrez to talk about the massive training effort with the financial space.'",
        "'speaker_5': 'Thank you, Terry. Hello, I'm Desiree Gutierrez and the communications officer supporting OLB Coast. I'm here tonight to share details with you on financials training. Training includes developing operational procedures, developing related training materials, and then presenting these materials. This has been a huge commitment of time for the training team and all involved.'",
        "'speaker_5': 'Just for phase one, we have ten separate booklets that have been developed. These are just two of them. In addition, we have other materials that address critical tasks that aren't covered in these books. The team is training over 1000 people for phase one.'",
        "'speaker_5': 'So far we've had 207 sessions for our ten core training classes. Most attendees take more than one class, and our total attendance count to date exceeds 3000. Training ranges from 90 minutes to 4 hours. Our results have been excellent with good comments.'",
        "'speaker_5': 'Some of those comments are here on the slide with our payroll. The Phase two change management team and training teams will be addressing the needs of all 6000 employees for both time entry and employee self-service. This will be a major task.'",
        "'speaker_5': 'I'd like to turn the podium back to John to speak about some of the challenges of implementation and operation and wrap us up.'",
        "'speaker_12': 'Thank you, Desiree, and thank you to everyone who's spoken. The chart on the screen that you're seeing gives an example of typical ERP productivity over time, and we expect that productivity for each phase of the LBE Coast project, a huge system such as we're implementing, will typically have issues at implementation and you'll see productivity go down for'",
        "'speaker_12': 'a while and that's shown on the chart. We will work at that in advance of Go Live and we've done that to minimize them, but we will have them some data conversion at go live may not go right.'",
        "'speaker_12': 'We have to fix it. We had a lot of that just before today and that's why we had people here at 2 a.m. in the morning. Their fixed hardware cannot be fully optimized until after we go live. We will have issues with hardware.'",
        "'speaker_12': 'We may have occasional slow systems. We may even have a crash. But most importantly, even with training, people are not familiar with the new complex system as they are with the old one. And there will be a learning period and an optimization period.'",
        "'speaker_12': 'Productivity will climb and after a time it will be higher than before and then continue to move higher as we will have continuous system upgrades and we intend to have a continuous improvement approach to find out how to better use the system as time goes on.'",
        "'speaker_12': 'We chose an ERP system and an implementation approach that kept both implementation and operating costs at the low end for a city of our size and complexity that was part of the 12000 hours and the time it took to select a vendor.'",
        "'speaker_12': 'We purposely looked for low implementation costs and low operating costs. We are getting great value for our investment, but we are getting the ability to be technologically and operationally excellent at the same time. Tyler Munis is a living system.'",
        "'speaker_12': 'It has regular updates and upgrades and we are designing a support structure to provide for ongoing improvements in operations, reporting and productivity. The operating costs for the Tyler Munis Munis system will be higher than the old legacy system.'",
        "'speaker_12': 'This is because the old system was a dead system with no vendor support and no build, no ability to make improvements. So there wasn't there weren't a whole lot of costs associated with it. Initial ongoing costs for the ERP system will be included in the proposed NY 20 budget.'",
        "'speaker_12': 'This will include support upgrades, testing, ongoing training and maintenance and full phasing of costs will be in FY 21. Because of the complexity of our city and our financial nature of payroll processes, it is possible we may need to supplement our initial LBE cost implementation funding, but we are working to minimize that cost if it does happen'",
        "'speaker_12': '. I'll be Khost entitled Muna. CERP are a huge step forward. The city is putting in place state of the art technology and probably more importantly, a framework for continuous improvement, as I said earlier, for the next 20 to 30 years.'",
        "'speaker_12': 'We have avoided the potential for the old legacy system. Fail for failing. Getting there is the result of an extraordinary lvy coast project team. The project will take us through three separate go live stages, each one of which will have some expected bumpiness along the way.'",
        "'speaker_12': 'All normal for any large ERP project. We're going live now with phase one, soft opening tomorrow for opening on April 15th. Phase two is well underway. Phase three will start soon. We anticipate everything being done with implementation and stabilization by the end of FY 20.'",
        "'speaker_12': 'That is September 30th of 20. When the LBE Coast implementation project comes to an end. Ongoing improvements and updates will not end. They will continue. That's one of the differences and one of the reasons we're putting in a live system as opposed to a dead system.'",
        "'speaker_12': 'As I conclude, I want to say that it's been my pleasure to serve as an L.B. Coast Project sponsor. Leah Alex and I are extremely proud of the tremendous effort and dedication that the team behind you and those who couldn't be here and departmental staff have put into implementing this first phase.'",
        "'speaker_12': 'Much more work needs to be done as we have two more phases to implement and have to stabilize the first pace phase. We will work to move the people in phase one back to their normal jobs as quickly and as much as possible.'",
        "'speaker_12': 'The project team is up to the task of getting Phase one operating and phase two in Phase three. We're very proud of the work the team has done and they will do great in the future and we cannot say enough about the team and the efforts.'",
        "'speaker_12': 'None of this would have happened without the mayor and city council support and the city manager's support for our efforts. And we all thank you very much for that support. Thank you.'",
        "'speaker_1': 'Thank you. Thank you very much. Fantastic job, Councilman Rich.'",
        "'speaker_2': 'Thank you, Vice Mayor. Just a just a few thoughts. Thank you all for your clear hard work on this very complicated matter. You know, I was looking, you know, at some of the faces in the audience. And it has to be the same face that my mom gives me when I try to explain to her Game of'",
        "'speaker_2': 'Thrones. You know, it's not for everybody. You know, I mean, I will do my best to try to summarize. This is a big deal. We're recognizing a small army that has has worked to make our system more productive and more stable, you know, less risk of a system failure.'",
        "'speaker_2': 'So I get that. You know, one thing, you know, so I recognize all of you coming down and speaking to us and having to explain this to us because you've probably sat through council meetings and where you really didn't, you know, weren't too excited about the things we were saying.'",
        "'speaker_2': 'So I get it. Budget time, stuff like that. You know, one thing that that stood out, you know, somebody said it was 140000 hours. Yep. Is that 140,000? Wow, that's impressive. These guys getting overtime?'",
        "'speaker_4': 'Yeah.'",
        "'speaker_2': 'He's turning red, but wears a the red. So, you know, when you start giving out dinner vouchers or happy hour or whatever, you don't recognize those people. Just let me know so I can show up as well. But thanks a lot to everyone.'",
        "'speaker_2': 'Incredibly good job. Looking forward to future faces. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_6': 'So this is my bag. I've experienced the Game of Thrones. That is system upgrade twice now. I was with L.A. County in 2005 when we converted over, and I was also with the assessor's office in 2014 when we started going from greenscreen over.'",
        "'speaker_6': 'And I cannot tell you how proud I am for each and every one of you and the number of committee meetings a person has to go to, to go to through a process like this, the amount of collaboration, the number of ideas that come up last minute when you're on the brink of implementing or deciding on something'",
        "'speaker_6': 'that we figure out, something we hadn't thought of, and that you take the time to rework it because it's so important. I've been one of the people who have put in multiple requests to put Mr. GROSS for reports out of the business licensing system or reports for item control or the reports for no matter what it is'",
        "'speaker_6': '. And the the system limitations have been all too frustrating. And I can only imagine how frustrating they've been for all of you working here in the city and now to have a hand in being able to make that change and to have to have the steadfast process of knowing every little intricate detail of the city, how much'",
        "'speaker_6': 'you've possibly learned about different departments and reports and needs, and now what stronger group of individuals you are knowing these systems so well. So my first request of all of you is please don't retire. Because one of the things that does happen after a big project like this is so many have been holding on to get it'",
        "'speaker_6': 'to completion that I just beg of you to consider staying. If you were thinking about retiring in the next 12 months, consider staying for another 3 to 5 years because it is a big deal. And I have watched this process multiple times.'",
        "'speaker_6': 'So thank you. Thank you. Thank you. In one of the systems we just converted, we actually still had microfiche. I don't know how many of you are alive long enough to know what microfiche is, but we still have four microfiche machines if we need them here at in Long Beach, we can give them to you from L.A.'",
        "'speaker_6': 'County. We just finally got rid of those and it's not over. So I know 140000 hours, Councilmember Richardson sounds like a lot, but the next steps are going to be the ones that count. Those 2 a.m. nights are now going to be the ones that are going to be coming up more often because as you start turning'",
        "'speaker_6': 'off, these systems are moving over. That's when you have to get this last batch of stuff in before this turns off and this turns over. And so much of that work is yet to come. So I want to appreciate you for all of that in advance.'",
        "'speaker_6': 'And then just a little story. I was standing in line at the grocery store last week and there was a person with a name tag just like this that all of you were wearing. And she's here today and she didn't know I was a council member.'",
        "'speaker_6': 'I had my mom outfit on a.k.a no makeup, yoga pants and baby food in the cart. And we started talking and she said, You work for the city of long beach. And I asked what she did. She said she worked for h.r.'",
        "'speaker_6': 'And then we started talking about the system and the system upgrades and i talked to her about how excited i am for her and all those different things and the passion in her voice. And at the end she goes, And why do you care so much?'",
        "'speaker_6': 'And I said, Oh, well, I work for the city of Long Beach too. And we shared a couple quick moments. But the passion and love that each of you have for this system, may it stay with you, but that you don't stay too committed to the modules or implementations you made because they will continue to change.'",
        "'speaker_6': 'And that is something that's good and you should be proud of because you are the shoulders of which the changes next next to derive from and that they stand on top of. So thank you. Thank you. Thank you.'",
        "'speaker_1': 'Thank you. Yes, Councilwoman Price.'",
        "'speaker_7': 'Well, I just want to say thank you to all of you, too. I know this is a big endeavor and that you've all worked really hard on this. And I want to say that I would like a lanyard as well.'",
        "'speaker_7': 'So if that's possible, I'd like to put my request in. But and I recognize some of you from John Gross's ties, how many of you guys are on his signature ties that he gets? But it's really amazing to see so many different departments and employees come together for a common cause.'",
        "'speaker_7': 'And I just wanted to recognize that and thank you for your efforts.'",
        "'speaker_1': 'Thank you, Councilman.'",
        "'speaker_5': 'I, too, want to thank you guys for being here and staying late with as the council. It's not too late. This is an early night. We're not it's not even 7:00 yet. But I really want to thank you guys for all the efforts.'",
        "'speaker_5': 'I've been a part of one process like this, not this intense and this large. And I understand how challenging, how rewarding and how proud you will be at the end. So I applaud you for that. Obviously, H.R. is one of the things that's a top priority to me.'",
        "'speaker_5': 'So I know it's great to see that we have a new process in place for H.R.. I had a question because it's one thing I keep meaning to bring up in our briefings, but I'm just going to bring it up now on billing utility billings.'",
        "'speaker_5': 'Does that touch on this? Totally separate system.'",
        "'speaker_12': 'It is a totally separate system.'",
        "'speaker_5': 'Okay. Well, I'm publicly going to put in my request I have some landlords that own multiple properties and say they pay their electricity bill or their gas and water bill at all those properties. One bill, all the properties instead of like ten bills.'",
        "'speaker_5': 'We can talk later.'",
        "'speaker_12': 'Okay. We'll look into it.'",
        "'speaker_5': 'I'm like one bill. I really appreciate your guys efforts on this. Congratulations.'",
        "'speaker_1': 'Thank you, Councilman. Awesome.'",
        "'speaker_10': 'Thank you. And obviously, I want to echo and say thank you much appreciation salute John Leha and the entire team who have been involved in this behemoth project management effort. This is a significant investment, I believe. You know, when when this first came to the council back in 2014, you know, the price tag was somewhere around $30'",
        "'speaker_10': 'million. And, you know, I almost fell out of my seat when I heard that price tag. But obviously, it's an investment in organizational, operational, operational efficiencies, coordination, better coordination between departments and the teamwork. And a spirit that has gone into this is absolutely phenomenal.'",
        "'speaker_10': 'Again, when I appreciate that, I'm not sure if I heard, but is there an estimated completion date on this project?'",
        "'speaker_12': 'We expect this project and the systems to be fully stabilized by the end of next year, September 30th, 20 end of the fiscal year.'",
        "'speaker_10': 'Thank you, Mr. GROSS. And in the word efficiencies and we talk about the improved operations and upgraded technologies, have we been able to quantify what that will save us annually when we actually implement this this new system?'",
        "'speaker_12': 'No, it's it's and it's it's a typical problem with all ERP systems are almost all of them. It's it's very difficult to quantify. There are efficiencies and savings, so we probably won't see them at the beginning because of the productivity curve.'",
        "'speaker_12': 'A lot of that savings and productivity will get used in terms of people will want better data and more reports and other things will be done. So it will it will be very difficult to quantify.'",
        "'speaker_10': 'Thank you very much. Salute.'",
        "'speaker_1': 'Thank you, Mr. Gonzalez.'",
        "'speaker_7': 'Yes. As a tech employee, this makes me very excited. And I know as a city employee makes me even more excited. So congratulations to every single one of you. I think John GROSS is buying everyone dinner tonight, which is great for all of you being here and staying late.'",
        "'speaker_7': 'But thanks again for your work. I know that this is going to be long lasting for many of us here in the city, and we just thank you for that. A couple of questions that maybe I missed or weren't mentioned or included, but the phase two specific, the specifically number nine employee reimbursements.'",
        "'speaker_7': 'Are we looking at is that just on this site or are we looking maybe at an application opportunity down the road?'",
        "'speaker_12': 'The and as described on the slide you saw the employee reimbursement is a improvement to our current processing where if an employee is on a training trip or receives reimbursement, we now we will do it through payroll in the new system as opposed through a voucher.'",
        "'speaker_12': 'It's a much better way to do right.'",
        "'speaker_7': 'But can they access it through an app?'",
        "'speaker_12': 'You're working on the whole app thing, and that is I don't think that the phase two team has had a chance to look at it, but that's one of the reasons we went to a new system is to have mobile applications potentially available.'",
        "'speaker_7': 'And this wouldn't require this platform wouldn't require an employee to be on the city server, only you can access it remotely as well.'",
        "'speaker_12': 'That's what we're working for.'",
        "'speaker_7': 'Okay.'",
        "'speaker_12': 'Just making the security issues that we're working on.'",
        "'speaker_7': 'Great. Yes, that's a big one. Okay. Well, thank you so much. Thanks for all of your work again. And I'm very excited to get this go and will see implementation very soon. Thank you. And to Lia and Alex and everyone.'",
        "'speaker_7': 'Thank you, Elizabeth. Thank you.'",
        "'speaker_1': 'Thank you. Yes, councilman.'",
        "'speaker_9': 'Phase one. Live tomorrow. What happened to will move to city hall in June. That's probably another nightmare, right?'",
        "'speaker_12': 'Well, we'll keep. City Hall move and those issues out of this. But in talking about the ERP system, the team spent a tremendous amount of time working on how are we going to deal with the move? And Leah and her group have done a super job.'",
        "'speaker_12': 'And in and of itself, we are prepared for the move to the new city hall from an ERP system viewpoint. And in fact, the old computer is being physically moved as a safety thing to the new, new, new city hall and will be sitting on the floor until we can formally turn it off at the end of'",
        "'speaker_12': 'phase two. So a lot of planning has gone into that and has made actually the whole project more complex. But Leah and her group and the technology group have addressed that issue.'",
        "'speaker_9': 'Okay. So in a nutshell, you're going to be keeping the old system on standby should something not transfer or.'",
        "'speaker_12': 'We don't believe phase one. That system doesn't take new entries. We're in a dead period. So we go live with the new system tomorrow. The old system is used just to pull off data. However, the old system will be used until we go live with phase two for payroll.'",
        "'speaker_12': 'So it is alive and operating, and that's why we need to move it to the city hall.'",
        "'speaker_9': 'Get my paycheck next week. I don't care.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_12': 'We'll try to make that even if you're the only one. Well, the.'",
        "'speaker_9': 'First personal check for young girls. Yeah.'",
        "'speaker_1': 'Thank you. First of all, I'd just like to say what you guys are doing is really fantastic. The only thing I heard about the young lady who stayed at 2:00, I really thought we had a tough job, but damn.'",
        "'speaker_1': 'Anybody stay here at 2:00 in the morning? This system better work. Say, because I know it's working. Because every time I get my check is fluctuating, so much of it is always coming out in the black. And I love that.'",
        "'speaker_1': 'So you guys, what have you doing? Keep doing it. And again, thank you guys so much. Is there any more public comment? You guys. Great job. Thank you very much. Yes.'",
        "'speaker_0': 'We take a vote?'",
        "'speaker_1': 'Yes. Can we please have a vote? All right.'",
        "'speaker_0': 'Councilmember Mongo. Motion carries.'",
        "'speaker_1': 'Thank you. We let them live before we started. Public comment.'",
        "'speaker_4': 'She.'"
    ],
    "Recommendation to request City Manager to work with the appropriate departments to report back on potential incentives and strategies to expand access to quality urgent care in neighborhoods with limited access to an acute care facility in Long Beach.": [
        "'speaker_1': 'Thank you very much. Okay. Next, we're going to move to item 21:00, please.'",
        "'speaker_0': 'Regarding item 20, report is communications from Councilmember Richardson, Councilwoman Gonzalez, Councilwoman Mango and Council Member Oranga recommendation to require city manager to report back on potential incentives and strategies to to expand access to quality urgent care in neighborhoods with limited access to an acute care facility in Long Beach.'",
        "'speaker_1': 'Thank you. Councilman Richardson.'",
        "'speaker_2': 'Thank you, Vice Mayor. So this request is pretty simple. It's to explore incentives to increase access to acute or urgent care facilities in our community. So 40% of patients who visit hospital emergency rooms have lower level emergencies, resulting in overcrowding expand extensive wait times often, often encountered in our emergency rooms.'",
        "'speaker_2': 'Urgent care centers provide rapid secondary intervention for non-life threatening injuries and ailments. Urgent care facilities offer intervention for low, lower acuity patients such as allergic reactions, nausea, wounds, lacerations, sprains and so forth. They are affordable. They often offer a minimal hours of operation, often have shorter wait times, making them a convenient alternative for medical attention.'",
        "'speaker_2': 'And looking at the map that's on the screen that was prepared by our. It shows sort of the crosses are the urgent care facilities already exist in our city or around our city and the ages of hospitals. So we actually have a lot of you know, we have a lot of urgent care facilities and hospitals in Long'",
        "'speaker_2': 'Beach. But what it shows here, where those red circles are, is, you know, where we don't have sort of immediate access to urgent care facilities, kind of really clustered in four key areas of town. So so north Long Beach.'",
        "'speaker_2': 'So the eighth and ninth Council District, the seventh and the first on the west side, much of the fifth District, and then sort of down between two and three those areas. So urgent care facilities a lot of times like to locate right next to a hospital so they can direct somebody right across the street.'",
        "'speaker_2': 'You don't want to wait. You can go across streets, urgent care. So sometimes, you know, it may so we may need to take a look at other strategies or other incentives to get them to locate maybe in some of these other areas.'",
        "'speaker_2': 'I mean, there are a lot closer. And the idea is simply if it's within walking distance or short drive or a bus ride, maybe folks won't immediately go to the emergency room. So so we just want to make sure that we're we're taking a look at some strategies as we look at, you know, the different development opportunities'",
        "'speaker_2': 'in these areas, the different land use and zoning opportunities in these areas that we figure out how to intentionally pursue some of these uses in some of these areas. So that's that's the proposal here. And we have a great opportunity here.'",
        "'speaker_2': 'Thanks a.'",
        "'speaker_1': 'Lot. Thank you. Councilman Guzman ends up.'",
        "'speaker_7': 'Yes. I think this is timely, especially after our discussion about community hospital. And I just think, Councilmember Richardson, for bringing this forward and providing more light on access to health care, which I think is the overarching idea. So thank you very much.'",
        "'speaker_7': 'And I look forward to this.'",
        "'speaker_1': 'Yes, thank you. Councilman.'",
        "'speaker_5': 'Yes. I want to thank Councilmember Richardson for bringing this forward. There was a lot of this conversation with Community Hospital as Councilmember Gonzalez brought up. And I always have felt like community hospital was such a second district's resource.'",
        "'speaker_5': 'And and through the whole process, it really talked about that. But recognizing that really we only have services in our downtown for Second District residents, that is close. One of the other conversations that we've talked with our health department about was the need for other venues of mental health support outside of a hospital and outside of psychiatric'",
        "'speaker_5': '. So just as we're coming back, I would love to to understand some of the mental health support systems that are resources that might also be in play when we think about acute care. So thank you so much for bringing this forward.'",
        "'speaker_1': 'Thank you. Is there any public comment on this item?'",
        "'speaker_2': 'My name is and I can say success for president. I think it's a great way to, you know, bring access to more urgent care facilities here in Long Beach would include, you know, maybe purchasing back Pacific Hospital from the current nursing college that runs it.'",
        "'speaker_2': 'That was an urgent care facility that bordered that was in the the sixth District in the Wrigley neighborhood, that border, the 7/7 District, which a lot of it would cut significantly. A lot of the travel time. That ambulance is coming from the west side of Long Beach where most likely they're going into St Mary's or to Memorial'",
        "'speaker_2': '. It would cut significantly the workload also, you know, just a more investigation into the practices of a lot of the ambulances and ambulance companies in Long Beach. A lot of them push out patients into Norwalk, specifically into Downey.'",
        "'speaker_2': 'And that also works into putting a lot of patients into life threatening situations because of the financial incentives of pushing out Medicaid and Medicare and Medicare clients out of the city. Just a thought. Thank you.'",
        "'speaker_1': 'Thank you. Thank you very much. You know, public comment on this now. It was a pretty scratchy vote.'",
        "'speaker_0': 'Council member Mango Vice Mayor Andrews motion and.'"
    ],
    "Recommendation to approve renaming the Uptown Dog Park as the \"Gayle Carter Uptown Dog Park\".": [
        "'speaker_1': 'Thank you. Next, we move into item 21, please, with the item.'",
        "'speaker_0': 'Item 21 is communication from Vice Mayor Andrews, chair of the Housing and Neighborhoods Committee, recommendation to approve renaming the Uptown Dock Park as the Gail Carter Uptown Dog Park.'",
        "'speaker_1': 'Thank you. This outcome from the committee that I chair. But I would like to turn this over to councilman orson.'",
        "'speaker_4': 'Well.'",
        "'speaker_10': 'Thank you, Mr. Vice Mayor. And I want to appreciate the recommendation for the committee. And and I said, obviously, we support it. Joe Carter was a was a giant in the animal community, particularly, you know, with her work, particularly the uptown area for dog parks.'",
        "'speaker_10': 'She she helped make the uptown the existing uptown dog park, making sure park is a destination place, but also helped with our implementation of Jackson Park and I believe in the ninth district as well. She was a large figure who organized activities for for for dogs and individuals in their dogs.'",
        "'speaker_10': 'Fashion shows, fitness activities really programed our park in our dog park, particularly in the shore park area. And so this is something that does is of residents who continue to utilize that park, that dog park us came out and support and signed petitions to do.'",
        "'speaker_10': 'And so I'm glad to see us finally get here and encourage everyone support go as would be. Be proud.'",
        "'speaker_1': 'Thank you, Congressman Ellison. Councilman Price Pierce. Excuse me. No. He stepped out.'",
        "'speaker_5': 'Oh, I just also wanted to to say that Gail, you know, was involved in Bixby Park way down in in in downtown area. And so really applaud the community members for rallying around this and applaud the neighborhood committee for bringing this forward.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'As any public comment on this item, not, would you please cast your vote?'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to adopt a Minute Order declaring a citywide moratorium on accepting applications for new drive-through lanes at any new or existing business establishments; direct City Manager to have the Department of Development Services and the Planning Commission review the development standards for drive-through lanes and make recommendations to the City Council; and, request City Attorney to prepare an interim (moratorium) ordinance pursuant to Chapter 21.50 of the Long Beach Municipal Code for notice and placement on the City Council agenda for hearing at its third meeting following adoption of this Minute Order.  (Citywide)": [
        "'speaker_1': 'Now we move to item 22 with clock, please. With the item. And have a staff report.'",
        "'speaker_0': 'And I think item 22 is report from Development Services recommendation to immediate order declaring a citywide moratorium on accepting applications for new drive thru lanes at any new or existing business establishments citywide.'",
        "'speaker_1': 'Not to mention.'",
        "'speaker_2': 'Thank you. I would like to make the motion here, but I would like to have a change in it. And that is, I'm in favor of having the study, but I'd like to remove the moratorium completely. My rationale for that is the fourth Council District probably has more drive thrus than any other district over the last five'",
        "'speaker_2': 'years. And that's the nature of of this item. Just on the traffic circle alone, we have seven brand new drive thrus over the last two years. We have, I think, three or four in the hopper, depending on how you count.'",
        "'speaker_2': 'So a total of a dozen drive thrus where there is an issue where one is not warranted, we exercise the process. The citizens got together, we hosted a meeting and they stopped a drive thru a Del Taco from going in at the corner of Bellflower and Abbeyfield.'",
        "'speaker_2': 'So we do have a methodology for removing them where they're not warranted. When I look at what's happened to the traffic circle area, I don't believe that what the business journal called a retail renaissance would have happened without the drive thru business model.'",
        "'speaker_2': 'It also has created jobs. Vice Mayor Dee Andrews Favorite topic employees at one of the restaurants, one of the restaurants has a traffic circle, is now the number one sales volume fast casual restaurant in the city with that.'",
        "'speaker_2': 'And so you can look at that in a lot of ways. One would be sales tax revenue. I never, never would be. In that case, it's scholarships for the employees. Students there who go to language schools received a total of $50,000 in scholarships last year.'",
        "'speaker_2': 'One of them, one crewmember, received a $25,000 scholarship alone. Customer convenience. If you think of children in child seats where you don't want to get out of the car, but you'd like to order food, the disabled are picking up food.'",
        "'speaker_2': 'Also, you know, drive thrus at the traffic circle, we have both a CVS and a Rite Aid with drive thru. So you think of the infirmed or disabled using that service. One we hear a lot about is reducing the need for parking spaces.'",
        "'speaker_2': 'That's a citywide issue and this certainly resolves a lot of that. Restaurant business models. Now, so many of them depend on the drive thru with with many brands. 70% of the business is conducted through the drive thru and Starbucks has has seen that.'",
        "'speaker_2': 'And they just opened a Starbucks at the traffic circle last week and they have another one planned for the intersection of Lakewood and Willow. I think I should also talk about the cost of meals. We spent a lot of time last week talking about low income residents.'",
        "'speaker_2': 'I've done a lot of consulting work in the restaurant industry, and one thing that a lot of folks don't believe is that there is a goal with certain brands to feed a family of four for $20. A lot of us probably can't relate to that, but there are restaurants where you can do that.'",
        "'speaker_2': 'I think that's all I have. But I stand ready for my colleagues comments and I ask for your support. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Price.'",
        "'speaker_7': 'Thank you. I support Councilman Superman's motion. I understand that the issue is one of greater significance and import to him in his district given the nature and commercial corridors in his district as opposed to those in mine. I will say that I completely agree with staff's report, the staff report, in terms of the need for this, because'",
        "'speaker_7': 'lane configurations and impact on local traffic is a major concern. And so I do support staff taking a look at this. We had an issue in one of the communities in my district. It's actually the community I live in right before I got into office with the Dunkin Donuts and the impact that it might have in the'",
        "'speaker_7': 'neighborhood and in the community. And I applaud city staff for working so closely with the residents in that community to come up with a traffic pattern that would not impact the community. And it has worked out well. So the work of our planning department and our traffic engineers was huge in that regard.'",
        "'speaker_7': 'But I think that where we have commercial corridors that are developing and plans by some property owners or lessees to build drive thrus, we certainly don't want to encumber that effort during this period of time while we study these issues.'",
        "'speaker_7': 'So with that, I support this motion and look forward to hearing from my colleagues.'",
        "'speaker_1': 'Thank you, Councilman Pearce.'",
        "'speaker_5': 'I think it would be. Great to hear a staff report, but I do I fully support the moratorium. There has been a lot of work done and this is one of those opportunities where we really can put health and wellness of our communities first.'",
        "'speaker_5': 'I also am curious to hear the staff report because I know that there's some issues with our code being outdated and just trying to make sure that we align that. And it's my understanding that everything that's already in the pipeline would remain in that pipeline.'",
        "'speaker_5': 'So if we could hear staff report first, I think that would be helpful.'",
        "'speaker_1': 'Yeah, we could yes, we could finish up this place and then we can come back to that. Councilman Richardson, please.'",
        "'speaker_2': 'Thank you, Vice Mayor. So my understanding whenever we, you know, request a moratorium is typically for a short period of time while we evaluate the rules to a system or the policy around, you know, an industry or a system.'",
        "'speaker_2': 'So, Mr. C, the attorney, is that is that correct that this is a short term moratorium while we evaluate the policy.'",
        "'speaker_11': 'The proposal this evening would be a one year moratorium, you could ask, that have come back if it's ready sooner. And the by law, I think it would be extend it could be extended for one additional year if necessary.'",
        "'speaker_2': 'So the idea isn't just the ban drive throughout the city, it's the pause, the process. Any of those that are already in the pipeline will go through. And it would just stop new applications for drive thrus until the policy is completed.'",
        "'speaker_2': 'You know, upon the adoption of the policy, we could at that point release the moratorium because the new rules are all there. Said that a good description of what we're doing tonight.'",
        "'speaker_11': 'Yes. Council has the authority this evening to exempt the projects. I believe there are nine that are currently in what we would call the pipeline this evening. And if that's the desire of the council, those projects would be allowed to continue.'",
        "'speaker_11': 'The moratorium would go into effect immediately this evening. And the minute code requires our office to bring back the ordinance at the third council meeting following tonight's action. So you have the ability to pass a moratorium this evening exempting those those applications that are in the pipeline.'",
        "'speaker_11': 'And so anybody that's in would move forward and any new applicants would then be have to wait until the moratorium came back or the ordinance came back to council for consideration.'",
        "'speaker_2': 'Councilman Super. Now, the points you made were really good points was the concern about the moratorium. Do you are some of those projects in the pipeline for your the area you represent? As I originally stated, we have seven completed I believe are actually eight, including a jack in the box on the Anaheim corridor, Starbucks at Lakewood with'",
        "'speaker_2': 'all Jack in the box that Lakewood and Willow are pending. There's also one that I'm not sure about. There's a vegan restaurant at Clark and PCH that may or may not require CCP. So it's your district. Totally, completely comfortable with saying, you know, let's move forward with what staff is prepared.'",
        "'speaker_2': 'And then those in the pipeline that you described would not, you know, be limited by the moratorium. That way, you still have the flexibility to continue whatever deals you have in the works in your district. It's important that the moratorium go in place before we change the rules because of be unclear on how that impacts the rules'",
        "'speaker_2': 'for everyone who's in the pipeline. That's why when we typically do a moratorium, it draws a clear line. If this happened, if you're in the pipeline before this date, you have the current rules, you have the pipeline beyond that date, then you'll be you know, you'll be subject to the you know, whatever the rules are.'",
        "'speaker_2': 'Once we evaluate the policy and I agree that now's a good opportunity for us to take a look at a modern drive through policy. Many cities are doing this. You know, there's new standards for drive thrus. All of this could be subject to it.'",
        "'speaker_2': 'So are you willing to to change your motion, Councilman? Super, not to say, you know, as written with the exemption, except the exception of those drive thrus in the pipeline that you described. Chair, do you recognize me to speak?'",
        "'speaker_1': 'Yes, sir. Okay.'",
        "'speaker_2': 'If I wasn't clear, I fully support the study. I fully acknowledge what this item is. All the restaurants in the pipeline say there. What I'm asking is that we don't go to a moratorium. I think it's onerous. I think it prejudices the study moving forward.'",
        "'speaker_2': 'It's so bad that we have to institute a moratorium that has not been proven. If the study proves it, then we should have a moratorium. That's. That's the motion on the floor. Okay, so I'll just make a substitute motion of staff's recommendation that allows the projects that are in the pipeline inclusive of the ones Councilman Suber not'",
        "'speaker_2': 'mentioned to continue to move forward through that pipeline, but the moratorium is included within this motion.'",
        "'speaker_11': 'And Vice Mayor and Councilmember Richardson, if I could clarify by your description of the projects that are in the pipeline, you're indicating the nine that are listed as the attachment to the city's report. Those are the nine that we have that are currently in the pipeline.'",
        "'speaker_2': 'So I don't honestly, the the point was the ones that councilman supervised, you know, speaking about if there are nine in the pipeline, they're not in my district. So, you know, I'm actually flexible on that issue with the rest of the council.'",
        "'speaker_2': 'I don't want to stop anything anyone else has going. The point was, the ones that were raised, let's keep those in the pipeline and not impact those, but establish the moratorium allows us to have a clear point to begin the evaluation of this pipeline.'",
        "'speaker_2': 'That's the intent.'",
        "'speaker_11': 'Thank you. And I think just from our position, the nine that are in the pipeline are the ones that are legally established. Okay. Have a definition. All right.'",
        "'speaker_2': 'So the nine in the pipeline. Thank you. Yes.'",
        "'speaker_1': 'All right. Thank you. Councilman Mangal.'",
        "'speaker_6': 'Thank you. So before tonight, I had done a little bit of research. I had not planned for there to be a substitute motion or a substitute substitute. Nor did I know that Councilmember Superdog was interested in lifting the moratorium.'",
        "'speaker_6': 'But in listening to his arguments, I agree with him. I did a bit of research, and I think that the challenge isn't just about having or not having drive thrus. The drive thru market has changed considerably in the last 120 days.'",
        "'speaker_6': 'So in the last 120 days, McDonald's, which is a huge provider of food in my district, has changed it so you can mobile order in advance and then just zip through the drive thru to pick it up. You don't actually have to order in line anymore, which has absolutely changed the pollution component and wait times that are'",
        "'speaker_6': 'are pending. I also did a little bit of discussion with Vesta, which is the Long Beach Town Center, specifically around the two drive thrus at the Long Beach Town Center. One is in and out and the second one is Chick-Fil-A.'",
        "'speaker_6': 'One of those two providers can get someone through the line in under 8 minutes, and that's with them doing the ordering. And the largest chunk of time related to a person entering the drive thru was actually them making the decisions and articulating verbally what they'd like to order within this.'",
        "'speaker_6': 'There is another component at play. So the real estate market in Long Beach is hot right now and there are considerable number of individuals who have signed up for franchises and franchise district areas but have not yet selected locations and are therefore not actually in the pipeline yet to have, quote unquote, drive thrus.'",
        "'speaker_6': 'And so my concern is the financial implication of a moratorium when there is already a process that the residents are able to easily utilize for the stoppage of a drive thru in a place where it would not be appropriate.'",
        "'speaker_6': 'So I'm going to make a substitute substitute motion. The bulk of my substitute substitute motion is going to be the original motion that was provided by Mr. Supercar. And then I'm going to back that up with a couple of other things.'",
        "'speaker_6': 'And here's some data that I have that I'd like to be looked into. I'd like for our drive thru staff report to include. A priority for organizations that have a goal of feeding a family of four for under $20, also a goal of more than 160 cars per hour.'",
        "'speaker_6': 'So the number of cars per hour that you can get through the line is an indicator of how little time a car has to wait to receive its order or make an order. And so the faster those cars can get pushed through, the better.'",
        "'speaker_6': 'The other thing I'd like to kind of comment on is the number of drive thrus that we have already are so greatly impacted that the lines are extending out. Very, very long length. So an example, spring in Palo Verde, the McDonald's at spring in Palo Verde.'",
        "'speaker_6': 'If you sit there in the parking lot of Stater Brothers and watch that drive thru line for 30 minutes during the morning hours, that line will extend so far back that no cars can get in or out of the parking spaces.'",
        "'speaker_6': 'And so if there aren't the opportunity for other drive thrus to enter the market, those lines will continue to be. Too long. And those length of time that the cars are in line will be longer, which entail creates greater pollution.'",
        "'speaker_6': 'So it's actually a benefit to bring more drive thrus online, to reduce the demand on the current drive thrus so that it's more equitably spread because now the other business is in the same parking lots are being impacted.'",
        "'speaker_6': 'So if you want to go to super max, your car might be blocked in because the drive thru line from McDonald's is so long you can't get in or out of your vehicle. And so if there was another drive thru location looking in which we have several currently looking for the town center, but none have been selected'",
        "'speaker_6': ', nor have any been starting in the process. I worry that this moratorium would potentially deflate that development at this time, and I think that that development right now, when that area has had food challenges, we've lost maybe six different fast casuals at the town center over the last two years is just too much for us to stand'",
        "'speaker_6': '. So I hope that my colleagues will encourage a more quick return of the report from staff so that at that time we could discuss where moratoriums make sense and where they don't. But any drive thru that any of the residents in the fifth District would like to prevent, I'd be happy to work through that process with them'",
        "'speaker_6': 'at that time, but I don't see any particularly that we're looking at and therefore I don't think a moratorium is necessary. And thank you for the second.'",
        "'speaker_1': 'Thank you. Congressman. Awesome.'",
        "'speaker_10': 'Yes. Appreciate it. I did not foresee this much debate on this issue prior to coming to the meeting this evening. I just want to get some clarification for staff in terms of why you are proposing or recommending a moratorium for 12 months.'",
        "'speaker_10': 'You know, to Council Member Mungo's point and largely what we have been focused on as a city is actually improving our economic development portfolio and trying to be more business friendly and promoting investment in the city. This to me is is runs counter to that.'",
        "'speaker_10': 'Is it a is it a workload issue or is it just do you feel like we need a pause to to do a a good policy? I'll just let that you tell us.'",
        "'speaker_1': 'At any point at any point.'",
        "'speaker_12': 'The council wants to staff reports, just let us know, because Linda can prepare all that.'",
        "'speaker_10': 'Okay. That's what I was going to say. Yeah.'",
        "'speaker_12': 'So staff report.'",
        "'speaker_10': 'You know, we were going to get to a staff report at some point. Did we? Were we?'",
        "'speaker_1': 'Yes.'",
        "'speaker_10': 'And we went after the.'",
        "'speaker_1': 'Yes.'",
        "'speaker_10': 'So the chair is we'll get to a staff report after our comments. So I will hold my comments until after the staff report, because I do want to hear from. Excuse me, the staff and and.'",
        "'speaker_1': 'You know. Yes. If you're going to hold it, why don't we just get it now and then you can. Then you have to worry about the coming back.'",
        "'speaker_10': 'Good answer. Good answer that.'",
        "'speaker_1': 'We have that. Yes, sure.'",
        "'speaker_12': 'Can.'",
        "'speaker_4': 'Linda Tatum.'",
        "'speaker_7': 'Good afternoon, Vice Mayor, members of the city council. As you are probably aware, our community has been really moving towards more sustainable, environmentally sustainable practices and more walkable, pedestrian friendly environments, particularly along our major corridors. And the notion of drive thru restaurants is is inconsistent with this.'",
        "'speaker_7': 'And because we've had a significant number of drive thrus in the last several years, 16 over the last several years, and a total in the city of 116 drive thru restaurants, we thought that.'",
        "'speaker_4': 'It was appropriate to take a pause.'",
        "'speaker_7': 'To go back, to take a look at the current development standards for drive thrus. And we are by no means suggesting that we shouldn't have drive thrus. But what.'",
        "'speaker_4': 'We wanted to do was to take a really.'",
        "'speaker_6': 'Careful look.'",
        "'speaker_7': 'At where the the locational requirements for drive thrus to be a little bit more specific and looking at some of the potential negative impacts of drive thrus. Councilwoman Mongo has mentioned a couple of those, some of the queuing issues, some of the speaker box issues, and even some of the potential vehicle and pedestrian conflicts that occur because'",
        "'speaker_7': 'of how the the queuing lanes are positioned and overall circulation on the site. So the idea was for us to pause and while we ask for a 12 month moratorium out of an abundance of caution to make sure we had enough time, I'm really confident that staff could bring back a an ordinance for the council's consideration.'",
        "'speaker_7': 'And half that time, I'd say six months at the outside, and we could potentially do something a lot sooner than that. So I.'",
        "'speaker_4': 'Would ask for a six month moratorium time.'",
        "'speaker_7': 'Frame.'",
        "'speaker_1': 'Okay. All right. So, Councilman Austin.'",
        "'speaker_10': 'So I appreciate that that that report an explanation. Can you give us any in perhaps you've done this already, but is there a quantitative analysis in terms of drive through request for permits for drive thrus in the city?'",
        "'speaker_10': 'Do we know typically how many drive thrus will be requested over the next 12 months? If we don't put forth a moratorium.'",
        "'speaker_7': 'We don't have that information currently. But what we have been averaging over the last several years is about five per year coming through our our process. And those numbers have have started to add up. And we've had a lot of feedback from constituents regarding the impact, the visual impacts of the drive through.'",
        "'speaker_7': 'And again, the issue of just the idling in the drive thrus, the addition to the greenhouse gas emissions and the air quality issues around the drive thrus, as well as the esthetic considerations all at a time when we've been trying to again make our corridors more attractive and more pedestrian friendly.'",
        "'speaker_7': 'So the idea, again.'",
        "'speaker_4': 'Is to step back, take a pause.'",
        "'speaker_7': 'Take a look at those standards and see if we can reconcile some of those standards in a way that, again, doesn't preclude drive thrus, but make sure that the locations that they are approved are appropriate from a land use perspective and the ability for the drive thru to be compatible with the surrounding uses.'",
        "'speaker_7': 'So you can prevent some of the kinds of issues that we've had that occur at some of the existing.'",
        "'speaker_4': 'Drive thru facilities.'",
        "'speaker_10': 'Well, I think we definitely need to be a lot more thoughtful and if you see an opportunity to to change policy, I certainly would support the the change in policy. My question also is, does it take 12 months to to to frame a new policy?'",
        "'speaker_7': 'No. And that was my early feedback. I think again, the standard was 12 months. So we thought that out of an abundance of caution we could ask for that. But I can again, I.'",
        "'speaker_4': 'Assure.'",
        "'speaker_7': 'You that we can bring back something within six months and likely even sooner than that.'",
        "'speaker_10': 'So you could do the policy in six months. I don't know that it's an opportunity for me to do a friendly on the motion, on the floor to to accept the six month. But I do appreciate hearing that.'",
        "'speaker_10': 'And I want to hear more from my colleagues.'",
        "'speaker_1': 'I want to go back to excuse me and apologize for Councilwoman Pearce, because the fact that I got you doing that, you asked for the. So would you please you can start now for the moment I cut you off and then I'd like for you to go now, because when you wanted to report, did you want to'",
        "'speaker_1': 'start now? Okay. So you're okay now, but I will. I see you. Okay, fine. Okay. Councilwoman Price.'",
        "'speaker_7': 'Thank you very much and I appreciate those questions from my colleagues and of course, the staffs report. A couple of questions I have here for Ms.. Tatum. So I know that we have I we think that there are reasons why we need to update our drive through policies.'",
        "'speaker_7': 'Is that correct? That's correct. Is it possible for staff to to prepare a report for council, not an ordinance change or a policy change, but take a period of 30 to 60 days to prepare a report that would outline or highlight why we need to make changes.'",
        "'speaker_7': 'And then we could that way, thereby justifying the need for a moratorium. And then a moratorium could be implemented for a six month period of time after staff has demonstrated why we even need a moratorium. The answer is yes.'",
        "'speaker_7': 'Staff certainly could.'",
        "'speaker_4': 'Take that direction.'",
        "'speaker_7': 'From council and come back with a report. Okay. So I would like to make a front. And the other thing I wanted to to say is I also want to make sure that we're that we as a council are mindful of the recommendation and the basis of the recommendation.'",
        "'speaker_7': 'So while we may not like some of the foods that are served at drive thrus, the purpose of this recommendation, the agenda ized basis for it has to do with planning and development, not the content or the the type of item that sold.'",
        "'speaker_7': 'So I want to make sure that legally we understand staff is bringing this forward because of the land use and development issues with drive thrus, not because of the type of food they're selling. We're not discriminating against the type.'",
        "'speaker_4': 'So this is all about land use.'",
        "'speaker_7': 'Yes. So I just wanted to make sure that we're very clear on that, given the our obligations under the Brown Act. But I will say that there are a variety of fast food restaurants that are emerging, many of them catering very specifically to newer clientele with healthy food options, vegan food options, things of that nature.'",
        "'speaker_7': 'And I do know that they have an interest in coming into the Long Beach market, which I think is something we want to encourage in terms of providing variety. So my recommendation and my friendly to the sub sub would be that we ask staff to prepare a report outlining the need for a moratorium and to return that'",
        "'speaker_7': 'report to council within 60 days so that we can then vote on whether or not a moratorium is justified and the length of that moratorium.'",
        "'speaker_6': 'I absolutely would support that. I feel that it is the proper cart before the horse process that's necessary, especially when there's already a process that we've seen be used successfully in blocking drive thrus. Additionally, over the last year, I've been in a process where a property has actually fallen into what I call disrepair with most multiple needs'",
        "'speaker_6': 'for code enforcement, because we were working on making sure that it was pedestrian friendly and adding pedestrian walkthroughs in places that a development services deemed necessary to make it where they felt was okay and that caused additional delays.'",
        "'speaker_6': 'So I'm very, very supportive of the friendly and I would include that that report should in some way kind of contextualize a goal, a goal for what we want a drive thru experience in the city of Long Beach to be like.'",
        "'speaker_6': 'For example, I mentioned some of the drive thrus in my district. They serve a customer every 34 seconds. And so if there are complaints about idling cars and the such, oftentimes they're they're warranted. But in other cases they might not be warranted.'",
        "'speaker_6': 'An example might be that I often get complaints about public works trucks speeding and will will will pull the report on the speedometer of that truck that's been recorded. And it was actually going 22 miles an hour. And so perceptions and realities are often different things.'",
        "'speaker_6': 'And I think that it's very important to have such a report. Thank you, Councilwoman Price, for suggesting it.'",
        "'speaker_1': 'Thank you. Yes, Councilman.'",
        "'speaker_9': 'Oh, interesting. I was originally. Pleased that the moratorium was in place. And that was what we were going to go for, because I've had a couple of establishments in my district as well that were considering drive thrus, and I wasn't totally happy what was coming forward at that time.'",
        "'speaker_9': 'And they had nothing to do with the business. He has had to do with your pets in the community and in the neighborhoods. So I was very happy when the applications did not get approved because there were some issues with it.'",
        "'speaker_9': 'Now, now that this is coming at this point where we are looking at a moratorium across the city in these types of establishments, I'm totally supportive of that. So I find the the the friendlies to the sub subs disingenuous to a great extent in the sense that we're asking to do a study before the study, when the'",
        "'speaker_9': 'study is going to actually produce what we want. So I'm going to go back. I'm just going to say let's stick to stats recommendation. I think they've been very accommodating at this point. They went from a year to six months.'",
        "'speaker_9': 'And I think that if staff can certainly do the study within that time, I think it meets everybody's goal here in terms of not being overly long in in having a moratorium for business to continue. But it also keeps in place those businesses that are already in the pipeline to get their businesses approved and have these these'",
        "'speaker_9': 'drive thru. So I'm not going to vote for the Friendly's and the double doubles or whatever it is. The sub subs. Sounds like I'm making a sandwich. Anyway, bottom line is that, you know, I want to whatever gets me back to the original motion of a moratorium with the with the recommendation that it's six months, I will'",
        "'speaker_9': 'support that.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_7': 'Yes. So right now we have a substitute substitute motion on the floor. I would agree with Councilmember Suranga as well, because although this is land use we're talking about and I fully support staff's recommendation because I think we do have a reasoning and that is because of the it says here in the discussion very clearly to me'",
        "'speaker_7': 'that it's basically the growing number of applications have provided because concerns regarding safety, esthetics and environmental impacts of this activity that are becoming more evident. And I agree as well. I think we have a lot of city plans that we put in place, mobility, sustainability plans that this would be contrary to.'",
        "'speaker_7': 'So giving us some time to think about a good policy would be great. Another statistic that I just pulled is that big boxes and large franchises, 50 to 60% of their sales are derived from drive thru Burger King, McDonald's.'",
        "'speaker_7': 'And guess what? If we took a map of where these drive thrus were located, they're located in districts that have incomes that are lower. They have people of color. And those are districts like my district. So what I would ask, as well as ensuring that and the reason why I say that is I actually did a health'",
        "'speaker_7': 'asset assessment back in gosh, this is probably like 2010. I walked with the health department to every single drive thru in the first District, how close they were to parks, how close they were to schools. You wouldn't believe how many drive thrus we had.'",
        "'speaker_7': 'Jack in the Box, Burger King del Taco, the ad. So kids going from Edison Elementary School which is by the 710 an additional impact because they have cars trucks everything going by have about ten drive thrus just in that neighborhood, maybe a one mile radius.'",
        "'speaker_7': 'So I'd like to know, because I think it'd be helpful in this discussion if we were able to get a two from four. And I hate to give you more work, Linda, but I'd like to see a map of where these drive thrus are are located.'",
        "'speaker_7': 'So the council fully has an understanding of where they're where they're at, which we would I would say they're mostly in downtown and central Long Beach, guaranteed. So the more impacts that we have, the worse that we're going to be off as a city.'",
        "'speaker_7': 'So I would love to stick with the. I would love to stick with a recommendation to go back to the original and get a two from four. That would include a map. And also, if there is a way to look at maybe getting some blips of our mobility and sustainability plans that have our goals and standards and'",
        "'speaker_7': 'how we can kind of create a better narrative as to how this this would be contrary to that. I think that would help. Maybe that that's a lot. I know that I'm trying to create another I mean, I know the subs already there, but I'd like to add a friendly to be able to get that information back'",
        "'speaker_11': '. Council Member The motion that is on the floor is the sub sub, which is to request staff to come back within 60 days with a report to council to justify the moratorium. If I understand you're friendly. If the sub sub is not successful and you get to the second motion, the substitute motion by Councilmember Richardson, which would'",
        "'speaker_11': 'staff's recommendation and allowing the nine in the pipeline and it may be amended to just limited to six months instead of 12 months. You could add your report at that time or your friendly at that time, I think is what you're asking for or is it for?'",
        "'speaker_7': 'I thought for some reason the sub sub included the six months, so it does not include it.'",
        "'speaker_11': 'The second motion for the moratorium as as currently made is staff's recommendation of one year. It could be amended when, if, if and when we get back to that motion to six months.'",
        "'speaker_6': 'So I'd like to accept it as a friendly. Anyway, can I use me.'",
        "'speaker_7': 'Excuse me. I just want to make sure that. So can you clarify the subsub? Because I want to make sure that I have that.'",
        "'speaker_11': 'Absolutely. I currently the sub sub is a report back within 60 days from staff to justify the moratorium. It also has a request to begin the study on the impacts or the possible changes to the ordinance on drive thru restaurants.'",
        "'speaker_11': 'I got all drive thrus, not just restaurants. It would be any drive thru business. A pharmacy.'",
        "'speaker_7': 'Got it. Thank you. Thank you. And so and that's a good point as well. So. Okay, great. So I would not support the subsub. I again want to say that we are want to create livable, more healthier communities, especially in the communities that need it the most.'",
        "'speaker_7': 'And I also think just another thing, too, is that it limits if we want to talk about business. It limits small business opportunities, especially local business opportunities. It provides more opportunities, I think, for the large corporations and franchises, which I don't think we're talking about.'",
        "'speaker_7': 'So I will leave it at that. I hope we can maybe get back to the original motion of a year of recommendation or at least the the the former sub. So thank you so much.'",
        "'speaker_1': 'Thank you, Congressman. Chris.'",
        "'speaker_5': 'I yeah, I'm going to start now. Okay. Thank you. So on the issue of the subsub, ie, the issue of a moratorium and we saw this with Willow, right? We say that we're going to do something in the future and then a bunch of action happens.'",
        "'speaker_5': 'So who's to say that if we to come back to us in 30 days with another report, then in the next 30 days we might not have some of these applicants go through and become in the pipeline that now we have these other ones that are in the pipeline when we already know that there's a better way'",
        "'speaker_5': 'to design these drive thrus and to to make sure that they're designed for healthy communities. So that's my challenge with the sub sub is that staff has already done the work. They already have ideas. It's six months. I understand that the word moratorium could be triggering for for some of us on the council or for some community'",
        "'speaker_5': 'folks for big box business moratoriums might freak them out for our community members. And mind you, we have a letter from Walk Long Beach, United, Cambodian Community City Fabric, Long Beach, Forward Long Beach for a short time exchange, something I can't read.'",
        "'speaker_5': 'Long Beach Alliance for Food and Fitness and Coalition for Healthy North Long Beach. These groups have been working together to try to find solutions that not only build a more walkable, pedestrian community, but also find solutions and planning.'",
        "'speaker_5': 'And so when I say healthy, it wasn't in regards to the type of food, it was in regards to the fact that we can design healthy, cool, hopefully new drive thrus. I'm a fan of drive thrus. I'm in the middle of saving a drive thru at Fourth and Juniper right now.'",
        "'speaker_5': 'That is a small business that if they go away, it'll be a Starbucks or Jack in a box. And so it's important to me that we don't allow some of the words to get in the way of writing good policy.'",
        "'speaker_5': 'So for that reason, I would not support the sub sub and I and I want to thank and applaud staff for trying to make sure that they gave us a longer time period but support coming back in six months.'",
        "'speaker_5': 'I do know that historically drive thrus have been in communities of color. Of of higher poverty. And I do recognize that in CD4 you've you have had a renaissance where you had land that opened up and that that might have been a good fit for your constituents and for the folks that drive through over there.'",
        "'speaker_5': 'Having a six month pause is smart policy. It's the right policy for our community. And I would hope that our council colleagues can can see that a six month pause is not the end of the world, and it allows everybody to have an option to design smart drivers.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Richardson.'",
        "'speaker_2': 'Thank you, Vice Mayor. So, so quickly, just a question to Steph.'",
        "'speaker_1': 'Please. I'm sorry. No.'",
        "'speaker_2': 'Oh, thanks. Thanks, Vice Mayor. So a question of staff. So these moratoriums, they're not a they're pretty common practice, are they? Would you say they're common or can you think of some examples of when we've deployed those?'",
        "'speaker_7': 'I wouldn't say they're common. They tend to be not very common. But there are a tool that most cities use as necessary. And in this case, given the plethora of drive through restaurants and our concerns about trying to really strike a good balance between the environmental concerns, the safety concerns, the esthetic concerns, we just thought it was'",
        "'speaker_7': 'appropriate to step back and take another look at the standards. So the most recent example of a moratorium that we've had here in the city is the ah one ill. That was done where from Council District eight. We got the request to go back and take a look at the large lot development standards to address extremely large'",
        "'speaker_7': 'residences on single family lots. And that moratorium was a one year moratorium, and we ended up extended that, extending it because it ended up involving a lot of engagement with the community. And it was very helpful and very productive.'",
        "'speaker_7': 'Now, in this case, because staff has already started to look at some of the issues and concerns, and that's why I'm really confident that it won't take us a year to get something back.'",
        "'speaker_2': 'Okay. So we typically so again, we typically use these moratoriums as a best practice to sort of pause the process, evaluate the policy when the policy is complete, we lift the moratorium. Staff has said that they can get it done in six months.'",
        "'speaker_2': 'What hasn't come up is uncertainty to businesses if we are in the process of changing our rules. It's difficult for businesses to make plans about if they don't know what the rules of the road are. And let's let's think about developers.'",
        "'speaker_2': 'If a development and we just had a development in my district where it got to be contentious about drive thrus, but the rules were the rules and the rules essentially said the way you plan out this development, you need to design it in a way that it pencils out.'",
        "'speaker_2': 'And these are the tools at your disposal now. If we had said we're going to change this policy in the middle of it and change the rules, that could be devastating to a project establishing a baseline and saying, Let's posit those in the pipeline, move forward.'",
        "'speaker_2': 'The rules are not changed. You know posit institute the moratorium while we discuss and debate allow for fair fair input where people are not biased against their project or you're going to jeopardize their particular project. You allows for us to actually be thoughtful about what it is we're trying to do.'",
        "'speaker_2': 'And at the end of that process, we pass a policy. We lift the moratorium. And the rules have changed. It's just cleaner to go about it in that way. Next point I'll say is that it's not a zero sum game.'",
        "'speaker_2': 'It's not you know, it's actually very close. We're talking about we're talking about a matter of six months, you know, and if there's a way for us not to create winners and losers here and work together, I think the best way to go about that is we've already exempted I mean, the substitute motion already exempted those in'",
        "'speaker_2': 'the pipeline that were raised up by Councilman Supernormal and those that are in pipeline. The staff report ultimately said they don't even have to do a year, but they need a pause of six months in order to be reasonable and get it done.'",
        "'speaker_2': 'So if we were to amend the staff recommendation and say, okay, six month moratorium. You know, get the policy done. If we don't pass the policy, then that's on us. But we give staff what they're asking for, which is a six month moratorium, so they can do good, balanced public policy that's not pressured by a project or'",
        "'speaker_2': 'development or a lobbyist or whatever it is they can do reasonable public policy. And so and so I'm not controlling the motion, but what I'm saying is if it gets back to the subject to motion, I'm happy to take it down to six months at what staff said.'",
        "'speaker_2': 'But. But who controls the motion? It's Council on Mongo. It's the Council on Mongo. Are you willing. Are you willing to change your motion to reflect staff's recommendation with a shorter moratorium of six months?'",
        "'speaker_6': 'So I appreciate your comments, Councilmember Richardson. I believe good public policy can happen with or without a moratorium. I would also bring forward a couple of things. The staff have already done a lion's share of the work. This has already been presented at a planning commission study session.'",
        "'speaker_6': 'At that time, the Planning Commission did not recommend a moratorium to the City Council nor anything else. I'd be interested in folding in some of the things that would address Councilman Gonzalez's concerns. I do think that it would be very valuable to have a report of the type and number of drive thrus by either council district or'",
        "'speaker_6': 'zip code, or maybe both columns would be helpful.'",
        "'speaker_2': 'Well, Councilwoman, you're actually next to queue up. So if there's a note to the friendly, I'll just conclude. So you can just take the floor.'",
        "'speaker_6': 'Okay. I'll think about it.'",
        "'speaker_2': 'Okay. So. Okay, so the best case scenario here, in my opinion, would be for the person who controls the motion to simply accept these compromises and move forward. Because I think there's been a lot of accommodation here. If not, then I think we need to be strong support a moderate, a modest moratorium of six months.'",
        "'speaker_2': 'So I would encourage vote no on the substitute substitute motion and the staff recommendation is is the substitute motion. And we would amend that to to make it six months. And so so that's the position I would say.'",
        "'speaker_2': 'No on the substitute substitute motion. Yes on the substitute motion. Thank you.'",
        "'speaker_1': 'Thank you. Congresswoman Soprano.'",
        "'speaker_2': 'Thank you. So let me just clear up some numbers a little bit here. I think Ms.. Tatum said that we're looking at five per year. So if you look over the last three years that I've had 12 in the fourth District, that means there's been one per year in all other council districts.'",
        "'speaker_2': 'If we're averaging five per year. So I think I just want to frame the issue there. Also, it's the concept of a moratorium. The message that sends out there for that six months that the time frame makes no difference.'",
        "'speaker_2': 'Once you put on the moratorium, the anti-business, negative tone that that creates is where the damage is. And I just think I'm all for looking, studying this issue. There's a lot of improvement to be made, but we just don't need the more important moratorium in place to do that.'",
        "'speaker_2': 'There's no requirement for it. And I think Ms.. Taylor mentioned, you know, study session with industry experts and whatnot. I think that's what you're referring to. I don't think the moratorium was brought up in those meetings. Maybe the industry would have an opinion on that, but I think we know what that would be.'",
        "'speaker_2': 'So I am supporting the subset. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Mongo.'",
        "'speaker_6': 'Thank you. So I'm going to fold in a couple of things to make sure that my colleagues feel heard and that it's inclusive. I agree with Councilmember Super not on the business messaging, and I hope the chair of Economic Development, Councilmember Richardson, will stand with the substitute substitute in letting business know that the city of Long Beach'",
        "'speaker_6': 'is and continues to be open for business. I would like to add to the motion. Instead of spending the time on a report requiring and understanding the moratorium. Send us a report back at your earliest convenience. That includes the types of policies that you're looking to for this council to adopt and that you're exploring.'",
        "'speaker_6': 'You mentioned speaker boxes, you mentioned double drive thru lines, single lines, etc., and that the report also include the types of drive thrus and the district and zip codes that they are located in. I think that that's important.'",
        "'speaker_6': 'And it's it's really important to me when I hear the council member who has received 80% of the the drive thrus of the project.'",
        "'speaker_11': 'Excuse me. If if we could make the amendment and then speak to the amendment, I'm sure that my following you.'",
        "'speaker_6': 'That's my amendment that the report include the type. Location of council district and zip code of drive thru citywide. And when I hear the council member who has received 80% of the new drive thrus, 80% of the new drive thru was in the prior three years.'",
        "'speaker_6': 'How many years have you been on council? Four years. So in four years, in three of his four years, he's received 80% of the drive thrus of the city, and he is standing against a moratorium. I think that it's important for us to stand with him.'",
        "'speaker_6': 'And for that reason, this was not anything I plan to stand up on tonight. I'm really glad that I did the research because I really didn't know it was going to be this controversial. And so I hope my colleagues will support the substitute substitute as I believe this will come back to council within 120 days, at which'",
        "'speaker_6': 'time we can make a decision on whether or not we want to adopt an ordinance or not. I think that this still supports a direction that we want to hear a policy recommendation from staff, and that we do want to ensure that we adopt policies that make it a cleaner, healthier Long Beach.'",
        "'speaker_6': 'Unfortunately, a moratorium can also condemn those that already have the drive thrus in situations that are less favorable. And I don't want that to happen. So thank you.'",
        "'speaker_1': 'Thank you. Councilman, your muranga.'",
        "'speaker_9': 'You know, the more we. The more we talk about this, the more people queue up and new things come in. So, I mean, I want to stop this now because we keep getting deeper and deeper into the minutia where I think that the original motion addresses a lot of the amendments that were brought forward.'",
        "'speaker_9': 'A lot of the friendlies that were brought forward. It's the original motion that actually encompasses all of this. The only difference between what we have now and what we had before was the elimination of the the moratorium, which Stapp has basically said, don't need a year.'",
        "'speaker_9': 'We could do it in six months, which is very workable and I think very doable. But, you know, I was going to call the question right now, but we have exactly. But we haven't had public comment yet. So I want to reserve my comment now to call the question after we hear public comment, please.'",
        "'speaker_1': 'Excuse Councilwoman Gonzalez.'",
        "'speaker_9': 'Okay.'",
        "'speaker_1': 'Now hold it. No, no, I'm not going in right now. I just want I'd like to ask the question, is the CVS in the you know, the are the pharmacies and are they and into this? MONTOYA Because that's where I'm running the problem in my district, I have more, you know, convenience, you know, stores than I have'",
        "'speaker_1': ', you know, like I say, the Taco Bell's and all of that situation. So in some of those close early and that's and they they closed early and then all of a sudden you got to drive through where they're going to be able to get their, you know, their product from the doctors.'",
        "'speaker_1': 'So that that to me could be a problem. So I'm just asking that if that is put into this motion, they are everything is what they drive through and those are added into it. Okay. All right. Well, let's continue to go on with this.'",
        "'speaker_1': 'Could we have some public comment on this and then we'll get back to it. Ladies first.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_5': 'Thank you. Like.'",
        "'speaker_0': 'We're afternoon. My name is Hilda Guyton. I'm a Coalition for Cooking Long Beach co-chair. And I'm here to let you know that, yes, you are right. Everything that we are talking here at a certain level is planning. But there is studies that says that.'",
        "'speaker_0': 'The way that we build the environment affect the health of the people. And my community is living 5 to 7 years less than the community of the Tier four and five district. And I understand that maybe you don't see what happened on my community.'",
        "'speaker_0': 'So I'm here to let you know, though. We have drive thrus and fast food on every corner. We've been working very closely with our council member to fix this, but it's almost impossible. We cannot remove the drive through that exists right now and the way that we are that the communities already built.'",
        "'speaker_0': 'Every single change affects our health. So if you don't see the health part or why are we talking, then we are. We are you are not talking on the whole spectrum. And I know that there is planning committee and there is public work and it's a lot of different thing.'",
        "'speaker_0': 'But you have to start thinking about the people.'",
        "'speaker_5': 'The people. I mean.'",
        "'speaker_0': 'I understand that businesses are good. And when we say that we closed for business is not true, because if you go to another city, they are building they are building brand new development with no drive thrus, issues, what you are giving to the people and what you are giving the opportunity to the future on health.'",
        "'speaker_0': 'My community is in the Big Three, but we have all the drive, the drive thru. We have no, no trees. And you want to say, well, why do we need trees? Well, trees are important and we have the freeways right there.'",
        "'speaker_0': 'So we are talking here about health. And I want you to think about that and maybe hear from you guys that you're talking about development, businesses and everything. But I really, really ask you to the moratorium is not going to be that much, is not going to make a difference.'",
        "'speaker_0': 'Just give us a chance to put something in place and just do it. I mean, are you going to ask my council member for Charlestown? And I want to thank you for everything that you have done and you have sane and all of you to please support of the moratorium and all the changes and all the work'",
        "'speaker_0': 'that the that the staff. And I want to thank you the staff, the city staff, for all the work that you have done. Thank you.'",
        "'speaker_8': 'Good evening, everyone. City Council members. I am so good. Me I live in the eighth district and I am one of the co-founders of Long Beach Environmental Alliance. And thank you, Hilda, for everything you said. I second what she said and her organization that she helps oversee the coalition over North Healthy North Long Beach is part of'",
        "'speaker_8': 'our alliance as well. I'm here representing Lombard, SRI 50 citizens climate lobby, the Long Beach, Gray Panthers, Cambodian Social Nation of America. And the list goes on. You can check our Facebook Long Beach Environmental Alliance. So we want them more.'",
        "'speaker_8': 'I had had a moratorium. Yes. Thank you. And where is our common sense? More cars equal, more pollution. It's easier as one, two, three. So there is one thing we all can't hide from, which is don't add a death, so why not?'",
        "'speaker_8': 'You know, improve the longevity of our lives by not permitting drive thrus in our community. I know it might just be in a certain area, but that area, you know, the air shifts, the wind, you know, whether we all are affected by air pollution and drive thrus are dangerous for pedestrians.'",
        "'speaker_8': 'I know. Ms.. Councilman Councilwoman Mongo stated something about that as well. How can we make it more safe for people? And even Councilwoman Janine Pearce said something about, you know, not just the food being healthy, but the way how it count, how can we design it to be healthier for us?'",
        "'speaker_8': 'And, you know, we live in 2019. We're in the age of technology and we should use it technology as a tool. We can get healthy, produce online, even grocery stores deliver now, too. So, hey, we can be as lazy as we want and stay at home ordering food, healthy food from our homes.'",
        "'speaker_8': 'Forget the drive thrus. I stop eating, drive fast food for a year. Now, if I can show you my abs, I would. But I can't do that.'",
        "'speaker_7': 'Right. So catch me on the beach. So, guys.'",
        "'speaker_8': 'But aside from that, I wanted to lighten the mood and just speak the truth. Um, so drive thrus are not the answer. Greenhouse. Greenhouse gas emissions. They suck. They they they cause asthma, maybe stroke, diabetes, you name it.'",
        "'speaker_8': 'I have a whole list for if you guys want to talk about it later, but I say, can I have ten more seconds? I say, why not?'",
        "'speaker_1': 'You can just keep create.'",
        "'speaker_8': 'Why not replace the drive thrus with greenspaces and grow trees? Because trees, they think they're not costly and they help improve the quality of life.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_8': 'Guys. Thank you.'",
        "'speaker_1': 'Yes. You're a great. You're going to live forever. Ever. Go ahead, young man.'",
        "'speaker_2': 'Son, I cant fe. 3 million tonnes of CO2 was pushed out into the air last year alone in the state of California due to idling cars. That's what you're referencing when you speak about this this state. I would like to think the state of New York specifically, because they're the ones who pushed the environmental standard that a'",
        "'speaker_2': 'lot of businesses. Monopolies franchise big business specifically had to adjust to and that is that 100 over 130,000 tons of CO2 is annually produced in the city of New York alone due to idling cars. And because of that, the city council there created more stricter restrictions in regards to idling.'",
        "'speaker_2': 'I think it's no more than 5 minutes. They actually have a program where you can as a common citizen, you are incentivized by the city to film cars that are idling. And due to that, it has completely reduced cars on the street that are idling.'",
        "'speaker_2': 'Also, they targeted drive thrus that are on transit corridors that cause cars to idle. And because of that, you had a phenomenon, which is these mobile order stations that McDonald's one that comes to mind specifically is the one on in second District on fourth in Alamitos.'",
        "'speaker_2': 'They had an issue with parking. They created an operation there where they have the mobile order stationed there. They don't have that problem anymore. I think that's something that we should look for. The original motion I agree with, councilman.'",
        "'speaker_2': 'Wrong. This is this is not necessarily about targeting companies that sell food that we don't like. It's about misuse of land. Specifically in the case here. You know, we're not you know, in other districts outside the fourth District, you know, we're not creating businesses to gain the focus on international students.'",
        "'speaker_2': 'You know, I like to welcome my new Saudi Indian and, you know, international friends that comes to this beautiful city to go to school at Long Beach State. But for the rest of us, I grew up in the Wrigley neighborhood and Long Beach Willow, specifically, and I grew up next 12 drive thrus.'",
        "'speaker_2': 'And these drive thrus target the youth. They don't you know, when it's in the fourth District where they're talking adults, that's a different conversation. But when they're targeting our youth and we see the epidemic of obesity and how it's a target and how it's affecting the next generation after us, I think it goes beyond just saying, oh'",
        "'speaker_2': ', well, you know, we're targeting companies that are selling food that we don't like. It's targeting the future. And we have to maintain and focus on uplifting the future generation of children. And that's not fast food. And I think a moratorium was great in that regards.'",
        "'speaker_2': 'And thank you, Steph, for pushing this. Thank you.'",
        "'speaker_9': 'Evening. Counsel My name is Kurt Davis. I have also been doing tons of research, not recently, but for a long period of time, about drive thrus and the effect that they have on our community. And I have to let you know, I accept the fact that I live in an area right next to the 91 Freeway in'",
        "'speaker_9': 'the ninth District where my life expectancy is shorter than three other than than two of the zip codes in this one, the number one is in the Andrews area, and that my household is in the 95th percentile for air pollution, according to the Southern California AQ, M.D..'",
        "'speaker_9': 'I don't like the proliferation of drive thrus. Starbucks did their own study when they wanted add a new drive thru up in Santa Barbara. They figure the average wait time is 4 minutes. That's from order to pickup. That doesn't include the time that you wait before.'",
        "'speaker_9': 'Now, if you have 400 cars a day, come in. That causes 12 tons of greenhouse gas emissions per year. That's just one drive thru that gets 400. Also, we're not really against. We are against fast food. I am.'",
        "'speaker_9': 'I am the past chair of the Coalition for Health in North Lombard. And it's all also studies proven that students that live within a quarter mile are fast food restaurants within a quarter mile of a student of the school.'",
        "'speaker_9': 'The students here have a higher propensity for obesity than the other types of schools that are farther away from those fast food restaurants. But I know the issue tonight is the drive thrus now. Our general plan is 30 years old.'",
        "'speaker_9': 'The new general plan, if you've read it, does include some restrictions against drive thrus and even for the overabundance of fast food. But I know that they need the time to continue to fine tune these regulations to make them fair for everybody.'",
        "'speaker_9': 'Now, if you're saying we only get five or five drive thrus a year, a moratorium for six months is not going to impact that much. In the last year, we had four drive thrus approved just in the ninth District, three on one development, which is the reason I got more involved in this.'",
        "'speaker_9': 'And those three drive thrus are within 50 feet of residences. I don't know what happened with the other one in the fourth District. They were able to get rid of it, but we weren't able to get rid of ours.'",
        "'speaker_9': 'You know why? Because the planning commission said their hands were tied and they regretted that they had to pass those three drive thrus through. They regretted it. It's on record. Also in the last planning commission meeting after we spoke.'",
        "'speaker_9': 'They said that that the only recourse that they saw is to ban drive thrus completely. But they thought that would be too drastic measure. That is also on record from the last Planning Commission meeting to ban drive thrus.'",
        "'speaker_9': 'And according to Baldwin Park, the city of Albert Park bans drive thrus. The City of Baldwin Park is the home of drive thrus. The first in and out was built in Baldwin Park, and now they ban drive thrus completely.'",
        "'speaker_9': 'I urge you to support marriage, not marriages, not marry yet. I urge you to support Councilman Richardson for the original motion with a six month moratorium instead of a 12 month moratorium and keep that in place. Thank you.'",
        "'speaker_1': 'Thank you. Uh, uh, what you got?'",
        "'speaker_9': 'How about if you have a wedding ring but you don't? Wait a.'",
        "'speaker_1': 'Minute. I had on that. You're not on it.'",
        "'speaker_9': 'I was at the. You took me.'",
        "'speaker_1': 'Out? No. Point of order. Point of order. This is point of order.'",
        "'speaker_9': 'No, it's point of order. Was with the.'",
        "'speaker_1': 'Excuse me. We went to a public speaker. Now Mr. Richardson comes from Richardson on the side.'",
        "'speaker_11': 'Vice Mayor. If I recall correctly, the council member from the seventh District asked to reserve his call for the question until the conclusion of public comment.'",
        "'speaker_1': 'Excuse me. That I'm just looking at the. Go ahead.'",
        "'speaker_9': 'All of that I see people cued up. I'm going to withdraw my call for the question and continue the discussion. It's Hollywood.'",
        "'speaker_1': 'Well, fine. I just am following what I see up. Councilman Richardson.'",
        "'speaker_2': 'Thank you, Vice Mayor. I just wanted to queue up once again and just thank the residents who came down to speak tonight. I know it was a difficult conversation that we had that we just went through. And I was there at the Planning Commission meeting when they said, our hands are tied.'",
        "'speaker_2': 'We really need to take a deeper look at this. And I also understand that a lot of times our communities, we get dumped on. And, you know, when it comes to liquor stores in every corner, I spent five years figuring out how do we create leverage to change the narrative around liquor stores.'",
        "'speaker_2': 'Right. Drive thrus, it's this is what's being proposed tonight is a very small thing. Six month pause while we figure it out. And everyone's committed to this. So. So I thank you for coming down. I understand. I know what it's like to live in a community adjacent to two freeways.'",
        "'speaker_2': 'When you raise up your issues and it seems like, you know, maybe they don't they're not value to the same degree as maybe a corporation or so. I understand that. So I want to thank you. Councilman Mongo, you mentioned as economic, you said I should vote with you as economic development chair.'",
        "'speaker_2': 'I just want to just want to be clear. This is not modern economic development and push in drive thrus. It isn't. And and while I think it's appropriate and fair to have a baseline for when we, you know, evaluate our policies.'",
        "'speaker_2': 'So we have some some level of stability in the marketplace. You know, I I think I just want to be clear that, you know, where we're heading as a community is more walkable, more integrated development that's scale and integrated with our local communities.'",
        "'speaker_2': 'And frankly, drive through, in my opinion, should only be leveraged in spaces that actually Councilman Andrews talked about. Like, you know, I think far if we could, I would love to just say exclude pharmacies, exclude banks, ATMs, but as a land use conversation, you really can't do that.'",
        "'speaker_2': 'And so I would love to say if if a drive thru gets me a bank in my district. Yes, that's a case for that's the case for a drive thru. If it gets me an additional pharmacy in my district, yes, that's a case and we can set those policies.'",
        "'speaker_2': 'We can't do a a moratorium based on that. Right. And so, you know, I just want I just want people to I just want to say, because that was done, I wasn't cued up again. I don't say I hear you.'",
        "'speaker_2': 'No matter how the vote turns out tonight, I hear you. We're going to keep working to fix this issue. I believe the smart, fair thing is to hit the pause button, have a moratorium, have a thoughtful conversation with all nine of us and the community to figure this out.'",
        "'speaker_2': 'And you have a commitment from city staff to get it done in six months. I don't know if that's the way the world is going to go tonight, but but that's what that's what I support. And I think that's the responsible thing for the city council to do, is to vote no on the motion that's in front'",
        "'speaker_2': 'of us and vote yes on the substitute motion. Thanks.'",
        "'speaker_1': 'Thank you, Congressman Michael.'",
        "'speaker_6': 'So I also want to tell you that I hear you. But a moratorium isn't going to help the drive thrus that already exist today, which is, I think, the bigger problem. I also think that the city is built out in a way where.'",
        "'speaker_6': 'We're not saying no to a moratorium. What we're saying right now is I'm not even sure if the numbers come in. The numbers coming in from my colleague, council member, Super Anon, my colleague, Councilmember Richardson, don't add up to the numbers that I'm hearing from development services because they said five per year and then he's had four'",
        "'speaker_6': 'and he's had three, that's seven. So we don't know where we are. I think that's a big point of this. So I think that we are going to study this issue and we want to come back with something meaningful.'",
        "'speaker_6': 'I think that it's important for us to know the types of drive thrus that we have and also to know that when people are looking to get a drive through, they're just going to drive further to get to one, which is additional greenhouse gases if they're not in the right places.'",
        "'speaker_6': 'And we already know that a lot of them are in the completely wrong places. But the city was built a long time ago. Some of our fire stations are in the completely wrong places and we're getting to an adjustment from there.'",
        "'speaker_6': 'So I hope that you'll know that my motion mirrors the original motion on the floor with additional add ons to support some of the things said by the dias. And so I hope it's not turned in a way that the people that vote yes right now are looked at in a way that they're not in favor of'",
        "'speaker_6': 'that. I'm not sure why. Member Super nor was his district was able to galvanize and prevent a drive through and that Councilmember Richardson was not I don't know the details behind that. And if within a week or so were able to find out more details, we can always agenda it again in a week or two.'",
        "'speaker_6': 'But I hope that you'll open up a dialog with all of our offices because many of us aren't aware of the challenges. There is a process in place and I think that part of this is not duplicating and doubling down on processes that make it more difficult for anything in the city.'",
        "'speaker_6': 'So thank you very much.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_7': 'So I would support a moratorium. I just want to reiterate that, and I think that the substitute substitute actually duplicates efforts. There was an eight month from, if I'm not mistaken, planning commission process. About six community groups in neighborhoods that would be impacted by drive thrus have said that they support a moratorium and staff has recommended a'",
        "'speaker_7': 'year. So I think we've done enough research and studying. I think that the community has clearly spoken and they don't just speak for North Long Beach. I know they speak for a lot of the communities within the city that have additional impacts, land use very much connected to environmental impacts and health impacts and all of that.'",
        "'speaker_7': 'I understand the thoughts about protecting the business community. I completely get that. But I also think that this absolutely is protecting the business community because it's giving us a great opportunity to get it right by, as we mentioned, taking a pause, taking a step back, and really looking at a new modern policy that will hopefully help us'",
        "'speaker_7': 'all. So I really ask my council colleagues, you have community in front of you. They don't just come here and sit for 3 hours and wait for us to just say no to them. They're here. They've done the research.'",
        "'speaker_7': 'They're continuing to do the research with our communities. And I would hope that we would just hear them out and listen and support this moratorium. So, again, no. One, the subsub subsub, I really could not support that.'",
        "'speaker_1': 'Thank you. Thank you, Councilwoman Pearce.'",
        "'speaker_5': 'I'll try to be brief. I've been sitting here and trying to think, is there a way to get to that magic spot where we all feel good? And I and I recognize that the land use element and so we we can't pass it out and say this use and not this use.'",
        "'speaker_5': 'And I was going to queue up again, but I'm struggling with what sounds like a disingenuous comment around and I hate saying that on the floor moratorium impacting existing drive thrus, I think staff has done a really good job about saying allow us to continue the process that's happened for the last eight months, allow us to take'",
        "'speaker_5': 'a pause so that businesses can thrive and they can come in and design their projects the right way. That is healthy for everybody. And so this idea of pitting business versus the residents who really live in these impacted areas is something that I can't find a middle ground anymore.'",
        "'speaker_5': 'And so I you know, I hear you guys, I urge you to continue to engage with all councilmembers and to talk about the health impacts of all council districts. And let's let's have this vote. And hopefully our council colleagues will will see that this is the best thing for those that live in disadvantaged communities and for the'",
        "'speaker_5': 'residents that live here every day and not for big business or lobbyist. Thank you.'",
        "'speaker_1': 'Councilman Austin.'",
        "'speaker_10': 'So I've heard a lot and I do appreciate the comments from the residents. I appreciate the back and forth from from the council and to me, the motion on the floor. Doesn't necessarily put forth a moratorium tonight, but does it say no to a moratorium?'",
        "'speaker_10': 'In a couple of months or in the future, it's saying let's let's study it. And I think. One mistake that we make as a council over and over and over again is if we need to make the decision tonight that it's on the agenda.'",
        "'speaker_10': 'I think the conversation has been great. I've sat back and been quiet for the most part throughout this entire debate. But I'm going to support the substitute substitute, because I think it opens the door for more information as I'm sitting here thinking, I would love to know about the drive thrus in my district.'",
        "'speaker_10': 'I would love to get a report and know specifically about the drive thrus in my my district. To to to to further analyze this and in here hear feedback from from residents. This hasn't, in my opinion, had enough of it.'",
        "'speaker_10': 'There's not enough behind it to to to justify a moratorium, in my opinion. And we can agree to disagree, but I would hope we can get to a vote.'",
        "'speaker_1': 'Yes. Councilman Pierce?'",
        "'speaker_5': 'Well, I. I also appreciate the conversation. And I want to say I appreciate the fact that the you guys are saying it's not a vote against a moratorium, that we could always moratorium down the line that are. What my issue is with that is that, say, there's somebody thinking about a drive through tomorrow and in two weeks'",
        "'speaker_5': 'they can come in. We could have ten of them come in and put in their application. So by the time the moratorium gets here, we've now screwed ourselves by telling them that it happens. It does. If we've had eight and in one year, that is the that is essentially what a moratorium, why a moratoriums are great because'",
        "'speaker_5': 'it gives you a break. It doesn't say we'll give you a break in six months from now. And so I just wanted to make sure that I cleared out all the other arguments and why I support it. But that's the point of a moratorium, is being able to do it quickly to take a pause, to be able'",
        "'speaker_5': 'to come back and have good policy in front of us. So I also have enjoyed the conversation around data and wanting to have more information as well.'",
        "'speaker_1': 'Fine, thank you very much. Before we take a vote on this, I like to ask Council on Price, were you talking about 90? You say 90, 160 days. You make that point.'",
        "'speaker_7': 'At all for the report to come back. 60 days is what I said. I said 30 to 60 days, but whatever it takes. And the report would specifically be for a justification so that those council members for whom the issue is a big one can have a justification to vote for a moratorium.'",
        "'speaker_1': 'Yeah, that's yeah. Because I think anything you guys what we're doing tonight is a lot of we do need to take a pause and really see what's going on here because we've had very good dialog, I think, in every one of our conversations.'",
        "'speaker_1': 'But I think now and I definitely understand my colleague when he says, you know, no moratorium, but I think in my area when especially when I think about certain things, where do we start it? Where do we start?'",
        "'speaker_1': 'I think we do have a lot of good reports that we've had from the staff. I want to know what's going to happen. Maybe I didn't like the term deal at all, so I think the six month thing would give us some clarification on this.'",
        "'speaker_1': 'So I really look forward to that. So I'm going to support the six month, you know, moratorium and hopefully we can come back. And I hope my colleague, Supernova Councilman Hooper, and I will understand that we will get the kind of information he needs for us this week, because I need it also for me.'",
        "'speaker_1': 'So thank you very much. And I could come for the question.'",
        "'speaker_11': 'If I could.'",
        "'speaker_2': 'Gentlemen.'",
        "'speaker_1': 'And.'",
        "'speaker_2': 'Vice Mayor, to get to the six months you vote down.'",
        "'speaker_1': 'Yeah, I'm just. Are you recognize me? Yes, I am. I want to recognize this because I think I just.'",
        "'speaker_2': 'Want to be clear. That means you will vote no on the substitute. Substitute yes and the vote yes on the on the substitute motion, which is staff's recommendation. And I would include the Sixth Amendment that gets us to the sixth month, the much shorter moratorium.'",
        "'speaker_1': 'Yes, that would be what we do, because your staff at 12 months.'",
        "'speaker_2': 'Staff had said we're going to bring it down to six.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Thank you. Please vote.'",
        "'speaker_1': 'Yes. Could we vote in on that or will.'",
        "'speaker_11': 'Voting on the substitute? Substitute?'",
        "'speaker_1': 'Yes, I think. Okay. All right. Yeah.'",
        "'speaker_0': 'Councilman Spooner, Councilmember Mongo. Motion feel.'",
        "'speaker_11': 'So Vice Mayor now would be the substitute motion of which would be staff's recommendation on the moratorium with allowing the nine that are currently in the pipeline as identified in attachment A to be allowed to proceed. Yes, there is an amendment to the Fourth Amendment.'",
        "'speaker_1': 'Yemen is back with.'",
        "'speaker_11': 'An amended six months.'",
        "'speaker_1': 'Yes. Yes.'",
        "'speaker_0': 'Councilmembers opener calls memo mango Vice Mayor Andrew's Council Murang'a.'",
        "'speaker_9': 'Woman Water Illiterate. This motion also includes the item that Councilmember Gonzales put forward as well with the TSA in there.'",
        "'speaker_2': 'What is that?'",
        "'speaker_11': 'Had it not been accepted at this time, would be appropriate time to add it, which would be a staff report to identify the type location of drive thru citywide.'",
        "'speaker_2': 'So a full report on that? Absolutely. We can include that.'",
        "'speaker_9': 'I want to make that clear.'",
        "'speaker_0': 'Motion carries. Yeah.'",
        "'speaker_1': 'Thank you. When we get them to close, we no guns. Item 22.'"
    ],
    "Recommendation to increase appropriations in the General Fund (GF) in the Parks, Recreation and Marine Department (PR) in the amount of $4,490, offset by the Fourth Council District one-time District Priority Funds transferred from the Citywide Activities Department to support the installation of adaptive swings at Stearns Champion Park; and   Decrease appropriations in the General Fund (GF) in the Citywide Activities Department (XC) to offset a transfer to the Parks, Recreation and Marine Department.": [
        "'speaker_1': 'I'm going to move to item 14 with the clock. Please read the item. COOPER It is a Super Nine that you're.'",
        "'speaker_0': 'Item 14 communications from Council membership and a recommendation to increase appropriations in the General Fund in the Parks Recreation Submarine Department in the amount of $4,490 offset by the for Council District one time district priority funds to support the installations of adaptive swings at Stone Champion Park.'",
        "'speaker_1': '25 a conference item. We do need a report on that. Okay. Would you put. Cast your vote. Okay, we got enough.'",
        "'speaker_0': 'Has been for Richardson, it's good motion carries.'",
        "'speaker_1': 'Next week. My team with the club, please. Regarding.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 5.54.010.F and 5.54.030.B, relating to Hotel Worker Safety Precautions, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Item 19, please.'",
        "'speaker_0': 'Item 19 Communication from City Attorney Recommendation to Declare Ordinance Amending the Long Beach Municipal Code relating to hotel workers safety precautions. Read the first time and leader to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_1': 'Is any public comment inside this? Gonzalez to. No. You're to.'",
        "'speaker_5': 'I would like to speak on it. I had one question for the city attorney. Could we include a private right of enforcement for hotel workers in this?'",
        "'speaker_11': 'The answer is yes. We couldn't do it tonight and pass it for first reading so we could. You have two options. I think you could either amend the motion to send us back and to revise these ordinance to add the private right.'",
        "'speaker_11': 'Or you could adopt this this evening as first reading and second reading, and we could amend it and bring it back at a future, adding that also. Yes.'",
        "'speaker_5': 'Is there a reason why we didn't include it?'",
        "'speaker_11': 'It wasn't requested at the time that this was amended. There was no private right of action requested to be amended to add it to it.'",
        "'speaker_5': 'I don't think we need long dialog on this, but I think it's smart to have a private right of action in this. And my bad. If in the past I wasn't clear and specific on wanting that. I really do appreciate the work that you, your team did on drafting this.'",
        "'speaker_5': 'So whatever we have to do to include that.'",
        "'speaker_11': 'And we can meet with your office to make sure we we can that.'",
        "'speaker_5': 'One line that that's in.'",
        "'speaker_11': 'And in essence, it really I mean, it doesn't technically have to be in there. A person could bring this right of action right now. You want it to be expressed in there. I understand that. And it makes it obviously makes it clear.'",
        "'speaker_11': 'But someone could bring it today without that.'",
        "'speaker_5': 'Yes. Okay, then let's vote on this thing and keep going. Thank you for your clarity.'",
        "'speaker_1': 'Any public comment on this item? Not, please. Okay. Price. Excuse me.'",
        "'speaker_7': 'The question I had is when this. Ordnance is available. Is it going to be translated in all of the languages for language, access policy in terms of outreach and education and all of that?'",
        "'speaker_11': 'I think the answer to that is, yes, we would we would distribute it and the clerk would we would work with the clerk to distribute it as we do any and all other ordinances. And I think that it is required to be in the five languages.'",
        "'speaker_11': 'It is not the it doesn't have the exact same language as Measure WWE did regarding that.'",
        "'speaker_7': 'Right. Okay. I just want to make sure that whatever we do, it's easy for employers to communicate to employees and that any outreach materials that we produce as a city and I think we should should be in all those languages.'",
        "'speaker_1': 'Is that?'",
        "'speaker_4': 'That sounds like it. So if this.'",
        "'speaker_11': 'Passes, then we would.'",
        "'speaker_1': 'Create an outreach strategy and figure.'",
        "'speaker_2': 'Out how to make sure everyone's aware, especially this is a limited group of hotels.'",
        "'speaker_1': 'That we can reach out to relatively easily.'",
        "'speaker_4': 'Great.'",
        "'speaker_7': 'I think this is the group that will need the most outreach.'",
        "'speaker_1': 'Please cast your vote.'",
        "'speaker_0': 'Councilmember, which is in motion carries.'",
        "'speaker_1': 'Fine. Thank you. Now we have time for public comment on non agenda items. With this request, please come forward. The speaker will have up to 3 minutes. Not agenda items. And you would like to speak. Now is the time.'",
        "'speaker_1': 'Okay. Going.'",
        "'speaker_4': 'What I'm saying is.'",
        "'speaker_1': 'Come on. You have 3 minutes. Okay.'",
        "'speaker_2': 'So you and I can say you were talking in regards to in the six how you know, you're concerned about the pharmacies. Yes. And the pharmacies being impacted by any kind of amending of the ordinance in relation to drive thrus.'"
    ]
}