{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing; consider appeals from David P. Denevan, Jeremy Arnold, and Danielle Wilson; accept Categorical Exemption CE-18-152; and  Uphold the Planning Commissions decision to approve a Site Plan Review (SPR18-033), Conditional Use Permit (CUP18-015), and Local Coastal Development Permit (LCDP18-022), to permit a change of use and renovation of The Breakers Hotel into a 185-room hotel with food and beverage venues (with onsite alcohol), banquet/meeting areas, and amenities, in the Coastal Zone at 210 East Ocean Boulevard in the Downtown Shoreline Planned Development District (PD-6)  (Application No. 1806-19).  (District 2)": [
        "'speaker_0': 'And so with that, let me go ahead and do the hearing, Madam Clerk. There'll be a hearing to.'",
        "'speaker_1': 'Report from Development Services recommendation to receive supporting documentation into the record. Conclude the public hearing. Consider appeals from David P. Donovan, Jeremy Arnold and Daniel Wilson accept categorical exemption c18 152 and uphold the Planning Commission's decision to approve a site plan, review, conditional use permit and local coastal development permit to permit a change of use and renovation'",
        "'speaker_1': '. Two of the Breakers Hotel into a 185 room hotel with food and beverage venues, banquet meeting areas and amenities in the coastal zone at 210 East Ocean Boulevard in the Downtown Shoreline Plan Development District District two.'",
        "'speaker_0': 'Thank you again. This is a hearing there's no oath that's required referring to.'",
        "'speaker_1': 'There is an oath that is required.'",
        "'speaker_0': 'There is it says no here. But if there is or if you're going to speak on this, please stand now. Okay. If you're hearing speaker and if you're not standing, taking the oath, you're not speaking. Okay. Please give the oath.'",
        "'speaker_1': 'To you and each of you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God. Thank you.'",
        "'speaker_0': 'Okay. Thank you. Everyone else. Okay, so the and so as far as speaking for that hearing is closed beyond the people that are speaking. Let me go ahead and introduce our assistant city manager, Mr. Modica.'",
        "'speaker_4': 'Thank you, Mr. Mayor. We will have a staff report on this item given by Linda Tatum, our director of development services, and her team.'",
        "'speaker_5': 'I'd like to introduce Maryanne Cronin, our senior planner and team member Alejandro Placentia, who will do the staff presentation for this item.'",
        "'speaker_2': 'Good evening, Honorable Mayor Garcia and city council members. Before you tonight is an appeal of the Planning Commission approval of the Breakers Hotel project. As noted on this slide, this project was conditionally approved by the Cultural Heritage Commission and Planning Commission in 2018.'",
        "'speaker_2': 'The requested entitlements for the project include site plan, review, conditional use permit and a local coastal development permit, which were all conditionally approved by the Planning Commission on November 15th, 2018. Within the ten day Peace Planning Commission Appeal period, three applications for appeal were filed.'",
        "'speaker_2': 'Appeal topics include conflicts with the standards established under the Victory Park Design Guidelines, PD six Zoning and the local coastal program. And that the project introduces environmental impacts. The project is a 0.49 acre site located at 210 East Ocean Boulevard.'",
        "'speaker_2': 'The project site is within sub area seven of the Downtown Shoreline Plan Development District or PD six. The site is located within the general plan land use District seven, which is the mixed use district. The site is located on the south side of Ocean Boulevard, between Locust Avenue to the west and Collins way to the east.'",
        "'speaker_2': 'Victory Park. A public park, abuts the subject property to the north. An existing easement through the public park allows for vehicular access to the site via circular driveway. The east west ashley marine way to the rear of the project site was previously vacated.'",
        "'speaker_2': 'The scope of work subject to planning commission approval included the following A change of use from a 233 unit congregate care facility to a 185 room hotel. The expansion of alcohol service to new food and beverage venues. The exterior building modifications, including restoration work roof modifications.'",
        "'speaker_2': 'And the addition of an enclosed stairwell. The addition of an outdoor rooftop pool and deck area on the east portion of the existing third floor roof. The expansion of the 14th floor rooftop terrace and addition of a new restroom structure on the 14th floor terrace, as well as the conceptual approval of driveway modifications and re landscaping.'",
        "'speaker_2': 'A victory park. As shown on this slide, the site is developed with a 13 storey building with the 14th floor, cupola and rooftop area. Two additional lower levels are located below Ocean Boulevard at street level. The building is approximately 172,000 square feet in the area and is designed in a Spanish Renaissance revival style with a gable rooftop'",
        "'speaker_2': 'roof with towers. The building was designated as a city historic landmark in 1989. These photos are of Victory Park and the existing circular driveway configuration. The driveway currently maintains a one way drive aisle with one entry and one exit at Ocean Boulevard.'",
        "'speaker_2': 'Both entry and exits intersect with the sidewalk along Ocean Boulevard. Based on the previous entitlement for a 233 unit congregate care facility with banquet room and hall rentals and restaurant areas. The proposed use would fall within the non-conforming parking rights for the building as an adaptive reuse project.'",
        "'speaker_2': 'The new parking is new parking is not required. However, the project applicant would has agreed to provide 250 offsite parking spaces at the adjacent Long Beach Convention Center and an additional 150 overflow spaces across Ocean Boulevard. The provided valet parking is at a level similar to code requirements for new buildings.'",
        "'speaker_2': 'The ground floor uses would include hotel related uses such as a lobby area, retail space, dining areas, coffee shop, lounge and wine bar, a spa and fitness center. The areas in gray are historically protected and subject to all conditions included in the Certificate of Appropriateness approval granted by the Cultural Heritage Commission.'",
        "'speaker_2': 'The third floor would feature guest rooms and a new on the existing third floor rooftop. On the 13th floor of the existing Sky Room restaurant would be renovated as part of this approval. The existing Cielo Bar is located on the 14th floor rooftop.'",
        "'speaker_2': 'A new roof terrace would be added adjacent to the existing Cielo Bar restrooms, and a bar area would be located on this terrace area. These elevations of the building labeled the areas to be modified on the exterior of the building, which include the elevator edition, elevator and stairway edition, the new railing at the pool deck and the'",
        "'speaker_2': 'new 14 floor rooftop terrace. Rehabilitation work includes re-opening previously sealed window openings and restoration of ornamental features. New period appropriate windows would be installed on the upper floors and period. Appropriate storefronts would be installed at the ground floor.'",
        "'speaker_2': 'All exterior modifications were determined by the Cultural Heritage Commission to meet the required Secretary of the Interior Standards for Rehabilitation. This slide shows the proposed east and west elevations of the building, including a view of the code required.'",
        "'speaker_2': 'Stairwell. Elevator edition. This is the proposed conceptual landscape plan for Victory Park. Vehicles will continue to access the site from a widened driveway at Ocean Boulevard, but the reconfiguration would relocate the vehicle exit onto Collins Way. This driveway relocation would remove a point of pedestrian conflict at Ocean Boulevard and provide a more continuous park area along the'",
        "'speaker_2': 'street. Frontage. New drought tolerant landscaping, fixed seating, a drinking fountain, a dog waste post and public park signage would be added to the park area. The overall Victory Park proposal increases the hardscape in the park but improves the landscaping and provides a new passive park amenities that are not present under existing conditions.'",
        "'speaker_2': 'While no net loss of dedicated parkland will occur, the widened driveway would reduce the active passive park space for private access as condition. The applicant will replace the display's parkland at a 2 to 1 ratio. In response to comments raised at the public hearing and in the appeals.'",
        "'speaker_2': 'Additional supplemental analysis in responses to comments were prepared and included in attachment j in your packets. To further demonstrate that the project meets all the required findings and that no environmental impacts would occur as a result of the re-use of the existing building.'",
        "'speaker_2': 'The use of a secure, categorical exemption was determined, determined to be appropriate. The project is the re-use of an existing landmark building. The findings for the site plan review entitlement can be made in the affirmative because the project would convert the Breakers Hotel building back to its original use.'",
        "'speaker_2': 'The modifications to the building are consistent with the Secretary of the Interior Standards for rehabilitation and would undo inappropriate modifications that were made to the building in the past. The addition of the code required stairwell and elevator additions would not provide usable square footage that represents an expansion of the existing structure.'",
        "'speaker_2': 'The new rooftop patios and swimming pool areas are accessory structures to the hotel use as condition. The building modifications are consistent with the Secretary of the Interior Standards for Rehabilitation. The findings for the local coastal development permit can be made in the affirmative because private development of the Breakers Hotel would provide enhancements to the existing public park'",
        "'speaker_2': 'areas in order to enhance public utilization of the existing recreational resource, which is consistent with Chapter three of the Coastal Act. The park would remain a public park area and appropriate signage would be added to further designate this area as public park space.'",
        "'speaker_2': 'In addition, the relocation of the driveway onto Collins Way would remove an existing point of conflict between the vehicles and pedestrians traveling on Ocean Boulevard, as well as provide a more continuous park area along the Ocean Boulevard frontage.'",
        "'speaker_2': 'The findings for the conditional use permit can also be made in the affirmative because the sale of alcoholic beverages for on site consumption was previously covered under a valid alcohol license for the property. The previous alcohol licenses would be merely transferred to the project applicant and owner.'",
        "'speaker_2': 'Consulted with the Long Beach Police Department on this application. And the Long Beach Police Department expressed no opposition, provided security measures such as security cameras and adequate lighting. Which are included as conditions of approval as such are required findings for the site plan review, local coastal development permit and conditional use permit can be made in the affirmative'",
        "'speaker_2': '. As previously noted, the use of a categorical exemption was determined to be appropriate. Public noticing was distributed in accordance with the Long Beach Municipal Code and mailed to property owners and occupants within 750 feet of the project site.'",
        "'speaker_2': 'To date, staff has received seven written comments and one phone call in response to the appeal. Noticing three letter. Three of the letters were received from one of the appellants, Mr. Donovan, regarding Victory Park. Three additional pieces of written correspondence are in support of the project.'",
        "'speaker_2': 'One letter was submitted by the applicant. In addition, one phone call was received from a local property owner in support of the project. All written correspondence is included in your packets in front of you. The recommendation to City Council is to deny the ACT, the Planning Commission recommendation to accept a categorical exemption c18 one five to approve'",
        "'speaker_2': 'the project. This concludes staff's presentation. We welcome any questions. You may as well. The appellants are present in the audience. Thank you.'",
        "'speaker_3': 'Yes.'",
        "'speaker_6': 'Through our public comment on this item.'",
        "'speaker_7': 'Excuse me, Mr. Vice Mayor, now is the time for the appellants to make their presentation. There were three separate appellants identified. If they are here, they can queue up and make their presentation. Typically, the mayor would provide a reasonable amount of time, approximately 5 minutes for each presentation.'",
        "'speaker_6': 'Thank you. I mean, you start to.'",
        "'speaker_7': 'My dear. My name is David Patrick Donovan.'",
        "'speaker_3': 'My. Talks are going to take between five and 6 minutes. Thank you. I. I support the.'",
        "'speaker_7': 'Conversion of the breakers to a four star hotel. I support wording in the staff report that says that displaced parkland in front of the breakers be replaced. On a 2 to 1 ratio. That would be per the LCP.'",
        "'speaker_7': 'I am no longer insisting that the developer provide mitigations in the Long Beach coastal zone, including sections of victory in Santa Cruz parks. I believe that the Planning Commission was not acting in the public's best interests. On November 15th, 2018, when they approved the landscape plan.'",
        "'speaker_7': 'They seem to have ignored. The staff report statement that says proposed improvements in Victory Park are designed in a manner that a member of the public would not recognize that the area north of the Breakers is public space.'",
        "'speaker_7': 'This is from input from the Long Beach Cultural Heritage Commission. I urge the City Council at the very least two men with the Planning Commission recently approved for Victory Park. You could add in an amendment statement that supports the following retention of three patches of natural lawn on the lawn the installation of two wood and steel park'",
        "'speaker_7': 'benches facing north. NW on the east side of this section of the park installation of park signage two feet high, five feet long. That state's Victory Park established 1889. City of Long Beach. That those people passing by on Ocean Boulevard know that this is indeed a public park.'",
        "'speaker_7': 'The Pacific six teams new landscape plan would help accomplish this. Having said all of the above, with the exception of the trees, the access walk in my proposed park benches. I want all. Oh, the existing lawn to remain in natural turf.'",
        "'speaker_7': 'This would be south of the driveway and north of the Ocean Boulevard sidewalk. Following the Victory Park design guidelines. DEADLINE has been there since at least 1926. It is grandfathered in. The land used is protected by the LCP.'",
        "'speaker_7': 'In the Victory Park design guideline guidelines says When do we replace long established Park Lawn with ground cover? Which of our public parks is next for this conversion to ground cover? For 53 years, I run a gardening business for me.'",
        "'speaker_7': 'Ground cover says, don't tread on me. It is my it is my experience that ground covers are very vulnerable to foot traffic as opposed to natural lawn. Per the guidelines restrict the access walkway to eight feet wide with even not staggered edges.'",
        "'speaker_7': 'The Victory Park Design Guidelines support the intent of the LCP. They are not vague principles. The guidelines are highly specific in detail, meant to keep developers from further encroaching on these two parks. Examples of this are are overpaying for non park purposes.'",
        "'speaker_7': 'At 160 ocean gate landscaped retaining walls. BLOCK public use what was meant to be in 1898, to be used as public park for all of us to enjoy. In front of a union bank building. Precious parkland has been turned into a de facto front yard.'",
        "'speaker_7': 'This part lawn is historic. This simplicity really complements the breakers. It makes a lush green foreground. For The Breakers, nicely setting apart the iconic building from Ocean Boulevard. Don't clutter the lawn with blocked concrete seats, a busy looking, staggered access walk and a variety of groundcover types.'",
        "'speaker_7': 'Keep our park simple. Keep our park historic. Keep our park completely walkable. Two things I have I have never quite gotten over. One, the last time that Breakers was remodeled, renovated. Excuse me, the developer permanently.'",
        "'speaker_0': 'Sir. What we're going to do is I know that the 5 minutes is up, but we can during hearings, we can be a little flexible. And so I'll give you another minute, if you'd like, maybe 30 seconds minutes.'",
        "'speaker_0': 'Fine. We'll just go ahead, sir.'",
        "'speaker_7': 'Remove all of the parks benches. To remove the park managers from from in front of the Millennium Center. In the early 1980s, 12 civic groups successfully fought for the inclusion of those park benches in Santa Cruz Park. I want the city council to direct staff to tell the CEO of Molina health care to restore the park benches'",
        "'speaker_7': 'and a missing drinking fan from our Santa Cruz. From our Santa Cruz Park. This would be pursuant to the original development agreement with the city of Long Beach. Thank you.'",
        "'speaker_0': 'Thank you very much. We'll have the second. Appellant Please come forward.'",
        "'speaker_8': 'Good evening, honorable council members and Mr. Mayor. My name is Jordan Sisson from the law office of Gideon Krakoff, and we represent some of the appellants as Daniel Wilson and Mr. Jeremy Arnold. Staff is recommending that you approve the project and that it falls within the category of exemption.'",
        "'speaker_8': 'That's essentially what the 900 pages uploaded yesterday states. However, we respectfully disagree. Not only do we disagree, but experts letter submitted to the record. This for the hearing agrees with us. In short. They say that this project will cause significant environmental impacts, specifically noise and traffic.'",
        "'speaker_8': 'Additionally, that the adjacent nearby residents that's going to be only about 20 feet away from the proposed outdoor rooftop improvements, only 20 to 28 feet away will suffer environmental noise impacts and that a chemical exemption isn't appropriate in this instance.'",
        "'speaker_8': 'We apologize for the last minute submissions, but again, we only saw a staff report late last night last week, so it was difficult to provide it beforehand. Additionally, appellants have been working cooperatively with the developer to potentially resolve the environmental issues.'",
        "'speaker_8': 'Unfortunately, we cannot conclude those discussions before tonight, hence why we submitted the expert stuff before this hearing. In my remaining time, I want to kind of highlight some of the issues which are before you in your packets that the expert comments rose from first.'",
        "'speaker_8': 'The second or third floor improvements will cause noise up to 56 to 85 DBA. That's significantly higher than the city's applicable five DBA threshold on changes in ambient noise. These individuals, these apartments are going to be there at nighttime, and these hotels will have loud noises from several people speaking large crowds, potentially alcohol, alcohol, charged individuals, as'",
        "'speaker_8': 'well as live music. There are no conditions that require mitigation of that noise, notwithstanding condition of approval, number 29, which shows you has to comply with the city code and the city ordinance. There's no evidence in the record submitted by the applicant that shows what the ambient noise conditions are or that even compliance with the noise ordnance'",
        "'speaker_8': 'is even feasible. And even if it was feasible, you would still have significant impacts. This is substantial evidence, this apartment complex right next to it, as well as the city as the convention center constitutes an unusual circumstance. And as I'm sure everybody's were well aware and secure, there's an unusual circumstance and there will be significant environmental impacts'",
        "'speaker_8': '. A chemical exemption is not appropriate. And my last minute and 50 seconds, I simply request you continue this hearing so staff can digest as well as counsel can digest those comments. You know, they're lengthy. They're hefty. Of course, it's going to take time to digest.'",
        "'speaker_8': 'So we simply request continue this item. Perhaps the Palins can resolve environmental issues with this project that must be resolved. If we're going to protect the community that surrounds this project. I thank you. I someone that.'",
        "'speaker_0': 'Thank you. I think we have one final appellant.'",
        "'speaker_3': 'Good evening. My name is Jeremy Arnold. Thank you. Mayor Garcia, Vice Mayor Andrew's esteemed council members. I'm a resident of Long Beach, and I oppose this project as it currently stands. I also encourage you to either reject the project or continue it so that satisfactory environmental mitigations can be agreed upon.'",
        "'speaker_3': 'Some important Seeger issues were identified in the expert comment letters submitted into the record today. Few of which I would like to name here. What particularly concerns me is the extensive noise impacts this project will bring to the area.'",
        "'speaker_3': 'Uh, as Mr. Sisson noted, the noise impacts from the proposed outdoor activities on the second and third floor rooftop areas will have impacts. Are people speaking. Uh. Outdoor amplified music, as he noted, from 56 to 85 DBA. And that doesn't even account for the cumulative impacts of all of those activities taking place at the same time.'",
        "'speaker_3': 'This is clearly a significant noise impact under secure categorical exemption is inappropriate as a result. Further, the project applicant has not submitted any noise measurements of existing ambient noise levels or evidence that compliance with the city's noise standard is even possible.'",
        "'speaker_3': 'Given all these factors, I strongly urge you to accept the appeal. Require an M.D. or ER before approving the project. Like I said, I am a resident of Long Beach in this neighborhood, and I'm not the only person around here who has serious concerns about this project.'",
        "'speaker_3': 'A lot of different folks for a lot of different reasons around this environmental issue. It sends a bad message to the to the residents. These kinds of categorical exemptions which place business interests over the public health. So again, I urge you to accept this appeal requiring mandatory I.R..'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes the appellant. We're going to now hear from the applicant. So we'll also give the applicant. 5 minutes.'",
        "'speaker_3': '8 minutes.'",
        "'speaker_0': 'Well, I believe, Mr. Attorney, that the applicant can request a little more time. So if you want. Well, we'll set it. We're going to do is will set the timer to six and we get the 615 more time.'",
        "'speaker_0': 'We'll go to eight.'",
        "'speaker_3': 'I will endeavor to be quick. Thank you, Dr. Mayor. City council members. I'm John Molina. I'm one of the partners of Pacific Six, the owner and developer of the Breakers Hotel. I've got a couple of PowerPoints to show you in a minute to address some of these issues.'",
        "'speaker_3': 'But before we get to that, I just want to say we have met with all of the appellants as late as about 4:00. I thought that we were going to be able to get something agreed to on this issue and didn't hear back.'",
        "'speaker_3': 'But we're more than happy to talk and and agree to certain mitigations with respect to Mr. Donovan. I will get into that in a few minutes and tell why some of the issues with him are not able to be mitigated, frankly, this project.'",
        "'speaker_3': 'And our goal is to thank you, sir, is to bring back an iconic building in the city. And and. Make it useful. We want to employ over 200 people in the city. We're investing over 85 million in this project.'",
        "'speaker_3': 'And I am thrilled that this is the first project that Pacific Six has taken on. And if you can watch the screen, I can step you through what this will look like in 2020. It was noted this is a long week.'",
        "'speaker_3': 'And we are applying for national recognition as a as a national landmark. So we've been very, very careful to make sure that we keep the historic look but bring it into the 21st century. This will be our new lobby.'",
        "'speaker_3': 'Within the lobby. We'll have a lobby bar. And then an all day dining restaurant of, I believe, 180 seats. 160 seats. We went to a little coffee shop that looks out over Ocean Boulevard. And then a spa that has ten treatment rooms.'",
        "'speaker_3': 'I do know that the Queen Mary has a spy. I don't know if it's a full service spa, but this will be the only hotel spa in downtown Long Beach. Welcome you all to come in and relax. This is the arcade.'",
        "'speaker_3': 'We're going to have about 12,000 square feet of meeting space. In this shows the hallway and believe the door at the far end. That's where folks used to come in to go to the Sky Room. This is the pool deck.'",
        "'speaker_3': 'This will overlook the performing arts center. And if you look at the far right, you'll see we're going to have a living wall. Our little contribution to environmental protectionism. This is a sample of our guestrooms. And then this is the this is a joke.'",
        "'speaker_3': 'This is the Sky Room. That a lot of people ask us if we're going to bring the Sky Room back. Yes, we are. Here are a couple of other. Views of the Sky Room. And you may be familiar with the Calabar, which was a small bar upstairs on the 14th floor, and we're going to open that up'",
        "'speaker_3': '. This is the bar. And then looking out over the rooftop. We want to make sure that we're good neighbors. And so one of our partners has endeavored in visiting with neighborhood groups in the downtown area and, frankly, throughout the city, to show them what this is going to look like and get their feedback.'",
        "'speaker_3': 'We've got nothing but positive feedback on this project from the neighborhood groups. We've also talked to Unite here. And we're trying to work out an arrangement where a great portion of our employees can be unionized. Unfortunately, we were not able to finish those negotiations before today, but I think we're close.'",
        "'speaker_3': 'Down on the first floor in the far west, we're going to have a jazz club. Long Beach is home to jazz, the premiere jazz station in the country. And we want this to be a place for professional jazz musicians to come hang out and play.'",
        "'speaker_3': 'So please meet us at The Breakers in 2020. Now I also have one other presentation. I don't know how to get that on.'",
        "'speaker_0': 'Can we get the. There was an additional presentation we'll go through.'",
        "'speaker_3': 'So you saw the the rendition of. The Landscaping for Victory Park. Here is the challenge we had. We calculated the maximum water usage for the space out front. The maximum is 111,000 gallons per year. Under 100% turf. We would require 200,000 gallons of water.'",
        "'speaker_3': 'So we exceed by double the amount of water that we're allowed to have. I feel a little bit silly talking about droughts given the past few days of rain. But unlike 1926, we are in an era where. Conscious.'",
        "'speaker_3': 'Our plan would require only 67,000 gallons of water. So we're at 60% of what's the maximum. We feel this is not only responsible, but we feel that the design is appealing and fits very well with the park. And again, we did meet with Mr. Donovan and will continue to do so to see if we can satisfy his'",
        "'speaker_3': 'needs. But we just can't afford to do.'",
        "'speaker_0': 'ALTER Do you need another minute?'",
        "'speaker_3': 'Mr. Molina I think that I am. I'm done on the Sequoia issues. You have responses from our attorney who did all the research, and I think staff did a wonderful job at the at the Planning Commission meeting. Staff went through point by point by point as to why the objections wouldn't hold.'",
        "'speaker_3': 'So I am done. And again, I would welcome all of you to join us in 2020.'",
        "'speaker_0': 'Okay. Thank you very much. That concludes the applicant's comments. At this time, if there's any additional public comment. Remember, this is only on the hearing and this is not on anything else. Any public comment on the hearing? I only have one.'",
        "'speaker_0': 'I'm going to just do one. I'm going to close the speakers list. So two speakers and then the speakers list is closed. Okay. Only two. So we'll have. Our first one on our second one, 3 minutes each, then we'll close.'",
        "'speaker_9': 'Good evening. In control. You should not approve the site plan review conditional. Conditional use permit and local coastal development permit for the Breakers Hotel Project until. One. The Victory Park guidelines and the California Coastal Act have been followed.'",
        "'speaker_9': 'I've given you all a copy of the guidelines. To the amount of parkland being removed from public use has been determined. And three, the lost public parkland is replaced downtown, one for one and one for one. Elsewhere in the city, as required by the Coastal Act.'",
        "'speaker_9': 'You've all been given a copy of the Victory Park guidelines adopted in 1989, because these guidelines have not been followed over the years. Victory Park has become the front yard for most of the buildings on the south side of Ocean Boulevard.'",
        "'speaker_9': 'Tonight, you have an opportunity to return Victory Park at the Breakers to the public open space it was originally designed for. The current design concept. The victory part in the current design part. Concept for Victory Park ignores the following guidelines.'",
        "'speaker_9': 'All driveways in Victory Park are prohibited. Hybrid Bermuda grass, lawns, not oak, grass and succulents. Eight foot walkways not designed as an entrance to the hotel and wooden benches not uncomfortable concrete blocks. The Cultural Heritage Commission on April 2018 expressed concerns about the driveway, and staff recommended that the driveway be narrowed to match the existing conditions with'",
        "'speaker_9': 'an overall width between 20 and 22 feet. This recommendation was ignored and the driveway has been widened to 33 feet. I quote from the Cultural Heritage Commission minutes. The widened driveway and courtyard area would effectively remove public park space.'",
        "'speaker_9': 'The proposed improvements in Victory Park are designed in a manner that a member of the public would not recognize that the area north of the Breakers is public park. Staff recommends that the design of Victory Park is revised to align with the current driveway and planting areas.'",
        "'speaker_9': 'This is what we're asking and also that coastal law be followed and that one part one. 2 to 1 park space B.'",
        "'speaker_0': 'Thank you very much. Thank you very much. Next speaker, please. And I just I just want to remind the gentleman at the end. So I close the speakers list. I'm going to let you speak. But that's that's it.'",
        "'speaker_0': 'So there's no more speakers. I had closed it before. So for the gentleman at the end, but I'm going to let you speak, so come on down. But that's it. All right. Next speaker.'",
        "'speaker_3': 'Evening. Honorable mayor, vice mayor and city council. My name is Bob Stetler. I'm an attorney with Kiesel, Young.'",
        "'speaker_0': 'And Logan.'",
        "'speaker_3': 'And I represent the developer. Pacific six Enterprises.'",
        "'speaker_0': 'And I'm here to speak on behalf of the project. I think this is an amazing opportunity in.'",
        "'speaker_3': 'Front of us. The time is now to move the project forward with all developments.'",
        "'speaker_0': 'Time is not your friend.'",
        "'speaker_3': 'And so it's I think it important at this point in time that we move to move the project forward. All right.'",
        "'speaker_0': 'Echo the excellent presentation done by staff as well.'",
        "'speaker_3': 'As by the applicant. This is a very exciting project. The Breakers.'",
        "'speaker_0': 'Hotel, as you know, was.'",
        "'speaker_3': 'Designated as a historic hotel property by.'",
        "'speaker_0': 'The Long Beach Historical Commission in 1989.'",
        "'speaker_3': 'It's being brought back to that level.'",
        "'speaker_0': 'As Mr. Molina.'",
        "'speaker_3': 'Mentioned.'",
        "'speaker_0': 'It's going to seek to be put on the National Historic.'",
        "'speaker_3': 'Registry.'",
        "'speaker_0': 'Which again.'",
        "'speaker_3': 'Is part of the $85 million investment that this development.'",
        "'speaker_0': 'Team is making in.'",
        "'speaker_3': 'This property.'",
        "'speaker_0': 'It's an important aspect and it's going to be a great asset for our convention.'",
        "'speaker_3': 'And tourism business.'",
        "'speaker_0': 'And I know Steve Gooding.'",
        "'speaker_3': 'We're here right now. He would be.'",
        "'speaker_0': 'Jumping up and down saying, yes, we need this project and we need it now.'",
        "'speaker_3': 'Jobs. It's all about jobs.'",
        "'speaker_0': '500 construction jobs. 200 permanent jobs once the hotel is up and operational.'",
        "'speaker_3': 'We need to get that done. We need to get that done now. Victory Park will.'",
        "'speaker_0': 'Receive a significant improvement. It's going to improve the safety. We're now we're going to have two exits on the ocean. We're going to have one.'",
        "'speaker_3': 'Ingress and egress will be off ocean. So that helps with the safety.'",
        "'speaker_0': 'It's going to be compliant with the 2015 California model Efficient Landscape Ordinance. As Mr. Molina alluded to before, we have limitations on how much water can be used.'",
        "'speaker_3': 'With respect to the Sequoia and the categorical.'",
        "'speaker_0': 'Exemptions, the.'",
        "'speaker_3': 'Project is eligible for category. Categorical Exemptions under Sequoia satisfies four.'",
        "'speaker_0': 'Different exemptions Class one.'",
        "'speaker_3': 'For an existing facility.'",
        "'speaker_0': 'Class 32 for the infill development, class 31 for the restoration and rehabilitation.'",
        "'speaker_3': 'Of a historical resource in Class three with respect to small facilities exemption. What's most important in addressing the.'",
        "'speaker_0': 'Comment made.'",
        "'speaker_3': 'Earlier? There's no exception available.'",
        "'speaker_0': 'There's no unusual.'",
        "'speaker_3': 'Circumstance. This property is adjacent to the Westin, the Renaissance, the Convention Center, the Terrace Theater and the outdoor area, as well as.'",
        "'speaker_0': 'Not too far away from the Hyatt Regency.'",
        "'speaker_3': 'There's the use of this property as a hotel.'",
        "'speaker_0': 'Is not an unusual circumstance. If there's no unusual circumstance, you don't go to stage.'",
        "'speaker_3': 'Two, step two under the California Supreme Court ruling in 2015. Thank you.'",
        "'speaker_0': 'Thank you very much. And our last speaker. And we'll add time for the translation.'",
        "'speaker_9': 'Thank you so much.'",
        "'speaker_3': 'We know, but I think Cappello better be walking in Long Beach for three, five years.'",
        "'speaker_2': 'My name is Frederico PEREIRA. I lived in Long Beach for 35 years.'",
        "'speaker_3': 'That's why I keep Capello for the rest of my life. I'm into don't get me wrong.'",
        "'speaker_2': 'I'm here today because I'm concerned with our environment where we live and.'",
        "'speaker_3': 'Heading back. Look at the net and follow the one that the media.'",
        "'speaker_2': 'And the impact it will have on the health of my family.'",
        "'speaker_3': 'Through their dedication.'",
        "'speaker_2': 'To the construction of this project.'",
        "'speaker_3': 'That Peter could say, I wouldn't look at the Proyecto Tenga. Let's play what I'm being told. Correct us.'",
        "'speaker_2': 'I ask that you assure that this project has regulations, the environmental regulations correctly bore Albion.'",
        "'speaker_3': 'The familiar is a local one with that and Terra.'",
        "'speaker_2': 'For the benefit of our families and the entire community.'",
        "'speaker_3': 'Temple.'",
        "'speaker_2': 'Thank you for your time.'",
        "'speaker_0': 'Thank you very much. That concludes public comment. We're going to go ahead and go back to the deliberation. So first up, we have Councilmember Pierce and there is a motion in a second.'",
        "'speaker_2': 'Thank you. I want to thank staff for your presentation, the appellants and the developer and their team for their hard work on this. I think, you know, when you think about Long Beach and you think about the images that we have in the city, the historic buildings on our coastline are one of the greatest things that really'",
        "'speaker_2': 'earmark what makes Long Beach wonderful. And when you look back and look at older photos, you can't help but notice how many beautiful buildings are gone. So I want to recognize that this is a very big project, that restoring this historic building is has to be a labor of love.'",
        "'speaker_2': 'Because I know that through your process, I'm sure you found some more costs and expenses through that process. So I just want to recognize that for the community members. I also want to recognize some of the concerns. I know that I've had several conversations with the developers on each of the appeal concerns, and I know that we'",
        "'speaker_2': 'are getting to a place where we feel like the park is going to be what we want, that we're going to have some historic nods to make sure that we are including that in the historic vision with the building, that it's accessible to residents, constituents and tourists that are going to walking by, walking down Ocean Boulevard.'",
        "'speaker_2': 'And I feel confident that those measures are going to be taken. I also know on the environmental concerns, it's an issue that's been extremely important to me. And my office met with the developer last week and owner, and we had conversations around the space program, making sure that we're talking about environmental integrity of the overall building specific'",
        "'speaker_2': 'to historic buildings and to hotels. And so I'm very thankful that that's something that you guys are going to be exploring. And what pans out? Pans out. But we know that we have the tool, we have the tools in the toolbox and that you guys are going to be using those when it comes to the noise concerns'",
        "'speaker_2': 'that were brought up by the appellants. I want to recognize that downtown is a unique location, that we have downtown events on Pine, on Ocean, the Grand Prix, and nobody knows the impacts of those like my residents on Ocean Boulevard.'",
        "'speaker_2': 'And so through my time on council, I've really tried to make sure that we hear all those concerns. I know that staff last April I agenda as an item around the impacts of noise in the downtown trying to identify what options might be.'",
        "'speaker_2': 'You know tools in our toolbox that we can use to mitigate some of the noise in our downtown. And so I just I know that I talked to special events recently, but if you could give me a timeline on when that's coming back, because that's not just for the buildings around the breakers, but it's for overall downtown'",
        "'speaker_4': '. Yes. So that agenda item and a separate one talked a little bit about all kinds of activities that are related to noise. We're studying all those together. So we expect to come back approximately in June with the noise studies, in addition to kind of the buskers and that type of entertainment.'",
        "'speaker_4': 'So the noise study that was added is pretty comprehensive. So it is taking some additional time to do consultant work, but we expect around June to be back in front of the council.'",
        "'speaker_2': 'Great. And just I know that we hired an outside consultant, a third party that was going to come in and really measure the sound and also look at the future events that we have in downtown and really want to be mindful that we're able to have a downtown that's thriving but respects the residents that lives here as'",
        "'speaker_2': 'well. And so I feel really confident on that. The area that I know has been of most discussion has been around the jobs component. And nobody knows the importance of hotel jobs in a tourism industry like I do because we have so many hotels in our downtown.'",
        "'speaker_2': 'So it's extremely important to me not only that, we have the construction jobs that are being added to our local economy, but that we have these jobs within this hotel that are going to be not just more jobs, but good jobs.'",
        "'speaker_2': 'When we look at the history of Long Beach and we look at the hotels that we have here, we know we've seen a trend where our job market is really changing. And to be able to have that balance of good jobs, of good union jobs is something that's important.'",
        "'speaker_2': 'But this appeal is based on on SICA, and I definitely have gone through it with a fine tooth comb and worked with staff and worked with the developers. I've asked that everybody continues to to talk, to have conversations and to make sure that this project's on the right path.'",
        "'speaker_2': 'I know that it's far from being completely done. I know there's still a lot of work to be done, and I am thankful for everybody that's working on this project. And I want to encourage. Community members to continue to be at that table and continue to work with the developer to ensure that Long Beach is not only'",
        "'speaker_2': 'a leader in tourism, but that we have those good jobs that are paying good wages that allow us to change our economy for the best. So I encourage my council colleagues to vote to deny the appeal today and to know that we have a commitment that these parties are going to continue to work together.'",
        "'speaker_2': 'And I expect this to be a proud gem in our downtown with good union jobs and good environmental standards and a something that's accessible to all the residents in downtown. So I'm looking forward to seeing that pan out.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. So this is certainly an exciting project. I've been following it for a while. And, you know, I can't say I didn't wake up as soon as, you know, wake up and pay attention to something you said.'",
        "'speaker_10': 'A jazz lounge, I think. Long Beach. You know, I've seen a lot of jazz lounges come and go in Long Beach. I'm hoping this is this one's a hit. But overall, it's an important project. It's a historic landmark.'",
        "'speaker_10': 'I think you're thinking big about doubling down on that historic nature of the site to add more value to the to the character of the neighborhood. I think the important you know, I want to give props to, you know, recognition a councilwoman Pearce for sitting down and really showing a willingness to work with the developer to meet'",
        "'speaker_10': 'timelines, make sure that the priorities in terms of good quality jobs on on both construction as well as the hardworking hotel workers that they are respected in this process. So I know that that's been a priority. And and I know that Mr. Molina has expressed his support for that as well.'",
        "'speaker_10': 'So I love I love to see when people come together and there's a partnership. I would encourage that conversation to continue, and I want to see more updates. Best of luck to the developer. Best of luck to everyone involved, I hope.'",
        "'speaker_10': 'I wish this is. I hope for this to become a very, very successful project. And I hope I spend a lot of time in that jazz lounge. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Pryce.'",
        "'speaker_5': 'Thank you. I, too, want to thank everyone for coming out and for expressing your concerns. I do. This is a project of huge magnitude, and to get to a place where everyone is completely satisfied is unreasonable and impossible, frankly.'",
        "'speaker_5': 'So I want to thank the developers on working so closely with city staff. And of course I want to thank city staff who first and foremost are always looking at the interests of the community and the residents and of course, our regulatory interests in trying to determine how best to frame and structure a project.'",
        "'speaker_5': 'So I want to thank city staff for that. For the developers, I think the commitment to restoration is huge and I want to thank you for that. I think there are very few people that would have a love for the city as this particular developer does.'",
        "'speaker_5': 'And the the huge investment, ongoing investment in the city is is is very much appreciated by the members of the policy board here. So I want to thank the developer for that. The facilities and the amenities look amazing.'",
        "'speaker_5': 'I appreciate that. Councilman Richardson was impressed by the Jazz Bar, but I do have to admit that I got the attention of my council colleague, Stacy Mango when the photos of the spa went up. So I think we have some plans in our future as well in 2020.'",
        "'speaker_5': 'So it's just going to be a top notch facility. And I think that it's going to make the city continue to move in a forward direction, allowing people to come and visit the area. And and, you know, every day when we talk with folks who live outside of the city, who are here for business, what we hear'",
        "'speaker_5': 'is I had no idea that Long Beach had all of this to offer. We had no idea what a great opportunity it is. And I see that all the time. So the diversified customer base that the hotel will have, will will only be good for our city, but also it'll be good for the business because you'll get'",
        "'speaker_5': 'not your traditional visitors of a high end hotel because of the nature of the events and conventions and other projects that we sponsor and support here. So thank you for the continued investment in the city and thank you to the residents who came out tonight to express your concerns.'",
        "'speaker_5': 'I will say you're working with a developer that's unusual than most, the more unusual than most in that there is an ear and a willingness to listen and and a willingness to try to mitigate. And sometimes a willingness to try to mitigate is better than most will offer a meaningful effort to mitigate is more than most will'",
        "'speaker_5': 'offer. So hopefully the continuation of the discussions does happen as promised, and there are some more opportunities to reach common ground. But with a project of this magnitude, I'm frankly surprised that there was as little issues raised as there were tonight.'",
        "'speaker_5': 'So thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Vice Mayor Rogers.'",
        "'speaker_6': 'Yes, thank you. First of all, I'd like to congratulate on the hard work that went into this project. But most of all, I just like to say the beautiful pictures that you guys showed everything. And when I heard the word Molino and Keisel, I knew then, you know, my whole life, the whole lifestyle about jobs, I knew'",
        "'speaker_6': 'that this was what I was looking to hear. And I know when you talk about jobs, I'm just hoping that this will be local jobs because this is the type of situation we build. My district may not be able to go down there, but I guarantee you they can work there.'",
        "'speaker_6': 'So that's what I'm looking for, that we will be able to hire local individuals to be able to be a part of this wonderful project. Thank you guys very much.'",
        "'speaker_0': 'Thank you. We have, I think, council councilwoman Lena Gonzales on the line. Is that right?'",
        "'speaker_2': 'Yes. I just wanted to say thank you to all parties for, you know, just being invested in the continued progress of downtown and for the community who came out and spoke today. And I know that the developer, John Molina, and his team will certainly be attuned to all those suggestions and ideas and concerns.'",
        "'speaker_2': 'But I just want to thank you overall for the values that, you know, certainly are.'",
        "'speaker_5': 'Very important for Long Beach.'",
        "'speaker_2': 'Restoration job opportunities and the connection to the community and continuing that connection to the community. So thank you so much for everything.'",
        "'speaker_0': 'Thank you. And just I'm going to conclude and I just want to just to the entire team that worked on this project, this is a fantastic restoration project and one that I completely support and have supported since it was brought forward.'",
        "'speaker_0': 'I want to add just a few things. One is the update. What I think is unique about this project is that a few hotels of this size, which is which would be a, you know, a boutique smaller hotel, but but certainly for Long Beach, a good sized hotel has as many public spaces and opportunities for the public'",
        "'speaker_0': 'to actually engage with in the building than than this property would. And if you think about all of the public amenities and public open space opportunities, whether that is the food opportunities or the bar or what caught my eye, unlike the spa and the jazz club, which was the pool room.'",
        "'speaker_0': 'I think those types of opportunities for the public to enjoy the building, which is a historic property that is really important to the city and its history I think is really important. I also want to say that, you know, I personally have been also in some conversations with the development team as well as with some of the'",
        "'speaker_0': 'appellants. And I feel those conversations are going well and I feel I feel confident that there is going to be some good resolution to some of the concerns that are on the table. And I think that the developer spoke to their interest also in in the jobs.'",
        "'speaker_0': 'And the jobs ensure that they are good jobs on site. And so I do appreciate that. And I know that those conversations are ongoing. And so, again, I think this is a fantastic project. I think that your timeline is it's aggressive, but it is.'",
        "'speaker_0': 'It's exciting. And we look forward to the additional opportunity for more hotel rooms and also the additional opportunity for the public to enjoy the building. Because right now, as we know, the building is is not operational. And certainly you are opening up more of the building to the public than before.'",
        "'speaker_0': 'And I think that's really great as well. So so thank you. And with that, we're going to take a vote. This is to deny the appeals as per Councilmember Pierce's motion. And we're doing a roll call vote just because of we have one member that is at a remote location.'",
        "'speaker_0': 'So Councilmember Gonzales and then we'll go down.'",
        "'speaker_1': 'Councilwoman?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Councilmember Pierce. Councilwoman Price, Councilmember Supernanny. Hi, Councilwoman Mongo.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Andrews. Councilmember Arango. Councilman Austin, Councilmember Richardson.'",
        "'speaker_0': 'Motion carries cape motion carries on the appeals being denied. So that concludes our first hearing. So thank you very much. And we're going to move on. Let me guess. We're going to go to the the shelter issue next.'",
        "'speaker_0': 'But I want to do the consent calendar and get that out of the way. They can get a motion in a second on consent. Any public comment on consent saying nonetheless, please.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute any and all documents necessary, including a Purchase and Sale Agreement (PSA), with Eddie N John #1, LLC, a California limited liability company, and Youna Kim, a Sole Proprietor dba Eddie's Liquor #1 (collectively \"Seller\"), for the purchase of certain real property located at 6841-6845 Atlantic Avenue, Assessor Parcel Numbers 7116-019-029 and -036 (Subject Property), in the amount not to exceed $9,591,540;  Authorize City Manager, or designee, to execute all documents necessary for a Lease between the City of Long Beach and Eddie's Liquor #1, for the use of the Subject Property;  Adopt Negative Declaration ND-02-19; and  Increase appropriations in the General Fund (GF) in the Economic Development Department (ED) by $9,591,540, offset by the sale proceeds from the Broadway Block Site B and transfer of HEAP grant revenue from the Health Fund (SR 130).  (District 9)": [
        "'speaker_1': 'Report from Economic Development and Health and Human Services. Recommendation to authorize City Manager to execute all documents necessary with Eddie and John number one and Eddie's Liquor Number one for the purchase of certain real property located at 684136845 Atlantic Avenue in the amount not to exceed 9,000,591 540 and execute a lease between the city of Long Beach'",
        "'speaker_1': 'and Eddie's liquor. Number one for the use of the subject property District nine.'",
        "'speaker_0': 'I think I'm going to turn this over to Mr. West.'",
        "'speaker_3': 'Thank you, Mr. Mayor. This is a result of at least over a year of negotiations to try to impact our homelessness issue here in the city of Long Beach by creating not only a winter shelter or rainy day shelter, but a year round shelter.'",
        "'speaker_3': 'We've been working very closely with the property owner there, as well as Councilmember Richardson in the neighborhood. So at this stage, I'm going to turn this over to our director of Health and Human Services, Kelly Collopy, who will be joined by Mary Torres with John Kiser, the Director of Economic Development.'",
        "'speaker_3': 'So Kelly. John Castle. I'm sorry.'",
        "'speaker_11': 'Honorable Mayor and members of the City Council. On July 24th, the Council approved an item requesting a city staff report on revenue options to address local homelessness and housing shortages in the city. And in August, city staff presented a strategy to create additional housing and respond to homeless issues.'",
        "'speaker_11': 'On that night, multiple council actions were taken and those included, among others, an analysis detailing a strategy for identifying potential revenue and a plan to use recently received state funding toward the purchase of a facility that would be utilized as a year round homeless shelter.'",
        "'speaker_11': 'The subject property that we're discussing tonight was used in the past as a winter shelter by the city. This is located at 684136845 Atlantic Avenue as a potential site for the development of a year round shelter, as well as a long term plan for the state of the art village style campus for homeless services and support.'",
        "'speaker_11': 'The subject property is 99,000 square feet total, with three buildings located on the property of a total of 28,000 square feet. The property is located adjacent to the Los Angeles Riverwalk. Southern California Edison, right of way and adjacent property owned by the U.S. Army Corps of Engineers.'",
        "'speaker_11': 'Staff has negotiated the sale of the property for an all inclusive price not to exceed $9,491,540, which includes the land and improvements. The liquor license for the. The existing liquor store. Inventory, furniture, fixtures and equipment. Goodwill and compensation for relocation benefits, which were acquired by state law.'",
        "'speaker_11': 'As part of the sale, the seller has requested to occupy the front structure. The liquor store as a lessee from close of escrow until January 5th of 2020. Upon termination of the lease, the third party will conduct a review of the inventory and city will compensate the seller for an amount not to exceed $400,000, which is included'",
        "'speaker_11': 'in the purchase price that's being recommended tonight. The year round shelter is is what we're looking at as the first stage of this project. City staff, including the Health and Human Services Department, will work with the community and partner agencies to develop a case study and example for a village style homeless services campus.'",
        "'speaker_11': 'On November 13th of 2018, the City Council authorized the city manager to execute an agreement to receive and expend grant funding from the Business, Consumer Services and Housing Agency Homeless Coordinating and Financing Council in the amount of $9,387,420 for homeless emergency aid program.'",
        "'speaker_11': 'Continuum of care allocation of the amount awarded 8 million is designated for a year round shelter and has been appropriated in the health fund in the Health and Human Services Department. So to cover the fiscal impact. The sales expense includes the total acquisition cost of the property, which will not exceed $9.5 million.'",
        "'speaker_11': 'Approximately 9.4 million approximately is the all inclusive purchase price of the subject property, with approximately $100,000 anticipated for acquisition related costs. The funding sources that staff has identified for this acquisition includes $8 million that were appropriated in the Health and Human Services Department as part of the heat funding grant and staff recommends funding the remaining 1.5 million'",
        "'speaker_11': '$1,591,540 from proceeds from a recently closed sale of the Broadway block property site B, which is located on Broadway and Long Beach Boulevard. In addition, there will be less revenue associated with the liquor store for the remainder of the year of $6,000 per month, and that will accrue to the general fund in the Economic Development Department to'",
        "'speaker_11': 'help offset some of these administrative costs associated with the transaction. Finally the recommendations staff recommends approval of the purchase of 684126845 Atlantic Avenue and the execution of a lease for the subject property. The recommendations are as follows Authorize the city manager or designee to execute any and all documents necessary, including a purchase and sale agreement with Eddie'",
        "'speaker_11': 'and John Number one LLC, a California limited liability company and unit. Kim, a sole proprietor. Otherwise known as Eddie's Liquor. Number one for the purchase of certain real property located at the Subject Property Address, and the amount is not to exceed $9,591,540.'",
        "'speaker_11': 'Additionally authorize the city manager as designee to execute all documents necessary for a lease between the city of Long Beach and Edy's liquor number one for the use of the subject property. Recommendation three adopt a negative declaration and be 0 to 19 and increase the appropriations in the general fund in the Economic Development Department by $9,591,540, offset'",
        "'speaker_11': 'by the sale proceeds from the Broadway block site B and transfer of hip grant revenue from the health fund. At this time, I'd like to conclude my report, and I'm happy to answer any questions. Thank you.'",
        "'speaker_0': 'Why don't we? Is is is Ms.. Collopy also adding to this or it just that piece?'",
        "'speaker_7': 'Good evening. I'd like to share a little bit about ah the shelter opportunity. Um, so within the Everyone Home Long Beach Task Force report, we determined that there is a need for approximately 500 shelter beds across our city.'",
        "'speaker_7': 'Within that report, the report, you know, made a recommendation. And really a goal is to build at least 200 shelter beds and expand in the city in the next few years. And this shelter, we're looking to have 125 beds, which really creates a lot of progress for us.'",
        "'speaker_7': 'It would be the first municipally owned year round shelter that we have had in the city of Long Beach for many, many years. And the site has operated as the winter shelter. So that within the shelter what we see is a space for adult male and female adults.'",
        "'speaker_7': 'There's opportunities to have families are on the street. Well, it's not a family shelter. It's an opportunity for family to to participate, to come in until we can connect them to a family shelter system, provide jobs or a job and employment training, case management.'",
        "'speaker_7': 'There'll be, you know, showers and the opportunity for meals and just really the host of social services that are needed to be able to connect people to supports to help them to be successful. So we are we're very excited about this opportunity is certainly need within the city.'",
        "'speaker_7': 'And I would like to say that I've had an opportunity to talk to many from the Hamilton neighborhood in the surrounding. And we've had very just really kind conversations and very good questions. And I truly appreciate the many that I see here in the audience as the support.'",
        "'speaker_7': 'But and that also I appreciate, you know, all that's been able to do that we've been able to have in the conversations and to express concerns and to be able to address those as well. So with that, I conclude my report and I'm open to questions as well.'",
        "'speaker_0': 'Thank you. I know we have we do have a motion in a second. I'm going to make some some comments as well. And then I'm not sure if. Councilman, did you want to go do you wanna go to the public first?'",
        "'speaker_0': 'Okay. And then we'll turn over to Councilmember Richardson. So I want to I just want to just begin by just noting that I think we're all aware that homelessness is a statewide crisis that we're all facing across the state of California.'",
        "'speaker_0': 'It is certainly the the number one challenge, human challenge that we face here in the city of Long Beach. And I think if you talked and spoke with most cities, they would all say the same. This is not a city.'",
        "'speaker_0': 'This is not a challenge that just exists anymore in urban communities. But it is up and down the state of California, Long Beach, as a as a city, I think as a city council has also identified this at the top of our list of something that's important to us.'",
        "'speaker_0': 'We understand the incredible need for shelter, for people to have access to not being on the sidewalk. Honestly, some of the the signs that are there. And we're very much committed to it. And I want to just begin by by noting a few things.'",
        "'speaker_0': 'I'm really proud that that the City Council has adopted and passed numerous initiatives around homelessness. The Everyone at Home Task Force, which was referenced by Ms.. Collopy, was a a almost year long process that was led by Jen Connelly at Cal State Long Beach.'",
        "'speaker_0': 'And I see Andy Kerr, who was a vice chair and other members of that task force that were here as well. And a big part of that task force was setting out targets and also talking about the larger goals of how we solve homelessness across our community.'",
        "'speaker_0': 'One of the key components of the task force recommendations, as was also and I mentioned this at the state of the city about a year ago as well, was to ensure that we have we set a goal of trying to acquire 200 more shelter beds across across the city.'",
        "'speaker_0': 'This is something that we we know as a city, we we have needed. But it was also good to see that reinforced by the professionals, the service providers, the academics, including folks that have experience homelessness, which are also on the task force.'",
        "'speaker_0': 'And it was it was good to see that a recommendation. So tonight's proposal gets us to 125. And I think that's a huge step forward in looking at those recommendations and seeing the importance of those as well. I also think it's important to recognize, because we're back at the table again this year, this purchase is almost going'",
        "'speaker_0': 'to be done entirely because the state of California and the governor, Jerry Brown, at the time provided significant resources to the city of Long Beach, about over $10 million to do additional work on issues around homelessness. I believe, Mr. Hoppy, that 8 million of those dollars is going to actually purchase this project.'",
        "'speaker_0': 'Is that right? 8 million.'",
        "'speaker_7': 'That's true.'",
        "'speaker_0': 'And that and I want to and I and I want to thank and I think it's important I want to thank the Big Ten Mayors Group which sponsored those those resources and that legislation and lobbied the governor to provide this additional funding for cities.'",
        "'speaker_0': 'I say that because, well, we were a great recipient of those dollars, actually allowed us to. The buy the shelter or this land. We're back at the table this year. And we're hopeful that that the governor currently and the mayors are back lobbying for a second year of this type of funding so that we can continue to'",
        "'speaker_0': 'do this kind of work. And so I'm just grateful to the leader of that group, which was Darrell Steinberg out of Sacramento, who was the essential key in leading us and getting this additional funding for this purchase. And again, I want to and I do want to thank this city entire city council for their commitment to this'",
        "'speaker_0': 'issue and for all the work that's been occurring at this dais and at the staff level. But I especially want to thank, first and foremost the North Long Beach neighborhood and the community. What I have seen from the north Long Beach neighbors and the community, honestly, has been so moving and so touching to see how you have'",
        "'speaker_0': 'all stepped forward and embraced what will be a campus that is going to be there to help people and to help those people in our community that that need our help so desperately. And you see this happen in other cities, in other places.'",
        "'speaker_0': 'And I've seen the reaction that other neighbor neighborhoods and other cities and other communities have had to similar projects. And what you all have displayed is is inspiring. And I'm so proud I'm so proud to be mayor of a city where folks like all of you are stepping up and being part of the solution.'",
        "'speaker_0': 'So thank you for all the work and the advocacy that you have all done. And I also, of course, as part of that, I do want to thank Councilmember Richardson. It is not easy for elected officials to say, yes, we welcome these facilities and provide leadership on these on these issues.'",
        "'speaker_0': 'And I think he's done a stellar job of working with all of you and the many meetings that have happened for this site. And I want to thank him for that as well. And I also want to thank the county of Los Angeles and Supervisor Janice Hahn, who is going to be a great partner in ensuring that'",
        "'speaker_0': 'there's funds to maintain the actual operations of this site as we move forward. And there's a big commitment from the county on that issue as well. And so there's a lot of thank you that will go around tonight.'",
        "'speaker_0': 'There's a lot of work that still needs to be done. But I think that it's important that we recognize all of the folks that have been involved this, this, this, this body as a city council, but also the staff.'",
        "'speaker_0': 'You guys have done a great job of getting us to this point and this negotiations as well as I want to thank the property owners who have also done a great job of being partners with us on this site.'",
        "'speaker_0': 'And so just thank you to all I know. We have a big discussion tonight, but I am really proud that we're here at really what is a turning point, I think, for our ability to try to find solutions to this real challenge.'",
        "'speaker_0': 'So thank you. And with that, Councilman Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And I'll say. You know, it's hard to say thank you right now because this is the beginning of a large, large undertaking, a large endeavor. And I don't want to minimize that. I want to be completely honest with North Palm Beach community.'",
        "'speaker_10': 'And I want to thank you for, frankly, stepping up and allowing us to even begin this conversation. So thank you to all the leaders who have talked with us, met with us and given us the preliminary okay to even get started with this conversation.'",
        "'speaker_10': 'But by no means is this the end of the discussion. This is the beginning. So have a lot of comments and a lot of questions. Many of these questions are questions that were raised to me, and I think that they should be elevated here at this discussion, even if just so much as to save a question that'",
        "'speaker_10': 'you might be asking at the dais. Maybe we can answer some of those questions here for you today. So I just want to acknowledge all the different partners and residents who are here, you know, to get their questions answered, to express support.'",
        "'speaker_10': 'And all the partners have really stepped up to help organize this effort, both conducting outreach on next door to let people know that this is happening. People who have talked to their neighborhood associations. I see signs that says beds, not sidewalks.'",
        "'speaker_10': 'Those in print themselves don't acknowledge the the United Way folks who have stepped up to really help drive this conversation. You know, recognize in the work that's happening around everyone home, which is sort of our our hallmark for our homelessness campaign here in Long Beach and a lot of the work that's happening around our economic inclusion work'",
        "'speaker_10': '. I see a lot of intersectionality here. A lot of the efforts that we're working on in the city are aligning to really talk about this conversation of inclusion and access and working together. And that's really what I see here tonight.'",
        "'speaker_10': 'Okay, so a few things. So let's see where I want to start here. Okay. So this has been an ongoing conversation for about eight years in North Palm Beach. This is not a new conversation. I began eight years ago when my predecessor, Councilman Neal, took on the winter shelter when the site was at the old West Coast'",
        "'speaker_10': 'Choppers site, the Jesse James site. And then for whatever happened, it moved to North Long Beach and we partnered with the rescue mission and had been there for a number of years. So this has been an ongoing conversation with North Long Beach community.'",
        "'speaker_10': 'We all know the mayor's done a good job at sort of underscoring the stakes here with the homelessness this homelessness issue. We've recorded more than 1800 people living on our vehicles, on our streets or in transitional and emergency units.'",
        "'speaker_10': 'But who are these people? Who are we actually talking about? There's a lot of expectations that it's all, you know, drug addicts and people with mental health issues. That's a part of it. But the great deal of homelessness is actually caused by poverty, and it can impact a great many of us here in Long Beach.'",
        "'speaker_10': 'So who are we talking about? So currently, half of our Long Beach residents are rent burdened, spending more than 30% of their income on housing. Half of the people who live in Long Beach, a quarter of the adults in Long Beach working full time, live within 200% of the poverty line.'",
        "'speaker_10': 'So these are our neighbors. A quarter over and over 20,000 Long Beach households are precariously housed. We have overcrowded units. We have agent, aged, housing stock, a lack of new and affordable residential development. And all of that is at the root.'",
        "'speaker_10': 'These are root causes for the homelessness in the housing insecurity issue. Are homeless population includes working families and includes college students and includes veterans? And these are very uncertain times. You know, we just watched, as, you know, as a number of federal employees all around the country went 35 days without payment.'",
        "'speaker_10': 'Right. So the reality is this can happen to anyone. And it's a very complex issue that can affect anyone. The cost of living is high. Our vacancy rates are low. The social services net is feeble, limiting our ability to support every homeless person in Long Beach.'",
        "'speaker_10': 'So we had a conversation with some of the Hamilton neighbors where we talked about, hey, this might be a possibility, a reality about six months ago. And then when the when the property owners said, yes, we're willing to move forward with the whole kit and caboodle, the liquor store and everything.'",
        "'speaker_10': 'We sat down with them again and said, this is a possibility. Can we expand this conversation and sort of include some of the larger District nine North Long Beach leaders? We did. So we expanded the conversation to the North Long Beach Leadership Council and some of our education leaders like like you would walk, Jolene Talk and Megan'",
        "'speaker_10': 'Kerr. We had a conversation at our District nine field office, the old fire station. This included the District nine commissioners and every neighborhood association who was invited. The Leadership Council was invited to this conversation. Kelly Colby was there, a director of health department, a director of economic development was there.'",
        "'speaker_10': 'And we had a honestly, a really inspirational conversation about really about what it needs, what we need to do to actually address this issue. And then last night, you know, there was a lot of chatter on next door.'",
        "'speaker_10': 'And fortunately, one family stepped up and said, you know, can we talk? And we reached out and we said we set up to go over to their home last night. And so I want to thank the Bass family for opening up their home.'",
        "'speaker_10': 'We went to their home last night and talked for about 2 hours. Kelly Colby joined us. John Keisler joined us. We had a great old time. We talked about a number of things. We found a lot of things we had in common.'",
        "'speaker_10': 'But the main takeaway and we'll talk about some of the things, but the main takeaway from that discussion was really centered on honesty and building a foundation of trust with this community. There's a reason why not a lot of neighborhoods are stepping up on this issue.'",
        "'speaker_10': 'And in North Lawn Beach. I'll tell you, I was reminded last night and over the course of the last few weeks, I was reminded of a number of instances where we did not deliver for North Long Beach in the nineties, when the police department was contracted out to the sheriff's wharf, Long Beach felt abandoned.'",
        "'speaker_10': 'In the year 2010, when our rescue was cut north Long Beach excuse me, Mr. Mayor, it was really hard to focus in 2010 when the police when the fire rescue was cut North Long Beach felt abandoned. These things we need to address and actually talk about.'",
        "'speaker_10': 'Frankly, for the past eight years, we've had this conversation about homelessness. In the context of the emergency shelter. For eight years now, North Palm Beach has welcomed busloads of individuals from around town and sheltered these individuals through the winter.'",
        "'speaker_10': 'Both districts, nine and eight, have done this using the Atlantic Farms site for six out of those eight years. Now the problem with it, and they've done it willingly, the neighborhood association stepped up if talked with folks. We worked with the health department has done a great job.'",
        "'speaker_10': 'But the question is never asked and the opportunity was never been given to these residents is a question that many neighborhoods take for granted. That question is, if a shelter were placed in your neighborhood, what would your neighborhood need to make it successful?'",
        "'speaker_10': 'And because we've been operating every year on an emergency basis, North Long Beach has never been asked that question. What does North Zombies need to make this shelter operation successful? And so by moving forward tonight, we get to finally ask that question what does North Palm Beach need to make this work?'",
        "'speaker_10': 'Frankly, this is not a lot just at stake for North Lawn Beach. There's a lot at stake for the whole city. Here's why. This is a test everybody's watching. There are key performance indicators that we need to monitor.'",
        "'speaker_10': 'Is the property value in the neighborhood going to increase at a faster, slower rate than other neighborhoods? Everywhere is increasing is an increase at a faster, slower rate if we add permanent housing support. What's the impact? How do we track public safety and the investment, the commitment to public safety?'",
        "'speaker_10': 'How do we track that key performance indicator? Right. The amount of homelessness in and around the shelter that counts. How do we track that key performance indicator? If we can demonstrate that this can work by connecting with wraparound services and really making the investments necessary, then maybe we can explore additional sites.'",
        "'speaker_10': 'The report tells us that there were, you know, 200 somehow shelter beds needed. We have 275 in the city. It's an additional 125. We're going to need 7500 more shelter beds in the city to make this work. So this isn't the end all be all solution for the city, but it's at this is at stake for all'",
        "'speaker_10': 'of us to make sure this works. So in that conversation with the residents, a number of a number of things came up that are that we need to talk about. So by approving this, this allows us to do a few things.'",
        "'speaker_10': 'So one, we're able to acquire and cancel the liquor license. There've been a lot of questions about, yes, you're acquiring liquor license. What's the intent? The intent is to surrender it. It will not be transferred to another site.'",
        "'speaker_10': 'The liquor license is being acquired. There's been a prior to the North Flambeaux committee for a long time. It will be surrendered. That's that's the goal here. We're not just committing to a shelter. We're committing to doing the hard work and investigating wraparound services and the quality of life mechanisms needed to make this a center that works'",
        "'speaker_10': 'not just for the homeless community, but the community at large in the north of 91 area that is, you know, has issues in terms of access to open space and other things. So we're going explore those things and partnerships with L.A. River, partnerships with some of the L.A. County equestrian facilities, partnerships with Southern California Edison, and the'",
        "'speaker_10': 'right away that's adjacent. We're going to support those things. And we're going to and we're going to do what's necessary to make sure that the community is involved through this whole process. So some of the topics have come up through this conversation is, one, we need to make sure we're tracking the key performance indicators to make sure'",
        "'speaker_10': 'we fully understand the impact and that we can be very transparent and open about that process. With respect to, again, property values, public safety and homeless activity surrounding the area. We need to make sure that there's an ongoing neighborhood advisory committee directly connected to the permanent shelter to ensure stakeholder engagement for the long term.'",
        "'speaker_10': 'We need to make sure that there is a well vetted out, detailed security plan and safety plan associated with the campus and procedures for how people, how the intake process goes. And if someone rejects services, what happens is they wander off into the neighborhood.'",
        "'speaker_10': 'These are very legitimate questions that we want to make sure we have well vetted out and thought out solutions to make sure that these things are addressed. We want to talk about traffic calming measures. We know that Atlantic Avenue, north of the 91 Freeway, doesn't have any traffic signals.'",
        "'speaker_10': 'And when it veers off and turns into that V, there's it's very difficult to make that left turn. And that's right where the entrance to this site would be. So we have to evaluate traffic calming. Traffic calming measures.'",
        "'speaker_10': 'These are some of the things offsite to make it make sense as a site. We have to explore lighting in the area. They're very dim areas and we have to explore the investments into lighting and those things. We have to get creative about public safety deployment.'",
        "'speaker_10': 'It gets you know, there are challenges where we you know, in Northland, we should border Lakewood, Bellflower, Paramount, Rancho Dominguez, Compton. And I remember circumstances where a crime happens in one city and they run into the other city who's, you know, whose job is it was the question.'",
        "'speaker_10': 'All those things the community needs to be comfortable in the conversation, on response. What response times? We need to make sure that we're on top of those and understand what the real emergency response times are in that area.'",
        "'speaker_10': 'We need to be creative about, you know, we just funded a quality of life position. That's a police officer who's dedicated to homeless services in North Palm Beach, which is funded this. What is the relationship between the quality of life officer and the new shelter, the potential shelter?'",
        "'speaker_10': 'Can we create space for this officer? What's the relationship between we have a met team. A mental health evaluation team in our police department is four, right? What's the relationship with one of these met teams with the North Miami shelter?'",
        "'speaker_10': 'What is the relationship here? What's that going to look like? There are a number of different operations. They all need to be vetted out as a part of this conversation. What about clean team safety? Right. We have a clean team in the city.'",
        "'speaker_10': 'You know, we've got special districts in the city. We should look at what's required in terms of cleaning up the site, making sure that there's services to keep it, keep the site clean, safe team is private security. Eyes on, you know, eyes on the street.'",
        "'speaker_10': 'These things are available in our business improvement districts. We should explore those types of things around our shelters. Totally possible. I created the business improvement district. Others have. It's possible we can explore this. And so there's a number of things we need to explore which tells us we need to make sure that we have a process to'",
        "'speaker_10': 'go through that, to vet all of these things. So at this point, I'm going to ask a few questions of staff. So first, there was a lot of conversation about the value, and I think you did a good job outlining this.'",
        "'speaker_10': 'But I want to elevate this is, you know, this conversation. Can you talk about the the appraisal when that appraisal will be released, what the value of the price is based on? And in just for a walk us through that that thing in case there are questions.'",
        "'speaker_10': 'So Mr. Keisler, would you mind walking us through the transaction a bit?'",
        "'speaker_11': 'Councilmember Happy to. So, so the city, whenever conducting an acquisition of a property, will contract with a third party appraiser who has the proper certifications. In this case, we contracted with Harran in MM, a local real estate appraiser from Southern California, and they followed all of the uniform standards of professional appraisal practice.'",
        "'speaker_11': 'So this is a national standard and they certify these appraisals. They're willing to to to back them up in court if necessary. And so the methodology used for this particular appraisal, because this property includes a unique set of buildings, a retail space, the liquor store and interest in industrial space, which is the warehouse and a residential space'",
        "'speaker_11': 'on the same campus. This was a little bit unique, and so there were two primary methodologies that were used to provide what's called a reconciled fair market value of both the sales comparison, a comparison of similar properties, similar uses in the, in the in the vicinity, as well as what's called an income capitalization appraisal.'",
        "'speaker_11': 'And what that means essentially is what can what kind of revenue can be derived from this type of property, given that it has all three uses associated with it. And so the appraiser in this case had spent a great deal of time looking at 21 individual sales or leases that had been executed between 2016 and 2018 and'",
        "'speaker_11': 'used that as a basis to come up with both the sales comparison and income capitalization value for the property. Essentially what we have is about 28,000 square feet of Leasable space over the last four years or so. Really what we've seen in the city is a acceleration or an increase in value, particularly around the Long Beach and'",
        "'speaker_11': 'the Port of Long Beach when it comes to industrial spaces in particular. But generally real estate has become much more valuable throughout the city. So taking that all into account, the appraiser developed the income capitalization value and sales comparison value.'",
        "'speaker_11': 'It comes out to be about $250 per square foot, which is somewhat in the middle, slightly above middle of of where these types of properties are. In the North Long Beach submarket, we saw properties, in fact, which is included in the appraisal.'",
        "'speaker_11': 'All of this, of course, will be a matter of public record after the close of the sale, which means the close of escrow for us and available to the public after March May 31st. But ultimately, I'm happy to answer any questions about how they derived the $7.54 million purchase price recommendation.'",
        "'speaker_10': 'Okay. So the seven and a half to sum it up. Vacancy rate is down. There's increased demand in the port area. And with the changes in the cannabis law, all of those created additional demand that made warehouses a little bit more attractive in the community that sum it up.'",
        "'speaker_11': 'A lot more attractive. In fact, the cannabis ordinance which was passed about mid 2018, that put an incredible value on industrial properties located in what's called the eligible buffer zone. So we're seeing this kind of price pressure in Long Beach in all of our industrial areas, areas that are away from schools and parks and other things.'",
        "'speaker_11': 'And it's it's also put pressure on on the Long Beach industrial market, because we're one of the only cities in the region that allows for this use. So we've seen a whole new market evolve and really place their attention on the city of Long Beach.'",
        "'speaker_10': 'So what about relocation or if, you know, are we saving money by not going through eminent domain? How does this compare to if we did process, as we've done in the past during the redevelopment? How does this compare to that?'",
        "'speaker_11': 'Yeah, so so as you know, there are a number of requirements. Any time the government makes a purchase of private property, when we solicit purchase, we have by state law the responsibility to do relocation benefits. We have to pay for inventory and furniture and other things, equipment and other property of the owner.'",
        "'speaker_11': 'So that that actually the the market based appraisal is seven and a half million. But the other roughly $2 million in this this particular acquisition will cover relocation of the tenants. So we not only have the residential property where they have relocation benefits under state law, but the the liquor store in this case decided to go with'",
        "'speaker_11': 'an all in settlement instead in lieu of relocation. So that that actually saves us a tremendous amount of time and resources to provide for in-kind relocation advisory services, possible either lease or purchase of other property. And of course, the price for the liquor license, which was a priority for us and given that we want to focus on'",
        "'speaker_11': 'health services rather than alcohol, so our all in price settlement was was an option for this this owner. If this had gone down the path of eminent domain, we would have added significant more time, maybe 12 to 18 months, a tremendous amount of legal fees.'",
        "'speaker_11': 'We probably would have had to also accept, you know, an appraisal from the attorneys of the the the property owner and then probably have some sort of resolution or adjudication of the final settlement. So this saves us a tremendous amount of time and a tremendous amount of cost by doing.'",
        "'speaker_11': 'And we feel like the resident business owner, these are all members of our community. So we really love when we can do a cooperative sale and make everybody whole great.'",
        "'speaker_10': 'So thank you for walking us through that once more. And again, this would have been possible if we didn't have those cheap dollars will state down the $8 million and $8, is that right?'",
        "'speaker_11': 'Yeah, that's correct. We actually it broke this this particular acquisition. There's there's two pieces. The state funding covers the vast majority of the cost. And then fortunately, as we have sold properties from our former redevelopment agency, as well as some properties that are associated, we've been able to generate some proceeds and that that will help from the'",
        "'speaker_11': 'sale of a recent property in the downtown will help us to to finalize this deal. So so both funding sources, the city and the state are helping to make this work.'",
        "'speaker_10': 'Great. Thank you. I think some of the questions have been raised, been fair, very fair. And, you know, we've done our diligence to make sure that we we address those questions and that we talk about when the appraisal will be released and that justification.'",
        "'speaker_10': 'We talk about that.'",
        "'speaker_11': 'I did mention that we we we we never release our appraisal publicly during negotiations. And in terms of of the sales process, we will be executing a purchase and sale agreement, but that's just 1/1 step. So we'll go through a process of about a 90 day escrow, would conduct a due diligence.'",
        "'speaker_11': 'We'll look at any environmental or engineering issues. We'll make sure that both parties are doing what they said they would do, and then we'll likely close escrow at the end of May. So May 31st, if we both satisfy the requirements of the purchase and sale agreement, then we would make the appraisal a matter of public record because'",
        "'speaker_11': 'during this time it's still a matter of negotiations. And finally, there are there is, you know, personal information of the seller, the property owner, other people that have owned the property over the course of its history. And so we'll have to look at making sure that we protect their their identity and their information as well.'",
        "'speaker_11': 'So after May 31st, hopefully we'll be able to close escrow and release all of this to the public.'",
        "'speaker_10': 'All right. So we're following all of the laws, the Public Records Act laws that we're required to follow. We're answering all the question, the reasonable questions. There are some, you know, ridiculous questions out there that really I don't believe that the pressure should have run, implying that, you know, the council has a financial stake.'",
        "'speaker_10': 'Just so you all know, I have no financial stake in this. This is a big undertaking. I don't I don't make money off of this, and neither does Mr. Keisler. Is that right? Mr. Keisler, you have no financial stake in this?'",
        "'speaker_11': 'That's correct. We have no conflict of interest.'",
        "'speaker_10': 'This is about walking the talk. The North Long Beach has had this shelter for eight years and we haven't make the investments necessary to do it right. That's what this is about, you know, finally making good and building some honesty and building truth and congruence with our community.'",
        "'speaker_10': 'Some trust. That's what this is about. Okay. So next, let's talk about the future now. So we move forward tonight. I really see that there's sort of two paths to conversations. One is really focused on the operation of the shelter.'",
        "'speaker_10': 'What does that look like? How are we going to engage with it? How are we going to be able to scope it? So I really see one timeline there. And then there's a conversation that's really about real estate and services, wraparound services, you know, what are the opportunities for affordable housing?'",
        "'speaker_10': 'Who are the partners we can bring to the table? Lobby, City College and Lobby State have both reached out interested in being a part of this. Some of the best affordable housing developers in the city have reached out expressing support.'",
        "'speaker_10': 'Nonprofit groups have reached out expressing support. Southern California Edison is wants to meet with us about partnerships with the with the right away. The county's been a tremendous partner and so that's a very separate conversation about the highest and best vision and how we can really be comprehensive about this.'",
        "'speaker_10': 'So it might get confusing since there's two processes in the way I really want to sort of understand it, narrow it down is that Kelly Colby in the Health Department leads the conversation on the shelter. The broader piece is really Mr. Kaiser in the Economic Development Department, but Mr. Keisler, Ms..'",
        "'speaker_10': 'Collopy, if you could just shed some light on what you see as potential process and next steps in terms of engaging the community and both of these conversations.'",
        "'speaker_7': 'Certainly. So we have been spending a lot of time thinking about what are the best practices for a year round shelter. And so what we'd like to be able to do is to bring what you know, what we've been thinking in terms of what those practices would be.'",
        "'speaker_7': 'And I've shared, you know, some the different service models than others with you along the way. But the other piece was certainly to have a community a community volunteer group or a sort of a group that would be willing to engage with us about what would you need to make sure that you feel that this success is'",
        "'speaker_7': 'successful in the community? What would you need to feel like? You know that the community has supported through the process and also as as it is being implemented, which our goal is to have it open before June one, 2022.'",
        "'speaker_7': 'That's about a year, year and a half. To really design the rest of this before it fully opened is that, you know, if you see things that aren't working for the community, that you are in contact with us as the as the city, so that we can help support and make sure that you are comfortable moving forward'",
        "'speaker_7': 'and be able to really engage in that back and forth. So we'll certainly be looking for a group who is willing to work with us in that process moving forward.'",
        "'speaker_10': 'Thank you. John, the the separate visioning process.'",
        "'speaker_11': 'Yes. Council members are typically when when we purchase a property and we're looking to develop that property will engage in in both a visioning process which will involve extensive community engagement, will request information from various potential partners that could include the nonprofit, academic, private sector, capital funding agencies, even governmental agencies like the county or the state.'",
        "'speaker_11': 'And we'll identify a whole process which will put in writing and recommendation to our city manager to then bring back to the Council for review. Ultimately, what we hope to do is through that process, get a sense of what's possible and then put those specifications into some sort of request for proposals or requests for letters of interest'",
        "'speaker_11': 'from potential developers. That usually serves as a way to attract capital, as well as the private sector and nonprofit service providers and developers that can help the city respond to the community's needs. And I think that ultimately it's about getting a really robust list of both the concerns as well as the opportunities from the community that will'",
        "'speaker_11': 'drive the creativity and ultimately the project that we're able to develop in partnership.'",
        "'speaker_10': 'Okay. Well, I'm prepared to I'm prepared to move forward. So so Kelly and John, thank you both for being so engaging over the last these last few months on this conversation. A number of the council members I know, some of them are sitting here, but Councilwoman Mongeau and Councilwoman Gonzalez both reached out this week just to say'",
        "'speaker_10': ', hey, Councilmember, you know, I want to just express my support for this. Thank you for stepping up. So those council members are reached out. Thank you for for for really your commitment to this and to making sure that the priorities of North Palm Beach community are met and not caught up in sort of the political rhetoric around'",
        "'speaker_10': 'this issue. But we're really being very sincere about what this is and how we address it. So so I want to thank you to all those council members who stepped up. And so so I want to go ahead, move forward, want to make the staff recommendation.'",
        "'speaker_10': 'And I want to add two things reflective of what we talked about tonight. So, one, I would like to see a report in the next 30 days just outlining what this process looks like. Specifically, two things. One, the robust community outreach process, specifically related to the operations of the shelter itself.'",
        "'speaker_10': 'And then secondly, what the process would look like was codified the process, what it would look like for the visioning, what that task force could look like, who the partners might be, what that timeline for the development looks like.'",
        "'speaker_10': 'And and, you know, now I want to see who those people might be. They've reached out to this formalized process to be engaged. Is it is it, you know, the educational institutions? Is it the housing, the development, you know, the affordable housing world?'",
        "'speaker_10': 'Is it service providers? Is it Edison, who these people are? Let's let's put some some color to this and and actually establish this task force. So, again, my motion is a staff recommendation with a report on how we're going to approach these two specific areas, the community outreach process associated with the shelter operations, and secondly, the process'",
        "'speaker_10': 'associated with the larger visioning for this site. So thank you to the entire city council, the mayor and everyone, and let's go ahead and support this. And then, Mr. Mayor, I want to, at this point, I think, would be a good time.'",
        "'speaker_10': 'These people have waited they've they've heard these questions. And I think we should go to public comment.'",
        "'speaker_0': 'I think that Summer Pearce is good with that. So we will go ahead and do public comment. So please come forward if you have public comment on this item.'",
        "'speaker_3': 'Very good to address on file. It's certainly a commendable program. And I'm wondering whether or not. A portion of the monies could be used for something I like to suggest, and if not, get the monies for that. Because if you're going to bring in and house people there, what do you you want to make sure that the'",
        "'speaker_3': 'water is clean, uncontaminated. Now, obviously, there is a reference before there's something in the ninth district. It might be in the water. That has led to the disease in demented thinking. Manifested by the championing of a degenerate, demented, demented individual such as Snoop Dogg.'",
        "'speaker_3': 'When you have that type of mentality. There's something wrong, and you certainly don't want to. Ruin the project. And it's a commendable project by bringing people in. If there's something in the water in the ninth district. So what you should do is establish the fact that there is nothing wrong with the water.'",
        "'speaker_3': 'I can't think of any other reason what would engender such disease and demand thinking. Particularly relative to the treatment of women. And again, as I point out, look what happened to the head of CBS, period. I don't know what the answer is, but there's certainly something degenerate.'",
        "'speaker_3': 'Unchecked in the ninth District. And that needs to be found. So let's find it. Find it out. It's maybe it isn't that. But right now, I can't think of any other alternative. Thank you.'",
        "'speaker_0': 'Thank you. We're going to go ahead. And also because the amount of speakers that are here and listeners, any objection from the city council, we're going to go to 90 seconds, four for four for each speaker.'",
        "'speaker_10': 'But we said 2 minutes.'",
        "'speaker_0': 'We can go to 2 minutes. So we're going to add 2 minutes for each speaker. Mrs.. Any objection and then from the council and then we'll begin. And if we have, you know, an hour and a half plus of public comments, I want to make sure everyone gets a chance to speak.'",
        "'speaker_0': 'And so we'll go down to 2 minutes. And then if we need to go down further, we'll go from there, please.'",
        "'speaker_12': 'Mr. Mayor. Mr. Vice Mayor. Members of the City Council.'",
        "'speaker_3': 'Councilman Richardson.'",
        "'speaker_12': 'I applaud the City Council and the initiative of this government to take on an issue that is unpopular. My wife and I have been homeless in homeless outreach for upwards of five years now here in the city of Long Beach.'",
        "'speaker_3': 'We've served in the San Gabriel Valley, and we've never.'",
        "'speaker_12': 'Seen the kind of hope that we've seen here tonight. We salute Councilman Richardson for this initiative and a city that is not afraid to take on.'",
        "'speaker_3': 'The events and.'",
        "'speaker_12': 'And the circumstances that get to the heart of the most vulnerable in our society. And I, I think you have the politics and the economics figured out. But when you go to when you go to ask for volunteers in the community, we stand and we support you.'",
        "'speaker_12': 'And my wife told me not to get too winded.'",
        "'speaker_3': 'Tonight, I have a habit of getting loud and long.'",
        "'speaker_12': 'So thanks for taking it down to 90 seconds, Mr. Mayor.'",
        "'speaker_7': 'But I will leave you with this.'",
        "'speaker_12': 'Because I think the heartbeat of Long Beach is.'",
        "'speaker_3': 'Strong.'",
        "'speaker_12': 'I leave with you the words of Mother Teresa. Enough words.'",
        "'speaker_3': 'Let them see what we do. God bless you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_9': 'Good evening. Mayor and City Council. I'm Linda Chico. I'm the field deputy for L.A. County Supervisor Janice Hahn. As you all know, homelessness has been a priority for Supervisor Hahn. And while we're very happy and proud to see the winter shelters that have opened up throughout the county, we know homelessness is not seasonal.'",
        "'speaker_9': 'And so she applauds the efforts of the city leaders and the community in North Long Beach for opening up this conversation about having a year long shelter. So she's asked me to come here today to read into record a letter of support.'",
        "'speaker_9': 'Dear Mayor Garcia, I'm writing in support of item 23 On Your Agenda, which recommends the purchase of a property in North Long Beach to be utilized for homeless housing and services. This will be a facility where individuals can have a safe, stable place to live while receiving wraparound services, health care and job training.'",
        "'speaker_9': 'And the County of Los Angeles is committed to provide $3.4 million in Measure H funding to improve the interior of the facility and cover operational costs. I am very pleased that the county is collaborating with the city on this important project and I'm confident it will get people off the streets and connect them with the help that'",
        "'speaker_9': 'they need. Thank you.'",
        "'speaker_10': 'Is here for supervisor, huh?'",
        "'speaker_0': 'Thank you very much, Supervisor Hahn. Next. Next speaker, please.'",
        "'speaker_9': 'Good evening, Mayor Garcia, Councilman Richardson and councilmembers. I'm Dr. Elisa.'",
        "'speaker_2': 'Nicholas. I'm the CEO of the Children's Clinic, serving children in their families.'",
        "'speaker_9': 'And as you probably know, TCC is actively.'",
        "'speaker_2': 'Involved in serving the homeless. And we do.'",
        "'speaker_9': 'So with great heart, great quality and are very, very humbled to do this. We serve 1300 homeless right now in 6000 visits, where at your multi-service center or at century villages of Cabrillo? We have a mobile.'",
        "'speaker_2': 'Clinic that goes to the Long Beach Rescue mission.'",
        "'speaker_9': 'And Christian Outreach in action. And we are working on another project on Walnut to have both housing and health care together. We are very supportive of this work. We look to partner with you and I really commend you for everything you're doing.'",
        "'speaker_9': 'We now have homeless newborns coming to us in our selected home visiting. We have families that we can't find housing for suicidal teens. They're left out to the street and we have a.'",
        "'speaker_2': 'Lot of work and we're going in the right direction. And I want to thank you for all your work and we will be with you and really want to work on this with you.'",
        "'speaker_9': 'And I commend the health department in the city and I'm very honored to work in the city and we've been around for 80 years now. So this is a great time for us to be working here. So thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'Tom Stout, Mayor Council. My problem is with the cost. And, you know, you've tried to explain it and I just don't really buy into it. I don't know anybody's property.'",
        "'speaker_12': 'If you own a home or a piece of property in Long Beach that's gone up five fold in the last five years. 2 million to 7 million.'",
        "'speaker_3': 'Come on. The guy won the lottery. That's not the only.'",
        "'speaker_12': 'Cos and another three and a half million. I don't think that's going to be anywhere near adequate to remodel that place and make it functional. Plus, the ongoing expenses have to be somewhere around $2.'",
        "'speaker_3': 'Million a year. Where is that going to come from? So there's a lot of costs that I don't think you're really getting into.'",
        "'speaker_12': 'And it seems like when the city sells property taxpayer assets, you always seem to sell on below market value. It's a great deal for developers. They seem to be the city's best friends. When you the city buys property, we overpay the person that we're buying it from.'",
        "'speaker_12': 'This is an example, just like the other project in North Long Beach. I think redevelopment pays five or $7 million for the property, sold it to the developers for 2.1 million, then gave them $1,000,000 discount just before the sale.'",
        "'speaker_12': 'Great. If you're a developer, not if you're a taxpayer. And why only one appraisal?'",
        "'speaker_3': 'You can.'",
        "'speaker_12': 'You don't have to make it public. But why not have more than one appraisal? It's a lot of money.'",
        "'speaker_3': 'And.'",
        "'speaker_12': 'Is the person that's doing the appraise it. It seems like whoever the city hires whether it's a consultant. Or an appraisal. They always come up with the conclusion that the city wanted. I mean, it's like a done deal.'",
        "'speaker_12': 'So what you tell them this is what we want to do.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_3': 'Inclusion Speaker, please.'",
        "'speaker_12': 'And if the cannabis guys will.'",
        "'speaker_0': 'Thank you. Thank you very much. Our time is up. Next speaker, please note my.'",
        "'speaker_3': 'Good evening.'",
        "'speaker_10': 'Mayor Garcia and council members. My name is Ogden Bass. My family and I have lived in North Long Beach on Atlantic Place and the same residents for over 40 years.'",
        "'speaker_3': 'I want to commend you for taking up the challenge to help.'",
        "'speaker_10': 'The least of these the homeless in our city. I want to thank Councilwoman Richardson for meeting with us and a few of our neighbors last night.'",
        "'speaker_3': 'We have had an influx of homelessness in our neighborhood, and we are aware that this is a growing problem throughout the city. That notwithstanding, I would ask the Council to consider a few things. One, that North Long Beach is not the only area in the city to bear.'",
        "'speaker_10': 'This worthy cause. But other parts of the city are also.'",
        "'speaker_3': 'Will be putting in facilities to support the homeless in their area because the site is located in our community. We would ask that the site be prioritized for women and children and families because the because of the proximity to families and schools in our neighborhood, we would ask that no tents.'",
        "'speaker_10': 'Be allowed on the street or on the sidewalk and in the adjacent areas. We would ask that motorhomes of people that do not reside in the city.'",
        "'speaker_3': 'Not be allowed to park in the area, that there will be a greater invisible, more visible police presence in the area, and that more streetlights.'",
        "'speaker_10': 'Will be put in in the surrounding.'",
        "'speaker_3': 'Areas and neighborhoods. These are just a few of the items and concerns from our neighbors. We look forward to working with Councilman Richardson to further.'",
        "'speaker_10': 'Address these issues. And we want it to be successful. Thank you.'",
        "'speaker_0': 'Thank you very much, sir. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mayor and Council. My name is Ian Patton and I'm the executive director of the Long Beach Reform Coalition, which is a collection of eight civic reform minded organizations. We raised some objections to just really the process here, but I want to make it clear, we totally stand in solidarity with the goal.'",
        "'speaker_3': 'We agree with everyone here, for everyone in we have a crisis in the city in terms of homelessness. But our purpose as an organization is government transparency and accountability. So we.'",
        "'speaker_12': 'Think that this should be an.'",
        "'speaker_3': 'Open process. And when you have certain red flags, like a property that sold for $2 million, the city is paying 7.5 million, according to an appraisal. And we had to kind of pry that out of the city and give a lot.'",
        "'speaker_3': 'You know, John Keesler is great to work with. No complaint about him whatsoever, but we have to kind of force this information free. And then the remaining 2 million is apparently a valuation on the business. That seems like a crazy valuation on a small liquor store business.'",
        "'speaker_3': 'So we feel that if the public had the appraisal, then we would know we would be able to judge whether this is an appropriate use of taxpayer funds. And frankly, there's no reason that you could redact some personal information.'",
        "'speaker_3': 'There's just no reason not to.'",
        "'speaker_13': 'Release that appraisal because.'",
        "'speaker_3': 'The city is it shouldn't be paying more or less than the fair market value. It shouldn't be that kind of negotiation. The last thing I need to say, which is really important, is that last night Reverend Jim Lewis contacted me.'",
        "'speaker_3': 'He's the former CEO of the Long Beach Rescue mission. He said this is not the place to do this. He said you can quote him. It's just not the right place. It's a misuse of taxpayer money. He knows more about this site than anybody.'",
        "'speaker_3': 'He worked there. He was the CEO of the rescue mission. And he says it is not worth this amount to pay.'",
        "'speaker_0': 'Thank you very much. Thanks, Speaker, please.'",
        "'speaker_3': 'Thank you, Mr. Mayor. I'm Reverend Leon Wood. I'm a Long Beach resident. What I wanted to say is that I really thank you both for your efforts and serving the homeless. What I'm hearing tonight sometimes is the absence.'",
        "'speaker_3': 'What we're talking about is men, women and children who need assistance. They need love. They need care. We also, if we give them the kind of love and care that they.'",
        "'speaker_13': 'Need, many will.'",
        "'speaker_3': 'Become successful. And so we can talk about property, we can talk about money, but we're talking about human beings, God's children. And we should be very, very devoted to caring for people and whatever it costs to save the lives of children, men and women.'",
        "'speaker_3': 'That's what we should try to accomplish. So thank you very much.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_2': 'Hi, I'm Janice.'",
        "'speaker_9': 'Bass, the wife of Ogden Bass, who just spoke a moment ago. We live on North Atlantic Place.'",
        "'speaker_2': 'We were fortunate.'",
        "'speaker_9': 'Enough to meet with Rex Richardson and John and Kelly and some support staff as well. Things got quite heated on our next door app.'",
        "'speaker_2': 'In the neighborhood. Needless to say, I.'",
        "'speaker_9': 'Forwarded some of the information to Rex and he immediately contacted me and asked.'",
        "'speaker_2': 'If we could meet. So we had a wonderful, informative meeting at our home last night.'",
        "'speaker_9': 'Including some of the area neighbors and just by having more.'",
        "'speaker_2': 'Information and open dialog.'",
        "'speaker_9': 'Really helps a neighborhood to be more aware, accepting, being supportive when we're aware and we understand what.'",
        "'speaker_2': 'Actually is occurring or when it's happening, especially North Long Beach.'",
        "'speaker_9': 'Especially in times past years, years and years. This goes way back where we've been told that you were notified and and everybody was on board.'",
        "'speaker_2': 'And all of a sudden nobody knew what was going on or knew anything.'",
        "'speaker_9': 'And that's much prior to Richard to Rex Richardson. But what I would just ask is the neighbors are.'",
        "'speaker_2': 'Opposed to having a large.'",
        "'speaker_9': 'Complex. When I.'",
        "'speaker_2': 'Discuss things with some of our other.'",
        "'speaker_9': 'Neighbors, they are.'",
        "'speaker_2': 'Definitely in favor of micro what they called micro shelters all over the city. So just keep that in consideration. And if all of the council.'",
        "'speaker_9': 'Members would really step up like Rex has and addressed and and discussed with.'",
        "'speaker_2': 'People and encourage people that this is something that could be good. I think everyone should follow his lead. And I also just wanted to make record, if I could give all of the emails that the neighbors sent me so that I'm not just the voice piece, but everyone.'",
        "'speaker_9': 'Who had concerns could at least have their voice heard as well, that you couldn't.'",
        "'speaker_2': 'Attend.'",
        "'speaker_0': 'For sure, and just given over to the clerk and will get those. Thank you. Thank. Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, mayor. City Council staff. My name is Brian D'Andrea with century housing in the Village. Is that Cabrillo? I'm also a proud member of the Everyone Home Task Force and a Continuum of Care Board member here in Long Beach.'",
        "'speaker_3': 'I want to applaud the city, our electeds, the community of North Long Beach for taking this bold step to move forward with this plan, to acquire the site and develop this this vibrant village to support our communities most vulnerable.'",
        "'speaker_3': 'Thousands of people in Long Beach experienced homelessness in any given year. This shelter and the surrounding services and potential for housing will immediately dress that that pressing need. It's also a wonderful opportunity to leverage state resources with the heat funding.'",
        "'speaker_3': 'There are many other resources that this site will attract that's going to bring economic development to our community, not to mention the hope and housing and healing that this will bring to our community. The city has been incredibly coordinated and strategic and how it deploys its homeless services.'",
        "'speaker_3': 'This site is another great example, an opportunity for the city to continue doing that and to continue strengthening its continuum. And so we're proud here to stand tonight to support the city in this endeavor. It's also very gratifying to see the Everyone Home Task Force recommendations being implemented.'",
        "'speaker_3': 'Hopefully, this is a catalyst for some of the other important recommendations that are in that report. So thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hi.'",
        "'speaker_9': 'I'm carelessly. My address is on file.'",
        "'speaker_2': 'I'm a member of several organizations The East Side Voice Carp and the Long Beach Reform Coalition.'",
        "'speaker_9': 'I'm delighted that you're taking on this project, and I'm.'",
        "'speaker_2': 'Encouraged that we're moving forward to do something for the homeless.'",
        "'speaker_9': 'Population. I, too, am concerned about the price the consider the city is considering paying for the properties chosen. While there is considerable detail and analysis in determining the purchase price of this or any property, the big picture of this particular deal does give cause for concern.'",
        "'speaker_2': 'This property was sold in December 2013 for $2 million. The improvements to it seem to have been to put in a small liquor store. It's hard to believe that a piece of property in the ninth District bordering on Compton, appreciated more than 250% in five years.'",
        "'speaker_9': 'Causing the city to have to use the.'",
        "'speaker_2': 'Entire 9.3 million from the.'",
        "'speaker_9': 'State.'",
        "'speaker_2': 'Just to buy the land and the buildings.'",
        "'speaker_9': 'The money coming from the state should be adequate to cover at least some of the costs.'",
        "'speaker_2': 'Of acquiring not just the land, but accomplishing the improvements to.'",
        "'speaker_9': 'Provide for that 125 shelter bed.'",
        "'speaker_2': 'Surely we can.'",
        "'speaker_9': 'Do better than this. This money came from the taxpayers and it is intended to help the homeless, not line someone's pockets in a real estate deal. Please consider taking one more step and engage the city auditor to validate that appraisal.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Mr. Mayor. Members of the council. My name is Rene Castro. I live in the third district. I'm really, really happy tonight about what's happening here. This is a this is a bold step, as my president, Brian de Andrade, has stated.'",
        "'speaker_3': 'I want to just give a little bit of background. I'm the former chair for Mental Health America. I actually facilitated the city's ten year plan to end homelessness 12 years ago. And I also work at century villages at Cabrillo.'",
        "'speaker_3': 'And of course, we serve 1600 formerly homeless people in any given night. To those who would, you know, raise the costs, I'm not an assessor. I'm not a real estate agent. But I would ask, how much does it cost to continue to house homeless people in emergency rooms?'",
        "'speaker_3': 'What's the cost there? How long is it cost to continue to have L.A. County jails serve as the largest de facto mental institution in the United States? Those are the human costs. Of course, there's an economic cost here.'",
        "'speaker_3': 'We've seen the site where there at the press conference, there's an opportunity here to activate this community not only socially but economically. And I believe in the hands of Rex Richardson. We can get this done. Thank you so much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, mayor, vice mayor and the council members. My name is Frank Romero Crockett, and I'm the public affairs officer of the United Way of Greater Los Angeles. And I play a key role in the Everyone in campaign, a campaign committed to ending homelessness across L.A. County by activating local residents to support smart, collaborative and data driven'",
        "'speaker_3': 'solutions that are focused on building supportive housing that serves our most vulnerable in our communities and as a representative everyone in campaign. We want to show our strong support of the recommendation to purchase the properties on Atlantic Avenue to build a year round permanent emergency shelter for our homeless neighbors.'",
        "'speaker_3': 'We are also here tonight to show that we are bringing to everyone in campaigns together. We at the United Way launched the Everyone in Campaign back in March 2018 with the goal of educating, engaging and activating tens of thousands of people across L.A. County to be a part of ending homelessness by speaking out for housing.'",
        "'speaker_3': 'We know that we have the right strategies and enough resources that we can end homelessness. That's critical. But we also know that's not all what it takes. It takes leadership, which we are seeing here tonight with Councilmember Richardson.'",
        "'speaker_3': 'It takes courage and it takes regular people standing up and saying yes to the solutions that we know work. And they're also saying better not sidewalks. But we see here today powerful message that we will continue to lift up across this beautiful city.'",
        "'speaker_3': 'That's why it takes so much and makes so much sense for everyone in that's focused on ending homelessness to partner with the everyone that's focused on economic inclusion and creating a seat at the table for everyone. These are two sides of the same coin.'",
        "'speaker_3': 'We look forward to working together over the coming months and years to build a stronger Long Beach and a stronger L.A. County, where people have access to supportive and affordable housing that is critical to economic stability and success.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Nick Speaker, please.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_5': 'Honorable mayor and city council members. My name is Sister Celeste Trahan. I am from St Mary's Medical Center. I am vice president of mission integration there. And Carolyn Caldwell, our CEO and.'",
        "'speaker_2': 'President is a member of your Everyone Home.'",
        "'speaker_5': 'Task Force. I just want to say a few words about the services we provide at St Mary and as one of the major providers of hospital services in the Long Beach area for over 95 years, we continue to provide services regardless of people's ability to pay, regardless of where they come from.'",
        "'speaker_5': 'And increasingly in the last few years, of course, we have seen.'",
        "'speaker_2': 'An increase in those poor and vulnerable who are unfortunate enough to be homeless.'",
        "'speaker_5': 'As a participant in a regular.'",
        "'speaker_2': 'Community health needs assessment for the Greater Long Beach area, St Mary is among many organizations within the community which determines.'",
        "'speaker_5': 'Which looks at social determinants of health, one of which is housing and shelter. And we continually face the the challenge of providing comprehensive services to all the people we serve.'",
        "'speaker_2': 'In Long Beach.'",
        "'speaker_5': 'But in partnership with other health care entities and community organizations, we will continue to address these issues and provide care.'",
        "'speaker_2': 'For the poor and the vulnerable.'",
        "'speaker_5': 'Having a year round shelter is certainly a positive.'",
        "'speaker_2': 'Step in addressing one of the.'",
        "'speaker_5': 'Basic needs of life, and it helps us.'",
        "'speaker_2': 'To determine how.'",
        "'speaker_5': 'We will safely discharge homeless people. So thank you.'",
        "'speaker_6': 'Thank you. Next speaker.'",
        "'speaker_3': 'Carlo Sylvia, Long Beach Reform Coalition and the people of Long Beach. I applaud the city's efforts to provide the much needed year round shelter for homeless residents. I'm a professional who has devoted the majority of my career in architecture to the creation of affordable housing, including homeless shelters, and who has advocated for housing as a right and'",
        "'speaker_3': 'not a privilege. Councilwoman Richardson mentioned a state of the art facility, and in in the documents for this meeting, it says property will immediately provide space for a needed year round shelter. He said there are 3 million to rehabilitate the building.'",
        "'speaker_3': 'That is an impossible feat to accomplish. The existing buildings are unsafe to inhabit. Do not provide even the most basic necessities. They're structurally unsound, lack adequate heating, ventilating, air conditioning and the other life safety measures. The these buildings are basically tear down in terms of the cost of that is being paid.'",
        "'speaker_3': 'The nine and a half million dollars that the city ought to have been paying land value, not not the the square footage of these buildings. So this these buildings will not as as has been stated, will immediately provide space needed.'",
        "'speaker_3': 'That is going to cost somewhere in a conservative value of about $100,000 per bed. Not to mention the operating costs, which I'm not an operator, but perhaps the other people here I can can talk about that. That's that's going to be another 2 to $3 million a year for operating costs.'",
        "'speaker_3': 'So in terms of costs, what we really need to talk about is there is no value in in I mean, there's a lot of value in housing the homeless, but there's more value if we spend that money appropriately.'",
        "'speaker_3': 'And I don't think that's being done on this project. Thank you.'",
        "'speaker_4': 'Hi, everyone. My name is Reed, a sophomore at Poly High School. From a youth staff perspective, I think that we're taking a step in the right direction. Building the homeless shelter in Long Beach. But in the Long Beach, homeless shelter will greatly help Long Beach because there's over a thousand homeless people currently living here.'",
        "'speaker_4': 'The homeless shelter also provide beds and generous separated quarters. I personally dislike it when it rains because outside they're homeless people without the proper clothing and roof to go under. So I think the homeless shelter is a step in solving the Long Beach homeless problem that we have.'",
        "'speaker_4': 'The shelter provided homeless people a nice place to go to feed them food and clean water. And not only that, but can help them get back on their feet so they can live a normal life again.'",
        "'speaker_2': 'Both in the homeless shelter and not.'",
        "'speaker_4': 'Only help the homeless, but the citizens of Long Beach, because there will be less homeless people on the streets and the homeless shelter provide more jobs and increase productivity in cities. This has a more of a positive than a negative outcome, and I think this is a great idea.'",
        "'speaker_4': 'Thank you. Council and especially Councilmember Richardson for shedding light on this topic. Please support this cause.'",
        "'speaker_6': 'Thank you. Next week.'",
        "'speaker_2': 'Before I begin, I just want to say thank you, City Councilman Richardson, for bringing light on.'",
        "'speaker_6': 'Bringing you. Please state your name.'",
        "'speaker_2': 'Oh, um, my name is Joanna, and I'm a junior at Milliken High School. I think this homeless shelter is a great idea and a step in the right direction. Currently, there are over a thousand homeless people in Long Beach that don't have the resources they need.'",
        "'speaker_2': 'Building the shelter will give them a step towards getting back on track by providing jobs and making sure they're healthy, especially with the bad weather we've been having recently. They don't have the risk. The protection from the rain that is needed and are more likely to get sick with this shelter.'",
        "'speaker_2': 'Their have access to resources. They need to be healthy. Also, a lot of the people, a lot of the time people are intimidated by homeless people and with the help of the shelter, that will break that stigma. It's a big, important step with this homeless shelter, and I think it should be voted yes.'",
        "'speaker_2': 'So please consider voting yes.'",
        "'speaker_6': 'Thank you. Thank you.'",
        "'speaker_3': 'Good evening, counsel. My name is Jonathan Great. I am a lifelong resident of Long Beach and I must say I have drunk the water before I think I turned out okay, so I will get that off my chest.'",
        "'speaker_3': 'I also work I'm a part of a senior leadership team at a nonprofit here at Long Beach. We are definitely facing a homeless crisis here in Long Beach. At last year's homeless count, there was about 2000 homeless people living in the streets of Long Beach.'",
        "'speaker_3': 'I work with families who are one financial catastrophe away from homelessness. Homelessness affects everyone across all ages. One in six students that go to Long Beach City College are experiencing homelessness and one in ten students at Cal State Long Beach.'",
        "'speaker_3': 'Providing beds for them and providing them a place to go when they're trying to better themselves is definitely an equity issue that the city needs to take up. We need to have everybody in on this initiative and we need to have everybody in.'",
        "'speaker_3': 'In support of the homeless shelter. A lot of people are throwing around numbers and the cost of purchasing the buildings and the facilities. It's a lot better than renting or trying to lease these facilities. Those prices can change.'",
        "'speaker_3': 'We will own the facilities and it will be an investment that will last decades. Additionally, the state providing $8 million to address our homeless situation is definitely commendable by the former governor, Jerry Brown. In addition to beds, the homeless shelter will also provide job training, life skills, education and medical facilities for the homeless the homeless individuals.'",
        "'speaker_3': 'I commend Councilmember Richardson for bringing this to the Council and County Supervisor Janice Hahn for bringing over $3 million to help the renovation of the facilities. I thank you for your time and I urge you to vote yes and to continue investing in the city that we all love.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_6': 'Thank you. Next week.'",
        "'speaker_2': 'Hello. Good evening.'",
        "'speaker_5': 'My name is Marisela Rivera. I am a resident of the ninth district.'",
        "'speaker_2': 'I want to first thank the the mayor and, of course, Councilmember Rex Richardson for his leadership.'",
        "'speaker_5': 'On this issue.'",
        "'speaker_2': 'I think it's incredibly easy to say we need to fix the problem. I think it's incredibly hard to say I'm going to be part of the solution. And I think.'",
        "'speaker_5': 'That I have seen I've.'",
        "'speaker_2': 'Lived in Long Beach for 19 years now, and I've seen the Army.'",
        "'speaker_5': 'Reserve.'",
        "'speaker_2': 'Facility almost become a homeless shelter. And residents in that district in that area said, not in my backyard. I have seen very recently residents in another part of Long Beach formed their own militia and say, not in my backyard.'",
        "'speaker_2': 'And that wasn't about permanent housing, that wasn't about solutions. That was simply about not wanting people to exist in their neighborhood. I have seen my neighbors in District nine say.'",
        "'speaker_5': 'Yes.'",
        "'speaker_9': 'In my backyard.'",
        "'speaker_5': 'Because we are going to.'",
        "'speaker_2': 'Help people. I encourage all of the residents in Long Beach to talk to homeless people. They are people. My elderly mother lives with us. We are five people now in a two bedroom house. We bought it a month before she was about to be homeless and when she needed a place to stay, we made it work because'",
        "'speaker_2': 'that's what we do. She would be one of those people if we didn't have her in our home with our two young children living in the ninth District in walking distance from this future all year shelter.'",
        "'speaker_5': 'I'm incredibly proud of.'",
        "'speaker_2': 'Rex Richardson and the city of Long Beach for taking this measure. Thank you so much.'",
        "'speaker_3': 'Thank you, Steven Council.'",
        "'speaker_4': 'My name is Jordan Win. I'm the Long Beach organizer of the Everyone in Coalition, part of United Way of Greater Los Angeles. We're here today to proudly support and urge you to vote yes, to acquire these properties, to develop this permanent emergency shelter.'",
        "'speaker_4': 'Having this new permanent shelter will aid in alleviating some of the most acute problems faced by our homeless neighbors in Long Beach. And it's a call to continue the work until all people in our city have a roof over their heads that they can call home.'",
        "'speaker_4': 'Rick said it best. This is the start. This is just the beginning. And he's shown immense leadership in this project. And we were honored to partner with him for this announcement last Monday and now to be here again to show our support.'",
        "'speaker_4': 'You've done a wonderful job engaging the community. You understand the importance of a healthy housing market and the need for affordable and supportive housing throughout our community. And so we hope to continue. You have a fruitful work with your office as well as the rest of Long Beach.'",
        "'speaker_4': 'We've met with most of your offices and had some wonderful discussions around moving this issue forward. We're committed at everyone in to building deep partnerships here in the months and years ahead. We've seen the strength of Long Beach is community.'",
        "'speaker_4': 'Many people came out today to show their support and we want to continue to show that we need these kinds of developments in Long Beach. We want to bring everybody in to show that we need to see more of these developments.'",
        "'speaker_4': 'We need to see more supportive housing, more affordable housing, more shelters around the city. And we want neighbors in Long Beach who are the majority to raise their voices and say, yes, yes, in my backyard, yes, this is what we need.'",
        "'speaker_4': 'So thank you so much. We once again urge you to vote yes. And I'd like to take these seconds to ask everybody who has signs, who's out here to support in the audience, to please stand, show your support, and thank you for coming out here tonight.'",
        "'speaker_4': 'Thanks so much.'",
        "'speaker_6': 'Thank you. Next speaker.'",
        "'speaker_9': 'Hello. My name is Julie Jones. I've lived in North Long Beach since 1986. And this situation is your typical hope for the best, but expect the worst. That said, you, as our elected representatives and we as a community need to develop a comprehensive plan of action regarding this campus compound in North Long Beach.'",
        "'speaker_9': 'This discussion and plan needs to begin now and continue monthly throughout the design, construction and implementation of this facility. Some considerations to discuss are the following. Each council district should have homeless facilities, not just North Long Beach. What about mental health problems?'",
        "'speaker_9': 'What type of facilities will be located on site? Will these issues be addressed? What about off site? And if so, where? Where do the people go if they're removed from the campus for disciplinary reasons? What about 24 hour security?'",
        "'speaker_9': 'What will their boundaries be? Only on site or off site also. Will more Long Beach police officers be required? And if so, are they coming from are already stretched to the limits delegated officers? How long will the grant money last?'",
        "'speaker_9': 'Are we going to have more taxes placed on us to continue to maintain the daily operating expenses of this facility? Is the money we have from outside sources enough to sustain ongoing business and not just construction? Let's utilize our high schools and colleges to provide onsite training for their students working as interns.'",
        "'speaker_9': 'What about having neighborhood cleanups and other community outreach activities using the campus residents? To do this with the community. What about the bathroom facilities? Are there going to be offsite porta potties? Representatives of the North Long Beach Neighborhood Associations should have ongoing meetings.'",
        "'speaker_6': 'Thank you. Thank you. Thank you very much.'",
        "'speaker_3': 'Good evening. I'm Pastor Omar Mohammed. I serve the residents of Skid Row, Los Angeles. I stand today to speak on behalf of the people experiencing homelessness. I haven't been homeless for a year and a half with my family until July of 2018.'",
        "'speaker_3': 'I understand the plight. I commend Councilman Rex Richardson for taking up the cause of positive action toward ending homelessness homelessness in Long Beach. From my perspective, the councilman is taking a high risk close to political suicide, especially in the era of not in my backyard ism.'",
        "'speaker_3': 'Believe me, I understand nobody wants to be home once a homeless shelter in their backyard. But what I know is that if no one allows a shelter in their backyard, if not to, in the not too distant future, you will have homelessness in your front yard.'",
        "'speaker_3': 'I have worked for the homeless community off and on for over a decade. One thing I know is that homelessness is spreading. It is not decreasing and it is growing in the areas of women and children. I am aware of the magnitude of homeless of the homeless crisis in our nation, state, country, and especially the epicenter, Los'",
        "'speaker_3': 'Angeles. As you are, as you ask, why am I in Long Beach? Because homelessness is the same everywhere. When I heard about your efforts to change this, I said I want to be a part of it. So I step in.'",
        "'speaker_3': 'It is always a great step in the right direction. I know one thing that it may not be a lot of housing, but if you just if you think about that illustration of the beach, we had all the starfish on it.'",
        "'speaker_3': 'That guy picked up one starfish and threw it in the ocean. He said, What difference does that make? It didn't make it a whole lot of difference to those people in that beach, but it made a difference to that one person that got out.'",
        "'speaker_3': 'Keep up the good work, man. God is with you.'",
        "'speaker_6': 'Thank you very much. Next speaker.'",
        "'speaker_9': 'Good evening, Congressman.'",
        "'speaker_2': 'And everybody. Excuse me. City leaders and everybody in attendance. My name is Maureen Morris, and I provide bags for the homeless. I just about every.'",
        "'speaker_9': 'Day I go out and.'",
        "'speaker_2': 'I talk with the homeless and I hand them bags and see what their needs are. You know, we've done a lot of talking here tonight about what the homeless need.'",
        "'speaker_9': 'And my question is, are we going out there? Are we getting.'",
        "'speaker_2': 'In the areas where they are and.'",
        "'speaker_9': 'Asking them, what are your needs? What would you like to see this year to have? So moving forward, as I'm out there and I'm.'",
        "'speaker_2': 'Speaking to them and I'm handing out the items that I hand out, I'm going to be asking them, What would you like to see this shelter have? I know you know when you need beds, you need other items and things of that nature.'",
        "'speaker_2': 'But what would you like to see them have?'",
        "'speaker_9': 'That should be the question. What would you.'",
        "'speaker_2': 'Like us to provide? And then we all know, you know, what their needs are. So as I move forward and I'm doing what I'm doing and I'm talking to them, I'm going to be finding out what they think, you know, they would like to see the shelter have.'",
        "'speaker_2': 'And I will be contacting you guys to, you know, let you know what they would like to see. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please. And I just want to make sure that I'm going to close the speaker's list with everyone that's speaking in line. If there's anybody additionally, I want to make sure I capture them as well.'",
        "'speaker_0': 'Okay. So we're going to and we're actually after this, gentlemen. We're going go down to the 90 seconds. Go ahead, sir.'",
        "'speaker_10': 'My name is is Pastor Bo Stevens. I'm one of the pastors at Chapel of Change and the City of Long Beach.'",
        "'speaker_3': 'And I'm an.'",
        "'speaker_10': 'Advocate of the Lord Jesus Christ. So. And I care about.'",
        "'speaker_3': 'What he cares about. And so and so when Rex Richmond, Richardson Toler told me about this, I was really pleased.'",
        "'speaker_10': 'To come along and support him because Jesus cares for the.'",
        "'speaker_3': 'Poor. And there's a question, yes. What is Jesus going to judge you on on the day of judgment?'",
        "'speaker_10': 'And and I got to thinking about that. He said one of the passages in the Bible says, When I was hungry, you fed me. When I was thirsty, you gave me something to drink. When I was naked, you clothed me when I was sick.'",
        "'speaker_10': 'You visited me when I was in prison. You came to see me. And so. I. I care.'",
        "'speaker_3': 'About what the Lord cares.'",
        "'speaker_10': 'About.'",
        "'speaker_3': 'And we are. We are actively.'",
        "'speaker_10': 'Involved. Ministering to the homeless or homeless for an early church.'",
        "'speaker_3': 'And I just want to share that. Yesterday, a homeless man bought me lunch. And that's a miracle.'",
        "'speaker_10': 'A homeless man by his name was Joe. I live in the city of Paramount, but I pastor in the city of Long Beach.'",
        "'speaker_3': 'But I walk to this taco.'",
        "'speaker_10': 'Stand and and this guy, Joe, says, I said, man, I got to buy this guy a taco. Here's Joe again.'",
        "'speaker_3': 'And Joe says, No, I want to buy you a taco. So a lot of.'",
        "'speaker_10': 'Times we view homeless people. They're people. There's somebody and.'",
        "'speaker_3': 'There's somebody's uncle. A lady behind.'",
        "'speaker_10': 'Me was Cher, and that's her mom. She's homeless.'",
        "'speaker_3': 'And there there's somebody, a man. And so God cares about people.'",
        "'speaker_10': 'And I just want to say hi to Al Austin here, to a man here. He represents our district. Ken Bixby knows, too. We have a campus there.'",
        "'speaker_3': 'Anyways, God bless, guys.'",
        "'speaker_0': 'Great work. I'm for the proposal. Thank you very much. Next speaker, please, on this.'",
        "'speaker_9': 'Hi. My name is Jacqueline Case. I live in District eight and I also own a home and I am a realtor and I believe in affordable housing. I believe in homes for everyone. I support the everyone in in everyone home.'",
        "'speaker_9': 'And I want to commend our youth for coming out here and speaking about this subject, because it's it's wonderful to hear all different ages, all different ethnicities, all different backgrounds, everything. Also, Maricela, Debbie Rivera. Sorry if I butchered your name.'",
        "'speaker_9': 'What about me? What about in my backyard? So I'm very pleased and I will support Rex to the end. Disagree for this, but why not in every district? And so I will challenge every district to be Inbee because like everyone has made a comment here, this is humanity.'",
        "'speaker_9': 'I do have family that deals with homelessness, so it is near and dear to my heart. And then I also am a realtor. So, you know, go figure. That's a comment. Sometimes that can be a conflict, right? People talk about, you know, housing and so forth, but I'm for all of that.'",
        "'speaker_9': 'So I think having conversations like this, I've met amazing people in line, being able to be here to support Rex and support this initiative. I look forward to it and thank you for doing the extensive work, everybody who was part of that.'",
        "'speaker_9': 'I really appreciate it and thank you. And please support this.'",
        "'speaker_0': 'Unique speaker, please.'",
        "'speaker_2': 'Good evening, everyone. Thank you. My name is Keena Tompkins and I'm with the United States Veterans Initiative that's located in villages of Korea. Be really brief. We offer supportive services for homeless veterans. We service about 800 veterans daily.'",
        "'speaker_2': 'But what I'm tasked to today is to inform you that for the past two years, US Vets has operated the winter shelter at 5571 Orange Avenue. And I just want to share some success stories. For sure, we need all the resources and supplies that they need.'",
        "'speaker_2': 'But to know that you have help, maybe one or the 150 that we serve is nightly. With food, with clothing, with hygiene. We have place since we started the shelter on December 8th. We have place 14 people. And these are the most vulnerable people we have here, homeless people.'",
        "'speaker_2': 'We have we place 14 of them already in housing and with jobs. So this is not a need. It's not a it's not a want. It's a need. And you as veterans, as operation manager, we are here to support.'",
        "'speaker_2': 'And we would love to be part of that transition team with operations because we've done it for two years and I think we've been successful with it. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Hi. My name is Miha. I live in that neighborhood and I see the necessity of the homeless shelter. So I appreciate that. And but I'm not happy that I just learned about this a couple of days ago, but it seems like it's already it's going to move forward.'",
        "'speaker_2': 'So I probably have to make a commitment to support, but I need your commitment to make sure this neighborhood will not be deteriorated any more than as it is right now as far as cleanliness and crime. I am single woman living there.'",
        "'speaker_9': 'I'm very afraid. Just want to know when you're.'",
        "'speaker_0': 'Me home and thinking we will work. What are those are issues and other important to the councilman and to the city and so and I would encourage also maybe if maybe someone from the councilman's office or my office to connect and we want to make sure where you get the information and feel safe in your community.'",
        "'speaker_0': 'So thank you very much. Next speaker, please.'",
        "'speaker_9': 'Good evening, Mayor. Council members and everyone.'",
        "'speaker_3': 'Actually had no intention on speaking, so I'll make this really.'",
        "'speaker_9': 'Quick. As a former homeless person, I've gone from homelessness to feeling like 150 people a day from my own home. When I lived in Miami, I just moved here from Miami. And Miami is a no tax day, so I didn't have to pay taxes in Miami.'",
        "'speaker_9': 'And other people were like complaining about what you guys are going to pay for this building and others though I would gladly give my taxes to pay for.'",
        "'speaker_7': 'That because you cannot.'",
        "'speaker_9': 'Put a price on hunger.'",
        "'speaker_3': 'Homelessness and peace.'",
        "'speaker_9': 'Of mind. Council. My name is Lauren Boland. A few weeks.'",
        "'speaker_2': 'Ago, I participated.'",
        "'speaker_9': 'In.'",
        "'speaker_2': 'The homeless count. It was life.'",
        "'speaker_9': 'Changing. I thought my work with Habitat for Humanity was life changing in 2008. No. I ask.'",
        "'speaker_2': 'You to remember that this money.'",
        "'speaker_9': 'Is $8 million that we've been granted by the state. It's for human beings. It's not to be a really great, cool real estate development. It's not to be a showstopper. It is for people. These people are. They're not all mentally ill.'",
        "'speaker_9': 'They're not all drug addicts. What I experienced out there in in in that count, I had no idea.'",
        "'speaker_2': 'I worry that they're not all going to use that shelter in that location.'",
        "'speaker_9': 'I worry that we're not going to have enough money to.'",
        "'speaker_2': 'Build the ones that we need in other parts of the city. As a mortgage.'",
        "'speaker_9': 'Professional, I worry that the value of the property has been inflated by a marijuana gold rush. That is over and I ask the city to get another appraisal. What is it? Five, $7,000 to get another one done. Spend the money.'",
        "'speaker_9': 'Do the due diligence. The homeless people out there need every dollar spent appropriately. Thank you.'",
        "'speaker_0': 'Next speaker. Thank you.'",
        "'speaker_2': 'Good evening, mayor, vice mayor and city council members. My name is Juanita Doppler moore. I'm a resident of the ninth District and I'm also the president of the Collins Neighborhood Association and the Veterans Affairs Commission representing the ninth District.'",
        "'speaker_2': 'This is a great.'",
        "'speaker_9': 'Opportunity to address a citywide issue of homelessness and.'",
        "'speaker_2': 'Lack of affordable housing there, with there being over a thousand 1800 homeless individuals in our city. It is time to step up and address this issue. I'm in great support of the of the campus. That is part of the discussion tonight to provide our residents with affordable housing, wraparound services and job opportunities and rehabilitation.'",
        "'speaker_9': 'This space.'",
        "'speaker_2': 'Goes.'",
        "'speaker_9': 'Beyond just.'",
        "'speaker_2': 'Housing, the housing, the homeless individuals. It provides them the opportunity to reintegrate and become members of society. I am. I am. I applaud the city councilman, Rex Richardson, and all the members here tonight. And I ask that you support this initiative.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Nick. Speaker, please.'",
        "'speaker_2': 'Hello. My name is Ron at Mars. I'm with the Hamilton Neighborhood Association. I used to be afraid of the homeless, but then I realized that it was my own fear of them and being homeless and that they're just human beings trying their best to survive.'",
        "'speaker_2': 'I realized it is not my right to say they have no rights, no rights to services if it's in my neighborhood or if it will affect me or if I will see them. It is not my right to say who deserves help and who doesn't, or to judge why they are in that position.'",
        "'speaker_2': 'Likely we are a few months away from being homeless ourselves if things go wrong in our lives. Then I thought back on my life when I was a teen. I lived on the streets for about three years. I'm so far removed from that time that.'",
        "'speaker_9': 'I'd forgotten what I had gone through to survive on the streets. I know this is.'",
        "'speaker_2': 'A growing issue. I know we are not the only area in the city that is picked on by hosting homeless services. I know that this is an issue that can affect each and every one of us at any time, at any capacity.'",
        "'speaker_2': 'I know that we need to step up and be a part of the solution. I know that these less fortunate need our help.'",
        "'speaker_9': 'I know we need to look at this and quit trying to ignore it. I wish there were.'",
        "'speaker_2': 'No homeless and we were not having this conversation. But there is. And we are. So we must now work to solve it. Drawing a line in the sand does not solve anything during this process. I would also challenge other districts to be as open minded as the ninth District and Rex Richardson in supporting homeless services.'",
        "'speaker_2': 'Please consider approving the sale. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hi. My name is Jerry Fink. I'm with the Hamilton Neighborhood Association. I'm glad to see our representatives in this perpetually Rex Richardsons of forward thinking on this. And a lot of things are happening in our district, and I'm glad that the homeless are not going to be left out.'",
        "'speaker_3': 'I encourage the neighbors that are against it and for it to sit down at the table and we can see what works for everybody because it's it's all of our neighborhoods and and we need to help those that are less fortunate than ourselves.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. I'm also going to close the speakers list. I had we had closed it, but another person jumped. So we're going to the gentleman in the carpet. I will be the last one. Okay. Yes, please.'",
        "'speaker_9': 'Good evening. My name is Linda Campbell, and I'm a 38 year resident of the Hamilton Neighborhood Association. I'm in strong support of this initiative. I look forward to being part of the solution for the homeless. That particular site has been a problem.'",
        "'speaker_9': 'The entire time I have lived in the Hamilton Neighborhood Association. This is an opportunity for us as a community to step up and be part of the solution and not just sit back and say, not in my backyard.'",
        "'speaker_9': 'The gentleman who spoke who said, if it's not in your backyard, it may very well end up in your front yard. Very apropos. If we sit back and do nothing.'",
        "'speaker_2': 'We will not.'",
        "'speaker_9': 'Solve the problem. It will just increase. Please step up and do the right thing and support this initiative. And make sure that we are part of a solution. And I challenge each councilman. To organize your own communities, your own council districts to be part of a solution that's going to continue if we don't all step up and'",
        "'speaker_9': 'be part of the solution. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Karen replied, I'm a resident of District one and I am so proud of my city tonight for bringing this forward. And for Rex, for all the work and all the people that have put in effort on this project.'",
        "'speaker_2': 'As someone who was homeless for three months, I don't want anyone to ever have to sleep on the floor of a locked bathroom, public bathroom, or to wash their hair in a sink because they don't have a place to go.'",
        "'speaker_2': 'I've been here working in a home in housing for over 13 years, and this is just kind of the high point of my life up to this point. This is just so meaningful to so many people in our community who are not them or those people.'",
        "'speaker_2': 'They are us. You can never tell who is homeless, who's sleeping in their car, who is couch surfing, could be the person next to you. Could be your neighbor. So don't judge people. Help them. They're all part of our community.'",
        "'speaker_2': 'And thank you so much for all your hard work. And that price.'",
        "'speaker_5': 'Is not too high.'",
        "'speaker_2': 'How much is it worth to save people in our community?'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Yes, I am one of you from the eighth district. I would like to ask a couple of questions. One is, if this project or purchasing decision is going to receive money from the state and the county. Is this project going to be a regional project or a city only project?'",
        "'speaker_3': 'Also, why are relocating this process, this project as far north as possible from where the actual people congregate? Why would someone in downtown go all the way to North Long Beach, given that they have carts, personal belongings, etc.?'",
        "'speaker_3': 'And why would there. If I want there be public outreach. Why hasn't there been enough public outreach? Or dialog in choosing this location. Why is it we are always presented with a fait accompli instead of a choice? Please postpone.'",
        "'speaker_3': 'Postpone this decision. In order to open it up to the public for dialog, in order to show us what steps were taken to come to these conclusions. Like a previous speaker said, it's eight or nine and a half million dollars are going to be spent on a piece of land.'",
        "'speaker_3': 'Not on the people that really need it. Thank you.'",
        "'speaker_0': 'Your next speaker, please.'",
        "'speaker_2': 'Good evening, councilmembers. Mayor Garcia.'",
        "'speaker_5': 'It's good to be with you tonight. My name is Megan Curr. I'm a resident of the eighth District. I also have the honor of representing North Palm Beach on the Board of Education for Long Beach Unified School District.'",
        "'speaker_5': 'And I can't I think the words that have been said previously by the people who live in the adjacent properties about the positive impact that this will have on their lives and on their property values. I can't restate that.'",
        "'speaker_5': 'But what I can say as someone who's been involved in the homeless issue for 17 years and someone who's lived in this community my whole life, I've never been more proud of the North Long Beach community for stepping up and saying, yes, yes, here, yes, us will be part of the solution.'",
        "'speaker_5': 'I want to thank the council members who stayed in the chambers for this entire discussion to hear us and to hear us implore everyone else in the city to do the same thing, which is step up. We belong to each other in this city and we like to talk about how we're a big city but a small'",
        "'speaker_5': 'town. But the residents of North Long Beach have shown and led the way with their example tonight and their positivity and their embracing of the complex realities of homelessness and their willingness to be part of the solution. So as a lifelong resident, I am very proud.'",
        "'speaker_5': 'As a school board member, I am very proud. And I urge you to support this measure tonight. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, mayor and council members. My name is Dr. Gerald Higginbotham. I am the CEO and founder of the Captain's Millionaire, Inc. I'm a new residents here, 90 day residents to the Long Beach area. I'm just returning home after 30 years.'",
        "'speaker_3': 'And so I've come home to help to heal our communities. And I just didn't want to sit in the stand. I'm in wrecks. I'm standing with you. I've helped to develop a bottom up model that will address many of the issues that we have in our communities.'",
        "'speaker_3': 'I did it in Saint Louis, and so now I'm coming home to Long Beach so we can begin to make an impact. I'm in.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_2': 'Hi. My name is Monica Keller. I'm a resident of the ninth District and representing the Start King Neighborhood Association. And I just want to thank Councilmember Rex Richardson for stepping up to take on this challenge. And all the neighbors and the residents there are concerned and they address them.'",
        "'speaker_2': 'And I thank you guys for taking the time tonight to bring up some of those issues and kind of, you know, let us know what's going on and what has gone on in the past and how we can move forward.'",
        "'speaker_2': 'And just is, again, we're all in and we just thank you and we're here, you know, thank you again for helping us. I work in social services, so I know direct every day the impact that homelessness has on our participants as well as my coworkers.'",
        "'speaker_2': 'I work with people who every day are facing homelessness or just a check away from being homeless. So I think this is a very important issue and I just thankful that we are in a part of the city that is taking it on.'",
        "'speaker_2': 'And I hope that other parts of the city and other districts also address this in their own areas. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening. My name is Charlie. I'm a I'm an aunt and I. I used to live in Torrance. I moved to Paramount. I buy a new brand new house and I just got something on my front door. Uh, yesterday I got two, and then I got one again when I came back from work saying in the city'",
        "'speaker_3': 'to purchase any liquor and warehoused for $9.5 million. I didn't I didn't know this until yesterday. I was hoping that if you wanted to engage on people around the community of Paramount, it was I get this every like every month a flier saying what the good things with new events were doing.'",
        "'speaker_3': 'What are we? You know, pretty much everything. And I told the news events and I feel proud because it's like from Torrance to coming to Paramount. I couldn't really afford a house in Torrance because I had to live within my means.'",
        "'speaker_3': 'And this newly fresh built house maybe, you know, achieve that goal, have that dream. And now I talk to my mom and and she said, Well, now you got to think about your house can be devalued. I know that gentleman like was talking about appraisal and what they're trying to do and yes I help people are you'",
        "'speaker_3': 'know I know I can't you know go on details but when I have patients in the E.R., you know coming up my floor they're they're not always the best and they're always not good. I always get the good and the bad.'",
        "'speaker_3': 'And so I just feel like. Thank you very much. All right, cool.'",
        "'speaker_0': 'Thank you very much, sir. That concludes public comment. I know that Councilor Richardson had a few more and. We ended with him and he wanted to make a closing comment. And then we're going over to Councilmember Pearce and then the speakers.'",
        "'speaker_10': 'Two speakers. Thank you, Mr. Mayor. And I just wanted to just, uh, acknowledge you all and address some of some of the things quickly that were brought up. So, number one, we're all in this together. All of our city council colleagues have made contributions to this conversation.'",
        "'speaker_10': 'The mayor, the entire all of our colleagues care about this issue. It's true. Other districts have hosted the winter shelter in the past, district eight districts, one that I know of. There's been efforts across the city. So people are committed to this issue.'",
        "'speaker_10': 'And for this to work, we need everyone's support. And so, you know, I want to thank all of our colleagues on the city council for their commitment to this issue and for their hard work. A few things came up.'",
        "'speaker_10': 'Just some basic stuff that I heard I want to just debunk so quickly this conversation. I keep hearing $2 million sales price and 300% increase. So. Mr.. Mr.. Keisler, can you quickly just describe the arms length sale and what that $2 million was?'",
        "'speaker_11': 'Councilmember Certainly so. So through through the process of conducting an appraisal, there's a title record review. There's also interviews with past property owners to understand the way the valuation was was set at the previous purchase price. In this case, there's something in California.'",
        "'speaker_11': 'It's called an arm's length transaction, which means that the two parties don't know each other there. It's usually a market based process if it's considered arm's length. In this case, in the 2013 transaction, the the transaction between two parties, in this case, the Rescue Mission Foundation and the current owner was not considered arm's length.'",
        "'speaker_11': 'In fact, there were extenuating circumstances that were not disclosed, but indicated that this was not a market based transaction. It could be in some cases that that one of the parties is under duress or they work out a deal less formally.'",
        "'speaker_11': 'And so the price that was recorded with the assessor was based on a process that was not considered arm's length and was not considered market based, which is why it explains in some ways why it was so below market at that time.'",
        "'speaker_11': 'The price probably was was higher than what the the previous owner had paid, which was over $3 million for the property. So we don't have all those details. But that that was part of our appraisal process.'",
        "'speaker_10': 'Thank you. Do you know who the owner was before it was sold.'",
        "'speaker_11': 'Prior to the the owner the current owner, it was the Rescue Mission Foundation. That was who was indicated as the previous owner.'",
        "'speaker_10': 'Great. I know there was a comment about Jim Lewis who was associated with the rescue mission about the market there. The rescue mission are the folks who sold it below market value. So everything you hear, there's always more context to it.'",
        "'speaker_10': 'Next thing that there was a comment about, the 3.4 million from the county that we're grateful for is not enough to make you know, to build this vision. It's absolutely true. That's why the plan is to go out and identify public private partners, other agencies, so that we can build this aspirational vision that we're talking about.'",
        "'speaker_10': 'So we're not by any means claiming that the 3.4 million will be the it for this for this project. That money is is dedicated to retrofitting the existing building. But we're talking about is as much more for the site.'",
        "'speaker_10': 'There was the last thing is folks say, why North Palm Beach, not other areas, as if there aren't homeless issues in North Long Beach. The reality is we are at the only part of the city is at the nexus of the L.A. River, the 1791 and and the Edison right away.'",
        "'speaker_10': 'All of those have different jurisdictional issues in terms of who responds from a public safety standpoint. County sheriffs, some private, some LAPD, all of them. We always have the issue where you clean up an encampment, you clean up an encampment, you help reach new outreach on one side.'",
        "'speaker_10': 'And then folks simply jump the fence inside of the camp and, you know, on the Edison right away. And then you go address that. They put it back on the other side of the fence, in the river, in the flood zone.'",
        "'speaker_10': 'And so we have to be comprehensive. And there are issues, significant homeless issues in north on beach that this will help to address that those homeless issues in Norfolk. And so we don't want to assume that there's only homelessness in the downtown.'",
        "'speaker_10': 'There's not there are major anchors along the river where homelessness exists. Again, this has been you know, this is a team effort. The entire council has done great things on homelessness and, you know, and the community has stepped up.'",
        "'speaker_10': 'So there's nine letters of support here. So I just want to acknowledge Assembly Member Mike Gibson. Speaker Anthony Rendon. Central Asia. Andy Kerr. Committee Girls and Action Legal Aid Foundation of Los Angeles, Long Beach Community Action Partnership, YMCA, Community Development and Pools for Hope for submitting these letters to the City Council.'",
        "'speaker_10': 'Thank you. And that's my piece.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Pierce.'",
        "'speaker_2': 'So I want to say thank you to every resident that showed up today. Every person that shared their story. Every person that's been a part of this discussion not only in the last two weeks, but for the last several years.'",
        "'speaker_2': 'And, of course, I think the council member in North Long Beach that has had the opportunity to lead on this, to really work with community members, to make sure that this is not a place where you're going to have cuts, but this is a place that's going to be really serving of the residents that are there, of'",
        "'speaker_2': 'the homeless population that is going to transition through that space. I think creating, you know, a campus that has opportunities similar to the villages of Korea is going to be exciting to have that partnership is really critical. I know that often we respond out of a place of fear.'",
        "'speaker_2': 'You know, not in my backyard or how much money are we going to spend? And that knee jerk response. And we know when we lead out of a place of fear, we hold ourselves back and we isolate ourselves.'",
        "'speaker_2': 'And so, too, have residents in North Long Beach say, we want to partner. We want to work together. We want to put that aside. And yet we have some questions. You know, we have we'd like more lighting. Sure.'",
        "'speaker_2': 'I think that that really demonstrates how far the city has come. Ten years ago, if you would have had this discussion here in this chamber, it would have gone very differently. When we look at how much money we've spent on homeless services over the last three years, I think I just got some numbers since I've been in'",
        "'speaker_2': 'office. It's around $26 million out of our health department. That doesn't include the cost in our urgent care. That doesn't include the cost of our fire and PD going out for calls of service for people that are on the front lines.'",
        "'speaker_2': 'In my district is downtown. It's our waterfront as a district that has high property values. It's a district that is very much impacted by homelessness. And I think it's very fascinating to see sometimes that just this side of the block can say we will spend whatever it takes to house somebody, and then you have fear and worry'",
        "'speaker_2': 'on the other side. And so to everybody's point around, why not other places? I think that Councilmember Rex Richardson made a really great point. We have to watch and make sure that, one, that their property values are maintained.'",
        "'speaker_2': 'They have spent a great deal over the last three terms of this council district and in the north Long Beach to change the story about what north long beaches. And so I know that's extremely important to the councilmember, making sure that when you see homelessness, that you're not seeing tents, but you're seeing people getting services and coming'",
        "'speaker_2': 'out and moving on past that that point. So those are things that I think, yeah, we need to watch and see. But in my office, when I first got in, I think, you know, we all come in bright eyed and bushy tailed and we try to lead on on items.'",
        "'speaker_2': 'And I know I've worked with folks that have done homeless services for a long time, and we came in and tried to put a couple of different places with the shipping containers. And I remember working with development services and they're like, No, we're not going to do X, Y and Z, we're not going to retrofit them.'",
        "'speaker_2': 'It's going to be people living in boxes. And we worked with the Gay and Lesbian Center, the LGBTQ center on Fourth Street, which is in my neighborhood. And they said, absolutely, we'll put them on our property, we'll put them on our back lot if we have to.'",
        "'speaker_2': 'We'll put them on stilts above our property. We ran into some challenges. We ran into some great opportunity with some funding, but it was a very heavy lift to carry something like this and to not just say, we found a place, we found the money and we found the community that's willing.'",
        "'speaker_2': 'And unfortunately, in my first six months in office, we weren't able to pull that off. There's still interest. HGTV Rex, I'm going to connect you. These guys, they want to retrofit and put money into anything to help with this homeless community.'",
        "'speaker_2': 'So there are some once we start on a project like this, we are going to get some more resources. But I totally accept the challenge of some services in the second district. We obviously have a very different geographic space and I think we've tried to work even to find empty lots that are going to be waiting for'",
        "'speaker_2': 'development to say, well, can we do something temporary? But it takes a lot of coordination. And so bureaucracy sometimes feels like it doesn't have a heartbeat. But I want to say how proud I am of our staff, our city staff for the last several years is really seems like we have found our heartbeat and we're we're attempting'",
        "'speaker_2': 'to march along that to get solutions. And so I know it takes a lot of different components. I challenge community groups, developers, those that are doing homeless services to also think creatively about what? Are opportunities in my district where we can take that on because we absolutely need to have that Bigsby park.'",
        "'speaker_2': 'We is where we have people locking themselves in the bathroom so they can sleep. You know, Bixby Park is where I have children that see the affects of homelessness every single day, and it really does affect our neighborhoods.'",
        "'speaker_2': 'And so I want to be able to say shelter, right? Beds, not sidewalks. So we're all in fully support you. I can't wait to come out and take a tour of the facility and learn how maybe we have some auxiliary spaces like that in the second district.'",
        "'speaker_2': 'I know there's some work being done at the state level around funding for homeless services around transit corridors. We've got the 710, we've got blue line. We have some great spaces where we can bring some of those services.'",
        "'speaker_2': 'So I applaud again everybody and I'm very proud to be on this council tonight. Thank you. And one last thing I will say for the. I know for a fact from people in my district that I have three cannabis dispensaries in my district.'",
        "'speaker_2': 'And we've worked very closely with them to make sure they're engaging community members and having community meetings at their facilities. Cannabis store, they are going for $7 million, I think two weeks ago. One of the people that own a property in my district purchased on the West Side and they purchased a building for $7 million because it'",
        "'speaker_2': 'had a license tied to it. So it is hard to kind of get our heads around. And I trust that we are putting our best foot forward. And it doesn't matter that we kind of get starstruck, but we know that we're going to invest the time and the energy to pull this off the right way so that'",
        "'speaker_2': 'we can continue to provide services and shelter for the homeless folks that are in our community. So thank you.'",
        "'speaker_0': 'Thank you, Councilmember. Councilwoman Price.'",
        "'speaker_5': 'Thank you, Mr. Mayor. So I want to echo the comments of my colleagues, and I do just want to touch upon one of the public comments that was made about council members not being in the chambers. It's unfortunate that I understand why the comment was made, but I think especially on a night like tonight where we're talking'",
        "'speaker_5': 'about collaboration and not divisiveness, it's important to not sit in judgment of others. So I just want to explain my. The same people who are here were here when I left. So I don't know who was in the chambers.'",
        "'speaker_5': 'So I assumed that comment was towards me. But I will share that. We had a recital at my son's school, Lowell Elementary School, tonight, so I did go to his recital and was back within an hour. I was the only parent he had there tonight, so I felt it was important for me to be there in five'",
        "'speaker_5': 'years. It's the first time I've ever walked away from a council meeting to do something for my family. And I have never walked out of council chambers for a vote ever. I frankly think that's cowardly and I never do it.'",
        "'speaker_5': 'And anyone who knows me knows that I don't take those issues lightly. I will also say that we shouldn't make judgments because what is the implication there that people didn't stay? I don't know if anyone else left maybe to go use the restroom.'",
        "'speaker_5': 'I have no idea. But what's the implication there? That they don't care? Because that's not true of any member of this council. Every single member of this council cares about this issue deeply. So I don't know if they took a break to use the restroom or maybe went to have a bite to eat, I don't know.'",
        "'speaker_5': 'But I would just say, please don't judge, because we all care deeply about this issue. And I know the staff report talks about the kind of the start of this process being in July. And that is that is the data in there is accurate in regards to when we have those discussions.'",
        "'speaker_5': 'But I want to thank our Health and Human Services Director Kelly Collopy, because I know that in 2014 was the first time I started talking to her about a homeless shelter and what could be done and what the city's plans are.'",
        "'speaker_5': 'And I know that for years we've been looking at the former winter shelter site as a possible location. In fact, we spoke with Supervisor Hahn shortly after she was elected to find out whether or not there could be funds that could be allocated from the county to help support that facility being turned into a permanent shelter.'",
        "'speaker_5': 'And I want to first start by just thanking her. I know that there was a representative from her office here earlier tonight, but I sit on the Alameda Corridor Transportation Authority with her, and we have many homeless issues along the tracks.'",
        "'speaker_5': 'And Supervisor Hahn has really put her money where her mouth is when it comes to homelessness and was the first before we even got state moneys to put forth money towards the operation of a year round shelter, if I'm not mistaken.'",
        "'speaker_5': 'Is that correct? Before the state moneys came in.'",
        "'speaker_7': 'The funding is coming through Measure H.'",
        "'speaker_5': 'Matched through Measure H. So she's been just a huge, huge advocate for these issues for us on a county level. And I want to thank her for that. I also want to thank our mayor and our state legislative committee, because for their advocacy, we would not have had the state funds that we have to work with.'",
        "'speaker_5': 'And I think that's just been a huge game changer in this plan for us. And, of course, I want to thank Councilman Richardson. The outreach that he's done with his community. The engagement that he's participated in is just remarkable.'",
        "'speaker_5': 'And I'm grateful to have him as a colleague on this council for all the great work that he's done. It's not easy to propose a concept like this in your neighborhood. And even though there had been a winter shelter there, a temporary shelter there in the past, he really engaged the community in in seeing and understanding the'",
        "'speaker_5': 'need for this and the opportunities for them to be part of the solution. And I'm grateful for that. I also want to thank my council colleagues for us being at this point. I mean, this is something that we talked about even before it was in public session years ago and something that the city had really hoped for'",
        "'speaker_5': 'and all the council members were pushing for. And I am so grateful that we're at this point. I do a lot of work for those of you who know me on a personal level, some of you do and some of you don't with the homeless community, both in my work as a prosecutor, I'm very involved in our'",
        "'speaker_5': 'collaborative court process where I work very hard. Even today I did with actually with a Long Beach Police Department officer who was in the courthouse that I manage with a homeless individual, that he was trying to get into rehab.'",
        "'speaker_5': 'And I helped him from the D.A. side assist the individual so that he could clear his warrants and he could get into rehab today. And that was amazing. But above and beyond that, I do a lot of work.'",
        "'speaker_5': 'I volunteered at UCOS several times, and I can tell you the thing that I hear over and over again, obviously, housing is one of the major critical areas of need, but it's not the need for everyone. In fact, we have individuals who have families who are very supportive families who want to help them.'",
        "'speaker_5': 'But there are other issues preventing them from getting that support and getting involved in that supportive cycle that they need to get on to a different path. And so I think that having a shelter that has a low barrier to entry and addresses things, one of the things that I hear all the time when I go and'",
        "'speaker_5': 'volunteer at Uco on Sundays when I've done it and when I do homeless outreach is people don't want to go to shelters because if they're a couple, they're going to be separated. The men have to go in one area.'",
        "'speaker_5': 'Generally, I'm not saying all facilities, but that's what I hear a lot. When I'm working with the homeless community, they can't stay together as a family. Another one is pets. People not having pets, I think really, really impacts people because they don't want to be separated from their pets.'",
        "'speaker_5': 'It's really like your family and sometimes the only source of support you have. So that's our our shelter. Having a low entry is, I think, very, very important. I know that the next steps involve I mean, right now tonight's item is about the purchase of the property.'",
        "'speaker_5': 'But assuming all goes as we've planned and we hope, I hope that the next step will involve a very robust, citywide, inclusive process that allows all of us on the city council, regardless of what district we live in, to be involved in, what kind of services we offer.'",
        "'speaker_2': 'What the barriers.'",
        "'speaker_5': 'To entry are, how the transportation. Models might work for folks to get into those services. What types of opportunities supportive services are going to be going there? So my request to the city manager and to Director Collopy would be please include all of us because this is something that we all feel very, very strongly about and it's'",
        "'speaker_5': 'impacting all of our neighborhoods, every single one of us. You know, if you go to the third District, any community meeting in the third district, what they will tell you is it's impacting the third district harder than everyone else because of the coastal zones.'",
        "'speaker_5': 'I know that's not true, but every neighborhood feels that because that's their experience every day. And so we want to be part of that process so that we can bring all those different perspectives. I do think that it's very, very important for us to be supportive of the neighborhood, in the community that is accepting this citywide treasure'",
        "'speaker_5': ', asset needed service in their neighborhood and whatever that we can do whatever Councilman Richardson needs from us to make sure that any impacts are mitigated. You have my 1,000% support that if the community wants or needs anything to ensure that their quality of life is not disrupted as a result of this, that you will always have my'",
        "'speaker_5': 'backing 100% for that because they deserve it. And we're all here to support you and your community in these efforts. But I just want to thank staff. You've done an amazing job getting us to this point. Mr. Keisler, you and your team continue to do great work in every district, regardless of what the project is.'",
        "'speaker_5': 'And it amazes me because most people have like a specialty, right? They have a niche that they operate in. You're everywhere on every project and on every topic and doing a fantastic job at it. So thank you. Thanks to the team who presented tonight.'",
        "'speaker_5': 'Thanks to everyone who came out tonight. Please, if you take one thing away from tonight, everybody on this council cares deeply about this issue. Will meet with you any time of day or night to talk and listen to your ideas and hear what you think we should have as a city.'",
        "'speaker_5': 'In regards to homelessness, it's affecting all of us, and there are many, many opportunities for us to improve the situation when we work together. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_12': 'Thank you, Mr. Mayor. And I want to thank everybody for coming out this evening and sharing your public comments and to the council and to those who watch this council and have paid attention for some time. I ask we're certainly beside when we are actually talking about a homeless issue and doing something about it.'",
        "'speaker_12': 'She has she has been a conscious public commenter for four years now, week after week after week, you know, imploring this council to do something, imploring our city staff to do something. And, you know, I just I want to appreciate her because.'",
        "'speaker_12': 'But she's not here. She she has been a true advocate. I do have some questions because I think there were some good questions here. And before I go into my comments, I do want to ask staff and you've done a long, arduous process, we understand.'",
        "'speaker_12': 'You know, I understand what the process has been because I've been engaged from from the very beginning. But for the public benefit, can you. And you may have done this already, but once again, walk us through why this property is the best property or the best opportunity for a year round shelter and what, if any, opportunities, other'",
        "'speaker_12': 'opportunities were considered getting to this point.'",
        "'speaker_11': 'Councilmember. That is a great question, and we really didn't cover it earlier. But over the past few years, we, as the Economic Development Department, have been responsible for assisting the Health and Human Services Department with locating sites for winter shelters.'",
        "'speaker_11': 'In in each year, we go through a process of engaging what are called commercial brokers, real estate brokers that help us to identify sites that meet the specifications of certain size, you know, access issues and those kinds of things.'",
        "'speaker_11': 'And in over the past couple of years, we've typically identified 35 to 50 sites through that process of engaging brokers to look at properties around Long Beach and believe it or not, generally were unable to find a landlord who will engage with us for either a particular period of time to lease the property.'",
        "'speaker_11': 'And so we've really had a challenge of finding the type of location that that can provide the space and access that we need in the council action that that occurred last year. And we had mentioned before in the presentation we'd been asked to look at those sites again and to identify including former winter shelter sites in in'",
        "'speaker_11': 'the the search to identify landlords that would be willing to lease or to sell for the for the purposes of a year round shelter. And and we did that search, of course, as we do each year. And this property, which we had been in discussions with the landlord, had actually not been available to us for two years'",
        "'speaker_11': 'because they had entered into a lease agreement with a cannabis association or a cannabis business and had an active lease in place, which is why the property was worth so much. But over the course of our discussions, we were able to to make progress in terms of not just the the appraisal, but also the discussions with the'",
        "'speaker_11': 'property owner for a cooperative sale. And so this really became a unique opportunity for us. And of course, when securing the heat funding from the state, the timing was was right and ultimately this became our primary target. But I will just recap.'",
        "'speaker_11': 'We generally will look at 35 to 50 sites a year and oftentimes not get a single landlord who'd be willing to lease for the period of time or the price point or sell their site for this purpose. So happy to happy to answer any more questions about that.'",
        "'speaker_12': 'Okay. So if there is a landlord or a property owner that has, what would be the specs we're looking for 2 to 2 house.'",
        "'speaker_11': 'Yeah. Typically for the, the, the emergency shelter, we were looking for spaces that could house I believe was about 150 beds in the past couple of years. It was that was the target. So they were larger areas, usually a warehouse that had the floor space to put that number of beds, those those winter shelters in the the'",
        "'speaker_11': 'operations of the winter shelters were unique as well because there weren't individual rooms, there weren't, you know, the apartment kind of style. It was more of an open for a setting. So typically, you know, the 25,000 square feet of a warehouse space allowed for the 150 beds and some property that typically the the individuals would bring with'",
        "'speaker_11': 'them.'",
        "'speaker_12': 'So I asked you to explain that because it's not easy to find commercial real real estate in this city with that kind of space. And so thank you for for for explaining that. So. Obviously actions speak louder than words.'",
        "'speaker_12': 'And tonight, I believe this council has a unique opportunity to act. And to borrow a phrase from my colleague, the Andrews, we have an opportunity to actually walk the walk and not just talk about it. Because we have a unique funding source coming from the state and and supported by our county through Measure H.'",
        "'speaker_12': 'We have the resources to do it. I want to thank Councilmember Richardson and the District nine residents for stepping up and taking the risk and being part of the solution. I don't think it's a big risk because and I'll explain why.'",
        "'speaker_12': 'I'd also like to state that from my experience living in Long Beach for the last 25 years, the people in this great, great city are neighborly. They're compassionate and empathetic. And that has been demonstrated tonight through public comment over and over and over again for those who have come out in support of this project.'",
        "'speaker_12': 'My district, the eighth district, the great eighth district is home to the largest housing development in the city. A whole lot of affordable housing, Section eight housing, and numerous nonprofits that provide social service programs, including the Women's Shelter of Long Beach, Telecare.'",
        "'speaker_12': 'And today we're we're the current home to the winter shelter. We've sponsored it for the last two years at the Old North Library. This is an issue, I believe, of humanity. And it's everybody's responsibility to to help in the crisis of our time.'",
        "'speaker_12': 'The winter shelter in the eighth District right now, I can say, is very well run by U.S. vets. There have been no incidents. There have been no significant impacts. To report it to my office by the neighbors. It has been a peaceful, quiet, seamless, smooth operation.'",
        "'speaker_12': 'And that's why I think and I know because they've had experience with it before. Obviously, this is not new to the ninth District that this project will work in terms of the cost. Yes, it seems like a lot.'",
        "'speaker_12': 'Right. But I will just say that we can't afford not to do this at this point. This this crisis is a serious crisis. The the the the people on the street need help. And it's our duty to humanity, I believe, as city council members, but also as a society.'",
        "'speaker_12': 'Everybody in here has as a responsibility to provide shelter where and if we can. And I'll say this one shelter is not enough in the city. This is a large city. 125 beds is a it's going to be a drop in the bucket by the time this this the shelter comes online.'",
        "'speaker_12': 'If you look at the current trend of homelessness throughout the L.A. County. And Lauren Bolen, thank you for participating in this belief. Thank you for participating in the the homeless count that you know, everybody else who did that a couple of weeks ago.'",
        "'speaker_12': 'That's going to be an important exercise and engage for us to to to to plan resources in the future. I personally would like to see at least three homeless shelters year round in the city of Long Beach. Based on the numbers that we have today that we know and what we are projecting in the future.'",
        "'speaker_12': 'I think it's, again, inhumane for our brothers and sisters, our aunts, uncles, fellow human beings to have to sleep on railroad, ride away in a long riverbeds, in parks, alleys, along sidewalks. This is this is not something that we can sit back and say, hey, not in my backyard, because, yes, it will be on your front yard'",
        "'speaker_12': '. I heard that my neighbor about three months ago literally had somebody sleeping in their flower bed. Right. And everybody on the block was just astounded, like, what do we do? We have to do something. And so this tonight, this the city council has an opportunity to step up, to make a bold decision in the right direction.'",
        "'speaker_12': 'I'm certainly happy to lend my vote and my support for for this winter. I mean, not the winter shelter, just this year round shelter for the city of Long Beach. And and again, it's not going to be an easy process.'",
        "'speaker_12': 'I hope that we can do all we can to fast track this, get the resources to build it out and to make it habitable for for the people that that need the services. And so with that, you have my support.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Supermom.'",
        "'speaker_3': 'Thank you, Mayor Garcia.'",
        "'speaker_10': 'Thank you all for being here tonight and your civic engagement.'",
        "'speaker_3': 'Thanks to Rex Richardson for bringing the item forward. And thank you to all.'",
        "'speaker_10': 'My council colleagues.'",
        "'speaker_3': 'For supporting these issues on homelessness over the years and also like to commend Susie Price for getting us back on track here with her comments on making this collaborative and positive moving forward. For those who don't know, we started our meetings today at 3:30 p.m..'",
        "'speaker_3': 'If one of us has to take a break, you might want to know that the sound.'",
        "'speaker_10': 'From the chamber.'",
        "'speaker_3': 'Is piped into the council lounge so we never miss a comment. Also, in the interests of just keeping it positive, one of the comments mentioned the neighbors rejecting a shelter near the armory, and I'm pretty sure that reference was to what we called Schroeder Hall.'",
        "'speaker_3': 'It was ten years ago, and I was in an office in the fifth District Council. Councilwoman Mongo was not in office then. But just as a point of clarification, that was not a year round shelter and it wasn't even a shelter.'",
        "'speaker_3': 'So I guess my point is we are all we all want to work collaboratively here and want to make it positive moving forward. So I think we can avoid pointing fingers at behaviors in the past because I think we're on the right track now.'",
        "'speaker_3': 'I also want to thank. Staff, Kelly Colby, of course, and then John Keisler. He's worked so hard on this. But what you may not know, he's also simultaneously been working on the community hospital project. And you talk about a project that could really impact this issue.'",
        "'speaker_3': 'Community hospital, before it closed, had a 28 bed psych unit. And if you know the correlation between homelessness and mental health issues, when we reopen community hospital, we might be able to double that capacity. So you think of 56 beds addressing those challenged with with mental health issues.'",
        "'speaker_3': 'What a great impact that would be. So thank you again and I'll be in support.'",
        "'speaker_0': 'Thank you. Councilmember Vice Mayor Andrew.'",
        "'speaker_6': 'Yes, thank you, Mayor. First of all, I'd like to thank Rex Richardson. And as host Dad and Susie and all the rest of the individuals on the day today, I don't think individuals would really take it lightly and know that we are in a crisis when we talk about homelessness.'",
        "'speaker_6': 'But I think everyone out there, whether you agree or you disagree, you are very compassionate about the individuals out there sleeping on the streets, sleeping next to your homes, in your alleys. You must have some form of compassion.'",
        "'speaker_6': 'If you don't, then I think it's something, you know, Lauren, with you and your thoughts and your compassion. But I think tonight we're trying to show you that we are working with a dedicated we're committed to this homeless all around shelter.'",
        "'speaker_6': 'And Councilman Richardson, I think he's went above and beyond. You know, he and his district do let you know that they are there. They are all in. And I really want to thank the young students, especially in the vigil from Polly and the young lady from Milliken.'",
        "'speaker_6': 'You know, we I'm a policeman, but that's okay. But with all of that said, I just want to let you individuals, knowing the young man here says he came all the way in and says, I'm in, and that's wonderful, because I think if we don't get in, then they will be in and that's on your porch, your'",
        "'speaker_6': 'backyard, your front yard. And what can we do? We must do it. And we must do it now. Let's get involved. Don't talk about it. We're going to have to be about it. Thank you, individuals, for waiting this long to be a part of this dialog.'",
        "'speaker_6': 'Thank you again.'",
        "'speaker_0': 'Thank you, Vice Mayor. And just to conclude, I want to just touch on one other thing that was said, which I think is so important and I think needs to be reiterated and I want to expand on on it.'",
        "'speaker_0': 'This idea of the ensuring that that this shelter is a place that that there are low barriers to entry is really, really important for for a couple of reasons, I think. One is this will be the first municipal municipal shelter in the city.'",
        "'speaker_0': 'And that gives us as as a governmental body, different level of responsibility and in addition, allows us to be much more flexible in what happens on the site. And we have some really great shelter operators, by the way, which I know we haven't talked a lot about tonight.'",
        "'speaker_0': 'But I do want to thank the current operators of the shelters that are in the city, which we've had partnerships for a long time. But there's key components that are important that this shelter will allow us to do.'",
        "'speaker_0': 'One, for example, which hasn't been mentioned much tonight, is the openness for the LGBTQ community. There are many members we know that most homeless youth are LGBTQ, and we also know that this shelter won't have and is not what have some requirements other shelters might have that might make young gay or lesbian or trans community members feel'",
        "'speaker_0': 'uncomfortable. And so that's really important for the gay community to have a shelter that is completely open. And the other, which I think was mentioned by Councilman Price, is the idea of pets and to be able to actually have and allow people to come in with their with their animals who are members of their family is really'",
        "'speaker_0': ', really important as well, which we know is not always the case in all shelters. And the family issue being able to come in, if you have a partner that you're on the street with, that is really, really important.'",
        "'speaker_0': 'It's really, really important that that happens. And so I think that those those issues and this idea that this will be a shelter for everyone to me is very exciting. And again, thank you to the community and for all all of the work.'",
        "'speaker_0': 'And so with that, I'm not sure that Councilman Gonzales is still on the line or not. I don't think so. So maybe we can just go and take a vote using the the keypads.'",
        "'speaker_3': 'Oh, she absolutely cares. We need to we need to.'",
        "'speaker_4': 'Continue as a roll call vote.'",
        "'speaker_0': 'But we do need to get the roll call vote. And let's let's continue as a roll call vote. Madam Clerk.'",
        "'speaker_1': 'Councilmember Gonzalez. Councilmember Pierce. Councilwoman Price. Councilmember Supernanny. Hi. Vice Mayor Dee Andrews.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Councilman Austin. Councilmember Richardson. Motion carries.'",
        "'speaker_0': 'Thank you very much. Okay. I know it's. I know it's late, but now we're gonna go back to the regular agenda, and we have a second hearing, and then we'll just go through the agenda. So if we can please, Madam Clerk, here.'"
    ],
    "Recommendation to declare ordinance granting to Southern California Gas Company, a corporation, the right, privilege and franchise upon terms and conditions herein set forth to lay and use pipes and appurtenances for transmitting and distributing gas for the purposes as specified hereinafter under, along, across or upon certain public streets, ways, alleys and places, as the same now or may hereafter exist, within the City of Long Beach, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'The second hearing for the evening hearing number two, or I think it was hearing your number.'",
        "'speaker_1': 'One report from Energy Resources recommendation to receive supporting documentation into the record to conclude the public hearing regarding the natural gas franchise with SoCal Gas. Declare an ordinance granting a limited natural gas franchise to SoCal Gas to transmit and distribute natural gas within the city of Long Beach.'",
        "'speaker_1': 'Read the first time and lead over the next regular meeting of the City Council for Final Reading.'",
        "'speaker_0': 'I think, you know, I can have everyone in the audience. Please, we're still conducting the meeting. Just please. If we can have the conversations outside, that would be great. Thank you so much, Mr. West.'",
        "'speaker_4': 'Thank you, Mr. Mayor. The staff report will be given by Bob Dow, our director of Gas or of energy resources.'",
        "'speaker_13': 'Yes. Good evening, honorable mayor, vice mayor and Council Members. On June 12th, 2018, the City Council received supporting documentation into the record, concluded the public hearing regarding the natural gas franchise with Southern California Gas Company or SoCal Gas, and declared the first reading of the ordinance granting a limited natural gas franchise to SoCal Gas to transmit and'",
        "'speaker_13': 'distribute natural gas within the city of Long Beach. The second reading. The audience was laid over to October 9th, 2018 to allow for CPU sea approval of an additional 1% surcharge of the imputed value of transport gas volumes delivered to the SoCal utility customers under this franchise agreement.'",
        "'speaker_13': 'CPAC approval was still pending on October 9th. Therefore, the final reading of the ordinance was late over to tonight's council meeting. CPC approval for the additional 1% surcharge was approved on November six, 2018 and became effective January 1st, 2019.'",
        "'speaker_13': 'And staff has requested the adoption of a second ordinance reading this evening. This concludes my report and I'm available to answer any questions that you may have.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'I think I think that we're we can continue chatting but we've we've lost quorum so.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'So let's get so we've concluded that let's go into the public comment on this item. Or we can't continue can't.'",
        "'speaker_4': 'Continue until we.'",
        "'speaker_0': 'Have a quorum in laws. I was hoping we can interrupt. Okay, we're back. Any public comment on this item? None. Public comment. Close. Actually. Hold on a second. Any. Can I get a second on this motion, Councilman Pierce?'",
        "'speaker_0': 'Anything now, Councilman Austin. Then with that, we're going to continue to do a roll call vote.'",
        "'speaker_1': 'Councilmember Pierce Councilwoman Price, Councilmember Supernova. Hi. Vice Mayor Andrews. Councilman Austin. Councilmember Richardson.'",
        "'speaker_0': 'The emotion carries. We're going to move on to public comment. Mr. Goodhew. And then I have Carole Peterson and Christine Minnelli, and then I have two others. We'll go as we as we go. Mr. Goodhew, please.'"
    ],
    "Recommendation to request City Manager and City Attorney to report back to the City Council on the next steps and timeline for implementation of the Ethics Commission, including any enacting ordinances or budget appropriations that may be required.": [
        "'speaker_0': 'Thank you. Ms. Case. Thank you very much. That that concludes public comment. And we're going to go on to the next item, if we can. If we can, please, Madam Kirk.'",
        "'speaker_1': 'Item 21. Communication from Councilman Austin. Councilmembers Hooper. Now Vice Mayor Andrew's recommendation to request city manager and city attorney to report back on the next steps and timeline for implementation of the Ethics Commission.'",
        "'speaker_0': 'Come to Austin.'",
        "'speaker_12': 'Thank you. So on November six, 2018, Long Beach voters approved Measure C with 61.9 or 61.79% of the vote as part of a series of charter amendments. Measure created the city's Charter and Ethics Commission for the purposes of monitoring, administering and implementing governmental ethics in the city.'",
        "'speaker_12': 'While the composition of the Commission and Appointment Procedure was contained in the Charter Amendment language, the Charter section entitled Staff Assistance and Budget reads Staffing for Administrative and management functions of the Commission will be addressed in the Municipal Code.'",
        "'speaker_12': 'The Commission will have a budget as determined by the City Council sufficient to conduct the Commission's mission and business. Therefore, Council, we must take action, further action through an ordinance and budget appropriation before the Ethics Commission can convene.'",
        "'speaker_12': 'And with this motion, we would request that the city manager and city attorney report back to the City Council within 60 days with possible steps that we need to take and propose timelines so that we may carry out the will of the voters in an expeditious manner as possible.'",
        "'speaker_0': 'Councilmember a councilmember support.'",
        "'speaker_3': 'Thank you, Councilman Austin, for bringing this item forward. I think he said it all and I stand in support.'",
        "'speaker_0': 'Thank you, Councilmember Vice Mayor Rogers.'",
        "'speaker_6': 'I also echoed that sentiment. And this is a long overdue and I hope I'm hopeful for a path to move forward. And thank you again, councilman. Most infamous.'",
        "'speaker_0': 'Thank you. And obviously, I'm very supportive of this and very supportive.'",
        "'speaker_3': 'Of.'",
        "'speaker_0': 'Councilman Austin's efforts also in ensuring that this got before the voters. Mr.. Mr. WEST. And, Mr. Modica, I know that you will be coming back to do a full presentation on on this process. Is there a update tonight about kind of what what you see as a timeline?'",
        "'speaker_0': 'And then obviously we can get the full presentation when this item comes back. I know that you've been working on this.'",
        "'speaker_4': 'Yes. This is something we've been contemplating. Would you want to kind of outline what we expect the process to be for both this and for measure, which is the redistricting? They are linked in that the measure, the people measure outlines that the appointment process is linked to the Ethics Commission.'",
        "'speaker_4': 'So we plan to have a memo come back to you that will kind of outline this. We'll talk about some of the major tasks that we see the Ethics Commission kind of first dealing with with. We also will outline the process for appointment that's prescribed in the in the initiative and the timeline for that.'",
        "'speaker_4': 'So we expect within about 30 days, hopefully even a little quicker, we will have a report back to you on those two topics.'",
        "'speaker_0': 'Let me go let me go to Councilwoman Price and then back to Councilmember Austin. Councilwoman Price.'",
        "'speaker_5': 'Just briefly, I, too, wanted to thank Councilman Austin. This committee and the need for it were really his brainchild was an effort that he initiated by bringing it to council. And I think it's a great idea. I look forward to learning what the structure, the proposed structure is going to be and talking about how we can make'",
        "'speaker_5': 'sure that we all have input into what that what that committee looks like and what kinds of things are the subject matter jurisdiction of that particular committee in terms of our work here on council. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Austin.'",
        "'speaker_12': 'So, Mr. City Attorney, just to get some clarification on my motion specifically, I'm asking for to come back not just in a memo form, but in an ordinance, too, to actually create the the the, the, the budget for for this this this in the municipal code to create a budget for the Ethics Commission, because currently that's not'",
        "'speaker_12': 'in place. And I don't think we've actually had a conversation about that from at this body.'",
        "'speaker_0': 'That's correct.'",
        "'speaker_3': 'And from from our standpoint.'",
        "'speaker_4': 'In drafting the ordinance, I think we would need the memo from the city manager's office to.'",
        "'speaker_3': 'Tell us what it is exactly they.'",
        "'speaker_4': 'Want in the budget and how we are creating that. We're happy to work with the city manager and get that to you and then for your consideration. And from that report, we can get some direction from the city council.'",
        "'speaker_4': 'That is exactly what the city manager is recommending or do you have any changes to it? And then we will draft the ordinance.'",
        "'speaker_12': 'That that that helps a lot.'",
        "'speaker_4': 'And in our report will be analyzing what is that budget, what are the current staffing that we have and whether we need any additional staffing. And we'll report that back to you.'",
        "'speaker_12': 'Thank you, sir.'",
        "'speaker_0': 'And to add to that, which I think is important, is the most. Most of these commissions and the way they work, you look at other ethics commissions, which we did, the actual a lot of the actual detail of the commission itself will actually be in the municipal code.'",
        "'speaker_0': 'And that's actually something that the council will have to develop through some kind of deliberative process. And so I think getting the information back from staff is great. And then the council will have to engage on the actual ordinance, as Councilman Austin mentioned, and what actually will then go into the code that will lay out more of'",
        "'speaker_0': 'the rules of the commission itself. And so I think. Councilman Austin.'",
        "'speaker_12': 'And for the benefit of Thompson. Mr. City Manager, can you just outline for those who are interested in the process? Because I've been approached by many people in the community who are interested in both the Citizens Redistricting Commission as well as The Advocate.'",
        "'speaker_12': 'What do you see as the timeline in terms of implementation over the next few months?'",
        "'speaker_4': 'So I don't have everything in front of me. But Measure Key, which sets up the Ethics Commission, will go first in that we need to see an Ethics Commission. There's very prescribed rules about how that is set up and the appointments that are made by the mayor and I believe by the city auditor as well.'",
        "'speaker_4': 'So then we'll outline that process and there will be a public call for, you know, how to how to make those applications that the mayor and the auditor would select from. And then the measure outlines how the rest of the remaining members are selected.'",
        "'speaker_4': 'Then in order to get the redistricting commission, you have to have the members of the Ethics Commission seated and available. And then they would go through a process to appoint, you know, the members of the the redistricting commission.'",
        "'speaker_4': 'So it's more complicated than that, but we'd be prepared to lay out all of that. So anyone interested will have a clear guide on how to do that, if they're interested.'",
        "'speaker_12': 'Great. Thank you for clarifying that and fun times ahead.'",
        "'speaker_0': 'And as a and as a Mr. Murdoch, as a clarification point, the Ethics Commission within D.D. is a screening panel. They don't make the final selections of the of the actual commission members.'",
        "'speaker_4': 'Correct. They screened and then, I believe the commission members select at.'",
        "'speaker_0': 'Random through the city clerk's office. Any other council comment on this? Any public comment on this? Please come forward. Any other public comment? Okay, then we'll just have. Please come forward. So we'll have these two and then we'll close the speakers list.'",
        "'speaker_3': 'Again, Ian Patton with the Long Beach Reform Coalition. I would just like to ask, I voted against this personally because the amendment felt it didn't have teeth, it didn't have investigative power and certain other things that I think belong in an ethics commission.'",
        "'speaker_3': 'But since you have another bite at the apple here, um, I would personally like to know from the city attorney, if you have the power to add those powers as an ordinance to the commission, give it the power to investigate, to take whistleblower tips, referrals from the council, and actually do investigations issue subpoenas if necessary, other things'",
        "'speaker_3': 'that would actually give it that sort of a real a real ability to dig into specific potential issues in the city. That's my question. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Courtesy of Long Beach Reform Coalition and people of Long Beach. I also voted against it for I mean, I think it's a it's a it's a very worthwhile commission to pursue. My concerns were the formation of the commission back in August 7th.'",
        "'speaker_3': 'I when when the vote happened by the unanimous vote by city council to turn the proposals into measures, I submitted some documents that included a discussion back and forth via email with Common Cause in Sacramento, outlining some bullet points that would have made for us the approval of the of the Ethics Commission a given, which would have'",
        "'speaker_3': 'also helped us to support the redistricting commission. Among those the the the the the items that that concern me and a lot of my fellow citizens are that the redistricting commission has some very strict guidelines as to who can be a member.'",
        "'speaker_3': 'But the Ethics Commission, who has who plays a part in the selection of those members of the redistricting commission does not. So, for example, the Ethics Commission, one can be a major campaign donor to any of you or any other public official.'",
        "'speaker_3': 'One can be a former elected or appointed official. One can be a lobbyist or have been a lobbyist. And of course, after serving on the Ethics Commission, once the term is over, one can then become an elected official or become a lobbyist or become a major donor to any one of you.'",
        "'speaker_3': 'So that part to me is is is a really critical conflict of interest that I would like to see all of you address ideally tonight. But, you know, it's late. But eventually, I would really like that to be addressed by by each of you, because that's that's a really that's been a real sticking point for our support'",
        "'speaker_3': 'of both for the Lobbyist Reform Coalition and the people of Long Beach to support wholeheartedly this commission. Thank you.'",
        "'speaker_0': 'Thank you. That concludes comment on this item. A roll call vote, please.'",
        "'speaker_1': 'Councilmember Pearce Councilwoman Price Councilmember Supernova.'",
        "'speaker_10': 'High.'",
        "'speaker_1': 'Voice Mary Andrews.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Councilman Austin. Councilmember Richardson.'"
    ],
    "Recommendation to request City Manager to direct staff to design a framework for the preparation of a Comprehensive Strategic Plan for 2030.": [
        "'speaker_0': 'Motion carries. Thank you. I want to.'",
        "'speaker_1': 'Communication from Vice Mayor Andrew's recommendation to request city manager to direct staff to design a framework for the preparation of a comprehensive strategic plan for 2030.'",
        "'speaker_0': 'Vice Mayor Andres.'",
        "'speaker_6': 'Fine. Thank you, Mayor. You know, I'm really I'm very, very excited about being, you know, be able to kind of spearhead this 20, 30, you know, strategic plan. Because I want to start out by first thinking I'm here for this leadership and vision for our city.'",
        "'speaker_6': 'You know, I started being a councilman around the same time he was, and I think most of you guys can see how far he's gone. This item comes about from a conversation in one of our meetings. Because we as a city always has to be looking forward and preparing for our future.'",
        "'speaker_6': 'And by that I would like for our management team to work on the framework of comprehensive and inclusive strategic plans that will address key areas and interest to us as a city. From housing affordability job to climate changes and education.'",
        "'speaker_6': 'I would like for us to work with the leadership across all levels and sectors so we can prepare for the future. A good city is prepared as they prepared a city. And I'm looking forward to dialog and ensure.'",
        "'speaker_6': 'Thank you very much for this. Yeah.'",
        "'speaker_0': 'Thank you. Vice Mayor Andrews, Councilman Austin.'",
        "'speaker_12': 'I support this. Obviously, we want to make sure that our city is a great city today, but also in the future and and we're planning for the challenges ahead. And so I have my you have my full support on this.'",
        "'speaker_12': 'I'm just curious to know when would this come back or adopting this tonight? Would this mean that, you know, staff just starts moving forward with the plan or what?'",
        "'speaker_4': 'TOM So the way we understand the item, you're asking us to come back with a framework. So we would come back with probably in about 90 days, doing all the research from the previous plan, outline the framework and what it will take.'",
        "'speaker_4': 'Just for context. The last time we did this, I believe we started in 1997 and it took about three years to get the plan done and it was adopted in 2000 and formally started to be implemented in 2001.'",
        "'speaker_4': 'So these are very large efforts that do require a lot of dedication, a lot of focus and financial resources as well. So we'll outline that in the framework and we'll come back to you. And then we foresee this being part of the Fy20 budget discussions and also gives us a chance to allow us to move into the'",
        "'speaker_4': 'new city hall, finish some of the most major, major projects we have and then get started on this.'",
        "'speaker_12': 'Thank you for that.'",
        "'speaker_0': 'Thank you. And I want to I just want to also add Councilman Austin and thank you very much for for leading this effort as well. I think what's something it's really important in these plans and something I want to make sure the council is aware of as well, is these these plans from a leadership level, which is'",
        "'speaker_0': 'all of us has to be very inclusive of everybody at the table. And I think what staff is going to come back with is a framework essentially to show this is what the plan process could look like and certainly not begin any of the actual work.'",
        "'speaker_0': 'And then the actual work of of we as a the body will debate that framework and then give staff direction on how to begin. But I will say that I'm hopeful that every member of this body is really engaged because the only way these major strategic plans actually work is if we all have a healthy input and'",
        "'speaker_0': 'healthy conversation about what we want, the plan, the process to look like. And I think we all have to take ownership of it because these we have not done this in Long Beach in a in a way, our last one, I think we did.'",
        "'speaker_0': 'What time was it? 20 years ago.'",
        "'speaker_4': 'It was in 2000 for a 2010 plan. So it was adopted in 2000.'",
        "'speaker_0': 'Great. So it's definitely time. And I think this is the right body to, you know, to take this on. And so thank you. Thank you for that. Councilmember Richardson.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And in general, I'm always supportive of plan the work work the plan planning, you know, putting things down on paper. So my question is, so I see that the last one was a 2010 plan started in 97, it was adopted in 2000 and lasted for ten years.'",
        "'speaker_10': 'Is the idea this is a plan from 2020 to 2030?'",
        "'speaker_0': 'Yeah, I think I think the idea is that this is a visioning. It would be a visioning document and strategic document about where we'll be as a city in 2031 by 2030. Right. And one of the things I asked staff to do when they come back with the framework is to actually also give the council as I'",
        "'speaker_0': 'need it as well a review of the 2010 of the other plan and what worked and didn't work and just skimming it. The city's done a lot of the plan and implemented much of the actual plan. And there's numerous members of the community that we all know that were involved in that strategic process.'",
        "'speaker_0': 'And so I think, Councilman, the idea but it doesn't have to be necessarily is really to vision where will we be at 2030? And we work towards that plan strategically, but also set out strategic goals.'",
        "'speaker_3': 'Okay.'",
        "'speaker_10': 'So so I would say I think that's great. Just looking at the last 1 to 3 years, this will put us at 2022 to 2030, kind of a short window. So I know the branding of 2030, but it might make sense to, you know, think 2035 or something like that.'",
        "'speaker_10': 'It gives us a solid decade, you know, to work. And then and then I'm looking forward to obviously the framework, but I'm just curious and I'm sure this information will come forward how the current long before 2030 plan that we worked on through the land use element and all of that.'",
        "'speaker_10': 'The actual general plan aligns with the strategic plan. I'm sure there's, you know, the the the cities plan outlines certain elements, certain things. And I think this could be more broad and talk about things that aren't necessarily in that plan.'",
        "'speaker_10': 'So it's certainly a great opportunity. I want to I want to follow this and I want to continue to support this.'",
        "'speaker_0': 'Great. Thank you. Any public comment on this item? Seeing nonmembers, please cast your vote.'",
        "'speaker_6': 'Also, I think there so-called.'",
        "'speaker_0': 'Oh, yeah, sorry, Vice President.'",
        "'speaker_6': 'Richardson, if we would if we could have some hindsight on this strategic plan ten years from now, I think our homeless situation could have been more, you know, taken care of.'",
        "'speaker_10': 'Very well said, vice mayor.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Thank you very much. Vice Mayor, please cast your vote to roll call.'",
        "'speaker_1': 'Councilmember Pierce, Councilwoman Price, Councilmember Supernova. Hi. Vice Mayor Andrews. Councilman Austin. Councilmember Richardson. Motion carries.'"
    ],
    "Recommendation to receive and file a report from the Long Beach Energy Resources Department on the recent spike in natural gas customer bills.": [
        "'speaker_0': 'Let me move up. I think we're going to do a timesharing on this. Where is what number is the what is it? Just the the issue on the on the Charlie Bills. Can we move that up and do that next?'",
        "'speaker_1': 'Communication from Councilwoman Price, Vice Mayor Andrews, Councilman Austin recommendation to receive and file a report from the Long Beach Energy Resource Department on the recent spike in natural gas customer bills.'",
        "'speaker_0': 'Thank you. Thank you, Councilman Price. All right. Actually, I'm trying to just read the item. Okay. Councilman Price, thank you.'",
        "'speaker_5': 'And thank you to my colleagues for signing on to this item. We have our office has received a lot of correspondence from residents regarding the recent. Increase in the bill that the residents received. And and the and I know there's going to be a presentation tonight, so I'm going to turn it over to staff for a presentation'",
        "'speaker_5': 'on this. But I'm hoping during the course of the presentation, we can talk about whether any notice was given to residents, why notice wasn't given to residents, and because one of the things that we're hearing from a lot of the residents is had they received notice, they could have maybe modified their usage in the winter months so'",
        "'speaker_5': 'that their bill wouldn't have been as high. So if we can get just kind of a background on this and what we're doing to mitigate at this point, that would be great.'",
        "'speaker_3': 'Bob Dylan, director of Energy Resources.'",
        "'speaker_0': 'Well, actually, Councilman Eggleston wants to comment before we go to the staff report on the second.'",
        "'speaker_12': 'Yes. Before the staff report, I would just ask madam, my colleague, Susan Price. I mean, look, from the looks of at them, nobody's paying attention at this point. And I think this is a this is an issue that that that the public really, really wants to know about.'",
        "'speaker_12': 'I mean, maybe somebody is paying attention at home on television, but I'd like to delay this or.'",
        "'speaker_5': 'Well, it's the time it was on the supplemental issue, on the supplemental agenda, because it's actually a very timely discussion. The rates are going to smooth out. This was just this is just a report on the recent spike.'",
        "'speaker_5': 'And it's rare for third district residents, frankly, to come to council meetings, but they are incredibly engaged. We have correspondence from residents that we've received all day today as well as comments. Okay. Yeah, so I'd prefer to go forward, but if we want to do another study session or something on it.'",
        "'speaker_5': 'But my understanding from everything that I've read is that we expect the situation to be mitigated in the future months. And this was which I just we just want an explanation of what happened. Got it. Thanks.'",
        "'speaker_3': 'Thank you for saying that to.'",
        "'speaker_0': 'Me, too. We've all been getting the emails. I'm. Yeah. Okay. Mr. Downer.'",
        "'speaker_13': 'Yes? Good evening, Honorable Mayor. Members of the Council as a staff was directed to prepare a presentation this evening to explain the high increases in residential gas bills and business businesses as well. This is normally a very complex and convoluted discussion, but for tonight we've kind of simplified it so we can kind of get the message across'",
        "'speaker_13': 'and briefly explain what what occurred to understand, first of all, the commodity portion of the gas. Where does it come from for the state of California? So this depiction here shows pipe flows and gas movements. And it's noted at the top that California continues to depend on out of state imports for 90% of its natural gas supply'",
        "'speaker_13': '. In Long Beach Pacific. We only produce 4% of the gas within the boundary as Long Beach that we consume. So we're heavily reliant on the markets outside of California. We call it east of California. And you can see the predominance of the gas tends to flow to the northeast into the Texas area.'",
        "'speaker_13': 'There are very few mechanisms to get gas out to the state of California. More specifically, we do not have a pipeline from Long Beach that runs to the border of California to receive this. Gas energy resources is 100% reliant upon the distribution and transmission system of the Southern California gas company to bring that gas to the L.A.'",
        "'speaker_13': 'metro area. And then we have four receipt points in the city of Long Beach, where we take possession of gas that we purchase and deliver to the residents and businesses within Long Beach. So there you can see there's about eight receipt points there.'",
        "'speaker_13': 'They're depicted along the border of California where SoCal Gas brings that gas in. And also on there, if you note in the red, there are four gas storage facilities that SoCal utilizes. Typically, you fill those up in the summertime when gas prices are lower and when demand is up in the winter and prices are higher, they supplement'",
        "'speaker_13': 'their system from these storage fields and also boost the supply of gas when the demand exceeds the capacity of the pipeline. You know, it's about 250 miles to the border of California. Takes a long time to get gas from there into the city.'",
        "'speaker_13': 'It's a lot easier than it is to get it there. So those storage fields serve a very, very useful purpose. What is the make up of gas in Long Beach or who consumes it? About 44% is consumed by residential use.'",
        "'speaker_13': '18% small businesses, large commercial industrial are about 23%, and our CNG usage constitutes about 15% of the gas that's consumed in the city of Long Beach. Good news for residential users is that since 1990, consumption of natural gas has basically dropped in half.'",
        "'speaker_13': 'And that's due to several reasons. There's building efficiency standards, appliance efficiency standards. So the average residential customer on a yearly basis in Long Beach uses a little over three thirds of natural gas. Back in 1990, they consumed about 600 firms of gas, and to approximate the therm is roughly 100 cubic feet of natural gas.'",
        "'speaker_13': 'It's a volumetric measurement. It comes as no surprise when you look at the utilization of gas by residents in Long Beach predominantly. Of the 313 terms that they consume. If you look far to the right of that graph, the last two months are pretty high.'",
        "'speaker_13': 'That's that's November. December. And if you go back 12 months, January, February, that's what we refer to as the winter heating season. And our residents consume about 50% of the gas that they consume on a yearly basis in those four months.'",
        "'speaker_13': 'So 50% of the gas in the average residential use is consumed in one third of the year. So that curve is pretty typical of residential use. Commercial industrial tend to be pretty flat. They use it for whatever processes they balance tends to be flat.'",
        "'speaker_13': 'Residential tends to follow this pattern. So how is the cost determine for SoCal or sorry for Long Beach residents? There's two two components of your gas bill that you're seeing at your house. There's the cost of delivering that to you.'",
        "'speaker_13': 'That's the transportation rates. But the biggest item in the item we're here discussing this evening is the cost, the actual commodity cost of the gas. So we only produce 4%. We have to purchase the gas that's here. We do that on a monthly basis from the natural gas market, that is gas produced from local producers and marketers'",
        "'speaker_13': '. And we procure that gas at the best available rates. It should be noted that by law, utilities may not mark up the price of the natural gas commodity. So if we pay $5 for gas from the markets with the hubs, that is exactly the price of gas that shows up on residents gas bills.'",
        "'speaker_13': 'So there's a process whereby suppliers and marketers get together the last five days every month they develop and post what's called the so-called city gate first of the month price that comes out in the first of every month.'",
        "'speaker_13': 'Energy Resources, Inc. Those prices into developing our cost of gas. Our cost of gas is always lower than that price of gas that constitutes about 75% of the gas in the winter months that we sell. We purchase some spot market gas as well as we have a produce gas.'",
        "'speaker_13': 'So it's always slightly below that posted price. And this price is published the first of every month, an energy resources website. They've been doing this at least for the last nine years that I can trace back to. But every month and the first of the month that is posted on our website.'",
        "'speaker_13': 'The other component I mentioned was the delivery of gas to our customers. That has not increased since to October of 2016. So our transportation rate, the cost to maintain and move that gas through our system at those four receipt points to the residents and business addresses has not changed in that time frame.'",
        "'speaker_13': 'So here's where you go to find that price of gas. You go to either utility services or the energy resources website. You click under the information tab and it's how is the cost of gas determined? And this is what's posted every month.'",
        "'speaker_13': 'You can see the February price last Friday at 3 p.m. when prices posted, we published our price of gas. Again, that is per therm. That's what customers see on their bills. The cost of gas is is done by firms.'",
        "'speaker_13': 'You can kind of see and you'll see it in the curve earlier or later that the December price is extraordinarily high compared to the to the other months. So it's been said a pitcher can makes up a thousand words.'",
        "'speaker_13': 'This product makes up 10,000 words. But briefly, what this shows is that same so-called system that I described presented earlier. And what what's happening right now, the green arrows are the receipt points. This is where Southern California gas receives the gas from out of state suppliers and moves it through its system into the L.A.'",
        "'speaker_13': 'Based or L.A. metro area. And that's where Long Beach resides. There are numerous reasons you'll see red X's and partial red x's. There are a number of constraints and maintenance items that SoCal Gas is undertaking. Those items have reduced the capacity that's coming into the L.A. basin at this present time.'",
        "'speaker_3': 'And the.'",
        "'speaker_13': 'Limitations. I think most folks here are familiar with the Aliso Canyon storage incident that occurred in 2015. They had a leak at one of their largest gas storage fields. After that, there was investigations and restrictions placed on the uses of those.'",
        "'speaker_13': 'So those have greatly hampered SoCal gases ability to meet the winter demand in the L.A. Basin. If you look, the real story is in the lower left hand corner in those red letters. In last year, for instance, they could take in 3.2 Bcf of gas at those green arrows and deliver that to the the greater metro area'",
        "'speaker_13': '. And they had 1.6 Bcf of storage withdrawal capability on a good winter day and not in excess of what a day. They take out 3.5 to 3.7 Bcf to meet a daily demand. So they had some cushion in September of 17.'",
        "'speaker_13': 'But if you look at today, that is 3.7. So as a commodity, markets grow when there's more demand than there is, supply prices go up. And that's the situation we're facing today. Just as a kind of a point of reference that they could deliver at that risk point was 3.2 and now it's 2.6.'",
        "'speaker_13': 'That's about a point six Bcf. That's billion cubic feet differential. That's 17 times the usage of the city of Long Beach. So that is a significant reduction that they have brought into their system. Or no longer have there.'",
        "'speaker_13': 'So we were up against and they are up against some significant hurdles to meet the demand of the L.A. base that. So what did this look like on a monthly basis? The first year you can look back and see in winter of last year, in November, we were at $3.61 a deck a therm or it showed on'",
        "'speaker_13': 'Thursday may be to you. And in December, it peaked at $6.38. So it was a modest peak. That's a historical graph that goes back to 2015, but certainly some of the implications of the storage limitations were shown then.'",
        "'speaker_13': 'Then this summer we had a very big heat wave in August and in fact on July 23rd, that price on a daily basis that you see reached now went up to $32. It will be off that chart for a daily spot price.'",
        "'speaker_13': 'So the electric consumer is the Uggs that produce our power. We're paying some astronomical prices for their gas to generate electricity. So here we are in November. Our gas is at $5.82 a therm. The forward looking curve showed it going up modestly to about the 6 to $8 range.'",
        "'speaker_13': 'No more than that. What actually occurred is when they posted the price on December 1st, that price went up to $13.85. So that is a significant increase that was not foreseen. And that's with the market supply, some of it going east back to the East Coast.'",
        "'speaker_13': 'There was a limited amount of gas and with the constraints on the so-called gas system to get that to Long Beach, this was the price that not only Long Beach but anybody purchasing gas at their local, the city of Vernon, any municipal and others that are transporting their gas are paying that same price.'",
        "'speaker_13': 'So it was a significant hit. So we looked at what would that mean to the average Long Beach resident? The average Long Beach resident customer consumes 44/3 of gas. That was in the month of December in 2017. So we plugged in and asked guesstimate what what is the impact with the higher price?'",
        "'speaker_13': 'It was about a $34 impact to those residents. Certainly, if you are a high or significant higher than the average residential user, your bill would predict to be larger than those seen by the average customers. So we saw this.'",
        "'speaker_13': 'It was a it was an increase, but certainly it wasn't an alarming increase. Nothing like what was observed back in 2001 when this number went up into the hundreds of dollars. Shortly thereafter, we put a fact sheet on the front page of our website that discussed the impacts of this winter pricing anomaly.'",
        "'speaker_13': 'We utilized social media. We have a Facebook page. With the press telegram that put this out. Now, mind you, the press telegram article went out January 4th, but many people had not seen their December gas bills. During that time, we briefed our call center representatives with the appropriate information.'",
        "'speaker_13': 'Certainly we anticipated those calling in where financial burdens and we brief them on how to respond and address those concerns. As I said, this is not just a city of Long Beach issue. This issue impacted the electric companies significantly.'",
        "'speaker_13': 'Other cities and municipalities were impacted that are buying their gas. And on January 11th, the California Energy Commission, a California Public Utilities Commission, held a workshop where they brought in Southern California gas companies to discuss this. And it was important to note that clearly these volatile and unprecedented things are under discussion.'",
        "'speaker_13': 'They want to understand what is going on with the so called system for this to occur. So it is being looked at at a higher level, at a state level. We just happen to be a customer of Southern California gas that was impacted.'",
        "'speaker_13': 'So there is some good news. January prices posted and came in a drop 40%. And then last Friday, they dropped another 40% down to almost normal levels. But we did go through the one time December peak because of similar conditions nationwide and those constraints on the so-called system.'",
        "'speaker_13': 'So we have offered assistance for any customers or residents that this has impacted. There are numerous options that we have. I'd like to know briefly, though, we've got a tally. Everyone says they've had a number, but it's about 1% or we estimate of 154.'",
        "'speaker_13': 'But any I can assure you, every customer was impacted. And that's the concern of us, is that. Yes, just because they don't call doesn't mean they didn't see. Hi. Hi, Bill. We have enrolled several customers into a payment arrangement, plans where they spread that one time monthly cost over whatever number of months they want.'",
        "'speaker_13': 'But one of the lessons learned is that we really are encouraging customers if this is going to be the norm going forward, until such time as no cap can remedy these restrictions on their system to participate in what we call our level pay plan and basically take 12 months worth of your gas bill and it's levelized and'",
        "'speaker_13': 'you pay a flat fee for 12 months. At the end of those 12 months, you'll true that up. And if if we over collected, you'll receive a credit. If there's a small balance, do they pay that small balance?'",
        "'speaker_13': 'This is a way to alleviate those winter. Well, we show that with 40% or 50% that was used in those four months, you spread it out over 12 consecutive months. Certainly there are some lessons learned here. And so in preparing for the 2019 season, we are going to continue to form our customers in advance whenever we can'",
        "'speaker_13': 'of any price spikes utilizing bill messaging, website and social media. One thing we also determined is that we can utilize LBE link that's there is a notification checkbox there that you check from Energy Resources. We will utilize that to put messaging out to our residents on that.'",
        "'speaker_13': 'And certainly a communications campaign for the 2019 winter season is well earned here. Everybody hears the messages from SoCal Gas on the radio on a TV. Better job when you hear that. For Socalgas customers, we essentially are a so-called gas.'",
        "'speaker_13': 'So what they're telling their customers to do, we need to in turn have our customers do, such as setting your thermostat lower, conserve where you can and and to sign up for the level pay plan. So on a customer's bills, there are tools to look at advances.'",
        "'speaker_13': 'We just need to do a better job of educating our residents on how to utilize that. And that far left where you see that first arrow, that is the historical usage of that customer for the last 12 months.'",
        "'speaker_13': 'So at any time you can go back, if we were in December this year, they could go back and look at their December usage if it was saved. I don't know what that number is under 44th terms or 33 thumbs.'",
        "'speaker_13': 'You would basically go over to the second arrow up in the upper right and just put in the new cost of gas that's posted on our website. You could look and estimate what your December bill would look like then knowing that the cost of gas.'",
        "'speaker_13': 'But this is something that I think a very small percentage of our residents know of and that we've communicated and how to make it effectively work for them. So clearly, we need to do a better job of messaging this information and in how to utilize that bill.'",
        "'speaker_13': 'Additionally, most of the meters at Long Beach, if not all our army, we take a read every 4 hours for a mile per second of data, so we actively know the consumption of our residents on a daily basis.'",
        "'speaker_13': 'We're exploring with our vendor who supplied us the software here of a means to take that data. And if we have information from our customers, I want to know when I'm at 50% of what my last year's bill was, can you alert me?'",
        "'speaker_13': 'And yes, we can certainly do that. We believe we could have the technology to do that. How we were going to put it on our Web page remains to be seen. But we we believe the technology is there and that we can alert our customers to this.'",
        "'speaker_13': 'And it's certainly a step that we're going to take to do that. So that concludes my presentation and I'm available for any questions.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Mr. Dow Johnson for Supernova.'",
        "'speaker_5': 'Actually, can I just ask. Absolutely. Thank you very much for that presentation. Excellent. And it answered a lot of questions for me. So if I'm if I'm understanding the presentation correctly, once we learned of the spike in in rates or in what we thought the customers would see if they weren't going to the energy resources website and'",
        "'speaker_5': 'checking the rates, we did put out some social media information. We did update the web page. So we did try to get some information out to the best of our ability at that time.'",
        "'speaker_13': 'Yes, that's correct. However, it would not have even been soon enough for customers to avoid what would occurred here, because you need to start this in September and educating them how to do it. Any messaging we would have gotten out through any EPA, even if I don't know how many people read local press or listen to our'",
        "'speaker_13': 'go to our social media page would probably not have been sufficient enough time unless they actually observed it. How we and we're going to utilize our Office of Innovation to help us. How do we message customers more timely?'",
        "'speaker_13': 'What's the best means to reach them? We do. Not everybody has access to a computer that has an email address. We have to figure out what is the best means in a more timely fashion to get this information.'",
        "'speaker_13': 'We can start earlier and hopefully that will be enough. But how do we get this message across? Yes, we can utilize the L.B. link or link L.B. and things of that nature, but it is a difficult task to try to reach out to 154,000 customers in one month and convey to them that your gas price went up'",
        "'speaker_13': 'this month. Now, mind you, that that figure that was shown there was for customers whose bill cycle started on the first day of the month and in and on the last day we have 22 billing cycles of our customers.'",
        "'speaker_13': 'Some started November 15th and went through December 15th. So half of their bill would have been the November prices and the other half would have been December and then the next month they would have had the second half.'",
        "'speaker_13': 'So it is a convoluted task to try to tie it all together, but that doesn't mean we can't do a better job of starting a program earlier. And if this volatility even has the remote chance of occurring next year, i we're going to do everything we can to start earlier.'",
        "'speaker_5': 'I. I love the advanced planning and planning for the 2019 winter season. In my personal opinion as a consumer, I think the best way to get the message out to all residents is to do an insert in the bill on the front of the bill.'",
        "'speaker_5': 'So a lot of times the inserts are behind the bill, but I think if there is a way to do it so that the insert is at the front of the bill, they have to look at the insert before they look at their bill because even the print that's on the bill, I'll be honest with you, I'",
        "'speaker_5': 'receive that bill every month. I've never read the special message that you have in the bottom. I just saw right now that you have something on there about tree recycling. Never knew that was on there. And so either we need to do a better job of telling people to look for the special message on their bill and'",
        "'speaker_5': 'that fine print or maybe put like a one page, you know, very simple, you know, program about this level pay program and why you recommend it. I think that would be really great. That's just my $0.02. And I think if you were willing we I know a lot of our offices do newsletters.'",
        "'speaker_5': 'If you were willing to write it, write a short article about this and how residents can participate in this level level pay program. I think all of us would probably those of us who wanted to would include it in our newsletters.'",
        "'speaker_5': 'And that would be a really great way to do outreach. I think doing it in the print media is very helpful, but I think for the East Side, at least if you don't do the grunion, you're going to miss, you know, a lot of people because many people will just read the grunion since it's so readily accessible'",
        "'speaker_5': 'for everyone and it's free, a lot of restaurants and businesses. So I think just thinking about how to get the word out best, it was a big hit. Unfortunately, my bill was not $34, which much higher because I live with two boys who do not understand the concept of turning out lights and not turning the heater on'",
        "'speaker_5': 'and all those things. And they are continuing to cost me a lot of money. And that was true for December. So I think a lot of residents found themselves in the same situation as me. But it is helpful to know that even if we would have gotten information out in December, there's nothing that they could have done'",
        "'speaker_5': 'to reduce their bills because the rate was already in place and they wouldn't have been able to adjust their own usage for that month and time to have a difference. So thank you very much for doing this presentation for us.'",
        "'speaker_5': 'It's very timely and I'm grateful for your expertize because I learned a lot tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Supernova.'",
        "'speaker_3': 'Thank you. Appreciate the presentation. And I have no doubt moving forward that this is. Going to be resolved.'",
        "'speaker_10': 'And you're going to Tracy involved in coming up.'",
        "'speaker_3': 'With a communication system. I just wanted to give you guys some credit for what you did do. Our office was aware of this issue, but we hadn't heard from a constituent. Our newsletter goes out every Friday at 1:30 p.m..'",
        "'speaker_3': 'After we distributed the newsletter on Friday the 25th, we got our an email. One email. That's all we ever received on this issue. A week after that, we got a phone call and another email, but it was just reacting to the person.'",
        "'speaker_10': 'Who had originally emailed us because he posted it on social media.'",
        "'speaker_3': 'So. That Friday, I left a phone message on Bob Dole's office phone and said, hey, we need to talk about this next week.'",
        "'speaker_10': 'Thinking he would get it on Monday.'",
        "'speaker_3': 'He called me on Sunday and basically gave me this whole presentation.'",
        "'speaker_10': 'That we just saw here.'",
        "'speaker_3': 'Tonight. We already had a committee meeting scheduled for that Wednesday, and he got Tony Foster to show up at our committee meeting. And this is just days notice and went through this whole presentation at our committee meeting. Then last Friday, we went and published with.'",
        "'speaker_10': 'Your letter from your.'",
        "'speaker_3': 'Website and whatnot. That just showed me how nimble.'",
        "'speaker_10': 'Your management.'",
        "'speaker_3': 'Team is. So moving forward, I have no doubt that we can.'",
        "'speaker_10': 'Get the information out there. So thank.'",
        "'speaker_3': 'You. And not all of us get paper bills in the mail, but I think the council.'",
        "'speaker_10': 'Offices can really assist with this because.'",
        "'speaker_3': 'We all push the information out there. So whatever you hand off to us will.'",
        "'speaker_10': 'Make sure it gets in our constituents hands. Thanks again.'",
        "'speaker_0': 'Thank you, Vice Mayor.'",
        "'speaker_6': 'Yes, thank you, Mayor. First of all, I want to thank Councilwoman Susan Price for bringing this forward. And also, I would like to thank Bob Dole and his team for being very responsive to my office and my residents when they ask about these price increase.'",
        "'speaker_6': 'So thank you for your informative memo that was released on Friday. Thank you very much to.'",
        "'speaker_0': 'Councilman Alston.'",
        "'speaker_12': 'So I'm glad we went through with this item tonight. I want to thank thanks, Susie, four for four for bringing it forward. And thank you, Mr. Dowd, for the very, very informative presentation. We've already have some ideas on and groups that we'd like to to engage in the district, but particularly our seniors who I think will get'",
        "'speaker_12': 'a lot out of out of this presentation because they've had a lot of questions. So thank you very much.'",
        "'speaker_0': 'And let me just add also so something we may want to consider because this was a lot of people are we have been shocked about this and kind of been, you know, stopped me on the street and people have been posting things on social media and so forth.'",
        "'speaker_0': 'I still think there's value in telling people what happened even after the fact. And I know that, you know, things are going to go back to normal, but a lot of people are just wondering what happened. And so I would encourage us to send something in the bill now that says you experience an increase.'",
        "'speaker_0': 'You know, during these months, here's why you experienced it. And and here is how, you know, so that they know that it wasn't because people don't know. They just think that we up their bill. I mean, you know, everyone I talked to just thinks that the city just basically decided to increase their their utility bill.'",
        "'speaker_0': 'And so regardless of that great presentation, that is that's what people think. So I think that doing a mailer and putting it on social media and doing all those other things, saying, here's what happened, here's why it happened.'",
        "'speaker_0': 'And well, we don't expect this to be a regular occurrence. It can happen in the future. And here's a way to prevent. I just think that would be helpful if that's something we should at least look at doing, because most people are, like Al said, are not watching right now.'",
        "'speaker_0': 'But it's the best way of getting to people is through that bill and then through our newsletters I think would be also helpful. Is are the recall public comment on this already. I think I did right. Yeah. And seeing no public comment on this roll call the.'"
    ],
    "Recommendation to adopt resolution approving an exception to the 180-day waiting period for Public Agencies pursuant to Government Code 7522.56 and 21224 to hire David J. Ternullo for a limited duration to work in the City Prosecutor Department.  (Citywide)": [
        "'speaker_1': 'Councilmember Pearce. Councilwoman Price. Councilmember Supernova. Right. Vice Mayor Andrews. Councilman Austin. Councilmember Richardson. Motion carries.'",
        "'speaker_0': 'Thank you. And then we have one more item, which I think is 25.'",
        "'speaker_3': 'Or.'",
        "'speaker_0': 'Whatever the next one is. Madam Clerk.'",
        "'speaker_1': 'This report from Human Resources recommendation to adopt a resolution approving an exception to the 180 day waiting period for public agencies to hire David J. To New for a limited duration to work in the city prosecutor department citywide.'",
        "'speaker_0': 'Any public comment on this item? See? None. Let's go to cast for our roll call votes.'",
        "'speaker_1': 'Councilmember Pearce. Councilwoman Price. Councilmember. Supernova Vice Mayor Andrews. Councilman Austin. Councilmember Richardson. Motion carries.'",
        "'speaker_0': 'Okay. Motion carries. I think that concludes the agenda items. Let's go ahead and go to announcements. The second public comment period, if there's any first seeing none. Vice managers.'"
    ]
}