{
    "Recommendation to approve renaming the Long Beach Fire Department Regional Training Center located at 2249 Argonne Avenue, the Captain David Rosa Regional Training Center.\"": [
        "'speaker_0': 'Appreciate that. Item 14, please. We're moving up on the agenda.'",
        "'speaker_1': 'Report from Fire. Recommendation to refer to the Housing and Neighborhoods Committee to consider the renaming of the Long Beach Fire Department Regional Training Center. The Captain. David Rosa Regional Training Center. District four.'",
        "'speaker_0': 'Thank you. Let me just say a few words about to turn this over to the chief and then also to Councilmember Super now and and Councilman Pierce and then everyone else that like that lines up on the speaker's list.'",
        "'speaker_0': 'But let me first let me just first say that I know that the family is here. Good to see you all again and look forward to saying hello. And just a minute, but I want to thank you, of course, first for for being here and for all for your strength that you continue to show every single day'",
        "'speaker_0': 'and for the way you are all honoring this amazing person, David's amazing legacy in our city and our community. So we just honor that and thank you for for being here and for for your advocacy, which I know is not always easy.'",
        "'speaker_0': 'And I want to, of course, introduce here our chief. I think this is a really great way to honor Captain Rose's amazing contributions. And I just want to thank you, Chief, for for bringing bringing this forward with with the staff.'",
        "'speaker_0': 'And I want to turn this over to you to just say a few words and give us a report on this item.'",
        "'speaker_3': 'So thank you, Mr. Mayor. And Mr. Mayor, council members. Thank you very, very much for this opportunity to address you real quickly on this, we think is a very important item. As you mentioned, Mayor, I'd like to introduce Linley Rosa, Dave's wife, who is here, Paul and Jean, his mom and dad and Dan Flemming and Gloria Fleming'",
        "'speaker_3': 'are here tonight to hear you discuss this item. And I do want to thank you for bringing this forward tonight. I know it's a little bit out of policy for the city to do something like this so relatively quickly after the tragic death of somebody that's beloved in our city.'",
        "'speaker_3': 'But I appreciate you, Mr. Mayor, and council members for picking this up and moving it forward. Obviously, June 25th was a day that will live in infamy with Long Beach fire forever, and it will certainly be a day that's etched in my heart for the rest of my life, as well as the members of our command staff'",
        "'speaker_3': 'and our firefighters, rank and file and sworn in civilian across our organization. It shook us to our core. And on the heels of that, there's been a lot of stories told about the contributions Captain Rosa made to this community, made to his community, where he lived, to his family, to his children, that he was a staunch family'",
        "'speaker_3': 'man, a good husband, an amazing father to his two sons, Alec and Sammy. And there's been a lot of stuff discussed there. And one of the things that came out during that discussion was his contributions to the Long Beach Fire Department, not only as a captain in the busiest station in our city, but most importantly, his contributions'",
        "'speaker_3': 'to our training center and as a member of the cadre of our of our training staff. And there was a lot of discussion inside the organization about how can we go about recognizing this man's contributions to our city in perpetuity, something that will live on beyond all of us.'",
        "'speaker_3': 'And and we decided that the best and most fitting tribute we could pay to this man is to rename our training center in his name, Captain David Rosa Regional Training Center, so that this day, from this day forward, every single young man and woman that joins the Long Beach Fire Department as they cross that threshold and begin'",
        "'speaker_3': 'their life of service, will hear the story of Captain Rosa and they'll understand. I'm going to read right now, you guys. I'm sorry. They'll understand that sometimes in service to our community, you have to pay the ultimate sacrifice.'",
        "'speaker_3': 'And Captain Rosa did not. He did that with his head up and with his eyes on service to this community. And I'm proud of his contribution. And I'm proud. That right now at this time, this council that I've had much respect for over my career are going to do something to remember this man's contribution.'",
        "'speaker_3': 'And I thank you. So with that, I wanted to make sure the Rosa family was here tonight. I think this is a fitting tribute. To a dedicated public servant. And I thank you very much, Mr. Mayor, for the time.'",
        "'speaker_0': 'Mr. Draghi. Thank you, Chief, for for that. And we appreciate everything you've done also in this time and your leadership shown in the department. And I think that. I think the way that the department has really stepped up to honor Katherine Rose's memory in a variety of ways is has been really great to see.'",
        "'speaker_0': 'I know. It's been great to see for for that for the family. And so thank you for for bringing this forward. And it's certainly something that will be very special for us here here in Long Beach. What I'm going to go ahead and do is I was going to a public comment first.'",
        "'speaker_0': 'Councilmember So is there any public comment on this item? Now that we know we have one here.'",
        "'speaker_3': 'Rex Pritchard, the president of Long Beach Firefighters on behalf of the men and women of Long Beach firefighters, Local 372. We want to thank the fire chief, city manager and staff and all of council. I'm bringing this forward.'",
        "'speaker_3': 'I echo everything the chief said. And the one thing I will add on to it not only will every single future Long Beach firefighter know Dave Rosa uh, Dave worked at Station ten and like the chief said, busiest house in the city, busy his house with rookies and training.'",
        "'speaker_3': 'I mean, they've. Was it training? Captain in training is something that sometimes isn't fun to do but is a must do. And so. For our current membership, our current firefighters. Every time we go to the training facility, whether it's EMS training, high rise training, operational training, it's a reminder might be in the station going up.'",
        "'speaker_3': 'We got to do this again. But when we're going to the David Rozsa Training Center, it's going to be a stark reminder. This stuff's important. So we stand in complete support of this. You guys have been amazing, Mr. West.'",
        "'speaker_3': 'And your entire team, uh, the service and the support you guys gave at the service, uh, just absolutely can't thank you enough. Um, the outpouring of support from this community in this council has been amazing. And so thank you very much.'",
        "'speaker_0': 'Thank you very much. See no other public comment on this on this item. Councilmember Superman.'",
        "'speaker_3': 'Thank you. I'd like to first thank Chief Terry and Rex Prichard for speaking today. This is a tremendous idea that I fully support. I have the great honor and privilege of having the training center in the fourth District.'",
        "'speaker_3': 'And for those of you who don't know, Station 17 is also located on that same campus as the training center, the regional training center. And for me, just on a personal note.'",
        "'speaker_0': 'My dad, Don Supra.'",
        "'speaker_3': 'Was stationed at 17 for 20 years. So to say this is incredibly meaningful to me. It's an understatement. But I'm just glad that I have the opportunity to support this. And thank you.'",
        "'speaker_2': 'Again for bringing it forward.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Pierce.'",
        "'speaker_5': 'I yes, I want to also think staff and our department for bringing this forward. Captain Rosa was somebody that the very first time I met him just. His presence was very much about his his dedication to the community and his love.'",
        "'speaker_5': 'And when we talk about training and we talk about those moments when we get to develop the next tier of firefighters, they're going to be serving in Long Beach to be able to be rooted in somebody who had values like Captain Rosa did, I think is really, really important.'",
        "'speaker_5': 'And I want to echoed the sentiments that you guys shared about what he meant to everybody. I've had the privilege of going along three different times with our firefighters to watch them train in practice. And I know how important that is.'",
        "'speaker_5': 'And I know that his legacy is going to continue to live on and we're going to be able to celebrate what makes Long Beach different. And it's going to be people like Captain Rosa. And so I want to, you know, applaud this this item and everybody that did the work on this item, this incident on the 25th'",
        "'speaker_5': 'was right across my district line. And so it very much touched my community. And it's a stark reminder of how much we need to be on our toes and how much we have each other's backs. And so to all the firefighters.'",
        "'speaker_5': 'Our hearts are with you. And we will continue to celebrate your efforts in our community. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Richardson.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Over the last few weeks, I've learned so much about Captain Rosa, and I think this is a very appropriate, very fitting way to celebrate him and his life and his example. So I would just simply want to say that I'm completely honored to cast his vote in support of this tonight and and be'",
        "'speaker_3': 'a.'",
        "'speaker_0': 'Part of this legacy. Thank you. Thank you. Vice Mayor Landrieu.'",
        "'speaker_2': 'Yes, thank you. Also, I echo all the sentiments it's just been said about Captain Rosa. But the biggest part about it, and I learned so much is because the fact that Mr. and I we realize that the center is in his district, but the station is in my district and I enjoy it so much because the fact'",
        "'speaker_2': 'that every time I say Station ten, the fire chief is going down the street, sometimes I know I could get a ticket, but I try to stay close to them because I know that this individual's on that fire station.'",
        "'speaker_2': 'So the family and all I all my condolences still go with you. And I know that this individual, he is just such a loss to our city and to the community. But God knows best. And that is just it's amazing.'",
        "'speaker_2': 'But thank you guys for doing this year. And my vote also will be overwhelming for this. Thank you so much.'",
        "'speaker_0': 'Thank you, Councilmember Ringgit.'",
        "'speaker_6': 'Thank you, Mayor and Mayor, continue. Condolences to the family. I know you're very proud of of your son and your husband, father, friend. I was a city employee for 28 years. And when we lose anybody who works for the city, it's like losing a family member.'",
        "'speaker_6': 'So we lost a family member as well. And and our sadness is with is yours as well. So we are with you in regards to your pain, feeling your pain. The chief jury demonstrated and exhibited that and how painful it is for us to have to go through this.'",
        "'speaker_6': 'But his memory will live on his efforts in Long Beach as a firefighter and captain will live on through the center. And I'm honored to be a member of this city council to cast his vote to recognize the training center as they were also training to.'",
        "'speaker_0': 'Thank you. Councilmember Austin.'",
        "'speaker_4': 'Thank you very much. And I, too, will be supporting this and overwhelmingly this this vote, this honor, I think goes transcends this this the city council, the the action, which was was horrific. Touched not only the city family, but touched people throughout the state and anybody that heard the story and and to learn about who David Rosa'",
        "'speaker_4': 'was and how he contributed and how he served this city with such was valor.'",
        "'speaker_6': 'And.'",
        "'speaker_4': 'Honor and pride. Makes me very proud to. To have some sort of small connection to. To him and his family. You know, he mentioned that the fire station was in his district. Darrell has a connection. His family, his parents actually live in a district.'",
        "'speaker_4': 'And I had an opportunity to meet them a few years ago. And his mother, Gene, beamed with pride, talking about her son and his accomplishments and how proud they were of of their son and his work as a firefighter and had an opportunity to meet him that day as well.'",
        "'speaker_4': 'And so this this this this this unfortunate incident was hit home, too, for for us all. And I'm glad that that we are honoring a true hero today, particularly on on on 911. It means a whole lot. And so to to his his his widow to his parents, you have our sincere condolences.'",
        "'speaker_4': 'But as I mentioned to you earlier.'",
        "'speaker_6': 'Your family has expanded beyond what you even.'",
        "'speaker_4': 'Know because you have the full support. I know of this not only the city council, but the entire city is with you as well. So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_1': 'Thank you. I echo a lot of the same sentiments. You know, I learned so much about the family at the service. You are of a remarkable family in so many ways, so close. And who he was and what kind of a leader he was is a testament to the parenting that he received and the love that he'",
        "'speaker_1': 'had and his wife and his boys. And I learned a lot. And I was so inspired. I was I went home and just couldn't wait to talk to my own family about everything that I had learned. Especially I was particularly moved by the words of your pastor.'",
        "'speaker_1': 'It was very meaningful for me in my own life in taking away some of the things that he said in terms of what kind of life I want to live. And that was a lesson to all of us, I think, to the chief and the command staff to have this happen and to shepherd your employees through this'",
        "'speaker_1': 'process that was devastating and emotional and traumatic for them in so many ways. Must have. For you because you yourself were going through a loss, but you did it beautifully, at least to the outside world. And I'm sure that there were probably some internal tears.'",
        "'speaker_1': 'But to the outside world you maintained a strong force with very little disruption and the quality of service that we expect as residents and as policymakers. And to that you should for that, you should be very proud. I think this you know, any time we dedicate, whether it's it's a building or a facility or a space in'",
        "'speaker_1': 'the name of someone that we've lost, you know, I always come back to. It's it's not about that location. It's not about the the place that we're naming after the person or in dedicating the place to. It's about the spirit of what that dedication means to me.'",
        "'speaker_1': 'Our first responders are subject to so much criticism and it's such a thankless job on so many levels. But our first responders are the ones that are called at a time of need. They're called when people feel scared and don't have the strength.'",
        "'speaker_1': 'They're called when people don't know what to do. They're called when people are in their most vulnerable and desperate place. And our first responders take risks every single day. And for that, they should be rewarded not just in words, but in everything that we do as a city to place value on what they do.'",
        "'speaker_1': 'This is an example of a first responder whose job was to protect. And to serve. And I agree with Councilman Austin. It's it's very fitting that we're doing this item today on a day when we're celebrating the freedoms and the values and the fight for justice for our nation.'",
        "'speaker_1': 'Because I think Captain Rosa embodied all of that in everything that he did. And I learned so much about him through the service. And again, the service was just a reminder to me and to our community of how much better we can all be individually and collectively.'",
        "'speaker_1': 'So I thank you. You know, I say I was a homicide prosecutor for many years, and I would always tell the victims families, I meet the most amazing people under the worst circumstances. And I really felt that way.'",
        "'speaker_1': 'On the day of his service, because it wasn't so much meeting the most amazing people, although I did do that, but I learned some of the most powerful messages, life messages on that day under the worst circumstances. So I thank you and your family for allowing us to be part of the journey with you.'",
        "'speaker_1': 'And it's a complete honor to do this and more in his honor. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Mongo.'",
        "'speaker_5': 'I just want to thank the family for being here and sharing their their husband, father, son.'",
        "'speaker_7': 'With us in our city for so.'",
        "'speaker_5': 'Many years. And I'm very supportive of this item. And I would also be supportive of a truncated timeline for it to come back to council. I know that's at the discretion.'",
        "'speaker_7': 'Of the committee.'",
        "'speaker_5': 'But I think in this case it would be appropriate to not wait the full year, but to have this in place sooner rather than later. So thank you.'",
        "'speaker_0': 'Thank you. With that, we do have a motion on the floor as presented by by staff in the fire department. So, members, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Thank you very much. Vice Mayor, I know we have a consent and we have two hearings.'",
        "'speaker_2': 'Yes. Thank you. We have a motion on the consent. Is there any public comment on this? Yes. During public comment on the consent calendar. If no members, please cast your vote.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt resolution continuing the Belmont Shore Parking and Business Improvement Area assessment levy for the period of October 1, 2018 through September 30, 2019; and, authorize City Manager, or designee, to extend the agreement with the Belmont Shore Business Association for a one-year term.  (District 3)": [
        "'speaker_2': 'Now we're going to move to the first gear. And it's been moved. It's been poor. So we're going to move to the second Hui.'",
        "'speaker_1': 'Hearing Item number two Report from Economic Development Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution continuing the Belmont Shore Parking and Business Improvement Area Assessment Levy for the period of October one, 2018 through September 30, 2019, and authorize City Manager to extend the agreement for one year term District three'",
        "'speaker_0': '. Thank you. I think we have a staff report.'",
        "'speaker_6': 'Yes, Mr. Mayor, members of the council.'",
        "'speaker_3': 'We have a staff report by Eric Romero, our project manager in the Economic Development Department. Honorable Mayor and members of the City Council. This item is the annual approval of the Belmont Shore Parking and Business Improvement Area Annual Ongoing Assessment.'",
        "'speaker_3': 'On August 21st, 2018, the City Council approved the resolution granting approval of the annual report and set today's date for the public hearing. The recommended action of this item continues the assessment for another year. There are no proposed changes to the basis of assessment nor significant changes in proposed activity.'",
        "'speaker_3': 'Therefore, staff request that the City Council receive the supporting documentation into the record, approve the resolution, continue the levy of the assessment, and authorize the city manager to extend the agreement for one additional year. That concludes my report.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_1': 'Thank you, Eric. I want to thank you and your team for the excellent support you provide to the Belmont Shore Business Association bid. They continue to perform very well. Most of the vacancies on the street have been filled with very exciting new businesses coming in.'",
        "'speaker_1': 'The business corridor is adapting well to consumer trends in terms of the types of businesses that are coming in. And it's just a pleasure, very much a pleasure to represent that area and to see it continue to thrive and grow.'",
        "'speaker_1': 'And much of that has to do with city staff that help support the efforts of the organization led by Deedee Rossi as the executive director. So thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin. Any public comment on this item? Seeing nonmembers, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you very much. We're going to our next hearing. And before we do that, I didn't get a chance earlier. I want to thank we have a public policy classroom, Cal State, Long Beach. It's here. And Masters and public policy class.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and grant an Entertainment Permit with conditions on the application of Mel Hospitality LLC, dba Ashleys, \n1731 East 4th Street, for Entertainment Without Dancing.  (District 2)": [
        "'speaker_0': 'Dr. Allison Diggins class over there. How are you doing? She's a great instructor and thank you to the class for being here from class at Long Beach. So thank you guys also. Next up is our is our next hearing if we can please have that read.'",
        "'speaker_0': 'And I'm Kirk.'",
        "'speaker_1': 'Report from financial management recommendation to receive supporting documentation into the record, conclude the hearing and grant an entertainment permit with conditions on the application of Ashley's located at 1731 East Fourth Street for Entertainment Without Dancing District two.'",
        "'speaker_0': 'Mr. MODICA.'",
        "'speaker_6': 'Yes. I believe an oath is required for this one.'",
        "'speaker_1': 'We're witnesses providing testimony. Please stand. Do you and each of you solemnly state that you will, that the testimony you may give in the course now and pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_5': 'So help you God.'",
        "'speaker_6': 'Thank you, Mr. Mayor. Members of the Council. We will have a staff report by Sandie Singh Palmer.'",
        "'speaker_3': 'Our purchasing and business services manager.'",
        "'speaker_1': 'Good evening, honorable mayor and members of the city council. Tonight you have before you an application for entertainment without dancing formal hospitality LLC doing business as Ashley's. Located at 1731 East Fourth Street, operating as a restaurant with alcohol in Council District two.'",
        "'speaker_1': 'All of the necessary departments have reviewed the application and have provided their recommended conditions as contained in the hearing packet. I, as well as the police department, stand ready to answer any questions Council may have. And that concludes staff's report.'",
        "'speaker_0': 'Thank you. The transfer of the council appears.'",
        "'speaker_5': 'Yes. Thank you very much. I want to thank staff for your work with the applicants. And I want to give a little bit of context because I know I've had some dialog with some of the constituents in the area.'",
        "'speaker_5': 'As many of you guys know, Fore Street and Between Cherry and Alamitos is one of the key areas that we are trying to make sure we have monthly cleanups, that we have our businesses meeting. And I just want to say that the owners of this establishment have done a fantastic job about opening up.'",
        "'speaker_5': 'And we've had not just community meetings there, we've had public safety meetings where we've had our commanders come down not only work with the community members, but work with the business owner and making sure that we do our crime prevention through environmental design with them.'",
        "'speaker_5': 'And so I wanted to invite the applicant up just to give a little bit of context to the history of of Ashley's and ask them to speak. And then I'd ask for my council colleagues full support on this.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Hello, Mr. Mayor and Council. Thank you for taking this time to review. We took over. Ashley's back in February now. And what is. What a journey it's been? Being down in that area is much different than the other businesses that we have and being coming from.'",
        "'speaker_3': 'Broadway and Councilwoman Susie Price's district and opening of the attic and cleaning up that area then going to saloon and fourth and cherry over there and trying to clean up what was over there. And now being a little bit further down, we've we've noticed the amount of work that's ahead of us.'",
        "'speaker_3': 'What we plan to do here. We're obviously restaurant people. We're not bar style people. But what the place is now is is a bar. And we plan to take take what's there now and make turn it into a restaurant for the future.'",
        "'speaker_3': 'And what we're asking for is to continue operating the way it is now and give us that time to make sure that we we do the right things there with what's what's there now that can only support so much.'",
        "'speaker_3': 'And so what we're asking for is give us the time. Let us put the right, right business in there to help clean up the area and to connect it all together. If you guys have any questions, I'll be more.'",
        "'speaker_2': 'Than happy to ask.'",
        "'speaker_0': 'Great. Thank you very much. Is there any other public comment on this hearing item? Please come forward.'",
        "'speaker_7': 'Hello. This is out of my arena. So sorry for my quavering voice. I own a property across the street.'",
        "'speaker_5': 'From the restaurant.'",
        "'speaker_7': 'And it's allowed. It's allowed bar before they bought it and they've had a dance competition that was loud. Uh, the people that I live, I purchased in across the street at 1738 East Fourth Street, the apartments in the front turn over quite a lot already because of the noise.'",
        "'speaker_7': 'Parking is incredibly hard at night and and tenants cannot just easily park in front. So having something that's creating more congestion at night will be hard. The parameters have not been made clear to the people that live in our building.'",
        "'speaker_7': 'We've gotten a notice from the police department and we've called in thinking that was enough to to create a stir that we don't want this. But now we have a poster that was dated May 23rd, 2013, that was on the public hearing paper.'",
        "'speaker_7': 'So people were throwing it away, thinking it was mailed egregiously. I was told we couldn't get this on a later date, that this was good enough because buried in the in the text is the real time for this meeting tonight.'",
        "'speaker_7': 'And people couldn't take time off of work. I did. I getting a I had a run around just trying to get somebody to tell me what are the parameters? Well, how is this going to go if we do have Senate Bill 905 pass?'",
        "'speaker_7': 'Are we having live music till 4 a.m.? I mean, I just think we really need to think about this a little harder before we go. Yahoo! They've got some nice businesses. I wish they would do something a little more like what he's got in the attic.'",
        "'speaker_7': 'And salud. Across the street from my building. But I guess we just because we are on the other side of cherry, we're going to go loud and crazy. It's a beautiful 1923 building that we've got and we've put a lot of money into it to make it nice.'",
        "'speaker_7': 'We we sweep the trash, you know, twice a week and we've redone the the the outside plants and it's newly painted. And now we're going to get a bar that's open till 2 a.m. with live music. I don't think that's really going to be adding to my property value.'",
        "'speaker_7': 'I really wish you would reconsider and really have some parameters. They're very clear about what it's going to mean for that. About one block. I thank you for your consideration.'",
        "'speaker_0': 'Thank you. With that, we'll go back to the council on this public hearing. Councilmember, did you have anything, Councilman Austin. Nope. Back to Councilmember Pearce.'",
        "'speaker_5': 'Great. Thank you. I do want to ask that you or my staff will follow up with you in every body that sent the letters that we haven't talked to so you can see the parameters of the night. I do want to clarify for the forum what's on the table right now is a is just for downtown, an'",
        "'speaker_5': 'entertainment district that I would not at this current time should it pass impacts where you were at. And I also want to echo that. I'm not sure if you guys have had the opportunity to work together, but definitely want you and my staff, Connor, who's sitting up there to work with Steve as well.'",
        "'speaker_5': 'I think that the vision for the property is what we need to have on Fore Street. And it's I know he came in hoping that that was going to be what he could open with and it's going to take him some time to get it to be that establishment that we want it to be, as though it's'",
        "'speaker_5': 'a commitment of partnership, I think, between the three of us and the city to make that happen. And again, I encourage my council to to pass this because we know that doing the step is the right step and that we can continue to work on noise mitigation and other issues as we have them there a little bit'",
        "'speaker_5': 'longer. Thank you.'",
        "'speaker_0': 'Thank you very much. There is a motion and a second on this item. Members, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. Thank you. Okay. We're going to we're going to go ahead and continue here. We had two hearings. We're going to go to we have a series of items. We also have some public comment. Let me also I want to make sure that just for for the for the mother with the baby as well.'",
        "'speaker_0': 'I want to get to your public comments first. So I think we have some groupings. Is Melo. Melo, Desiree. Pamela Fields and Betty Trotter. Yeah. So what if you can come first, please? In that order. Mello, Desiree, Pamela Fields and Betty Trotter.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract, and any necessary amendments, with Motorola Solutions, Inc., of Los Angeles, CA, for the purchase, delivery, and implementation of radio communications equipment, for a total purchase price not to exceed $17,700,000, which will be automatically reduced based on multi-agency purchase volumes achieved under Motorola Solutions, Inc., Territory Los Angeles Volume Subscriber Pricing Program;  Authorize City Manager, or designee, to execute a lease-purchase agreement, and related financing documents, with Motorola Solutions, Inc., of Los Angeles, CA, for the financing of the radio communications equipment, in a total principal amount not to exceed $17,500,000, and in an aggregate amount not to exceed $23,300,000 including principal, interest, and fees, payable over terms not to exceed 12 years;   Increase appropriations in the General Services Fund (IS 385) in the Technology and Innovation Department (TI) by $541,000 for implementation costs, offset by a transfer from the General Fund; and ": [
        "'speaker_1': 'Guess motion carries.'",
        "'speaker_2': 'Thank you. I am 20. Colloquially the item.'",
        "'speaker_1': 'Item 20 Report from Technology and Innovation Financial Management. Recommendation to adopt resolution authorizing the City Manager to execute a contract with Motorola. Solutions for the purchase delivery and implementation of radio communications equipment for a total purchase price not to exceed 17,000,700.'",
        "'speaker_1': 'And execute a lease purchase agreement with Motorola. Solutions for the financing of the radio, communications equipment and total principal amount not to exceed 17,000,500 citywide.'",
        "'speaker_2': 'Thank you. As you have a first and second to any public comment and follow. Now. Would you please cast your vote? Oh, staff report, please. Okay, fine. Please.'",
        "'speaker_3': 'Sir, we have a staff report. We have our technology innovation director Olivia Erickson, and the deputy director case, Lee Leah.'",
        "'speaker_5': 'Good evening, Mayor. Members of city council. Tonight before you, we have an item related to radio communications, public safety technology. And I'm turning it over to Kasim Lee, who is our Infrastructure Services Bureau manager, to do the staff report.'",
        "'speaker_3': 'Honorable Mayor and members of this city council before you to recommendation to adopt a resolution and authorize city manager to one execute a contract with Motorola Solutions Inc for purchase of radio communications equipment for total purchase price not to exceed $17,700,000 to execute a lease purchase agreement with Motorola for the financing of the radio communications equipment and'",
        "'speaker_3': 'three appropriate $541,000 to technology innovation for the implementation of the radio communications equipment. As background, the Long Beach Police Department, Fire Department, Police, Public Works, Disaster Preparedness and Airport rely on a motorola based radio dispatch, radio signal and portable mobile radio infrastructure for day to day emergency response radio communications.'",
        "'speaker_3': 'After providing more than 12 years of reliable services to the city, the currently used x t series of portable and mobile radios will no longer be supported by the manufacturer beginning December 2018. This obsolescence of the x t series radios not only affects the city, but also many of the public agencies across the region.'",
        "'speaker_3': 'In addition, the C series does not support the current interoperability standards and objectives of the city and Southern California region. City Council approval is requested for acquiring replacement Apex Series Portable and mobile radios from Motorola. The Apex Series radios support all new interoperability standards, increase interoperability within the city and with agencies across the Southern California region, and'",
        "'speaker_3': 'positions the city for reliable radio services for the next ten years. In December 2017, T.I. presented $88 million in critical technology. Infrastructure needs to City Council. City Council authorized the city manager to prepare and submit purchase transactions for City Council consideration for $67 million.'",
        "'speaker_3': 'While staff continue to research alternatives and negotiate pricing on $21 million needed for replacing public safety communication technologies, today's recommendation to enter into a contract with Motorola follows after one work to confirm the total number of portable mobile radios needed and confirm the interoperability features needed across the city and regions to confirmation that the Urban Areas Securities'",
        "'speaker_3': 'Initiative U.S. grants are now available for the purchase of these radios. And three, negotiations with Motorola on an enhanced volume pricing program that are significantly lower priced than any other known contract with similar volumes. The pricing program combines all the purchases from L.A. County government purchasers to achieve volume discounts of approximately 50 to 64% off list pricing'",
        "'speaker_3': ', depending on volume purchase commitments received by the October 19, 2018 deadline. The total purchase price not to exceed $17,700,000 is based on a 50% discount off list pricing, and the City Council letter details the pricing program at other levels of L.A. County purchase volume two commitments.'",
        "'speaker_3': 'Under the pricing program, Motorola will automatically reduce the city's invoice downwards following the October 19th deadline. Our best estimate at this time is that the total purchase price will come closer to $50 million or could be less. The city will enter into a 12 year lease purchase agreement with Motorola to finance the cost of the radios.'",
        "'speaker_3': 'Although the lease purchase agreement is technically for 12 years, is intended to be fully paid off in FY 22, with Measure eight funds as previously recommended and consistent with the current measure a plan in Fy19 proposed budget depending on the volume of the county's total purchases and final costs.'",
        "'speaker_3': 'Measure eight funds may or may not be sufficient, and additional funding sources may be needed to identify net fy22 in order to pay the lease purchase as intended. But this purchase is proposed without a competitive bid process because the city's installed radio dispatch system has features that are integrated with Motorola portable and mobile radios.'",
        "'speaker_3': 'In addition, the city's purchase of Motorola radios, along with other Los Angeles and Orange County public safety agencies, will allow for better interoperability with regional resources and could play an essential role in the city's timely response and recovery in a major disaster.'",
        "'speaker_3': 'We believe that this recommendation to purchase is the right decision for our public safety departments, and we believe that the volume pricing achieves a significantly lower price than any other known contracts with similar volumes. With that, I conclude my report and would be happy to take any questions.'",
        "'speaker_2': 'Fine, thank you. Do I have a first and second on this? Okay, fine. Thank you. Any more public opinions in more public comment? L. L. No, I'm just. Thank thank you.'",
        "'speaker_4': 'Mr. Vice Mayor. And I want to thank our staff for for such a thorough report and the great work in negotiating a what I think is a pretty, pretty impressive package, I think. And we're being smart with the taxpayer resources here.'",
        "'speaker_4': 'My my question is regarding the technology and understanding that this is a 12 year plan. Will the radios be sufficient five to 7 to 10 years from now for our public safety to be able to effectively do the work?'",
        "'speaker_4': 'I mean, iPhones change every year. And I just wanted to make sure if we're making this a significant investment up front, it's going to be be sufficient for us, you know, ten years from now.'",
        "'speaker_3': 'We believe that based on the history of the Motorola radios, that they tend to be supported for at least 10 to 12 years as our current platforms are currently have been supported for 12 years.'",
        "'speaker_4': 'And I'm seeing nods of affirmation from our fire and police chief. So thank you very much.'"
    ],
    "Recommendation to declare ordinance approving Resolution No. WD-1392, a resolution of the City of Long Beach Board of Water Commissioners establishing the rates and charges to be charged for water and sewer service and declaring the urgency thereof, and providing that this ordinance shall take effect at 12:01 am. on \nOctober 1, 2018, read and adopted as read.  \n(Ordinance No. ORD-18-0022).  (A-3)": [
        "'speaker_2': 'All right. Thank you. Would you please cast your vote? Motion carries now removed item 21 1:00 please.'",
        "'speaker_1': 'We report from financial management recommendation declare ordinance approving resolution number WD dash 1392a resolution of a Long Beach Board of Water Commissioners establishing the rates and charges to be charged for water and sewer services and declaring the urgency thereof, and providing that this ordinance shall take effect on October one, 2018.'",
        "'speaker_1': 'Read and adopted as Read 21 permit.'",
        "'speaker_0': 'I'm sorry, sir. Staff. Is there a staff reporter now? No, I don't. No. Oh, no. Okay. That's fine. There isn't. Others must in a second the public comment on this.'",
        "'speaker_4': 'Unit. Tom Stout Information on file. Wow. Didn't take long to get that race going again. It's not a new tax. Well, it sure is. But I guess the money's gone to the families, so it's always good to have the family well taken care of.'",
        "'speaker_4': 'Maybe it needs another lawsuit to see if this can be turned around. The last one lasted, what, three months? So maybe this one will be a little more in duration. You guys always talk about you're trying to help the the needy, the less fortunate, the lower income people.'",
        "'speaker_4': 'Well, this doesn't help anybody but you and the city employees. It's sad. You spent, what, $1,000,000? $1,000,000, most of that taxpayer money, a large percent of it donated by the police and fire union. It's tough to compete with you guys when you can take our taxpayer money and fight us with it.'",
        "'speaker_4': 'Maybe we need a new ordinance that would make it so. You have to provide taxpayers with the same amount of money that you piss away on these measures so that we could have a fair and level playing field.'",
        "'speaker_4': 'Maybe that's what we need to change in the city charter. So you can't keep stealing money and fighting the taxpayers with it. It's pretty pathetic on your part, but it seems to be the way this mayor and this council want to do business.'",
        "'speaker_4': 'And I'm glad to see that the no button actually does work. I was going to ask you to get Carolyn Barnes husband, an independent contractor electrician, to come down and check the button. It seems to work very intermittently on the no side of this anyway.'",
        "'speaker_4': 'So like I said, it's sad that this is going to happen. You guys lied. You lied on all those brochures, and you got away with it so far. So I guess lions. A way of life and politics.'",
        "'speaker_2': 'Thank you next week.'",
        "'speaker_8': 'Carolyn Byrnes I am guilty as charged. The wife of the electrician. I have to correct one thing that Tom said. He was unfortunately, at the district budget meeting the evening of the water hearing. So he missed the announcement by Diana Liggins that there will be another lawsuit against the water department.'",
        "'speaker_8': 'Personally. I'm against these lawsuits. There's only one person, two people who make money on those lawsuits, Trisha Pesci and Eric Benet. Eric Benet is running a mill. Shame on him. City after city after city. We are not first, we will not be last.'",
        "'speaker_8': 'We're five years behind the rest of them in being sued for these amendment violations of Prop 13. It's another matter. I went to this water commissioner's hearing and I saw a lot of my colleagues from the neighborhood groups there.'",
        "'speaker_8': 'And we spoke and then we found out from Michael Anthony, the city attorney. That in order to block. Them. From having you vote to approve the water increase that 50% plus one of the customers needed to be protesting either by mail or email, by telephone or by public presence.'",
        "'speaker_8': 'Well, I think the grand tally was 57 or 58 for all of those things that I just mentioned as far as protests. So didn't quite cut the mustard. And here we are ready to vote again for an increase in the water tax.'",
        "'speaker_8': 'There's a lot of things on your agenda and it ain't number 11, number 13 and number 15 that all have to do with grants for people who are in need, people who are on the cutting edge crisis of homelessness, people whose budgets they can't afford to live here.'",
        "'speaker_8': 'They need housing. They need mental health services. I am not saying we shouldn't give it to them. I'm saying that we should make it easier for them. We shouldn't keep taxing and taxing. I see that you're going to look at the cash tax and potentially support the no vote to repeal the gas tax.'",
        "'speaker_8': 'The average family with two vehicles. Will have received a burden of $778.39 per year as a result of what our state legislature did when they passed that gas tax. Tom and I have gotten thousands of signatures, as have others.'",
        "'speaker_8': 'But we really strongly encourage you to endorse a no vote on Proposition six. It's stealing more money out of the pockets. Thank you.'",
        "'speaker_2': 'Thank you. Thank you very much. Would you please cast your vote? Okay. Mm hmm. Michigan.'",
        "'speaker_4': 'Jo Jo Weinstein And in case my information isn't on file, the 4000 Linden and District eight. I was at that hearing, that protest hearing. And what upset me is that it was called under misleading and false pretenses. For one thing, the I don't recall the meeting actually ever being formally adjourned properly.'",
        "'speaker_4': 'Instead, the city attorney volunteered an opinion that seemed to imply that because half or more of the customers weren't up in arms, that it would automatically this this fee increase should automatically happen. The water board didn't have to do that.'",
        "'speaker_4': 'The water board could have said, you know, we had only 57 protests, but some of them made some good points and we should reconsider. And they could have done that. Instead, they dumped it on to you. And as you have been warned because.'",
        "'speaker_4': 'The possible result of this increase and the stated the stated purpose of the increase to those people who looked at the notice of hearing was that Measure M had been passed. The passage of Measure M does not require a water rate increase.'",
        "'speaker_4': 'It purports to allow it, but it did not require it. So the fact that Measure M was passed was no justification in and of itself for a water rate increase. And yet that's what I recall being. Receiving in the notice of hearing, which was so way in advance of hearing that people forgot about it, of course.'",
        "'speaker_4': 'That was the alleged justification for this increase. It's not a justification. And as you know, the courts have held that the utilities are supposed to public utilities supposed to use that money just for the purpose of solid, well-maintained, well-planned utility service, not transfers to a charity or to a general fund of a city or anything else.'",
        "'speaker_4': 'So of course, there will be a lawsuit. And as you heard, the likely winners of the lawsuit will be the lawyers. The losers will be both the city budget. And the taxpayers. Thank you.'",
        "'speaker_0': 'Thank you. That concludes item 21. Members, please go and cast your votes.'"
    ],
    "Recommendation to declare ordinance approving and adopting the official budget of the City of Long Beach for the Fiscal Year 2018-2019, creating and establishing the funds of the Municipal Government of the City of Long Beach and appropriating money to and authorizing expenditures from said funds for said fiscal year; declaring the urgency thereof, and providing that this ordinance shall take effect at 12:01 a.m. on October 1, 2018, read and adopted as read.  (Ordinance No. ORD-18-0023).  (A-17)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'At 23, please.'",
        "'speaker_1': 'Report from Financial Management Recommendation to declare ordinance approving and adopting the official budget of the City of Long Beach for the fiscal year 2018 2019. Creating and establishing the funds of the municipal government of the City of Long Beach and appropriating money to and authorizing expenditures from said funds for said fiscal year, declaring the urgency thereof and'",
        "'speaker_1': 'providing that this ordinance shall take effect on October one, 2018. Read and adopt it as read.'",
        "'speaker_0': 'Any public comment on this? Please come forward. Are you going to address on file? If you recall last week at the suggestion of a generally pretty reliable consultant, I use Homer Simpson. I had to pass it along. The suggestion that we consider putting a framework on top of the Marina Vista.'",
        "'speaker_0': 'A tennis court, put solar panels there and even suggested a long boathouse lane there would be an opportunity for that. But then Homer got back to me and said he may have been a little over optimistic, although there's still an opportunity.'",
        "'speaker_0': 'And this is what he suggested we take a look at. What's the key to solar panels? Success is generating enough electricity to offset offset the use of that electricity. Around there. There are currently there's very little use of electricity around Marina Vista Park.'",
        "'speaker_0': 'However, however, Holmer suggested taking a look at who is paying for the streetlights along there. All right. Who is paying for the little bit of electricity used in the restroom? Who is paying the city for? Who's paying the electric bill?'",
        "'speaker_0': 'Fire station 14. And the thinking is that if you add those up there, it might be well justified to put in. The solar panel on the top of that framework of the tennis court. Again, somebody's got to be paying the bill at the fire station.'",
        "'speaker_0': 'Somebody has got to be paying whatever streetlights are there. So let's add somebody that's not me, but somebody that's really good at math. Put a pencil to the figures and see how it works out in a cell. Do what hopefully will be done with the third district counsel's office.'",
        "'speaker_2': 'Get a new roof and have a new.'",
        "'speaker_0': 'Roof paid for by the solar paneling of that. Thank you. Thank you. Next item, please. You're not excited. Apologize.'",
        "'speaker_4': 'All right. Hostile once again. Information on file. Wow. $3 billion budget and it's still not enough. I mean, how much money does the family actually need? Come on, guys. I have six parcel taxes on my house, Mr. Richardson.'",
        "'speaker_4': 'I don't need a seven. And I don't need an eighth possibly coming from L.A. County on this phony water runoff tax, 2.5 cents per square foot of hard surface. What a joke. And then there's another tax that wants to come down from Sacramento.'",
        "'speaker_4': 'Yeah, that's really funny. You're laughing. You know, you guys don't pay much attention. It's pretty rude, but that's the. That's your style. So no matter how much money we get, the city has so many more sources of income than most cities.'",
        "'speaker_4': 'And in the state of California, a port, an airport, their own water, gas. It's amazing. And it's still not enough money. And any time you need more money, you raise it. We pay the highest utility user tax on our utilities.'",
        "'speaker_4': 'Doesn't seem to bother anybody up here. Nothing bothers you from the state. We you know, you're going to support a gas tax that's putting a real burden on people of lower middle. I mean, extremely low or no income.'",
        "'speaker_4': 'I mean, people living in their cars that can barely make it or having to pay outrageous prices for gas. And you think that's funny? It's not. It's really tragic. You have these motorhomes that seem barely to run. You know, they're having to pay an exorbitant price for fuel, have a place to live.'",
        "'speaker_4': 'But, you know, you just keep passing everything that like I said, it's amazing how many times you guys vote no. I'd like to know a percentage. It's got to be less than 1% of the time. And most of this doesn't benefit residents.'",
        "'speaker_4': 'The city is run by and for public employees, not us. All you want us is to pay more taxes, and you seem to do that. And also, one thing I would like to you know, I'm very sorry about, you know, Captain role in his tragic passing.'",
        "'speaker_4': 'But I also think he should say some words for the other eight or nine or ten fire personnel and residents that perished in the fires in northern California. That was a tragedy also. So I think you should pay homage to all the people that passed away.'",
        "'speaker_4': 'They were all our heroes, too. So like I say, you know, I've been trying to do this for a lot of years. I'm tired of it. You know, I started out being at 50% on the ballot measures. If I was a baseball player, I'd be making millions.'",
        "'speaker_4': 'Now I'm hitting to 50. I guess I'm down the ballot almost being cut. Like I said, there's never enough money for the family.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_8': 'I can't in good conscience recommend a vote approving this budget. I've seen the way you've spent the last year's budget. I've seen the amounts of money that go to pay for elections that we have to have conducted by the county.'",
        "'speaker_8': 'Because for some reason, the people in the city of Long Beach didn't vote enough or high enough percentage didn't vote. So now the county has to run these elections and we have to pay them to do it for us.'",
        "'speaker_8': 'We have to pay them to send out the mailers with the pros and the cons. When they get around to it. And a lot of residents didn't get them at all. We have to pay for the lawyers. To get engaged with the people who write the can arguments.'",
        "'speaker_8': 'They engage outside counsel so that the people writing these arguments. Are already behind the eight ball. They just can't even survive. They're looking at the possibility of having to pay your legal fees if they lose. So they always end up caving whether or not they're offered commissions or not.'",
        "'speaker_8': 'It's my understanding that the budget includes $250,000 for legal expenses for illegal aliens. I'm not going to debate the merits of that. What I'm going to ask for is $250,000 for the citizens to defend themselves against the city.'",
        "'speaker_8': 'That I think is more than fair. We are citizens. We're not illegal aliens. We do vote. Those of us who come down here do. The budget. I will not approve because of the already admitted $100,000 that will be spent on informational fliers that will be sent to, as Joe has brought to our attention.'",
        "'speaker_8': 'Only four or seven of the voters. The state of the animal shelter is appalling. You can groan. The animals are groaning. I'm groaning. I can't stand to listen to this. This is really unbelievable. One veterinarian is what the auditor recommends.'",
        "'speaker_8': 'One. How much could that cost? A quarter of a million. You know what? If you give me the legal fund, I'll give it back. They can have it for the animal shelter. You need to learn how to spend your money more wisely before you'll get any support from this citizen.'",
        "'speaker_2': 'Thank you. Next speaker.'",
        "'speaker_7': 'Hi, Karen. Race side resident of District one.'",
        "'speaker_1': 'Work in District.'",
        "'speaker_7': 'Two. I want to commend the City Council for the amazing job that they did on the budget preparation and the community meetings. I don't know where these other people were in, why they don't understand what the budget pays for.'",
        "'speaker_7': 'It pays for our city services. And all the city employees that I work with and the city council have been very conscientious and spent hours preparing this budget. It's the most fair and equitable budget I've seen from the city in a long time.'",
        "'speaker_7': 'I think we're moving in a very positive direction, and I want to commend you for the work you did. The only thing that I would like to see is that we start the process earlier so I could not stay and a lot of my friends could not stay till 2 to 3 in the morning.'",
        "'speaker_5': 'And Stacy, you shouldn't have had to either. We felt for you.'",
        "'speaker_7': 'So keep up the good work on the budget preparation. And the only thing I would suggest started earlier. And do something so that people can understand. What their taxes paid for. Because the roads, the sewer, the water. That's what our taxes paid for.'",
        "'speaker_7': 'And I think the city does a fine job of doing those services.'",
        "'speaker_2': 'Thank you very much. Thank you. No, no.'",
        "'speaker_4': 'I want to thank the previous speaker for raising an issue that the previous two speakers. Exactly why do citizens not trust your budgets? It's because one of the reasons is that the budget doesn't really tell you what services you're getting.'",
        "'speaker_4': 'It says instead what departments are going to get, how much money. It doesn't say anything about, in quantitative comparative terms, how the departments are performing. And the more information technology is out there, the less relevant information. Over the past few years, the city has provided to residents on the website to be able to see how much is'",
        "'speaker_4': 'each dollar getting. In the way of each kind of service. So you, the residents can't compare and you cannot even make reasonable tradeoffs as to should we have, for example, more people in public works doing tree work as versus street sweeping.'",
        "'speaker_4': 'So that is a real problem. The. Previous speaker. Praised your efforts to try to understand from this budget what's actually going on. But the problem is that we're not there. The budget does not tell you. Another reason, though, that people do not trust your spending relates to the unfortunate incident event that we are commemorating today.'",
        "'speaker_4': '911. If you recall what you actually saw on TV screens, it wasn't terrorists. It was planes. It was planes crashing into an iconic building. It was a display of.'",
        "'speaker_2': 'All.'",
        "'speaker_4': 'That was wrong with mid-20th century corporate vanity. The notion that you take clerical and information workers and stuffed them all together in a vulnerable, congested, high cost, high energy consuming central building. The lesson of 911 was that we were able to survive the loss of all those information workers because we had distributed networking, and that was already'",
        "'speaker_4': 'back in 2001. Things are much better than that now. Was this lesson applied for the housing of Long Beach City employees? Absolutely not. The thought was we just got to have another central tower, demolish this one and put up another one.'",
        "'speaker_4': 'When we learn the lessons of history and budget accordingly, people may have a little better confidence in your decisions.'",
        "'speaker_2': 'Thank you. Thank you very much, sir. I mean, what public figures.'",
        "'speaker_5': 'I should thank you both, Mayor. I just wanted to thank the many, many, many, many members of the community who came out to community budget meetings, who also came down to City Hall for budget oversight committee meetings. I want to thank my two colleagues on budget oversight.'",
        "'speaker_5': 'I know we had a lot of tough decisions to make, and I really appreciate all the work that went into knowing and understanding what that 500 pages entailed and the details of it over weeks and weeks. And then for our students that are here today.'",
        "'speaker_5': 'We're always open to any feedback that you have. Our budget is completely online, as are our expenditures on an annual basis, and so they make for great class projects. I know back when I was a grad student in oh five.'",
        "'speaker_5': 'I used city budgets and if there's any other questions I can answer for you. I'm always happy to do so. So I urge my colleagues support of this important item to pass a.'",
        "'speaker_7': '$3 billion budget with a B.'",
        "'speaker_2': 'Thank you very much. Would you please cast your vote?'"
    ],
    "Recommendation to adopt resolution in opposition to Proposition 6: Voter Approval for Future Gas and Vehicle Taxes and 2017 Tax Repeal Initiative which will be considered Statewide by voters on the \nNovember 6, 2018 ballot.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Next will be moving to item 24 with the clock please. With the item.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to adopt a resolution in opposition to Proposition six. Voter approval for future gas and vehicle taxes and 2017. Tax Repeal Initiative, which will be considered statewide by voters on the November six, 2018 ballot.'",
        "'speaker_2': 'Thank you. To not only report on that to me. Okay. Could I please have any further comment? Mm mm.'",
        "'speaker_8': 'Well, we've made it this far. Carolyn Byrnes Long Beach Taxpayers Association, also part of the newly formed Long Beach Reform Coalition. We're finally getting it together. So I don't have my orthopedic boot on today. I feel that that's an accomplishment.'",
        "'speaker_8': 'But unfortunately, my friend Tom is wearing his matching designer orthopedic shoe. We've been pounding the pavement. We've stood out at the veterans stadium many a Sunday at the swap. Meet the auto swap, meet the motorcycle swap, meet. Gathering signatures to support this measure to go on the ballot.'",
        "'speaker_8': 'To remedy the actions of 120 people in our state legislature. Who made a decision for the citizens without considering what the citizens wanted. This is a very expensive proposition. I mentioned the number earlier, $779.38. I think that this one might backfire on you all.'",
        "'speaker_8': 'It has been predicted because of this particular measure. The citizens are. A much more inclined to vote in the upcoming election. Which also has on the ballot your four charter amendments. We're campaigning heavily against those amendments. We don't mind tying the two together the four amendments and the gas tax.'",
        "'speaker_8': 'And we do feel that we may have some measure of success because of the gas tax. So go ahead. Make your vote 8 to 0 to support a no vote on the gas tax, because we're going to make it in big letters with our new political action committee and we're going to find the dickens out of it'",
        "'speaker_8': 'and shame you for what you have been doing. Please stop it.'",
        "'speaker_2': 'Thank you, Max Baker.'",
        "'speaker_4': 'Hi. Tom Stout, supporter of the gas repeal. If any of you up here would like a poster and your city employees, I would be more than happy to supply them at no cost. Or if you want some honest literature with honest information on it, I'd be more than happy to supply you with that, too.'",
        "'speaker_4': 'As Carol mentioned, we were fighting to repeal this gas tax. I spent many hours at the Long Beach Automotive and motorcycle swap meet. We gathered over 2000 signatures there from people that live all over the state of California, because you need to have a different form for each county in L.A. and in the whole state.'",
        "'speaker_4': 'We are ten different counties from Northern California to San Diego and probably the most hated people that we spoke to at that. Was Governor Brown and the state legislature who put this tax on them, and it was done by bribery during the middle of the night.'",
        "'speaker_4': 'Governor Brown gave $1,000,000,000 to four legislators. Four people got $1,000,000,000 of taxpayer money to go from a no vote to a yes vote. That is theft. That is bribery. Governor Brown says that's politics. Well, that may be politics to him, but that's bribery to everybody else at the car show.'",
        "'speaker_4': 'I've done a number of them and I have signs on my car. And 99% of the people are pissed at people like you that want to put this tax on the vast majority of people that are either low or moderate income.'",
        "'speaker_4': 'They can't afford another tax. They're already paying to hire rats, but that doesn't seem to bother any of you is along as you get a little bit more money to allegedly do some good work for the residents. The bottom line is it doesn't happen.'",
        "'speaker_4': 'No matter how much money you get, extra money, it frees up other money. And that other money seems to go in your pocket. Just like when Marjorie passed, everybody got raises. Not just a one time raise, but a compounded raise.'",
        "'speaker_4': 'And management. I still don't understand how you have a union. Hell, you're supposed to be management. You shouldn't be able to bargain. It's pathetic. So what's going to happen? I don't know. Every 99% of the people at the Belmont Shore car show that took information was really upset.'",
        "'speaker_4': 'And they weren't upset with me for trying to pass it out. There were a couple people. It was surprising. One guy said, I can't vote yes. I'm not in favor, but I can't vote yes because I work for public works.'",
        "'speaker_4': 'Another Long Beach firefighter came along and said, I'm in favor of. Yeah, I'm for. Yes, repeal it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'So, like I said, show some good conscience and do your job and don't try and tack somebody out of California. Maybe that's the best thing to do is move out of the state, sell what property you have, and try another low tax state.'",
        "'speaker_4': 'Even the weather's not as good.'",
        "'speaker_2': 'Thank you. Okay, next. Bigger.'",
        "'speaker_6': 'Good evening. City Council Members Vice Mayor Andrews and Distinguished City Council members. My name is John Wright, policy manager of the L.A. County Business Federation. A grassroots organization with more than 70 business organizations represent 390,000 players, ten .3. 5 million employees in Los Angeles County.'",
        "'speaker_6': 'We were in it to win it with Measure and we're in it to win it with. This has to be won. We're in it to win it to keep transportation funds in Los Angeles County, because that's where our jobs are.'",
        "'speaker_6': 'That's where our infrastructure is at. That's what moves our economy. Those are the things that some mentioned that the cost of for a two car family of $700,000 a year for such a measure. Imagine when someone hits that pothole and they have over $1,000 worth of damage to their transmission, to their suspension.'",
        "'speaker_6': 'A little bit more than that, maybe up to 2000, depending on how the make and model of the vehicle. All those into consideration, what's the cost worth not doing us. That's what's affecting our job security, affecting our roads, affecting our infrastructure that we need to protect.'",
        "'speaker_6': 'What city lobbies in L.A. County in general? Because this is what's going to be needed to fix the 710 Freeway, to keep the maintenance and keep the roads smooth and clean. Because if you're going to have higher zero emission vehicles or near zero emission vehicles with newer technology, they want to protect that investment.'",
        "'speaker_6': 'They don't want to see it being bumped and messed up because of crappy roads. And I live as a Long Beach resident in the seventh District. I live right at 37 Linden and I see that every time I even ride my bike with all those potholed road roads right in front of petroleum couple right in front of'",
        "'speaker_6': 'the bacon barrel. Because I see that every time I ride my bike I got to repair that tire. I can swerve all I want to. But guess what? I'm still going to hit that pothole because that paving needs to take place and that's what this funding will do.'",
        "'speaker_6': 'This isn't perfect. There is no such thing. But at least we're doing something. And that's what needs to take place. I urge for your support of this particular vote. And have a great evening.'",
        "'speaker_2': 'Thank you. Expedia.'",
        "'speaker_3': 'Hi, America. Gonzales. I live in the second district. And I just want to say I'm an absolute support of this measure. I feel like the gas tax is really just the first step in what we need to maintain our infrastructure.'",
        "'speaker_3': 'It's been neglected for decades upon decades, upon decades, and we're now barely taking the first step necessary to get to where we should be in 2018. So if we don't show our support for it now, we're going to lose it and the streets are going to fall into further disrepair.'",
        "'speaker_3': 'Now, to kind of echo the cycling aspect of it, I bike everywhere to school, to work. That's what I do. Between Cherry and Redondo on 10th Street, it is a war zone for me as I'm fighting cars and potholes across that.'",
        "'speaker_3': 'But it's my hope that because of this tax that will soon be repaired and I will only have to.'",
        "'speaker_6': 'Fight cars on that road. So please support.'",
        "'speaker_3': 'This. I hope the community comes out, understands all the negative externalities the cars produce, and how we're only trying to correct that and put us where we should be now. Thank you.'",
        "'speaker_2': 'Thank you very much. I need a more public comment now. Would you please cast your vote? Okay. Now she.'",
        "'speaker_1': 'Carries with.'",
        "'speaker_2': 'Us. Thank you. Now we've got a second coming. Right. If anyone have any comments, please. He's come up. Please state your name. 3 minutes.'"
    ]
}