{
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for an agreement with Transportation Network Companies registered with the California Public Utilities Commission to provide transportation services under a nine-month pilot program at the Long Beach Airport, and authorize the imposition of a $3.00 pick-up and $3.00 drop-off fee.  (Citywide)": [
        "'speaker_3': 'Great. We're going to take item eight with the rest of the items as they come up. We're going to go ahead and begin some of the items that are here. So let's go and begin by taking item 31.'",
        "'speaker_4': 'Report from Long Beach Airport. Recommendation to authorize the city manager to execute an agreement with transportation network companies to provide transportation services under a nine month pilot program at the Long Beach Airport and authorize the imposition of a $3 pickup and $3 drop off fee citywide.'",
        "'speaker_3': 'Councilman Mango.'",
        "'speaker_1': 'Yes, I'd like to slightly modify the motion submitted by the city. I'd like to direct the city manager to meet and take input from our stakeholders, including ground transportation providers at the Long Beach Airport, and solicit input from members of the public as well, so that we can develop a TNC rideshare program for Long Beach Airport and'",
        "'speaker_1': 'return to the progress report within 90 days and prepare for implementation program in 2017.'",
        "'speaker_3': 'There is a motion and a second by Councilman Price on Price.'",
        "'speaker_2': 'I would just like to request that when we're considering this item for the for the networks that we're considering that we include See Jane Go, which is a new, new transportation network with female drivers designed for female rider.'",
        "'speaker_2': 'So if we could include them in the mix in terms of who to consider, I'd appreciate that.'",
        "'speaker_3': 'You and see no other public thing, no other council comment. We're going to get any public comment. Okay. Senior public comment members, please go ahead and cast your votes. So for those that don't know what TNC is, it's basically a technical term for rideshare.'",
        "'speaker_3': 'It's a.'",
        "'speaker_4': 'Membership runoff.'"
    ],
    "Adopt resolution directing the Director of Development Services to submit a request to the California Coastal Commission to certify an amendment to the Certified Local Coastal Program; and  Adopt Negative Declaration ND-03-16.  (District 3)": [
        "'speaker_3': 'With the councils voting on is beginning a process to allow the lifts and and the Ubers and the and the C Jane goes allowed at the airport so that that's what taxis are. Okay. Motion carries. Moving on to the next one that we pulled out, which was I'm sorry I skipped the hearing.'",
        "'speaker_3': 'I think so. Let me do hearing number one.'",
        "'speaker_4': 'Hearing one report from Development Services recommendation to receive supporting documentation into the record. Conclude the public hearing. Declare ordinance amending the use district map by amending portions of part six from CNR to R2 one for the property to 61st place, read for the first time and laid over to the next regular meeting of the City Council for'",
        "'speaker_4': 'final reading approval. Local Coastal Development Permit Adopt resolution directing the Director of Development Services to submit a request to the California Coastal Commission to certify an amendment to the Certified Local Coastal Program and adopt a negative declaration. N.D. Dash zero three Dash 16 District three.'",
        "'speaker_3': 'Stafford Port Yes.'",
        "'speaker_5': 'Mr. Mayor and members of the Council. The staff report be given by Linda Tatum, our planning bureau manager.'",
        "'speaker_2': 'Good evening, Mayor, and members of the council. This is an application by a property owner for a rezoning from the current seat in our community or neighborhood.'",
        "'speaker_4': 'Commercial residential.'",
        "'speaker_2': 'Designation to rezone to the AR two I.'",
        "'speaker_1': 'Which is the.'",
        "'speaker_2': 'Two family intensive.'",
        "'speaker_1': 'Residential zoning district. The purpose of this request is to construct a new single family dwelling on this property, and the property is located.'",
        "'speaker_2': 'At on.'",
        "'speaker_1': '61st place.'",
        "'speaker_2': 'The reason for the request for the rezoning is that the are two eyes zone that's.'",
        "'speaker_4': 'Being requested allows a height of up to three stories.'",
        "'speaker_2': 'And the current seat in our the neighborhood. Commercial zoning allows only a two story development. So I'd like to show you a quick slide to give you a little bit of context. This is the peninsula. And just to give you a context, there is this what we call the dog bone there.'",
        "'speaker_2': 'That's his own seat in our neighborhood on commercial and residential. And the subject site is located here on the.'",
        "'speaker_10': 'Very westerly edge.'",
        "'speaker_2': 'Of that sea in our zone.'",
        "'speaker_1': 'The this strip of.'",
        "'speaker_2': 'Sea and our zoning on the peninsula dates back to approximately the fifties. And the intent, when it was originally designated for CNR from the previous R two zoning, was to allow or to accommodate some very low density commercial within that that community.'",
        "'speaker_2': 'However, the market never did turn over that those residential properties to commercial. So to date the the entirety of this area is still predominantly developed, predominantly as residential. Of those 49.'",
        "'speaker_4': 'Addresses within that.'",
        "'speaker_2': 'Property, only only and 37 buildings in this strip, only.'",
        "'speaker_4': 'Three are actually developed as commercial.'",
        "'speaker_1': 'The rest of it is.'",
        "'speaker_2': 'Is.'",
        "'speaker_1': 'Residential.'",
        "'speaker_4': 'So therefore.'",
        "'speaker_2': 'Let me just give you another context. This is. You can see the.'",
        "'speaker_4': 'The location here where the error.'",
        "'speaker_2': 'Was showing this.'",
        "'speaker_1': 'Is the location of the the proposed property.'",
        "'speaker_2': 'That's the subject of the rezoning. And just another slide with a sketch of the proposed home there interspersed. You can see the context of the property. It's a proposed three storey dwelling unit.'",
        "'speaker_0': 'Whoops. The three storey dwelling unit.'",
        "'speaker_2': 'And it fits within the current context of the existing development within the CNR zone.'",
        "'speaker_1': 'Just to talk real briefly about the general plan for this area. The the general plan designates this area as.'",
        "'speaker_2': 'Eluded number two, which allows mixed style homes. And the C an R zoning currently.'",
        "'speaker_1': 'In place does not.'",
        "'speaker_2': 'Conform to this designation.'",
        "'speaker_1': 'However, the R2 I.'",
        "'speaker_2': 'That they're requesting is consistent with this general plan designation and changing the zoning as requested to the R one or the R2 ISO will bring this property into conformance with the general plan. So staff, when this.'",
        "'speaker_4': 'Request came through, staff.'",
        "'speaker_2': 'Did an analysis of.'",
        "'speaker_1': 'The property and the request.'",
        "'speaker_4': 'And.'",
        "'speaker_1': 'Essentially given the location of this property adjacent to.'",
        "'speaker_2': 'The the rest of the C, the existing two is owned throughout the rest of the peninsula on the edge. We felt that this is not considered support zoning. So the request.'",
        "'speaker_1': 'Is certainly appropriate. The zoning also would afford the applicant who.'",
        "'speaker_2': 'Happens to be the property owner for this property.'",
        "'speaker_4': 'It affords that property owner the same.'",
        "'speaker_2': 'Development rights.'",
        "'speaker_1': 'To do.'",
        "'speaker_4': 'A three storey project as is enjoyed by.'",
        "'speaker_1': 'The majority.'",
        "'speaker_2': 'Of property owners currently on the.'",
        "'speaker_1': 'Peninsula. It's also important to note that the scope and scale of the.'",
        "'speaker_2': 'Development that's being.'",
        "'speaker_4': 'Proposed is is.'",
        "'speaker_2': 'Entirely consistent and compatible with the general development pattern within that area. And the zone change will not create any.'",
        "'speaker_4': 'Unanticipated impacts to this site or into the surrounding property.'",
        "'speaker_2': 'The zone change will.'",
        "'speaker_1': 'Also meet all of the requirements of the city's on the existing certified.'",
        "'speaker_4': 'Local coastal program and approval.'",
        "'speaker_1': 'Of the local coastal.'",
        "'speaker_2': 'Development permit is an appropriate action.'",
        "'speaker_1': 'For this.'",
        "'speaker_2': 'The City Council to take. According to secure I a an environmental.'",
        "'speaker_1': 'And.'",
        "'speaker_2': 'Environmental analysis was done and a negative declaration was prepared to the project for the project. And we found no significant impacts to the environment and no impacts that are needed to mitigate this project in order. So the project does comply with the California Environmental Quality Act.'",
        "'speaker_4': 'We did receive.'",
        "'speaker_2': 'One letter and one phone call in opposition to the.'",
        "'speaker_4': 'Project.'",
        "'speaker_2': 'However, all of the communication that was received for this project is included in the council packet.'",
        "'speaker_1': 'We also received a letter of.'",
        "'speaker_2': 'Support from the property owner immediately north of.'",
        "'speaker_1': 'The project site in support of the project.'",
        "'speaker_2': 'In conclusion, based on the staff analysis that was done for this project and the finding that there are no.'",
        "'speaker_1': 'Significant impacts, it's compliant with sequel.'",
        "'speaker_2': 'Also based upon the feedback.'",
        "'speaker_1': 'Staff is recommending that the City Council affirm the recommendation that was made by the Planning Commission when they heard this item.'",
        "'speaker_2': 'And that the City Council.'",
        "'speaker_1': 'Adopt the negative declaration for.'",
        "'speaker_4': 'This project.'",
        "'speaker_1': 'Approve the zone.'",
        "'speaker_2': 'Change from CNR to R2.'",
        "'speaker_1': 'I also approved the local coastal development permit as well as adopt a resolution submitting.'",
        "'speaker_4': 'A local coastal.'",
        "'speaker_2': 'Program amendment to the California Coastal Commission. That concludes the staff's presentation. I'm available along with Scott Kinsey, the project planner, and we can answer any questions the Council may have.'",
        "'speaker_4': 'Regarding this request.'",
        "'speaker_8': 'Thank you. Is there any public comment on this item? Seeing none. Members, please, please cast your vote count.'",
        "'speaker_2': 'I just want to speak to the item.'",
        "'speaker_8': 'Oh, I'm sorry. I didn't. Forgive me.'",
        "'speaker_2': 'For it. I want to thank Staff Scott and Linda for your great work, your thorough presentation on this topic. I think that the analysis is is very comprehensive in regards to the local area. And your your presentation did a good job in educating my colleagues and myself as well regarding the proposed development and how it fits within'",
        "'speaker_2': 'the current existing development in the area, as well as the general plan objectives that we have shared with the Peninsula community. I really do think it's an it's an issue of fairness. This proposed project really falls very clearly into the current housing scheme, development scheme in the area, and I urge my colleagues to approve staff's recommendation as'",
        "'speaker_2': 'to this item. Thank you.'",
        "'speaker_8': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'I think that everyone did an excellent job and I will be supporting this item.'",
        "'speaker_8': 'Thank you, Councilmember Arango.'",
        "'speaker_6': 'Thank you. QUESTION The height of the of the property is 35 feet. Is that it?'",
        "'speaker_3': 'The excuse me, the maximum height under our tri zoning is 32 feet, with a additional maximum of 35 to the ridge, only to the ridge of a slope, but everything else 32 feet.'",
        "'speaker_6': 'And the buildings that are adjacent to it, how tall? How high are they?'",
        "'speaker_3': 'We have a number of three and four story buildings in the immediate vicinity.'",
        "'speaker_6': 'Okay. Just ask it. I know it's going to be coming through the Coastal Commission, so it's going to be an issue of the height requirement. And hopefully from what I can tell, it's compatible with the rest of the territory, with the rest of the buildings around that area.'",
        "'speaker_6': 'So I'll be supporting this. Thank you.'",
        "'speaker_8': 'Thank you. And seeing no public comment, members, please cast your vote. You know me? Yes.'"
    ],
    "Recommendation to approve the 2017 Office of Sustainability Work Plan; and receive and file the Sustainable City Commission Policy Priorities for 2017. (Citywide)": [
        "'speaker_4': 'Motion carries.'",
        "'speaker_8': 'Let's have item number eight that was pulled from concert.'",
        "'speaker_4': 'A report from Disaster Preparedness and Emergency Communications I'm sorry, report from a Development Services recommendation to approve the 2017 Office of Sustainability Work Plan and receive and file the Sustainable City Commission Policy Priorities for 2017 city wide.'",
        "'speaker_8': 'Thank you, Elizabeth. Staff report, please.'",
        "'speaker_5': 'Jim Fisk will give this report.'",
        "'speaker_8': 'Larry Rich, I believe.'",
        "'speaker_5': 'I'm sorry, it's Larry Rich. Sustainability. Sorry, Jim.'",
        "'speaker_3': 'Don't have a heart attack. Good evening, honorable mayor and members of the City Council. Thank you for the opportunity to give a brief overview of the Office of Sustainability Work for 2017. In 2008, the City Council created the Sustainable City Commission to serve as an advisory body on issues related to sustainability and charged it with the development'",
        "'speaker_3': 'and implementation of a Sustainable City Action Plan. The Office of Sustainability was also created at the time to administer and support the Commission. Each year, the office works with the Commission to develop an annual work plan to provide focus to the staff work for the coming year.'",
        "'speaker_3': 'This year at the Commission's request, staff organize a special public input meeting to collect sustainability related community priorities for consideration. In addition, the commission and the staff held a half day work plan retreat to discuss and finalize the work plan as a result of discussions at the retreat.'",
        "'speaker_3': 'Commission members opted to craft their own statement of policy priorities to capture community sentiments that were not feasible to include in the work plan. As immediate action items, both the work plan and a letter from the Commission are part of your package.'",
        "'speaker_3': 'The workPlan itself contains three sections. The first details program management projects that will be pursued by the Office of Sustainability in partnership with other city departments or community organizations. An example of this is the forthcoming Electric Vehicle Charger Giveaway Program.'",
        "'speaker_3': 'The second section lists ongoing field green greenfield work activities that the office conducts to provide green services to residents and businesses such as the mulch delivery and parkway tree planting programs. Finally, the third section lists informational presentations at the office, plans to schedule for commission meetings held over the course of 2017.'",
        "'speaker_3': 'The letter from the Commission on Policy Priorities includes a summary of public input and a listing of high level policy recommendations based on that input. We feel that the combination of staff, work plan and commission policy priorities successfully captured the community's interest in next steps for a more sustainable city.'",
        "'speaker_3': 'Thank you for your consideration of these items and I stand ready to respond to any questions or comments you may have.'",
        "'speaker_8': 'Thank you, Councilmember Pearce.'",
        "'speaker_9': 'I wanted to thank our Sustainability Commission for their hard work, their diligence and their vision, and pushing our city to be as bold as we can be. And so I want to thank you also to our staff for all of your work.'",
        "'speaker_9': 'And I just wanted to highlight that great work. And hopefully as we move forward, we can put the steps in place we need to get to a zero waste city.'",
        "'speaker_8': 'Thank you. Thank you, Councilwoman Gonzalez.'",
        "'speaker_2': 'Great work. I like the work plan. Just looking over it again right now, it's got great information on how we can continue being collaborative. So kudos to the commission as well as to Larry. You ran a great department and I love all of the creative ideas that have come out from this.'",
        "'speaker_2': 'And I know a lot of it has already been done, but still a lot of more a lot more work to do. So congratulations.'",
        "'speaker_8': 'Thank you. Is there any public comment on this item saying nonmembers cast your vote? There's. Okay. Come on, now. I thought I was going to get away.'",
        "'speaker_0': 'I'm sorry. Oh, you're not getting away. Yeah. You got opinionated community members here today, right?'",
        "'speaker_8': 'Go ahead and state your name. And you have 3 minutes, Gabrielle.'",
        "'speaker_2': 'Weeks.'",
        "'speaker_1': 'You've been to my house. You know where I live. I'm in the second district.'",
        "'speaker_2': 'Like your shirt today, Janine?'",
        "'speaker_1': 'I'm speaking on behalf of the Sierra Club and our 40,000 members in the area. A couple of us were able to attend this Sustainable City Commission meeting they're talking about. This is going to be great to have our city be a real leader in this area.'",
        "'speaker_1': 'We can you know, there's so much we can do here because we're a big enough city that we really matter, but we're not so big and unwieldy. We're like Los Angeles. I don't know how the L.A. thing done up there, but, you know, we are our mulch program.'",
        "'speaker_1': 'I tell my friends about this with the other Sierra Club cities and they just don't believe me. And so I've driven a number of people over to show them where.'",
        "'speaker_0': 'You can get it over in cities, district, by the fire station. And, you know, people, you know, we can.'",
        "'speaker_1': 'We have a real opportunity here to do some awesome stuff. And I hope we we dig deep and really support some some robust ideas and not just go with like the easy top two or three. So please support some some really far reaching stuff so we can really be proud of our city.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Patricia Chen, and I'm here on behalf of Long Beach 350. We are concerned about the climate because currently there is more than much more than a safe level of 350 parts per million of carbon dioxide in the atmosphere.'",
        "'speaker_4': 'So that's where our name is. 350 We are speaking on the Sustainable City Commission Plan and policy item tonight because they contained many items that will help reduce greenhouse gas emissions. And two in particular that we were interested in are the transition from fossil fuels to affordable, clean energy through community choice aggregation.'",
        "'speaker_4': 'I think that's one of the most effective things that we could do, and it's pretty painless financially. And the other is the zero waste goal. Long Beach 350 strongly supports the Don't Waste Long Beach campaign that would reorganize the trash and recycling system in a way that would reduce greenhouse gas emissions very, very, very significantly.'",
        "'speaker_4': 'And the zero waste goal is a key part of the concept. And I like to say, when you throw things away, there really isn't any such thing as a way you're throwing it towards someone or something else so that don't waste.'",
        "'speaker_4': 'And that zero waste goal is very important to us. And we ask that you join us in supporting it. Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening, Vice Mayor Richardson and members of council. My name is Tony Demicco. I'm the co-director of Long Beach Fresh, the local Food Policy Council and a member of the Don't Waste Long Beach Coalition. I want to take a moment to thank Larry and his staff and our commissioners for their hard work on this wonderful work plan'",
        "'speaker_5': '. And want to come before you today to encourage you to move forward with the recommendations established in the workPlan that include setting a zero waste goal. Moreover, as the city is figuring out how to roll out AB 1826 locally, I also want to urge the city to think of a comprehensive, citywide, exclusive franchise system that is, dare'",
        "'speaker_5': 'I say it, robust and meets high standards of recycling and composting and ensures that all Long Beach residents have access to organics collection. Now, at Long Beach Fresh, we believe that everyone in Long Beach should have access to healthy and affordable food.'",
        "'speaker_5': 'But meanwhile, nationwide, more than 50% of the food that we produce is actually wasted. And while we have a lot of great organizations that work on food recovery and Long Beach, like food finders, who are also part of our coalition, we think it's very important to have a good concrete plan for green beans and compost collection as'",
        "'speaker_5': 'we move forward. It's also striking to me that Long Beach is the only city in the ten largest cities in the state of California that actually does not have a green bean service for his resident for their for our residents.'",
        "'speaker_5': 'So in setting a zero waste goal, this is a very important thing to consider as we try to get to zero waste and implement AB 1826, we must set clear goals that can keep us on course to ensure that Long Beach is a city that is nationally recognized for innovation.'",
        "'speaker_5': 'And as we look at compost, you know, we see it as a valuable resource to our many community gardeners and urban farmers, and also part of a larger infrastructure that's being developed within the region for large scale composting.'",
        "'speaker_5': 'We want to be part of that and we want to do it in a way that's not environmentally harmful, since simply composting food at the local level can save up to 86 tons of carbon emissions as opposed to landfilling that organic matter and food.'",
        "'speaker_5': 'So we think these are very important things to consider as we continue to innovate as a city and create new opportunities for local gardens, restaurants and residents providing healthy meals to everyone. Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good afternoon. My name is Linda Serafin. I currently sit on the board of the Element Speech Neighborhood Association, which is a member of the Don't Waste Land Beach Coalition. And I'd like to thank the Sustainability Commission for their leadership in looking at how the city of Long Beach can protect our local environment and being open to public'",
        "'speaker_2': 'comment and public input in the last few months and developing their work plan that you guys have in front of you today. So I encourage you today to adopt the recommendations made in the Sustainability Commission's work plan and move forward with creating a local zero waste goal and change our current waste system.'",
        "'speaker_2': 'As through my involvement in my neighborhood association, I've seen a need for a change in our current waste system. One of the complaints that I get the most is overfill trash bins. And not only does that make our streets look dirty and unappealing, but it also increases the chances of waste being washed into our storm drains and'",
        "'speaker_2': 'into our oceans. And a simple solution to this would be to increase the number of recycling bins residents have access to and potentially organic compost bins in the future as well. And this can be achieved through implementing an exclusive franchise system for waste hauling with an exclusive franchise system.'",
        "'speaker_2': 'Our city could set specific requirements for haulers that could include guaranteed access to recycling and quality customer service for residents. This will ensure this is a mechanism that will ensure accountability in our city when it comes to setting benchmarks to exceed or reach our state school of 75% recycling by 2020.'",
        "'speaker_2': 'So I encourage you to be bold tonight and move forward with the Sustainability Commission's recommendations and create a local zero waste school and adopt an exclusive franchise system in order to ensure that Long Beach reaches its full potential.'",
        "'speaker_2': 'Thank you for your time.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Okay. Okay. Yes. I live in a landfill. I have a mobile home park that lives in a landfill. I am paying rent out there for an a landfill sick about 15 or now. So fucking excuse my angers me.'",
        "'speaker_3': 'I checks balance for the rent and also I couldn't take my outside on the landfill. You talk about recycling. Good. We could do it because we have to develop alternative fuels for this country, too. We have to get away from oil to the world and end.'",
        "'speaker_3': 'The era of the end of the era will come because no jail to control? No, the oil companies don't control geology. Gerald, who controls the oil companies? Because oil can run out. If if we do not develop alternate fuels and recycling all that and especially I live on a landfill.'",
        "'speaker_3': 'My home friendly village mobile home park and a peanut outrageous front for something in a landfill. Alternate fuel. I'd rather have rent control for the city and for the city alone, because if you weren't able to have like for housing, especially some of the land for getting rent control and also been recycling alternate fuels, well, get the'",
        "'speaker_3': 'country free for oil. But reality is going to do it for us. When is it going to come? A come a day that is going to come. It's going to get it's gone. It's going to come like the end of the world, being able to, you know, let go of gasoline station and say, sir, ma'am, I'll pull'",
        "'speaker_3': 'on the money. Well, no, no, no gasoline. I'm sorry, sir. Will be no gasoline. You'll be rioting. What will happen? It'll be rioting. I mean, rioting there. I mean, 1873, 1970s, a picnic. And now I live on a mobile friendly village, mobile home park.'",
        "'speaker_3': 'And we've done a PR outrageous rent. I wrote a rent control for this city. Well, it was like going away from us while we get away from oil. Well, Charles, who's going to do it for us for owning village, the prototype for alternate fuel?'",
        "'speaker_3': 'Question is, who could have allowed something like this people to leave for special alternate fuels to eat oil? That's like beyond me and beyond because it's the oil companies that have done this. Well, the oil companies are going to wake up the end of the world.'",
        "'speaker_3': 'Withdrawal is coming. But you understand the oil. You understand about your energy. You understand about geology. That's I mean, ultra fuels and in front of a control place, it's really no control. We're so out of control. You cannot believe it.'",
        "'speaker_3': 'It's basically something that's on alternate fuel. Give me a break. The end of the world is coming. Oil's going. Gonna run out. Wake up. Because you know what you're going to do for us. That's why we need recycling, fuel, energy efficiency and alternate fuels and geology.'",
        "'speaker_3': 'Because wake up. One of these days, for example, how you shouldn't be built about stuff on landfills from the village mobile home park up on. That's why I think that's living on a landfill. Pretty outrageous. Hotel rates rent control for the city of Long Beach City where it's like 600 a month.'",
        "'speaker_8': 'Sir. Thank you, sir. That's that's 3 minutes.'",
        "'speaker_3': 'Okay. Thank you. Thank you very much. Thank you.'",
        "'speaker_8': 'I appreciate your time. Thank you. Next next speaker, please.'",
        "'speaker_4': 'Good evening. Excuse me. Good evening, counsel. My name is Desiree Uterus, and I am proud to serve as one of the sustainable city commissioners representing District nine. I excuse me. I miss my voice. I want to thank you for reviewing the Sustainable City Action Plan that Larry and his staff have put together.'",
        "'speaker_4': 'And I want to acknowledge the hard work of that team. I also would like to really draw your attention to the extensive amount of public comment that our commission has been experiencing over the last several months. It wasn't just one meeting, which it may have sounded like in previous comment.'",
        "'speaker_4': 'We have seen a substantial increase in the public coming together representing diverse environmental issues, but coming together to make their voices heard and known. And in particular, they have drawn very strong attention, as you've heard a bit here tonight, to the establishment of a zero waste goal for the city of Long Beach.'",
        "'speaker_4': 'But as well as a commitment to 100% renewable energy and increased walkability and public transit. So I'd ask that in addition to moving forward, the action plan that Larry's office will execute that in your own work in developing policies for this city, that you really do take some time to consider the amount of public comment and expression'",
        "'speaker_4': 'of interest that we are hearing from the public and that you really take a look at. I believe it's the fourth attachment in your packet tonight that, you know, has very extensive breakdown of what people have asked for by subject area, and also to serve as a reminder that the commission is happy to serve and support you'",
        "'speaker_4': 'in moving a policy forward that can advance these issues. And so please do not hesitate to call upon us so that we may support your work and support our city. Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening, everybody. My name is Karen Reside, and I'm here tonight on behalf of the Long Beach Gray Panthers. We're a participant in the Doe's Don't Waste Long Beach Coalition, and we're participants in the community workshops that were held by the Sustainability Commission.'",
        "'speaker_4': 'And I just want to commend the city staff lanreath and established an excellent job on the plan. Never seen a plan that's been so understandable in terms of what a city department is going to accomplish. And the Elliot Gonzalez also for holding a very open discussion about what the community wanted in terms of sustainability.'",
        "'speaker_4': 'And the Long Beach Gray Panthers are separate reporting the movement to renewable energy and the green waste collection and effective public transportation that services everybody in our community, including our seniors, have been cut off from the system. And we, going forward, will be working closely with these groups on these issues.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'I thank you. My name's Ellie Gonzalez. I'm the current chair of the Sustainability Commission. I'll speak briefly. I think everything that. That I wanted to say was already mentioned, but I did want to just echo my fellow commissioners comment that we want to be a body which aids this council in its decision making.'",
        "'speaker_3': 'And one thing that didn't make it into the work plan, but was something that we were planning on reviewing, was our oil and gas operations. And I know that there is an item tonight, so I'll go ahead and wait to extend my comments until that time.'",
        "'speaker_3': 'But I did want to let this council know that our commission is becoming increasingly active as climate change becomes more of an accepted reality. We we're getting a lot of a lot of input from the public for a zero waste goal, for a plan to transition off of fossil fuels towards clean energy, for a plan that creates'",
        "'speaker_3': 'jobs, green jobs, good paying jobs. This is a vision that we have had in our in our city for well over a decade. You know, I think our current president campaigned on it. This is something that we have a lot of excitement for in our city, and it's something that I know the community wants to implement.'",
        "'speaker_3': 'So I did want to ask for your approval of this year's plan. And again, I'll speak to the oil and gas later when that time comes up. Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hi, my name is Spencer Sabo. I'm in fourth district. I want to talk about just a couple of issues and echoing some of the stuff that's been said, I'd like to cover those regarding trash. I live in a big apartment complex and we have less trash than recycling.'",
        "'speaker_3': 'However, I recycling bins are smaller than our trash. And so what happens people put their recycling is stuff in the trash. So I have to go and I'm not a manager, I'm just a concerned citizen and a citizen of planet Earth.'",
        "'speaker_3': 'So I would like to keep the place clean. So I go through the trash doing the the recycling pickup, so I take all the stuff and put them in there. So I think what I'm driving at is the education that we need to have for the big business and big apartment owners that we need to have fliers'",
        "'speaker_3': 'sent to people living in a big complexes or even small apartment buildings to be educated to. What does the city vision is for the future and how can they participate? Number two, I want to talk about I think we sort of like emphasizing us citizens doing more than what the business is supposed to do.'",
        "'speaker_3': 'I realized was a two years ago that the city fined McDonald's for wasting water and the only business in the whole entire country got fined for wasting water. So we have a lot of waste going on in the businesses then local homes and apartment buildings.'",
        "'speaker_3': 'So please educate people that we can do things better to go for the zero emissions. And and that's. Thank you very much. That's it.'",
        "'speaker_8': 'Thank you. Our next speaker, please.'",
        "'speaker_3': 'Good evening, counsel. Thank you very much for having this forum or advocacy for everyone's issues. My name is Tony Taylor. I live two months every year in Buenos Aires, Buenos Aires, Argentina, and ten months here in Long Beach.'",
        "'speaker_3': 'I'm a singer, songwriter, artist and investigative journalist for various magazines, The Nation Intercept magazine. And I belong to collectives or collectively see in Spanish in Argentina, indigenous groups and African-American groups and anyone in the diaspora. My point is, in Long Beach there is great artistic collectives here, and we have a beautiful gentrification, positive and negative in the'",
        "'speaker_3': 'in the city. And with the amount of investment that needs to be in this city, it's a beautiful thing to attract people. We have to find that fine line between those who are indigent, poor, who are being pushed out at the same time attract business.'",
        "'speaker_3': 'So that's always a tough, fine line. What what happened in Oakland recently with the horrible tragedy of the collective building that caught on fire? I want to put this on the record in the event we're talking about blight, okay.'",
        "'speaker_3': 'In the event that that tragedy, whatever happened in Long Beach, because we have a lot of artistic collectives here, make sure that no developer would like to use any tragedy for development to push people out to build condos or destroy the the collective.'",
        "'speaker_3': 'If that happens, make sure if we could police a consensus vote, consensus vote that you'd build another collective, have it affordable for people. That way you can increase the business. Keep the artistic community alive. Take care of people of color who are poor, poor, white people who cannot afford.'",
        "'speaker_3': 'And we're here to honor the indigenous rights of people and all humanity. So thank you very much for your time and to stay conscious of the issues, please.'",
        "'speaker_8': 'Thank you. I was I was waiting on the sustainability tie. I think you were going to speak on the next item. So seeing no more public comment members, please cast your vote.'",
        "'speaker_4': 'Councilwoman Pryce. Well, I'm sorry. Richardson okay. Bush and Kerry's.'",
        "'speaker_8': 'Thank you. So at this point, we're going to go ahead and take care of public comment. So we're going to. So the people we have are Bill Shorten, Ronald Morse, Larry Goodhew, Bob Joy, Ray Gavlak, Latoya Marshall and Laurie Smith.'"
    ],
    "Recommendation to approve the Uptown Property and Business Improvement District Annual Report and Assessment for the period of January 1, 2017 through December 31, 2017, automatically extending the current agreement with the Uptown Property and Community Association for a one-year period; and, authorize payment of $54,561 in City property assessments from the General Fund (GF) and $3,668 in City property assessments from the Successor Agency Fund (SA).  (Districts 8,9)": [
        "'speaker_8': 'Thank you so much. So that concludes public comment. So we're still a little out of order. So we're going to we're going to take item 21. Madam Clerk, please queue up item number 21, please. And I'll make the motion on this item.'",
        "'speaker_4': 'Report from Economic and property development. Recommendation to improve the Uptown Property and Business Improvement District Annual Report and assessment for the period of January 1st, 2017 through December 31st, 2017. An authorized payment of $54,500 in see property assessments from the General Fund and $3,700 in city property assessments from the successor agency fund districts eight and nine.'",
        "'speaker_8': 'Thanks. Please have a staff report, please.'",
        "'speaker_5': 'Jim Fisk.'",
        "'speaker_6': 'Honorable Vice Mayor and City Council Members. This item is the annual approval.'",
        "'speaker_7': 'Of the Uptown Property and Business Improvement District.'",
        "'speaker_6': 'And report and ongoing assessment. The recommended action on this item continues the assessment for another year. There are no proposed changes to the basis of the assessment, nor any significant changes with the proposed activities or programs. Therefore, staff requests that City Council received the supporting documentation of record and approve the recommendation to continue the levy of the'",
        "'speaker_6': 'assessment and authorize the.'",
        "'speaker_7': 'City manager to extend the agreement for one additional year. And that concludes my report.'",
        "'speaker_8': 'Thank you. And what I'll do right now is we have a presentation from the Uptown Business District Manager, a brief presentation. So I want to just introduce Tasha Hunter.'",
        "'speaker_1': 'Great. Thank you. Good evening, Vice Mayor. Council members and city staff. Okay. Let's see if I can work this. Okay. This is our annual report. And this is our Uptown Business Improvement District right there in North Long Beach from Atlantic and Artesia, as far south as Atlantic and Market.'",
        "'speaker_1': 'And we go east on Artesia to Orange Street. So we encompass Council District, a portion and Council District eight and in council a larger portion in Council District nine. So here is our annual report. I'm very excited to say that so many wonderful things are happening in Uptown.'",
        "'speaker_1': 'We are having monthly security meetings where we bring together public safety stakeholders, private security teams of businesses and properties, as well as our own private security team. CSI, the Long Beach Police Department and Long Beach Police Department for Jordan High School, or I should say officer at Jordan High School and other businesses with security.'",
        "'speaker_1': 'And we take the recommendations of the businesses and the property owners, and one of them is increase security patrols. So that's one of the things that we've done. We've increased our bike patrol as well as added a mobile patrol during weekend hours.'",
        "'speaker_1': 'And our businesses and our property owners and our community, business community are engaged, bringing all of these security stakeholders, safety stakeholders together as key. Another thing we'd like to talk about is that our our police department is giving literature and information to our business owners about how to remain safe.'",
        "'speaker_1': 'We have also increased our cleanliness. When I came on board some months ago, we were utilizing the services of one porter to clean the entire business improvement district. We've since contracted with the Conservation Corps, and the Conservation Corps is doing a phenomenal job.'",
        "'speaker_1': 'It's been awesome having them there. So we're averaging about 5 to 10 young people. They are young adults in a program which is environmental preparedness, and they're helping us clean the area. And we're averaging about 3,000 of trash and debris monthly.'",
        "'speaker_1': 'So that's over a ton. That's incredible. We have increased our pressure washing instead of twice a year. We're pressure washing weekly so that the visibility and the and it's noticeable that it's being cleaned throughout the bill. The bid's, the business improvement district, we're reporting graffiti.'",
        "'speaker_1': 'We had about 128 reports of graffiti over the course of six months, averaging about 18 a month. And working with the city to get that cleaned is, is is very important also working with the businesses and the property owners to let them know that there are some where they can remove that themselves.'",
        "'speaker_1': 'And we're working on Fridays with the city prosecutor's office to have community service workers come and help us clean the bit. So we're really excited about the work that we're doing as far as the the security, the safety and the maintenance in Uptown, 3,000 of trash is is is a big number and we're excited.'",
        "'speaker_1': 'The Uptown Renaissance, we've heard these words and it's all happening. We are we have some great developments that are coming. We do have some that are here, I should say the Michelle Obama Neighborhood Library. We partnered with Council District nine and Long Beach First and our Foods, the Business Improvement District.'",
        "'speaker_1': 'We were able to create our learning garden at the Michelle Obama Neighborhood Library, and it is for the community to come and take some of the fruit and vegetables that are there. It's a nice garden. We have tomatoes and strawberries grown right now.'",
        "'speaker_1': 'We'll into strawberries. And the Conservation Corps has been trained on how to maintain this beautiful garden. Also, it's available to for classes. I'm moving along community. We have amazing developments that are happening throughout the business Uptown Business Improvement District.'",
        "'speaker_1': 'We have coffee shops coming. We have a financial institution coming, a neighborhood brewery, sit down, restaurants and much more. And we're going to be seeing a lot more of these grand openings happening. We have businesses that are coming to North Long Beach in the Uptown Business Improvement District.'",
        "'speaker_1': 'And when businesses come, we have an increase in jobs and that's always wonderful. At this time, I'd like to say thank you to Vice Mayor Rex Richardson and the city staff for the facade improvement funds which have been given.'",
        "'speaker_1': 'One of the developments that we've done is El Pollo Imperial, which is there. That's what it looked like before. And this is what it looks like now. Nice renovation to that that business improvement district. It's a major it gets a lot of traffic there.'",
        "'speaker_1': 'So this is one of the many improvements. We also have Robert Earl's Barbecue, which is our first sidewalk extension and patio dining in the Business Improvement District. So it's a little look of what it looked like before. That's the sidewalk extension.'",
        "'speaker_1': 'And this right here is the outside dining patio, which is right there is absolutely gorgeous. And we're about to enter our third phase where we're going to do a complete facade improvement for the majority of the block. So these are some of the things that we've been doing with the funds.'",
        "'speaker_1': 'There's a lot and there's Robert Earl right there, a lot of improvements throughout the Business Improvement District. With one time funds, we were able to bring on a creative consultant, Ryan Smoller, who helped secure a grant. He's been helping with programing and media exposure, social media exposure and developing ideas for the bid.'",
        "'speaker_1': 'One of the some of the funds also went towards our new office space. We had to move because our building that we're in, city property is in the process of being sold. So we were able to move and we had a nice event up there in the business district and we created the first co-working space in North'",
        "'speaker_1': 'Long Beach, which is it houses the bid and this is what it can look like, a shared office space for those individuals that may want to save some money and just have a space. Co-working space is the way to go.'",
        "'speaker_1': 'Very inexpensive. This is our grand opening. We had a lot of community members that came up to support us and take a peek. We have a couple of renters and we have more space available. Got some awards for that.'",
        "'speaker_1': 'That's the team. And once again, we're excited about what's happening in Uptown and excited about what's to come. If you're ever in North, the Long Beach, Uptown Long Beach, come and take a peek. Give us a call. Visit us at uptown Long Beach dot com and thank you all.'",
        "'speaker_1': 'And we're available for any questions.'",
        "'speaker_8': 'Thank you, Tasha. And so I'll be the first to say it's the Uptown Business District. Is has come a long way. I remember was just a twinkle in the eye of a few people. And and now it's it's clear that we can put our faith in you when we give you and partner with you and give the'",
        "'speaker_8': 'best business district support. You can turn that and transform that into real results. And so I want to just say thank you for coming back to the council and saying thank you and acknowledging that support the council has given you.'",
        "'speaker_8': 'So we're going to go ahead and have comments from the councils. We have Councilmember Turanga.'",
        "'speaker_6': 'Thank you very much, Mary. Wonderful job. This is a great presentation. Keep it up. It's looking wonderful up there.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'Next. Councilwoman Mongo.'",
        "'speaker_1': 'I want you to know how much your success means to other business groups since your original inception. Another group in the city decided that they would come together and work on a business association. And we have two more coming as well.'",
        "'speaker_1': 'So I appreciate you making this presentation from the materials like this really help when we go out and meet with other businesses that are in a geographic area together, they're not necessarily a bid. They do theirs more as a5013.'",
        "'speaker_1': 'But the work that you're doing is really what's important. So thank you for that.'",
        "'speaker_8': 'Thank you, Councilwoman Price.'",
        "'speaker_2': 'Thank you. I want to echo the sentiments and just you have a certain energy that you bring to the work that you're doing there that is really infectious. In fact, hearing you do the presentation made me think how valuable it would be for us if we had a presentation like that from all of our business districts or'",
        "'speaker_2': 'business collaborations in the city, because we we don't get to see the work that is happening in the individual districts unless we have a presentation like this, even if we go to the district. I know I've had the opportunity to meet Vice Mayor Richardson in his district, and he has driven me around in the past.'",
        "'speaker_2': 'But just hearing you kind of summarize everything you're doing is really valuable for me, at least as a council member. So I appreciate you doing that. I love that you're using the Conservation Corps and that you're getting such great, you're getting such a great service that you're able to talk about.'",
        "'speaker_2': 'I share an office with them in East Long Beach, and I'm always trying to promote us, hiring them whenever we can, because they do excellent work and do it with a very great purpose and intent. So I'm glad to hear that feedback.'",
        "'speaker_2': 'The Learning Garden at the library. First of all, though, you know, a lot of times we talk about big projects in the city and sometimes the discussion gets to like, this is only for this district or that district, or just because we don't visit something daily doesn't mean it's not a city asset.'",
        "'speaker_2': 'The Michelle Obama Library is such a sense of pride and joy for all of us in the city, regardless of what district we live in. I mean, it's just phenomenal. Yes. Let's give it a round of applause. And they're open on Sundays, which I love.'",
        "'speaker_2': 'Yes. But I love that you incorporated a learning garden out there because we are trying to incorporate that more into the Long Beach Unified School District Education. And I think we just recently had a chance to go and see it.'",
        "'speaker_2': 'And I'm just so incredibly proud of the work that you guys have done. It's a tremendous source of pride for the city. I'm excited for all the changes that are coming. I want to thank my colleagues who represent North Long Beach for the excellent work that they've done individually and together to make it such a great source'",
        "'speaker_2': 'of pride for the city. And I look forward to you helping them get to that vision in the years to come. So thank you.'",
        "'speaker_8': 'Thank you. Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you and thank you, Tasha, for the excellent presentation. Thank you for sharing it with the city. I've actually lived and breathed this and been a witness to the great work that the bid has done, as well as being an original author with the Cubs and starting the the bid.'",
        "'speaker_7': 'I'm really happy to see where it is today. In in your board, the development of your board. It's a very, very important that that chemistry stay engaged and strong today are our corridor along Atlantic and north. Part of our city is much more cleaner it's safer in the community is is far more engaged than it was just'",
        "'speaker_7': 'a few years ago and in the presence of a business improvement district has certainly paid dividends thus far. I want to just say that I have in the bid has my full confidence and you know, you always have had my full confidence as the manager there and will continue to enjoy that and look forward to working with'",
        "'speaker_7': 'you on projects even outside of the bid. And to Suzy's point, I really appreciate your energy, your commitment and professionalism. You've taken the bid to another level or just in the short time that you have been the manager.'",
        "'speaker_7': 'And it's important to note for the city and city council that the city, because of the former redevelopment agency, the successor agency Properties, is really a major stakeholder in that bid. And, you know, hopefully you in a very short period of time in the very near future, that won't be the case because the properties will be sold'",
        "'speaker_7': 'off and we'll have new stakeholders. But right now I think we are almost a third of the bid. And that's a that's a that's an important point to bring home. So keep up the great work and I look forward to working with you in the future.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Councilwoman Pearce.'",
        "'speaker_2': 'Well, everybody.'",
        "'speaker_9': 'Already said everything, so I have to have a faster finger, but just congratulations, everybody that's doing work in Uptown. It's great to be in downtown and know that we've got great work up there and everything about connecting us in between is really important.'",
        "'speaker_9': 'And just I know, Jim, you nerd out on these things. So also congrats to you. And I'll say lastly again, I mean, I thank you for coming in presenting. I think that I remember when they were looking to hire in your position and I just feel it fills the energy up and it's really exciting to be a'",
        "'speaker_9': 'part of that. And we have a lot of things to learn from what you guys are doing. So thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_8': 'Thank you. Councilwoman Gonzalez.'",
        "'speaker_2': 'Tasha, congratulations. You do great work in uptown. I know we've talked about some policy items that have been very important for small businesses. And I think, you know, in downtown, I think you all have created such an amazing, unique place for uptown.'",
        "'speaker_2': 'And now we're kind of modeling what you're doing in downtown in some ways because we were like, okay, how do we get more creative? So I think you're doing a fantastic job. And someone who has been raised in North Long Beach when I was younger, I am so proud of all the work and all of the residents'",
        "'speaker_2': 'I know and Vice Mayor Richardson and Councilmember Awesome have a lot to be proud of too. So congratulations. Great job, Jim. Always.'",
        "'speaker_8': 'Thank you, Councilman Andrew.'",
        "'speaker_5': 'Yes. And Tasha, I don't think you need any more. Congratulations. What you really need is a consultant's job to come to all the districts and show us how this is done. Congratulations. And you're doing a great job. Keep up the good work.'",
        "'speaker_5': 'Fantastic. You know, you need to start getting paid.'",
        "'speaker_0': 'And that's a thank you.'",
        "'speaker_8': 'Thank you, Councilmember. Super now.'",
        "'speaker_5': 'Okay. From the slowest finger on the dais. Thank you from all of us. And we have two bids and a business association in my district. So I'd like to echo what my colleagues said. We'd love to have you out to demonstrate what you're doing.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'Thank you. So I'll just what we have public I'll say thank you again for coming down that presentation. I do want to acknowledge also, you know, Councilmember Gavlak has been a part of this as well. When she was when she was here, it started as a twinkle in the eye of Steve Neal and Ray goblets and happy'",
        "'speaker_8': 'to continue to support this moving forward. We haven't had anything like this in District nine and to see how far has come has been fantastic. So at this point, I just ask for any any public comment. Seeing nonmembers, please cast your vote.'",
        "'speaker_0': 'Oh, there was a comment.'",
        "'speaker_8': 'Okay. Come on for sir. Thank you, Tasha.'",
        "'speaker_3': 'Hello, Vice Mayor and council members.'",
        "'speaker_5': 'Hi. My name is Enjoyment of. I am a legislative intern for Lena Gonzalez.'",
        "'speaker_3': 'My question is actually directed to you, uh, Councilmember de Andrews.'",
        "'speaker_5': 'I do not live in Long Beach. I do live in Signal Hill, but I do frequent.'",
        "'speaker_3': 'The sixth District a lot.'",
        "'speaker_8': 'So is this related to the Uptown Business District presentation? Yes. Okay.'",
        "'speaker_3': 'I was just wondering, is there any type of development just like that happening in the sixth District, specifically on PCH?'",
        "'speaker_5': 'Not on PCH, but on Anaheim? Okay. We're working on as you as we speak. Okay. Thank you so much, PCH. I don't think so. Yeah. In our business. Well, okay. We'll talk about that and some of that.'",
        "'speaker_8': 'Thank you. Thank you. Members, please cast your vote.'",
        "'speaker_5': 'Toshi, we need to get with him. He wants to know some.'",
        "'speaker_8': 'Go ahead. You got it. And I mean yes obviously.'",
        "'speaker_4': 'On some an Andrews Councilman Andrews okay but here's.'"
    ],
    "Recommendation to request City Attorney to draft a resolution including but not limited to the draft language provided in support of the efforts of the Standing Rock Sioux Tribe and their allies opposing the construction of the Dakota Access Pipeline.": [
        "'speaker_8': 'Thank you. Motion. Okay. Motion. Pass around. Good. Thank you. A little slow. Let's go ahead and have our number 15 clerk please read.'",
        "'speaker_4': 'Communication from Councilwoman Gonzalez. Councilmember Pearce Council member, super nor council member. Your UNGA recommendation to request the city attorney to draft a resolution in support of the efforts of the Standing Rock Sioux Tribe and their allies opposing the construction of the Dakota Access pipeline.'",
        "'speaker_8': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes. Thank you all for being very patient. We appreciate it. And I want to thank my colleagues, especially the colleagues who supported this item, Councilmember Pearce, Councilmember Muranga and Councilmember Supernova. We've all watched the news, of course, over the past couple of months, the Standing Rock, the Standing Rock Sioux Tribe and thousands of people from around the'",
        "'speaker_2': 'country have joined in protesting the Dakota Access pipeline, which would disturb the tribe's water, fresh water supply and over to over 200 rivers, creeks, tributaries, soil and, of course, sacred land. Tonight, with the passage of this item, we will join with many other cities around the country declaring our support for Standing Rock, including Seattle, Saint Louis and'",
        "'speaker_2': 'many others, and telling the federal government that protecting sacred ground and maintaining access to clean water is, is and should be the priority over private interests. And I want to be clear. This protest and fight is not just about oil.'",
        "'speaker_2': 'It is about respect for indigenous communities and respect for the rights of the treaties that were signed with this tribe nearly 150 years ago. Over the weekend, yes. And over the weekend, the U.S. Army Corps of Engineers said it would seek alternative routes for the pipeline.'",
        "'speaker_2': 'And while this is great, certainly it is just a start, but it is not binding at this time. And considering the the approach of the new administration that will take office in a little over a month, we need to ensure that our voice is heard very loud and very clear here in the city of Long Beach.'",
        "'speaker_2': 'And so I think, again, my colleagues, I hope my other colleagues will come in support. I think the community for coming together on this. I heard loud and clear through Facebook and emails, through many of my council colleagues who are really passionate about this issue.'",
        "'speaker_2': 'And some people said, well, why are you why do you even care what's happening in North Dakota? Well, we do care. And there's a lot to consider that may or may not and possibly could happen here in our own home.'",
        "'speaker_2': 'So we have to care about others, don't we? So, again, thank everybody for being here. Appreciate the patience and the time and I hope my colleagues will support. Thank you.'",
        "'speaker_8': 'Thank you, Councilmember Pearce.'",
        "'speaker_9': 'Thank you. Thank you, Councilwoman Gonzalez. And thank you to Sandra Acosta and the rest of the folks who brought forward this resolution and all those that have been active through this. As was mentioned, activists of Standing Rock won a huge victory on Sunday when the Army Corps denied the permit that was needed for the pipeline to undergo'",
        "'speaker_9': 'dam's selection of the Missouri River called Lake Ahu. And I know I probably butchered that name. I'm sorry. This is the result of thousands of committed activists who braved the North Dakota winter to stand up for their rights, their land and their drinking water.'",
        "'speaker_9': 'They were met with disproportionate use of force in substandard freezing temperatures, tear gas, rubber bullets and even grenades. Yet they still remained strong. The Obama administration has sent a strong message that any future projects such as this must take into account serious consideration the impacts that it will have on their communities and our environment.'",
        "'speaker_9': 'Tonight, we're here to celebrate the hard earned victory, but also acknowledge that the fight is not over. With a new administration on the horizon, we must stay vigilant in our support for Standing Sioux Tribe. I ask my colleagues to join me in support of this resolution.'",
        "'speaker_9': 'It's a first step. It's a right step, and it's a step to say that we are connected, whether we're in Long Beach in California or somewhere else, on the anywhere that we have to stand together and we have to support what's morally right and what's the smart kind of policies to move forward.'",
        "'speaker_9': 'And again, I thank you all for your courage. And I implore our council to stand with us tonight. Thank you.'",
        "'speaker_8': 'Thank you. Any public comment on this item? Okay. I'm counting. One, two, three, four, five, six, seven, eight, nine, ten, 11, 12, 13, 14, 15, 16, 17. So here's what I'm going to recommend. We're going to instead of 3 minutes, we're going to go down to 2 minutes.'",
        "'speaker_8': 'And if you and I encourage you, if someone has said the point already, you don't have to reinforce that point. So we can make sure everyone has an opportunity to speak. So. Madam Clerk, please queue up 2 minutes.'",
        "'speaker_8': 'Let us know who you are and go ahead and start.'",
        "'speaker_4': 'Thank you. My name is Gloria. R.A. I am a tongva. I am this land, the Los Angeles Basin for the Channel Islands and our center of creation comes out of Long Beach on the campus of Cal State. Long Beach.'",
        "'speaker_4': 'I have talked to many youth who have returned from Standing Rock, from Southern California, and who have been there. And they are profoundly touched by what they have learned and what they want to give back to the community.'",
        "'speaker_4': 'They had learned that everybody was so generous and helpful to them as they arrived in anything that they needed. But they also said that it was they learned to test or protect, as they prefer by love, nonviolence and prayer.'",
        "'speaker_4': 'And they have been met with terrible violence. Many have been very injured. A woman has is fighting to keep her arm. One woman was shot in the eye and is blind in that one eye and they have no weapons whatsoever.'",
        "'speaker_4': 'Over 2000 vets went out there over this weekend and it was. Very impactful to see that they were that they apologized for what this country has done to the first nation people all across the nation. So I encourage you to support the actions there that they continue in this peaceful, nonviolent, prayerful way.'",
        "'speaker_4': 'And teaching the young people, the elders are leading it with the youth. The youth actually are the ones that started this whole movement and the elders set what is going to happen each day in these camps. And so we ask you to I ask you to support this.'",
        "'speaker_4': 'And, you know, I'm very thankful for everything. And I thank you for your votes. And I hope you will really understand what is going out there, as has been explained by Miss Gonzales. Miss Pierce, thank you very much.'",
        "'speaker_4': 'That was very thorough. Thank you.'",
        "'speaker_8': 'Thank you for your time. Next week, a police.'",
        "'speaker_5': 'He only watched me talk up until I said nope. It shows up at all. Meanwhile, Cody out there to Hawaii where I'm new. How did I march up? Meanwhile, out there to Hawaii, homecoming king guy to hooch, to courage, to wanting you.'",
        "'speaker_5': 'I greet all of you in my native Dakota language, and I want to thank you for listening to us and Councilwoman Gonzalez, Councilwoman Pierce, for leading this. And I think this is very important. Even though Long Beach is a little bit late to the game.'",
        "'speaker_5': 'Seattle, Phenix, Oakland, a lot of the Minneapolis, a lot of the major cities already passed a resolution to support Standing Rock. So we urge you to to support Standing Rock. And one of the things that we asked, too, is that if you support Standing Rock, you have to look Long Beach has to look at their own oil'",
        "'speaker_5': 'addiction, their own. It would be hypocritical for you to pass a resolution to support Standing Rock, but you're benefiting off of oil and fracking, which is destroying our Earth. So if you pass this resolution, that's good and I'll be proud.'",
        "'speaker_5': 'I'm a resident of Long Beach for the past ten years, and I would be very proud to say my my leaders, this Long Beach leaders pass this. But I would be even more proud if you came back and started making changes here in Long Beach.'",
        "'speaker_5': 'And it's not about this pipeline. It's about transitioning to renewable energy and keeping fossil fuels in the ground. So that's the bigger picture. And we have the technology to do that. So I urge you to to look at that look at our own history and how it's destroyed our Earth.'",
        "'speaker_5': 'We want clean water for our children, our young kids here. We want them to have clean water. We want them to have clean air to breathe. So we're looking seven generations ahead. Our great, great grandchildren. What on earth are we going to leave for them?'",
        "'speaker_5': 'So this is important and it's a human issue, not just an indigenous issue, but a human issue. Thank you for your time, sir. Thank you.'",
        "'speaker_8': 'Next speaker piece.'",
        "'speaker_4': 'Mugabe Libya child with all we have here. Took out Angostura local champ, opium sativa. My dear, relatives always like to thank the creator first. My Lakota name is Bear Woman and I do come from Wounded Knee. I was at Standing Rock on October or November 20th.'",
        "'speaker_4': 'When they shot rubber bullets and sprayed our people. Once Sophia's arm. When she was hurt. And Vanessa, we call her blue corn. When her eye was shot out. Those were very hard things to deal with. They're still hard because for my fiancee and I, we knew Vanessa personally.'",
        "'speaker_4': 'But I came here to to ask the. Will you please support the gray Lakota Nation? In the North Dakota Access pipeline. But as you do. Will you please make an amendment? In a to help in a class action lawsuit against the Dakota Access pipeline for violating treaties in Article six.'",
        "'speaker_4': 'Clause to it declares treaties are supreme law. 1781. Is the people's constitution. 1880. Ah, no, let me let me rephrase that. 1787 is the people's constitution. 1871 is the corporation constitution. The class action lawsuit will be based on the 1933 bankruptcy of the United States due to the fact they failed to ratify dialog and notify 564 federal'",
        "'speaker_4': 'recognized tribes regarding this.'",
        "'speaker_8': 'Thank you for your time. We still have a full life and thank you.'",
        "'speaker_4': 'Sorry I took up all your time.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Hello. My name is No Ramirez. I am Artemis now with the protectors of Earth. Mother, I first want to acknowledge the Tongva whose land we are living on. And I hope that we are treating this land with respect and with dignity.'",
        "'speaker_3': 'I am here today to acknowledge and to commend the city of lives for moving forward with this agenda and support of Standing Rock. But I feel that now more than ever. This is the statement that is about to be given or hopefully be given as needed.'",
        "'speaker_3': 'Given the statement that the Energy Transfer Partners issued that evening, the Army Corps of Engineers ordered when they halted the pipeline, they said, and I quote, ETP is fully committed in ensuring this vital project is brought to completion and fully expect to complete construction of the pipeline without any additional rerouting in and around Lake Oahe.'",
        "'speaker_3': 'And quote, I urge the city to issue a strong statement of support because it shows that we are doing our part to shut down that which is a threat to our native land and earth mother in general. And it shows that we as a collective can do our part to avert other pipeline and mining operations.'",
        "'speaker_3': 'Thank you to my thoughts committee.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Hi. Good evening. Council members and staff. My name is Tiffany Chan, representing Green Long Beach. I'm here today to encourage you all to support this resolution and to draft a strong statement in support of the Standing Rock Sioux Tribe.'",
        "'speaker_9': 'Green Long Beach represents and works in each and every district to bring together community members in becoming conscious caretakers of the Earth. And our membership believes that the Standing Rock Sioux tribe, the water protectors in North Dakota and their allies are acting on behalf of the entire nation to ensure the safety and quality of the environment that'",
        "'speaker_9': 'supports us all. And as we said earlier, despite the denial of the permit, the Energy Transfer Partners declared the termination to construct it without any changes. And if constructed as planned, the Dakota Access pipeline will burst and contaminate the drinking water of over 18 million people while violating federal treaties with sovereign nations.'",
        "'speaker_9': 'We resolve resolutely oppose this shortsighted and dangerous greed and all actions that threaten the lives and livelihoods of our fellow human beings and the Earth. We are seeing accounts of pipelines bursting nearly every month in the United States alone.'",
        "'speaker_9': 'And the numbers of green Long Beach stand firmly with the Standing Rock Sioux tribe and their actions against the construction of the pipeline and our ongoing dependance on oil. We trust that the council members can understand this long term rather vacations of oil dependency at the cost of human life and environmental health.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_8': 'Thank you. Next week, Mexican police.'",
        "'speaker_5': 'Good evening. My name is Kobe Sky. I am a principal engineer with the County of Los Angeles, also very proud to serve on the Sustainable City Commission. And I'm here to speak in support of this item, but also to draw an important connection with two other items that are on the agenda tonight.'",
        "'speaker_5': 'The first is the item passed earlier that laid out the strategic plan for the Sustainable City Commission and some of the priorities that we were presenting on behalf of the Commission and the residents that we heard from about the future of Long Beach and how to make it more sustainable.'",
        "'speaker_5': 'And the second is a report that's going to be requested regarding oil and gas operations in the city. Standing Rock is about three key issues indigenous rights and how they're being trampled. Protection of water and climate change. And there are things that the City of Long Beach can do to address those things that would add more meaning'",
        "'speaker_5': 'and impact to the resolution that you're considering tonight. For example, we were recommending, based on feedback we received to move towards 100% renewable energy, that's going to reduce our reliance on oil and gas. It's going to reduce the impacts that we have.'",
        "'speaker_5': 'And not just in extracting oil, which is potentially impacting our water, but also the role that we have in facilitating the transport and sale of fossil fuels of all type, which impacts people from not just the US but even from other countries.'",
        "'speaker_5': 'So we need to address the roles that we have in addressing all of those issues. We can take a resolution supporting the transition from Columbus Day to Indigenous Peoples Day, for example. It sends a message that we want to address all of these issues climate change and indigenous rights and water protection.'",
        "'speaker_5': 'And there's a lot we can do locally to do that. Thank you very much. Thank you for your time.'",
        "'speaker_8': 'Next speaker, please.'",
        "'speaker_4': 'Good evening, everyone. My name is Becky Sanchez. I'm a resident of Long Beach for the last.'",
        "'speaker_2': '13 years, and I'm also Long Beach Unified School District teacher. I wanted to say that I was also there on November 20th night where the violence happened that finally made mainstream media airwaves. And I wanted.'",
        "'speaker_4': 'To let you know that I was not there for violence. I went there to help.'",
        "'speaker_2': 'With the many with Tony School, the children who were there in camp.'",
        "'speaker_4': 'The youngest water protectors who were there.'",
        "'speaker_2': 'I went to help those kids because more than anything, this is definitely about respecting sovereignty. This is definitely about protecting our water. This is definitely about protecting Mother Earth.'",
        "'speaker_4': 'But more than anything.'",
        "'speaker_2': 'It's about protecting our children. Because in the end, they were the one.'",
        "'speaker_1': 'They will be the ones to feel the brunt.'",
        "'speaker_2': 'If DAPL proceed.'",
        "'speaker_4': 'To continue with this project.'",
        "'speaker_2': 'Someone earlier said that this that maybe Long Beach is coming in late. I see. We're coming in at the most crucial time.'",
        "'speaker_1': 'We have the support of Obama, but when.'",
        "'speaker_2': 'Trump comes in, there's no telling what's going to happen. So it warms my heart to know that this city that I love has representatives.'",
        "'speaker_4': 'Here even.'",
        "'speaker_1': 'Bringing this to the table.'",
        "'speaker_2': 'Asking our.'",
        "'speaker_1': 'City to support the first.'",
        "'speaker_2': 'Americans, asking our country to stand up to what the Constitution says is the supreme law of the land. I had nothing, but thanks for you taking the time to consider this, to hear us out and hear the cries of people across the country and.'",
        "'speaker_1': 'Around the.'",
        "'speaker_2': 'World that I met at Standing Rock asking for the same thing.'",
        "'speaker_4': 'Please protect our water. Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Yeah. It's on us. We're showing Phenix and your show. So what did you, me and Sloan and then paper shushing. I said, Hello, everybody. I welcome you with open heart and open mind. I am Cheyenne Phenix. I am a member of the Navajo Nation as well as the Northern Paiute Nation.'",
        "'speaker_4': 'I am also a resident here of Long Beach City and I attend Long Beach City College for the past two years. I sit on the associate student body or the student body government of Long Beach City College as a legacy cultural affairs chair.'",
        "'speaker_4': 'And I also am a part of a club called the Native American Student Association, which started last year. And as a leader within my community in L.A., Long Beach community, I stand with Standing Rock. And I have been doing my part in promoting awareness about this critical issue that as a youth perspective, I am very critical about'",
        "'speaker_4': 'this issue because as a human being as well as we all are human beings, we need water, we need life, and we don't need oil. There are other energy sources out there that are much cleaner than this. I also ask and support the idea of looking at clean, renewable energies for Long Beach because our lives depend on'",
        "'speaker_4': 'it. Our very lives depend on our clean water or clean oil, our clean water and air here, as well as protecting the sovereign rights of our indigenous people as well as everybody else's rights as human beings are human and civil rights that we have here.'",
        "'speaker_4': 'Thank you again.'",
        "'speaker_8': 'Thank you for your time. Next speaker, please.'",
        "'speaker_1': 'And a little taller. Good evening. My name is Natalie O'Neill. I am a.'",
        "'speaker_4': 'Member of the Nikko the Nation. I want to thank Councilwoman Gonzalez and Pierce for their eloquent description of how this impacts the sovereign rights of my ancestors were actually at the sign the Treaty of Fort Laramie in.'",
        "'speaker_1': '1851 for this new nation.'",
        "'speaker_4': 'My uncle ran his horses. Thunder was a former chairman of the Standing Rock Sioux Tribe. So this movement directly affects me.'",
        "'speaker_1': 'I'm a proud member.'",
        "'speaker_2': 'Of the alumni.'",
        "'speaker_4': 'Of Cal State, Long Beach. And so from a personal perspective, having my uncle and my aunt arrested on October 24th for doing nothing more than praying, praying for the young.'",
        "'speaker_2': 'Men and women that were in the.'",
        "'speaker_1': 'Front lines. It affects you personally. It affected us so much. And my husband and I both have successful careers.'",
        "'speaker_4': 'Took our time to go out there to Standing Rock.'",
        "'speaker_1': 'To visit our home. My home lands.'",
        "'speaker_2': 'Which are only a couple hundred.'",
        "'speaker_4': 'Miles up from the Missouri River to.'",
        "'speaker_2': 'See my uncle's ranch.'",
        "'speaker_4': 'Right is just right on the Lake Oahu and see what the potential danger that could.'",
        "'speaker_1': 'Happen if a pipe like that broke, to see the peacefulness that all the people that were there.'",
        "'speaker_4': 'At the camp.'",
        "'speaker_1': 'Were embodying and embracing of people of.'",
        "'speaker_2': 'All nations. And I think a city like Long Beach had always.'",
        "'speaker_4': 'Has historically embraced diversity.'",
        "'speaker_2': 'This type of resolution is absolutely in line.'",
        "'speaker_1': 'With the culture here, in line with what I feel like.'",
        "'speaker_4': 'The vision of the city is, and for it to continue to be a leader.'",
        "'speaker_1': 'Of not.'",
        "'speaker_2': 'Only in California, but also nationwide and worldwide in support of.'",
        "'speaker_1': 'The Standing Rock Nation. So I thank you for your time and I thank you for hearing us out.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_11': 'Let's look at Liam at the chimney maker. My name is Mr. Susheela Aguilera. I'm 18 years old and I'm a student at Cal State Long Beach. I am also a descendant of the Mexica people from Mexico and the Tongva people from here.'",
        "'speaker_11': 'I'm coming to you today, not as a as an indigenous person, not as a student within your city. But I come to you as a human being. A human being who? My language, my ancient languages were taken from me.'",
        "'speaker_11': 'My lands were taken from me. The last thing I have left is my water. Last thing I have left of my resources. The last thing I have left is my life. Thank you for supporting the Standing Rock Sioux in North Dakota, but I ask that you also support the younger people from here.'",
        "'speaker_11': 'I ask that you support the indigenous people from here. I ask that you support the next seven generations of indigenous children who grew up here in Long Beach. I want to be able to take my children to the beach.'",
        "'speaker_11': 'I want to be able to bring them out into the light. I want to be able to bring them to parks without worrying. Well, maybe emissions will hurt my child. Hurt my child. Or maybe the water from Long Beach is so polluted that they can't even play water.'",
        "'speaker_11': 'I was in a history class in which a history professor claimed that American Indians do not exist, that we just came from Asia. And he attributed the Bering Strait theory as a fact. And what I heard there basically was that I have no right I have no right to fight for my water.'",
        "'speaker_11': 'I have no right to fight for my land. But the truth is, I do. And I ask you to do the same. Thank you, Jim.'",
        "'speaker_8': 'Thank you for your time. Next speaker, please.'",
        "'speaker_3': 'Good evening, Honorable City Council. And also special recognition to the Tongva people and other native peoples who are here today. My name is Alex Montana. I live in the sixth district and I'm with the Filipino Migrant Center and the National Alliance for Filipino Concerns.'",
        "'speaker_3': 'On Thanksgiving weekend, I was part of a six person delegation from Long Beach that drove over 1500 miles to stand with the Standing Rock Sioux and other water protectors against the Dakota Access pipeline in North Dakota. We drove for almost 24 hours.'",
        "'speaker_5': 'In a packed car.'",
        "'speaker_3': 'Full of donations and blankets and clothing and prayers and messages of love from Long Beach residents to be donated to the.'",
        "'speaker_5': 'Standing Rock Sioux. But the most.'",
        "'speaker_3': 'Extraordinary part was witnessing the Standing Rock Sioux and other water protectors united to protect what should.'",
        "'speaker_6': 'Be sacred to all of.'",
        "'speaker_3': 'Us water, land and our Mother Earth. We learned a lot that weekend. We were freezing cold, but we felt warm watching the native dancers and elders gather in front of the sacred fire in the camp. We often forget about native women in our society, but it was the Native women who were on the front lines that weekend'",
        "'speaker_3': 'who led a women's march onto the bridge and faced a wall of police and barbed wire to chant, sing and declare that water is sacred and that women are sacred. We are often told that we need money to survive.'",
        "'speaker_3': 'But at the camp, the donation center, the mess hall, the medic tents, everyone was welcome to get free health care, a hot meal and borrowed clothing and blankets. We all survived and took care of each other. I met one Native American artist named Steve Whitehill from the Oneida Tribe who said this was the first time in history'",
        "'speaker_3': 'that almost all of the Native American tribes are united together to protect what is sacred to them water, land and Mother Earth. And that's why I urge City Council to pass this resolution to support Standing Rock and their struggle to protect the water and the land.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hello. My name is Erin. Erin Foley. I reside in the first district. I want to thank my councilperson as well as Councilwoman Pierce. I'm sorry, my friend Janine. I'm a co-founder of a local community organization called the Friendship Neighborhood and a member of the Long Beach Time Exchange, among several other Long Beach community based organizations that seek'",
        "'speaker_2': 'to make our city one that works for all. I love this city that I've called home for the past decade and appreciate having the chance to speak to you. Now, I would like to urge you to pass the resolution in support of the Standing Rock Sioux Tribe, despite there being basically a media blackout, this historic fight to'",
        "'speaker_2': 'protect the water source of the Sioux has invigorated indigenous rights movements, environmental movements and progressive movements across the world. Put simply and straightforward. Pipelines leak, water is life and you can't drink oil. Long Beach should stand on the right side of history.'",
        "'speaker_2': 'By adopting this resolution, we must show that we to see the injustice of moving a pipeline originally set for the white city of Bismarck to the sacred lands of the Sioux. I urge us all to recognize the white privilege that came into play upon the changing of the pipeline designation.'",
        "'speaker_2': 'In such a way, I can't change history and neither can you. But we can acknowledge the wrongs that have been done to the native peoples, by the colonizers, the stealing of land, the terrible genocide, as well as the continued suffering wrought by both historic and current traumas.'",
        "'speaker_2': 'We can choose to lead and do all we can to not continue on that path of destruction. And with this examination of white privilege and our desire as a city to lead with progressive, proactive policies, I urge us to also examine them in the context of our own addiction to unsustainable fossil fuels.'",
        "'speaker_2': 'Urge you to consider the environmental racism prevailing in our own city. What are we doing to move as a city to sustainable, renewable sources? What are we doing to eradicate environmental racism? There are so many sustainable alternatives and we are a city full of innovative creatives and talented entrepreneurs.'",
        "'speaker_2': 'We might not be able to end oil right this very second, but we must strive to meaningfully divorce ourselves from it immediately. I know we can if we want to. So in summary, no more pipelines, no more enslavement to oil.'",
        "'speaker_2': 'And tonight, let us stand as a city in solidarity with the Sioux.'",
        "'speaker_8': 'Thank you so much. Next speaker, please.'",
        "'speaker_3': 'Good evening. Council members and vice mayor. My name is James Swayze. I'm a third district resident and I'm here tonight. This is a very personal issue for me, but also on behalf of our building of the community's Long Beach Steering Committee.'",
        "'speaker_3': 'And here, just to echo the amazing comments that were made here tonight, but also to offer another perspective and I know you all do the right thing and vote for this tonight, but offering and reminding you that actions speak louder than words.'",
        "'speaker_3': 'Right? When we think about the health impacts, then we talk a lot about what happens in the Latino, the African American and the Cambodian community. But often we don't talk about the Native American community here and the large health disparities, the large health inequities that not just in Long Beach, but in communities across the nation and particularly'",
        "'speaker_3': 'in California. When we look at cities like Del Norte in Kern, in Coachella Valley, where a lot of the native community doesn't even have access to fresh cleaning water. So fresh, clean water. Right. So there's a lot that we can do.'",
        "'speaker_3': 'And I think a lot of my community members out here have also made those echoes and calls for action and for us to really look at how do we localize this and how do we move forward on actually achieving health equity because actions like this achieve that and get to that conversation where we can lift up the'",
        "'speaker_3': 'health and safety of everybody. So thank you very much time.'",
        "'speaker_8': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, Vice Mayor Councilmembers My name is Gerald Mangino. My address, 4301 Boyer Avenue, Long Beach. But I am a citizen of this earth. I come here tonight. Obviously, I'm a white man. I have no no Indian blood in me, no, no Native American in me.'",
        "'speaker_3': 'But I do represent a group of scouts and we've been around for over 90 years. And what we've taught our boys is.'",
        "'speaker_7': 'They grew.'",
        "'speaker_3': 'To men, was respect of others in respect of the earth.'",
        "'speaker_7': 'We study the.'",
        "'speaker_3': 'Ways, the laws and the customs of the Native American, because that's the prime example. Before I read something I want to finish with, I want to just say here's a little history on the Dakota Access pipeline. The pipeline was moved from its original crossing of the Missouri River above the city of Bismarck, North Dakota, when objections were'",
        "'speaker_3': 'given regarding the potential for environmental impact. If the line leaked and polluted the area's water supply, it was instead moved to the Standing Rock Reservation lands the Lakota have occupied the this land for the Lakota have been there forever.'",
        "'speaker_3': 'They've been there for our history. It's been their land since we decided to give it to them in terms of our treaty. We acknowledge that they belong there and that they can have those lands and then we take them away, as we've done over 500 times.'",
        "'speaker_3': 'The pipeline's path was moved down Missouri River to the river crossing on the top of the tribal lands. It was done so because there is a lower population concentration. The Standing Rock tribe, that area and a lesser political financial influence on.'",
        "'speaker_8': 'Well, thank you for your time. We still have a number of people speak. Thank you so much.'",
        "'speaker_3': 'Thank you. And thank you for your guide tonight.'",
        "'speaker_8': 'All right. Next speaker, please.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_4': 'Counsel. My name is Anna Kristensen. Born here. Raised here. Still here.'",
        "'speaker_10': 'I.'",
        "'speaker_4': 'My daughter is at Standing Rock tonight. She's. It's her birthday. Her birthday present was a gas mask. I never thought I'd have to buy my daughter a gas mask for her birthday. I'm not doing very well emotionally. It's funny you feel good about the last decision, and then you talk to somebody from the National Office of Historic'",
        "'speaker_4': 'Preservation who said no. They didn't really deny it. They just pushed it further down the line. They they and I said, Are you telling me that they she said, because they were afraid of getting sued. So they're not.'",
        "'speaker_4': 'I said, Are you telling me they weren't afraid of getting sued by the tribe, but they are by the oil company? And she said, that's right. So. So Standing Rock really is as. As the keeper of the white buffalo.'",
        "'speaker_4': 'Pipe said everywhere. And it doesn't really matter what race we are. It does matter if we listen. To our elders. And he also said that the term Mother Earth is not. Symbolic. Gentlemen, please. It isn't a euphemism. It isn't.'",
        "'speaker_4': 'It is our mother. She is our mother. She is not a resource. She is the source. And I'm glad to see the full council is here. Almost the full council. I hope you vote in favor of this. But if you do, we'll be back.'",
        "'speaker_4': 'We'll be back when you have a vote on the Lo Cerritos Wetlands, a project that will allow 120 new wells to be built, built, built on an active earthquake fault in our wetlands, destroying our pristine wetlands forever. We will be back.'",
        "'speaker_3': 'Thank you. Next speaker, please. Thank you. Council. Hello, Mr. Mayor. Tony Taylor, investigative journalist, poet and songwriter. I'm going to take off a political hat. This is not a political speech at all. Nonpartisan. It's about building empathy. For all people who are oppressed, no matter black, white, whoever we are, especially indigenous right now.'",
        "'speaker_3': 'And this is something from Stephen Grumet. And his classic book, American Place Names where the New York Metropolitan Museum now sits. Steven Grumet About building empathy. Young children bound in small cradle boards were stuck pierced in a manner to move a heart of stone.'",
        "'speaker_3': 'Other pieces were cut off and thrown into the fire. So other pieces were cut off and thrown into the river. So when? Parents of the tortured child or children went into the river to save the young children. The parents were trying to do this.'",
        "'speaker_3': 'The soldiers would not let the parents come up onto dry land, making both parents and children drown. That was the murder of peaceful Algonquin Indians.'",
        "'speaker_5': 'In what's now known as upstate New York.'",
        "'speaker_3': 'So when we know about these stories, whether they're the genocide of Native Americans, African-Americans, Jewish Holocaust, any Holocaust throughout history, it helps us to identify with people not from a cerebral point, but more from a spiritual, emotional point, not a Republican political point, Democrat point, but a human point.'",
        "'speaker_3': 'So I just wanted to bring that out so we can see it more from. What Marvin Gaye said, keep a tear in your heart for humanity. And that's my point. Okay. Thank you, sir. Next speaker, please.'",
        "'speaker_0': 'Yeah. I thought I shouldn't be gay in here. Not quite an initial. I can't onyebuchi the agenda. Straight out, another awkward egg on that Latin initial. Hello, everyone. My name's Ewa. I've lived here since August 2011. I love Long Beach, but if someone to tell you that I'm also a member of the Navajo Nation and I don't'",
        "'speaker_0': 'know if you guys know about the, um, the mine spill that happened in Arizona. Although it's not an oil spill, it was. It still affected water source. Many people think I just affected the water. And then it had long term effects on other things.'",
        "'speaker_0': 'One of the things that I had affect on is agriculture. We need food, like we need water. And the Navajo Nation, a lot of Navajo farmers had to temporarily close off their water supply because they got it from the San Juan River.'",
        "'speaker_0': 'Um. I also noticed that we also have a similar situation where water is in jeopardy in Flint, Michigan. They don't really have access to clean water as well. I think it's easy to sit here and think that Standing Rock is an isolated incident away from us when it's not.'",
        "'speaker_0': 'Just a while ago, I saw Councilwoman Susie Price drink something, obviously, that had water in it, correct? Yeah, I had water in it. So it doesn't matter what profession you are, what your career is, who you are, your statuses.'",
        "'speaker_0': 'We all need water. It doesn't matter if you're an archeologist. It doesn't matter if you're a doctor. It doesn't matter if you're a council person. We all need water. So I just wanted to reiterate that fact, and I hope you support this talk in its air, water as life.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hello. My name is Julianne Yolande Gael. I'm a resident of Long Beach. I am not native. I am Ashkenazi Jewish and Han Chinese heritage. And I'm also a construction worker. And I just spent the last three weeks in Standing Rock because as a non-native construction worker, I believe that we need to be building community.'",
        "'speaker_2': 'We need to be supporting treaties and native rights. And we we need to be building renewable energy. And we can do all of those things. And we do not need to be building pipelines that violate sacred rights. And I was there on Sunday, November 20th.'",
        "'speaker_2': 'I got to. Be out there in in subfreezing temperatures as water cannons were being shot at us. And for people living in tents below freezing, that that's pretty much a death sentence. If we didn't have the the medics and the healers to support all the people.'",
        "'speaker_2': 'One of the people in my camp was handing out hand warmers when she was shot multiple times with a water cannon. People in my camp were shot point blank with rubber bullets. For praying, people in my camp were arrested on their knees, hands in the air, praying, and then put in dog kennels with numbers written on their'",
        "'speaker_2': 'arms. And even with all of that, the core Lakota value of generosity and. And that spirit was present. Just a few days later, the International Indigenous Youth Council saw that the Morton Sheriff County, the, the main law enforcement there, even though they had just received $10 million in loans to continue hurting and oppressing, these people, had put'",
        "'speaker_2': 'out a request about how they need donations for hand warmers and all of that. And the Indigenous Youth Council said, okay, we are generous, we will fulfill every single thing on your donation list. So this is the kind of nonviolence and spiritual generosity that we can support as as Long Beach.'",
        "'speaker_2': 'And I hope you will support this resolution. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please. Looks like this is our final speaker. We'll close the speakers list, so please.'",
        "'speaker_4': 'Thank you. I'm Patricia Chen with Long Beach 350. And I just want to say that I'm very much humbled by the speakers that went before me. Long Beach, 350, supports the proposed resolution for Standing Rock. We would very much like to see oil and gas left in the ground so that there would be no need for pipelines'",
        "'speaker_4': 'that threaten water supplies and degrades sacred burial grounds and no need for fighting dogs and water cannons and freezing weather. Here in Long Beach. We can do more than just a resolution. Um, under item 16, I'll talk about oil and gas operations, but at this moment, I just want to speak about, um, the opportunity to change Columbus'",
        "'speaker_4': 'Day to Indigenous Peoples Day. This is an important step forward that we can take in recognition of the importance of our First Nations. Hopefully, it will lead to more and greater steps reflecting greater respect for indigenous peoples and lands.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Thank you so much. Going to bring this back behind the the council. So council member super now.'",
        "'speaker_5': 'I'd just like to thank all the supporters for being here tonight, and especially to the speakers. I'd also like to recognize someone who didn't speak tonight. That's Craig Stone from Cal State, Long Beach, right here in the front row, and also to Jake Heflin from the Long Beach Fire Department who could not be here tonight.'",
        "'speaker_5': 'I think he's teaching a certain class. But for those who don't know. Last month, city council for the very first time celebrated Native Heritage Month. And Jake and Craig were instrumental in putting that together and moving forward. The three of us are working on a new project and I will be bringing to council in the very near'",
        "'speaker_5': 'future a proposal to create a native heritage commission for the city of Long Beach. Thank you.'",
        "'speaker_9': 'Councilmember Pearce I just wanted to close with just a very big thank you gratitude for coming and sharing your stories and your travels. I think it's really important that we continue to hear those, not just at times when we have something on council.'",
        "'speaker_9': 'And so I implore you guys to work with our history departments, at our colleges, with the society here, the association, and continue to share those stories. So and also, don't worry, there'll be there'll be items coming down the road.'",
        "'speaker_9': 'Okay, guys. Thank you, everybody.'",
        "'speaker_3': 'Thank you. I know I wasn't able to join much of the conversation. I just want to say something briefly for those that I did hear. They had a chance to hear that we're here. I want to thank you.'",
        "'speaker_3': 'If you were over at Standing Rock and you had a chance to participate in really incredible show of strength and support. I've been following it pretty closely. I've been pretty vocal on social media and in other venues about my support, of course, for the native people there and for the work that was happening.'",
        "'speaker_3': 'And while I think the Army Corps and the President obviously did did the right thing, all of the credit really goes to the Native people and all the supporters and the water protectors and everyone that did such a great, really outstanding job over there.'",
        "'speaker_3': 'And so so thank you. Thank you for those that were out there. Thank you. Those that are here in solidarity to all of your other brothers and sisters, this is was a really important issue that I think brought a lot of awareness also, I think, across the country, which was really great to see.'",
        "'speaker_3': 'And so I appreciate this and I appreciate Councilwoman Pierce, who had mentioned to me she was bringing this forward. I'm a strong supporter of this resolution. I think it's the right thing for the city to do. So thank you.'",
        "'speaker_3': 'And with that members, please cast your vote.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to declare the City-owned property located at 6101-6141 Atlantic Avenue, Assessor Parcel Number 7125-036-900 (Subject Property) as surplus, authorize City Manager, or designee, to execute any and all documents necessary, including a Purchase and Sale Agreement, with Amusement Industry, Inc. (Buyer) for the sale of the Subject Property in the amount of $655,578, and accept Categorical Exemption CE 16-273.  (District 9)": [
        "'speaker_3': 'Great names. Congratulations. We're going to have just had a request to quickly hear item 19 and then we're going to go to 14.'",
        "'speaker_4': 'A report from Economic and Property Development Recommendation to declare the city owned property located at 60136141 Atlantic Avenue as surplus and authorize the city manager to execute all documents necessary with amusement industry for the sale of the subject property in the amount of $655,000.'",
        "'speaker_4': 'District nine.'",
        "'speaker_3': 'Vice Mayor Richardson.'",
        "'speaker_8': 'Proud to support this. Encourage my colleague support. This is the first development project to move forward in District nine North Long Beach. Thanks.'",
        "'speaker_3': 'Councilman Mongo.'",
        "'speaker_1': 'I think this is a great idea.'",
        "'speaker_3': 'Thanks for any public comment on this item. Please come forward.'",
        "'speaker_5': 'Mayor Garcia. City Council Members Jim McCabe. Many redevelopment properties have been sold in the city of Long Beach for less than the highest bidder, and I think that's sometimes justified. However, when that's done, I've looked at quite a number of them on the agendas.'",
        "'speaker_5': 'The City Council is never told what the highest bidder is in this. This case really has the potential, and I'm not saying it exists, but potential for a kind of corruption that the citizens should not tolerate. The property was appraised for a value of $1.2 million.'",
        "'speaker_5': 'The management proposes to sell for about half of that to the developer that has left the property next to it. Go derelict. How can the best use and the best sale of this property be to a property owner who has let this happen to his property?'",
        "'speaker_5': 'And when we're getting less than half the appraised value. I challenge any council member here. To ask, and almost certainly this won't happen. But I challenge them anyway. I challenge someone to ask what the highest bidder, what the highest bid rather was, how much was bid for this property?'",
        "'speaker_5': 'The City Council is in no position to make an informed decision on any of these sales. If it doesn't know what the highest bidder was, no well-run organization would operate that way. I. Earnestly ask you to consider this advice.'",
        "'speaker_5': 'As I've always said, my view of a council member is job is to ask questions. This is not a council, I think, renowned for that, but it does happen. Someone ask how much the high bid was. Thank you very much.'",
        "'speaker_3': 'Thank you. Any other public comment? Seeing no other public comment. Go back to the council. Vice Mayor Richardson.'",
        "'speaker_8': 'Sure. I just want staff to just walk us through a little bit of this project as brief as you can.'",
        "'speaker_3': 'Sure. I'll turn it over to Catherine.'",
        "'speaker_5': 'McDermott, who is our interim director of economic development and Property Services.'",
        "'speaker_2': 'Thank you, mayor and council members. I'll just go through this really quickly. This is just a.'",
        "'speaker_1': 'Map of the.'",
        "'speaker_2': 'Property, both the city owned property, which is vacant and the privately owned property. The property to be sold was categorized as future development in the long range property management plan, included in the guiding principles of that plan or disposition strategies, which include providing priority opportunities for acquisition and development to adjoining landowners, tenants and other businesses and business'",
        "'speaker_2': 'owners within the Redevelopment Project area. Accordingly, we solicited an offer from the adjoining owner Amusement Industry Inc, more commonly known as Westland Development, which would include development of the city's property as well as redevelopment of his owned property.'",
        "'speaker_2': 'The purchase price is $655,578. It is less than the fair market value of the property. However, as contemplated by the long range property management plan, it's an opportunity for us to take an under-performing retail center owned by an adjacent property owner and make it more compelling.'",
        "'speaker_2': 'The development plan includes 10,610 square feet of new office space, retail and restaurant space, as well as new community open space. So we are asking the council's approval of this purchase and sale.'",
        "'speaker_8': 'Thank you. So I'll just say what? What's probably most special about this project is that the city only owns one half of the block and the adjoining property owner has come forth and is willing to make deep, dramatic improvements, creating a full city block of development.'",
        "'speaker_8': 'No, no other project do we have that type of leveraging in our redevelopment properties to to now we will have a full city block of development, signalized intersections, amenities that we simply do not have in North Long Beach.'",
        "'speaker_8': 'And I'm really excited about this project end to end. And what I would say is I don't there was us, you know, there was community engagement and community meeting here where the residents came to the table, talked about their highest and best use and needs for this project.'",
        "'speaker_8': 'And I am I am just, you know, having, you know, been a part of the city family for almost seven years. I've never seen anyone take this type of development approach in North Lobby. So I stand behind this wholeheartedly and I encourage you to ask some better questions.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Okay. Thank you. There's a motion and a second. Please cast your votes.'"
    ],
    "Recommendation to request City Manager to prepare a study session for the FIS Customs Facility to be heard at the City Council Meeting on December 13, 2016.": [
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': 'Okay. Thank you. We're now at item 14.'",
        "'speaker_4': 'Communication from council member your INGO Councilwoman Price council member super non recommendation to request the city manager to prepare a study session for the Customs facility to be heard at the City Council meeting on December 13, 2016.'",
        "'speaker_3': 'Councilor Maria Ringo.'",
        "'speaker_6': 'Thank you, Mayor. First of all, I want to thank my council colleagues, Suzy Price and Councilmember Gareth O'Connell, for staying on to this item. Thank you for your support. And I want to thank the residents who are here this evening and those who are not here who but sent in emails and phone calls communicating their ideas on'",
        "'speaker_6': 'this issue. I have been listening to your concerns about the timing of this issue and also about the fact that they want their voices heard and they're not here because of the holiday season. I strongly believe that we should not be voting on this item this week or next week, that we should hear it first as a'",
        "'speaker_6': 'study session. It's always important that when we deal with items such important, such as this, that we have a study session. First, give the opportunity for our public to state their case, to give their ideas and voice their concerns about any project, whether it's this one or that we did with the Civic Center and other items that'",
        "'speaker_6': 'come before us that they should have an opportunity to to share their thoughts. I would also like to say that we had four community meetings to commission meetings, and we had a great extensive dialog on this. However, it has not been presented as a study session to the City Council as a whole, and that's important.'",
        "'speaker_6': 'Given the large community interest. I encourage and ask that my colleagues discuss this item as a study session in lieu of hearing it as an action item next week. Please give this item the opportunity to be heard, to have questions answered, and to receive additional testimony prior to a vote of the City Council.'",
        "'speaker_6': 'I had an opportunity to review the report. I still have many questions regarding the report and the recommendations that are made in it. And I also want to ensure that my council colleagues do the same and that they all should be given the opportunity to hear the staff report as we study session, develop the questions and then'",
        "'speaker_6': 'come back in January for further consideration. Thank you very much.'",
        "'speaker_3': 'Thank you. The second there was councilman.'",
        "'speaker_1': 'So I. I read the item a bit differently, and I'm in support of this motion because under the way that I read it, while I had hoped we would have a study session tonight so that we would have that time and that gap, I know that originally there was some concern that there might be a council member'",
        "'speaker_1': 'who admits, and then there were some back and forth. So I appreciate that this item was scheduled. But does the motion currently say anything about and supportive of a study session? And my understanding of the item is that we're going to do it next Tuesday.'",
        "'speaker_1': 'Wonderful. I'm supportive of that. Thank you.'",
        "'speaker_3': 'Councilman asked the.'",
        "'speaker_7': 'Yes. Thank you, Mr. Mayor. And I want to thank Councilmember Urunga and the rest of the council Price and Supernova for bringing this item forward. And I will just say that I will be in support of this item.'",
        "'speaker_7': 'I think it's a it makes a good, logical sense to to hear the study session or have a study session before the city council. I know we had at least two other study sessions from Jacobs Engineering, one before the Airport Advisory Commission and the other before the Economic Development Commission.'",
        "'speaker_7': 'I attended at least one of those study sessions, and I know at least a couple of my colleagues were able to do it. But I'm not sure and I'm pretty sure that all nine city council members did not have that opportunity.'",
        "'speaker_7': 'I think it's from a from a fairness process, due process standpoint. It makes a lot of good sense for us to have a study session here, more for the council to make sure that, you know, we get the the the information and we are making informed decisions.'",
        "'speaker_7': 'The Jacobs engineering study was close to 700 pages. I have toiled through most of that, actually, the entire study, and I'm on going on my second pass at this point. I would encourage all my colleagues to look at that.'",
        "'speaker_7': 'And if the public has not had an opportunity to read that full study, to read that as well, I want to make sure that this council and I think your council member, you his motion actually accomplishes that. Make sure that we are we are fully informed before we make a very, very critical decision.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman Pryce.'",
        "'speaker_2': 'Thank you. I want to thank my colleague, Councilman Ranga, for bringing this forward. I know that it's very important to him that the community have an opportunity to weigh in and also that council make this decision completely mindful of all the questions that might be raised by members of the community or our fellow council colleagues.'",
        "'speaker_2': 'I appreciate that. I have to read the report. I haven't read all of the appendices, although I did read Appendix H and I've worked closely with staff to answer several of the questions that I have. We've also been inundated in terms of our council office with telephone calls and emails over the last two weeks.'",
        "'speaker_2': 'It looks like we received 69 emails in favor of moving forward to asking that we not vote immediately or vote no on it and for asking for a delay. So we've definitely engaged our community. I signed on to this item because as my colleagues now, and I think it's just inherent in my nature, I probably would never'",
        "'speaker_2': 'object to an opportunity to be educated further on something and learn more. So I think having a study session is good. And and also the way I read the item is that we can have a study session and that we need to have a study session before we're to vote on this item.'",
        "'speaker_2': 'Whether that happens at the next meeting or in the future. That is up to the council. But that's how I read the item and that's how I read it. When I signed on to it. So I appreciate the intent behind the item and look forward to hearing from my colleagues.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilwoman Mongo.'",
        "'speaker_1': 'And just to get a point of clarification, I know that I was able to watch the economic development presentation related to the Jacobson study. Is that still available online for any member of the city council to watch and including the public comment and community input?'",
        "'speaker_5': 'Yes, it should be on the register.'",
        "'speaker_1': 'Okay. So I know it had been. And so I encourage people to watch it immediately because I also think that if you have those questions, are we able to submit those questions to Mr. Mayes so that we would be able to have answers to our questions at any time?'",
        "'speaker_1': 'Because I know you answer my questions any time a resident brings up a an idea that I think we need to explore that I hadn't yet heard a response on.'",
        "'speaker_10': 'As Councilwoman Mongo, we try to answer all those questions as soon as we can, and if we can't answer them, we work with airport staff to get answers for you.'",
        "'speaker_1': 'So people can continue to ask questions. The comment is not open for next Tuesday. I'm sorry. Yes, for next Tuesday. Yet I hear it's only open 72 hours in advance. But that's our standard policy.'",
        "'speaker_5': 'I think that simply looked at the city clerk who runs that system to give us some input on that.'",
        "'speaker_1': 'So the agenda item.'",
        "'speaker_5': 'At 72 hours to go as he comments is enabled Friday around Friday at 430. So Monday, Tuesday at 4:00.'",
        "'speaker_1': 'I would like to add a friendly as a second day of the motion.'",
        "'speaker_3': 'She's got a friendly.'",
        "'speaker_1': 'As a friendly to this item because I'm supportive of additional public input. Would you be open to opening public comment as soon as feasibly possible from the city clerk's office so that people who are emailing our offices could engage with each comment?'",
        "'speaker_1': 'So it's all part of the public record and available to all of us at the dais during the night. So should those questions need to be answered on the standard policy that maybe we need to look at as a city is only 72 hours in advance, but I think that this item is of great importance.'",
        "'speaker_1': 'And I'd like to ask that we ask the city clerk to open that you comment if this item passes.'",
        "'speaker_6': 'I was back when I was talking to my chief of staff. I was asking that very question. Perfect. And in regards to making availability for access to two comments, there have been many, many emails already that are available for you to review on the website, if I'm not mistaken, with the airport airtight.'",
        "'speaker_6': 'So that's already there and I would certainly agree to that. Mean, I think it's important that that individuals who will not be able to here to be here, but are viewing it and would want to comment on it.'",
        "'speaker_6': 'Absolutely.'",
        "'speaker_1': 'And then look on our legislator, typically it seems like there's a back end where it says the number of items that have come in for against.'",
        "'speaker_2': 'Or.'",
        "'speaker_1': 'General comment, those are not typically activated. Is there a reason why that could not be activated for this item?'",
        "'speaker_3': 'We don't use that feature.'",
        "'speaker_1': 'Do we? Paid for it. Is it available.'",
        "'speaker_3': 'That. I'm not sure.'",
        "'speaker_1': 'Okay. Then I will wait and hear how that works because I see it on my register, but I see 15 public comments on an item or two and the little green and the little red don't ever change. So just a thought.'",
        "'speaker_1': 'If we're paying for a service we should utilize.'",
        "'speaker_3': 'Thank you. And next up, I have Councilmember Supernova, please.'",
        "'speaker_5': 'Thank you. I have a history on this particular issue. It goes back to last summer. I've been on the public record as opposing anything that comes to city council during the holiday season. Ironically, the press telegram, who I believe supports the office, agrees with me on that issue.'",
        "'speaker_5': 'So I'd like to quote Press Telegram editorial board from August 18th. Says Supervisor, right, in wanting enough time to have quality committee meetings before final action is taken by the council. The timetable should work as long as there aren't delays, which would push the issue into the busy November December holiday season when decisions on major issues like'",
        "'speaker_5': 'this are difficult to make. That's from a supporter of the FISA. So I would like to introduce a substitute motion. That we put off both the study session and the vote until after the new year.'",
        "'speaker_3': 'There is a substitute motion to put off both the study session and the issue coming before council, the one that comes from staff till after the holiday season. That was at the last part after the first of the year.'",
        "'speaker_7': 'I'll second.'",
        "'speaker_3': 'That. So there's a motion and a second to put them both off after the first of the year. That's the motion on the floor. I'm going to continue going down the line, councilman, or anything else.'",
        "'speaker_5': 'Yeah. I'd like to reserve further comment till after we hear public comment.'",
        "'speaker_3': 'Okay. Thank you. Councilman, do you want to go now or you want to go to a public comment first? Okay. Why don't. Clarifying question. Sure. Councilor McGovern.'",
        "'speaker_1': 'City attorney. The vote today is on when we do a study session. Or it was, but now it's not. But if we approved the study session. Well, I guess they should go back a step. If Councilmember Supernova's item was not approved.'",
        "'speaker_1': 'The vote next Tuesday would only be. Could you clarify what the vote? It's the scoping, which is not the yes or no on whether or not we're going international. I guess I just want people to know that the vote that we're taking either tonight or next Tuesday, depending on what series of items fail or succeed, tonight is'",
        "'speaker_1': 'not the final vote on whether or not we're having an international terminal. I think that that. Could you provide some clarity that.'",
        "'speaker_10': 'That's absolutely correct, as I understand it. And if there are no further substitute motions, if Councilman Supernova's motion were to pass the entire matter, that is the study session and any vote up or down on CFIUS would be postponed until after the first of the year.'",
        "'speaker_10': 'That is until January or until sometime in 2017. If that motion fails, we go back to the original motion, which is to conduct a study session next Tuesday in front of the Council regarding the FISA.'",
        "'speaker_1': 'And currently on the agenda.'",
        "'speaker_6': 'I want to clarify though, if there will be a study session, but no vote taken that evening.'",
        "'speaker_1': 'I don't read the item that way.'",
        "'speaker_10': 'Well, almost the motion.'",
        "'speaker_3': 'Let's hold on 1/2. So let me just just I just want to get a lot of people lighting up here. Okay. I want to clarify where we are. It's very important. So just to be very clear where we are right now.'",
        "'speaker_3': 'There's a substitute motion on the floor by Councilmember Supernova, and the substitute motion essentially postpones any study session or initial staff discussion or and or vote on the FISA issue until after the first of the year. That's the study session that that is that is a substitute motion currently on the floor.'",
        "'speaker_3': 'Correct. Okay. And if if that motion were to move forward, then that happens after the first of the year, if it were to fail. Let me go back to the original motion, which is the motion by Councilmember Durango, seconded by Councilwoman Stacy Mango, which is to have a study session next Tuesday, which still does not preclude the'",
        "'speaker_3': 'council from moving forward on the staff driven motion on Tuesday night, or it could be postponed next would depend on the council decision then and of the friendly amendment that you made about allowing the comments to open up as soon as possible.'",
        "'speaker_3': 'So those are the two motions on the floor. Are there any other clarifying questions on that?'",
        "'speaker_1': 'So so just so we're clear, as I read the press telegram, which I support, Councilmember Supernova and that opinion that the vote shouldn't be taken during the holidays, that vote is not being taken during the holidays because we as a council cannot vote on the international terminal right now because we have a current currently we don't have'",
        "'speaker_1': 'enough information. We don't know the size, scope, cost, any of those things because several months ago, this council made an action to not allow the city staff to talk to any tenants about anything. And so. We don't have the information to take that vote.'",
        "'speaker_1': 'And that vote would take place in January. Correct. After staff, should you get direction? Potentially next week. You would then bring that back. Sometime in the new year, not even necessarily in January, but potentially January, February, March? Who knows?'",
        "'speaker_1': 'I'm confused.'",
        "'speaker_3': 'Mr. Mays, do you want me to explain it or do you want to go ahead?'",
        "'speaker_1': 'Oh, I'm clear. I'm hoping Mr. Mays will explain what he explained very clearly in my office earlier to the public and other members of the council. But thank you.'",
        "'speaker_3': 'Mr. Mays.'",
        "'speaker_10': 'So as it stands right now, we have a motion on the floor that would continue the entire matter until January of next year or after January, but no sooner than January of next year. That would be a study session and an action item to direct city staff to take next steps that would be put off until after'",
        "'speaker_10': 'the first of the year. If that motion were to fail, we go back to the original motion, which is to conduct a study session next Tuesday. And as I understood the motion from Councilmember Durango, as he explained it, his intent is only to have a study session session next Tuesday.'",
        "'speaker_10': 'I think possibly some of the confusion is that already submitted to the city clerk is an additional staff driven item also set for December 13, which actually would, if it were, if the staff recommendation were passed that evening, would direct city staff to take next steps.'",
        "'speaker_10': 'And that next step would not be to approve the office facility. It would be to, in essence, direct staff to engage with the applicant, JetBlue, to get more details on what their proposed project would actually look like and what the financial ramifications of that project would be, both for JetBlue and the city.'",
        "'speaker_10': 'So conceivably, if we end up with the original motion, the study session could take place. And as long as that city staff driven council letter remains in place, an action item would be on the agenda that would direct if past staff to move forward with a next step, but not approval of the office.'",
        "'speaker_1': 'Wonderful. Thank you. That's exactly what I needed to hear.'",
        "'speaker_3': 'Great. Thank you. Let me go back to Councilman Pearce. Do you want to go to do you want to go ahead and go or go? Do you want to go now? I'm sorry. No, absolutely. Go ahead.'",
        "'speaker_9': 'I just want to echo something that you said that's very important. If we did take a vote next Tuesday. That vote is not. We're opening up a customs facility tomorrow. That vote is to have staff work with the applicant.'",
        "'speaker_9': 'And that that itself is not necessarily a final approval of a start of a terminal. I mean.'",
        "'speaker_10': 'That that's absolutely correct, because even if you direct staff to take the next steps before the city council could approve any office facility, there'll also have to be a lot of other work done, including an environmental analysis that would be necessary for any final approval by the City Council.'",
        "'speaker_9': 'Thank you so very much for that. And I will hold my grandstanding for later.'",
        "'speaker_0': 'Thanks for your announcement.'",
        "'speaker_3': 'Okay. So let me let me go. So request to go to the public comment on this. So please come forward. Everyone, if you're going to speak, please come forward to the podium. Thank you. My goal is working with.'",
        "'speaker_3': 'There was two motions on the floor right now, the substitute and the original Reykjavik.'",
        "'speaker_1': 'I am I am so angry right now. I had 3 minutes of comments and suggestions to make to you. But Mike, I can't believe that you just shared that with them. And I cannot believe that you're falling for the emotion next week.'",
        "'speaker_1': 'If you pass this, this will be the same thing that happened with the Civic Center when you were just coming into office on Don't Look at me like that, Stacy and Mock Me. Shame on you. You know you're supposed to be representing your people, don't.'",
        "'speaker_3': 'You, Councilwoman? Let's please continue with the public comment. Oh, thank you.'",
        "'speaker_4': 'Okay, so question Susie, you.'",
        "'speaker_1': 'Said you had 69 for 22 against it and four to delay it. I'm going to guess only guessing that the 69 four came from the JetBlue club members. I don't know if you know that or you don't know that.'",
        "'speaker_1': 'And to say the next steps, again, I have to say to say the next steps means that that plane has left the gate. Okay. Please do not do that. Please move this to the other side of the holidays so that all of your constituents, those for it and opposed to it, will be part of this most serious'",
        "'speaker_1': 'development in this city. You are about to impact so many neighborhoods that have been fought for for decades. I'd also like you to include, if you will, that the that the study session when if and when you do have it or when you do have it.'",
        "'speaker_1': 'That includes the invited testimony of former Long Beach Airport Advisory Commissioner Doug Halbert. Doug is our elected city prosecutor, and he previously served as a contracted city attorney for multiple area cities. He deserves an invited opportunity to be heard and to speak more than 180 seconds to answer your questions.'",
        "'speaker_1': 'Based on his very important testimony in February 2015 that he gave to the Airport Advisory Commission, Mr. Halbert told the AEC that, in his opinion, allowing international flights could increase the risk of a potentially catastrophic challenge to our noise ordinance.'",
        "'speaker_1': 'Yes, the city attorney's office holds a different opinion. That's fine. It simply means that both you, as our decision makers and the impacted public, should hear and be subject to some scrutiny. Both sides and opinion being heard. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'John Slattery. Addresses on file. I think the big hope here and I think it was Councilman Price said, is I myself have not even had a chance to get through this thing. It's it's big. I don't know how many of you have you guys have staff?'",
        "'speaker_5': 'I don't. I think the ability for us to actually have a true study session, that's for the public. And I would also hope that you guys have a true study session. I was at the economic development. That's not a study session.'",
        "'speaker_5': 'That was just basically a presentation just from the stuff I've seen within there. This document is not complete. And I think really when you look at it, you know, it's already been said is if we didn't do this feasibility study, we're going to be sued.'",
        "'speaker_5': 'And now I'm starting to hear also that even if we say no after the feasibility study, we'll probably be sued. I think the city needs to take a stand. This is our airport. We're going to set up the way we want to set it up and that we should not be kowtowing to one business or I should'",
        "'speaker_5': 'say one customer. In 2001, I think was when they came in, they promised, hey, we gave them all these slots and they promised, we're going to fill it up to this day. They have yet to be able to utilize all those slots.'",
        "'speaker_5': 'Why are we going to put our the airport itself at financial risk when they can't fill up those international slots? But I so again, I just hope that you guys move this into the next year so that we as a public have a chance for a true study session with questions and answers and that you guys look'",
        "'speaker_5': 'at this as a true study session with questions and answers, not just a presentation of what's there. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please. Is there any other public comment or just my last one, please? Your last one for the night? Gerald Meneghini. No. I'm presently sitting on the Long Beach Airport Advisory Commission and have as such for eight years now.'",
        "'speaker_3': 'I was there when Doug Halbert made his presentation to us and I did hear what he had to say. As I have heard what's been said over and over for 20 some years, that we are always going to be facing a threat of somebody coming in to challenge it for one reason or the other.'",
        "'speaker_3': 'What I'm hearing from everybody so far tonight and gee, it was a short line was is that. I think rather than delay we're talking about. They don't want it. They don't want it. Please, not in our neighborhoods, please.'",
        "'speaker_3': 'No international service for Long Beach. And I think that's an unfair assessment of the situation. I think at this point that what we need to do is carefully listen to everything. And and I take real umbrage with the fact that the information in that 679 page book, that presentation has been available since October.'",
        "'speaker_3': 'It's been out there. So when are we going to finish reading it and when are we going to get down to studying it? And that's all I ask tonight, is that you consider studying it because what better thing to do on that holiday weekend than to curl up with 700 pages of a FISA feasibility study?'",
        "'speaker_3': 'So again, I said I am a sitting member of that commission. But tonight what you're hearing are strictly the rants of a citizen and a resident of Roberto around his council district. I thank you for your service. I think you'll always do the right thing, and I think we owe it at this point to make a make'",
        "'speaker_3': 'a choice to go forward and to learn more. Thank you. Thank you. Next speaker, please.'",
        "'speaker_2': 'Hi. Laurie Smith, third district. I do not I'm not impacted by the airplanes coming in to the airport, as Jerry mentioned. And I attended the airport advisory commission meetings. I'm concerned, as I spoke to you early about the airport advisory chair and vice chair and their conflict of interest issues that have been filed with the California Fair'",
        "'speaker_2': 'Political Practices Commission and the L.A. County DA's office head Deputy Public Integrity Division. The Airport Advisory Commission is seeking to recommend to City Council to build a customs facility at the airport where they have a financial interest. And this could possibly impair the motivation of the entire commission.'",
        "'speaker_2': 'As I mentioned you, the city council have appointed the Airport Advisory Commission members and advise you and they advise you regarding airport related issues so that if there is a conflict of interest that is found with the two entities I mentioned earlier, when you the council, the city council itself will then be in jeopardy of your integrity'",
        "'speaker_2': '. I requested the city council study session be postponed until the matters of impropriety involving the chair and the vice chair of the Airport Advisory Commission members. The business, which involved their financial dealings, which also include the city of Long Beach and JetBlue, have been addressed and resolved.'",
        "'speaker_2': 'These issues are currently under consideration by both the DA's office and the CAA, APC, and therefore I ask you to postpone the study session. The Long Beach, the city of Long Beach manages the airport and is ultimately responsible for the decisions made regarding it.'",
        "'speaker_2': 'I'm shocked that you don't know the things that I know. I only saw three of you. Austin, your Ranga and Supernova Community Meetings regarding this topic when a multitude of residents attended and there has been a limited amount of time to engage the residents.'",
        "'speaker_2': 'As these conflict of interest issues impact the City Council study session i. I would it would be prudent for you to withhold any further scheduling of the city session and vote until the conflict of interest issues are investigated.'",
        "'speaker_2': 'Furthermore, I'm confused and confused about allowing council members request about allowing the council members request about your comments. How do you know that the people that are commenting live in the city? There is a JetBlue email that was sent to anyone about sending emails to the city council to approve the fire study session.'",
        "'speaker_2': 'I only reporting this to you tomorrow. How do you know that the commenters live in the city? Do you require address and name of people? Are only residents allowed to make comments and are they checked? These are questions I would like you to answer tonight.'",
        "'speaker_2': 'And also, I don't think it's necessary that, you know how many people are voting, whether to approve it or not approve it. That just lets me know that JetBlue marketing staff needs to work harder to spam people to to get you guys to vote the way they want you to.'",
        "'speaker_2': 'So I appreciate you allowing our comments and I look forward to your vote.'",
        "'speaker_3': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'Joe Sopko fifth District kept my address and file a mayor, city council members and staff. When you all were elected, you swore to protect the noise ordinance. I think I heard it out of all your mouths. That includes the city attorney and certainly the mayor.'",
        "'speaker_5': 'But what does that mean? Protect the noise ordinance. One thing you haven't done is stop the late night flights. This comes out public information. It's just obvious. Picked up August 2016. And you haven't stopped the homeless from the planes from coming in over the neighborhoods between 11 p.m. to 7 a.m. That's the most sensitive time.'",
        "'speaker_5': 'You haven't stopped that. And the worst violator is paying the city thousands, hundreds of thousands of dollars. And that money's going to the library. Now, that's a hell of a way to run the general budget, to rely on fines to pay for the library.'",
        "'speaker_5': 'But we're getting it. And it seems that you're all happy because no one's changing anything. I mean, the money should go to the library. That's where it's set up. But those flights should not be taking place. This August 2016 was from the airport, and it said that the month of August, JetBlue flew in between 11 p.m. to'",
        "'speaker_5': '7 a.m. over your house, let's say. How would you like it? 19 times between ten and 11. The the approved time that we give him a break. 22 times. Uh, 2015. They flew over and they and they got 15 or 15 penalties.'",
        "'speaker_5': 'They paid thousands of dollars in fines for our libraries. And then the same thing. From 10 to 11, there was 2014, 20. They're not going to stop flying over the top of the house. JetBlue is the biggest violator of our noise ordinance.'",
        "'speaker_5': 'And here we're talking about giving them our airport, giving the international flights. This is real basic. How would you train your children if you had children to raise? Hear, hear. Don't do that. Don't do that. Oh, let me reward you for it.'",
        "'speaker_5': 'That's what we're doing. Rewarding JetBlue. And what do you think is going to happen when you reward them with that FISA of the international flights? You think they're going to stop coming in late? You guys are, you're on this issue.'",
        "'speaker_5': 'You're terrible representatives. And if these were your children, you're terrible parents. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please. I was born, Joy. I live at 4620 Virginia Avenue in Long Beach. In 2001, the city.'",
        "'speaker_5': 'Attorney's office was proven wrong after it told the council and the public.'",
        "'speaker_3': 'That it wouldn't risk our airport ordinance to change the airport's flight slot allocation rules. The exact opposite happened when the council made the change to suit JetBlue. It triggered a 2002 FAA inquiry, and we were nearly sued by American Airlines for that.'",
        "'speaker_5': 'For the record, Mr. Harvard among members.'",
        "'speaker_3': 'Of the of the ATC along with Long Beach US to who saved our airport from permanent destruction from bad.'",
        "'speaker_5': 'Advice recommended by another hired consultant.'",
        "'speaker_3': 'That consultant advised expanding our permanent terminal facilities to over 30% larger than they are today. That would have destroyed the airports, boutique right size, the travelers love and wins awards. Thankfully, a former council body didn't rubberstamp what a consultant recommended, which is why we have the right to size the airport we have today.'",
        "'speaker_3': 'It seems clear to me, as.'",
        "'speaker_5': 'Just a resident listening to the comments here tonight, that there are multiple issues that are.'",
        "'speaker_3': 'Influencing this decision that are not very well known or understood by the constituents in your districts and perhaps by some council members. It stands to reason that the public and your constituents are not going to have time to learn very much about some of these issues between now and this time a week from now.'",
        "'speaker_3': 'I urge you to postpone this vote until we can all figure out all the things that are influencing your vote. Thank you. Thank you. Speaker, please. Mr. Last Speaker, I want to close the speaker's list. Looks like it.'",
        "'speaker_3': 'I'm going. There are other speakers. Please come forward so I can see who's left. So two other speakers. Okay. The lady in the back will be our last speaker. I'm closing the speaker's list now. Others. Okay, so the next three and then we're close.'",
        "'speaker_3': 'Speakers, please. Thank you, Mr. Mayor. Members of the council. I'm Robert Land represent. I am a member of the executive team at JetBlue Airways, 44 100 Donald Douglas Drive at the airport. I want to remind the council that this isn't just been a two year delay thus far to get to where we are tonight.'",
        "'speaker_3': 'Prior to the two years it's taken, just to get to the point of where do we go from here? JetBlue worked for at least two years and was urged by a prior airport director and a prior member of this council to postpone our asking.'",
        "'speaker_3': 'That led us to this two years. So we're in year four of this, the study, the exhaustive study that the city paid good money for that I think answered all the questions the council directed it to ask. Has been out for more than two months.'",
        "'speaker_3': 'During that more than two month period, there have been two exhaustive sessions. I attended both camps. When you Ringo. I saw you at both. It was terrific. And we support your motion this evening to have another study session for the council itself.'",
        "'speaker_3': 'But this is not an issue that's being, you know, ramrod it through. This is moving at a turtle's pace. Everyone's getting their chance to get questions answered. As far as the comment earlier about the councilwoman raised the number of emails she received.'",
        "'speaker_3': 'JetBlue doesn't tell its customers what to do. They tell us what to do. We respond to their needs. We informed them of the council's deliberations. We informed them of the Jacobs study. And we said, If you support this, here's a link to let members of your council know if they've responded in kind, then that's democracy.'",
        "'speaker_3': 'JetBlue didn't force anybody to do anything. You Council members in making this decision need to be informed and fully supports that, including next week's study session that I hope passes and is held in this chamber. But you can't be informed fully until Blue can work closely, which we were prohibited from 18 months ago to work closely with'",
        "'speaker_3': 'the airport staff and the city manager's office to provide all of the details and work an exchange of ideas and information on what this project would look like. So you can then make an informed decision. We pledged to do that immediately upon a vote that allows us to interact that way.'",
        "'speaker_3': 'We think the time for delays is over. I think earlier this evening you saw that the quote unquote holiday periods hardly stop this city from getting engaged and involved on issues of importance. And I applaud the city for taking up the Dakota pipeline issue.'",
        "'speaker_3': 'This room was full and passionate and you had to shorten the time. People got to speak because of it. And it's the holiday period. So in closing, JetBlue reiterates its support for the ordinance, the noise ordinance that we have defended, that we have given up assets to defend.'",
        "'speaker_3': 'And I remind the council that the FAA, as recently as October of this year, stated that proceeding with the FISA facility will in no way, no way whatsoever jeopardize the ordinance. Thank you very. Thank you very much. Last two speakers.'",
        "'speaker_3': 'Please come forward.'",
        "'speaker_4': 'Hi. Lavon Miller, eighth district. I'm confused as to why we're even talking about this, frankly, but to have something that I paid for, $350,000 for a study that contradicts itself in the appendices and the body. And, um, it's very confusing to me.'",
        "'speaker_9': 'I was very.'",
        "'speaker_4': 'Proud of Long Beach today when you stood with the against the Dakota Access Pipeline. You voted as one. And I'd really like to see you stand behind the neighborhoods in Long Beach and vote as one against this facility.'",
        "'speaker_4': 'And one last thing. When we're talking and when we have a study session and we come before you, especially when someone like Ray Gavlak, who has worked in this body herself.'",
        "'speaker_9': 'And comes up.'",
        "'speaker_4': 'To share something and is totally disrespected. I had to speak out against that. Stacey Mungo, you sat in the audience and talked to someone else while she was speaking. I think that's disrespectful. So anyway, I urge you all to put this off until after the holidays, because, quite frankly, I'd like to be home decorating my Christmas tree'",
        "'speaker_4': 'right now. Thank you very much.'",
        "'speaker_3': 'Thank you. On our last speaker.'",
        "'speaker_2': 'Good evening, counsel. Completely out of my comfort zone. I'm forcing myself to stand here and address you. I am a homeowner. I live on Studebaker. This is the first I'm hearing of this other than seeing a couple of signs in people's front yards.'",
        "'speaker_2': 'I don't even know what this means. I'm assuming that there hasn't been a lot of public outreach, so I just wanted to point that out. I'm thankful for the people who have spoken before me to bring this to my attention.'",
        "'speaker_2': 'How will I hear about this in the public? What do I need to know? Is if there's something happening with the airport. How will I know this as a resident of Long Beach? Anybody. Should I look in the local paper?'",
        "'speaker_2': 'What is the public outreach? I haven't heard about this, so I'm asking.'",
        "'speaker_3': 'Any of you where we go. What? I certainly I mean, besides obviously being in the press, which is there coverage of it, I'm certain, if you will, give us your email with the clerk at a minimum. And there's other information out there that's not city information.'",
        "'speaker_3': 'But at a minimum, we can send you everything that the city has that's online and that we have sent out on the issue. But I would also encourage you, there are other groups and there are other organizations have done their own research and other work.'",
        "'speaker_3': 'And those are will be available to you as well. But if you if you leave your email, we will get you everything that the city has and all the presentations.'",
        "'speaker_2': 'Thank you. I will look into that and I will give you my email. But the point is that I think I'm pretty well informed. I've been in this city for 20 years. My point is that there's probably not enough public outreach on this issue.'",
        "'speaker_2': 'And the other thing I would like to say is I agree with the woman before me sitting here in the audience tonight. It's so distracting to watch. Many of you have side conversations to move around, to sit back there, talk to people, come over here, talk to people, be on your phones, be on your tablets, taking care'",
        "'speaker_2': 'of other business. We're in the audience. We hear you whispering and talking. It's completely distracting and it's disrespectful to the people that come up here and and and speak to you about important issues. I'm I'm surprised by this.'",
        "'speaker_2': 'When we come into these chambers, I'm sure you demand a certain amount of respect. And I don't think that many of you are giving that same respect by not paying attention to the people that are at this podium saying very important things to you on very important issues.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you. Okay. That closes public comment. We're going to go back to the council. I have some speakers here. So Councilman Mongo.'",
        "'speaker_1': 'Okay. I think that what we need to do is gain more information. So what I'd like to do is make a substitute substitute motion and I'm open to additional input or friendlies from my colleagues to bring the study session and additional information sought after by the staff in engaging with the tenants back to this Council January 24th'",
        "'speaker_1': '. So in the spirit of Mr. Councilmember Supernova's substitute motion, it would move the study session and the vote until after the holidays. Including but not limited to Martin Luther King Day. And it would also give the city staff the appropriate amount of time to engage with our tenants so we know what we're voting on.'",
        "'speaker_1': 'So I would be interested in knowing information related to. What are we specifically looking at? Where would it go? How many flights would we anticipate would utilize the facility? How much would the facility cost? How big would the facility be?'",
        "'speaker_1': 'All the things that I think we need to know before making a decision to move forward or not to move forward. And so I'd like to with that here from my colleagues. And when I say tenants, I don't just mean one tenant who put in an application.'",
        "'speaker_1': 'I'd like to know impact on all of our tenants. Thank you.'",
        "'speaker_3': 'Okay. There isn't a second yet, so I'm just going to keep going down the list. Count some Boston.'",
        "'speaker_7': 'Thank you. And I believe there. There is a second to the motion on the floor. I am obviously supportive of. I'll wait. I'm I'm obviously supportive of of moving the the conversation until after the holidays. I can remember 2015 being a very tough December for for this council.'",
        "'speaker_7': 'We took a lot of very serious votes. And, you know, the holiday was certainly impacted by that. And so I think in the spirit of just, you know, making sure that we have a of a warm holiday season or holiday season that we can celebrate not only the council, but this entire city and community.'",
        "'speaker_7': 'I think it's the spirit of your motion. Is is is something that I'm willing to support after the holidays. However, I do have some concerns about opening up this this conversation and getting such information in advance of us truly studying the issue as a council.'",
        "'speaker_7': 'Right. We're on your own, almost on a dual track, right? You're on a dual track to say, yes, we want we're we're interested and we want to know more. And we we want to free our staff up to to have the conversations and get information in advance of the city council's really getting behind the idea.'",
        "'speaker_7': 'Right. And so if you were to modify your motion to have this study session in January and have the actual vote after we we actually have an opportunity to start to study the issue. The whole idea behind the study session is that this city council makes an informed decision.'",
        "'speaker_7': 'Right. And. I to your point, I know you're trying to get there, but but I just think it's it doesn't come off as genuine, right. In terms of really, really understanding and having a due process here.'",
        "'speaker_1': 'So I know you and I both experienced multiple study sessions and that our entire council had access to prior presentations online. And our entire council has access to the city staff, city attorneys to continue to do individual exploration including but not limited to just.'",
        "'speaker_1': 'Romo has come to community meetings in the fifth District and answered several questions that are on point. I'd be open to a couple of things. I'm not saying that we're interested. I'm saying we don't know what we're interested in.'",
        "'speaker_1': 'And so let me. I don't want to. I guess I could do an analogy, but I'm not saying. We're saying we're interested. I'm saying. We might want to go get a Christmas tree this year. And this is a debate in my family.'",
        "'speaker_1': 'Do we get a real Christmas tree or do we get an artificial Christmas tree? We don't even know what store to go to yet. And so within that context, I'd like them to come back. If you are hoping that this council has a study session in advance.'",
        "'speaker_1': 'I'm I am open to still having the study session next week and then having. All the information come back at a date certain in January so that we all know when to be here, what to expect. My residents want to know when is the vote going to really happen because they want to put it on their calendar'",
        "'speaker_1': 'and plan to come downtown. And we know how coming downtown is. And right now there's parking issues and other things. They want to plan. They want to carpool. They want to be a part of it, both yes and no sides.'",
        "'speaker_1': 'And what I don't want to do is leverage my neighbors to come two and three and four times. I want them to know that when they come. That we're going to have all the information because I think it's a very different story to say where we're going to move forward.'",
        "'speaker_1': 'But no one knows if we're talking about. $1,000,000 or 25 million. I mean, we really don't have anything in between. So are you open to do you still want to study session on the 13th and then everything in January or I will.'",
        "'speaker_7': 'I think we all came here prepared to do a study session on the 13th. Right. And I'm okay with doing a study session on the 13th. I've notified residents that the study session would happen on the 13th. So if you want a major motion, you're substitute substitute to say the 13th for a study session and then come'",
        "'speaker_7': 'back in January for a full consideration of this this issue. That's something that I can get behind and support. I think that's due process that I'm talking about. It gives this council an opportunity to get the information from the regarding the feasibility study, digest that information, develop questions, get do research based on questions that were may have'",
        "'speaker_7': 'come up then and then allow us all to have a nice holiday season as well.'",
        "'speaker_1': 'So I'm going to leave the floor open to listen to my colleagues because this might substitute substitute came from the. The information, both from councilmembers. Super Noor And to your point, when I had a community meeting last Monday, they wanted to know what's happening on the 13th.'",
        "'speaker_1': 'And I said, Quite honestly, I don't know because you don't know until you the sixth passes to what I can tell you what's gonna be on the agenda and posted because the staff report will be coming but I agree so but.'",
        "'speaker_7': 'I still have the floor, by the.'",
        "'speaker_0': 'Way. Thank you.'",
        "'speaker_7': 'I would, um. I know you put forth a substitute. Substitute? I would just ask as a friendly amendment that you direct staff to remove their item from from the 13th, from consideration until after we've had such study session.'",
        "'speaker_7': 'And that item comes back in January.'",
        "'speaker_1': 'So the way I currently have my motion worded, I may have not done it so eloquently, but the item would be the study session and the item that's currently agenda is for the 13th, all moved to the 25th with an additional component of information from the stuff through engagement with the tenants.'",
        "'speaker_1': 'That's where I am right now.'",
        "'speaker_7': 'I'll support Down.'",
        "'speaker_3': 'All right, somebody lingo.'",
        "'speaker_6': 'Okay. A lot of discussion here. Perhaps some confusion. And, you know, this last motion that was made right now, it's still not acceptable to me. Simple reason. Any studies say any item that includes a study session that ends in a vote is not acceptable.'",
        "'speaker_6': 'We can't do both at the same time. That that's my issue. You can't study something, say you're studying something, and then get a vote on it. It's like being in school. You studied and you take the test right away.'",
        "'speaker_6': 'You're not even given an opportunity to to go home and do some homework on it. I mean, that just doesn't work that way. A lot of people get, you know, failing grades because they cram. Then they before they call that set, they call that studying.'",
        "'speaker_6': 'That's not that's not studying. Studying is getting a report, getting all the information you you they have to give you asking questions. Having staff go back, researched a little more, coming back with the information that you requested via the study session that you had.'",
        "'speaker_6': 'I want more information on on the feasibility study. I want more, more, more information on the sequence issues, on the cost. I want all of that. Those are questions that those are questions that I have questions that are already being brought up but that we don't have answers to.'",
        "'speaker_6': 'We have some. Preliminary response to that, but not as a whole. And I'm not I'm sure that there's a lot more information out there. So any any motion at this point that puts both together as a as a study session and a vote I cannot support.'",
        "'speaker_6': 'And then we have the additional item that Councilmember Austin just brought up is that this debate is because we already have an agenda item for the 13th that says a staff report and then a vote. And I think that what my intent was with the original motion that I made was to remove the the the.'",
        "'speaker_6': 'The staff report portion of it. Do have to have a social study session and then move the vote to January. It'll give us a month or so. January 24th seems to be the appropriate date, or at least a close date when we're all here as a full city council.'",
        "'speaker_6': 'So I could see I could see that studying that on on on the next week and then going into the vote in January. But any item right now, as I see it, that does both will not will not work for me.'",
        "'speaker_6': 'Supernova's substitute motion would work if he were to separate the two but but it's not it's a it's it's just moving the such and about to a future date which would be what Stacey I think is recommending here.'",
        "'speaker_6': 'And I'm I can't support that. So at this point, you know, it's you know, I can I can come up with a question, but I see one councilmember hasn't spoken a lot yet. So I'm going to let her give her an opportunity to to chime in at this point as well.'",
        "'speaker_3': 'Thank you. And before I go to the next two speakers, I think it's important we do have a clarification because I want to make sure that everyone understands what the actual motions are and then what the processes that Mr. Mays described, because then we can maybe see some clarification on the motion on the floor.'",
        "'speaker_3': 'So and please correct me if I'm wrong here, so let me know. Okay, from the way the way I understand the current the process that needs to happen, as you've explained it right now, regardless of the study session aside, the vote on the FISA process essentially is, as you've explained, it, is a two step process.'",
        "'speaker_3': 'The first the first vote would be a request to direct management to begin engaging with JetBlue and or partners that are interested in the FISA and develop, I'm assuming, the framework for a plan to develop an FAA terminal that would then that vote on the FAA terminal, I'm assuming it would include specs and size and variety of'",
        "'speaker_3': 'different questions that could be answered. Then that would then come back to the city council for a second vote to actually move the FISA terminal forward. Is that correct or incorrect?'",
        "'speaker_10': 'Mayor. That's correct. What you essentially would be doing in the first step is actually defining a project, a real project that has, you know, the size of the building, the financial structure. And once that is defined, the project is defined.'",
        "'speaker_10': 'It would come back to the city council for a vote and approval of whatever environmental document was approved appropriate to to finalize it.'",
        "'speaker_3': 'I believe that staff's intent then is when placing it on the agenda on the 13th, is that that would be the first part of that. What you described in the second component of that would come back at a later date whenever that date was in 2017.'",
        "'speaker_10': 'The way that letters fashion. That's correct.'",
        "'speaker_3': 'So I just want to clarify, could I believe Councilwoman Mango's substitute substitute motion puts all puts all of those the study session the direction to work with JetBlue and. The actual vote. All on one day. So I just want to clarify that that that we're all that we understand what the motion is and maybe I'm incorrect there'",
        "'speaker_3': ', but I just want to clarify with Councilman Mongo.'",
        "'speaker_10': 'Mayor, if I can add to that, as I understood the motion that would include, if it were passed, the staff's ability to immediately engage with tenants at the airport, which of course would include JetBlue to discuss items such as what a project would look like, what the financing would be.'",
        "'speaker_10': 'I think that's what I heard the motion to be correct.'",
        "'speaker_1': 'HILTON Yes, and I would be most interested if all of those were wrapped into one agenda item. It doesn't need to be three agenda items on the council. If it's you're the legal expert on what's possible, but I would like a member of the public to be able to come forward and speak on all three items.'",
        "'speaker_1': 'Because I think that as you and I have experience at community meetings, there's not speaking to one, just the Jacobson study or just this or just that. It's a very intertwined discussion. So I'd like it to be. One item for everyone to be able to engage on.'",
        "'speaker_1': 'And potentially, depending on what my colleagues say, I might move the study session up. Depending on if that seems like the call to the council.'",
        "'speaker_3': 'So can you clarify for me also it's part of that response because I think clearly the study session and the and those those votes can certainly be the same day, different days depending on the council's direction. But I'm also I'd like clarification for myself and maybe other members.'",
        "'speaker_3': 'Could the other two actions be on the same vote, which I think is what's currently being proposed? Is that possible?'",
        "'speaker_10': 'I'm sorry, Mia. Which other two actions?'",
        "'speaker_3': 'I think with the current substitute substitute and I could be completely interpreting this wrong, but I believe that the substitute substitute puts the. The. Giving direction to staff to work with JetBlue and then the approval of the office into one vote versus the initial separation of the votes.'",
        "'speaker_3': 'Staff at plant is well and.'",
        "'speaker_10': 'Maybe I'm not completely understand you, but as I understand the motion, what it would do, it would move the FIA study session to January 24th and it would also direct city staff to have the ability to make contact with interested tenants at the airport, including JetBlue, between now and January 24th and that on January 24th, Council would'",
        "'speaker_10': 'have a study session and the potential it wouldn't have to do it, but the potential for voting to take. The next step. And if that next step, if they've already talked with JetBlue and gotten a commitment, the next step might be to commence whatever appropriate environmental was needed.'",
        "'speaker_3': 'Okay, Councilman, do you want to make anything else? Want to add to that?'",
        "'speaker_1': 'You know, I would like to hear the rest of my colleagues comments.'",
        "'speaker_7': 'Point of information, though, because I'm really thoroughly confused now. I understood the process to be the very first step in this process would be to to send a letter to Homeland Security and then to the governor before we even get to that point.'",
        "'speaker_1': 'So I'm happy to add that in as a friendly.'",
        "'speaker_7': 'No, that's not a friendly. I'm just saying. It seems like you're putting the cart before the horse here.'",
        "'speaker_3': 'Let's get the process. Let's get that question. Let's get that one question clarified. I'm going to go through the speakers. Listen, I've got three of the council members, including Mr. Austin, at the end of the day.'",
        "'speaker_7': 'At what point does the council request that that this project even be approved by Homeland Security? So in the letter, the governors of the state of California are supposed to send a letter requesting a search.'",
        "'speaker_10': 'That's exactly right. The federal government will not move forward with approval of the office until they have a letter from the governor indicating that they the state is supportive of it. So it's kind of a dual process. One of the directions to staff would be to or could be to move forward with outreach to the state government'",
        "'speaker_10': '. And that, you're correct, is part of the December 13th letter that is, you know, already on your agenda for December 13th, which is to direct staff to contact the governor's office to see if they are interested in allowing Long Beach to become international terminal.'",
        "'speaker_3': 'We go to the speaker's list and then we'll circle back around. Councilman Schubert on.'",
        "'speaker_5': 'Somehow I am reminded of the phrase snatching defeat out of the jaws of victory. What I'd like to add is possibly a compromise here. Let's see if we can work this out. We have the date of January 24th that has been mentioned for my original idea to move the thing after the first.'",
        "'speaker_5': 'So if we looked at the Tuesday prior of January 17th anyway, the Tuesday prior to the 24th, yea 17th. Let's get a hard date for January 17th for the study session for council then. Okay. Then let's use January 24th as the hard date for the study session, with the vote to be taken at some point after but'",
        "'speaker_5': 'not taken that night. So would that be a sub subs? I'm not sure. Or a friendly.'",
        "'speaker_3': 'They'd have to be a friendly. There's no more motions like. Do you want to just keep going down the list? Okay. Council Member Pearce.'",
        "'speaker_9': 'Thank you and thank you for the clarity on what we would actually be voting on and the clarity that. First let me let me just back up and say that it's bothered me that the conversation has said, well, because we haven't seen you at a study session, you haven't been paying attention.'",
        "'speaker_9': 'I've read the binder. I've read the study. I've paid attention. I've watched the videos. They're still out there. And we're trying to get as much information and ask as many questions as possible. And so I just want to put that out there, and I commend my colleagues for trying to ensure that there's a good, transparent process that'",
        "'speaker_9': 'everybody can engage in. And it's my commitment that in between now and January that I'll also engage in Second District residents to make sure that they're a part of the process. You know, on top of of JetBlue or airport or constituents that are trying to come out, council is also trying to plan what things they put on'",
        "'speaker_9': 'the agenda as well. And so while we continually move dates, it affects everybody else as well. And so I'm supportive of moving a date to January, even though I was very much at the beginning of this meeting concerned about moving a date to January.'",
        "'speaker_9': 'I would hope that if we move the date to the 24th, that we would be able to have a meaningful study session and a vote at that time, knowing that we still a very far away from actually getting a.'",
        "'speaker_9': 'A solid vote on having an additional. Services there. So I guess my my question is the last proposal is to do it on the 24th and then put a date in February for the vote. If that comes back up.'",
        "'speaker_9': 'And that's a friendly I really want us to try to push ourselves to just have this first vote. It's just a direction to kind of move forward with actually understanding what it would look like and all the details.'",
        "'speaker_9': 'And so I would urge us to not move past January. If my colleagues if I hear different from colleagues, then I'll be there. But I really would want to see this vote happen on the 24th with the study session, if possible.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilman. Awesome.'",
        "'speaker_7': 'Thank you. And once again, I want to appreciate everybody's dialog here. I know we're working to get somewhere to make some movement. I think the the ideal is to to be fair to to make sure that we don't minimize the concerns of the residents in the impacted communities, recognizing that their homes are their primary investments and their'",
        "'speaker_7': 'connection to the city is very, very important. They've asked for us to move this past the holidays. I think that's a fair ask. And it sounds like there's there's consensus here there. Right. Councilmember Mongo, your motion is like I said, it's it's my appetite is there to support it.'",
        "'speaker_7': 'I just have a problem with engaging the stakeholders and moving an agenda on a, on a, on a dual track right before we've actually had this study session. And to your point, Councilmember Pearce, I don't doubt that other council members have looked at video and read emails and read studies.'",
        "'speaker_7': 'That's what we do and that's what we were elected to do. But this is the forum for the city, right? We had the forum at the Airport Advisory Commission. It's not televised. The ABC. It's not televised. The city council was televised.'",
        "'speaker_7': 'And this this is the broad forum for for the city. And ultimately it's the call is on us. The responsibility is on this body. Right. And so I would just implore upon Ms.. Mongeau to amend your motion, drop that portion of your motion that that that that puts us in a position where we are.'",
        "'speaker_7': 'Giving giving a subtle, subtle nod to to a process that we haven't had a chance to vote on. Right. Let's let's let the process be what it is. Let's have a have due diligence, I hope. Oh, wait. I'm hoping that that we can we can do our due diligence here, have the study session.'",
        "'speaker_7': 'And if the body decides that we're going to do both, then on January 24th, it is going to be a very, very long meeting. Right. And I hope you're prepared for that. This is a meeting that will require I mean, nine city council members all will have questions.'",
        "'speaker_7': 'Some will have more than others. This could go into the wee hours of the morning. Right. And so if that's what you want to do, that's I don't I don't think that's good form for the council. But that is something that that that's a compromise I'm willing to make to to get us past the holiday season.'",
        "'speaker_3': 'Thank you. Next is Councilmember Ringa.'",
        "'speaker_6': 'Thank you, Mayor. Healthy discussion. We need to continue this. But the bottom line is, again, if it's doing. As a motion that stands right now is having all these different nationalizations taking place on one city council meeting. I cannot support that.'",
        "'speaker_6': 'We're good. We're going to be here till, you know, till midnight, if not beyond that, if we if we accept that motion. So I just can't get support that. What I can support is having a study session, which is the original motion that I had and taking a vote at a different date so that we can do'",
        "'speaker_6': 'our due diligence in between the study session and when the vote takes place so that we can have all the information, including that which which. Ms.. Mongeau Councilmember Mongeau identified. But. The other cautionary note that I have on this is that there's an implied agreement to move forward with that piece.'",
        "'speaker_6': 'If we send a letter to the governor saying, we want to pass, we want you, we want your approval on it. It would I would have to see what that letter looks like first and what it's asking for in actuality, because there is no way I want to imply that the city of Long Beach is ready to'",
        "'speaker_6': 'move forward, and we need their blessing or his blessing at this point. That is not the point of sending a letter to him. The point would be there's there has been a request. There's an intent. We're studying it.'",
        "'speaker_6': 'What do you think, Governor? Can we move forward? Should we move forward? Do you have concerns? What are those issues with concerns that you have? Let us know what those are so that we can include it in a study session.'",
        "'speaker_6': 'Rather, maybe that's what should be done. First is that is is the city of Long Beach is considering being the fourth, fifth, sixth, seventh, whatever airport we are to be international in California. Is that workable with him? Is it workable to have three, four international airports within a 25 mile radius?'",
        "'speaker_6': 'Does that work? Because that's what's happened. That that is what exactly what happened with Alex, Ontario, John Wayne. And I think Burbank is already there or heading in that direction. I mean, there's a lot of other stuff that needs to be done beforehand.'",
        "'speaker_6': 'And that's why having a study session. Would make sense. Let's get all the questions out there. Let's study it. Let's get it. Let's get it addressed. That way when we do have the time, when it comes to a vote, we have the staff report.'",
        "'speaker_6': 'Staff will be making that report, giving us all of the information that we've asked for, and then we can take that vote. But being prepared and knowledgeable and fully vetted, as far as I'm concerned, fully vetted in regards to the feasibility of having this bias.'",
        "'speaker_6': 'So I'm sticking to my original motion at this point, although I like the possibility of of putting that out to the 24th as a study session, and then we will vote then moving it into maybe the first week or second week of February to take the vote.'",
        "'speaker_6': 'Something like this requires patience, and I know there's some impatience out there, but it requires us doing our diligence to make sure that we're going to do this and do it right. And if it takes time for us to do it right, then so be it.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Okay, I have a long list of folks, so. Which is fine. We got it. It's an important issue. So let me just go down the all the comments. So remember, we have a subsidy subsidy on the motion council member super non.'",
        "'speaker_5': 'Okay. Just as a courtesy, the audience. I want to bring him up to date on what's going on here with the dates. Jan, can't we can't meet. That's a state of the city address. So that council meeting is out of the question.'",
        "'speaker_5': 'The 17th council member, Turanga, has a Coastal Commission meeting, so in deference to his schedule, that would be out of the mix. So that takes us to the 24th, that magical date. And so what I'd like to propose now is then let's look at the 24th and either have a special meeting on the 31st.'",
        "'speaker_5': 'I'll gladly give up my community meeting, which I don't want to have that night or February 7th. Bingo.'",
        "'speaker_3': 'Well, we have a subsidy subject to keep going through the speaker's list and then come back around to Councilman Mongo, who's at the end of this list here. So Councilmember Pearce.'",
        "'speaker_9': 'Can we call the question?'",
        "'speaker_3': 'I've only got two more, so I think maybe we'll get these last two. And unless there's any objection to that, I.'",
        "'speaker_4': 'I mean. I like the dates. I like.'",
        "'speaker_1': 'So. So I'm happy. I'm trying to accommodate everyone. I want to respect Council Member Supernova's intent not to have the study session or anything during the holidays, though I would be very supportive of the study session next week with all information coming back on the 24th so that all of that works.'",
        "'speaker_1': 'I'm also amenable to the 17th with the study session with the vote on the 24th. Councilmember Turanga has attended all of the study sessions and one of the things that I think would be pretty amazing for all of our residents is if that meeting would be potentially at Long Beach City College, closer to the residents.'",
        "'speaker_1': 'That won't have to trek themselves downtown to engage in this dialog. So I'll put that out there. I know it's not a decision that this council would be able to make at this dais, because we have no idea of the rooms available, any of the things of that.'",
        "'speaker_1': 'But I'll put it out to the city staff that if there is the will to make that happen, I believe that that would be something meaningful.'",
        "'speaker_9': 'Yeah, I wanted to make sure I still had the.'",
        "'speaker_1': 'You still have the floor. But in agreeing to I'm going to have to let down either Councilmember Turanga or Councilmember Super not at this point with either the options or I'm going to have to let down my other colleagues who are not going to have so good either.'",
        "'speaker_9': 'Could I call the question on.'",
        "'speaker_3': 'Let me go let me go back to the calling of the question then. Okay.'",
        "'speaker_9': 'So calling the question on the last dates that were proposed, which was the 24th.'",
        "'speaker_3': 'You have to call the question on on ending discussion on the motion.'",
        "'speaker_9': 'I would like to call the question to end the discussion.'",
        "'speaker_1': 'Does that mean I can accept Friendly's or. No.'",
        "'speaker_3': 'It's okay. It's okay. So let's just hold on 1/2. So there's the.'",
        "'speaker_9': 'Way I see that, Lina, Councilmember Gonzalez has not spoken yet on this item. I'm just trying to help move us along. So I'm.'",
        "'speaker_3': 'Okay. I'm going to keep going down the line because we've got a couple folks. Vice Mayor Richardson.'",
        "'speaker_8': 'So. Well, number one, when you call for the question is not the bit not debatable. If anybody seconds, you got to vote on the question. That's just a point of order. And then what I would say is. You know, sometimes you step back and let other council members step up and kind of work it out if they're'",
        "'speaker_8': 'more sort of engaged on that issue. My district's not in the flight path. I've paid attention to this issue since I was chief of staff for seven years. So I follow it. I'm up to speed on this issue.'",
        "'speaker_8': 'What I would say is the original item that prompted this discussion tonight was by council uranium. That actually made sense to me. It said, you know, let's have a study session before we make a decision that I'm just on a basic stamp.'",
        "'speaker_8': 'It just made sense. You know, we are if this doesn't happen on the 13th or whatever date, we're still coming to a council meeting on 13th. The my daughter's birthday is or second birthdays on Thursday. I'm still planning to be at a council meeting on the 13th to make that happen.'",
        "'speaker_8': 'And so I think we need to just put a reality check out there. The basis of this is and I understand both sides. Do we play the delay game? And I don't want to play that game if we're going to have a discussion.'",
        "'speaker_8': 'We're going to make a decision. We need to make a decision if if we want to give the public adequate time to study it. And if the council is requesting adequate time, study it. I support that as well.'",
        "'speaker_8': 'So what I'm saying is that, you know, I'm going to be in a position to have to vote down every measure until we get to council member wrangles or the motion that we're on right now, which this is very, very different.'",
        "'speaker_8': 'You just adjust the dates to where you have the study session on the 13th and you vote on the 24th. I think we keep it simple. It does not have to be all that extra stuff if that happens as a as.'",
        "'speaker_8': 'And mind you, I'm going to leave here tonight and sleep well one way or the other. So I'm okay. But I but I think that is the path to a compromise, if that's on the main on the main motion.'",
        "'speaker_8': 'It just it just makes make sense. And I hope we can just get to that.'",
        "'speaker_3': 'I'm going to go to Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes, I wanted to kind of sit back and listen to everything. I, too, have been up to speed with everything I've I've read as much as I could on this issue. Of course, my residents feel very differently, but I completely understand this is a citywide issue.'",
        "'speaker_2': 'I want to hear all of my colleagues and of course, the public and make sure that I'm making the best decision. And I would have to agree with Vice Mayor Richardson as well. I think that we originated this whole discussion on the premise that the 13th we would have some more information and the FAA study would provide'",
        "'speaker_2': 'us that information or the study would provide us some more information on on what direction we can we can go. And then in January, I think that's also fair to to have a month to to kind of dig into this a little bit more, even more than we already have and then possibly make a vote in January'",
        "'speaker_2': '. I think that's a good compromise between all of these discussions that I'm hearing. And it allows us, the council members, to continue working on these on this issue and have some more information, get some more information in the next month, after the holidays.'",
        "'speaker_2': 'As Vice Mayor Richardson alluded to. We're going to still hear this this whether opposed for we still get the emails constantly. We get calls constantly about this issue. We are studying it as much as possible among all of our daily lives that we all have, whether public, elected, office, whatever.'",
        "'speaker_2': 'So I would say that if we can get to a 13th and 24th schedule, that I would be amenable to that. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. I have Councilmember Mongo. 1/2.'",
        "'speaker_6': 'Point of order, Mayor. Yes. So we are going to be voting on the motions.'",
        "'speaker_1': 'I'm going to accept a friendly.'",
        "'speaker_6': 'As as they go.'",
        "'speaker_3': 'Correct the sub sub, because.'",
        "'speaker_6': 'I would like to amend my original motion if I can. But, you know, when it comes right down to it, I will make that amendment. Okay.'",
        "'speaker_3': 'So we're going to start we're going to start with the sub sub. And I'm going to allow I think Councilman Mongo also wants to kind of clarify our motion and so that we all know what we're going to do that each step of the way.'",
        "'speaker_3': 'So if this goes further, so we know so everyone knows what the each vote is. Okay, so councilman mongo.'",
        "'speaker_1': 'So my motion will be accepting the a part of the friendly from Councilmember Turanga that we move forward with the study session on. 1213. Is that next. Next Tuesday that staff engage and get info from the state and tenants etc. and bring back all the information for a date certain of January 24th for this Council to have'",
        "'speaker_1': 'a informed packet of information and a vote. Great.'",
        "'speaker_7': 'What did. Excuse me. What does that mean?'",
        "'speaker_1': 'I don't think you have the floor, sir.'",
        "'speaker_3': 'Well, actually, hold on one sec. Well, I need 1/2. So there is. There's a motion on the floor. So Councilmember Austin is asking for clarification.'",
        "'speaker_7': 'And point of clarification. What you mean was.'",
        "'speaker_3': 'Hold on 1/2. Let me let me let me figure this out 1/2. Councilman Austin, looking for clarification on the motion. So a part of the motion or the whole motion? Councilmember.'",
        "'speaker_7': 'I understood the dates. I understood a study session on the 13th. I understood bringing it back for a vote to determine our direction. Correct. On the 21st. 24th. But I don't understand is directing staff to engage in stakeholders and with the governor's office to do something that we haven't made a decision on doing since.'",
        "'speaker_1': 'So while I appreciate your perspective, sir, I don't know. That's what any of the scope will be. It's not disingenuous. I don't know that the governor is going to say yes or no. If he's not even going to say yes, why are we having the discussion at all?'",
        "'speaker_1': 'I don't know what the scope would look like. We don't know any of those components yet. Those are the components neighbors ask me regularly so respectfully, and I'm I'm hoping that we'll pass the floor to the next person and please queue up and ask those questions of whomever at that time.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Okay, hold on, everyone. So. Council member Supernormal.'",
        "'speaker_5': 'A couple of comments were made here, admittedly by council members who are not in airport impacted districts. The vice mayor characterized this as the DeLay game, and that is the furthest thing from my mind. I won't hold him to that particular verbiage.'",
        "'speaker_5': 'I don't think he was accusing me of playing the DeLay game, but I just like to explain the psyche of the residents who are in the airport impacted districts. Okay. They are cynical. And I hope that didn't have to bring this up tonight.'",
        "'speaker_5': 'But why didn't I know back last summer that this wasn't going to work if we brought it here during the holiday season? I'll go back to December 18th, 2007. That's when the Schroeder Hall vote was taken. That took over five years to resolve that.'",
        "'speaker_5': 'I don't know how many committee meetings we had. There were dozens. But I'll tell you one thing. At every one of those meetings the audience brought up and they tried to sneak it byas the meeting before Christmas. That's what I was trying to avoid.'",
        "'speaker_5': 'We had it here a few minutes ago and now it's gone again. So I'm going to employ, I implore my colleagues to consider moving the study session until after the first of the year. So whatever we do is not tainted by that, by the residents who live in the airport back impacted district.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Council member, Austin.'",
        "'speaker_7': 'So the intent of the item before us this evening was to have a study session, and I think it was articulated a lot down the line that we want to respect, that we want to respect the having a process.'",
        "'speaker_7': 'We want to have more information as a as a as a council before we make this decision by instructing staff to go in and start negotiating the deal points before we've actually made a decision is is wrong, right?'",
        "'speaker_7': 'We didn't do that with the Civic Center. We didn't tell staff to go in and start, you know, setting up negotiations before we made a decision to move forward with that process. Right. We don't do that with anything else.'",
        "'speaker_7': 'This is something that I'm employing upon Councilmember McGill to drop that portion of her motion. I could support everything else. Otherwise, I have to vote against this motion and encourage the rest of the council to do the same.'",
        "'speaker_3': 'Mr. Mays.'",
        "'speaker_10': 'Mayor, members of the City Council. Since we're getting close to voting on the substitute substitute, I need to make sure exactly what direction you are giving staff. And as I understand the motion, it includes a study session next week on the 13th and potential action item on the January 24th.'",
        "'speaker_10': 'And if it were to pass, it would also allow and direct city staff to engage with tenants at the airport, which would include the preliminary negotiations with, for instance, JetBlue, to determine actually what size of project that they are interested in, what financial arrangements they would be willing to make in connection with the office facility.'",
        "'speaker_10': 'And it would also allow staff to at least reach out to the governor's office and start the process of determining whether or not the governor's office would sign a letter to Customs and Border Protection indicating support of an office facility in Long Beach.'",
        "'speaker_3': 'Okay. There's a we have the substitute. Substitute motion on the floor. Looks like there is no other questions ready for the vote. Councilman Mango. Councilmember Austin.'",
        "'speaker_7': 'So I'm hearing two different things, right? I think Councilmember Mango's motion, what I heard was that should we do this? Staff would immediately begin those steps in terms of engagement. What I heard from the city attorney was something altogether different.'",
        "'speaker_7': 'If the city attorney's.'",
        "'speaker_4': 'Know.'",
        "'speaker_7': 'If his version of this is what we are voting on, I could I could I could support that. But was that a question of clarification or not? From the city attorney.'",
        "'speaker_10': 'I was trying to clarify what Councilman Mango's substitute substitute motion was as I understood it, which is to make sure that all of us are on the same page. As we move forward tonight, whatever the direction is, so that everybody knows exactly what they're voting on.'",
        "'speaker_1': 'So it sounded slightly different. Will you repeat it one piece at a time? Sure. This is what real making policy means to get everyone on the same ship going in the same direction.'",
        "'speaker_10': 'So one step at a time. Step one would be to set a study session for next Tuesday night, December 13.'",
        "'speaker_1': 'Everyone's clear on that one.'",
        "'speaker_10': 'Step two direct city staff to immediately begin engagement with JetBlue and any other interested.'",
        "'speaker_3': 'Until Mr. City Attorney and.'",
        "'speaker_10': 'Any other interested tenant at the airport that has an interest in the office and also engage with the government, governor's office and CBP if necessary. And the third step is to set an item on January 24th, 2017, for a potential vote by the City Council.'",
        "'speaker_10': 'That's the way I understood the motion.'",
        "'speaker_7': 'Okay. So I heard it different the second time. The first time you said a study session on December 13th. Then come back to a vote on the 14th, on the 21st, 24th of January. And then should we vote in support, we would engage with stakeholders at the airport and governor's office and move the process.'",
        "'speaker_7': 'That's what I thought I heard.'",
        "'speaker_10': 'Well, that's not what I said. I was just trying to articulate what I believe Councilwoman Mongeau said in her motion, and I think she stated it twice. And my understanding was that she wanted staff to initially engage with tenants, including JetBlue, as to things such as the size of the potential financing and all that.'",
        "'speaker_7': 'Thanks for clarifying. I think that that.'",
        "'speaker_1': 'Is putting.'",
        "'speaker_7': 'The cart before the horse.'",
        "'speaker_3': 'Okay. So I think this now the I think Mr. Mays has explained what the substitute substitute motion is that is on the floor, which is has those three different components in it, which is well, you describe them. I won't describe them again.'",
        "'speaker_3': 'You just you just went through all three of them. And so please go ahead and cast your votes on the substitute substitute motion.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to request City Manager to report to council in no more than 90 days on the current oil and gas operations conducted in Long Beach. The report shall include but is not limited to exploration, drilling techniques, capping of old wells, storage, pipeline maintenance, and spill or other emergency preparedness.": [
        "'speaker_3': 'Okay. Motion carries. We are now moving on to the next item, Madam Clerk.'",
        "'speaker_4': 'Item 16 Communication from Councilmember Pierce, Councilman Gonzales, Councilmember, your UNGA recommendation to request a report in no more than 90 days on the current oil and gas operations conducted in Long Beach.'",
        "'speaker_3': 'Council Member Pearce.'",
        "'speaker_9': 'Sorry, guys. Okay. I want to thank city staff and everybody for your time and the meetings that we've had to discuss this. I really wanted to make sure that we as speakers earlier said, don't just take a vote on supporting somebody in another state, but that we look internally about what we're doing.'",
        "'speaker_9': 'And so this is a simple report that's simply asking to make sure that we look at add new technologies to make sure our operations are safer and more sustainable. Many residents have told me that they feel in the dark about specifics about our safety operations, especially given recent incidences in Porter Ranch and 1986 pipeline accidents that killed'",
        "'speaker_9': 'more than 500 people, injured more than 4000, and cost nearly $7 billion in property damages. Much of this due to aging pipelines that have not been properly maintained. Given that drilling first started in 1920s, we want to be proactive and looking at infrastructure to know what's most impacted, what the risks are.'",
        "'speaker_9': 'And so today, what I'm simply asking for is a report from city staff on where our pipelines are, the integrity of them, what safety precautions we've taken in the past to make sure that we're capping off oil derricks.'",
        "'speaker_9': 'And what is a process that community members can look to or transparency to ensure that they know where these pipelines are and what our community is doing. So it's a simple report back in 90 days and I'm asking for council support in this.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_8': 'Councilwoman Gonzalez.'",
        "'speaker_2': 'Yes, thank you. I just wanted to reiterate everything Councilmember Pearce said. I think we have received a lot of, you know, information and questions as to much of the pipelines, especially in light of what's happened. And so I know in addition to the pipelines, we would also like to see maybe a report and list of abandoned wells'",
        "'speaker_2': 'in Long Beach, particularly those that have may not have modern abandonment standards. My best I believe there was an issue with the Gerald Desmond Bridge where it cost us a bit more and also a considerable amount of time as well.'",
        "'speaker_2': 'So I think, Councilmember Pearce, for bringing this forward, I look forward to hearing more information and what we can do with that information going forward. Thank you.'",
        "'speaker_3': 'Councilmember Ringo.'",
        "'speaker_6': 'Thank you, Rosemary. I want to thank Councilmember Pearce for bringing this forward. It's very timely beginning of the year. As many of you know, I serve on the Coastal Commission and there were a couple of spills last year, repeal one of them.'",
        "'speaker_6': 'And as a result of that, I asked last year for a report on where we're at with it, with our infrastructure, with our pipes. I don't know what happened to it. It got lost. They're glad you brought it back, because it is important that we know what what's in our infrastructure.'",
        "'speaker_6': 'There's a big piece of property. For example, in my district, the oil operators, where there's a lot of abandoned pipelines underneath that don't contain water, some contain oil. But I'd like to know what exactly what's underneath there so that when we look at what types of possibilities and possible developments that are going to be taking place there'",
        "'speaker_6': ', if at all, what is it exactly we're dealing with in those areas? So I'm glad you brought this forward and I'm looking forward to the report. Thank you.'",
        "'speaker_3': 'The public comment, please.'",
        "'speaker_4': 'Anna Christensen of Long Beach, California. I have a couple of requests. One, that this same report, should this motion pass, be brought in before the Sustainability Commission as well?'",
        "'speaker_10': 'Since the.'",
        "'speaker_4': 'Sustainability Commission has taken such a great role in looking at options for new technology and a greener Long Beach, it only makes sense that they have an opportunity to also ask questions or.'",
        "'speaker_10': 'Hear this report directly from.'",
        "'speaker_4': 'City staff in addition. I would really appreciate an amendment to this report that included any drilling projects that are proposed that are, in other words, that already have either an air or an initial study because weather that they could very likely happen.'",
        "'speaker_4': 'So they seem to be worth review. And I'm specifically speaking about the Lost Cerritos Wetlands Restoration and Oil Consolidation Project, which proposes to put 120 new oil wells on either side of our active earthquake fault in our wetlands, as we are also proposing a possibility of 6000 new residences there.'",
        "'speaker_4': 'This is really. You know, important that we take a look at what does this mean? We know that it means that eventually old oil wells, abandoned oil wells that are apparently bursting into flames over there are going to get taken out.'",
        "'speaker_4': 'That's a good thing. But what's the risk? What is the risk of drilling 120 new wells right next to an earthquake? If we're interested in what our what our status is in terms of public safety and a green city, I hope that that at least that one project would be included, that staff could take a look at'",
        "'speaker_4': 'it. Thank you very much.'",
        "'speaker_3': 'Thank you very much. Next speaker, please. Thank you. My name's Ellie Gonzales. As I previously mentioned, I'm the current chair of the Sustainability Commission. And as the previous speaker speaker just mentioned, I do believe that this fits within the purview of the commission.'",
        "'speaker_3': 'This is an item actually we have actually reviewed about a year ago. And what I'd like to do is just simply update the commission with new information as as it was mentioned by the council member, we had a major gas leak.'",
        "'speaker_3': 'This was the largest gas leak in history. Within my lifetime. I've seen the biggest oil spill in my in in my lifetime. And as well as the biggest gas leak, I think that we are living on a crumbling infrastructure.'",
        "'speaker_3': 'And I and for that reference, I would like to invite you all to check out The O.C. Weekly. What the frak is happening under Long Beach. There's a quote in there that says that Long Beach is sitting on a ticking time bomb.'",
        "'speaker_3': 'That's that's a quote given by a geologist. I think I take this very seriously for those who know me. No, I like to have fun. I really enjoy Long Beach. But when it comes to our environment, our air and our water, I take these issues quite seriously.'",
        "'speaker_3': 'I believe that each of you council members deserve to know all the information that I have been researching on my own. You, a few of you, you have told me, Oh, we're not fracking in Long Beach. Are you aware that we're acid diving?'",
        "'speaker_3': 'Because I just received an AQ, M.D. notice while I was here in this meeting saying that they're going to acids on the terms islands. Are you familiar with what acid izing is? And if you don't know, you deserve to know and your constituents deserve to know.'",
        "'speaker_3': 'So I humbly ask that this body will allow our committee to review this item as well. And what we'd like to do is give our comments as a commission so that you all are well informed. And we'd also help like to help with vetting a lot of the public comments.'",
        "'speaker_3': 'I'm sure it's going to be a really long meeting, much like we've seen today. So we'd like to assist in receiving some of that feedback. Thank you. Thank you. Next speaker, please.'",
        "'speaker_4': 'Thank you very much for listening this late in the evening. This is the item that I'm most excited about. I'm Patricia Chen and with Long Beach 350. And we are delighted that the city council is considering looking into oil and gas operations.'",
        "'speaker_4': 'We would like you to look for a way to cease operating the wells and pipelines that and crisscross our city and to keep oil and gas, gas in the ground. The reasons are that, first of all, it's great timing.'",
        "'speaker_4': 'The price of gas and oil are going down. So it's a good time to seek solutions and other revenue sources to wean our city off fossil fuel revenues. Also because of the climate. Long Beach is very vulnerable to climate change because we have a long coast, which means we have businesses and homes and our port at sea'",
        "'speaker_4': 'levels. And also because of what the extraction, the nature of the extraction is in the city, um, uh, basically it's only tertiary extraction that will get anything out anymore. And that means using hazardous acids and basically poisons that are affecting the, um, the land and the rivers and the oceans here in Long Beach.'",
        "'speaker_4': 'Um, and finally, because aging pipelines are susceptible to leaks and fires and explosions, and they're just basically a liability. Um, so those are our thoughts as Long Beach 350 but there are so many other perspectives. And so I think that's why it would be a great idea for the Sustainable City Commission to hear the report and ensure'",
        "'speaker_4': 'that there is, um, a broad perspective and um, so that the report can be shaped and formed into something that doesn't just sit on the shelf. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please. Just when you think you saw the last and still another. I wanted to finish with something before, and so I'm going to start with it. These are some words from a gentleman who is no longer with us.'",
        "'speaker_3': 'It's Mother Earth has been abused. The powers have been abused. This cannot go on forever. No theory can alter that simple fact. Mother Earth will retaliate. The whole environment will retaliate. And the abusers will be eliminated. Things come full circle back to where they started.'",
        "'speaker_3': 'That's revolution. Those are the words of Russell Means. Russell Means was an Oglala Lakota Sioux. He was born on Pine, the Pine Ridge Reservation, and he was very outspoken as an activist for the environment. And I'm not a big environmentalist, except in my old age.'",
        "'speaker_3': 'I retired from the oil and gas equipment and repair and service industry, spent 35 years looking at the worst of the worst. And I can tell you, we're we're we're surrounded by it. I would not give a gloom and doom thing because we work.'",
        "'speaker_7': 'Really hard to make sure.'",
        "'speaker_3': 'Everything stays in control. There's some good people out there with good intents, but time takes its toll on everything and everybody. And those wells, it's only a matter of time. Thank you. Next week, please.'",
        "'speaker_2': 'Hi. My name is Elizabeth LAMB. I live in the third district and I'm here speaking as an individual, but I'm speaking as an individual that spent 40 years interested in environmental issues and advocating for the environment. And to me, to assess the gas and oil operations infrastructure of Long Beach just makes good sense.'",
        "'speaker_2': 'We all know that.'",
        "'speaker_1': 'Oil is a toxic substance.'",
        "'speaker_2': 'And it is important that the infrastructure around it be well-managed. And additionally, I also want to point out to you.'",
        "'speaker_1': 'That due to the many years of.'",
        "'speaker_2': 'Pumping oil in Long Beach, there may well be.'",
        "'speaker_4': 'Some.'",
        "'speaker_1': 'Subsidence issues.'",
        "'speaker_2': 'Related to that.'",
        "'speaker_1': 'Activity. That should also be looked at.'",
        "'speaker_2': 'As you all know, and as was.'",
        "'speaker_1': 'Articulated by the.'",
        "'speaker_2': 'Council members sponsoring this, oil spills can have devastating consequences both for the environment and also for the economy and beyond. So I encourage you to support this. Thank you.'",
        "'speaker_3': 'Thank you, Councilmember Pearce.'",
        "'speaker_9': 'Thank you. I just want to make two additional comments. I think that the idea to send it to the Sustainability Commission is definitely one that I'm open to and I hope that my colleagues will be open to that as well.'",
        "'speaker_9': 'I also wanted to include in the report, in addition to where our pipelines are, the health and integrity of those pipelines, what is our disaster preparedness should something happen? And three, I do want to say that I know that a lot of us would love to be off of oil, but obviously that's not going to happen any'",
        "'speaker_9': 'time soon. But how we can continue to raise awareness and support corporate partners that are really doing their best to get off of oil and be innovative in how they move forward. And so thinking about what are some of those technologies that we can continue to support and to have that conversation about how Long Beach is doing'",
        "'speaker_9': 'things like having charging stations for our green technology and things like that. So thank you.'",
        "'speaker_3': 'Councilman Austin.'",
        "'speaker_7': 'Thank you very much. And I'm going to be supportive of this item, I believe. I want to make sure we have some clarification on what we are asking the city manager to do as it reads. It says, Come back with a report in 90 days on the current oil and gas operations conducted in Long Beach.'",
        "'speaker_7': 'And the report shall include, but not limited to exploration drilling techniques, capping of oil wells, storage, pipeline maintenance and spill and other emergency preparedness. And then you want to to move this report offer this report to the Sustainability Commission as well.'",
        "'speaker_7': 'But there is no action after the 90 day report, correct? I think okay. Because I was hearing a whole lot here and I'm feeling really guilty that I'm going to put my keys in my car and leave now.'",
        "'speaker_0': 'Right.'",
        "'speaker_3': 'My gas.'",
        "'speaker_0': 'Pump. I have a big crew.'",
        "'speaker_3': 'Break.'",
        "'speaker_7': 'This evening. Take care.'",
        "'speaker_3': 'There's a motion and a second. Please cast your votes.'"
    ],
    "Recommendation to approve the Midtown Business Improvement District Annual Report and Assessment for the period of January 1, 2017 through December 31, 2017, automatically extending the current agreement with the Midtown Property and Business Owners Association for a one-year period; and, authorize payment of $25,255 in City property assessments from the General Fund (GF).  (Districts 4,6)": [
        "'speaker_3': '20 I think we thought we had done. Yeah we did. 20.'",
        "'speaker_4': 'Oh, excuse me.'",
        "'speaker_3': 'Not 20. Okay. 20.'",
        "'speaker_4': 'Number 20 Report from Economic and Property Development Recommendation to approve the Midtown Business Improvement District Annual Report and Assessment for the period of January 1st, 2017 through December 31st, 2017, and authorized payment of $25,200 in city property assessments from the general fund districts four and six.'",
        "'speaker_3': 'Okay, there's emotionally the second. Any public comment? Please cast your votes.'",
        "'speaker_5': 'Oh, excuse me. Excuse me. Excuse me, please, ma'am. I have a young man. I like. What? See here.'",
        "'speaker_3': 'Mr. Moran. Net. Is he here?'",
        "'speaker_5': 'Oh, please. I like when.'",
        "'speaker_3': 'Councilman Austin wants to. Yes, absolutely. Fine.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'I'll meet you at Andrews. What did I say? No. Yes.'",
        "'speaker_7': 'Sir. Good evening, Mayor. Councilmember. My name is not on that. I'm the new executive director of the Metropolis Improvement District. And first of all, I want to thank City Line, which for having the. The Beach walk, big street.'",
        "'speaker_7': 'Last man in Midtown. And I think so. Uh, compliments of another councilman. The D.A. would agree it was probably the best beach street ever in Long Beach. Right?'",
        "'speaker_5': 'Yes, you're right. You're right. Yes.'",
        "'speaker_7': 'Thank you. So I'm here to.'",
        "'speaker_3': 'Say thanks for all your support.'",
        "'speaker_7': 'And I cannot wait for next year to give you a PowerPoint presentation of our success.'",
        "'speaker_5': 'Thank you. Thank you. Thank you very much.'"
    ],
    "Recommendation to authorize City Manager to submit an application for the Airport Improvement Program Grant for Fiscal Year 2017 to the Federal Aviation Administration for funding for capital improvements to Runway 7R-25L and to accept such grant, execute grant documents and amend grant documents and grant amounts with the Federal Aviation Administration for entitlement and discretionary funds in the amount of $12,881,879.  (District 5)": [
        "'speaker_3': 'As you mentioned a second, any public comment scene and please cast your votes. Motion carries 26.'",
        "'speaker_4': 'Report from Long Beach Airport. Recommendation to submit an application for the Airport Improvement Program Grant for fiscal year 2017 to the FAA for funding for capital improvements to runway seven R 25 L District five.'",
        "'speaker_3': 'Can I get a motion in a second? Any public comment? Please cast your votes. Oh. Councilman Austin had a question, please.'",
        "'speaker_7': 'So I'm noting a $12 million improvement to runway two five. L just wanted to get a staff report from the airport director to find out exactly how the that airport runway will be utilized.'",
        "'speaker_3': 'Jess Romo. Good evening, honorable mayor. Honorable Council members just remove from Long Beach Airport. This runway, which is actually our shortest on the field, supports a good number of our general aviation operations. So it is still actively used but used really to support the smaller aircraft of your airport.'",
        "'speaker_7': 'So during the construction, well, with the general aviation aircraft, you what air, what runway and how will they be able to come to and from Long Beach Airport?'",
        "'speaker_3': 'Well, as they're accommodated now, all the aircraft, including general general aviation, can use any of the three. So while this runway is being reconstructed, they will either move to either runway one, two, three, zero or on to seven left to five right.'",
        "'speaker_7': 'And what are those general aviation aircraft subject to noise ordinance?'",
        "'speaker_3': 'They are subject to the noise ordinance. Keep in mind that relative to the noise budgets, only runway 1230 is the runway which actually measures and captures the noise for purposes of accumulating the noise limits. The other runways, the two five runways are used for a single event for violations.'",
        "'speaker_7': 'Okay. So if we are running regular aircraft on two, five and two five. Right, and we're only using one way dirty to measure noise for purposes of our noise ordinance. Is that does that. That doesn't add up. It means that there's noise that we're not capturing.'",
        "'speaker_7': 'Is that correct?'",
        "'speaker_3': 'For purposes of the noise budget? That is correct. That is the way that the noise ordinances has been has always been crafted as far as as far as I know.'",
        "'speaker_7': 'Okay. Look forward to talking more about that later.'",
        "'speaker_3': 'Great. Next item.'",
        "'speaker_4': 'We need to finish the vote.'",
        "'speaker_3': 'Okay. Please cast your votes if you have not logged in.'",
        "'speaker_4': 'Councilwoman Price. Councilwoman Mongo. Emotion carries.'"
    ],
    "Recommendation to adopt resolution declaring a shelter crisis; suspending applicable provisions of local law, including those contained in the City's zoning ordinances and regulations; and, authorizing the operation of a winter shelter between the dates of December 7,2016 and March 6, 2017, inclusive;   Authorize City Manager to execute any and all documents necessary for a Lease between Eddie N. John #1, a limited liability company, and the City, and a Sublease between the City and First to Serve, Inc., a California nonprofit organization, and any necessary amendments, at the discretion of the City Manager, for approximately 12,000 rentable square feet of industrial space at 6845 Atlantic Avenue, at the monthly base rent of $6,750 plus utilities and incidental costs for use as a winter shelter; and  Increase appropriations in the General Fund (GF) in the Health and Human Services Department (HE) by $20,250.  (District 9)": [
        "'speaker_4': 'Motion carries.'",
        "'speaker_3': 'Him.'",
        "'speaker_4': 'Item 30 Report from Health and Human Services and Economic and Property Development. Recommendation to adopt resolution declaring a shelter crisis for the operation of a winter shelter between the dates of December 7th, 2016 and March six, 2017. Inclusive and authorize the city manager to execute a lease and sublease for 12,000 rentable square feet of industrial space at'",
        "'speaker_4': '6845 Atlantic Avenue District nine.'",
        "'speaker_3': 'Okay, there's a motion and a second and if any public comment. Saying that public comment staff are you putting out staff? Okay. Okay. Kelly Colby.'",
        "'speaker_0': 'So that the person that we are, the organization will be running the winter shelter this year.'",
        "'speaker_3': 'Is called.'",
        "'speaker_0': 'First to Serve.'",
        "'speaker_10': 'In the past, we've had a Long Beach rescue mission.'",
        "'speaker_0': 'We'll be opening the shelter in the next couple of weeks. We're working with the provider to make sure that it.'",
        "'speaker_10': 'Is safe and ready and then it will end on March.'",
        "'speaker_0': '1st. And that's my staff report. I know, for questions.'",
        "'speaker_8': 'Thank you, Mr. Mayor. We're good.'",
        "'speaker_3': 'Now, you know. Thank you. It's a long night. I'm gonna start singing in a minute. Next item.'",
        "'speaker_4': 'Need a vote on item three, please.'",
        "'speaker_3': 'Let's take a vote. Any public comment first? Nope.'"
    ]
}