{
    "Recommendation to authorize City Manager, or designee, to execute the Seventeenth Amendment to Agreement No. 28164 with the Long Beach Area Convention and Visitors Bureau, Inc., to extend the agreement by a period one-year and to provide funding in the amount of $5,058,676 for Fiscal Year 2020.  (Citywide)": [
        "'speaker_0': 'And if we can just pull that item, going to hear that item right after this as well. So going here, all the CVB items together, but we're going to we're going to go to item 22. What we're what we've done, I know that we've been is we're taking item 22.'",
        "'speaker_0': 'I'm going to ask the clerk to read the item first. So please read the item.'",
        "'speaker_1': 'Report from City Manager Recommendation to execute the 17th Amendment to agreement with the Long Beach Area Convention and Visitors Bureau to extend the agreement by a period one year and to provide funding in the amount of 5,058,676 for fiscal year 2020.'",
        "'speaker_1': 'City wide.'",
        "'speaker_0': 'Thank you. And then Mr. Monica.'",
        "'speaker_8': 'Yes. For this presentation, we'd like to turn it over to Mr. Steve Goodling to give a presentation.'",
        "'speaker_0': 'Great. And we're going to go ahead and do since we have two items on this. I'm going to Mr. Goodling is going to go a couple of minutes past the ten minute mark for presentation, because we're not going to hear a presentation on the consent calendar item.'",
        "'speaker_0': 'So we've combined it into one. So, Mr. Goodling.'",
        "'speaker_9': 'Thank you, Mayor. Thank you. City council and also city management. Tonight, we'd like to share with you an update on where the tourism sector is. I. We commissioned Beacon Economics to do a study for us, and I love this graph.'",
        "'speaker_9': 'I wish it actually was my portfolio at home. I since 2002, it has grown 146% or $18 million. So it's a significant income for the city, actually. And for Vice Mayor Andrews, this is the data every year that you like, for every dollar that the CVB receives, we generate a $6 and 17 cent return.'",
        "'speaker_9': 'This past year, we were the fourth largest revenue tax generator for the city of Long Beach. That's a significant amount of money. In addition to the transient occupancy tax, there's also taxable sales on things that our visitors buy when they're here in the city, whether it's meals, whether it's clothing or anything else.'",
        "'speaker_9': 'And that's another 17 million property tax by those business owners is another 19 million for a total of $70 million in taxes back to the city. We are also the second largest sector in the industry for employment behind health care.'",
        "'speaker_9': 'Health care as at 19% and tourism leisure is at 13%. Pleasure. Travel was one of the areas we focus on. This past year we worked with the Academy, the Pacific, and also the Queen Mary. So we took double page ads.'",
        "'speaker_9': 'In the past, the aquarium would take an ad, Queen Mary would take an ad, they'd be on different pages. Now, when you go through any of these great magazines were a double track or two pages, and so Long Beach jumps out at you.'",
        "'speaker_9': 'In addition, we work we're working with these publications in their social media and their digital platforms as well. This is a sample of one of the ads for this past year. Our PR department has brought in over 100 and basically 140 writers this year and bloggers and digital influencers for eight millions impressions.'",
        "'speaker_9': 'So we've appeared in a variety of stories from L.A., L.A. Times, Orange County Weekly, USA Today and other pubs, but also a growing influence of blog sites. Our followers in Instagram, also Facebook and Twitter have grown 43%. And in just a few weeks, John Keisler is going to Qingdao.'",
        "'speaker_9': 'And so we created this video. If any of you know what she's saying, you win the award for speaking Mandarin.'",
        "'speaker_2': 'While you our champion, Tedros Rumanian, your son by the Georgian too young one for which ultimately each I'm sure you're sure about for your too that idea clergy sexual standards. You don't say something to you vetoes you hold hands up like a joystick.'",
        "'speaker_2': 'Hang on doing the hammer. Do the way you join simple. Yet that's how hunger challenge our strong prototype your. The utility because. Yes, you bet. Is a type of theatrical Jewish, Yiddish. Oliver, you've had me on.'",
        "'speaker_4': 'I should go back.'",
        "'speaker_9': 'And if you go with John to Hong Kong and Qingdao, you'll hear that all day long. I, having worked in Asia.'",
        "'speaker_3': 'I loved I loved hearing.'",
        "'speaker_9': 'That. So that's another part of our reach out in terms of pleasure travel. In talking with mayor former Mayor O'Neal recently, Beverly and we're talking about basically tourism, the convention business. And she made a comment which I really thought was wonderful.'",
        "'speaker_9': 'She said, Steve, everyone that comes to a convention is a potential visitor in the future. And that's so true. It's it's what I would call trail marketing. You get to come into our city, and every time I hear people that come into our city, they either say, Gee, Steve, I never knew or, boy, has this changed.'",
        "'speaker_9': 'I hear one of the other. And that's what they always say. And what's interesting is our convention business is also a generator for repeat visit. To keep us competitive and keep us at the front edge. We have to continue to differentiate ourselves.'",
        "'speaker_9': 'And this is where all of you are so important. This past year, CMA, a national association of meeting planners of 7000 members, has a magazine that reaches 50,000 people. They commissioned a study with Marriott and it's called The Five Future Trends of Meetings.'",
        "'speaker_9': 'In actuality, these trends are across the board for most industry sectors. But as it relates to us and conventions and tourism, the two that are really key to us, I believe, is orchestrated serendipity and multimodal design. Orchestrated serendipity is what Google calls human collision is where you create an environment that causes people to actually network.'",
        "'speaker_9': 'And that's what we've been doing at the Convention Center, because we believe that people come to conventions in conferences to network. We also create areas that they can also power down and just do their iPad or iPhone or whatever they're working on.'",
        "'speaker_9': 'But more importantly, to network. Multimodal design is using a space more than one way. Today's planners, today's buyers want the ability to take a space and put their own distinct impression on it. So when you walk into the convention center across from the Renaissance, this is entering in through the north side.'",
        "'speaker_9': 'That space off to the left is a new space. Just this past year that was created again, a great space for networking, but look to the right, look all the way down. All of that is is new. And it's an opportunity for all of our people, all over conventioneers to network in addition across from the Hyatt, this'",
        "'speaker_9': 'is from that lobby area coming in and during a conference. This place is packed. You're all familiar with the terrorist theater. Thank you, Mayor, for the fountains. And and Janine, also. And it's really. This space has become so hot.'",
        "'speaker_9': 'This past year, we had a 1000 person banquet out on the plaza. It was a software company. And they again, multi-modal design, being able to use a space more than one way. The code you're familiar with. And believe it or not, this is the fifth year of the anniversary for the Pacific Ballroom.'",
        "'speaker_9': 'It was an antiquated arena, rarely ever used and multi-modal design at its best. The stats, we've gone from 136 usage days to 250 days a year. You might not see people parking driving up to that arena, but that arena is being used 250 days a year.'",
        "'speaker_9': 'It's booked over $425 million of new business. And 30% of our conventions use that space. The antithesis of that is if we didn't have the arena, we wouldn't have 30% of those conventions. So there's 40,000 square feet gave us this additional space.'",
        "'speaker_9': 'And in five years, catering revenues have doubled at the building because of all these new spaces, the newest activated spaces. Many of you saw the email that just went out. This was just finished. This is the area between Bogart's and our exhibit Hall's 9000 square feet.'",
        "'speaker_9': 'It's great space, part of the Pacific Gallery, which is adjacent to the Pacific Ballroom now, but it's completed. It's a total of 21,000 square feet of unique, cool space. When combined with Bogart's combined with our Pacific Ballroom, the entire place becomes active.'",
        "'speaker_9': 'And the Ocean View Club. The third floor of the Terrace Theater is also another space that we recently activated. The views are spectacular. The angels have loved going up there and looking out and looking at our ballpark. But with that being said, I'd like to share with you.'",
        "'speaker_9': 'Recently we had a reception up there for Mark Taylor's farewell, and I'd like to show you what that space is like as it's active. So again, taking a page out of PCM has five steps. Multi-Modal design, activating spaces.'",
        "'speaker_9': 'All of you were given this. This is a copy of the White Paper that PCMag published. We were the first city in the United States to actually have a white paper printed on it and how we are actually ahead of the curve and subscribing to the five principles of the future transit meetings.'",
        "'speaker_9': 'This was seen by over 50,000 people. I go into that sector to lead into this. And I coming up here shortly in Chula Vista in San Diego, the port of San Diego has worked out a development plan and it's going to actually shake up business on the West Coast.'",
        "'speaker_9': 'This project is $1,000,000,000 project. This is the 1400 room hotel that will open up, which is almost equivalent to the amount or size of of some of our larger conventions when they come to Long Beach. And this is the plan.'",
        "'speaker_9': 'It's going to be up at the top. Middle section is where the resort is being built. Another hotel adjacent to it. And then right around the marina is a lot like our Rainbow Harbor and Rainbow Lagoon and more residential and office space.'",
        "'speaker_9': 'It will have over 400,000 square feet of space, which is identical to us. It will have 600 rooms and it's also going to be one completed, the third largest hotel in California. It will be completed by 2023 and they'll start selling this next year.'",
        "'speaker_9': 'What that means for us is we're going to be running into these folks as they start selling. It's owned by Marriott Corp.. Gaylord is a is basically a subset of Marriott. And so for us, the challenge is going to be competing with everything under one roof.'",
        "'speaker_9': 'Planners love the luxury of signing one contract, working with one general manager, working with one management team when they come to Long Beach. We have to sign on average, 4 to 8 contracts plus a convention center contract. And so as a CVB and as a quite honestly, as a tourism community and a hotel committee, we work hard'",
        "'speaker_9': 'to make it easy to do business with us. And that's our that is our competitive advantage. Plus everything that I shared with you earlier. I can assure you Gaylord won't look like this like we do. However, it will be a great, great competitor to us.'",
        "'speaker_9': 'In addition, Portland just completed a $65 million renovation with the new hotel and new Hyatt up there. And. In Sacramento. We also they're investing over $240 million. They're blowing it up. I know many of you traveled to Sacramento frequently.'",
        "'speaker_9': 'It too will be quite beautiful when complete it. And it's interesting. They're spending 240 million, but they're only going to get about another 20,000 square feet of exhibit space. And they're paying $50 million for a 40,000 square foot ballroom.'",
        "'speaker_9': 'The Pacific Ballroom cost us 10 million. And so it was quite a savings for us and quite a high impact. But once they're finished, they will be almost identical to us. In Anaheim, we have two new hotels going in for another thousand rooms right next to the convention center.'",
        "'speaker_9': 'And so, as you can see, we've we've built a lot of great successes. Again, being the only city that PCMag has recognized is putting us out in a white paper as being leaders in our industry with our convention center partners.'",
        "'speaker_9': 'But at the same token, we've had a real we have challenges coming up, and we have to keep investing into the building. So with that being said, I'd like to share this video. And then, yeah, we're finished.'",
        "'speaker_3': 'In Long Beach in Southern California. I can look out the windows and see palm trees, water, and the Queen Mary and I really feel like I'm in a destination is unique.'",
        "'speaker_2': 'It has a great young vibe. Felt like I was in a resort town, but also in a meeting location all in one. It just had a perfect dynamic.'",
        "'speaker_3': 'When I talk to my peers, I rave about Long Beach, great location on the waterfront, proximity of the convention center, two restaurants, easy airport access. But location, location, location. What I love about Long Beach is the fact that everything you need is right there.'",
        "'speaker_3': 'It's all walkable.'",
        "'speaker_2': 'The weather's fantastic. You love to walk around in weather like that, and there's lots of interesting things to look at while you're doing it.'",
        "'speaker_3': 'Entertainment, shopping, amazing food. It's just one big ball of energy and a lot of fun. Long Beach Convention Center is one of those places that makes me want to actually look forward to the meeting or event that I'm actually going to.'",
        "'speaker_3': 'There are numerous unique environments where attendees can gather and create their own experiences that they then will remember and take back. And that's what attending a convention is all about.'",
        "'speaker_2': 'If I could clone the space here and take it to other areas because we have to move around, I would do that. It is a gem. You have to try it. Turkey is especially important to planners.'",
        "'speaker_4': 'It makes it very simple.'",
        "'speaker_2': 'To plan your events. You don't have to bring in different pieces because they're all bright. They're available for you. I have to say that there's no other venue that I can think of in the U.S. that would compare to the Pacific Ballet.'",
        "'speaker_2': 'In about a minute, you go from being in an arena to being in a ballroom, and that's an easy thing.'",
        "'speaker_3': 'The Cove, this unique.'",
        "'speaker_4': 'Little area underneath an underpass. Believe it.'",
        "'speaker_3': 'Or not.'",
        "'speaker_8': 'There's great lighting features. I've never seen.'",
        "'speaker_4': 'An underpass.'",
        "'speaker_2': 'That actually has chandelier.'",
        "'speaker_9': 'Having amenities like ping pong.'",
        "'speaker_8': 'Tables and lounge seating and the palm trees and the environment that has been created there.'",
        "'speaker_3': 'Is phenomenal because it allows for great networking and it really sets them apart from the competition because when you go to another city, you have to pay somebody to put all those things in place for you. Networking.'",
        "'speaker_8': 'That's really important to us. And so that's one of the reasons we love Long Beach because they have all these fun and.'",
        "'speaker_4': 'Comfortable areas where people can sit and talk and really exchange ideas and connect.'",
        "'speaker_2': 'I think that Long Beach is special because of the people that are there. It's all about creating community and relationships, and Long Beach always is a welcoming city.'",
        "'speaker_3': 'They all know each other, they're a community, and what they.'",
        "'speaker_8': 'Express and what you see when you go there is.'",
        "'speaker_3': 'They want the business to come to Long Beach.'",
        "'speaker_4': 'My CEO always says, Can we pick up the Long Beach Convention Center and take.'",
        "'speaker_3': 'It with us wherever we go? They built Long Beach Convention Center in a way that every time you go there, there's a different experience. Long Beach is ever evolving. I think the great thing about this city is they're always thinking ahead, step ahead and thinking about innovation, step ahead and thinking about what type of venue is the'",
        "'speaker_3': 'venue of the future. When you go to Walter Reed, you feel the love. You feel like you want to come back there on a regular basis and it is your second home, if not your first time. Thank you for your.'",
        "'speaker_3': 'Thank you very.'",
        "'speaker_0': 'Much, Steven the team. We're going to continue real quick. We have two folks in center for public comment that are actually also part of the they want to say some remarks about the presentation. And so if I can have David Blaine's build up first and then Imran Ahmed also, please come forward.'",
        "'speaker_3': 'Honorable Mayor Council members, thank you for your time today. My name is David Blanchfield. I am executive vice president and group publisher of the Northstar Travel Group. I am not a resident of Long Beach or California. I come to you today from our company headquarters in Secaucus, New Jersey.'",
        "'speaker_3': 'But I come to recognize and report on excellence when I see it. And this is a terrific opportunity to give a shout out to to Long Beach, to the convention center and to the Visitors Bureau. My business were all about travel.'",
        "'speaker_3': 'I mean, we report about travel, all aspects of travel, leisure as well as corporate, as well as events and meetings, incentives and exhibitions. And that's the area that that I am responsible for. We have offices all around the United States.'",
        "'speaker_3': 'We also have offices in London. And we do have folks who speak Chinese. I don't offices in Shanghai and in in Singapore as well as as well as in Beijing. And, you know, for the past couple of years, you know, we have always been covering Long Beach because of the the excellence that the team here brings to'",
        "'speaker_3': 'the planning of of meetings and events. I was also formerly a meeting planner and an event owner and organizer and had terrific success in bringing bringing my meetings here a couple of years ago. We initiated a new program, we call it the Stella Awards North Star Stella.'",
        "'speaker_3': 'It's Latin for recognizing stellar work. And the process we brought to this was a very rigorous one. First was putting the nominations of visitors, bureaus and entities that provide services to tourism, putting it to a public vote over a period of time.'",
        "'speaker_3': 'And then after the public votes are tabulated, we then take the top players in each category, in each region, and invite a group of seven independent, experienced judges to evaluate the the entities that have been voted among the top players in the industry.'",
        "'speaker_3': 'And we break it up by region. Over the past three years, no other convention and Visitors Bureau has appeared in the top two other than Long Beach. And No Convention and Visitors Bureau has had both the Convention and Visitors Bureau and the Convention Center winning these awards.'",
        "'speaker_3': 'So it's a it's a terrific, terrific a testament to the value of the services that that your city brings to to our industry. Although we are not making a public proclamation today, this is this is all somewhat embargoed because we are not officially launching these awards until November, when we publish a special issue to the tens of'",
        "'speaker_3': 'thousands of people who who subscribe to our magazines and get our content online. But, you know, when you're competing against the likes of the San Francisco's and the Seattle and the Los Angeles of the world in the Far East, obviously it's a terrific, terrific testament to the work of.'",
        "'speaker_0': 'Thank you so much, Mr. Paintsville.'",
        "'speaker_3': 'So I'd like to, you know, bestow these awards on Steve and the team and thanked him very much for the services they bring to the industry.'",
        "'speaker_0': 'Thank you very much. And Enron has come forward and its public comments. Imran Ahmed.'",
        "'speaker_3': 'Good afternoon, honorable mayor, esteemed council members. My slides are not here. But we have all heard of Beacon Economics in the first light that Steve Goodling showed, in which I am here to let you know honorable mention that we were able as a as as a chair of CVB.'",
        "'speaker_3': 'I'm letting you know that we were able to generate over $1.7 billion for the city of Long Beach and supported over 18,000 jobs for the city of Long Beach. So this is with your support that we were able to do so.'",
        "'speaker_3': 'So thank you so much. In addition, I would like to give out a shout out to all our CDB associates if they could please stand and remain standing. Please. Further, I would request the CDHB Board and the Executive Board to please stand and remain standing.'",
        "'speaker_3': 'Please. And then the convention center, Charlie Burns and his team, if he could stand with his team through. And finally, who's here to support the CVB? And that includes all our team. If you can please all the hoteliers.'",
        "'speaker_3': 'If you can stand and remain standing, please. And everybody. Honorable Mayor. Voila. Thank you so much.'",
        "'speaker_0': 'Thank you very much. Thank you very much.'",
        "'speaker_3': 'Let's give the entire.'",
        "'speaker_0': 'Team a big round of applause. Thank you. We do have we have one more member of the public wants to say that wants to make a remark. Mr. Goodhew. Europe. Nope. Okay. Oh, great. Councilmember Then let me start with the council, Councilmember Pearce.'",
        "'speaker_5': 'Thank you. I just want to give a big thank you and congratulations to everybody that's here today for this presentation. Long Beach has come a long way in the last ten years, and our hospitality industry would not be what it is without the CVB, without the work that you guys do every single day.'",
        "'speaker_5': 'And I want to say personally, I really appreciate it. I have seen the convention center completely transformed. I've seen it transform not only the workers there, the businesses that surround our convention center, but our entire city. Obviously, the numbers that you guys laid out are phenomenal numbers.'",
        "'speaker_5': 'And I want to say that I've enjoyed partnering with you guys and I really appreciate the partnership and return. I know sometimes it's been tough, but what I what I see today is a thriving tourism industry that has deep partnerships, that's going to continue to thrive even whenever our economy might do whatever it does in the next'",
        "'speaker_5': 'ten years. But that today we've got new hotels coming on the market in this city. Thanks to your hard work and Imron, very proud of you and your efforts at your hotel. I've always told you how much I appreciate you and really I've enjoyed getting to know you and I look forward to next year's presentation.'",
        "'speaker_5': 'But thank you guys so very much.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman. Councilwoman Price.'",
        "'speaker_2': 'Very much. I want to share those sentiments and thank you all for being here. It's really impressive to me. Every year when we have this item, how many of you turn out to support the item? Because your work is really a year round thing, whether it's trying to support new ideas, whether it's attending the events, whether it's'",
        "'speaker_2': 'participating in a change in terms of messaging or themes. In terms of Steve's big ideas, you're all there 100% to give everything that you can. And we really appreciate that as a council, you and the work that you do make us look good.'",
        "'speaker_2': 'I mean, that's the reality, the work that you do make us look good as a city. And yes, we have great assets and assets that that have a lot of opportunities and potential in the future. But the work that you do to make the assets come alive and attractive is is really transforming the city in terms of'",
        "'speaker_2': 'where we're at in the tourism industry. So thank you for everything that you do. And I want to I'm glad that our hoteliers are here today because I think it's such a a necessary partnership. And to have that very positive communication with all of our tourism outlets and offerings is critical.'",
        "'speaker_2': 'And so I want to thank you for collaborating and working through difficult challenges and also predicting what the market will bear in the future. We've been meeting, I know, several of my colleagues and I, you know, when we're thinking about how the market is changing, for example, it's changing in every industry.'",
        "'speaker_2': 'We have conversations almost daily now with how the retail markets are changing as a result of online shopping. And we're trying to make adjustments. Everyone's trying to make adjustments. The Conventions and Visitor Visitors Bureau and the hoteliers work really well together to be proactive about those trends in the marketplace rather than putting it on us to come'",
        "'speaker_2': 'up with the solutions. You're the subject matter experts and you allow us to follow your very solid and thorough lead. So I appreciate that and I thank you for everything that you do. And I also thank you for the support that many of you give personally and as members of the CVB and the hotel industry.'",
        "'speaker_2': 'To the arts organizations, you do tremendous work in partnering with us to encourage and highlight all of the assets in the city. So thank you.'",
        "'speaker_0': 'Thank you very much. Councilwoman Vice Mayor Andrews.'",
        "'speaker_7': 'Yes, thank you, Mayor. I know tonight first, when I came on, I thought that all these people will come into a council meeting and I knew better. Then when I heard about the CVB awards, it just the crowd that they bring in.'",
        "'speaker_7': 'Then I thought, I going to have one of those long, long council meetings, but now this is going to be much, much shorter. But I just wanted to say that and take a moment to take time to thank the sea.'",
        "'speaker_7': 'VB Of all the things that they do for the city of Long Beach, you know, under the leadership of the CEO Steve Gatlin, it has performed at the highest level in every test that he's been asked to perform.'",
        "'speaker_7': 'Staveley leads a team of commandments professionals that always make the city look good, and I applaud them for their achievement. Thank you, individuals again. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor. Councilmember Richardson.'",
        "'speaker_6': 'Thank you, Mr. Mayor. Steve, to the whole team, there's not much I can say that most folks have already said. You know how I feel about our convention center. Your leadership, frontline staff, the entire family. You're really part of this Long Beach tapestry.'",
        "'speaker_6': 'And when people come to Long Beach, you are the hospitality committee. You're the welcome committee to the hundreds of thousands and millions of individuals who come to our city. You're who they see first. And so you're incredibly important and we value you.'",
        "'speaker_6': 'Our city council does value. I think it's important and it's great that every year you start off and make the economic case, you make the economic case, you prove, you show every time you know the dollars and cents of why it's important to make sure that we continue to invest in our our facilities.'",
        "'speaker_6': 'We've transformed those facilities, invest in the arts and the performing arts that we have. So so thank you for doing that. I have to tell you, you know, it seems like so this would be the third year we've host it.'",
        "'speaker_6': 'So next week we'll be welcoming Legacy Cities back. And this is when a lot of our elected officials buddies come in and host and they party downtown and host a lot of sessions and meetings. And it's great to see that every time they come back, there seems to be another venue, some new space, and that's activated.'",
        "'speaker_6': 'So we look forward to welcoming the whole state of California, public officials, local officials across state California next week to the League of Cities. So, again, keep up the good work. We're incredibly proud and honored to serve on the city council with with partners like all of you.'",
        "'speaker_6': 'And we look forward to the many great things to come.'",
        "'speaker_0': 'Thank you. And Councilman Ringo.'",
        "'speaker_9': 'I want to also agree with you all your comments been said, but also the Nutter convention coming up in November, which would be the Democratic Convention, state convention here in Long Beach. And all our we will be on on on on tab to make a real good impression because we're going to get the candidates also visiting California'",
        "'speaker_9': ', visiting Long Beach. And great job, Steve. Great job to convention visitors bureau, great job to our hoteliers and great job to everybody here today because I'm really looking forward to Long Beach getting placed on the map. Thank you very much.'",
        "'speaker_0': 'Thank you very much. I'm just going to I want to just add first, I think, you know, Steve and Charlie, especially the two of you, are just an amazing team. And I want to start. You know, Charlie, I think you and and the SMG team just really do a great job and we're waiting now.'",
        "'speaker_0': 'It's SMG. Is that the right? The new name. The SMG team are doing a great job always with our facilities and our events and just we rely on you so much for for that work. And of course, to Stephen and the broader team and the board, I think our our economy in many ways is a tourism economy'",
        "'speaker_0': ', especially in this part of the city and the hotels that get full and the visitors and the restaurants. And it's all part of a really great ecosystem that we've created and we're really thankful you guys do a fantastic job.'",
        "'speaker_0': 'And I know that the the best days for all this work are really ahead of us still. And so just thank you for the partnership. Let's give them all a round of applause for our entire CVB team. And congratulations.'",
        "'speaker_0': 'And with that, we have a most honor and a second for the four item 22, which is this report and this action item. So please, members cast their votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. And we're going to do item number, the consent calendar, which is going to include item seven in the consent calendar, which is a CVB item which was on consent originally. So if I can have a motion in a second on consent, Mr..'"
    ],
    "Recommendation to, subject to review and consideration by the Personnel and Civil Service Committee in accordance with Long Beach Municipal Code Section 2.03.065, confirm Charter Commission appointments pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code; or in the alternative, if for some reason the Personnel and Civil Service Committee does not meet prior to or on October 8, 2019, waive the requirement for consideration and recommendation by the Personnel and Civil Service Committee in accordance with Section 2.03.065, and confirm Charter Commission appointments pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code.": [
        "'speaker_1': 'Ocean carries.'",
        "'speaker_0': 'Great. Thank you. We'll do our commission items next. We're going to do item 19/1 and then item 18. Thank you all very much. Madam Court, can you read item number 19.'",
        "'speaker_1': 'Item 19 communication for Mayor Garcia Recommendation to confirm charter commission appointments.'",
        "'speaker_0': 'Thanks, Mary Andrews.'",
        "'speaker_7': 'Yes, thank you very much. We had the meeting today with I item 20. That was item 21, I think 19. And so I'm going to pass that on to the mayor for the nomination for this item.'",
        "'speaker_0': 'Thank you very much. I'm going to thank you very much. Let me go ahead and move on to these items here. If I can ask all of our guests to just quietly exit as we continue. Thank you so much.'",
        "'speaker_0': 'I did. 19 is a recommendation from the Civil Service Committee for an appointment to the Ethics Commission, and it is a new appointment, and that is for Margo Morales. And Margo is a seventh District resident who currently serves on the Long Beach City Parks and Recreation Commission.'",
        "'speaker_0': 'She has also been an employee of L.A. County for almost 25 years, and in her work at L.A. County, does ethics and compliance work as well as part of her her responsibilities? Margo has a former member of the Pacific Gateway Workforce Development Board, the Fair Housing Foundation, the Fair Housing Congress of Southern California, and on the Cal'",
        "'speaker_0': 'State University Alumni Council. And she is retired actually from L.A. County as well. And so we want to thank her for her willingness to serve. And there is a motion and a second. So some of Councilmember Pierce anything.'",
        "'speaker_0': 'Councilor Marie Ringo.'",
        "'speaker_9': 'Thank you, Barry. And I want to thank Margo for stepping up and wanting to serve on this new commission. She'll be in the inaugural body for this commission. And I want to thank you for your service on the Parks and Recreation Commission in the past.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I want to thank Margo for stepping up to this important role. I can personally attest to her character and her leadership. I've worked with her hand in hand in multiple departments that she worked in. I remember the first time I met her back when she was with the Office of Public Safety.'",
        "'speaker_4': 'She has a breadth of experience that will really be critical to an organization such as this in a commission such as this, that needs the background and understanding of local government and the requirements. And she brings that to the table.'",
        "'speaker_4': 'So I'm really pleased with this appointment and strongly encourage my colleagues to support.'",
        "'speaker_0': 'And Margot, we're very excited to have you on board. We think you're going to be you've shown a excellence in the work you do with the Parks Commission, and we know you'll do the same here. So thank you.'",
        "'speaker_0': 'With that members, please cast your votes. Motion carries. Thank you. And. And think I'll give Margo a round of applause. And if Margo, you can hang out for a minute. We're going to take a picture in a second and we're going to hear the second commission item, which is item 18.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any subsequent amendments, with the Long Beach Unified School District, to staff School Resource Officers, in an amount not to exceed $218,071, with an estimated net cost to the Citys General Fund of $54,518; and  Increase appropriations in the General Fund Group in the Police Department by $218,071, partially offset by contract revenue.  (Citywide)": [
        "'speaker_0': 'Thank you very much. Let me go back to the agenda, which we did all consent items -12. If so, if I can please here. Item 12 on the consent. And I think the vice mayor has to recuse himself.'",
        "'speaker_0': 'So, Madam Clerk.'",
        "'speaker_1': 'Recommendation to authorize city manager to execute an agreement with the Long Beach Unified School District to staff school resource officers in an amount not to exceed 218,071, with an estimated net cost to the city's general fund for 54,518 and increase appropriations in the general fund in the police department by 218,071.'",
        "'speaker_1': 'Partially offset by contract revenue citywide.'",
        "'speaker_0': 'Thank you. There is a motion and a second on the item. Please cast your votes. Was no public comment. Oh, Councilman Pierce.'",
        "'speaker_5': 'Yeah. Thank you. I'm sorry. I had requested.'",
        "'speaker_0': 'Sorry. No problem.'",
        "'speaker_5': 'That's fine. I requested this to be pulled. Even if. Even if it didn't need to be. Just to ask a couple of questions. We've got a middle school in my district, and we know that the kids that go to the middle schools are residents in our city.'",
        "'speaker_5': 'And while school resource officers have sometimes been funded by the city and sometimes the school district, I wanted to get just a little bit of background because I do get a lot of calls about some of the bullying and things that happen, particularly in our middle schools in my district.'",
        "'speaker_5': 'So if we could just have a little bit of background on that, I have two questions.'",
        "'speaker_8': 'For Commander Laura Sarah Saleh and give a little bit of information on how we use as heroes, but also how we use other police officers when we have instances of concerns in the.'",
        "'speaker_3': 'School.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Good evening, Honorable Mayor and City Council. The Long Beach Unified School District is contract with Long Beach Police Department for Police Services through the School Resource Officer Program. Due to budget constraints within the school district, funding for the School Resource Officer program has been reduced over the past years.'",
        "'speaker_3': 'The school district has requested to maintain one school resource officer at Pali High School for the 1920 school year term. The city of Long Beach and the school district maintain a cost sharing agreement. The city is reimbursed up to 75% of the cost for the school resource officer during the ten months when the school is in session'",
        "'speaker_3': '. This agreement will result in reimbursement revenues totaling $163,553. That concludes my report and available for questions.'",
        "'speaker_5': 'Great. Can you answer for me how many of these positions have we funded in the past? And then can you answer for me how they work with our police officers outside of school? So if there's a situation that happens right outside of the school with whether it's a bullying or fight, how how did this officer work with'",
        "'speaker_5': 'our PD?'",
        "'speaker_3': 'Good evening, Council Member Pearce. In regards to positions that the school district has paid for in the past, we've had up to four school resource officers for a variety of high schools in the city. And in regards to the second question you're asking, we have an outstanding relationship with the school district and their school security.'",
        "'speaker_3': 'Any time there are any challenges on campus or around the campus, they don't hesitate to call us and we consistently work well with them on dealing with a variety of issues. Just this last year, going into this school year, we have a yearly meeting regarding police security related issues.'",
        "'speaker_3': 'And there was a lot of concern because if I could take you back about a year ago when we had the the Parkland, Florida school shooting, our threats to schools increased. At that time, we were being called as a police department, not only as initial responders, but to investigate a lot of these threats.'",
        "'speaker_3': 'We were working with closely with the L.A. County District Attorney's Office to resolve a lot of these. And the the teachers were very concerned about the students and what was going to happen to them. Obviously, some student or I'm sorry, some parents want to hear that the students were arrested and dealt with appropriately.'",
        "'speaker_3': 'But at the end of the day, the welfare of the children, both from a safety perspective of the ones being threatened and even the ones being doing the threatening to make sure that they're getting adequate resources, mental illness services and things of that nature.'",
        "'speaker_3': 'So between multiple agencies, we have a very good working, collaborative relationship that we enjoy.'",
        "'speaker_5': 'Okay. Thank you for that. Is this the request that was brought forward and how we get to this agreement? Was that done at the school board level or was that through through L.B. USD staff?'",
        "'speaker_3': 'The school board ultimately votes and makes the final decision. It's a recommendation from the Long Beach Unified School Staff. Um.'",
        "'speaker_5': 'Okay. Thank you for that. And just the reason why I asked again is because we've had a lot of bullying videos of gang violence with our junior high and my district and we've been working with the school board member and the principal and our neighborhood associations, but I wanted to make sure I asked those questions publicly so'",
        "'speaker_5': 'that we have a good next steps for our community members to try to make sure that we're working better to secure our our schools in the areas around our school. So thank you for that report. I appreciate it.'",
        "'speaker_3': 'Yes, ma'am. And if I can add something really quick, you just reminded me we do get videos that are reported. I'm sorry. Actually, I take that back. We get videos that come to our attention. Mm hmm. And one of the most frustrating things for us as a police department is most of these incidents are not being officially'",
        "'speaker_3': 'reported to the police department, and we're usually playing catch up. So for anybody who may be listening to us out there in our community is to stress that the minute somebody finds out that there is either violence, the threat of violence, that they notify either a school administrator as soon as possible or the police department so we'",
        "'speaker_3': 'can immediately address it, either respond to it, investigate it, and make sure it's resolved so that, no, none of our children get hurt.'",
        "'speaker_0': 'Thank you very much, Chief. We have a motion and a second. So, members, please cast your votes on that item.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. We're going to go back now to public comment and then we have the two hearings. The first set of speakers is, I believe Carlos via Larry Goodhew, Western Frontera and Jose Nanda, and then we'll do the next set.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Section 16.52.2300 relating to the designation of the properties located on the 6000 block of Walnut Avenue as the Grant Neighborhood Historic Landmark District, read and adopted as read.  (District 9)": [
        "'speaker_0': 'Thank you. Thank you very much. I want to thank you all for coming again. So with that, we will conclude public comment. I think we we went to public comment. Ready? Correct. Thank you very much. And again, thank you for coming out.'",
        "'speaker_0': 'We're now going on to hearing item number one.'",
        "'speaker_1': 'Report from Development Services. Recommendation to receive supporting documentation into the record and conclude the public hearing. Declare Ordinance Amending the Long Beach Municipal Code by adding section relating to the designation of the 19 properties on the 6000 block of Walnut Avenue known as Grant Neighborhood Historic District as a historical landmark district read for the first time and'",
        "'speaker_1': 'lead over the next regular meeting of the City Council for Reading and Adopt a resolution establishing a historic resources designation for the 19 Properties District nine.'",
        "'speaker_7': 'Fine. I'd like to introduce a speaker to be Rebecca. Mr. Carr.'",
        "'speaker_4': 'You had a vice mayor, Lynda Tatum, director of development services, and Christopher Coons, planning bureau manager, will be presenting this staff report.'",
        "'speaker_2': 'Just like to introduce our advanced planning officer, Patricia Defender for who will make the staff presentation for this item. Good evening, council members. Patricia Defender for staff of the Development Services Department of Planning Bureau. The item before you this evening is the adoption of an ordinance to designate the Grant neighborhood as a historic landmark district.'",
        "'speaker_2': 'The Grant neighborhood is located in North Long Beach and Council District nine. It is the first new landmark district to be adopted or be before the City Council since 2000 2003. You can see from this map the location in the north Long Beach area.'",
        "'speaker_2': 'The District comprises property is located in the 6000 block of the Walnut Avenue, bounded by 61st Street to the north, 60th Street to the south. Falcon Avenue on the east. And John Avenue on the West. To be eligible as a landmark district, the district must be a grouping of related properties that has a special historical, cultural, archeological'",
        "'speaker_2': ', architectural or esthetic value. You can see that on the right is the timeline for this district. An application was submitted in January of 2018. That's when this process started. Subsequently, a historic contact statement, a historic resource survey report was prepared.'",
        "'speaker_2': 'Community outreach was conducted. The Cultural Heritage Commission held the a hearing on the item in December of 2018 and made its recommendation that the council adopt the grant neighborhood as a historic district. In March of this year, it was heard by the City Council and there was a request made by the council that the city attorney prepare'",
        "'speaker_2': 'the ordinances. And so those ordinances and an accompanying resolution is here before you today. The Grant Neighborhood Historic Resource Survey found that many significant events that shaped and characterize the Grant neighborhood and its place in the broader history of the city, including the oil boom, the presence and influence of the defense industry and the Navy, and exclusionary'",
        "'speaker_2': 'housing practices and redlining. The survey also revealed that 17 of the 19 properties evaluated do contribute to the district and that the predominant architectural style is the Spanish colonial revival style. So the district meets both of the required criteria to be an eligible landmark district.'",
        "'speaker_2': 'The grouping of properties is significant because it has a unified architectural style and scale and it has shared planning features that include street trees, landscaping and uniform setbacks. It is a cohesive collection of residential properties that reflects Long Beach's economic boom of the twenties and the corresponding rapid residential expansion in the periphery of the city, which was'",
        "'speaker_2': 'aided by the rise of the personal automobile. It also meets the criteria for concentration of of contributing properties. 89% of the properties in the district are contributing. So with that, the and consistent with the Cultural Heritage Commission action of December ten, 2018, it is recommended that the Council declare an ordinance to amend the municipal code to designate'",
        "'speaker_2': 'the 19 properties on this block as a historic landmark, this landmark district known as the Grant Neighborhood District, and to adopt the accompanying resolution to establish the district. Thank you very much. Staff is available to answer any questions you might have.'",
        "'speaker_7': 'Thank you very much. And before we bring behind the taxes, I'd like to only public comment on this item. I have two individuals I think would like to speak very good here. And Jeff Roe. Afro.'",
        "'speaker_3': 'Oh. Oh, thanks very much. I want to just to thank you all four for considering this. A special thanks to you, Rex, for being the champion for this project. But also to Gina Casey, see us, Christopher Coons, Alejandro Placentia and Linda Tatum and to the city attorney's office for doing all the work that got us here today'",
        "'speaker_3': '. You know, I think I mentioned last time I was here, we thought this would be relatively easy. We'd fill out a few people, a little bit of paperwork and put up the blue on white signs, have a party and be done.'",
        "'speaker_3': 'Well, turned out to be vastly more complicated and meticulous than than than we had thought. And one of the things that was especially intriguing in this was that Gina's group and researching the history of the area. We thought, well, maybe there'll be some famous people over here, or maybe Ulysses Grant himself passed through at one point.'",
        "'speaker_3': 'But no Ulysses, no famous people. But what we did, what Gina, this group did find out, was that the original people who live there had put an imaginary fence around this neighborhood. It was only for white people. And I've wondered since then how different it might be if they had could come back today and see the neighborhood'",
        "'speaker_3': 'that they left behind. We have every ethnic group and and trait and people trace their origins on this block alone to every continent on earth. Our goal in this is to inspire and help adjacent blocks and other areas in District nine secure a historic designation and not just for the status of the blue on white sign, but'",
        "'speaker_3': 'because the process brought us together as neighbors in a quest to make our area cleaner, greener, safer and more prosperous. And we thought that that benefits us all and stands as the best legacy for our children and for those who follow us living in Grant neighborhood.'",
        "'speaker_3': 'Thanks again. I hope we can come back in the weeks and months ahead with additional blocks and to build on this other zone.'",
        "'speaker_7': 'Thank you as well. Yes, Councilman, I register.'",
        "'speaker_6': 'Thank you much, Mayor Jeff and the Grant neighborhood. You know, this initially began the conversation at the neighborhood association about, you know, restoring the old fire station, greening the old fire station, planting trees. And you guys are certainly working through your whole little, little list of projects on your your white legal pad.'",
        "'speaker_6': 'So congratulations to you, Linda Christopher. A lot of great work happening in North Lombard centered on development services. We we are proud and thankful to have you, you know, leading this this work. And there's a lot more a lot more for us to do.'",
        "'speaker_6': 'But this is certainly important to North Palm Beach and her our you know, our staff. It's notable to the city's history. And so that that that means a lot. So thank you so much. And I look forward to supporting this.'",
        "'speaker_7': 'Thank you. Thank you. Councilman Richardson, I'd like to thank them. No, everything's fine. Well, good. See, no more, you know, speakers on the devices for this. Can we please call a vote?'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Section 16.52.2310 relating to the designation of the Ferguson House located at 1500 East 1st Street as a Local Historic Landmark, read and adopted as read.  (District 2)": [
        "'speaker_2': 'Motion carries.'",
        "'speaker_7': 'Thank you. Now we'll go to hearing number two.'",
        "'speaker_1': 'Report from Development Services recommendation received supporting documentation under the record, conclude the public hearing. Declare ordinances amending the Long Beach Municipal Code by adding section relating to the designation of four properties located at 1500 East First Street 5281 East El-Arabi Street 3200 East First Street and 3735 Pine Avenue.'",
        "'speaker_1': 'As historic landmarks read the first time and lead over to the next regular meeting of the City Council for Final Reading and adopt resolutions establishing a landmark designation for the four properties districts two, three and seven. There will be four votes required for this item.'",
        "'speaker_1': 'One for each address.'",
        "'speaker_7': 'Thank you. I'd like to say hello to Mrs. Garner at this point.'",
        "'speaker_4': 'Thank you, Vice Mayor. The staff report will be presented by Linda Tatum, director of Development Services, and Christopher Coons, Planning Bureau manager.'",
        "'speaker_2': 'And we will introduce our historic preservation planner, Mr. Alejandro Placentia, to make this that presentation.'",
        "'speaker_3': 'Thank you. So tonight's request involves the historic landmark designation of four different properties that we have throughout the city of Long Beach. Four of those addresses are 1500 East First Street, 3200 East First Street, 5281 East L Roebling Street and 3735 Pine Avenue.'",
        "'speaker_3': 'So the timeline here, the application for 1500 East First Street actually started last year. But this is sort of a winding process to get through this. The other three applications add on 3200 days. First Street and Robles and Pine Avenue were actually filed in February of this year and went through the Mills Act process and that's how'",
        "'speaker_3': 'they came before Development Services. As part of this process, the Cultural Heritage Commission holds hearings for each of these properties. They evaluate each of the individual properties. And in this in this case, they found that these four properties meet the criteria for landmark designation pursuant to the Cultural Heritage Ordinance here in the city of Long Beach.'",
        "'speaker_3': 'That commission, the Cultural Heritage Commission, made their recommendation to the City Council to approve those based on their independent evaluation. That. This. This is in order to qualify for landmark status, at least one of the following criteria needs to be found in the affirmative.'",
        "'speaker_3': 'So we have four criteria out of these. At least one of them needs to be found. Criterion A is specific to the association with the city's history. Criterion B is having a specific association with significant people in the city's history.'",
        "'speaker_3': 'And Criterion C is probably the one that we use most that relates to architecture and craftsmanship associated with the building. And last one criterion D is really associated with pre-history and archeology. So we'll just run you through the applications that we had here.'",
        "'speaker_3': 'The first property for consideration is located at 1500 East First Street. The CHC made two findings of approval for this. One, just finding a that the building's construction during the early 20th century is that a great association to the expansion period and the contribution of the broad patterns of the city.'",
        "'speaker_3': 'Finding C recognizes that the building is unique and an excellent example of a two story craftsman building. This one is particularly unique for its Japanese influence, and those are noted in the roof eaves and the roof ridge here.'",
        "'speaker_3': '3200 East First Street. That one is. The commission made two findings finding a and finding see the first one for city history as well as finding C for architecture. Item number three is a really unique property here. This is an art.'",
        "'speaker_3': 'That's the building designed by a famous architect, John Lautner. This is the only Lautner designed building that we have here in the city. The very last one at 3735 Pine Avenue is significant for its association with an important architect, Paul Taylor, and also for its mid-century architecture as well.'",
        "'speaker_3': 'With that. We have a recommendation to approve this these items tonight. Thank you.'",
        "'speaker_7': 'Fine, thank you. We have a mr. Good here. You're going to speak on this all. Okay. We'll call him in the diocese. Councilman Pierce. I can't tell you whether. Fine. Okay. One. Would you please call the vote?'",
        "'speaker_1': 'For the property at 1500 East First Street. Please cast your vote.'",
        "'speaker_7': 'You have three votes. Honestly? Well.'"
    ],
    "Recommendation to request City Manager, or his designee, work with Public Works Department and return to Council with a To/From/For memorandum and a receive and file presentation within 90 days;  In addition, request City Manager, or his designee to provide recommendations to improve the current policies/processes surrounding tree infestations; a cost estimate for the removal and replanting of all affected magnolia trees within the City's boundaries; and a cost estimate for water blasting all affected sidewalks to remove the Tulip Tree Scale secretions.": [
        "'speaker_0': 'Thank you. I will hear the next item, please to believe is 20.'",
        "'speaker_1': 'Communication from Councilmember Arango, Councilmember Pierce, Councilwoman Price, Vice Mayor Andrew's recommendation to request City Manager to work with public works department and return to council with a two from four memorandum and a presentation within 90 days on the Magnolia Tulip Street Scale.'",
        "'speaker_1': 'Comprehensive Update.'",
        "'speaker_0': 'Thank you. There's a motion in a second. Let me start with Councilmember Ranga.'",
        "'speaker_9': 'Thank you, Mayor. And before I begin, I want to thank my council colleagues, Councilmembers Pearce and Pryce, and also Vice Mayor Andrews for joining me on this important item here. A few years ago, I started receiving a lot of calls regarding magnolias and tree sap that were damaging not only cars, but streets and sidewalks.'",
        "'speaker_9': 'So as it's typically done, when we get calls like that, we get the arborists to go out and visit the the trees and see what is going on with them. The arborist concluded that there was a disease that was taking place in a few of those trees and they started a treatment to get them well.'",
        "'speaker_9': 'As time went on, we began to discover that the tree sap, which is not not toxic per se, but it is a thick soot that basically is a black and tar like that, basically hugs the ground and makes it very sticky and as well as on the street and also damages carpet.'",
        "'speaker_9': 'So we were finding that neighbors were not parking their cars under their trees and parking them elsewhere and creating all kinds of other havoc in the neighborhood. So as you arborists were treating these trees, we were getting more calls from other parts of the district now of experiencing the same the same issue with Willows Magnolias.'",
        "'speaker_9': 'So beginning earlier this year, we decided that this is an ongoing issue and it's a growing one. Come to find out that once we put this on the item that had my council colleagues join us in citing this issue, because it now that the SAP was beginning to appear in other parts of the city as well in'",
        "'speaker_9': 'other districts. So what I'm trying to do here today is to direct staff to look at the tree SAP issue and with the what's going on with the magnolias. The arborist has determined that the disease that these trees are experiencing is called to the tree scale.'",
        "'speaker_9': 'Basically, it's a pest that gets into the trees, it gets into the branches and it starts killing them. The response of the trees is like I like to liken it like to a body. When the body gets infected, it puts out its white, white blood cells to kill it.'",
        "'speaker_9': 'Well, the trees do the same thing. They start crying with their out, their sap, trying to get rid of the pest. But as you see here in some of these pictures, it gets really, really pervasive in terms of the tree set that that is that it deposits all over the place and could see right here the sap'",
        "'speaker_9': 'that goes out to the vehicles. And it's very liquidy, as you can see, and it's also very sticky. So the the item that I have here before you is to basically direct staff to take an inventory to get to give us some data in regards to the magnolia trees.'",
        "'speaker_9': 'By, first of all, counting how many trees are there in the city, how many are deceased? How can we treat them? What can we do to get them? Well, again, what can residents do if they have a magnolia tree that's infected in front of them in their yards?'",
        "'speaker_9': 'What can they do to preventive maintenance for preventing the the pests getting into their trees? So with that, I'm also wanting to get to a recommendation of some policies perhaps or some processes that we can include for the treatment of these trees and also getting some estimates as far as what would be the difference between.'",
        "'speaker_9': 'Fixing. One can fix a tree, but you can cure it. Cure curing the trees, treating them, removing them, and or eventually getting rid of them, as well as looking at what the cost would be for removing some of the the soot that you see right here on the sidewalks and on the streets and what the cost would'",
        "'speaker_9': 'be to get rid of that. It becomes a so not only a blight for the neighborhoods and for the houses that were there front of, but getting rid of those trees would really increase, would make the neighborhoods a lot better and more walkable.'",
        "'speaker_9': 'I walk my dog, for example, and I have to go around because walking through it, it is very sticky and and I don't want to even think what it does to the paws of my pets. So with that, I hope that I can get the support of my council colleagues to push this request forward and come back'",
        "'speaker_9': 'in around 90 days with a presentation and a policy as to how we can proceed with these trees. They pass it on.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'Thank you. I want to thank Councilman Ranga for bringing this item forward. This is so relevant right now, and I was excited to hear that he was bringing this item because it's a very relevant topic of conversation in the Alamitos Heights neighborhood of the city.'",
        "'speaker_2': 'We have about. 824 magnolia trees in the Alamitos Heights area. And I know that several of the trees have obtained are showing signs that there might be infested with this disease. So I'm looking forward to the report back.'",
        "'speaker_2': 'And I know that in our neighborhood we are going to have a community meeting just to give everyone an update about what's going on, because a lot of people have seen the sap and don't really know what it's connected with or what's causing it.'",
        "'speaker_2': 'So we will probably have a community meeting in the next three weeks to educate the community on what we're dealing with and what some of the recommendations are moving forward. So thank you, Councilman, for bringing this item forward and I appreciate the opportunity to sign on.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_7': 'Yes, thank you, Mayor. First of all, I'd like to thank my county councilman Evinger for allowing me to come on this item with him, because, in fact, my portion regarding the, you know, homes at the hundreds of the beautiful trees in the, you know, mature, you know, magnolia trees, they are part of what creates the beauty and'",
        "'speaker_7': 'tranquility and neighborhoods in which we live in. But unfortunately, many of these trees have come infested with scales. We need to do everything we can in trying to save as many of these trees that we can. If we can't remove the some of the, you know, the most disease ones, then will have to do and eventually, I'",
        "'speaker_7': 'think will do, you know, and now we're going to have to lose them. All that would be would really would be a tragedy because these are very beautiful trees. But I think if we can sit around and do the things we were supposed to do, get some type of, you know, at least we can get some kind'",
        "'speaker_7': 'of data on finding out what we can do and what we can't do in order to save these trees. So I'm really asking my supporters to please join me with this item and and supporting this. And thank you for bringing it to the diocese.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I want to thank both Councilman Price and Councilmember Otunga in that through the budget process, we already started discussing the challenges ahead and we were able to, even though we don't have a solution yet, set aside some funding that could be used when a solution is determined.'",
        "'speaker_4': 'So I appreciate that being brought to the attention of the committee in advance. I think this kind of thing is only possible when there is funding for it. And so the forward thinking of those colleagues that have magnolia trees is is critical.'",
        "'speaker_4': 'And I'm very I think it's notable that they be commended for their forward thinking.'",
        "'speaker_0': 'Thank you. We have four members of the public. Please line up and order Heather Stemmer to lead Stomatal orders and I apologize if I mispronounce it. Mr. Goodhue Mr. Horner via and I think it's Annette Aguilar. Please come forward.'",
        "'speaker_4': 'Good evening. I have some additional photos if if you guys are open to looking at them as well.'",
        "'speaker_0': 'You can pick them to the clerk right after. Actually, just give me after they speak.'",
        "'speaker_4': 'Okay. So I'm here tonight with my neighbors. I live at 37 Golden Avenue. And in front of my house, there's two infected trees. And they each have one infected tree that's about ten feet away from my property line.'",
        "'speaker_4': 'So you can imagine with pretty much any direction the wind blows, I'm getting this sap from three different trees at the same time. It is a very sticky substance and very thick once it lands and once it's on the tree.'",
        "'speaker_4': 'But something else to consider is that it's very easily airborne. It blows out into a very fine mist and gets everywhere. It's as has been discussed, it's ruining paint on cars, on homes. It's actually damaging the screens on my windows in the front, which are less than ten years old.'",
        "'speaker_4': 'And that company has already said that that's not going to be covered under warranty because it's just unusual circumstances. It's caused. Insect infestations year over year. I've we've I've had bees so bad three years in a row that we had to hire exterminators to come out.'",
        "'speaker_4': 'They couldn't even just rescue them. They had to tear off the whole back of my garage. Ants year after year after year that have caused hundreds of dollars in food loss. There have been times where you prepare dinner and you set it out and you can't even have dinner before there's ants coming out.'",
        "'speaker_4': 'Everything has to be sealed up in airtight containers all year long. All the time. Just about a month ago, a branch fell. I think it's a little bit worse than than you guys are understanding to or at least some of the trees are a little bit further in the decay process than than do you know, my neighbor'",
        "'speaker_4': 'had a branch that was roughly five inches thick and about six feet long fall off. I was standing out in front of my house. It glanced off of his car, luckily didn't cause any damage. But we're half a half a block from Bernie Elementary and there's at least a dozen larger branches on our for trees that are'",
        "'speaker_4': 'ready to fall off. Two of the trees are visibly leaning towards the street. We've been trying to reach out to the city, all four of us, for several years now. Marilyn was able to get one of her trees trimmed, one branch last year, and that's it.'",
        "'speaker_4': 'I mean, we don't get much in the way of return correspondence on what is going to happen. I did get the you know, the notice from councilman you're on his office that this was going to be discussed tonight so that I could come and talk to you.'",
        "'speaker_0': 'Thank you so much. Thank you. Thank you. I'm Mr. Goodhue. Next up.'",
        "'speaker_3': 'When you think about it in many respects. This is what's happening. Throughout this city. With marijuana and vaping. People doing that walking down the street. The same infestations of disease. Are entering people's bodies. By inhaling. What those people are exhaling.'",
        "'speaker_3': 'And that provides a solution of how we deal with that other subject, essentially cut them down and ship them out someplace before they infect. More people, particularly the kids. Thank you.'",
        "'speaker_0': 'Thank you. Next up is Mr. Horn Via.'",
        "'speaker_8': 'Hi. Good evening, Mary. Council members. First of all, I would like to bring to your attention a quote from the Department of Public Works. And as well-intended it is. And in a lot of the hard work that's coming in from the public works, I think it's a really interesting quote.'",
        "'speaker_8': 'And it follows. As such, the Public Works Department is committed to preserving and protecting the community's urban forests and promoting the health and safety of the trees from the time they are planted through maturity. However, as I mentioned, as well-intended as it may seem.'",
        "'speaker_8': 'Misdirected priorities. A lack of funding have left our urban forests vulnerable to infestation and death due to lack of watering, proper maintenance and importantly, lack of planning. Back in 2015, Citi Order estimated that the value of park trees was in the vicinity of $112 million.'",
        "'speaker_8': 'That's not including street trees, nor the additional quantifiable benefits of warming forests that would undoubtedly increase the value of the assets by millions more. Therefore, I applaud the decision by Councilmember Robert Tharanga in bringing the subject to the forefront once again.'",
        "'speaker_8': 'This is an issue that many of us in Long Beach, including city staff, have attempted to address. If you're years ago, back in 2016, actually, station worker also addressed a similar issue known as the Urban Tree Canopy Assessment and Management Plan.'",
        "'speaker_8': 'Eight years before that, Public Works also brought to the Council the Urban Force Master Plan, which was received and filed. Therefore, it is necessary that it be clearly addressed now and that the city developed the necessary structure to develop the Urban Forest's vision and clearly see it for what it is an asset, not a liability.'",
        "'speaker_8': 'Now, the issue that has prompted Councilmember Ranga to step up know we've clearly heard it is the magnolia scale of the problem affecting is affecting not only trees in our urban canopy. It is also affecting the quality of life of residents in District seven, District eight, District two, and throughout the city.'",
        "'speaker_8': 'As we deal with the results of climate change and pollution that are nearly affected, there are clearly affecting all of the residents of Long Beach, but more notably West Side and North Long Beach. Therefore, many residents and organizations throughout the city will like to join your effort in developing a long range strategy and offer our assistance.'",
        "'speaker_8': 'Moreover, we also proposed to the city a suggested treatment method that we feel will be the best step in addressing a tree scale issue. The suggestion comes after various conversations with the University of California Cooperative Extension personnel and other knowledgeable experts of the field.'",
        "'speaker_8': 'However, as we look to the long term success, we must encourage the city. To be proactive, to proactively maintain our urban forest by hiring competent urban forester to adequately to add to with adequate resources to oversee the vast number of trees and increase the forest areas throughout the city.'",
        "'speaker_8': 'Thank you very much for your time.'",
        "'speaker_0': 'Thank you very much, sir. And that gore.'",
        "'speaker_2': 'Hello, Signor Roberto Ranga. I just found out today that you're my council member. I am your constituent. I'm glad to be here and meet everyone and all the council members for Long Beach. I recently moved to Long Beach and I'm not going anywhere.'",
        "'speaker_2': 'I'm staying here. I'm a first time home homeowner, and it took a lot of effort for my family, for myself to get into our first home. These two months have been a nightmare for for myself, for my daughter, for my husband.'",
        "'speaker_2': 'Every time we drive into our home, we can see the darkness from the six magnolias that surround my house on the street. You can see how dark and black they are. So it's like a horror movie, just just the site itself.'",
        "'speaker_2': 'Once we get in there, all the tarp from the outside, we take in two of the driveway into the back of our house. All the leaves are constantly falling because of the type of tree are getting that black powder into our home.'",
        "'speaker_2': 'And when we rape and pick up the leaves we're smelling and we're worried about our or about our health. Also, I don't know if a lot of people have mentioned this, but there is a bad smell, very extreme bad smell, especially with the heat.'",
        "'speaker_2': 'So I think I just came in to walk into my first home and the worst time, which is the heat that drops. And this thing is raining, I think. Signor Roberto, it's a little bit more than just, you know, walking the dog and trying to avoid the street.'",
        "'speaker_2': 'It's a smell. It's constant rain and the months of heat and is just it's just a nightmare. And I think that I moved to Long Beach to to. To make sure that whatever we bring as a family is to make the city better.'",
        "'speaker_2': 'To care for the house that we purchase. To be a good resident. But when I see how the streets are broken up, the pavement is making a puddle of this tarp right in front because it's so broken. So even if I try to wash, which I wash the the sidewalk, all the water that I'm throwing, it just'",
        "'speaker_2': 'gets together. And there's this tart that starts fuming, all this smell, and it just stays there. So I have a puddle of tar of the smelly thing, and even if I wash, it makes it worse, Senor Roberto, because I'm just releasing more of the tar in the smell.'",
        "'speaker_2': 'So it really is a nightmare. It's evaluating. Maybe my house, I was told by public works, it's been four years now and I there's no more time for this. You know, maybe we'll put it in and we'll try to figure out.'",
        "'speaker_2': 'I think it's only going to get worse. And we wish our next summer that tree is gone and that we have a baby tree that we're going to attend to and care for. So we would like to have those trees removed and for the money to be available, because we were told by public works that it's a'",
        "'speaker_2': 'question of of money. So if you can please chop up those trees and thank you.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you for that. Councilman, your anger.'",
        "'speaker_9': 'Yeah. I want to thank those individuals that came forward today to talk about the this this issue. Obviously, our concern is to get these trees well, cutting the trees is our last resort. However, we understand that that might need to happen because some of them will be so far gone that we can't salvage them.'",
        "'speaker_9': 'As Councilmember Stacie Mango mentioned, we did do a little forward thinking on this to set aside some funds so that we could manage this issue with with the this too, the tree scale pest that's affecting our trees. And also as as it was presented earlier, it's spreading to it might be spreading spreading to other trees as well'",
        "'speaker_9': '. So we need to address that issue as we move forward. So it's a it's an issue that we need to take care of. It's one that came has come forward to us within the most recent times because of the growing infestations going on.'",
        "'speaker_9': 'At first it was something that we thought we could take care of with a with an arborist and treating a few trees here and there. But we now know that it's a much larger issue than we first thought.'",
        "'speaker_9': 'So my my challenge that's not my challenge. My request to the public works department to staff is to come back with a plan to get these trees well. And if not, then let's talk about how we can replace them or have other types of trees planted in that spot.'",
        "'speaker_9': 'But it's going to cost. We know that we have the money set aside for it. And if and I encourage anybody who has a magnolia tree in front of their house that they think is experiencing this pest infestation, to please contact our office, call us or call the city manager's office and identify your your neighborhood or the'",
        "'speaker_9': 'trees so that we could include it into our inventory, because that's what we're trying to do. We're trying to collect data and we're trying to find out where these trees are, how many there are, how many are sick, how many have been treated, and how many have responded to the treatment.'",
        "'speaker_9': 'And we also want to be able to provide you, the residents, with information as to how you can also provide some preventive maintenance on your trees if they're well, right now, the last thing we want is to get your tree sick.'",
        "'speaker_9': 'So there's opportunities for here for us to be able to provide you with the information you need to has a preventive maintenance on your trees as well as getting them. Well, again, like I say, the last thing we want to do is to kill trees, chop them down, we want to keep them.'",
        "'speaker_9': 'But if we can't, then we need some alternative ways of being able to handle this in this situation. So again, I want to thank you for coming here this evening and for sharing your thoughts. And feel free to contact my office at Erika by 625707777.'",
        "'speaker_9': 'Should you have any other concerns that you want to raise with us regarding that? So with that, I'll pass it on to my colleagues.'"
    ],
    "Recommendation to request City Manager to provide a report within 90 days on drug use, addiction, overdose, and death statistics in Long Beach over the past 5 years, as well as the City's approach to this.": [
        "'speaker_0': 'Thank you, Councilmember Ringa. And with that members, please cast your votes to receive and follow the report. And thank you to all those that came out I know that are going to be look obviously are looking forward to public works addressing this issue as well.'",
        "'speaker_0': 'And we're moving on now to item 21, please.'",
        "'speaker_1': 'Communication from Councilwoman Price, Councilmember Supernova Vice Mayor Andrews Councilman Austin Recommendation Request City Manager to provide a report within 90 days on drug use, addiction, overdose and death statistics in Long Beach over the past five years.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_2': 'You know, this is really a follow up item to one that I brought in October of 2017, asking the city to get a little bit more involved in our judicious opioid prescribing campaign that reaches out proactively to medical health professionals in regards to judicious prescriptions of opioids.'",
        "'speaker_2': 'Additionally, one of the things that we had really asked for in 2017 was that the city's website and other information clearly indicate certain information connected to opioid addiction and opioid abuse. And and so I've had an opportunity to to look at some of the follow up work that's been done and really would like to see us continue'",
        "'speaker_2': 'to make this a priority and make education and outreach in this regards a priority. And while I understand that our situation here in the city of Long Beach is not as bad as other places, I really don't think that's the standard that we should be basing our efforts and our progress on.'",
        "'speaker_2': 'I know that as a council member in the third district, I have met with many families who are dealing with a very difficult situation of having children addicted to opioids. From there, we're seeing a lot of people continue that addiction and it leading to an addiction to heroin.'",
        "'speaker_2': 'We've seen more overdoses in the city of Long Beach than we should for a county of our size and a city of our size. And so I'm hoping that we are going to continue to stay proactive in regards to what our efforts are.'",
        "'speaker_2': 'The other thing that I wanted to highlight is that one of the items that we brought to public safety a few years ago was that I wanted all of our police officers to be equipped with Narcan so that they could reverse the effects of an overdose.'",
        "'speaker_2': 'And so to the extent that it's not included in this study that's going to come back, I would like an update from that in terms of where we are with that, because my understanding is that where all of our first responders are not equipped with Narcan at the present time.'",
        "'speaker_2': 'There was a list of nine proposals that came back as a result of our October 17th to October 2017 item. And I want to find out which of those have been implemented and which of those our health department continues to pursue in looking through the Health Department website.'",
        "'speaker_2': 'I think we could do a much better job of mentioning our efforts to address the issues around addiction and specifically around opioids, prescriptions or illegal drugs and the issues that we're currently facing with fentanyl being found in multiple substances that are being used.'",
        "'speaker_2': 'We know that nationally it's killing 70,000 people a year and this is more deaths than we saw during the height of the HIV crisis. So I hope that this request for additional data can give us, as a city, adequate information so that we can develop a comprehensive approach to this issue and take into account the reality that'",
        "'speaker_2': 'we have here in Long Beach. As we've often said, we're a very diverse city, and while heroin may not be heroin or opioid addiction may not be an issue in some parts of the city, it may be an issue in other parts of the city.'",
        "'speaker_2': 'I know that regionally there is a real focus to try to be proactive on this issue in terms of prescription drug use, because for many people, that's where the addiction starts. So I ask my colleagues to support this item, and I look forward to receiving the report so that we can lay out a plan as a council'",
        "'speaker_2': 'in terms of how we want to make sure that we approach this issue and not have any more overdoses in our city related to heroin, or at least minimize the occurrence of such.'",
        "'speaker_7': 'Yes. I want to thank counsel. Thanks for bringing this item forward, because I think that it is very vital that we use M.E. as much as that of possible when we create a policy, you know, a public policy.'",
        "'speaker_7': 'And I want to thank my colleagues, you know, Mrs. Price, for this. And she has my whole life support on this because I think it's so important that we all get all the information that needs possible, because you guys have seen the situation, you're seeing the affect of it.'",
        "'speaker_7': 'So please give with this and make sure that we save lives with it. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilor Pearce.'",
        "'speaker_5': 'Thank you. I want to thank my council colleagues for bringing this item back. I remember when it was in front of us the first time. As I mentioned earlier, my one mother passed from domestic violence and my adopted mother from opioid overdose suicide.'",
        "'speaker_5': 'So this is an item that's really important to me. I think the opioid crisis is something that we have to continue to talk about. But I understand that here in the city of Long Beach, we also have heroin and other high numbers.'",
        "'speaker_5': 'And so I look forward to seeing those numbers included in the report back. I know I spoke with Kelly and asked her to do that for us. I also know that we trying to do, you know, at least at Bixby Park, we're in the process of trying to to purchase boxes to allow for needles to be put'",
        "'speaker_5': 'in there when we clean our park. It is horrendous the number of needles that we see. And in our playground area, I know that there are some cases where there's a medical. Box where you can put your prescription drugs.'",
        "'speaker_5': 'And I know that that is something that we are trying to get to. I just want to publicly say that that's something I definitely support in the city of Long Beach. I know that not all the companies that provide the needle boxes do the same thing with prescription drugs.'",
        "'speaker_5': 'But as somebody who grew up with a lot of prescription drugs in her home, I know that that often is a place where youth and kids can kind of get their hands on things at an early age. So I hope that we can include that in the report back as well.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_0': 'Council Member Council Um, Price.'",
        "'speaker_2': 'Just on that note, I, I think it's great for the Health Department to come back with information regarding needle disposal boxes. I am not supportive of having those in the city, but we can have that discussion another day.'",
        "'speaker_2': 'But I do think it's very relevant in light of some of the topics that we've been talking about as a council that were finding needles in the park where children play, which is why I think we need to be very vigilant about the activities that are taking place in the park, under which hours activities are taking place'",
        "'speaker_2': 'in the park because of the public health concerns. So, you know, I think it's that's a bigger discussion. And I agree with council member Pierce. I think we should see that information in the report back so that we can know what our options are.'",
        "'speaker_2': 'But I do want to highlight that this particular report is focused on what we can do as a city to prevent drug use, to prevent addiction and to prevent overdose. And so I'd like to know the options of needle exchange programs.'",
        "'speaker_2': 'I'm not sure that that particular issue prevents drug use. It allows for safe drug use, but that's not really the scope of this item. So I just want to make sure that that I'm clear that I would love to have that discussion.'",
        "'speaker_2': 'But the goal of this item is to get people to not use heroin. So thank you.'",
        "'speaker_0': 'Mr.. Good for public comment.'",
        "'speaker_3': 'Very briefly handle this the way you would handle a disease tree, as I referenced earlier. Thank you.'",
        "'speaker_0': 'Please cast your votes.'"
    ],
    "Recommendation to adopt resolution in support of the County of Los Angeles' Amicus Brief in support of the petitioner City of Boise v. Robert Martin on petition for writ of certiorari in the Supreme Court of the United States.": [
        "'speaker_1': 'Ocean carries. Communication from City Attorney, a recommendation to adopt a resolution in support of the County of Los Angeles's Amicus Brief in support of the Petitioners City of Boise versus Robert Martin.'",
        "'speaker_0': 'She could hear any public comment. There's a motion and a second. Members, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'We're now on the second motion.'",
        "'speaker_3': 'Motion fails. It's a resolution to support.'",
        "'speaker_9': 'And you need five votes for a resolution.'",
        "'speaker_3': 'Or an ordinance to pass. Okay.'",
        "'speaker_0': 'Let me. Okay. So there's. So the motion fails.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_8': 'Pursuant to the charter resolution and an.'",
        "'speaker_3': 'Ordinance, each need five votes to pass. Okay.'",
        "'speaker_0': 'Okay. Moving on to item. The second public comment period. I'm assuming Councilwoman Mongeau is gone for the evening. Okay. Well. Yeah.'",
        "'speaker_2': 'Can it be agenda for the next meeting?'",
        "'speaker_8': 'Yes, you could.'",
        "'speaker_3': 'You could bring it back for.'",
        "'speaker_8': 'A vote at a subsequent meeting. Yes.'",
        "'speaker_2': 'Do we need to vote to bring it back or just Brandeis with the clerk's office?'",
        "'speaker_8': 'That's correct. We could. You could agenda it as a item on on a subsequent meeting. Yes.'",
        "'speaker_2': 'Sounds good.'",
        "'speaker_0': 'And let me do the second public comment period. We have. Is Michael Stewart here? Is Ray Lawson here? Okay. Great. Thank you. With that, we will adjourn the meeting. Thank you. I'm sorry. New business with any announcements from the council.'"
    ]
}