{
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and all necessary documents and any subsequent amendments, including amending the award amounts, with the Los Angeles County Development Authority, to accept and expend Community Development Block Grant (CDBG) funding in an approximate amount up to $254,000, to implement a Homeless Court Pilot Program in Long Beach, for the period of April 1, 2021 through June 30, 2022, with the option to renew for three one-year periods, at the discretion of the City Manager; and  Increase appropriations in the Health Fund Group in the Health and Human Services Department by $254,000, offset by grant revenue.  (Citywide)": [
        "'speaker_0': 'Okay. Now we'll do item 11, please, on the consent.'",
        "'speaker_1': 'Recommendation or a report from Health and Human Services and City Prosecutor, a recommendation to execute an agreement with the Los Angeles County Development Authority to accept and expend CDBG funding to implement a homeless court pilot program citywide.'",
        "'speaker_0': 'Thank you. I think we had a request from customers and they have to hear a staff report on this.'",
        "'speaker_3': 'Yes, Mr. Mayor.'",
        "'speaker_0': 'Right. Staff report, please.'",
        "'speaker_3': 'Yes, Mr. Mayor, this is a wonderful program. We have both our city prosecutor and our director of Health and Human Services, Kelly Collopy, to give a report. Doug, if you can maybe go first. Okay. Kelly, I think we have Kelly now.'",
        "'speaker_3': 'Kelly, if you can give the staff report for item number 11, please.'",
        "'speaker_0': 'Hello?'",
        "'speaker_5': 'It's. Of the. The Homeless Services Court is the best practice model that is there. So the homeless services file and we see it around the country.'",
        "'speaker_2': 'It operates in L.A..'",
        "'speaker_0': 'County as.'",
        "'speaker_5': 'Well. It will be operating at the at the monthly service center one day per month. And we'll be starting with folks who are known to us in homeless services, really starting to work with them, to engage them in services, to be able to do expungements and those sorts of things.'",
        "'speaker_5': 'And then from that space, we'll also be bringing in a judge who will begin to work with others who may not be as known to us, but that will that are homeless and, and working to remove their different citations and others.'",
        "'speaker_5': 'So one of the best things about this is one of the multi-service centers that is easy to access, too, is that we'll be able to consistently engage with them, to be able to provide them services and support. And then the third is it's often like warrants and other sorts of things, misdemeanors that keep.'",
        "'speaker_2': 'People from the opportunity of housing or.'",
        "'speaker_5': 'Employment for others. And so this opportunity allows for those to be addressed and to be able to expunge those so that we're supporting people in their ability to get the services they need. With that, I'm open for any questions.'",
        "'speaker_0': 'Was there going to be anything additional, Mr. Monica.'",
        "'speaker_3': 'I think the city prosecutor was looking to contribute as well. But right now we don't have him on the line. So I think that's it for now. Thank you.'",
        "'speaker_0': 'Okay. Councilman in the house.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And a huge thank you to our health health department director Kelly and our city prosecutor, Doug Ford, for this program, for this pilot program. I'm super excited about it. And I feel better that I needed to pull this off of the consent calendar because it is a very important program.'",
        "'speaker_2': 'And I wanted to make sure that we had a little bit more on it and about it. So I really appreciate you, Director Kelly, for for giving us a little bit more on this. And I'm really excited about this.'",
        "'speaker_2': 'I know that my residents continue to see our homeless crisis as one of their top concerns in our district. And I know that this doesn't only affect the first district, but also, you know, city wide. So that's I I thought that this was very important to to bring off of the consent calendar as well.'",
        "'speaker_2': 'I think that it is very important that we do everything possible to make sure that our unhoused neighbors have the services that they need in order to get out of that cycle and be able to, you know, become the people that they're trying hard to become, which is housed and healthy and they're going to follow.'",
        "'speaker_2': 'And those and sorry, I'm hearing feedback. If if everybody could please mute, that would be great. So yes. So I just want to make sure that we provide our unhoused neighbors with as much services as we can. Also, as we move forward, I strongly encourage that.'",
        "'speaker_2': 'We also continue to include our amazing homeless service providers and our continuum of care partners in this process, and so that they can also help in shaping this program, because they're they're the ones that are out there day in and day out with our unhoused neighbors and really do know the needs of them and what is working'",
        "'speaker_2': 'and what is not working. And I just can't thank you enough, both the health department and our city city prosecutor for trying to find innovative ways to be able to help our residents get on the right track again.'",
        "'speaker_2': 'So thank you. Thank you very much. And I look forward to seeing the results of this program.'",
        "'speaker_0': 'Thank you. I have a report. We move on to the second and then I have a few councilmembers lined up to speak. I just want to add, I don't know that Mr. Marechal mentioned it, but the resources are coming, I believe, from the county.'",
        "'speaker_0': 'I think the county is helping host and sponsor this. So I also want to make sure that we thank Supervisor Hahn and just the county team. I know they've been working with the city prosecutor and staff on this.'",
        "'speaker_0': 'And so just wanted to note that I mean, I know it's in the report, but I just want to pull that out from the report as well. We have a second by Councilman Price.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And thank you, Councilwoman Zendejas, for pulling this item from Cannes. Said, I'm so glad that you did. It was a great idea for you to do that. This is part of a collaborative court model that I'm a huge fan of.'",
        "'speaker_2': 'I staff collaborative courts myself every single week and every single day. Me and my team of over 20 attorneys refer people to homeless court in Orange County every single day. And it really is a wonderful opportunity for the continuum of care that you mentioned.'",
        "'speaker_2': 'Councilwoman Sun has to work to assist individual people, and it's really a person by person solution. There's no easy or swift way to address the needs of individuals because they are individual needs. And I want to applaud our health department and our city prosecutor.'",
        "'speaker_2': 'I've been very fortunate to get to work with Mr. Halbert in my professional capacity and learning ideas from him, and I hope to share with him some of the things that we do in our homeless court that could be implemented here in Long Beach.'",
        "'speaker_2': 'And he and I actually have a very successful story of an individual that we have both helped, one from the Orange County side, one from the Long Beach side with our health department. And we've gotten both health care agencies involved.'",
        "'speaker_2': 'And the person is doing great. They're working with the case manager stabilizing. And so it's taken a lot of effort from two different counties and caseworkers from two different counties to come together and prosecutors from two different counties to work together.'",
        "'speaker_2': 'But that's just an example of the kinds of things that can happen in a collaborative court. And even though she wasn't part of the collaborative court model, that individual is benefiting from the services, and the collaborative court structure will allow us to be able to do that more readily for a larger group of people.'",
        "'speaker_2': 'So thank you, Councilwoman Sun House, for pulling this item. Thank you to our health department director and Doug Halbert for moving forward with this program. I'm super excited about it and I think programs like this work work really well.'",
        "'speaker_2': 'And I know our city prosecutor is in the council chambers right now tonight, and I know he probably has a lot to say and I don't want to speak for him, but this is just one of those innovative models that he has already implemented, similar ones here in the city of Long Beach and is continuing to do'",
        "'speaker_2': '. And I'm really, really pleased that he's at the forefront of our prosecution efforts in these unusual and innovative times. Thanks.'",
        "'speaker_0': 'Thank you. Councilmember Obsidian. Thank you so much. And of course, well, I want to thank our council members and De Haas for holding this. I think it's important for us to discuss. Obviously, this is an innovative approach, as said by my colleague, Councilmember Price.'",
        "'speaker_0': 'Anytime that we can eliminate barriers for individuals to reentry or rehabilitate, particularly those who have been acculturated in not homeless or unhoused situation, this is this is value added. And so I fully support this item. I'm really, really thrilled to see us moving in this direction.'",
        "'speaker_0': 'And I think my question might have been asked by answered by staff. But, you know, I just the only question I had is where would this be housed and whether or not it will be moved around with the staffing if that wasn't available.'",
        "'speaker_0': 'Obviously, we have a number of shelters in our city and we want to make sure that we are meeting the needs of all of our unhoused residents. But those are my comments and I fully support this item. Thank you for pulling it.'",
        "'speaker_0': 'Thank you, Councilman Allen.'",
        "'speaker_1': 'Yes. I also want it being Councilwoman Zendejas for pulling this off. This is just an absolutely fantastic item that builds upon all the great work that's already happening now with our staff. I also want to applaud city prosecutor Doug Halburd and the Health Department.'",
        "'speaker_1': 'I know that Councilwoman Pryce and I were talking about the need of these services to address all these homeless needs throughout our community. And we were talking specifically about Bixby and the Promenade. So I'm just super excited to see this item going forward.'",
        "'speaker_0': 'Thank you. And let me now, I think we have a prosecutor, however, on the line. I think it's connected now. Is that right?'",
        "'speaker_3': 'Thank you, honorable mayor. Members of the council. Can you hear me? Okay? My my compliments to the City Hall Security. I was locked out of the chambers during the beginning part of the presentation, but I'm in now, so I know that the city council has already received some information about the homeless court project and to respond to'",
        "'speaker_3': 'one question already made as far as locations, it is my hope that we can move it throughout the year. Initially, the homeless court will be located most likely at the Multi-Service Center, where a number of our nonprofit organizations are already located.'",
        "'speaker_3': 'The goal of the homeless court, obviously, is it's multifaceted. We want to help participants get connected to critical services such as mental health, substance abuse counseling and housing assistance. We also want to help homeless court participants who are already active in services so they can have outstanding infractions and misdemeanor cases resolved, potentially dismissed.'",
        "'speaker_3': 'We also want people experiencing homelessness who have low level warrants to get those warrants removed. And the Long Beach Police Department's warrant removal program will assist us as part of homeless court as well going forward. Also, we want homeless court participants who qualify for the Priority Access Diversion Program, which has been piloted here in Long Beach for'",
        "'speaker_3': 'the last couple of years. Those who are eligible may have cases dismissed, may get their fines waived. Defendants may also attend programs in lieu of jail sentences, all in an effort to help them be successful with services and to reduce any barriers to housing and or barriers to employment that come along with the criminal justice system.'",
        "'speaker_3': 'So if there are any further questions, one more thing. The RISE program, which the City Council has funded for the last two years, allows old cases that are eligible for Expungements to be cleared as well. And we're also going to include that service as part of homeless court.'",
        "'speaker_3': 'So that will be the final of the RISE program, which was started about two years ago by Mayor Garcia and the City Council with funding directly from the city. Otherwise, we really have to thank Supervisor Janice Hahn if that has not already been mentioned.'",
        "'speaker_3': 'We really appreciate her because she contacted us, asked us to look at the Redondo Beach program and see if we could do something similar or even better in Long Beach. And it's my hope, of course, that we improve on the Redondo Beach model and really make something that makes a difference in the homeless problem we have here'",
        "'speaker_3': 'in Long Beach, which does appear to be growing. Thank you.'",
        "'speaker_0': 'Thank you. And I have Councilmember Cipriano. Thank you. I stand in support of this item, but I would like to make a friendly amendment, and that is that we have some very strict accounting for accountability first. And the fact that we're spending it might be counting money, but it's public money.'",
        "'speaker_0': 'And secondly, if we wanted to expand this program in the future, we would want to have a lot of data behind this. And so what I'm asking for, if they only meet monthly, maybe quarterly reporting both that has a great analysis to it, both quantitative and qualitative.'",
        "'speaker_0': 'So that that's my friendly. Thank you. And customers and they have.'",
        "'speaker_2': 'Thank you. Council member sue for non and absolutely asset those friendlies. I think that would be very important. I think that it's going to be important to see what what this program is bringing and the results that it's bringing.'",
        "'speaker_2': 'And I loved hearing the example that Councilmember Price gave us a little bit ago about her success story along with our city prosecutor. I think that that is exactly what these programs are designed to do and is to see these individuals become successful and be able to live a good life moving forward and to be able to'",
        "'speaker_2': 'be provided those opportunities. So with that, I cannot thank you enough city prosecutor Doug and Kelly for this presentation. And of course, thank you. Thank you so much to our Supervisor Hahn, for thinking of Long Beach. She always does great work and she's always very thoughtful in keeping Long Beach and how to advance Long Beach in all'",
        "'speaker_2': 'aspects. And I know that in her district, our, you know, homeless crisis is very, very important to her as well. And so I'm very thankful that we have this opportunity to have this program in our city. So thank you again for everyone's collaboration and hard work on this.'",
        "'speaker_2': 'And I really, really can can foresee that this is going to be fantastic for for Long Beach.'",
        "'speaker_0': 'Thank you. With that, we have we've got three we have public comment. I think we said we did on this item, correct?'",
        "'speaker_3': 'Yes. We have public comment for this item. Our first speaker is Alison Crisp.'",
        "'speaker_2': 'Hi, guys. Thank you so much, Mr. Mayor, and our council members. And I want to say thank you so, so much to council members in the House for being such a rock star and pulling this from the consent calendar to speak about it.'",
        "'speaker_2': 'I really appreciate hearing the presentation from both prosecutor, from our city attorney and from Director Colby and the comments that are Councilmember Price and then they have made in regards to including our continuum of care providers throughout this conversation.'",
        "'speaker_2': 'I've participated in a few of these counts in Redondo Beach and been there in person. Watching and seeing tears of joy just as a volunteer is just the most incredible thing and watching. So this is going to be an awesome opportunity, especially had it having at a multi-service center.'",
        "'speaker_2': 'I did want to just leave a reminder for our council members that moving forward, there's going to be a larger conversation that's going to happen in regards to equity and the reason why these criminal charges have occurred for those experiencing homelessness.'",
        "'speaker_2': 'So I do encourage our city council council members to include our continuum of care board members and service providers. In this conversation, again, the service providers do have the boots on the ground by councilmembers. And then they had mentioned earlier with the leadership and help with future conversations in regards to homeless court.'",
        "'speaker_2': 'I also wanted to take this opportunity to remind our council members that the CFC has experience and work with these offices in regards to all the challenges for our friends that are experiencing homelessness. It is a larger conversation that will include support from not just society but from the service providers that are within our homeless services department'",
        "'speaker_2': 'to address not just again, the expungement of criminal records, but to follow up in collaboration with all the department to address what's happening before, after, before and after homeless court and all the 100 of human interactions it takes to help someone from street to home.'",
        "'speaker_2': 'Thank you, guys. I really appreciate you guys letting me speak and. Golden Beach. Thank.'",
        "'speaker_3': 'Think your next speaker is Lee Charlie.'",
        "'speaker_0': 'Life has many chapters. One bad chapter does not mean the end of the book by the letter. I arrived in Long Beach, California, Saturday, May 2nd, 2015. I lived and slept on the putting greens at recreational golf course on seventh in four months until the village at the Gabriel had a bed available, provided a safe place to'",
        "'speaker_0': 'live and legal services to get my be a benefit. I have two college degrees served in the United States Navy, and the hardest job I ever had was breaking the cycle of homelessness. Every homeless person is a human being and has a story to tell.'",
        "'speaker_0': 'If you will, listen. Drug addiction, mental illness, domestic violence and having a criminal record are far too common. This homeless caught pilot program is a huge step in the right direction towards progress. Maslow's hierarchy of needs starts with physiological needs.'",
        "'speaker_0': 'Then progress towards the safety gear. Gaining employment benefits. Permanent housing is all but impossible. Having a criminal record nonviolent crime, being expunged is a great start. Legal fees are astronomical and fortunately drastically decreasing hope and increasing homelessness. This pilot program will not solve our homeless crisis, but it will help loss of self-esteem.'",
        "'speaker_0': 'Sane judgment never stops, and many homeless individuals are punished over and over again because of a mistake made in their past that haunts them as they sleep on a concrete floor. I hope that the City Council will vote yes on this homeless pilot program.'",
        "'speaker_0': 'I hope citizens will be allowed to volunteer with legal professionals for the pilot program. Ten volunteers helped spread the message for unhoused people in the city. Well, the city of Long Beach have literature for us to pass out to the UN.'",
        "'speaker_0': 'How can the city post signs on highly populated areas of unhoused zombie citizens? Transportation is not easy. Walking from Bixby Park to the Multi-Service Center and maybe volunteers can help set up transportation. My favorite quote from our vice president, Kamala Harris.'",
        "'speaker_0': 'Anyone who claims to be a leader must speak like a leader. That means speaking with integrity and truth. Thank you, Councilwoman Mary De Hart, director, director of Health and Human Services, Kelly Co-op and Doug Talbot for being leaders in Long Beach trying to do something different.'",
        "'speaker_0': 'Tackling our Long Beach Homeless Crisis. Let's fight for our Long Beach homeless population. Breaking the cycle of homelessness. One human being at a time.'",
        "'speaker_3': 'Thank you. That concludes public comment for this item.'",
        "'speaker_0': 'Thank you. Before we go to our our vote, I do want to again, just especially thank Supervisor Hahn when in discussing this process, she had the opportunity to actually provide funding to a variety of jurisdictions. And through conversations, particularly with Prosecutor Halbert and others, they settled on Long Beach as the city to do this work and through'",
        "'speaker_0': 'this funding from the county. And so I just want to make sure that we're just thankful for that partnership and the continued partnership that she's provided. And, of course, the prosecutor. Halbert, thank you for all your work in getting this off the ground and, of course, to our health department, but very, very important work.'",
        "'speaker_0': 'And I think we're all looking forward to getting a report and feedback on how it's going. So excellent work. Thank you all very much. And let's go to a roll call vote.'",
        "'speaker_1': 'District one. I District two. I. District three. I. District four.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five. I. District six. I. District seven.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'District nine. Right. Motion carries.'",
        "'speaker_0': 'Great. Thank you very much. Item 16 is we're just reading the motion and then we're going to continue to do the first, please. So let's read the motion.'"
    ],
    "Recommendation to adopt resolution allowing for the initiation of a Consolidated Coastal Development Permit process pursuant to Section 30601.3 of the Public Resources Code (Coastal Act) in connection with the realignment of Shoreline Drive as part of the Shoemaker Bridge Replacement Project; and": [
        "'speaker_1': 'Item 16 Report from Development Services Recommendation to adopt resolution allowing for the initiation of a consolidated coastal development permit in connection with the realignment of Shoreline Drive as part of the Shoemaker Bridge Replacement Project and adopt a resolution granting city manager the authority to initiate consolidated coastal development permits districts two and three.'",
        "'speaker_0': 'Thank you. I know that we are going to move as a gene firm. If I can get a motion in a second for you on this. There's a motion by account from your ranga. Can I get a second?'",
        "'speaker_0': 'Can I get a second, please? Second account on Sunday has moved to the June 1st meeting. Roll Call vote.'",
        "'speaker_1': 'District one.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'A district.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District for. Hi. District five. District five. I. Again, I. Thank you. District six.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. Councilmember us. Okay. That's an I from council district eight and Council District nine.'",
        "'speaker_0': 'All.'",
        "'speaker_1': 'Thank you. Motion carries.'"
    ],
    "Recommendation to request City Manager to develop a plan and vision for a Long Beach COVID-19 Memorial that will be dedicated to those lost during the pandemic. A community advisory group should be formed for the selected project.": [
        "'speaker_0': 'Thank you. Item 17, please.'",
        "'speaker_1': 'Communication for Mayor Garcia. Recommendation to Request City Manager to develop a plan and vision for Long Beach, COVID 19.'",
        "'speaker_0': 'COVID 19 memorial. But yes. I just wanted to object. First of all, just thank the staff and the WHO has also been working on this and have had some conversations. Um, we've talked about this already I think in public and there's been a lot of community conversations around how we honor really just a horrific event that's happened'",
        "'speaker_0': 'in our city and of course in the history of our city appropriately. As of today, we've lost 933 members of our community. And I've said this before many times, that the single largest loss of life we have ever experienced through an event in the history of the city since the beginning of the founding of language.'",
        "'speaker_0': 'And so how we honor will be more than these 933 lives, but also provide a space that is healing for their families and for the community. It's something that could be very important for us to do as a city in the years ahead.'",
        "'speaker_0': 'Just thinking about it as a community. The fact that we have responded in the way that we have, I think also gives us an opportunity to respond in a very powerful way through this memorial process. I've talked to our city manager, and this certainly is not going to be a fast process.'",
        "'speaker_0': 'It's one that has to be done very respectfully and thoughtfully engages the community and community leaders from across the city. I also want to make sure that in this process that whatever is developed is really something that comes from the community and especially so the those that have survived the pandemic and seen other folks that have passed'",
        "'speaker_0': '. The families of those that have been victims of COVID 19 should absolutely be involved in what this would actually look like for us as a city. There is no set idea what whatever this memorial would look like or where the location would be or what it would represent.'",
        "'speaker_0': 'I think it's all up for for for our city wide conversation in the months ahead. The recommendation asked the city manager and and our team to develop a process and a vision for what the COVID 19 memorial would look like.'",
        "'speaker_0': 'I've also asked city manager to select individuals from the city to form a advisory group to the city to help give ideas and will need to be involved at some point, also in outreach and possible raising of funds for a project of this magnitude.'",
        "'speaker_0': 'I've also engaged Ron Arias, who all of us know as the former director of the Long Beach Health Department, to be involved and take a leadership role. Having been, you know, kind of the someone that guided and created the modern health department that we know today.'",
        "'speaker_0': 'But beyond that, it's important for the public to also know that this item is just to move forward with the process as far as location and what the cost would be. Those would be conversations for the future. We don't know.'",
        "'speaker_0': 'A project like this could have significant costs in the future. We just don't know what those what those would be. And certainly there will have to be some serious fundraising efforts to get support and even federal and state support to be looked at as well for a project of this magnitude.'",
        "'speaker_0': 'I want to thank again the team for this. And with that, I would like to get a motion, please. I see it as a motion by councilwoman that they have trying to get a second piece. And second by Councilmember Ringo.'",
        "'speaker_0': 'I got some of the deals.'",
        "'speaker_2': 'Thank you very much, Amir. As as you well know, this has been an incredible time that has taken some of our loved ones way too early. COVID has has been, like you stated, one of the hardest hit things that has ever hit Long Beach, the city of Long Beach, and not the one that has also taken the'",
        "'speaker_2': 'most lives in such a short period of time. So I really thank you for for your efforts in in making this memorial as special as possible. And the only way to do that is, like you said, getting everybody involved, especially the victims of COVID 19.'",
        "'speaker_2': 'Every single person that was taken from us was a child, a father, a mother, an uncle, a grandparent to somebody. And with their loss, they leave behind devastation that it cannot be replaced. And so having a memorial and having it be community led, I think it's going to be extremely important.'",
        "'speaker_2': 'And it honors those that that unfortunately lost their lives to COVID 19. So for that, I just wanted to thank you and your staff and thank in advance our advisory committee and also thank Ron Arias for accepting this this opportunity to be a leader in providing this kind of special memorial here in our city of Long Beach'",
        "'speaker_0': '. Councilwoman Catherine Tauranga second.'",
        "'speaker_4': 'Thank you, Mayor. And I want to thank the comments and I agree with the comments that the council members and their has put forward every single one of us. Was touched by COVID 19 in one way or another.'",
        "'speaker_4': 'Personally, I had my my daughter and my son in law contract COVID. Thank goodness that they were able to get over it very quickly without any major symptoms or anything underlying with them either. So I appreciate the effort, Mayor, that you're putting forward on this.'",
        "'speaker_4': 'I strongly support the fact that we're going to make it community based. I think it's something that we need to memorialize how we went through a pandemic in 1918, that unless we read the newspapers and go into the archives, we we would have forgotten about it.'",
        "'speaker_4': 'And I think that this event in our history needs to be memorialized and never forgotten. Thank you for putting this forward.'",
        "'speaker_0': 'Thank you. Council member Sara.'",
        "'speaker_2': 'Thank you, Mayor. I want to thank your leadership in helping our city navigate. And the best, I think the motto in the way that in how to how to manage the pandemic. Right. And as best as we can, and also bringing forward this proposed.'",
        "'speaker_1': 'Opportunity.'",
        "'speaker_2': 'To do a memorial, given that, you know, it's it's going to be it's going to be more than a lifetime to process the impact of this pandemic. And I think it's still helpful to have a process to heal through this development of memorial.'",
        "'speaker_2': 'And I also would like, if we can consider to ensuring we have members of the heroes at the front line that's helped us, such as possibly health care workers and and others that could contribute to the memorial, given how much they.'",
        "'speaker_1': 'Have helped us.'",
        "'speaker_2': 'And save lives as well. So that that is a suggestion I'd like us to consider in addition to our residents. Our health care is in the front lines as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Allen.'",
        "'speaker_1': 'Just thank you, a mayor, for your incredible leadership. During this time, losing over 900 people to COVID is just unbelievable number. Just a lot. You know, so many friends and neighbors and loved ones that we lost here in Long Beach.'",
        "'speaker_1': 'I know that we have absolutely never seen or would never possibly expect to even be in a position that we're in today. But I think that it's going to be important that we memorialize all of these lives. I think it's also going to be important that we develop a plan that helps everyone grieve and also is the'",
        "'speaker_1': 'kind of place where people can start that that healing process. And I think a memorial is a perfect point for us, for us to do that. I also agree, I think it's important that we find a way to honor all of those that were on the front line and help us get through this really tough time in'",
        "'speaker_1': 'our community. So I just look forward to seeing how the committee does that, and I just thank you very much.'",
        "'speaker_0': 'Thank you, Vice Mayor Richardson. Thank you, Mr. Mayor. I agree with everything my colleague said. I would I would just underscore, you know, the city's this this event changed our city, changed our region. And, you know, when we look back on this moment, you know, we want to we want to make sure that this sort of represents'",
        "'speaker_0': 'how we came together as a community to really overcome this challenge. And so I certainly am most interested in this as a device for healing and sort of allow people to cope with what we just went through because there will be trauma from for years to come.'",
        "'speaker_0': 'Based on what we just experienced. But I agree with what what everyone said. I look forward to helping be a part of this. Thank you. Thank you. And I just wanted to just add. I really love what was said about finding ways to honor our healthcare workers within the memorial space, because that's something that I personally also'",
        "'speaker_0': 'believe is would be great to see. And obviously all of those ideas will be part of the broader conversation. But I do think that is really a really great and really appropriate. I think the other charge I would just leave with Mr. America and the team is just to recognize that.'",
        "'speaker_0': 'A moral of this type is is significant from a healing perspective for our community. But it will also reach a lot of folks from outside our community. And the truth is, is that not every city is going to have a memorial.'",
        "'speaker_0': 'There will there will probably be few of them in the state. And so it's also an opportunity for us to provide this healing and special space for those of us in the city. But also we have to be prepared that many others will visit this visit this memorial from, you know, from across the state and in other'",
        "'speaker_0': 'places. And so that that's going to be an important space for those folks as well, who also had similar experiences and similar trauma. So I think it's a big it's a big charge, but I think all of us look forward to seeing the progress and what what's developed in the months ahead.'",
        "'speaker_0': 'And so with that, is there any public comment on this item?'",
        "'speaker_1': 'No. There is no public comment on this item.'",
        "'speaker_0': 'They will do a roll call vote, please.'",
        "'speaker_1': 'District one. I district to my district three. My district for.'",
        "'speaker_0': 'My.'",
        "'speaker_1': 'District five. I District six. I District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'District nine.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Is there regular public comment, please? You want to do that now? Thank you.'"
    ],
    "Recommendation to conduct a study session to receive and file an update on the Citys Strategic Vision efforts.": [
        "'speaker_0': 'Thank you. And I would be happy to do that to thank you for for that invitation to do so. Happy to do that. With that, we are going to go ahead and go into our study session. We can read that, please.'",
        "'speaker_1': 'Item 19 is the study session recommendation to conduct a study session to receive and file an update on the city's strategic vision efforts.'",
        "'speaker_0': 'I will now turn this over to the staff.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Members of the City Council. So in 2019, the City Council embarked on a effort to create an updated strategic plan looking to the future or strategic vision. We've done a number of strategic plans in the city and some really great work, and this is kind of an overarching effort to pull all of those'",
        "'speaker_3': 'together and to really create a document that helps us kind of focus and look to the future. So we started that effort in 2019, and then along with many things, we had to take a pause during COVID and we've restarted that effort.'",
        "'speaker_3': 'So tonight you're going to get an update of some of the work that's been happening. We're not asking for any specific direction tonight, although we certainly welcome comments and then we'll be bringing this back to you in summer so that you have a chance to really dove into it a little bit deeper.'",
        "'speaker_3': 'And with that, I'll turn it over to both Theresa Chandler, our deputy city manager, and Kelly Collopy, our director of Health and Human Services.'",
        "'speaker_5': 'Good evening, honored mayor and members of the city council. As Tom mentioned, in the early in October of 2019, the City Council directed city staff to develop a strategic vision for the city that would reflect the next ten years to 2030.'",
        "'speaker_5': 'We were in we were in the middle of all that and providing and then when COVID hit, it was set aside. Tonight, we are here this evening to provide an update to that strategic vision planning process and to and to really just sort of give you insight into what we are hearing.'",
        "'speaker_5': 'We began this journey in partnership with Arup Consulting Firm in February of 2020. However, due to COVID, we were delayed and we are just now sort of back and really engaged and working through it. Fortunately, we've been able to pick up where we left off and we've been able to have conversations with many of you, in fact'",
        "'speaker_5': ', all of you throughout the process. In this evening's study session will provide a high level update of where we are in the process. We'll share the goals and themes that have emerged collectively from the work to date. Provide an update on our progress.'",
        "'speaker_5': 'Share what we've heard and our next steps.'",
        "'speaker_6': 'Our goal of this work is to develop a tenure. Well, nine year now strategic vision for our city that reflects your voices, the voices of our teams and the voices of our community by way of using an equity and resiliency lens in this design process.'",
        "'speaker_6': 'This vision will help focus and prioritize our work as we emerge from this pandemic and move toward an even brighter future. Just about all of our city departments have their own strategic plans as departments or for specific focus areas to help guide their work.'",
        "'speaker_6': 'All of which elicited community feedback as part of their planning process. It wasn't necessary to start from scratch, given the rich information used to create each of these plans. Therefore, we started the visioning process by reviewing and pulling out the common threads or themes that emerged across all of them.'",
        "'speaker_6': 'We spoke with each of you to elicit your feedback and visions specific to your council districts and for the city overall. We also conducted sessions with city excuse me, city leadership and staff to gather their thoughts for internal and external transformation.'",
        "'speaker_6': 'Though we are using the information gathered from the community during the strategic planning processes, as mentioned above, starting this week, we are also meeting communities where they are at to gather more information about their vision for Long Beach in 2030.'",
        "'speaker_6': 'And we'll simultaneously gather information from city staff who are on the ground working hard every day to meet the needs of community members. All of this rich data will lead us to the development of the road map for the future of Long Beach.'",
        "'speaker_6': 'From the 25 strategic plans across the city departments, over 15,000 community residents were engaged through those efforts. As I mentioned in the last slide, ten interviews were conducted with each of you and the mayor. We have a steering committee made up of city staff who meet monthly to provide guidance to the Arab team and city leadership participated'",
        "'speaker_6': 'in two listening sessions, and another listening session is on the horizon for city staff who are on the ground providing services day in and day out. This is an this is an all hands in effort designed to ensure voices from across the city are heard and are contributing to a collective vision.'",
        "'speaker_6': 'Now, Kelly is going to share more about what we heard in these sessions.'",
        "'speaker_5': 'We'd like to share more about what we heard from the interviews. The themes that were pulled from the various reports, as well as our visioning sessions with our employees. From the original, from the review of the plans, general themes emerged.'",
        "'speaker_5': 'They're focused on housing and homelessness, public safety, accessible public transportation, and safe places for active transportation, workforce development and economic inclusion, health, mental health and overall wellness education at all levels, beginning with the early child and throughout the lifespan.'",
        "'speaker_5': 'Digital inclusion. And climate change. And the environment. The conversations with you included these themes and highlighted included the themes of the strategic plans and also highlighted that we needed a focus on the basic needs of the city and ensuring that the basic needs are met across the city.'",
        "'speaker_5': 'You highlighted that equity must be a well integrated into our policies and program design as well as implementation and that resident interests are represented. Many of you discussed that in many ways. After this pandemic, we needed to return to the basics, ensure that all our communities have access to these basics, such as quality and reliable infrastructure, clean'",
        "'speaker_5': 'air and water, and ensuring safety in our homes and in our communities. This was framed in a conversation about ensuring that Long Beach is a desirable place to live. You highlighted the need for a resilient and diverse economy so that our residents can thrive while working, living, playing and raising their families in Long Beach.'",
        "'speaker_5': 'You also highlighted the importance of drawing businesses to the city and supporting innovative opportunities. And finally, you're focused on increasing civic engagement and working to create stronger community relationships and communication structures to ensure community voices are engaged in planning and decision making.'",
        "'speaker_5': 'Our Department Leadership and steering committee also focused on the importance of addressing the areas of greatest need in the city and working to prioritize resources and aligning them with the goals outlined in the strategic planning areas. They focused on addressing the digital divide to ensure that communities across the city have digital access and competency to learn, work'",
        "'speaker_5': 'and be civically engaged. They focused on environmental resiliency, ensuring that we have the infrastructures necessary to withstand the impacts of climate change, and also the ability to support those who are most vulnerable in our communities, such as older adults and those living in poverty who have limited access to healthy environments.'",
        "'speaker_5': 'And last but not least, they highlighted the need to support health and wellness by investing in children, youth and families to support the future of our city. This includes investing in early childhood education, workforce opportunities for parents, health and mental health services, as well as increasing access to healthy food and physical exercise opportunities in areas where they'",
        "'speaker_5': 'are most lacking. We know that to achieve what has been discussed through this presentation so far, it's absolutely essential to have a strong, vibrant and resilient city government. These next two slides really highlight the focus on our government.'",
        "'speaker_5': 'The Department Leadership and Steering Committee highlighted the importance of developing and strengthening mechanisms for equitable service investments, utilizing an equity lens and taking a long term planning view. They discussed the need for resiliency in the face of shocks that could be natural, manmade environmental or in the face of a pandemic such as we're experiencing now.'",
        "'speaker_5': 'And to ensure that we can continue to provide basic services and focus on a strong future. They talked about ensuring that we are strong, working together across departments to strengthen our ability to meet community needs by leveraging, not duplicating our efforts, including funding and talent.'",
        "'speaker_5': 'They also talked about the importance of community voices in the city's work and ensuring that they are engaged in our work together. There was also a focus on financial resilience and ensuring diversified funding streams clearly agreed upon priorities and investments in families, green infrastructure and safety, to name a few.'",
        "'speaker_5': 'They highlighted the need for accessible data that are shared across departments to support decision making investment determinations and to determine program effectiveness. They, however, needed to ensure our city employees are fortified and appreciated. This includes creating learning environments, growth opportunities, the ability to build skills while also maintaining a positive work life balance.'",
        "'speaker_5': 'And finally, they highlighted the need for technology investments to strengthen business practices and efficiencies, increase access to services for our community members, to support collaboration across departments and with the community, and to ensure flexibility in workspaces, including the ability to work remotely.'",
        "'speaker_5': 'Their vision of our city. Government truly highlights resilience, learning, engagement and financial strength through all that comes to our city.'",
        "'speaker_6': 'After reviewing all of the existing plans, working with city leadership staff in our legislative offices, we have gathered quite a lot of information in a short amount of time. We certainly have some ways to go still. However, we have drafted the statement of possibility for our city to uplift the vision.'",
        "'speaker_6': 'We are all working to achieve that. People are healthy, well, and feel safe in an equitable and fair community. Housing is affordable, protected and available. Economic opportunity exists for everyone. Transportation and mobility needs are met for individuals and for the community.'",
        "'speaker_6': 'The environment is sustainable and resilient. We are looking forward to diving deeper into making connections with the community members who may have not been engaged in earlier city planning efforts. This week, we will begin meeting residents at vaccine distribution sites in parks located in some of the hardest to reach neighborhoods in west, north and central Long Beach'",
        "'speaker_6': 'to elicit feedback about their vision for Long Beach in 2030. Conversations will be had with people who are waiting in line before getting their vaccine and with those who are waiting to be cleared. Post-Vaccination. These conversations will be available in Spanish, Tagalog and Kami, and the following questions will be asked during the conversations.'",
        "'speaker_6': 'Well, we'll start out by gathering demographic information, and then we're going to go into what resources did they did you and your family rely on the most to navigate through the year? Looking forward, what do you want the city to focus on as we recover as a community in the future?'",
        "'speaker_6': 'What does a well-prepared Long Beach look like and what is the most convenient way for you to give feedback in the future? The team will also conduct some employee listening sessions to engage staff in the visioning of their future.'",
        "'speaker_6': 'Questions to prompt these conversations will be developed soon and shared in the final report. Many city employees are also residents of Long Beach, and we want to make sure their voices are fully represented in this vision document as well.'",
        "'speaker_6': 'The slide outlines our next steps in moving this work forward. It's been moving full speed ahead since we reconvened at the beginning of this year, and I'm proud to share how far along in the process we have gotten in a relatively short amount of time with all of the trials, tribulations and lessons learned throughout this pandemic response'",
        "'speaker_6': '. We have been able to bring more clarity and purpose to this strategic vision process. We have seen the highs and lows. Our areas for opportunity have been exposed. Our strengths have been uplifted. And this document will allow us to align across the city so that we are united in our work and service provision going forward.'",
        "'speaker_6': 'We will be moving towards completion through this summer after we finished the listening sessions. The Preliminary Strategic Vision Action Agenda will be drafted to help move us along the pathway at the duration of the drafting phase. We will deliver a presentation to all of you in a council meeting and once approved, we will share the final version'",
        "'speaker_6': 'with our city team. This is where we are so far. We are certainly looking forward to hearing your feedback about what we may want to still consider as we proceed to the finish line. Thank you for your engagement so far in this process and for your time this evening.'",
        "'speaker_6': 'And we are available to answer any questions you may have. Thank you.'",
        "'speaker_0': 'Thank you. I want to just obviously thank staff for all the work. After this epic brawl, I think we all can probably understand and appreciate this strategic plan directly. Pretty important documents. And they are obviously important as it relates to our departments, our community and how we move forward over the course of the next ten years especially'",
        "'speaker_0': '. And so I just want to commend the staff for the work and for persevering, doing the work through the through the pandemic. I just want to also I know that tonight is not it's just an update and there'll be a lot more in the future.'",
        "'speaker_0': 'Mr. Modica about report is going to come down a month from now in the summer. Is that a draft or is that more of like what? What does that look like when when you come back to us?'",
        "'speaker_5': 'We're the mayor. The timeline is over the next couple of months. And so we anticipate that we'll, um, that we'll be pulling all that information and you'll get a draft and have an opportunity to review and um, uh, provide feedback and then we'll continue on to, um, to finalize.'",
        "'speaker_0': 'Okay. And the only other thing I'll add is I think that, um, our community input is really important in a process like this. And so, uh, I do appreciate the, uh, reaching out that you're all doing at the, at the vaccination clinics.'",
        "'speaker_0': 'And I'm just hopeful that, and I know that there's been obviously extensive community input over all the plans in the past and any other opportunities that there are to do. The additional input I think will be important, is what I'm sure you guys are all considering that as we as we move forward to.'",
        "'speaker_0': 'Thank you. I might have Vice Mayor Richardson. Thanks, Mr. Mayor. I'll be brief. I think it's great that we're doing this. I think it's important now. Given everything we just went through. A lot has changed about our city and about the vision.'",
        "'speaker_0': 'Needs to be factor of this input into it are two things that I wanted to just take this opportunity to lift up. One, I know we're doing outreach at the vaccination sites. I just want to say in North Long Beach, that's a fifth of the city's population.'",
        "'speaker_0': 'One site, you know, doing outreach in there is not going to really capture what you need captured. I think you should be looking at multiple sites or opportunities across North County, some massive areas the size of Compton, Carson.'",
        "'speaker_0': 'So you should be looking at both districts, eight districts, nine west, northwest, northeast, just fine opportunity because some people don't go to Highland Park for the vaccination site. The second thing I would say is and this was my sentiment and I don't know what everybody said in their interview, I enjoyed my interview with Short 30 Minutes, but'",
        "'speaker_0': 'the message for me was simple. It's in my opinion, you know, that there's this transition toward equity and advance in our city. Really. It should be owned by owned by the city, owned by the city staff, the employees.'",
        "'speaker_0': 'And we really should be looking at the city as an organization. It's organization focused. Make sure no neighborhood is left behind, not to counsel people or not, you know, politics. We are a place where it really the city, our key performance indicators of the city should be on how well we all are doing.'",
        "'speaker_0': 'So basic common denominator. We all should meet a certain level of response times. We should all be meeting a certain level of economic activity in areas with more unemployment other than other areas. That's where we should be putting our focus of workforce.'",
        "'speaker_0': 'But I think what I really want to see, since the organization is doing this visioning that the organization as a whole really think about how it's going to meet meet the future as it relates to equity. It shouldn't you know, it shouldn't be city council members or you know, we certainly can say we want to say, but'",
        "'speaker_0': 'really it should be a part of the service. Those are two things. I would I would just add. Keep up the great work report to the next. Thank you, Councilwoman Pryce.'",
        "'speaker_2': 'You, Mr. Mayor, and I really appreciate the presentation that that you guys have given, and you've already done a lot of work. I know there's still a lot more community engagement to be had. But just out of curiosity, was there any information that came out from the visioning efforts so far that was surprising to the team?'",
        "'speaker_2': 'Or was the information that you learned kind of further corroborating the track that we're on progress we're making?'",
        "'speaker_5': 'I think that there are many things that we heard that were aligning with what we've been hearing through other plans and things. I think the impact of the pandemic has shifted some view. For some, it's harder to think past what we've experienced.'",
        "'speaker_5': 'And so there has been a little bit of a step back and thinking about making sure that we really are settling and taking and taking care of the basic needs of our community, really focusing on, you know, access to food and access to safe spaces and and those sorts of things which in in previous conversations may not'",
        "'speaker_5': 'have been uplifted as much. So I think it did center a little bit more given the experiences of our city in the past year.'",
        "'speaker_2': 'Okay. That's good. I have, you know, do you know yet? Are there significant variations in the input that we've received from the public based on geography or socioeconomics or gender? Or are residents mostly in support of the same priorities in terms of strategic planning?'",
        "'speaker_5': 'At this point, Councilmember, that much of the information that has been brought forward has been pulled from the strategic plans that have been going on for the last few years. So if you think about the, you know, the CAP plan and you think about the blueprint for economic development and you think about the early childhood plan.'",
        "'speaker_5': 'And there are just so many different plans and the feedback from across the city is included in all of those plans. And we haven't gone through all the plans and broken out that I don't know that we actually have those data that indicate where all the those voices came from.'",
        "'speaker_5': 'But much of the themes that we have forwarded here have stemmed from a review and reading the comments and engaging with the more than 25 plans that the city has developed in recent years.'",
        "'speaker_2': 'Okay. I appreciate that. I know it's it's kind of a a bigger, broader question to think about as we move through this process. And I think, you know, for me, I enjoyed my interview with the team as well, but I think it will be interesting to see what the strategic vision and priorities are for a city that's'",
        "'speaker_2': 'as diverse as we are. Because I know, for example, delivery of government services and response times and the delivery of customer service or public service services is probably a major priority for the residents that I represent. I know just kind of the response times when they report an issue in terms of strategic visioning, you know, how do'",
        "'speaker_2': 'we continue to have good customer service as a city to all of the residents that I'm just curious because we hear that a lot. It's a priority. Whether that was a theme that people thought about in terms of strategic planning, that that customer service be be looped into the discussion as we talk about a future strategic planning'",
        "'speaker_2': '. So I'd be interested to know after you guys do your listening tours, assuming you're going to do them all over the city and capture the diversity that makes the city so beautiful and yet so different throughout the various borders of our city, so that we can develop a strategic plan that really encapsulates priorities to the extent we're'",
        "'speaker_2': 'able to of the diverse communities that we all represent. So I thank you very much for starting these efforts, and I look forward to hearing more about them as we continue these discussions.'",
        "'speaker_0': 'Thank you, Councilwoman. The D.A..'",
        "'speaker_2': 'Thank you, Mayor. I just wanted to say thank you for the presentation. Very good presentation. I know that I really enjoyed my interview as well, but I think like Councilmember Rex had mentioned that, you know, it's really we really need to you know, what's more important is what the community sees.'",
        "'speaker_2': 'So our visions and I think that that's a great thing. And so I'm really thankful for you taking the time to actually try to reach those those folks that are hardest to reach. And in doing this pandemic, we have realized that how much how much residents we actually do have that are hard to reach.'",
        "'speaker_2': 'So I just wanted to say how much I appreciate you taking the effort and make our I should say, making the effort to really reach those and those folks that don't have a computer, that don't have a cell phone, that are victims of our digital divide and really trying to get their visions included as well.'",
        "'speaker_2': 'So thank you very much for that.'",
        "'speaker_0': 'Thank you. Is there any public comment on this item?'",
        "'speaker_1': 'There's no public comment on this item here.'",
        "'speaker_0': 'So I think the motion was by Vice Mayor Richardson and a second by Councilman Price, if that works. And with that, we'll go ahead and take a roll call vote.'",
        "'speaker_1': 'District one, District two I. District three.'",
        "'speaker_2': 'District I.'",
        "'speaker_1': 'District four.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District five.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'District nine.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to adopt Specifications No. R-7163 and award a contract to C.S. Legacy Construction, Inc., of Ontario, CA, for the Long Beach Boulevard Pedestrian Improvements Project, in the amount of $2,486,828, with a 15 percent contingency in the amount of $373,024, for a total contract amount not to exceed $2,859,852; and, authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments;   Increase appropriations in the Capital Projects Fund Group in the Public Works Department by $1,722,000, offset by Federal Highway Funds from Caltrans (STPL-5108(183)), approved by the Los Angeles County Metropolitan Transportation Authority (Metro);   Increase appropriations in the Capital Projects Fund Group in the Public Works Department by $1,722,000, offset by transfer of Federal Highway Funds from the Capital Projects Grant Fund; and  Accept Categorical Exemption No. CE-21-040.  (Districts 6,7)": [
        "'speaker_0': 'Thank you. Next up is item 18.'",
        "'speaker_1': 'Report from Public Works. Recommendation to adopt specification number r-7163 and award a contract to cease legacy construction for a total contract amount not to exceed 2,859,852. District six and seven.'",
        "'speaker_0': 'Okay. Can I get a motion in a second, please? Emotion like tantrum or your anger. I get a second place. Second back are sorrow from Tauranga. Do you have anything?'",
        "'speaker_4': 'Not project. Thank you.'",
        "'speaker_0': 'Councilmember Controversial. Okay. Actually, there's no public comment. Is that correct?'",
        "'speaker_1': 'That is correct.'",
        "'speaker_0': 'That would be a roll call vote.'",
        "'speaker_1': 'District one I support District two I. District three.'",
        "'speaker_2': 'District I.'",
        "'speaker_1': 'District four, high district five. I. District six. I. District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Ocean cares.'",
        "'speaker_0': 'Great. Thank you very much. All right. I believe that's all the items on the agenda. Is that correct?'",
        "'speaker_1': 'That is correct, Mayor.'",
        "'speaker_0': 'Okay. Then, is there any new business from any any council members? I don't have any lined up here. So seeing no new business or announcements from the council, we will adjourn at 611. Living for it. All right, guys.'"
    ]
}