{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing and adopt resolution amending the Master Fee and Charges Schedule.  (Citywide)": [
        "'speaker_6': 'Thank you, Mayor. This hearing involves the financial management department. The recommendation to receive supporting documentation into the record, conclude the public hearing and adopt a resolution amending the master fee and charges schedule.'",
        "'speaker_1': 'Mr. West.'",
        "'speaker_4': 'Yes. Vice Mayor, members of the Council. Leah Erickson, our budget manager, will provide the staff report.'",
        "'speaker_7': 'Good evening, Mayor and council members. Today's city council's approval is being requested for the second quarter changes to the master fee and charge schedule. This schedule is updated at least twice a year to meet City Council's policy on user fees, which calls for full cost recovery whenever appropriate.'",
        "'speaker_7': 'The last time City Council amended the fee schedule was on September 3rd of 2013 as part of the fiscal year 2014 budget. Attachment A to the report includes seven departments with fee changes. And these fees include items such as in the clerk's office, increasing the fee for providing express passport services by a dollar to reflect the United'",
        "'speaker_7': 'States Postal Service's fee increase. It also includes fees for the Belmont Pool, the new outdoor pool. And these fees were based on a comparative analysis of other outdoor public pools. And it was meant to update and standardize the fees and related to the use of that pool.'",
        "'speaker_7': 'They should be noted, those those fees will be reviewed with the opening of the permanent Belmont Pool, and they are going to be retroactive for January 1st, 2014. In the police department, there's a number of general fees that are just being rounded to minimize use of change.'",
        "'speaker_7': 'So they're being rounded to the nearest whole dollar. And in, for instance, another example would be public works, charging a fee to cover the cost of printing no parking signs that are used in temporary construction zones. So like I said, seven departments do have fee changes as part of this this report and myself and members, representatives from'",
        "'speaker_7': 'those departments are here, if you have any specific questions.'",
        "'speaker_1': 'Okay. Thank you. I'm going to move on to any sort of public comment on the hearing. Seeing none. I'm going to go and close the hearing and take it behind over here to the council. Councilor Morgenthau.'",
        "'speaker_7': 'Thank you, Mr. Vice Mayor. I just had a couple of questions for staff. One is, I think there's something in here. Why must the HIV AIDS health education classes start 30 minutes later than the closing time?'",
        "'speaker_0': 'To.'",
        "'speaker_7': 'Council Councilmember Lowenthal we will have Dr. Bitch Kushner from Health and Human Services here who can answer that question.'",
        "'speaker_1': 'Councilwoman Lowenthal.'",
        "'speaker_10': 'The question was why the classes start a half hour.'",
        "'speaker_7': 'Later.'",
        "'speaker_10': 'Later than.'",
        "'speaker_7': 'Than the closing time of.'",
        "'speaker_10': 'The health.'",
        "'speaker_0': 'Department? Yes.'",
        "'speaker_1': 'Probably. It's more of a.'",
        "'speaker_10': 'Function of availability for the clients that are ordered.'",
        "'speaker_11': 'To take the course.'",
        "'speaker_10': 'That's the only reason I could give.'",
        "'speaker_7': 'Okay, that's. That's fine. I just thought that was peculiar. Peculiar? Sorry. The second question I had is under the news rack removal. And Dr. Kushner, I don't think that's your expertize, but if the owner fails to cure the violation within the stated number of business days, the news rack shall be removed and stored in a designated place'",
        "'speaker_7': '. So Long Beach Municipal Code states that the owner shall pay the expenses of removal and storage of the newsroom. I'm just curious, do we have do we still have difficulty with the news rack removal? I know we did some time back.'",
        "'speaker_7': 'And I know you're proposing an $85 retrieval fee per rack, but is that based on the administrative work that it requires or a difficulty in compliance?'",
        "'speaker_6': 'Honorable, lone, tall.'",
        "'speaker_11': 'The cost is to recover the actual physical work that an employee has to go out to remove the rack, put it on a truck, and take it back to the yard and store it.'",
        "'speaker_7': 'So that's our retrieval.'",
        "'speaker_11': 'That's all retrieval.'",
        "'speaker_7': 'I mistook that about the.'",
        "'speaker_11': 'Administrative.'",
        "'speaker_7': 'Fee. Perfect. Thank you.'",
        "'speaker_1': 'You think you can spiritual escape?'",
        "'speaker_8': 'Yes. Think I'm the Marine face. I would not be more prudent to wait till we've had the audit on him.'",
        "'speaker_0': 'On.'",
        "'speaker_8': 'The Marine face before we. You've got indication here about.'",
        "'speaker_0': 'And see what it says. Page.'",
        "'speaker_8': 'Yeah. Cover administrative processing costs are proposed by the Marine Bureau. 10% increase for temporary slip late fees. I thought that we were going to have a complete audit of those fees. And wouldn't it be more appropriate to wait to the audits done before any change of any fee related to that?'",
        "'speaker_6': 'Councilman George Patton Director Parks, Recreation, Marine. I think the fees that we've got identified here for dry, dry boat storage and they aren't related to the audit. The audit, I think, deals more with what was being charged to the Marina Fund in terms of maintenance.'",
        "'speaker_8': 'Well, the temporary slip they would not be related to someone is using.'",
        "'speaker_6': 'That's a late fee.'",
        "'speaker_8': 'I understand that they charge, but that's cumulative on top of the other fees. I'm just asking if we're going to have an audit of that at that time. It might be appropriate to come back with all the increases suggested increases, because I would think the auditor would audit anything related to that.'",
        "'speaker_1': 'I don't believe that was in the scope of the audit.'",
        "'speaker_8': 'The auditors not here. So.'",
        "'speaker_1': 'We're going to have a response to that. I know that the order is not here. Well, I think that wasn't part of the audit scope.'",
        "'speaker_6': 'The scope was to look at the maintenance charges that was charged to the Marina Fund, not so much the slip fees and whether or not they were appropriate or the increases in slip fees.'",
        "'speaker_1': 'Container ships could do anything additional.'",
        "'speaker_8': 'That's why I think you got somebody.'",
        "'speaker_1': 'O'Donnell. Just two questions. Does this does this change the fee structure to the launch ramps at all? DAVIES, etc.? I don't believe so. Okay. And what about residential restricted parking permits like those around the colleges.'",
        "'speaker_8': 'For permanent.'",
        "'speaker_7': 'Purpose of.'",
        "'speaker_1': 'Residential preferential parking? Right. Typically, I believe at 30, maybe 65 now. Do they go up to 65? I'm trying.'",
        "'speaker_7': 'To. Councilmember O'Donnell, there are no changes to the parking fees.'",
        "'speaker_1': 'Great. So parking in lawn traps are left out. Thank you.'",
        "'speaker_5': 'So let you finish this, Mr. Vice Mayor. Where are we with the emotion?'",
        "'speaker_0': 'No. The hearing?'",
        "'speaker_5': 'No. Is there emotion? All right. Any other questions will entertain emotion. Moved in second move against memberships seconded by Mr. O'Donnell. Any public comment? All right. Eight questions. CNN members cast your votes in hearing our number one.'",
        "'speaker_6': 'Motion carry seven votes. Yes. Thank you.'",
        "'speaker_5': 'Members. I probably need to comment on this because I didn't even know it was up. But you'll notice that the nameplate in front of me, says Admiral Bob Foster, Starfleet Command, which has been my lifelong dream. But they film Star Trek the movie here about four or five years ago.'",
        "'speaker_5': 'And and the know they made some improvements to this room. And if you watch the movie it outside the windows of San Francisco but it's in this room but they sounds.'",
        "'speaker_1': 'Like a campaign. They went out they found.'",
        "'speaker_5': 'Out that I was somewhat of a Trekkie. And the producer said, if I would have known that, I would have made the admiral who did the court martial. I would have said Admiral Bob Foster. I said, that would have been really great.'",
        "'speaker_5': 'So before they left, they gave me a nameplate that said Starfleet Command. So people have been calling me Admiral tonight, and I just kind of ignored it and I thought, What the heck is that going on? So anyway, that way explanation.'",
        "'speaker_1': 'Are you really are tricky.'",
        "'speaker_5': 'I love the look like the old Star Trek, right?'",
        "'speaker_1': 'And that's good.'",
        "'speaker_5': 'And I really enjoy the old star had some great themes in there. But anyway, that's neither here nor there. We're not going to solve that tonight. All right. We have public comment. I think that's correct. Greg in public comment.'",
        "'speaker_5': 'John Music Mrazek. I hope happiness. Right?'"
    ],
    "Recommendation to receive Charter Commission appointments approved by the Personnel and Civil Service Committee pursuant to Section 509 of the City Charter and Section 2.03.065 of the Long Beach Municipal Code.": [
        "'speaker_6': 'So 10/1 item ten is communication with the councilwoman. Jerry Lipski, chair of the Civil Service Committee with the recommendation received charter commission appointments approved by the committee membership.'",
        "'speaker_8': 'Hey, Mr. Mayor.'",
        "'speaker_7': 'You.'",
        "'speaker_8': 'You Mic. Thank you, sir. You made several recommendations to the Personnel and Civil Service Committee, and we took those up on March 18th and are recommending for full City Council approval the following Charter Commission appointments first as the Citizen Police Complaint Commission, and the new appointment will be Raul and Rivera, and he is to serve as an'",
        "'speaker_8': 'interim left by Susan Gluck of Arc, who as the second District Representative, and David Clement to fill the vacancy left by Rick Magilton Michael Emery as the third District Representative. You also made a recommendation to the committee, which approved was the new appointment to the Civil Service Commission for Robin Perry, eighth District resident, to fill the vacancy'",
        "'speaker_8': 'left by Jean Carrot two. And last but not least, and we were kind of debating this actively, whether or not to approve Mr. Shannon's appointment to the Water Commission. It was close. Was very close, but. Well, you recommended him.'",
        "'speaker_8': 'So we we did approve the recommendation for both Arthur Levine, third district resident, to fill the vacancy left by Susan Dolman and Robert Shannon, a third district resident to replace Paul Blanco. With that, I would make a motion to approve these recommendations.'",
        "'speaker_5': 'Moving, seconded. I just all I know a couple of you ear could you just please stand up. I just want to recognize people who are willing to serve. It's I want to thank you all for that. It takes a lot of time.'",
        "'speaker_5': 'These people spend a lot of time on public business for just for fun most of the time. So I want to thank you. It's you're really acting in true public spirit. So thank you very much. We have a motion.'",
        "'speaker_5': 'And second, any public comment? Members, please cast your votes.'",
        "'speaker_6': 'Bush motion carries some votes.'",
        "'speaker_5': 'Well, now that they are officially in office, I can say this Shannon wasn't a real problem, but Art Levine was truly a mercy appointment. I just I just wanted everybody to know that I couldn't let the evening go without without getting on you.'",
        "'speaker_5': 'Thanks again. I really appreciate it. I'm surprised they made it through the committee. Yeah, I. I don't know why I thought Shannon was even closer, but that's all right. Thank you, gentlemen. Really appreciate the willingness to serve. And good luck.'"
    ],
    "Recommendation to respectfully request City Attorney to draft a resolution in support of a fair collective bargaining contract at Long Beach Community Hospital.": [
        "'speaker_5': 'We'll go to 19 category.'",
        "'speaker_6': 'I'm 19 is communication from the office of Patrick. Council member Patrick O'Donnell. Councilwoman Geri Chavkin. Council Member Stephen Neal with the recommendation to respectfully request the city attorney to draft a resolution in support of the Fair Collective bargaining contract at Long Beach Community Hospital.'",
        "'speaker_5': 'Scroll down.'",
        "'speaker_1': 'Thank you, Mr. Mayor. And I just want to say how much I appreciate nurses. I spent a great deal of time recently. Memorial Hospital, not too far away, as you're aware. And I could never do the job that you do.'",
        "'speaker_1': 'I mean, honestly, I'm a teacher and people say, I have patients for you. You guys are remarkable how much care you put into your profession and your patients. I see it truly. So the only before us this evening was brought forward out of concern and support for our nurses at community hospital.'",
        "'speaker_1': 'We want community hospital to continue to be a happy and successful place to work and be cared for. Thus, we urge a quick resolution on this matter. The City Council. This City Council cares for those.'",
        "'speaker_10': 'Who care for us. And I know councilmember ships. He had some comments as well.'",
        "'speaker_5': 'Mr. NEIL.'",
        "'speaker_10': 'Thank you, Mr. Mayor. And I would like to thank my colleague for bringing this forward stand in support and would urge the community hospital to bargain in good faith.'",
        "'speaker_5': 'EU Council memberships.'",
        "'speaker_8': 'Everything my colleague said about registered nurses is correct because I'm a registered nurse and I've been trying to tell him for years. So we really this council has had a consistent policy of standing up for working people in our community, and we could do no less for the nurses that are struggling at community hospital to get a'",
        "'speaker_8': 'fair, equitable and timely contract. So I appreciate my colleagues bringing this forward. And for the purpose of the public so that they know one of the particular interests this council should have in this issue is the city of Long Beach owns the land of community hospital.'",
        "'speaker_8': 'It was funded by city dollars and for a very small fund was given over to Memorial for operation. We are grateful for the operations that memorial is doing because there's a number of improvements that have been made, but more need to be made.'",
        "'speaker_8': 'But knowing that and knowing our connection with community hospital, it is imperative that this council stand up for the rights of the the nurses who are again trying to get a fair, equitable and timely contract. So I salute your bravery for being out here tonight and urging a vote to approve this.'",
        "'speaker_5': 'Okay. Thank you. We do have a motion, correct? Who seconded any. Any member of the public with suggested counts on item 11 maps item 19. Major. Okay. You're all going to be on the clock. If there's a lot of people.'",
        "'speaker_5': 'I will have the limited, but try to stay within your time, please.'",
        "'speaker_9': 'Thank you, Mayor. Again, my name is Sonny Zia.'",
        "'speaker_7': 'I am a resident of Long Beach Second Council District. And I'm here to urge you to support a fair contract for nurses that includes patient safety ratios at all times, benefits and retirement, which has been taken off the table.'",
        "'speaker_7': 'Respect, including as it pertains to nurses rights to advocate for their patients without fear of retribution, fair wages and other contractual language that limited memorial care are ends have and community hospital. Hospital has refused to honor their sticking with their take away of 6% in wage reduction, which exacerbates current problem of recruitment and retention of experienced staff'",
        "'speaker_7': '. As a daughter of a nurse and an active member of this community, I respectfully ask you to please take action in support of a fair contract for nurses at our community hospital. They are the selfless individuals who take care of our patients and need to be treated in an equitable and fair manner and be given the opportunity'",
        "'speaker_7': 'to provide for the same standard of care as Long Beach Memorial Hospital. Thank you so much for your time.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'I'd like to thank all of you for allowing me this time to express my concerns to you. I know I'm not a very eloquent speaker, but I ask that all of you will not let that take away from the importance of the message I'm here to convey to you guys.'",
        "'speaker_6': 'My name is Nathan Holtzman. I am a registered nurse in the Behavioral Health Department at Community Hospital of Long Beach. And recently there was an occurrence there due to a decision made by the hospital which resulted in, you know, a severe injury.'",
        "'speaker_6': 'And because of that injury, you know, some of my colleagues, other staff members have had some serious emotional distress. And as you know, being on our own, there's a duty that we have to these patients. And, you know, when something happens, we feel it's.'",
        "'speaker_6': 'I know I presented a very vague description of their occurrence, and I did. And I did that deliberately. I did that because the problem is beyond this incident. The problem is hospital wide. We are currently fighting for a contract, a fair contract that will let us do what we as nurses have a duty to do, which is'",
        "'speaker_6': 'advocate for the safety of our patients. I'm here because your community, which receive care from the hospital, which you guys are lending to them. They need your assistance. The community here. And thank you for this opportunity.'",
        "'speaker_1': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'My name is Mary Keenan, and I've worked at Long Beach Memorial for 40 years. So to say that I have seen the good, the bad and the ugly is an understatement. What is happening now at Long Beach community is a disgrace and an insult to the nurses and the community they serve.'",
        "'speaker_7': 'These dedicated professionals should be respected for their skill in caring. Instead, they are being treated like they are not worthy of the same standards that other Long Beach area nurses receive. I can't help but think this is more about union busting than it is about money or finance.'",
        "'speaker_7': 'This system always has money to support their latest strategy and project. They have shown by their current actions that the nurses and the community they serve are not a priority for memorial care. And I believe you and all of us have a vested interest and responsibility in seeing that our community hospital survives and thrives with a stable'",
        "'speaker_7': ', professional nursing staff.'",
        "'speaker_8': 'So we ask for your support and.'",
        "'speaker_7': 'Anything you can do to pressure this corporation that.'",
        "'speaker_8': 'Doesn't really seem to.'",
        "'speaker_7': 'Value the people that work for it.'",
        "'speaker_1': 'Thank you. That makes people. Please.'",
        "'speaker_9': 'Hi. My name is Sharon Cooper. I've been a nurse for five years, all of which at Community Hospital of Long Beach. I'm also a member of the excuse me, chl b bargaining team. Across the table we have been told by memorial the following that our ICU or intensive care unit is not a real ICU.'",
        "'speaker_9': 'Safe staffing and ratios slow down production and that saving lives has a monetary value based on what people are willing to pay for it. I would like to address these comments by saying that our ICU is indeed a very real ICU, that safe staffing and ratios do slow down production, but they also allow us to provide the'",
        "'speaker_9': 'best, safest and quality care to you and your family. Keep in mind that since the implementation of ratios in California, outcomes have been better for nurses and patients. Patients are more satisfied in hospitals that meet California nursing nurse staffing mandates whether or not those hospitals are in California.'",
        "'speaker_9': 'If hospitals are staffed with California ratios, fewer patients would die due to failure to rescue. We've already seen the negative outcomes of the hospital not following the ratios by having nurses cover each other during meals and breaks, leaving them twice the legal, leaving them over twice the legal limit.'",
        "'speaker_9': 'The very least being the patients and families complaining that during those times there was a delay in care and the most being that being declining patient conditions with a nurse less able to assess and intervene. Despite what memorial care has expressed to us about the value they place on human life.'",
        "'speaker_9': 'In my humble opinion, even just one life saved is more valuable than any corporate profit. We're fighting for a fair contract that allows us to advocate for our patients, ensure their safety and be respected in the workplace. Thank you.'",
        "'speaker_1': 'Thank you. Next week, a place like speaker.'",
        "'speaker_7': 'Good evening. My name is Jackie McCabe. I'm Aunt CHB for 29 years. And like you then to on the marketing team for the last year, our hopes with memorial care was to develop one standard for community. If the patients in Long Beach, the language for memorial care that they're proposing violates our basic rights.'",
        "'speaker_7': 'One of their proposals is to eliminate our freedom of speech. They don't want us to say disparaging things out loud by coming in. If we accepted that proposal coming here tonight, I could lose my job, which, you know, we find sort of unacceptable.'",
        "'speaker_7': 'They have proposed that layoff language that allows them to select individuals for layoffs and not do it by seniority, but a more penalizing way. They propose wage reductions and we're already below standard. They initiated a benefit package without bargaining with us to do that.'",
        "'speaker_7': 'So because of that, today we filed charges with the National Labor Relations Board. I just wanted to share that with you. Thank you.'",
        "'speaker_1': 'Thank you. Speaker, please.'",
        "'speaker_6': 'Hello. My name is Premiere Reyes. I'm staff are in at Community Hospital Long Beach and it's been over a year and a half since I last before you. Talking to you about our plight. A community hospital of Long Beach.'",
        "'speaker_6': 'And today, I would like to talk to you a little bit about the recruitment and retention community hospital. The one thing I do have to say is that memorial is actually getting better in their recruitment because as I sit there and talk to our unit managers, they tell us that there might be five new staff members coming'",
        "'speaker_6': 'on to staff and unfortunately, only two of them actually end up actually coming to orientation and actually starting in the emergency department. And a lot of the newer staff that's coming there that some of their comments that are that there's no real room for growth.'",
        "'speaker_6': 'There's no there's no real education department. And so, in turn, some of the employees leave to go go somewhere else, leaving us short staffed. And when we're in short when we're short staffed, it throws off our skills mix.'",
        "'speaker_6': 'And in turn, they expect to still to take care of the same amount of patients, even though we're don't have enough staff for it. And that contributes to unsafe environment, which in turn doesn't really allow us to deliver the high quality care that our patients deserve in the emergency department when they come for help.'",
        "'speaker_6': 'So I just want to let you know what's going on. Thank you.'",
        "'speaker_1': 'Mike Speaker, please.'",
        "'speaker_6': 'Good evening, council members. My name is Roberta Ranga. I'm a member of the Board of Trustees at Lobby City College. But I'm also the son in law of a patient who has benefited very highly from her, from the nursing and quality industry that is receiving at home.'",
        "'speaker_6': 'For the last 13 years, I've seen graduating classes of nurses along with City College, and I know that the quality of care that they provide is top notch. I'm sure that when they graduate and are ready to go into the workforce, that they want to be respected with good salary, wages and benefits.'",
        "'speaker_6': 'I'm looking forward to your unanimous endorsement of this resolution. Thank you very much.'",
        "'speaker_1': 'Thank you. Next speaker, please. Rex Pritchard, president of Long.'",
        "'speaker_6': 'Beach Firefighters Association. I ask that you support this motion before you. The nurses are vital partners with firefighters in the city in delivering 911 services. We could not do our jobs without them. When we arrive at the hospitals with patient and community hospitals, a vital, vital resource that we use every day and there are definitely needs to'",
        "'speaker_6': 'stay open and is a much needed resource on the east side of town. Thank you.'",
        "'speaker_1': 'You're seeing. See, there's no other public speakers. I'm going to go out and turn this back over to the city council. Starting over with Councilmember DeLong.'",
        "'speaker_10': 'Thank you. I'm curious that the makers of the motion, do you know how much money from WellCare makes at this hospital every year? Do they generate a profit or loss or do we know what their performances?'",
        "'speaker_8': 'Do you?'",
        "'speaker_1': 'I think there was a question that comes with the long made to any of the jury.'",
        "'speaker_8': 'Do you, Mr. DeLong?'",
        "'speaker_10': 'Yeah. Well, at least in the research that I did, it showed that they lost $9 million last year, and they're on track to lose $8 million this year. So I just think, you know, I do want people to feel that the hospital is is rolling in cash.'",
        "'speaker_10': 'I think that, you know, they do have some challenges, but they're having a great level of service level and which community what I would offer as a substitute motion, because I think it's important rather than pick one side or the other to encourage both.'",
        "'speaker_10': 'So what I'd like to offer is to mutually encourage both parties to bargain in good faith for an agreement that will be good for the patients, the employees, the hospitals and the community.'",
        "'speaker_1': 'Okay. I don't I don't hear a second on that. Okay. There's no second. Can you comment on the motion from many council members? There's a motion on the floor. Kate, there's a message on offer. Please cast your votes.'",
        "'speaker_1': 'Yeah. I mean. Yes, but I can't think you're going to.'",
        "'speaker_6': 'Motion carry seven votes. Yes. One vote no.'"
    ],
    "Recommendation to adopt Specifications No. ITB FS-14-017 and award a contract to United Rotary Brush Corporation, of Chicago, Illinois (not an MBE, WBE, SBE or Local), to furnish and deliver street sweeper brooms on an as-needed basis in an annual amount not to exceed $200,000 for a one-year period, with the option to renew for one additional one-year period.  (Citywide)": [
        "'speaker_1': 'Okay. Moving on now to the rest of the agenda. We're going to go back to the regular agenda. So we're back to Mr. Clark, I believe, to number 11.'",
        "'speaker_6': 'Thank you, Vice Mayor. Number 11 was the financial management department. It was the recommendation to award a contract to United Rotary Brush Corporation for an amount not to exceed $200,000.'",
        "'speaker_1': 'Some moved the motion in a second. Any public comment on the item kept help.'",
        "'speaker_2': 'Larry Goodhew quirk as the address from may seem in on its face to be a mundane item and it probably is, it needs to keep our streets clean or are self evident, particularly with the various different climate changes we've had.'",
        "'speaker_2': 'But as I was reading this, after I read read this, I happened to pick up another article by Bill Pearl that struck me. And it moves me to suggest that we might amend this contract or put it on hold, come back and take a look at it to see if this company, which I checked out, it is'",
        "'speaker_2': 'one of the premier companies in the country that makes high quality brushes hit the streets clean and other brushes. And I'm wondering whether or not we should. In fact, I think we really should explore the possibility of seeing if they can design a brush, that we can clean out sectors of the 14th floor and certain areas behind'",
        "'speaker_2': 'this dais that seem to have a proclivity for trying to conduct public business on their private e-mail accounts, be it computer or cell phone, Twitter or whatever they're using, which, as Bill Perrow pointed out in his article today, and if you haven't read it, you should read it is really directly repugnant.'",
        "'speaker_2': 'To the public process. And it really gives the middle finger to the people when those people on the 14th floor and it's clearly not all of them and those people behind the dais are so arrogant that they want to withhold from the public the private e-mails that they are sending back and forth.'",
        "'speaker_2': 'Whether the cyber footsie or whatever when conducting public business, if you're conducting public business with somebody, particularly when you're talking money, but even not that you should make those available to the general public. To her credit, Jerry ships, he does that to the best of my knowledge.'",
        "'speaker_2': 'He's the only person that does that. But if you're using in hiding behind emails or hiding behind private emails to conducts city business, that is directly repugnant to public that process. And therefore, I think this counsel should go on record as asking this brush company where at this broom company, if they can design a broom that will'",
        "'speaker_2': 'help us sweep and eliminate the soiled areas on the 14th floor and behind the rail where this practice has been embedded. Thank you.'",
        "'speaker_1': 'Thank you. Those was great. Moving on to the next item, please, Mr. Kirk. Actually, we have we have the motion is going to take the vote. Any of the public comment? Please cast your vote. I mean, yes again.'",
        "'speaker_6': 'Motion carries eight votes. Adam 1212 is a report from financial management with the recommendation to approve a contract with West Coast sand and gravel for an amount not to exceed $500,000.'"
    ],
    "Recommendation to authorize City Manager to execute all documents necessary to amend Contract No. 32604 with Fastenal Company, a Long Beach-based business (Local; not an MBE, WBE or SBE), for furnishing and delivering custodial paper products and janitorial cleaning supplies, to increase the contract amount by $400,000, to $1,120,000 for the period ending May 29, 2014, for a total three-year contract amount not to exceed $3,560,000.  (Citywide)": [
        "'speaker_6': 'Motion carries eight votes. Next item to report that involves financial management with a recommendation to amend a contract with fast Internet company for custodial products in an amount not to exceed $3.5 million.'",
        "'speaker_1': 'Can I get a motion to move the motion in a second? Council member along long.'",
        "'speaker_10': 'Customer of staff. Are there any unit price increases or is it just more volume?'",
        "'speaker_1': 'I'm going to turn that over to our new purchasing officer, Jason MacDonald. Remember, it is my understanding.'",
        "'speaker_2': 'Sorry. It is my understanding that this increase is due to additional locations and needs that weren't originally identified. So to my understand, there's no increase in individual item cost.'",
        "'speaker_10': 'Thank you very much.'",
        "'speaker_6': 'Last May, the maker of the motion was council member Donald.'",
        "'speaker_1': 'Second was thrilled with the long kept. I'll second it. Thank you. It's no. No public comment on the item. See? None. Cast your votes. Yes.'"
    ],
    "Recommendation to adopt resolution approving the issuance by the Board of Harbor Commissioners, on behalf of the City of Long Beach, of Harbor Revenue Refunding Bonds, in an aggregate principal amount not to exceed $90,000,000, and Harbor Revenue Short-Term Notes, in an aggregate principal amount not to exceed $350,000,000, secured by Harbor Department revenues.  (District 2)": [
        "'speaker_6': 'Motion carries a vote. Yes. Next item to report from financial management with a recommendation to adopt a resolution approving the issuance of revenue, refunding bonds and harbor sharp short term notes.'",
        "'speaker_1': 'So, quote, There's been a motion and a second. Any public comment on the item?'",
        "'speaker_0': 'Yes, sir.'",
        "'speaker_11': 'Yes, sir. Again, my name's John Voracek. I'm curious as to what these bonds are used for. I mean, a $90 million short term bond and a $350 million aggregate. You know what? It appears to me to be essentially a loan is something that I think that the people of the city need to know what that revenues are'",
        "'speaker_11': ', what that those funds are going to be used for.'",
        "'speaker_1': 'What I just heard, Mr. West, just give us an update on that briefly. Vice Mayor, council members. We will have a quick report from our city treasurer Dave Nakamoto, as well as a.'",
        "'speaker_10': 'Representative from the Port David.'",
        "'speaker_11': 'Thank you, Mr. West, Honorable Vice Mayor and members of the City Council before you as a recommendation to approve the issuance by the Board of Harbor Commissioners of Harbor Revenue refunding bonds in amount not to exceed $90 billion and harbor short term notes in an amount not to exceed $350 million.'",
        "'speaker_11': 'These issuances are secured by harbor department revenues only. The purposes of these issuances are to lower the overall financing cost of the port and to finance a portion of the Gerald Desmond Bridge replacement costs. City's City Council's action is requested tonight to facilitate the Port Board excuse me to facilitate the port's forthcoming issuance of bonds.'",
        "'speaker_11': 'Port staff and bond counsel are available for questions. This concludes staff support.'",
        "'speaker_1': 'Conservatorship Scheme.'",
        "'speaker_8': 'Mr. West. Or actually, Mr. Nakamoto, if you could answer this, what would be the liability of the city of Long Beach by the Council making this action today? Should the port, for whatever reason, not be able to pay the the necessary obligation on this.'",
        "'speaker_11': 'Councilwoman ship scheme? We believe the port has a very high quality credit. In fact, today Fitch affirmed the port's Double-A rating. However, in the event something unforeseen did happen, the city is not liable for the for the debt repayment.'",
        "'speaker_8': 'And so then only the port would be liable. All right. I wanted to make that very clear. So it's not the city of Long Beach on the hook.'",
        "'speaker_6': 'Correct. I think.'",
        "'speaker_1': 'Okay. So no other questions from the council. There's a motion on the floor. Please cast your vote on this.'",
        "'speaker_6': 'Motion carries eight votes.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'Next item in 15 is a report from Long Beach Gas and Oil and Financial Management with the recommendation to initiate inspection of customer and sewer laterals in connection with the gas line pipe installation.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager to execute a contract with West Coast Arborists, Inc., of Anaheim, CA (not an MBE, WBE, SBE or Local), for a park tree inventory, on the same terms and conditions afforded to the City of Agoura Hills, for a total amount not to exceed $199,000, for a period of one-year, with the option to renew for one additional one-year period, at the discretion of the City Manager or his designee.  (Citywide)": [
        "'speaker_6': 'Motion carries eight votes. 1616 is a recommendation of Parks, Recreation and the Financial Management Department, with a recommendation toward a contract with to award a contract to West Coast Arborist for an amount not to exceed $189,000.'",
        "'speaker_5': 'So moved to.'",
        "'speaker_1': 'Close the motion and a second I'm going to first get a public comment saying none. I'm as I get back behind the rail to customer ships keep it also Mr. Clarke, can you restart the podium? Keeps blinking off over there, Councilor Reshevsky.'",
        "'speaker_8': 'Thank you, Mr. Garcia. Mr. Chaplin, before you came here, Mr. Heston, we started. We initiated this tree inventory using the AI tree software, and we utilized Boy Scouts and a number of youth. Is there any way that we can reach back out to those groups and involve them?'",
        "'speaker_8': 'They actually somewhere in the city is the data from the initial inventory that they started. So is there a way we can reach back out to scouting troops? And I know this is a private contractor, but there's a lot of interest out there in youth about getting involved.'",
        "'speaker_1': 'Councilman, we certainly can try. I think part of the issue is the the contract calls for certified arborist to do this work. And, you know, it's the overall tree counts, the location of species. They also they're also going to look at the conditions of the trees and the maintenance needs.'",
        "'speaker_6': 'So really, we're really going to need people who can actually make that call.'",
        "'speaker_1': 'Out in the field. In addition to that, they're using technology that interfaces with the citizen system and our work order system. So I think we can probably find other projects for them, but this one is really important for us to utilize.'",
        "'speaker_1': 'The Certified Arborist.'",
        "'speaker_8': 'Well, I understand that I'm not asking for a replacement, but I would hope that we could reach out with these groups because they could maybe perhaps tag along because they the arborist did go with them last time and identified trees and so that they were able to do measurements and things.'",
        "'speaker_8': 'It would just be helpful that we could kind of grow our own team of community environmental arborist because there's an interest out there.'",
        "'speaker_1': 'We'll certainly look at it. Okay.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_1': 'Okay, great. See no other comment. Please cast your votes or the motion. I mean. Yes.'",
        "'speaker_6': 'Councilmember Johnson. Motion carries eight votes.'",
        "'speaker_1': 'Item 17.'"
    ],
    "Recommendation to receive the application of Stateside Crafts, LLC, dba Stateside Crafts, for an original Alcoholic Beverage Control License, at 4242 Atlantic Avenue, determine that the application serves the public convenience and necessity, submit a Public Notice of Protest to ABC, and direct City Manager to withdraw the protest if a Conditional Use Permit is granted.  (District 8)": [
        "'speaker_6': 'The report from the police department with the recommendation to receive and receive the application of state side crafts for an original ABC license at 42428 Atlantic Avenue and determined that the application serves the public convenience and necessity. And submit a public notice of protest to ABC.'",
        "'speaker_6': 'And direct the city manager to withdraw the protest if a conditional use permit is granted. This is in District eight.'",
        "'speaker_1': 'Councilmember Alston.'",
        "'speaker_11': 'Thank you very much. I am going to move this item on so moved second and just with a condition that that I do support the the recommendation to uphold the protests. But this is a business that we are looking forward to seeing in the Bixby Knolls area on Atlantic as part of the Renaissance that is occurring.'",
        "'speaker_11': 'I have met with the owner, Miss Arnoldo, and I'm very impressed with the business model that will be coming forth. But because this is coming before the conditional use permit process, we have to uphold the protest. And but I do look forward to working with her as well as other local residents, to find a balance for for'",
        "'speaker_11': 'good business in Bixby Knolls and quality of life for our residents. So I would ask for your support.'",
        "'speaker_1': 'And there's a motion and a second. Any public comment on the item saying that please cast your votes on the. Yes.'",
        "'speaker_6': 'Motion carries eight votes.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'Automated reports from the office council member James Johnson and council member Steven Neale with a recommendation to adopt a resolution supporting April as National Child Abuse Prevention Month.'"
    ]
}