{
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Section 21.25.502; and by adding  Sections 21.15.064.5 and 21.45.500, all related to adaptive reuse, read and adopted as read.  (Citywide)": [
        "'speaker_0': 'All right. Thanks, Larry. Appreciate it. Okay. We're going to hearing item number one, Mr. Herrera. We'll read.'",
        "'speaker_1': 'Hearing. One involves the Financial and Development Services Department with the recommendation to receive supporting documentation into the record. Conclude the public hearing and consider the categorical exemption and declare the adaptive reuse ordinance. Read the first time and lead over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_1': 'And then secondly, to adopt a resolution directing the Director of Development Services to submit the Adaptive Reuse Ordinance to the California Coastal Commission for Review and Certification.'",
        "'speaker_0': 'Okay. No, I think that's correct. Mr. Clarke read.'",
        "'speaker_6': 'Yes, Mayor. Members of the Council, Amy Burdick will provide the staff report. Mr. Mayor, members of the City Council, thank you for the opportunity to present to you tonight our adaptive reuse ordinance. We have previously made changes to Title 18, which is our local building code back in November.'",
        "'speaker_6': 'To get us halfway there in the process of having a proactive, adaptive reuse ordinance. We also needed to amend Title 21, which is the zoning code, to make some certain changes to our adaptive reuse ordinance, to provide much more flexibility in the reuse of buildings for either live work, residential or for a different use than what the'",
        "'speaker_6': 'building was intended. We do believe that this has been a process that has been desired by the development community, the neighborhoods and as well as political leaders like yourself who have been pushing us to be much more flexible in how we zone buildings and what those uses can be.'",
        "'speaker_6': 'So as I said, we asked you and you did approve changes to the building code back in November, which were effective January 1st. What is before you today is changes to the zoning code or Title 21, which will provide us certain incentives that we can provide adaptive reuse projects and much more clarity in the process that we'",
        "'speaker_6': 'would use in order to help plan check those processes. A perfect example of this is a project that we worked through the reuse of a historic church at Third and Obispo. It will be converted into a senior residential project.'",
        "'speaker_6': 'It was a very, very difficult process for us and for the applicant. And if we had this adaptive reuse ordinance in place, it would have eliminated a number of steps on behalf of that applicant and would have allowed us to reuse that resource much more quickly.'",
        "'speaker_6': 'So with that, that concludes my staff report, and I'm available to answer any questions.'",
        "'speaker_0': 'Councilmember Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mason. Mr. Mayor, I'd like to make the motion to approve.'",
        "'speaker_0': 'Second, moving seconded. Any member of the public was just a councilman. Hearing item number one, any council discussion. So you then members cast your votes. Well, I'm sorry. I didn't see you there, John.'",
        "'speaker_3': 'That's okay. Good evening, Mr. Mayor. Members of the City Council. My name is John Thomas, and I am here to represent Long Beach Heritage, asking for your concurrence and approval for this first read for the Adaptive Reuse Ordinance.'",
        "'speaker_3': 'This is an incredible opportunity for the city of Long Beach, long overdue to do in terms of our historic resources that are up for CU over the next probably 5 to 10 years for a relook and a redo.'",
        "'speaker_3': 'Breathe new life into some of our great historic buildings. It's a great tool and incentive, as staff indicated, for the private sector and for the public sector. On the private sector side, people that own these resources or people that are buying these resources can now come to an environment with with a cultural awareness where they're solution oriented'",
        "'speaker_3': 'opportunities and seeking mitigation measures on behalf of the city, using the state historic building code and other opportunities where we mitigate the concerns raised in the development review process to allow the buildings to actually reach a new alternative reuse.'",
        "'speaker_3': 'On the city side, it's a great opportunity for development services, our health department, police and fire as they mitigate issues concerning the building in fire codes and planning codes to allow the building to actually be adaptively reuse low impact on the adjacent communities in terms of parking.'",
        "'speaker_3': 'But our great architectural resources in that great vocabulary of the city of Long Beach continues in a new life. Finally, this is a great green ordinance. The best green grass green approach to building is to keep the building as it is and not tear it down and put it into a landfill.'",
        "'speaker_3': 'But on the other side, it's also a great green economic tool. It allows our building to stand, create jobs and really become a better product for the city of Long Beach, whether it's our downtown or our historic neighborhoods.'",
        "'speaker_3': 'So I thank you and urge you on behalf of Long Beach Heritage to consider the ordinance and accept it. Thank you.'",
        "'speaker_0': 'Thank you, John. Appreciate it. Any further public comment? Gang members cast your vote for Mr. Mayor.'",
        "'speaker_7': 'We need a few comments and one to make them queued up.'",
        "'speaker_8': 'We need two votes to mayor, one on the resolution, one on the ordinance.'",
        "'speaker_0': 'All right. First on the resolution, members, cast your votes on the resolution. You.'",
        "'speaker_1': 'Motion carries nine votes.'"
    ],
    "Adopt resolution directing the Director of Development Services to submit the Adaptive Reuse Ordinance to the California Coastal Commission for their review and certification.  (Citywide)": [
        "'speaker_0': 'Yes. Thank you, members. Now on the ordinance, the same motion.'",
        "'speaker_7': 'Yes. And I still like to make my comments.'",
        "'speaker_0': 'Oh, good.'",
        "'speaker_7': 'Thank you. I wanted to thank the city staff. This is something that I didn't want to just take a quick vote on, given the amount of work that's gone into this and John Thomas has alluded to it. This is long in the process and city staff in the Planning Commission are to be thanked for their diligence in'",
        "'speaker_7': 'developing this ordinance and adhering to the spirit of the original Council agenda item, which was I don't know how long ago, probably two years now. I'd also like to thank you, John Thomas, and other advocates for your input and support along the way.'",
        "'speaker_7': 'It takes that kind of community stamina to hang with us when this kind of public policy is developed and how long it does take for built out cities such as Long Beach. Adaptive reuse can be an important tool for revitalizing business corridors and residential buildings, thereby stabilizing communities.'",
        "'speaker_7': 'I think Mr. Thomas was clear in his testimony. It's especially true today in post redevelopment environment where older buildings, if tended to, if, if revitalized, can contribute to improving blighted areas. And that's what we would look forward to.'",
        "'speaker_7': 'Underutilized sections of a block can be reactivated and serve as anchors for new business activity, creating pedestrian traffic and sales tax revenue. Adaptive reuse is also an economic multiplier that creates jobs again in a post redevelopment environment. These are the opportunities we have to look for in other ways, and I think we do that here with this'",
        "'speaker_7': 'ordinance. A recurring theme and adaptive reuse or any type of development, for that matter, is the need for a permit process to be efficient and predictable. But adaptive reuse regulations also need to be flexible when it comes to applying today's building codes to 50 year or plus 50 plus year buildings.'",
        "'speaker_7': 'We're not talking about reducing safety requirements, and I want to assure those of you that might have concerns about that. But there are codes that can be overly burdensome and end up chasing good developers away from a project.'",
        "'speaker_7': 'I believe this ordinance achieves these goals and the timing could not be better for the real estate and construction industries. We in Long Beach have an impressive collection of older and historic buildings to prove to rival any other city in Southern California.'",
        "'speaker_7': 'I know we're all very proud of that. And now we have the tools to cultivate these treasures and invest in their future. Thank you.'",
        "'speaker_0': 'Thank you. All right. The same motion and same second on there was on the audience.'",
        "'speaker_5': 'Speak for matter.'",
        "'speaker_0': 'Make it quick, Mr. Duncan. I already asked twice.'",
        "'speaker_5': 'Republican. I think you know a difference, too. I think that the preservation organization is a vast waste of money. Millions of dollars squandered. We should advance and progress with modern buildings. The old buildings look ugly. And that's why they ought to be torn down that are because they are ill constructed or have rats in them or something'",
        "'speaker_5': 'like that. A parking lot would provide more revenue and be more business oriented. And a new building. A new building, not an old building done over again, but a new building will provide more jobs for people's interaction and would be even look better.'",
        "'speaker_0': 'Thank you. Mr.. Then to the point as usual. Members cast your votes on the ordinance. Please.'",
        "'speaker_1': 'Motion carries nine votes.'",
        "'speaker_0': 'Okay. We open at the public comment. We have seven members of the public. Please come up here. Identify yourself. You'll see a green light when the yellow light comes on. It means you have about 30 seconds left. Please stay within the 3 minutes.'"
    ],
    "Recommendation to direct City Manager to examine case studies from similarly sized municipalities that presently guarantee free preschool for their residents and report back to the City Council in 120 days with his findings about ways to fund such a venture in Long Beach, along with concrete policy goals and eligibility requirements that would allow for universal access without a major impact on the city budget; coordinate with Long Beach Unified School District (LBUSD) to ensure that any proposed program would not interfere with existing teaching contracts or place an undue burden on their resources; and reach out to existing community groups that provide this service for children to hear their ideas and input.": [
        "'speaker_0': 'Good item 1212.'",
        "'speaker_1': 'Is a report from the Office of Vice Mayor Robert Garcia and Councilmember Susan Lowenthal with a recommendation to direct the city manager to examine case studies from similarly sized municipalities that presently guarantee free preschool for their residents and report back to the City Council at 120 days with various request.'",
        "'speaker_0': 'For help. Mr. Vice Mayor.'",
        "'speaker_9': 'Thank you, Mr. Mayor. This is just an extension of, I think, a a conversation that's happening right now across the country, certainly in the state. And it's happened here with a lot of educators in Long Beach for for many years.'",
        "'speaker_9': 'There's certainly been a discussion for and it's intensified, particularly the last few years, about the quality and about the importance of a pre-K education for children and what that really does for for cities and for communities. And I think as an educator, I think most educators would agree that there is there are very few things that you'",
        "'speaker_9': 'can get a better return for your investment than ensuring that every child has access to a pre-K education. pre-K pre-K education and report and study after study has been shown to do incredible and provide incredible support for children.'",
        "'speaker_9': 'It prepares them for that K-12 education. It certainly provides support for parents. It provides support for particularly single parents who are able then to to work and provide income for the family and and find other support. So pre-K and the idea of universal pre-K is certainly something that's been supported for for many years.'",
        "'speaker_9': 'What's happened the recently over particularly the last five years is that municipalities have entered into new partnerships and agreements, and in some cases, they have established their own pre-K systems and others have worked more directly with the state, and others have been funded through a variety of different grants and with some federal support.'",
        "'speaker_9': 'So now what we have today across the country is we have a variety of different pre-K models that are working. And you can look to, for example, San Antonio or other cities across the country, whether it's Chicago or Tulsa.'",
        "'speaker_9': 'And New York is now discussing it as well in how pre-K and universal pre-K could work when it's driven particularly by by a city or municipality. So this item is really just informational and is asking for three things in particular.'",
        "'speaker_9': 'And I'm going to to change part of the motion just a little bit. The first is to ask the city manager to come back to the council some time in the over the course of the next few months with information about what best practices are happening with pre-K across the country from a municipal point of view.'",
        "'speaker_9': 'So what are these other municipalities doing that perhaps is working? What other models are available to to cities? The second thing is we want to ensure that we're working with the school district directly. There was a suggestion, which I like to forward this as well, to our Joint Use Committee to have some in-depth discussion about what Lambert'",
        "'speaker_9': 'Unified is doing and how that could how we could support, you know, elbow stitch effort in pre-K. And then the last part of the motion will be, if we could please reach out to our early childhood education committee, which has been working on this issue, obviously, for for very long, and kind of coming together with that group'",
        "'speaker_9': 'as a city partner and getting their input and ideas so that when we come back to the council, we have a really healthy discussion of what's happening currently in Long Beach, and there's a lot of good things happening currently.'",
        "'speaker_9': 'And then what are the possibilities for us moving forward? So with that, I'd like to make the motion.'",
        "'speaker_0': 'Moving, seconded Mr. Dole.'",
        "'speaker_4': 'Thank you, Mr. Mayor, and thank you for this item. It raises heightens awareness of the need for pre-K education. As a teacher and a parent of two young ones, I know the importance of this. And I don't you know, I don't know what the vision is here and maybe the vision isn't even complete.'",
        "'speaker_4': 'Certainly there has to be revenue to pay for this. I know. What did San Antonio do? They did a sales tax. Correct. And I don't know that the city would be the best provider of this service either. I would hope we would look to the school district, our superintendents, school board and teachers over on the Long Beach'",
        "'speaker_4': 'Unified side to provide this services. Is that kind of your vision or do you even know yet?'",
        "'speaker_9': 'We're certainly not laying out any sort of vision right now. I think that there are there are different models in different cities that are being used. So San Antonio is one model, but there are certainly others. And I think at the end of the day we would want this process driven by bi by educators.'",
        "'speaker_9': 'And so the idea is to get the information to meet with constituencies and then come back for a fruitful discussion report.'",
        "'speaker_4': 'Great. Thank you. Well, I think even, you know, bringing it out, throwing out in the post so people can be just aware that we, too, know the importance of pre-K education. And the fact of the matter is, we are the tale of two cities, and we need to build that bridge between the two sides.'",
        "'speaker_4': 'And pre-K education is certainly a way to help that. So I'm certainly supportive of that. But again, I my my thinking would be this would probably best be best fit within the the purview of the school district. But again, it doesn't mean that we can't help move this down the road and get something like this going in'",
        "'speaker_4': 'our city. We do have some other efforts. I know the school district already engaged in a number of efforts across our city as well with their limited resources. Remember, their their funding is still below the 0708 level. So they right now don't have the resources to provide this service, but it is necessary.'",
        "'speaker_4': 'The fact of the matter is that if a child doesn't read it, though, at the fourth grade level, there's a 75% chance that never that child never will read at grade level. So we need to get literacy kids introduced to literacy at a young age.'",
        "'speaker_4': 'That's very important. And pre-K education does that. So again, I appreciate the the raising of awareness of that tonight and your open mindedness as to how we would get this moving and provided and language for that.'",
        "'speaker_9': 'Can I just respond and part of I think Councilmember O'Donnell's your comments is is right. I think part of the reason to go to the Joint Use Committee is to have a discussion with the superintendent and the school board as well, so that we're all on the same page.'",
        "'speaker_4': 'You know, and Pat West can probably finger paint, but I don't know how well he tells a story. And inspires kids to love reading.'",
        "'speaker_0': 'So I have no idea what the heck is going on.'",
        "'speaker_4': 'Kind of saying is I don't know that this necessarily belongs within the purview of the city. I think I got a.'",
        "'speaker_11': 'Story from the city manager a week in the briefing.'",
        "'speaker_0': 'And the fiction or nonfiction. Yeah.'",
        "'speaker_10': 'It's like preschool here. Mr. West I would hope that in this report, if you could add L.A. Universal Preschool, they're actually a nonprofit organization that has come to the city many times. They have they are privately funding universal preschool in Long Beach.'",
        "'speaker_10': 'And our own Jean Bigsby Smith is on their board of directors. So it would be helpful to see what they're doing because they're not relying on government funds. They right now have funded about 60,000 children in L.A. County and have quite a extensive list for the mom beach preschools they're funding.'",
        "'speaker_10': 'So hopefully we can include that information as well. Thank you.'",
        "'speaker_0': 'That's very long ago.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I wanted to thank the vice mayor for raising this issue. We have our youngest supporter, I think, Miss Jubilee, in the audience, who's come to speak on on validating why it's important to have this accessible to everyone after she's finished with her snack.'",
        "'speaker_7': 'Of course, we know that early learning is one of the best economic investments a society can make, and regardless of who pays for it, it's an investment that's worthwhile. And for every dollar that's invested, there's an exponential return on that investment in the form of earning potential.'",
        "'speaker_7': 'And how how we actually place value on that is not clear to me. But I do know that that value is there. There's also savings to society in decreased costs for special education, grade repetition and, worst of all, criminal justice.'",
        "'speaker_7': 'I think most people would prefer to build more preschools than prisons. But politics and life's complexities have a way of making that choice more difficult than it needs to be. However, as a former school board member and as a mother of a young child at Long Beach Unified, I can attest to the value of pre-K programs.'",
        "'speaker_7': 'When my son started in kindergarten, he was probably only in the third of the class that actually had any pre-K education. And that's difficult. That's difficult for the teacher in kindergarten where you have 19 students and only about eight or nine have had any preschool education.'",
        "'speaker_7': 'So these fee based programs aren't ones that most families can afford. They're very expensive. They can be very expensive. And I'm aware of existing programs that limit unified offers. And I'm quite sure the superintendent and the school board would welcome the opportunity and funding to expand worthwhile early learning programs.'",
        "'speaker_7': 'And they do a good job. Let me be unified as one of the first that actually pursued making kindergarten mandatory. And we all know that that's very critical. So I'm interested in finding out how other cities went about funding their pre-K programs.'",
        "'speaker_7': 'Were sales tax ballot measures the only source, the sole source? And then let's determine whether Long Beach is able to partner with our school district to offer residents this choice. I'm appreciative that the Vice Mayor added that component to the motion, working with the Joint Use Committee.'",
        "'speaker_7': 'I think together we can find opportunities to ensure that these.'",
        "'speaker_6': 'Early.'",
        "'speaker_7': 'Early education programs are available to our young residents. Thank you.'",
        "'speaker_0': 'Mr. Johnson.'",
        "'speaker_3': 'Well, thank you, Mayor. And I want to thank the vice mayor and Councilmember Lowenthal for bringing this forward. I think all of us understand and agree that preschool is critically important. I think that I appreciate, vice mayor.'",
        "'speaker_11': 'Your addition.'",
        "'speaker_3': 'To the motion to send it to the Joint Use Committee. And this is exactly the kind of item where the city and school district have joint interest that we should move forward together. I think the school district's already doing a great job.'",
        "'speaker_3': 'What they have. There may be some opportunities, too, for the city to assist them.'",
        "'speaker_11': 'In getting more grants or perhaps making their grant.'",
        "'speaker_3': 'Applications, you know, more successful. And that would be my interest. You know, how can we go out and get outside funds, whether from private nonprofits or from the federal government, etc., to expand and build upon what we're already doing.'",
        "'speaker_3': 'So I look forward to having that conversation as the chair of the Joint Use Committee, and thank you for coming out with this item. Strangers.'",
        "'speaker_2': 'Yes, thank you, ma'am. I also would like to welcome my sentiments for the individual part, this item forward and I also thank the educators here tonight were supporting this item. But you know that, like I say, we can't talk about money when we talk about education because, you know, without education, you know, we would have any money'",
        "'speaker_2': '. So you guys please take this into consideration, understand that this is one of our prime was our kids, our future. We want to thank you guys for even bringing this item forward. Thank you again.'",
        "'speaker_0': 'Thank you. And remember, the public was just a council on side. And please come forward, identify yourself. Be mindful of time.'",
        "'speaker_10': 'Good evening. I am Francis Emily Dyson. Harris and I reside in District one and Mayor Foster City Council members, particularly Council Vice Mayor Garcia and council member Dr. Lowenthal, thank you for bringing these findings forward and thank the city.'",
        "'speaker_10': 'I'm looking at the writing of this and it's just absolutely phenomenal. And I heard Mayor Foster speaks many times about what about the children? So I look at this now, what about the children, our youth and our future, which is a very good thing.'",
        "'speaker_10': 'And the segment that says allow for universal access. Universal access in terms of early learning. And I'm thinking in regards to children with disabilities, there's children with disabilities that have physical disabilities that are quite capable of going to regular schools.'",
        "'speaker_10': 'And I would like you to look into the feasibility of this also for children with disabilities and preschool, having this opportunity to be able to go to school with children that are not disabled because we've got to move forward in a world that all persons are equal, that you have, you know, sensitivity, understanding.'",
        "'speaker_10': 'And I really think starting at the beginning would be a very good thing. So if you could possibly look into this fact that there's applications to include children with disabilities, physical that do have that the mental and the educational capacities to be able to go to a preschool and please give them that opportunity.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Any further public comment? Okay. We have motion second members. Cast your votes and I'm pleased I'm so.'",
        "'speaker_6': 'Hi. My name is Christine Integrally and I live in the fifth District. I'm here on behalf of the Long Beach Early Care and Education Committee, and we're extremely excited about this particular item and this discussion here in our city.'",
        "'speaker_6': 'Given the President's Federal Early Learning proposal, as well as all of the initiatives that are taking place here in the state of California with regards to transitional kindergarten or kindergarten for all four year olds, we think it's really important that the city continue to engage in these conversations and help the public to be aware of these opportunities'",
        "'speaker_6': '. And also, as these opportunities come forward, we want to ensure that all of these programs for the four year olds are of the highest quality, with the most well-prepared teachers for the children. Hi, I'm Judy. Carrie Fisher. I'm a consultant with the Long Beach Early Childhood Education Committee.'",
        "'speaker_6': 'The committee is comprised of more than 40 organizations the school district, private childcare providers, home based providers, etc.. We do want to extend a special thanks again to Vice Mayor Garcia and Councilmember Lowenthal for pushing this initiative forward.'",
        "'speaker_6': 'Hearing the connections to the school district, I think is really imperative right now because the early learning community is very concerned about the educational shifts that are going on through Common Core State standards. And one of the things that we're doing to ensure that those standards trickle down to the early learning community and can also be very'",
        "'speaker_6': 'integral in preschool for all to ensure that our children are ready to enter kindergarten at a brand new standard, ready to go. It's not the same kindergarten that it used to be in order to show that movement week of the young child is coming up, that it will be the week of April the sixth.'",
        "'speaker_6': 'And our push is to engage all of the early learning environments, whether it's home based, center based, whether it's the school district. And you will see banners outside that say children are educated here. There is the misnomer that our child care providers are baby sitters.'",
        "'speaker_6': 'And our message is that our children are educated here. And the way that will be further reinforced is through a universal pre-K approach that the city takes.'",
        "'speaker_10': 'For.'",
        "'speaker_6': 'Our youngest children. Thank you.'",
        "'speaker_0': 'Thank you, everybody.'",
        "'speaker_6': 'Good evening, Mayor Foster, council members and staff. My name is Cindy Young and I'm the director of the Child Development Centers for Long Beach Unified. And I'm here just to support your conversations. And we're very grateful that you're entertaining the conversation about universal preschool and wanted to share some interesting statistics.'",
        "'speaker_6': 'Research shows that if three and four year old children participate in a quality preschool program, they will require less intervention in the K-12 system and will be more likely to continue to go on and graduate for college and career readiness.'",
        "'speaker_6': 'What we do know is that students that don't have access to a quality program are more likely to commit a violent crime and end up in prison. What we do know is that 60% of our four year olds across the state of California do not participate in a preschool program.'",
        "'speaker_6': 'What we do know is that low income children, which represents a large portion of the community we serve on average, are exposed to 30,000 fewer words a year than their same age counterparts, and when they enter kindergarten, are more likely to be two years below grade level than the peers that they go in at the same time'",
        "'speaker_6': '. What we also know is that children that represent six years and younger represent the poorest and largest population. So we really appreciate your continued conversations. We we want to be a part of those conversations. I believe that it's going to take local level legislators, as well as the state level joining forces with the district in order to'",
        "'speaker_6': 'make this happen. And look at fleshing out what additional funding sources are available to ensure that we have universal preschool for all. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Very good. Hugh Clark is the address. Let me suggest something that might be a little novel. Why don't instead we focus on educating the kids at this point? Why don't we focus in on educating the adults? Training them and educating them on the merit and holding off excuse me, holding off having a family until such time as'",
        "'speaker_5': 'they can financially support that family. Right now, as I've often said, the DNC policy is worry not. If you want to bring money into your household, pop out a kit. Don't worry about it. We'll send you the money.'",
        "'speaker_5': 'For every kid you get, you get more money. Why don't you focus in on educating them to be about educating people to be responsible? Try that. I know it's a novel idea. It's a novel. It. There's no question that the education is necessary.'",
        "'speaker_5': 'But all one has to do is take a trip up on the blue line and you see where the problem is. One in three people in the county of Los Angeles is on some type of public assistance. From the county or from the state, and the majority of the people referenced are in the lower income.'",
        "'speaker_5': 'That's where you need to focus. Is focus on the adults, on how to be responsible. Thank you.'",
        "'speaker_0': 'Any further public comment? Our members cast your votes on item 12.'"
    ],
    "Recommendation to request status from City Manager regarding the next steps in moving forward with the rebuild of Basins 2 and 3 within the next 30 days.": [
        "'speaker_1': 'Motion carries nine votes.'",
        "'speaker_0': 'Thank you. Item 13 Clark three.'",
        "'speaker_1': 'I am 13 is a report from the Office of the Council Member Gary DeLong and Council member Susan Lowenthal with the recommendation to request a status from the city manager regarding the next 12 steps towards moving forward with the rebuild of basins two and three within the next 30 days.'",
        "'speaker_0': 'Mr. DELONG.'",
        "'speaker_11': 'Thank you, Mr. Mayor. City managers, you know, I'm very concerned with the current status of the rebuilding. And looking at some of the comments that have come into tonight's council for me, I just thought I'd share a couple for the audience.'",
        "'speaker_11': 'And I think it reflects my concern is that here's what it says slip renters have paid fees while being told a portion of the money will go to the rebuild. They've done their part. Older voters are having trouble negotiating wobbly and broken docks in Basin two and three employees are exposed to injury.'",
        "'speaker_11': 'Here's another one that says I've been a slip lessee for 27 of the last 36 years. These stocks are unsafe. I'm 72 and just this last summer I fell after tripping on a protruding nail. Many have been injured on my gangway.'",
        "'speaker_11': 'A red cone has been placed in a spot where the dock is particularly damaged. Another one that says the current state of the Alameda Space Marina Basins two and three is a disgrace to the city. It calls itself the aquatic chapter.'",
        "'speaker_11': 'The world actually just of America, not the world. Yet this marina should be the pride of the city. It serves all kind of boaters, from elite yacht racers to the occasional weekend cruisers. And there's numerous they basically all say the very similar things, which is the docks there are falling apart.'",
        "'speaker_11': 'And I guess I'm very concerned that for months now I've been hearing that the staff is looking at it. We've been running some financial analysis, but I know that I haven't seen a plan yet. I know that the current contractor, Bellingham Marinas, is close to finishing where they are.'",
        "'speaker_11': 'And it's my understanding we do not have a plan to keep them engaged. And there will be significant financial penalties through demobilization and remobilization, as well as if we don't dredge under the existing permit, it could cost millions of dollars or perhaps as much as $14 million extra.'",
        "'speaker_11': 'So I don't know if you have any comments now on how you can keep this project moving, but the formal request is to have a plan within the next 30 days. The city manager.'",
        "'speaker_8': 'Thank you, Mayor. Councilmember DeLong, just to point out that this is an extremely important project to the city. As everyone knows, we completed the Shoreline Marina recently and also the Rainbow Harbor Marina recently with the Marina Funds and also the Department of Boating and Waterway Loans.'",
        "'speaker_8': 'Right now, we're in the process of completing the Alamitos Bay Marina after three of the seven basins. We are running into financial issues, there's no question about that. And we're working right now with our finance department and our Marine bureau and Parks and Recreation Department to see about coming up with the solutions for these things.'",
        "'speaker_8': 'This basically comes to us with the termination of the Department of Boating and Waterway Loans. That program no longer exists. So while we're looking at the finances, we definitely want to make it clear to the boat owners and also the city council that we are coming up with a plan to take care of the dredging.'",
        "'speaker_8': 'I think that's critical to take care of the dredging before we lose our permit and deal with that. We're also looking at doing the utility work that's necessary with Southern California Edison and other things that we can do with the funds that we have while we put together a plan to take care of some of the issues'",
        "'speaker_8': 'that you brought up in some of your comments.'",
        "'speaker_11': 'Well, if we can be just a little more specific, so what can we do? I mean, today, immediately, what are we prepared to do to continue the project moving forward? And I understand you can't commit to the entire project being done tonight, but what can you commit to to keep this moving forward that we don't come to'",
        "'speaker_11': 'a standstill in the next few weeks?'",
        "'speaker_8': 'Our hope is not to come to a standstill, but we certainly are plan to come back as the council's requesting with a report in 30 days.'",
        "'speaker_11': 'And do you anticipate that report will have a plan of action that will continue moving forward? Because I don't want to do is come back in 30 days and say, well, you know, I guess we just can't move forward and there's really nothing we can do at this point.'",
        "'speaker_11': 'And we'll just have to let the contractor go.'",
        "'speaker_8': 'We will have a plan of action. I can't guarantee that it's going to look to the outcome that you're looking at, but we will have a plan of action to continue this and get this project done.'",
        "'speaker_11': 'Well, I know that is my understanding that two of the next areas are there's about $900,000 and some city work, as well as some landside utility work. I mean, is there any any reason why we would not continue to move forward with that portion?'",
        "'speaker_8': 'Probably not. Those are things we're looking at right now. But I don't want to make a commitment until we look with our finance department and also with the Parks and Recreation Department. As you know, there was a very serious audit done by the City Auditors Department about two years ago to guarantee that this project goes forward without'",
        "'speaker_8': 'touching the general fund. And those are things that we want to make sure that we maintain. True to the city council on.'",
        "'speaker_11': 'And and how quickly do you think you can come back with a recommendation within.'",
        "'speaker_8': '30 days.'",
        "'speaker_11': 'Any any sooner than that on anything for.'",
        "'speaker_8': 'You. We certainly will try. We definitely are close to coming up with solutions on dredging and things like the utilities that you're talking about. But some of these are really high ticket items to come in and take care of.'",
        "'speaker_8': 'An entire basin. And those are things we need to look at and work with our finance department and how that can get funded.'",
        "'speaker_11': 'Well, since I know you've been working on this for for a number of months, do you think it's likely within a couple of weeks, perhaps, you can address some of those things that you just mentioned and it might take you 30 days to come back with the whole plan.'",
        "'speaker_8': '30 days with the whole plan will address what we can. But I don't want to come back to you in two weeks and disappoint you that we don't have a plan yet. I'm saying 30 days and we'll respond to what you're requesting.'",
        "'speaker_8': 'Okay.'",
        "'speaker_11': 'And I guess what I'm saying is, if if you can identify it as a couple of the smaller things that could be done in the next couple of weeks and make a decision on I mean, I'd certainly be interested in moving forward as we've waited for a full plan.'",
        "'speaker_8': 'We'll work on that. Yes.'",
        "'speaker_11': 'Okay. Thank you.'",
        "'speaker_0': 'Mr. O'DONNELL.'",
        "'speaker_5': 'Thank you. And I.'",
        "'speaker_3': 'As a regular user.'",
        "'speaker_4': 'Of the marina, I can attest that those basins are in serious need of a reconstruction. There's nails everywhere. There's boards popping up, there's cones and places that you have to walk around. So, again, they are in need of repair and I think that's been made pretty clear.'",
        "'speaker_4': 'Can you check on this historically? My understanding is that maybe even 20 years ago, this is back when I was at the Marine Patrol, but about 20 years ago, there's a transfer from the Marina Fund to the Tidelands Fund.'",
        "'speaker_4': 'I think it's from Fund 39 to fund 36. Those are the numbers used back then. I don't know if those are the same numbers used now. I thought there was a transfer over to the title inside the beachfront site because oil had dropped so low and it was a loan and I don't know if it was paid'",
        "'speaker_4': 'back, but it was a loan of some significance. Could you check into this?'",
        "'speaker_8': 'Certainly will. I'm looking at our finance director.'",
        "'speaker_4': 'Multiple many million dollars.'",
        "'speaker_8': 'Certainly. We'll get back on that. Absolutely.'",
        "'speaker_4': 'And I know where I'm going with this is there's a potential for that that beachfront fund to pay back the marina if that situation does, in fact, exist.'",
        "'speaker_0': 'But with interest.'",
        "'speaker_4': 'With interest, according to the mayor. Yes, sir.'",
        "'speaker_0': 'Mr. Johnson.'",
        "'speaker_3': 'Well, thank you, Mayor. And I think everyone on this council and I'm sure everyone in the audience, you.'",
        "'speaker_11': 'Know, wants to get the work done.'",
        "'speaker_3': 'But we all know how serious it is to have hazards and so forth. But can you educate me real quickly? You said there were some cost problems. Has this project been going over budget? Is that the issue and maybe some unexpected challenges?'",
        "'speaker_3': 'Or what are the challenges that we that we're facing so far?'",
        "'speaker_8': 'We'll put that in the report. There certainly are some cost overages that we're taking a look at before we respond.'",
        "'speaker_3': 'Okay. Well, I think it's important for the public to know that we all want to get this done. It's critical we get it done. But it's sound like there's some.'",
        "'speaker_11': 'Facts are getting you know, getting in the way.'",
        "'speaker_3': 'And, you know, the facts are important in the conversation.'",
        "'speaker_8': 'I want to make it clear there's no facts getting in the way. There is lack of funding getting in the way. So that's what we're looking at.'",
        "'speaker_3': 'Right. But I mean, I think the fact is we've gone over budget, whatever it is. I mean, I don't know what the answer is, but I mean, I think those are facts as is a measure. Thank you.'",
        "'speaker_0': 'The fact that we have a lack of funds. Mr. Long, have you made a motion?'",
        "'speaker_11': 'Yes, I move the recommendation.'",
        "'speaker_0': 'Second, Burton seconded. Any member of the Public Trust Council on this item, please come forward. I know a lot of you are here for this. I would ask you to do the best you can to summarize your comments.'",
        "'speaker_0': 'Good.'",
        "'speaker_5': 'Very good. You succeed? Yes. Longtime supporter of voting dynamics. But to die for this debacle was cast seven years ago when this was started. It was a nonstarter. It was unbundled from day one. It was a smoke and mirrors.'",
        "'speaker_5': 'You're on the hook. You made a very. Dumb decision when you went with the most expensive contractor and the only one on the West Coast. It's like buying a car. From a dealership. Who's going to be the only one that services it, that 16, 2000 miles away.'",
        "'speaker_5': 'Who do you think is going to pay for that? This is unwinnable. One of the things that you've got to work out and get done fast. Mr. Mayor. Is those Cal 37 boats of your buddies in the Long Beach Yacht Club have to haul ass out of there and they should be factored into bass in three.'",
        "'speaker_5': 'And the clock is ticking. If you were watching the Olympic Games that you at the IOC, the USOC, will announce when they're going to pull that trigger in terms of bidding. If that's the case, they will be here sometime within the next six or seven months.'",
        "'speaker_5': 'I can guarantee you with almost absolute certainty. Unless those slips are vacated, taken out of their. It can save time, but not to burn out unless that happens. The chances of Long Beach and Los Angeles getting the Olympic bid.'",
        "'speaker_5': 'Our next anil anastasiou discuss four because Macy's doesn't eligibles. I don't want to repeat what I outlined before, but absolutely central to the US getting that bid when I say our Southern California. They have unfettered areas for training.'",
        "'speaker_5': 'It's not ten years from now or 2024 when we're going to have the games. It's the run up to that to create the buzz to get the people here. Period. And that window is closing very fast. And if not, the legacy of the people sitting up there in the blue jackets who own those boats.'",
        "'speaker_5': 'We'll go down in history as ones along with Bob Foster, who crossed Southern California, the next Olympic bid. Thank you.'",
        "'speaker_0': 'Thank you. All by myself? Yes.'",
        "'speaker_3': 'Next large party. I knew you were a powerful guy.'",
        "'speaker_0': 'Next to me for everything. It's fine. Don't worry about it.'",
        "'speaker_8': 'Mr. Mayor and council members.'",
        "'speaker_5': 'Thank you for hearing us. I represent the Boat.'",
        "'speaker_3': 'Owners Association.'",
        "'speaker_8': 'The Long Beach Marina. Boat Owners.'",
        "'speaker_5': 'Association. I'm the president.'",
        "'speaker_3': 'This is our.'",
        "'speaker_5': 'Message. Rebuild the docks. Now we have a.'",
        "'speaker_8': 'Second message.'",
        "'speaker_5': 'To follow up after I mention a few reasons for that. The rebuild of these.'",
        "'speaker_8': 'Marinas has been delayed over.'",
        "'speaker_5': 'And over and over again. There's always seems to be some problem cropping up that prevents the acquisition.'",
        "'speaker_8': 'Of financing for.'",
        "'speaker_5': 'Getting the work done. Right now, we understand that if this project is delayed.'",
        "'speaker_8': 'Much longer, it'll incur an additional $17 million.'",
        "'speaker_3': 'Cost.'",
        "'speaker_4': 'For the city.'",
        "'speaker_5': 'And in our opinion, that seems to be pretty poor management of.'",
        "'speaker_3': 'Sydney City resources. The second thing, as.'",
        "'speaker_5': 'Has been pointed out, the old docks are unsafe and the city is going to see some lawsuits.'",
        "'speaker_8': 'Arise from that, if not.'",
        "'speaker_5': 'Already. The third point is our slip fees have already.'",
        "'speaker_8': 'Been increased with the understanding that that increase was needed to facilitate the acquisition of financing.'",
        "'speaker_5': 'For the completion of the marina. We've done our part.'",
        "'speaker_3': 'Now it's time for you guys to do your part.'",
        "'speaker_5': 'Keep in mind, voters are voters. Thank you.'",
        "'speaker_0': 'Thank you. Good evening again, Mr. Mayor. I rise as Commodore of the Association of State, so I need every name again. I'm erratic. I rise as Commodore of the Association of San Pedro Bay Clubs. My organization represents the racing interests of the clubs from San Pedro down through Huntington Harbor.'",
        "'speaker_0': 'In our marina, there are five yard clubs that are part of our association Long Beach Alamitos Bay SEAL Beach Yacht Club. Even though we're SEAL Beach Yacht Club, we are in Long Beach Navy Yacht Club of Long Beach and Little Ships Fleet Yacht Club.'",
        "'speaker_0': 'Together, we hold over 100 races per year. Some world class events, such as the A Congressional Cup, some are weekend beer or weekly beer can races on Thursday, Wednesday night and Thursday nights. And I want to impress upon you how important it is that this rebuild take go forward.'",
        "'speaker_0': 'Again, we build ourselves the aquatic capital of America. If we can't continue to attract world class racers, we can't continue continue to attract additional boaters. If our basins two and three are basically second class citizens to the docks that have already been completed.'",
        "'speaker_0': 'Thank you. Have a great evening. Thank you, Mr. President. Next, please.'",
        "'speaker_5': 'Good evening, Mr. Mayor. Council people. My name is Carl Cunningham, past president of the Long Beach Marina Boat Owners Association. I'd like to point out that we are really not complaining about the management of the Marine bureau. We're not complaining about the maintenance of the you know, the maintenance people.'",
        "'speaker_5': 'They do a yeoman's job. They're working all the time, literally. And just to give you a little flavor of what it's like on the gangways. By the way, gangways are the wide ones. Fingers are the little narrow ones.'",
        "'speaker_5': 'The boats are in between. I was walking down the gangway one time and I was one of them that got a nail, the nails sticking up about that big. I was at night and I didn't see it. Bam, just absolutely flat.'",
        "'speaker_5': 'And the problem with that is it wasn't just so much falling. Of course I didn't. So it wasn't so much falling. But when you hit those gangways, they're full of splinters and sort of splinters. That's what really got me more than anything else, which was a real problem.'",
        "'speaker_5': 'But tonight, as I was coming over here, I'm a little bored. I noticed on the I'm on Gangway 29 over on Gangway 28 there was a finger where the at the end of the finger there were no boats attached to it was completely in the water.'",
        "'speaker_5': 'It had the float had gone. And I just had a horrible sort of a child on a tricycle, you know.'",
        "'speaker_3': 'Got away from mommy.'",
        "'speaker_5': 'Going down that finger and into the 60 degree water. And I don't even want to go there. You can imagine what that lawsuit would have cost the city of Long Beach. I mean, there's you know, there's no gates to stop anybody from going on to the gangway.'",
        "'speaker_5': 'So I urge you to really consider the fact that as it was already brought out, we're looking at 17,000, 17 million penalty, if I'm not mistaken, if we delay this project we've already.'",
        "'speaker_3': 'Paid, we've.'",
        "'speaker_5': 'Had our slip fees increased again with the promise that this was going to take care of the marina.'",
        "'speaker_3': 'Rebuild. And we've only got to double, you know, number three.'",
        "'speaker_5': 'And number two. And so we would certainly like to see that move forward. Thank you very much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Mr. Mayor. Council people. My name is Robert Vet. I'm a Long Beach resident and a member of the Long Beach Marina Boat Owners Association. I rent a slip here and I'm giving you a message from one of our members who is in Peru.'",
        "'speaker_5': 'He's saying the remaining wood would gangways and a beam continue to deteriorate at a pace that the maintenance department cannot possibly keep up with. Case in point two hardworking men from the maintenance department worked on the gangway of my slip for four days, attempting to raise the dock.'",
        "'speaker_5': 'That had sunk to the point that the bottom of the wood supports were below the waterline as they would reinforce and install the new wood boards. In one area, the wood immediately next to it would collapse, its dry rotted as it could not support the new strain that the new boards were adding to it.'",
        "'speaker_5': 'What started as a small repair kept extending to a larger area, and they also had an additional flow to assist what was somewhat in floating the dock. After the work was done, the gangway is better than it was, but it's still by no means a permanent repair that will last a long time.'",
        "'speaker_5': 'The same area has been repaired before. Also, this repair causes strain on the finger directly across the way, to a point that the old finger could not be repaired and a new one had to be installed. Three weeks later, the float on the finger on the other side of the new one sunk and the maintenance crew pumped'",
        "'speaker_5': 'it to refloat it. Time will tell how long this will last. This scenario goes on daily at Basins two and three, as you can clearly see. The base support structure has totally deteriorated that it can no longer support the attempts to refloat the docks.'",
        "'speaker_5': 'I have great respect for this maintenance crew working on the docks for their perseverance and creativity in attempting to keep these old docks afloat. Alfredo Fernandez. Thank you very much.'",
        "'speaker_0': 'Thank you. Next, we.'",
        "'speaker_5': 'Mr. Mayor and Honorable Councilman. Councilwoman. My name is Roger Gripe. Unfortunately, I don't live in the city of Long Beach, but my second home and my boat is here in District three in Alamitos Bay. I've been a boat owner and had a boat in the marina for 17 years, and I've seen the docks just completely deteriorate in'",
        "'speaker_5': 'Alamitos Bay while downtown was rebuilt. And and we do have, I believe, based on one base and four have been completed. I, I don't have a vote in this city, but I am on the advisory board for the Long Beach Rental Boat Owners Association, as well as a Vice Commodore, one of the local yacht clubs here.'",
        "'speaker_5': 'And I don't have a vote here. I'd surely be there at the polls. But if the need comes, I would hope that I could probably enforce more, more votes that I could provide if I did live here. But nevertheless, you've heard the reason for the rebuild, and I'm not going to repeat those.'",
        "'speaker_5': 'It takes too much time and we don't need to do that. But I would urge you to give serious consideration about rebuilding these docks they needed. My wife stepped on a nail about three weeks ago, and thank God it didn't go all the way through the shoe, but it went almost three quarters of the way through, and'",
        "'speaker_5': 'I'm glad it didn't puncture her foot. We've also had deaths due to individuals falling off the docks and drowning and not being able to come back up out of the water. These are issues that could definitely cause the city some liability, and the city would be very wise to take that tidelands money and use it as backing'",
        "'speaker_5': 'to acquire loans to to get the money that's needed to rebuild this marina as soon as possible. Thank you very.'",
        "'speaker_0': 'Much. Thank you very much for.'",
        "'speaker_6': 'Good evening. My name is Dr. Phyllis Roe. My husband and I have a boat in the Alamitos Bay Marina Basin to dock 15. First of all, I would like to thank Mr. DeLong for his strong support of the Marina Rebuild.'",
        "'speaker_6': 'And we'll be looking to you for leadership on the council. My husband and I have had a boat in the Long Beach Marina system for over 20 years, and as the others have said, we have seen the continuous increase in our slip fees and decrease in the in the services that are provided and the and the the'",
        "'speaker_6': 'docks. On January 23rd, I sent an email to each of you inviting you to take a walk on our gangway so that you could see firsthand the condition, the unsafe condition of our gangway. And I'm just wondering if anybody did that.'",
        "'speaker_6': 'If not, I invite you again to do so, so that you can see what we're up against here on this dock. However, when you do so, please go in the daylight so that you don't trip over nails and and protruding boards and wear some sturdy shoes.'",
        "'speaker_6': 'In the email, I referred to a nail that I had removed because I almost tripped on it this summer. It was in the middle of the gangway. I went to our boat to get a hammer and I tried to hammer it back in.'",
        "'speaker_6': 'It would not go back in, so I took it out. This is what it was protruding at least half way. This is what the people have been talking about. I've been thinking about what we could do to influence Long Beach, to be responsible in this regard.'",
        "'speaker_6': 'Some of the ideas that I came up with as a dock walker, I can inform everybody about our efforts. The problems that you've identified. I can suggest that we all come together and withhold our slip fees until something is done and the quality of our docks are improved.'",
        "'speaker_6': 'I could I can recommend and we are looking into this that we move our boats so to a more safe marina. And I certainly am going to look into other strategies and see what other people have to say.'",
        "'speaker_6': 'We don't want to start a Boston Tea Party in Long Beach. We would like you to recognize your responsibility to your constituents and use your power to eliminate this nautical slum. One other point. I've heard that funding is the problem.'",
        "'speaker_6': 'We all know that the marina is a cash cow. I would like at each of the meeting's monthly meetings of the Marine Bureau that a report be given by the interim or acting director of the amount of funds that are brought in monthly.'",
        "'speaker_6': 'The disposition of those funds and the progress on the marina rebuild. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_11': 'Mr. Mayor, can I ask you a question? You may. Excuse me. What is the monthly meeting that you're referring to?'",
        "'speaker_6': 'The Marine advisory or the commission?'",
        "'speaker_11': 'Okay. I guess I'm going to ask course for staff. Is there any reason why you couldn't provide that information to the Mac and the public?'",
        "'speaker_3': 'I think they provide it regularly.'",
        "'speaker_6': 'I excuse me, I was at a recent meeting and someone asked for that information and it was not forthcoming.'",
        "'speaker_0': 'All right. Whatever.'",
        "'speaker_11': 'Follow with my office and we'll figure it out. Okay. Thank you.'",
        "'speaker_0': 'Next, please.'",
        "'speaker_5': 'Good evening, Mayor Foster Councilmembers.'",
        "'speaker_3': 'My name is Jerry Garcia, and I am here to.'",
        "'speaker_4': 'Ask you to please make.'",
        "'speaker_3': 'Sure that the remaining basins are completed. My friends and I work very hard to maintain a boat in one of the basins that has been completed. But we think it's fair and only fair that the remaining basins are also completed.'",
        "'speaker_3': 'Boat owners, big and small, all deserve safe docks. If these were city sidewalks, those would be repaired. And the fact is that those docks are the city sidewalks.'",
        "'speaker_6': 'For.'",
        "'speaker_3': 'The visitors and guests that come to our boats. So in their current condition, we've already heard that they are a dangerous liability for our city. And as you've heard, the cost for our city, it's something that we just can't afford.'",
        "'speaker_3': 'If we put this off. When the slip fees were raised, we were promised that these fees would go towards the improvement of the basins. And so with that said, when I please ask you to make sure that this goes through.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Hi. Good evening, everyone. My name is Mike Nichols on it. And I lived in the once thick corona. And I work at a nonprofit. And my friend and I saved the money for 15 years to get a little boat.'",
        "'speaker_6': 'It was a dream. And although we are lucky that our boat in one of our basins that have been repaired, we hope that we hope and pray that the other basins will be finished and expect it. Also, the docks are very, very dangerous and they will be so unfair to cut the other basins out.'",
        "'speaker_6': 'Please finish the repairing. Our marina, please. Thank you so much.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Good evening, Mayor Foster. Ladies and gentlemen of the council, my name is Rectory. I'm the chairman of the Marine Advisory Commission for the City of Long Beach. You've heard all the impassioned pleas and the details about the deterioration of the Alamitos Bay Marina.'",
        "'speaker_5': 'That's well documented, and we don't need to go into more detail here. But what I would like to do is go on record before this body is saying that your Marine Advisory Commission has been a proponent of the rebuild since day one.'",
        "'speaker_5': 'We've been involved in every stage of the project, every phase of it, looking at the finances, looking at the physical work that's being done down there. And we continue to be a proponent of the rebuild. We we absolutely would hate to see any form of delay or certainly no stoppage in the process as it goes forward.'",
        "'speaker_5': 'So we just want to go on record as saying that we are in favor of the rebuild and we'd like to continue to see it go forward. Thank you, Mr. Mayor.'",
        "'speaker_11': 'Can I ask Mr. Drake a couple of questions? Thank you. So tell me, on the Marine Advisory Commission, have you always been under the impression that this, up until recently at this project was moving forward? Well, yes. I mean, it was approved three or four years ago.'",
        "'speaker_5': 'I mean, the project has been moving forward in a steady pace, beginning with Basin four and then moving to Basin one. There were funding available for the first phases of the project. We knew from the get go that there would come a point where additional funding would have to be acquired for the next or subsequent phases to'",
        "'speaker_5': 'be instituted. That was never a secret. It was always out there on the horizon. I think now the funding mechanisms are going to have to be discussed, and that goes back to the city managers statement about coming back with a program to move it forward.'",
        "'speaker_11': 'And what was the Mack's understanding of what those funding mechanisms are going to be, and was that ever discussed at those meetings?'",
        "'speaker_5': 'It was discussed in generalities, but never any specifics. I believe that there has been some consulting work done on how the different issues might come to pass. Nothing has been released yet, as far as we know, as far as the different alternatives or alternatives available to the council or the city, as far as how to fund the'",
        "'speaker_5': 'project. So.'",
        "'speaker_11': 'Okay. Thank you. Sure.'",
        "'speaker_0': 'Thanks, Mr. King, please.'",
        "'speaker_10': 'Mayor Foster City Council members in the city. I am Francis, Emily Tyson Harris and I reside in District one and I kept hearing the language of me say when I served on Cape Cod, there was a concern regarding this sensibility of Alameda to spay dock.'",
        "'speaker_10': 'And I'm just want to find out if the docks are remaining. Do you now can you you may not be able to ask me directly, but there was a concern about it not being accessible, making the the sensible so that persons with disabilities have the opportunity of riding on these chances.'",
        "'speaker_10': 'Water, taxi. And so I was looking in the book and I can't determine whether or not has it been completed and not completed. Are these two docks one of them, one of the docks that needs to be made accessible?'",
        "'speaker_10': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Mr. West, would you please give Ms.. Harris that answer?'",
        "'speaker_8': 'Yes. All of the new docks are accessible. Will be accessible. I have we'll have to get back to you on what the existing ones are.'",
        "'speaker_10': 'Would you also like Cape Cod now as well?'",
        "'speaker_8': 'Certainly.'",
        "'speaker_10': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Miss Harris. Any other public comment? We've got some customers have a question. But before we do, Mr. Watson, I would know. I would like to I'd like to have a thorough sort of chronology or history of, you know, exactly what happened.'",
        "'speaker_0': 'Do we embark on this knowing that we were going to have to have other funding sources? And what was the likelihood of that and what was the wisdom of that? I'm really if people have been charged in anticipation of having capital improvements and now we are unable to do so, I want to know exactly what happened.'",
        "'speaker_0': 'Thank you. Mississippi governor. Mississippi.'",
        "'speaker_10': 'The mayor. Well, and Pat, is this possible that tidelands funds can be used perhaps as the guarantee if we bonded against on the slip, these.'",
        "'speaker_8': 'Tidelands funds can certainly be there. The city finance director would recommend not bonding against Highland Funds, but title and funds can be.'",
        "'speaker_10': 'On those funds. I know that.'",
        "'speaker_8': 'But you can bond against slip fees. But the I think we could raise less than $10 million bonding on the existing slippage moratorium.'",
        "'speaker_10': 'So we could proceed on this if we utilized the timelines funds.'",
        "'speaker_8': 'Tidelands is an eligible eligible expenditure. Yes.'",
        "'speaker_10': 'Okay. Well, I would hope that we look at that. The other thing is, I would hope that we would get some kind of accounting of the slip fees. I've heard this from numerous boat owners who live in the fifth and have slips down there that they've never really seen a public accounting of all the fees that have'",
        "'speaker_10': 'been collected. So I'm hopeful that we could get that.'",
        "'speaker_8': 'I think that certainly has been provided will provide that again. I do want to highlight that regarding the Tidelands funds, again, any expenditure over $100,000 needs permission from the State Lands Commission.'",
        "'speaker_10': 'Well, I understand, but my understanding is that cities that have timelines have used it for marinas as long as they're publicly accessible. And then the question for city attorney, both in Mr. de Long's council agenda item and in numerous emails that I've received, is the issue of potential liability.'",
        "'speaker_10': 'Is it possible through your office that we get a risk assessment that because I think obviously, if I'm hearing this repeatedly, that people feel that they can be injured, something desperate in a battle is going to happen. I think it would be helpful if we have some kind of risk assessment that might help us move, you know'",
        "'speaker_10': ', in a faster direction and pinpoint exactly what needs to be fixed immediately.'",
        "'speaker_8': 'We can get you an assessment. Yes.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Mr. DeLong.'",
        "'speaker_11': 'Thank you. How much? And surplus the right word. But how much extra cash flow to the marinas generate today? I guess I've heard numbers to $3 million a year.'",
        "'speaker_8': 'I could provide that information in the report that you're asking for, but I don't have it at the top of my head. No.'",
        "'speaker_11': 'Mr. Chapman here.'",
        "'speaker_8': 'Georgia John.'",
        "'speaker_3': 'Mayor, council member, council members long it generates about $3.2 million annually.'",
        "'speaker_11': 'So 3.2 million extra after you cover your cost of running them. Well, that's about it. Yeah. Okay. And then since it's been doing that for some time, is there a reserve or is there a fund? Balancers. Every penny been used for the existing basins or what do we have set a set aside of that $3.2 million annual'",
        "'speaker_11': 'surplus towards the future construction?'",
        "'speaker_3': 'I believe most of it is being used to pay back DBA loans. And recently we used some of the reserves.'",
        "'speaker_4': 'To actually do base and five.'",
        "'speaker_3': 'With cash reserves.'",
        "'speaker_11': 'Okay. So what is our cash reserve now in the Marina Fund? You know, approximately, I think about.'",
        "'speaker_4': '2 million right now. Okay.'",
        "'speaker_11': 'And what's the loan balance of the DBA loans that we have?'",
        "'speaker_3': 'I think it's about 46 million at this point. I have to double check.'",
        "'speaker_9': 'Because the city has devolved loans for both.'",
        "'speaker_3': 'Shoreline and Base four and Basin one.'",
        "'speaker_11': 'Great. Thank you. Okay. Well, I appreciate the information. I look forward to getting the report back. I tell you, I think that, you know, certainly, you know, I apologize to the boat owners in the situation we're in. It's it's certainly been a surprise to me.'",
        "'speaker_11': 'I always thought that we were, you know, on schedule. We were moving forward. It was going to happen. It's like I said, it's been a surprise to find out that we haven't got the funding completely locked down. I know that.'",
        "'speaker_11': 'And a recent tour I took of the docks, it's just shocking to me that the dilapidated condition they're in and hopefully in the next 30 days, we'll get a solution to this very thorny problem. Thank you.'",
        "'speaker_0': 'Thank you. Yeah, we have we have a we have a motion in the second members. Cast your votes on item 13.'",
        "'speaker_1': 'Motion carries nine votes.'"
    ],
    "Recommendation to receive and file a presentation by members of the University of Southern California Lusk Center for the winning entry in the 2013 National Association for Industrial and Office Parks (NAIOP) Southern California Real Estate Challenge for the Seaport Marina Hotel site at 2nd Street and Pacific Coast Highway.  (District 3)": [
        "'speaker_0': 'Yeah. Thank thank you all for coming out, by the way. I appreciate it. Thank you. Just as a courtesy, we'll move to item 17 before 14 because some young people waiting here. So item 17, GREGORY.'",
        "'speaker_1': 'Item 17 is a report from Development Services with the recommendation of receiving filed a presentation by members of the Unit University of Southern California Law Center for their winning entry in the 2013 National Association for Industrial and Office Parks.'",
        "'speaker_0': 'As for the council membership scheme.'",
        "'speaker_10': 'Yes, I would like to introduce or have these gentlemen introduce themselves and I believe one of you is actually a resident of Long Beach. Which one? Yes. Yes. And let the audience know that these were the winners of the University of Southern California Law Center.'",
        "'speaker_10': 'It's the 2013 National Association for Industrial and Office Parks and AOP, Southern California Real Estate Challenge. And they were given the challenge of looking at the property as second and PCH, and they came back with an exciting design that they are now going to be given the opportunity to present to the council.'",
        "'speaker_10': 'If you could, introduce yourselves, gentlemen. Thank you.'",
        "'speaker_11': 'My name is Steven Anderson, and I'm with the U.S. team.'",
        "'speaker_3': 'My name is Christian Santos. My name is Daniel Bertel. Nick Terje NGO. Good evening, Matt Kiper.'",
        "'speaker_11': 'And I think one of your staff is getting us to the keyboard for the clicker. But I just while she's getting it, I'll give a quick overview. So every year there's a competition between USC and UCLA on a real estate site somewhere in Southern California.'",
        "'speaker_11': 'That's a challenge and has had a challenging history. And this year the site is second and PCH was chosen as the site. And it's had many attempts to be developed. And with our challenge to kind of create a project that would work for all the stakeholders, including the city, as a partner of ours.'",
        "'speaker_11': 'And one of the unique attributes of our program is, rather than just real estate development, we're in the School of Policy Planning and development. So we have a lot of focus on urban planning and policy and the impacts of development and how it relates to the context more than just does it actually make money?'",
        "'speaker_11': 'So I introduced our team. My name is Steven Anderson. I'll just give you a quick overview and Kristian will take us through entitlements. Daniel the design, Nick the market analysis and finally, Matt, the numbers about the project. So as I mentioned, the sites at Second and PCH, kind of at the confluence of Belmont Shore, Naples SEAL Beach'",
        "'speaker_11': 'in the border of L.A. and Orange County, 11 acres. And we consider this the most exciting coastal real estate opportunity in Southern California. You just don't find many sites of this size near the water surrounded by so many good amenities.'",
        "'speaker_11': 'So one of our challenges was why hasn't anything been developed here? And we were tasked with being the developer, putting on our developer hat and how to minimize risk and get something done here. So this is kind of an overview of the plan we came up.'",
        "'speaker_11': 'We'll go through detail further in the presentation, but we really wanted to connect the site to the water and connect the wetlands to the water. And rather than these islands of shopping centers, try to connect everything as a regional district.'",
        "'speaker_11': 'So in the upper left, you'll see a retail project, a boutique hotel on the right, an apartment community, and then a groundlings community amenity on the water that would be a permanent home to the farmers market. Here are some views of some of the renderings.'",
        "'speaker_11': 'We were just really trying to bring the water into the project as much as possible and make it coastal. So and then just a.'",
        "'speaker_3': 'Kind of a summary that we're.'",
        "'speaker_11': 'Proposing, this project had 164,000 feet of retail, 80 hotel rooms and 300 apartment units. And then we would do a proposed in two phases, which will outline further and the presentation as the step revision is going through right now.'",
        "'speaker_11': 'And then we really knew to get a project done here, especially with its history, we needed to create community and political will. So our goals were to stitch the area together, make a new gateway, create a new gateway for the city to the water.'",
        "'speaker_11': 'And really, this could serve as a catalyst for redeveloping the entire district into a more walkable, connected place. And then we approached this with three objectives. We wanted to identify the highest and best use for the community, the investors and the city, create a new waterfront experience and then maximize those benefits for everyone involved.'",
        "'speaker_11': 'And now Christian will present the entitlements.'",
        "'speaker_3': 'Thank you, Stephen, and thank you again to the city council for having us. So I'm going to go a little more into the site now. The site is located at Second and PCH. And as Steven said, we believe it is a rare and significant site and that it deserves a special project.'",
        "'speaker_3': '80,000 cars per day pass the site along PCH and Second Street. It is 500 feet from the water and has a quarter mile of PCH frontage. Naples is just sort of up to the top there. And then further along as Belmont Shore down PCH, we see SEAL Beach, all great communities.'",
        "'speaker_3': 'Three significant retail sites flank the area we're looking at, including high performing Whole Foods, Trader Joe's and Gelson's. And what you see immediately here is an opportunity to connect all three of these centers. And like Steven said, try and create a walkable destination, a place, something that Long Beach can be proud of.'",
        "'speaker_3': 'This is a view a little closer of the site. Currently, the Seaport Marina Hotel is located on the site, and one of the things you'll notice from just sort of a design architectural standpoint is that it kind of blocks off the water.'",
        "'speaker_3': 'So one of the things we were looking at was how to bring PCH towards the marina. This is a view of our project here. And you could see we tried to make a very direct link. We're going to go into little more detail about this later, but this is where we're going.'",
        "'speaker_3': 'So one of the main questions is why is nothing built here? This is a significant site and it's just something that you think everybody who passes by wonders why nothing has really been developed here. So in 1980, Long Beach adopted its zoning code for the area, the local coastal plan.'",
        "'speaker_3': 'And what it led to were projects such as this across the street on PCH and here across Second Street and here adjacent to our site. Now, I guess what I'm trying to get at here is the zoning code suggests a certain type of development and a kind of car oriented single story retail center.'",
        "'speaker_3': 'Now, all of these are very successful and great projects themselves, but one of the things that was indicated to us from the city, from people in the neighborhood, from past people who look at the site, is that everybody thinks our project, our site is capable of a little bit more of kind of this pedestrian friendly civic space'",
        "'speaker_3': ', something that that people will come to. And that is very representative at the gateway of Long Beach. Of Long Beach. So taking all this into account. One thing I should also mention, too, is that the city is currently in a revision process of the zoning code for this area.'",
        "'speaker_3': 'I think that over the years people have noticed that or everyone's kind of noticed that what we want to do here is something a little more so that the zoning codes in a three year revision process right now, which kind of adds a complication to the design, to the development in general, our strategy for this, and we'",
        "'speaker_3': 'believe it's fairly innovative is to phase the project. Phase one is a retail area. It's on the left side there. It is consistent with the current zoning code. So we believe something like this could get started immediately. We could at least start the talks of it, start getting the process through phase two of our project as a'",
        "'speaker_3': 'projected development. And by that I mean we're going to wait. We're going to we're going to wait till see that the local zoning code is amended. We're going to adjust our project to that. In our project, just kind of as an experiment, as a speculation, we put a hotel and multifamily on this site anticipating that maybe multifamily'",
        "'speaker_3': 'would be allowed at this point. Thank you. And Daniel Patel, we'll go a little more to the design. Thank you, Christian, and thank you council members. I want to reiterate what Christian and Stephen said. This is a very once in a lifetime site and it deserves a worthy vision to be a true destination and landmark for Long'",
        "'speaker_3': 'Beach. When we set out to design and program the site, we had the benefits of learning from the failures of the past. Our goal was to create a place, a destination experience that would connect to the water and be the next step towards creating a marina district.'",
        "'speaker_3': 'Picture a community where neighbors walk to the bakery, where friends hang out at the local cafe where families can bike to the farmers market. Pair these cores with an architecture that is rooted in the creation of great public spaces.'",
        "'speaker_3': 'We study the architecture of Long Beach, including the existing Googie architecture of the Seaport Marina Hotel, as well as the mid-century modern Portofino nearby. Additionally, we study the scale and massing of other great public spaces in other cities, and we also research strong urban design moves that could inform us on how we could connect the corner of'",
        "'speaker_3': 'Second and PCH to the water. Learning from the failures of the past. We push forward with a multi-use site of decreased density and height of previous proposals that included a destination retail center on the north side of the site at the corner of PCH and second.'",
        "'speaker_3': 'Phase two would include a boutique hotel and multifamily component anchored to the water with views of the Pacific on the marina. We created a community civic space filled with restaurants, eclectic vendors and a permanent farmer's market. Being mindful of the many issues raised by the community, establishing connectivity and being thoughtful about traffic was extremely important in our'",
        "'speaker_3': 'vision. In addition to safely connecting bike paths with dedicated off street bike lanes and restoring pedestrian access around the site with much needed sidewalk improvements. We create a strong statement of connecting PCH and the wetlands, both physically and visually, to the marina with a pedestrian retail street focused solely around creating intimate and unique public spaces.'",
        "'speaker_3': 'Our retail street creates a vibrant shopping and culinary driven experience filled with excitement. Picture Tartlets for parents and children. A new local cycling shop for the community program Open Space Safe for Family Movie Night at the end of a retail street as box park, a community civic space and a permanent home for the neighborhood farmer's market.'",
        "'speaker_3': 'It pays homage to Long Beach's strong shipping import history, as it's creatively composed of recycled shipping containers and complements the local restaurants and regional microbreweries that will surround it. Lastly, Belmont Yards will be a sustainable leader in the community, designed and constructed to the lead for neighborhood development standards.'",
        "'speaker_3': 'Belmont Yards is the next step towards creating a new place for Long Beach. A new marina district and ultimately Southern California's next great coastal community. Now to talk about the local market, I'm going to hand it off to Nick.'",
        "'speaker_3': 'Thank you, Daniel, and good evening and thank you for your time. Council Members. Belmont Yard sits within a population base that is underserved by and has a strong demand for retail and multifamily uses. In general, because of a limited supply of retail space and strong sale levels.'",
        "'speaker_3': 'There is a men's competition among among new retailers to be here pushing rents to levels that are approximately double the greater market average and vacancy to approximately zero. It's worth noting that retail space in this immediate area is approximately 60% per capita of the greater Los Angeles region.'",
        "'speaker_3': 'Because of a large regional void and shopping center and regional shopping centers. Many of the local residents are leaving that area to shop. They're looking for soft goods, apparel and other goods and other items. Many of these local residents shop are shopping and traveling to South Coast Plaza, 30 to 45 minutes south of here.'",
        "'speaker_3': 'There's also clearly a strong and growing demand for restaurant space with a fixed and tapped out supply. Restaurant rents have grown by approximately 15% this year alone in the Second Street area. There's a waiting list for space and tenants are buying out existing tenants to be in this area.'",
        "'speaker_3': 'As a result of assessing retailer voids and demand and speaking with tenants and brokers directly, we've confirmed that many great retailers want to be here. These include. Urban Outfitters, Anthropologie, Apple. Crate and Barrel. Porto's Bakery and Stone Brewery's Beer Garden, Equinox Fitness and many of the Long Beach's local best restaurants.'",
        "'speaker_3': 'After doing our initial study, we recently walked into Michael's Pizzeria and talked to him about the site and he quoted, I've wanted to be at that site for 30 years. Additionally, because of a lack of available land, housing supply has before been far outpaced by population growth in the immediate area within the last ten years.'",
        "'speaker_3': 'East East Long Beach has accommodated approximately 700 new households, while there has been only 55 new rental units added to the market. As a result, the market consists of predominantly dated rental units and apartment buildings. 95% of the existing stock built over 30 years ago.'",
        "'speaker_3': 'People continue to move into this area based on the desirable location and irreplaceable nature of the area being located directly in between Los Angeles and Orange County's. And now for an overview. Matt Kuyper. Thank you, Nick. Good evening.'",
        "'speaker_3': 'Thank you for your time. Taking into account the entitlement landscape. Site forces are design intention as well as the pent up demand for retail, hotel and multifamily users. We've designed a project that is both feasible for the developer and beneficial for the city of Long Beach.'",
        "'speaker_3': 'Our proposal anticipates a total project cost of approximately $200 million, which will include 164,000 square feet of retail, 80 acres of hotel rooms and 300 unit apartment development broken up into phase one and phase two. Importantly, we view the city as a partner in this project.'",
        "'speaker_3': 'The key financial takeaway is the significant positive fiscal impact our project will create for the city of Long Beach. The current project, the Seaport Marina Hotel, is estimated to produce annual revenues for the city of Long Beach of approximately $154,000.'",
        "'speaker_3': 'Our proposal anticipates a 16 fold increase in that figure. Two and a half million dollars per year to the city of Long Beach, made up primarily of sales tax and hotel tot revenue. To recap, our objectives for this project were threefold.'",
        "'speaker_3': 'Identify the highest and best use. Shape a waterfront experience and maximize benefits to all the stakeholders involved. We've accomplished this by filling the market void for retail, hotel and multifamily. We've created an outdoor pedestrian and marina focused design.'",
        "'speaker_3': 'And finally, we've created a feasible project that is both financially beneficial for the developer and for the city of Long Beach. While slightly outside the scope of our project, we spoke to many of the adjacent landowners and we envisioned a larger marina district where Belmont Yards could be the catalyst for a greater district of connected properties, which'",
        "'speaker_3': 'will promote walkability and a pedestrian oriented environment. Beyer, Vice Mayor, City Council, we thank you again for your time, and we're happy to address any questions at this time. Thank you.'",
        "'speaker_0': 'Thank you, gentlemen. Very creative. This should go on.'",
        "'speaker_11': 'Thank you. First of all, congratulations. You guys did a great job putting that together. Very interesting. There have a couple of questions. What's the height in phase two of those of those structures? The heightened phase two would be six storeys, so roughly 60 feet.'",
        "'speaker_11': 'It's a residential building. The entire project would be below that. One of our objectives, if we really wanted to create a project that was less dense and from the water, you had many more views through PCH. Great. And do you have any do you recall about what was the percentage open space in the project?'",
        "'speaker_11': 'You know.'",
        "'speaker_3': 'I believe our percentage open space was close to 30%.'",
        "'speaker_11': 'Great. Thank you. And of course, former city staff Amy. I see over there. You know, I think it's a very intriguing idea that they went across into the parking lot. What's your perspective on that?'",
        "'speaker_6': 'Certainly, there are some complications with that from a zoning perspective in the Coastal Commission's perspective, but it does provide for additional activation of the waterfront. So in many regards it's a very positive feature.'",
        "'speaker_11': 'So as the City of update process gets underway, do you think that that's something that the committee and the consultant should look at is whether or not there's some viability to link those areas together.'",
        "'speaker_6': 'That part of the waterfront is not in the ceded boundaries. So the committee would really need to determine whether or not they wanted to expand the boundaries of seating to include the actual waterfront.'",
        "'speaker_11': 'Okay. Well, I could tell you I find it very intriguing. I know that we've had developers in the past, Mr. Mayor, you might recall they've looked at trying to combine those. And I guess I would encourage the the group to at least take a look at what the potential feasibility and benefits to the city would be.'",
        "'speaker_11': 'Very creative idea. Thank you.'",
        "'speaker_0': 'Councilmember Cioffi.'",
        "'speaker_10': 'First of all, I want to thank city staff for arranging the presentation and also again to congratulate you. This is an extremely creative, bold, exciting plan. And I do think everyone here agrees that that particular parcel of land is probably is probably the most exciting waterfront waterfront adjacent parcel probably in Southern California that has has not been'",
        "'speaker_10': 'looked at in the way that you have done it. I guess I would ask, have you talked to the owner of the property about his interest in your plan? Has he seen your your award winning? Planning design.'",
        "'speaker_11': 'Yes. The owner was at the presentation when when we won that night and was part of the submittal to Knapp for the site to be considered. So he he has seen the plan.'",
        "'speaker_10': 'Okay. Well and I thought was very thoughtful on your part was to recognize the current planning situation with the need to update CDEP and what the city is going through so that there's a possibility to do things incrementally.'",
        "'speaker_10': 'If if a developer wanted to do that. So I'm going to thank you and hopefully everybody will keep this in mind as as the city moves forward. And it's probably one of the most exciting plans that I've seen since I've been on the city council about the use of that property.'",
        "'speaker_10': 'I don't know. The question would be, did you address anything about traffic mitigation? Because as we know, that has been the biggest concern right now. Traffic in that particular corner of Long Beach is already troublesome. So that was the concern about adding additional retail and other amenities in that area.'",
        "'speaker_3': 'We looked at mitigating traffic in two different ways. First of all, expanding capacity, doing that through dedicated right lanes, looking at potentially working with adjacent land over to create a future street shopkeeper road that would alleviate the traffic burden in terms of what we did on our site to alleviate traffic.'",
        "'speaker_3': 'We created more of a destination retail center where people would come in. You would actually enter the site off of a new street that we've created so that you wouldn't have cars coming off of Second or PCH or Marina.'",
        "'speaker_3': 'And then in addition to that, we took a second approach because every time you increase capacity, traffic is going to grow to meet that capacity. And so one of the things that we did was really educate the people and try and get the people out of their vehicles, do whatever we can to encourage people to bike to'",
        "'speaker_3': 'the site, encourage ride sharing programs, increase pedestrian activity. And so really, I think the two different ways that you can tackle traffic, there are two different ways that you can tackle traffic expanding capacity, but that's only going to take you so far.'",
        "'speaker_3': 'And so it's really finding ways to creatively bring people to the site and get them out of their vehicles.'",
        "'speaker_10': 'Thank you very much. Appreciate it.'",
        "'speaker_0': 'Mr. Neil.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Gentlemen, I think your.'",
        "'speaker_3': 'Design is very creative, very visionary. Mr. Bodak, in regards to the height restrictions now, how does their projection fit in, in what is currently existing?'",
        "'speaker_6': 'Well, a project of this magnitude with the design that they've approached suggested does require some amendments to current CDP regulations, not only to allow the residential use, but to deal with the height restrictions. The height currently right now is limited to 30 feet.'",
        "'speaker_6': 'And so their proposal is 60 feet. That is much more in keeping their 60 foot height that they're proposing, as much more in keeping with what staff was expecting that that site should be able to accommodate. The previous proposal by the developer had much higher heights than that which were not well received by the community.'",
        "'speaker_3': 'Thank you. Thank you, gentlemen.'",
        "'speaker_0': 'All right. Thank you very much, gentlemen. I appreciate that. I agree with Mr. DeLong. We've both long thought that this project needs to go to the water to increase its viability and its usefulness. Did a great job, and we appreciate it.'",
        "'speaker_10': 'You want to make a motion, please?'",
        "'speaker_0': 'You haven't seconded any member. The public would address the council on this item. Move aside. Gentlemen. Mr. Good. You, sir.'",
        "'speaker_5': 'Very good. You clearly as the address as a Buckeye. I want to commend the guys. This is, I think, the best rendering and most creative that I've seen since I've been here that's been presented to this council, notwithstanding the fact that I think this the obviously the six feet, the six storeys isn't going to fly, but everything'",
        "'speaker_5': 'from like this portion here is outstanding. And bringing the water in, connecting it to the water is just right in concert with what everybody is trying to do. One of the things I've looked at to try to look at is actually where Marina Drive is now is we had that like a graded and what we want is'",
        "'speaker_5': 'water, the actual water coming down underneath there, connecting there and connect back to Marina Pacifica. That provides another way of getting out into the water. The six stories, in fact, I was just looking at this morning. This concept here that you have.'",
        "'speaker_5': 'In fact, the entire concept with this certainly would be great at PCH. And second, where now the old power plants are on the other side of Studebaker. This thing would fit like a champ in there. There's some environmental issues that obviously we have to take care of, but I think this is a step in the right direction'",
        "'speaker_5': ', although in terms of I question the the marketing, the attractiveness. The fact is. We're at a handicap here. Fish tastes very good, but they're for customers they don't buy. So the reason we don't have these retailers here is the just simple lack of numbers.'",
        "'speaker_5': 'Yes, we do have to go out to Fashion Island or to other places to get that. But we don't have the volume to justify the investment that the major retailers want to invest in here. And that will never happen.'",
        "'speaker_5': 'Also, we have if we have a permanent place, in my view, for a flea market right now, we're this is sort of the epicenter of flea markets in Long Beach and in California and major retailers. I don't want their name associated with the flea market.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_0': 'That's good.'",
        "'speaker_5': 'I don't mean to put a damper on creativity, but I have five points to make and maybe it was above my head, but I didn't see them totally addressed. The first one being What is the concern for esthetics?'",
        "'speaker_5': 'I mean, there's no waterfalls, no baroque sculpture, no meditation, lots raging, just buildings. The second point being that allowances are not made for parking as much as they should be. And another point being that hotel rooms, hotels are going to be should be built when the hotels we have now are are underused and are really enough.'",
        "'speaker_5': 'There are quite a few hotels we have presently. And another point being this, that the creativity you're creating, buildings on spots that don't presently have one, have them. And it doesn't strike me as all that creative, really. Last point I would like to make is the worst traffic problem is going to be exasperated.'",
        "'speaker_5': 'The intersection of Pacific Coast Highway and Second Street that that traffic is horrendous and you would be augmenting that. So maybe you can address those points. If not.'",
        "'speaker_10': 'Let us stand.'",
        "'speaker_0': 'Actually.'",
        "'speaker_6': 'Good evening. I am Patricia ETIM and I live in District three. We have for over two decades and I would really like to voice my appreciation for your brilliant idea. It was just amazing. So I am sure that many in our district and many around Long Beach would be delighted at this presentation and your absolute thoroughness.'",
        "'speaker_6': 'So thank you all very much.'",
        "'speaker_0': 'Thank you. Mr..'",
        "'speaker_10': 'I am Francis Henley Dyson Harris and I reside in District one. And I just want to say I'm incomplete on what a gift you have, and it's just absolutely phenomenal and it's exciting. And I and I encourage of course, I build it now the city's going to receive and for this to look at this in the future'",
        "'speaker_10': 'and it just looks so positive. And I believe it's going to draw people down into that area and people that are leaving, going to other places will come back into that area. But I couldn't sit back there and not tell you that we have to give you half.'",
        "'speaker_10': 'And thank you so much.'",
        "'speaker_0': 'Next was.'",
        "'speaker_6': 'Hi. My name is Donna Coates, Mayor City Council. I admire your intent to get bike riders there, but unless you can lower the hill from Naples over to PCH or make huge wide bike riding lanes down Pacific Coast Highway, I doubt anyone's going to ride bikes there.'",
        "'speaker_0': 'I ride my bike there. Don't worry about it.'",
        "'speaker_7': 'He's to me.'",
        "'speaker_4': 'Hi. I'm Kurt Schneider. You did a great presentation. I like the project a lot. The future st. That's definitely something that you should consider. But instead of just going to Shopkeeper Road, keep going through the wetlands. And by doing so, you'll get rid of some of the congestion and also take care of a big problem our city'",
        "'speaker_4': 'has. We don't use our wetlands like other communities do as an asset, not a liability. If you go to Huntington Beach, their wetlands are beautiful. You want to go out there with the children and walk through them. And bike ride.'",
        "'speaker_4': 'Run here. You smell oil. It's nasty. If you bring a street through there and also have a, you know, walking paths along the side, you'll find that money will follow. You'll clean it up. It'll look great. Great way to take care of congestion.'",
        "'speaker_4': 'I love the idea of activating that area. I can't see the coastal not being in favor of it. And when Mr. Goodhue says that the retailers won't have enough bodies coming in, he doesn't know the math. We are severely under retailed.'",
        "'speaker_4': 'The only problem we have in Beaumont, Shaw right now is with we have more restaurants and retail because we don't have daytime traffic. We don't have office buildings. We don't have those generators to bring in all the, you know, the normal working hours for people coming in and shopping.'",
        "'speaker_4': 'But if you did something of this magnitude, you would be able to attract the quality, the Urban Outfitters, the know gap like we have on Second Street and the new concepts. Keep thinking. Keep imagining. Look forward to this project.'",
        "'speaker_4': 'I hope that everybody's listening in. The city will work well with them. Thank you.'",
        "'speaker_0': 'Any other comments? Thank you. Councilmember Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Mayor. I wanted to add my congratulations to the team as well. It's the Ralph and Goldie Lewis Hall is where I spent many years. So I want to congratulate you for being a part of their planning school.'",
        "'speaker_7': 'And this is a great product. As you can see just from this council meeting, you've inspired a lot of imagination and a lot of discussion. And I hope that down the road that something like this is our potential at Second and PCH.'",
        "'speaker_7': 'So thank you for reviving that for us and reminding us that we don't have to tolerate the mediocre. I appreciate that. Thank you.'",
        "'speaker_0': 'Mr. Neal.'",
        "'speaker_3': 'Thank you, Mr. Mayor. Just one more question, gentlemen.'",
        "'speaker_4': 'In regards to your concept, did you consider mobility in.'",
        "'speaker_3': 'In in the event of public transportation, did you reach out to any public transportation agencies? I love the walkability idea, but as far as getting more public transit there. Was that ever considered? As a resident of Belmont Shore, we did some research and talked to several people who are familiar with several agencies, such as the Water Taxi'",
        "'speaker_3': 'and adding additional bus stops to near the site.'",
        "'speaker_0': 'Mr. Johnson.'",
        "'speaker_3': 'Well, thank you, Mayor. And I enjoyed the presentation. I just want to note that, well, it's good to have a robust conversation in the public. You know, I know anyone here watching to think this is only a public project and it is private land.'",
        "'speaker_3': 'And ultimately private property owners do have rights. And so I think our role will be to see whatever is proposed and to weigh in with the public. But I just want to note that for the record.'",
        "'speaker_0': 'Okay, gentlemen, I really appreciate it. Very creative idea. I'm glad you're talking to the owner. And I know that sometimes you may hear comments in here that sound like you're in a parallel universe, but don't let that discourage you.'",
        "'speaker_0': 'There's a lot of potential of what you have here, and it's something Mr. and Mr. Long and I have talked about. It's it's the right idea. Hopefully you can make it commercially viable. And the owner who's talking to you.'",
        "'speaker_0': 'That's great. Thanks again. Congratulations on your win. We have a motion and a second one was already done. It's its best motion. And second, cast your votes members.'",
        "'speaker_1': 'Motion carries eight votes. Yes.'",
        "'speaker_0': 'All right. Thank you. Will return to item 14 Global Read.'",
        "'speaker_1': 'Item 14 is communication with the Office Council very soon, along with the recommendation to request city attorney to draft amendment language to the Downtown Dining Entertainment District Ordinance enabling entertainment and activity on rooftop patios.'",
        "'speaker_7': 'Councilmember Lowenthal Thank you, Mr. Mayor. Councilmember, as you may recall, my commitment a few months ago to return to you with a change to our downtown dining and entertainment district ordinance once we had the opportunity to discuss rooftop entertainment with stakeholders.'",
        "'speaker_7': 'This request reflects conversations between my office and police, city staff, residents and owners at 144 Pine Avenue, the Corner Restaurant Group, which happens to own the only rooftop patio in the dining and entertainment district. In addition, staff's requested more explicitness with respect to the sunset clause of these conditions once the Dining and Entertainment District Task Force returns'",
        "'speaker_7': 'with their own set of recommendations. So I'd like to amend the motion, if I might, to include the following language. This amendment to the ordinance shall sunset upon action by the City Council, either on its own or in response to recommendations made by the Downtown Dining and Entertainment District Task Force.'"
    ],
    "Recommendation to adopt Specifications No. RFQ CM14-020 for architectural and engineering services for the Belmont Plaza Pool Facility Rebuild / Revitalization Project; award the contract to Harley Ellis Devereaux Corporation, of Los Angeles, California (not a MBE, WBE, SBE or Local), in the amount of $7,144,301, plus a 10% contingency of $714,430, for a total amount not to exceed amount of $7,858,731; authorize City Manager or designee to execute all documents necessary to enter into the contract, including any amendments thereto; and  Increase appropriations in the Tidelands Operation Fund (TF401) in the City Manager Department (CM) by $7,858,731.  (District 3)": [
        "'speaker_0': 'Yes, 15 has been been withdrawn. Item 16, luxury item 16.'",
        "'speaker_1': 'This communication with the Office of the City Manager and the Parks and Recreation Marine Department with a recommendation to adopt specifications for architectural and engineering services for the Belmont Plaza Pool Facility.'",
        "'speaker_6': 'Yes, Mayor. Members of the Council tonight we are here to award the contract for architectural services to design the new Belmont Pool. As you recall, in January 13, we had to close the Belmont Pool due to seismic conditions.'",
        "'speaker_6': 'In February, the council reviewed the options and alternatives and approved the conceptual design for the new pool and asking that we further evaluate the potential for a separate diving well within the indoor pool, and also the feasibility of a movable floor for the indoor pool, which this contract will in fact, in, in fact, look at those two'",
        "'speaker_6': 'particular issues. In December, we did open the temporary pool, which is up and running and a big success. And now our efforts are directed towards the permanent pool and the design of that permanent pool. So in December, we issued an RFQ and 21 firms submitted proposals.'",
        "'speaker_6': 'A team consisting of the director of Parks Rec and Marine Public Works, Development Services, City Manager's Office, and our project manager, Dino D'amelio from Anderson PENNER all reviewed the proposals and narrowed it down to five firms that we then interviewed, and the decision was unanimous to select Harlee Ellis Devereaux corporations with Hastings and Cervera.'",
        "'speaker_6': 'They are an excellent team, extensive experience and we believe will design a facility that we all can be proud of. Given the significance of this particular project and also the award of this contract. We'd like the the firm to give the council a brief presentation on their experience and background.'",
        "'speaker_6': 'And so I'm going to hand it over. The team would tonight would consist of Peter Devereaux, Brant Miller, Eric Katcher, Paul Graves and Michael Rotondi. So with that, I'm going to hand it over to our team to do a brief presentation and then we'll hand it back to staff.'",
        "'speaker_3': 'Mr. Mayor and City Council, thank you very much for having us here today to talk about our qualifications.'",
        "'speaker_0': 'For the Belmont Pool Project. With me next to me is Eric Kolker with Hastings and Cervera. Paul Graves with.'",
        "'speaker_3': 'Councilman Hunsaker.'",
        "'speaker_0': 'And Michael Rotondi with Photo Architects. I do apologize. Peter Devereaux was stuck.'",
        "'speaker_3': 'In traffic and couldn't make it this evening. Once again, my name is Brant Miller.'",
        "'speaker_0': 'I'm with the architecture firm Harley Ellis Devereaux. We're very excited about this project. A little bit about our firm. We just recently celebrated a 100 year anniversary, which we're very proud of. We are a national firm with over 300 individuals of architects and engineers in offices in.'",
        "'speaker_3': 'Los Angeles, San.'",
        "'speaker_0': 'Francisco, San Diego, Detroit and Chicago. Really focused on a variety of projects.'",
        "'speaker_3': 'And particularly.'",
        "'speaker_0': 'With this team put together with expertize.'",
        "'speaker_3': 'And in aquatic centers.'",
        "'speaker_0': 'We're going to take the next 5 minutes or so and talk about our qualifications, partly because we're running late and want to run after that U.S. group and get my business card to them. That was a fantastic presentation that they did.'",
        "'speaker_0': 'They provided everybody real quickly. The team organization, I.'",
        "'speaker_3': 'Won't go into the detail.'",
        "'speaker_0': 'The expertize that was put together on this project really was put together based on the requirements of the project itself, with the idea of a competition pool, with the idea of a recreation pool.'",
        "'speaker_3': 'With the iconic.'",
        "'speaker_0': 'Nature of the project. We put together a group of consultants and partners on this team to really meet those requirements for the city.'",
        "'speaker_3': 'The expertize that this team has together in planning and constructed pool and aquatic facilities ranging from recreational and.'",
        "'speaker_0': 'Competition and Olympic venues over the past 25 years has been over a thousand facilities. And so, once.'",
        "'speaker_3': 'Again, the qualifications of this team.'",
        "'speaker_0': 'Were short with the thousand, apparently more than that, but really bringing together a team with what we think is the right qualifications for for the city of Long Beach.'",
        "'speaker_5': 'So we've got about 12 slides to talk about.'",
        "'speaker_11': 'Some of our experiences.'",
        "'speaker_3': 'And then we'll we'll end with.'",
        "'speaker_0': 'Michael Rotunda.'",
        "'speaker_3': 'And some thoughts about the site and some of.'",
        "'speaker_0': 'Opportunities for the project to roll quickly. This is Occidental.'",
        "'speaker_3': 'College. This is in a planning phase right now in fundraising. A 36 meter pool. Really focus on.'",
        "'speaker_0': 'Competition for the university itself. Oaks Christian High School. We developed Olympic sized pool.'",
        "'speaker_3': 'It's 50 meter by 25 meter.'",
        "'speaker_0': 'Really focused more on competition for that particular venue. This particular project on it, would it actually in Michigan, this was a combination of within a single facility, both.'",
        "'speaker_3': 'Recreational and.'",
        "'speaker_0': 'Competition facility and accommodations.'",
        "'speaker_8': 'This is our project at Georgia Tech.'",
        "'speaker_5': 'This was built.'",
        "'speaker_8': 'For the 1996 Olympics, if you recall, in Atlanta. And it is a one of the fastest pools in the nation, the holder of many a world record and American records. From the competition standpoint. It's also referred to as a dotted ice.'",
        "'speaker_8': 'So it is a 50 meter by 25 yard pool with a separate diving well. One of our other competitions sites is a facility that's hosted National Conference Grand Prix swimming event since its opening. It's Michael Phelps most favorite pool.'",
        "'speaker_8': 'He swam and is leading into his record Olympic gold medal run in the 2008 Olympics. It's also adopted a configuration. And in the case of the University of Missouri, from the standpoint of recreation use, it gets tremendous community, regional and then of course, student use.'",
        "'speaker_5': 'City of St.'",
        "'speaker_8': 'Peter's. This is a municipal facility that was built for the Olympic Festival and has hosted Olympic trials for swimming and diving. This is a 50 meter pool with a moveable bottom so that it has a full depth for competition but provides great opportunities for recreation because and that's shallow in that that moveable bottom can go from zero'",
        "'speaker_8': 'down to seven feet. That's also an example of a diving tower that's part of the main pool, and it has some recreation. You can see at the very end of this, it has some slides and some other fun recreation components in the building as well.'",
        "'speaker_8': 'We also wanted to share with you some of our outdoor facilities. This is a municipal facility, outdoor ranging from zero entry to of course, you can see the slides, vortexes, lazy rivers, a whole component of opportunities for recreation use, including also lap swimming and some competition events as well.'",
        "'speaker_8': 'The University of Nevada. This is in the this is one of their lap leisure component facilities. And then in the adjacent building, there's actually a 50 meter Olympic sized pool as well. You can see the spa next to the windows really does provide some of that indoor outdoor experience.'",
        "'speaker_8': 'Denison University is an interesting project because it does have the Olympic 50 meter pool. You can see in the far of the photo and then in the near, as opposed to placing the separate diving. Well, at the end of the 50 meter pool, it's located towards the towards the middle and actually creates like a tier an L-shaped'",
        "'speaker_8': 'facility. So it's just a different configuration. This Integra Fitness Center is really just an example of the combination of both leisure components and recreation. With lap swimming in the outdoor environment. Southeast Missouri University is really trying to illustrate some of the recreation components that we've worked on on some facilities.'",
        "'speaker_8': 'Not to say this is what will be here, but it's definitely something that we wanted to share as vast experience, everything from the Olympic venues to university climbing walls in a pool. Again, with Arnold Community Recreation Center, just again, help bringing aquatics into a community is vital for the success of an overall project.'",
        "'speaker_8': 'Blue Water YMCA. Again, just another example of the indoor aquatic facilities.'",
        "'speaker_3': 'Good evening. I'm Michael Rotondi. I'm an architect and an educator. So I come at projects in a in a in a with a broad overview of how it can serve the community in many, many ways, as well as with a precision of working with my friends here to make a facility that's quite extraordinary, which in the brief'",
        "'speaker_3': 'it talks about iconic architecture. In my experience, both direct and indirect, through my studies of architecture for many years, an iconic architecture comes from an iconic site.'",
        "'speaker_5': 'This is an extraordinary site. It's a there are sites.'",
        "'speaker_3': 'That have ocean meeting city, but there aren't too many sites that are on an exceptional bay in a wonderful city like Long Beach that has the pool mediating where land meets water and where city meets land and water.'",
        "'speaker_5': 'The the fact that it's a it's an in-between location for a pool makes it a.'",
        "'speaker_3': 'Very exceptional creative challenge, which is makes the project all the more fun.'",
        "'speaker_5': 'The way we're beginning to talk about it beyond preceding function is how to configure the light, how.'",
        "'speaker_3': 'To configure the space and the water in order to configure the communal life. And most of all, the charge that we have is to is to take the vision of the city as expressed through the council, to make a place that is going to attract people from all over the world.'",
        "'speaker_3': 'Thank you. So we'd like to thank the mayor and the city council for their time.'",
        "'speaker_6': 'So Mayor councilmembers, that concludes our report of this. We're asking that you approve the staff recommendation to award the contract for this team.'",
        "'speaker_0': 'Mr. O'DONNELL.'",
        "'speaker_4': 'Thank you, Mr. Mayor. Thank you for the presentation. You seem well-qualified to move this project forward, and I am happy tonight that we are moving this project forward. Quick question for city staff. You've heard me say several times throughout this process that we should do everything we can to incentivize the early construction, the expedited construction of this'",
        "'speaker_4': 'project. Are those concepts or is that concept built into this contract rewarding tonight?'",
        "'speaker_6': 'Yes, we have actually a very aggressive design, a time frame for this. And then what we will be doing when we go out to bid is for the contractor. We're going to do a new methodology for selecting that contractor, something we've never done before to ensure a we have a quality contractor and B, that they're going to'",
        "'speaker_6': 'deliver this project in a more expeditious way.'",
        "'speaker_4': 'Great. Are there financial incentives?'",
        "'speaker_6': 'We're exploring that possibility at this time.'",
        "'speaker_4': 'But there aren't in tonight the contract or awarding tonight. There is not no what.'",
        "'speaker_6': 'Instead, in essence, what we did was establish a very aggressive timeframe. And in order to accomplish that, we are paying the price, you might say, in order to ensure that we get the plans and all the permitting and everything in place within our timeframe.'",
        "'speaker_4': 'So what's the timeline are we looking at? Why don't you break it down? There's the timeline for the design.'",
        "'speaker_6': 'Yes, there's actually, as you know, we're we've got to prepare conceptual plans and we're going to likely have those done in May, June. Then we will meet with stakeholders to discuss some of the outstanding issues, will come to the city council to make sure we're going in the right direction.'",
        "'speaker_6': 'And then, of course, we need to prepare the entitlement applications, complete our environmental review, go to the Coastal Commission, go to the Planning Commission, and then ultimately return back to the council so that we anticipate, in essence, doing all of that.'",
        "'speaker_6': 'I've got the schedule here so that we would likely be going to the Planning Commission in September to get the reviews and approvals. And then shortly after that, we're moving into a design and construction drawings. As you know, our timeframe for getting a pool completed is within about two and a half years.'",
        "'speaker_6': 'So that's the timeframe that we're looking at to get this project done and approved.'",
        "'speaker_4': 'Great. Well, I would have liked to have seen some financial incentives built into this, because to me, that's the hammer on getting this done. And it can be done. You know, it's it's not unique necessarily. It is probably in the public sector.'",
        "'speaker_4': 'But again, it's happened in the public sector before. Is there anything we can do to tighten tighten down the timeline between now and September? We've talked about it's going to take four months to drop conceptual write in conceptual.'",
        "'speaker_4': 'So just that they're just there and they're not any design necessarily any structural design.'",
        "'speaker_6': 'They're just you know, they we need to explore the conditions of the site. There's a lot of background information that needs to be conducted in order for us to determine the kind of building that we can design and the configurations that that site can support.'",
        "'speaker_6': 'So there's a lot of information that needs to be done as background before we can actually start designing it. So we I can assure you that we have a very aggressive design schedule, that the construction component is where we're going to need to explore the possibilities of incentives, because that's where the area and projects typically bogged down'",
        "'speaker_6': 'is in that construction phase.'",
        "'speaker_4': 'Correct. Okay. Listen, if there's something we need to do to move this forward a little quicker, the design component, please come back to council and ask us to do it. And I hope that the firm will communicate with you.'",
        "'speaker_4': 'If there's something we need to do to move this along, they too will share it. And when we get to the construction phase, maybe they have some ideas. Maybe we can look at some things some other entities have done to expedite the construction.'",
        "'speaker_4': 'But I think we need to do all we can to move this forward and move it forward rapidly and again end up with the best possible product. I know there's a balance there, so thank you.'",
        "'speaker_9': 'They keep concern for over Dylan.'",
        "'speaker_11': 'I have a couple of questions for the design team. Well, I think, as you already know, the council is looking for a world class, iconic facility. So I'm glad you comment on that in your presentation. We're looking for a facility that supports competitive swimming, it supports water polo, it supports community recreational swimming, and it supports an indoor'",
        "'speaker_11': 'diving component as well. Yeah, the assistant city manager talked about perhaps some conceptual and meeting with these stakeholders in May, June. And I can tell you, as I mentioned, those different things that we have some very eager, interested and active stakeholders.'",
        "'speaker_11': 'And I guess what I'd like to know is why, from a conceptual perspective, you wouldn't meet with those stakeholders early on in March. Right. Let's get going. Listen to at least what they have to say, what their aspirations and hopes and goals are for the project.'",
        "'speaker_11': 'And then, you know, a month later, you know, 30 days in April, we to come back and say, hey, based on what you've heard and we've heard from city staff, we've listened to the council, this is kind of where we're headed and make sure that we have a process that's very engaging as we go through this.'",
        "'speaker_11': 'Because when I hear that it's going to be, you know, May or June before me with stakeholders to talk about a conceptual design. And, you know, I share Councilman O'Donnell's concern about it dragging on. So could you speak to how quickly you could have some of those meetings?'",
        "'speaker_3': 'Yeah, I think that we.'",
        "'speaker_0': 'Can work with the city schedule.'",
        "'speaker_3': 'And obviously work with staff on developing any type of.'",
        "'speaker_0': 'Expedited schedule in that process and.'",
        "'speaker_3': 'Including.'",
        "'speaker_0': 'The community.'",
        "'speaker_3': 'In that process along the way. And we can work with staff to develop that schedule.'",
        "'speaker_11': 'Okay. So but I mean, specifically, do you see, you know, within the next month meeting with the four or five or six stakeholders representing some of those different groups and, you know, hearing at least what their aspirations are for the pool.'",
        "'speaker_0': 'I think that is absolutely an opportunity for that.'",
        "'speaker_11': 'Okay. And then how much time do you need from the time you hear input from from staff, from council, from stakeholders to say, okay, I've listened to you. Now here's kind of our first draft of what we think this facility is going to look like potentially.'",
        "'speaker_0': 'I think the current schedule has us in a 4 to 6 weeks period where we're.'",
        "'speaker_3': 'Evaluating the multiple options.'",
        "'speaker_0': 'That are on the table. And as you know, it isn't just.'",
        "'speaker_3': 'The single option.'",
        "'speaker_0': 'There's multiple configurations that the current design or the current concept has provided and what the City Council has approved for us to evaluate.'",
        "'speaker_11': 'So when you're talking about the multiple options, you're referring to the ten meter indoor dove. Well, as well as the moveable floor. That is correct. Okay. And I notice that in a couple of the pictures you had, you talked about some diving components and where those indoor ten meter dove facilities.'",
        "'speaker_11': 'Okay. And you're so your experience is at least in these other facilities, you were able to accommodate that.'",
        "'speaker_8': 'Yes. I mean, and that would be typical of one of the resources that are provided.'",
        "'speaker_5': 'In this type of facility.'",
        "'speaker_11': 'Great. And I think you also mentioned there was at least one facility you designed that did have the moveable floor. Is that correct?'",
        "'speaker_8': 'I mentioned one, actually. There were a couple examples you can't tell.'",
        "'speaker_5': 'From the photographs.'",
        "'speaker_11': 'And how is your experience with that? Fairly positive. I mean, we seen the council. We think that would be a great feature of the Pools app. In your experience as well?'",
        "'speaker_5': 'Yes, it takes.'",
        "'speaker_8': 'A body of water that can be between seven and nine feet deep all the way across and makes it usable for any age group. Because of the depth you can change literally. The platforms can come out of the water, so it goes from zero inches down to all the way down to the bottom.'",
        "'speaker_8': 'So it gives you tremendous flexibility, which you normally don't get in just.'",
        "'speaker_5': 'A square body of deep.'",
        "'speaker_11': 'Water. And that was our impression as well as as we listened to the needs of a different group and trying to determine how to accommodate as many as possible, if not all the mobile field floor seem to be an ideal capability to try and meet that variety of needs.'",
        "'speaker_11': 'Okay. And one of the other things is we've, as you know, we've selected Murtha and has done the temporary outdoor pool. So we've kind of picked that technology. How has your experience as a design team working with Murtha?'",
        "'speaker_11': 'Are you knowledgeable of used in the past? Do you see it continuing to play a role?'",
        "'speaker_8': 'So we've worked on many projects with Murtha, actually on similar renovations where we've taken existing purchased facilities or existing purchased pools and put them in new facilities. We're working on the Omaha facility right now, which utilized the 2008 and two and then 2012 Olympic swimming trial facilities.'",
        "'speaker_8': 'And that was a Murtha pool that we're now repurposing and utilizing. So as a firm, we've done that quite a few times.'",
        "'speaker_11': 'So I'm unclear. So are you experienced with acquiring the current technology design and using it in new facilities? And is that a vendor that you typically or commonly or occasionally work with?'",
        "'speaker_8': 'We've worked on numerous facilities and projects with Murtha. We're very familiar with the technology. And then utilizing and repurposing is something that we've done in the past and are currently working on now.'",
        "'speaker_11': 'But I guess when you talk about repurpose repurpose purposes, and that's different than your design as you do a designer of facilities. So, you know, I think Murtha's the best technology. I mean, you use it some. Times have not always on occasion.'",
        "'speaker_11': 'I'm just trying to. Sure. I understand.'",
        "'speaker_8': 'Your. We use Martha in certain applications where it. Murtha is a movable and portable pre-engineered pool. The other alternative is a concrete structure. We've done an approach both the same way. They both have particular benefits, pros and cons with the current Murtha pool that's sitting in the parking lot now, that is a temporary pool put up utilizing'",
        "'speaker_8': 'the pre-engineered structure. Putting that back in the ground is something that we've done in the past and for this application would work quite well.'",
        "'speaker_11': 'So because that's our expectation, right? And this is not to do we expect that to be disassembled, protect some of material cost and then put it in front of the facility.'",
        "'speaker_8': 'Absolutely. Yeah. Okay.'",
        "'speaker_11': 'Great. Well, thank you very much and look forward to work with you. And thanks for joining us.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_9': 'Thank you, Councilman Neal.'",
        "'speaker_3': 'Don't leave, gentlemen. Thank you, Mr. Vice Mayor. Appreciate the rendering. Your work looks very impressive, but I do have a question in regards to do you plan over the life of the contract to utilize any.'",
        "'speaker_11': 'Local contractors and.'",
        "'speaker_3': 'Even possibly any minority businesses? Currently we have submitted.'",
        "'speaker_0': 'Our consultants for the team, which I believe does have a certain level of local presence.'",
        "'speaker_3': 'On that.'",
        "'speaker_0': 'Obviously, when this goes to bid, I think that on the construction side, we have great opportunity to look for integrating those type of services into a general contractor.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_9': 'Thank you. We were also with you there. Thank you very much. Not seeing no other comment here. Any public comment?'",
        "'speaker_11': 'Just before we made the motion.'",
        "'speaker_9': 'Do you want to do it now?'",
        "'speaker_11': 'Move the staff recommendation.'",
        "'speaker_9': 'So we have a motion to move the staff recommendation. And there's a second. I will take public comment.'",
        "'speaker_10': 'I am Francis MLA from Harrison. I reside in District one. Vice Mayor Garcia and sitting council member said in the city, what a phenomenal presentation. I was looking at the variety of the polls. It is quite impressive. What's so awesome about the city of Long Beach is they do have an ADA compliance officer and I was looking'",
        "'speaker_10': 'at this because soon there will be the Paralympics and I don't know if Long Beach has a vision or in the future. I have an opportunity of maybe having the Paralympics at the Belmont pull. So I wanted to bring it to you.'",
        "'speaker_10': 'You may not be able to address this, but there are persons that use the pool for recreational purposes that are adults and children. They also use of therapy. But amazingly, those persons that train, you know, for the Paralympics.'",
        "'speaker_10': 'So I don't know if there's different types of things that will be needed for the pool or its built in universal design. But I just wanted to give it to you so that that door is open looked at, and so that opportunity will be there for all people.'",
        "'speaker_10': 'Thank you very.'",
        "'speaker_9': 'Much. Thank you. Next speaker.'",
        "'speaker_10': 'Mr. Vice Mayor. Members of the Council. Mayor Foster. My name is Lucy Johnson. I live in the fifth district. And this week you were correct. I am pleased with the. The choice. Thank you very much. I am pleased with the the selection of the architectural and engineering design team, particularly after I did learn that Councilman Hunsicker was'",
        "'speaker_10': 'part of that and once again involved as they were five years ago. And what we were trying to do this. Back then. Oh, excuse me. I come from the city staff and project manager Dino Amelia for completing their evaluation of these 21 separate proposals in a short period of time.'",
        "'speaker_10': 'It was encouraging to see that the original timeline is stated in the request for Call of Qualifications was met. Also very much appreciated was the timely posting of the list of proposers and the posting last week of the staff evaluation report on those 21 proposals.'",
        "'speaker_10': 'I do, however, have a couple of remaining concerns that were reinforced when reading the item before you tonight for approval. I think Dr. Councilmember Geelong has addressed this to some extent or to a great extent, but specifically that language says as required in the February 12th, 2013, council approval.'",
        "'speaker_10': 'The scope includes comprehensive design services for state of the art, recreational and competitive indoor and outdoor pool and an natatorium facility and provides for the study and feasibility determination of a separate indoor diving well and adjustable pool for system.'",
        "'speaker_10': 'Debbie McCormick addressed the diving mill issue in just a moment, but we all know that both are feasible, and I think your design team has already talked about that in terms of especially the some of the slides they had that showed a separate diving well, numerous slides and also the removable fourth floor.'",
        "'speaker_10': 'So the question for the council tonight is whether or not you will actually direct staff and the project managers and design team to incorporate those both into the final design. I thank you all for your support of this important project.'",
        "'speaker_10': 'The entire aquatics community in the United States is anxiously awaiting the completion of this new world class Belmont facility. As a side note.'",
        "'speaker_5': 'We have a Facebook page Rebuild Belmont.'",
        "'speaker_10': 'Plaza Olympic Pool. As of today, we have 1113 likes on that page. And the latest post, which was regarding an article on Swimswam Wwe.com, which is based out of Austin, Texas, about the selection of Harley Ellis Devereaux that you're looking at tonight, have been asked to approve tonight that post, one post alone had 809 people looking at'",
        "'speaker_10': 'it as of today. So I hope you can appreciate that this is much looked at not just here locally in Long Beach, but around the country and around the world as well. Thank you.'",
        "'speaker_9': 'Thank you. Next speaker.'",
        "'speaker_5': 'Good evening. My name is Patrick Kelly. I'm with Teamsters Local 952 and Teamsters Joint Council 42. I want to thank all of you for your public service and thank the public for being here on Mardi Gras. It shows a lot of dedication and I hope you all have a good Mardi Gras as you go forward.'",
        "'speaker_5': 'My question on this project is, and I think that it is, but I want to make sure that it's going to be done under prevailing wages. And if somebody could answer that and also we would ask that you consider a project labor agreement with local hire that will help the building trades people that are out of work'",
        "'speaker_5': '. Some of the crafts have 40 or 50% unemployment. And as you know, there's a tremendous amount of unemployment with young people and other people in the neighborhoods here in Long Beach. So thank you again for all of your work and happy Mardi Gras.'",
        "'speaker_9': 'I got some pushback because requested a quick comment from staff on that.'",
        "'speaker_6': 'Yes. Again, this is just the design phase that we're talking about. But for the construction phase, yes, it would be prevailing wage. And we will present to the council the option of using apply for this project also.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Hi, I'm Debbie McCormick. I think you met me last year and one other time during the year. I wanted to thank you because the last time I was here, it was a wonderful day. You all made a wonderful decision in voting for this new pool.'",
        "'speaker_6': 'We really fight for it. I think we helped educate the city about what the needs are in the aquatic community. You heard from the greatest divers in the world, the greatest coaches in the world. And I got a letter from our high performance director of U.S. Diving emphasizing why it's important to have a separate indoor diving.'",
        "'speaker_6': 'Well, with the platforms, of course. A lot of that has to do with the temperature of the water. A lot of that has to do with having simultaneous events going on at the same time and not being in anybody's way.'",
        "'speaker_6': 'So that really is really important. The depth of the pool is already there on. I know you're going to have the support of UC Davis. I'm very excited to work with this new team and and express some of my ideas.'",
        "'speaker_6': 'I think I have a lot of good ideas for the city and the diving world is cheering. Everybody is really paying attention to what's happening. They're all going to be here. I can't wait to help put on a really big show for you for the grand opening.'",
        "'speaker_6': 'I was at the grand opening of the outdoor pool. It was so exciting to see so many happy people smiling faces. And I can't wait until it's our turn for diving. And I just think it's just all wonderful.'",
        "'speaker_6': 'I want to thank Gary DeLong and Patrick O'Donnell for doing so much on our behalf. And I just wanted to remind you that you're all invited to a little diving show at the Martin Luther King Pool April 9th.'",
        "'speaker_6': 'I've invited the city council and the aquatic capital of America, which I now on the board of, and they support a lot of my ideas. We want to show you kind of how the little kids start. And I also want to thank you for supporting us in changing electricity from 122 to 20 so that we could put'",
        "'speaker_6': 'in a bubble machine. We want to invite you to all put on your Speedos, jump in the bubble. And I just think I really appreciate your support and I'm so excited about this and I want to help as much as I can.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_9': 'Thank you. Next speaker. We especially want to see Gary in those videos.'",
        "'speaker_4': 'I think you can see him on a screen on Anaheim. Right. Good evening, counsel. My name is Michael Kirkpatrick. I'm a member of the third district and a swimmer at Belmont Plaza. I'm thrilled to see this project moving forward.'",
        "'speaker_4': 'The one thing I'd like to make sure I get across is that this project should not be rushed, as was evident. This is going to be an icon for Long Beach and I'm thrilled that it's going to go fast.'",
        "'speaker_4': 'I want to be in that water as soon as I can. And you've got a lot of people in the community who are really interested, as Judy mentioned. The Facebook group has a lot of people who are interested in.'",
        "'speaker_4': 'I also run a website that talks more about it. But ultimately, we don't want this thing to run over or get too many people, too many competing interests. Please listen to us. Take our input, but take the thoughts of what seems like an incredible architecture team to heart as you move forward the project and don't rush it'",
        "'speaker_4': '. Thank you very much. Happy to see the ball coming.'",
        "'speaker_9': 'Thank you. Next speaker.'",
        "'speaker_4': 'I am Kurt Schneider. And Mr. DeLong had mentioned having the stakeholders meetings with the architects. I think it's a fantastic idea. I'm recently gone through the purchase of the adjoining property with Yankee Doodles, and we're working on the rest of the block.'",
        "'speaker_4': 'And in doing so, I think it's very important because there's a lot of effect from this project on the adjoining properties. There's going to be a removal, I hear, of the the street in between the pool and the property that I'm involved in.'",
        "'speaker_4': 'My hope is that when you say stakeholders, it's not just the water polo diving and swimming, but you also have all the other beach activities that we want to activate the speech to its fullest. You don't want to spend $63 million and you have a wonderful pool, but it's only used during swimming season and you want to'",
        "'speaker_4': 'have everything like bringing in the diving. It would be you'd be very remiss if you had built this without diving. Also, the removal of the street. Again, make sure you have all the stakeholders at the table and take some time to make sure that you make this the greatest swimming center in America.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_9': 'Thank you. Next speaker.'",
        "'speaker_5': 'Well, sounds very good. But Long Beach has a problem of over developing swimming pools available at Jordan High School, Lakewood Park, Jordan High School King Pool. The university could even scheduled in, then a pool was available. And of course the pool that they claim to be a problem with an earthquake, the Belmont the Belmont Pool, all those'",
        "'speaker_5': 'were available. You chose to build one because of the Belmont pool being a possibility of an earthquake. Well, there are all sorts of risks in life, and that was very minimal. But that was the incentive of moving this pool forward.'",
        "'speaker_5': 'This new one now. Much has been said about being movable for. Oh, it's very good. But really, is it I mean, the expense involved of that, they mentioned it. It concentrated on that because it was so expensive and an item that should be looked forward to.'",
        "'speaker_5': 'But what the Olympics doesn't have, the Olympic pools don't have movable floors. Why do we need one? All you have to do is start at the end of the pool, the the shallow end, and proceed to the deeper and one and the end.'",
        "'speaker_5': 'You don't need a oh, you don't need a livable floor for multiple activities. They don't have all they don't have are having all different activities at the same time. So I think there's a problems here. I applaud the fact that language wants to improve, but millions and millions of dollars is going be spent on the needy and'",
        "'speaker_5': 'and education and a lot of other things other than over developing that which doesn't need to be developed.'",
        "'speaker_9': 'Thank you. Next speaker.'",
        "'speaker_6': 'Hi. My name is Jessica Payne. I'm the president of the McCormack Divers Booster Club, Council Members, Mayor Design Team. I just want to thank you all so much for what you're doing for the Long Beach Aquatics community. I've been involved with diving since my son started in the year 2000 with McCormick divers.'",
        "'speaker_6': 'We lived for five years in Australia, where every all the major cities have a major aquatics facility that looks a lot like some of the facilities these gentlemen have designed that have fabulous competitive facilities.'",
        "'speaker_10': 'Sydney has the moveable floor.'",
        "'speaker_6': 'It was thrilling to be there when they were moving the floor for a big event at the same time that they had the water slide going and all of the recreational along with the competitive, it can be done.'",
        "'speaker_6': 'It can make Long Beach such a destination. The diving and aquatic community around the world are watching this project and waiting with bated breath to see how fabulous it can be. And thank you for supporting us in this.'",
        "'speaker_9': 'Thank you. See no other public comment on it? We do have a motion on the floor and a code call. Please go ahead and vote.'",
        "'speaker_1': 'Motion carries nine votes. Yes.'",
        "'speaker_9': 'Great. Thank you. And next item, please.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute Funding Agreement No. MOU.MR306.22, and any amendments as necessary, between the Los Angeles County Metropolitan Transportation Authority (Metro) and the City of Long Beach (City), to provide design funding for widening the Atlantic Avenue and Willow Street intersection.  (District 6)": [
        "'speaker_1': 'The report from Public Works with the recommendation to authorize stadium exit, a funding agreement with the Los Angeles County Metropolitan Transportation Authority to provide funding and widening of Atlantic Avenue and Willow Street.'",
        "'speaker_0': 'So moved that.'",
        "'speaker_9': 'There's been a motion and a second. Any public comment on the item saying none. Please go out and cast your votes. Councilmember Andrews.'",
        "'speaker_2': 'Thank you very much, Vice Mayor. You know, the project is definitely, you know, welcome to because this is a particular area in one of the most used intersections in the central area, you know, and in both the left and right lane terms will alleviate a huge, you know, difference in our community and commuting, you know, as well'",
        "'speaker_2': 'as, you know, helping to alleviate a lot of the traffic congestion there. So I would like to thank everyone who involved in and making this happen. So I'd like to move to approve this item.'",
        "'speaker_9': 'You get in a motion to approve the item by Councilmember Andrews. There's a second and there's no public comment. So we're going to go ahead and take a vote.'",
        "'speaker_2': 'Right up.'",
        "'speaker_1': 'Councilman Burgess. Motion carries nine votes. Yes.'",
        "'speaker_9': 'Okay. An exciting place to recommendation.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Chapters 5.81 and 8.68, relating to electronic cigarettes and similar devices, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Declare an ordinance, and many of them is municipal code relating to electronic cigarets and similar devices read and adopted as read.'",
        "'speaker_9': 'I'm going to turn this over to Councilmember Andrews.'",
        "'speaker_2': 'Yes. Thank you very much, Vice Mayor. You know, we've had two council meetings where we have deliberated on this issue. The facts have been entered into the records. Dr. Cushing is here with questions by the council. And I would like to make the motion to move forward to approve the ordinance as written.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_9': 'Okay. There's been a motion any second. Go ahead. See, there's some people from public comment. So, Gordon, if you have a comment, please come forward and identify yourself for the record.'",
        "'speaker_5': 'My name is Dr. Fred.'",
        "'speaker_0': 'Grandy, and I'm a.'",
        "'speaker_3': 'Surgeon at City of Hope who's been treating disease caused by tobacco products.'",
        "'speaker_0': 'For.'",
        "'speaker_5': '45 years. I would urge the Council to follow the rule that electronic cigarets have to be treated as tobacco products. They're advertised as a harm reduction device, but it's very dangerous to accept that without proof. One of the previous harm direction harm alleviation devices was the light cigaret.'",
        "'speaker_5': 'That light cigaret started in the city of Long Beach with with Billie Jean King and the Virginia Slims campaign and resulted in the death of a couple of hundred thousand American women. So that's an example of how that is not a good idea.'",
        "'speaker_5': 'The second problem with with electronic cigarets is that they're not intended to help people quit smoking. Otherwise, why would they be selling gooey butter cake flavor, snickerdoodle flavor, licorice flavor, juicy butterscotch flavor, candy cane and gummy bear flavors.'",
        "'speaker_3': 'The answer is that they're intended for sale to children.'",
        "'speaker_5': 'They have the potential to undo the good work that's been done in the state of California for the past 30, 30 years, including by the excellent tobacco control people in the city of Long Beach, and create a whole new generation of.'",
        "'speaker_3': 'People at risk for tobacco.'",
        "'speaker_5': 'Products. So please, in your deliberations, please make sure that all regulations treat this product as a tobacco product rather than.'",
        "'speaker_3': 'As a medical device. Thank you.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Vice Mayor Garcia, city council members in this city. What a controversial issue you have before you. I've been doing some research and I find all kinds of different information. And what I find of interest in an article dated February six, 2014, making me and those she wrote.'",
        "'speaker_10': 'Tom Bryant, executive director and legal counsel at the National Association of Tobacco Outlets, Inc., stated, quote, We see electronic cigarets as a new product segment for the industry, and if there are regulations, they should be reasonable, workable and acknowledge that e-cigarettes are a very different kind of product than traditional tobacco products like Cigarets.'",
        "'speaker_10': 'And then Mitchell Zeller, director of the FDA's Center for Tobacco Products on November 19, 2013, stated, quote, Until now, the agency has been sorting out jurisdictional questions Should it be regulated as a tobacco product, drug or a device that this decision remains pending?'",
        "'speaker_10': 'Now, it's my understanding you don't have to wait for the FDA. Its decision, the state and the cities have the jurisdiction to come forward to write an ordinance. I feel that's an issue that, you know, has to be addressed.'",
        "'speaker_10': 'And I am not going to say that I don't support the ordinance. I'm not going to say that I do support the ordinance. What I want to say, if you go forward on the ordinance, please keep in mind that if the FDA does come back with their ruling and it's different than what you have in your ordinance'",
        "'speaker_10': 'that please consider amending what may be in the ordinance. And I know people that have quit smoking. I'm not going to get into all the flavors, but the nicotine level, that's a separate vapor. And you buy it if you want to have a nicotine level.'",
        "'speaker_10': 'And it comes in different levels. Now, Councilmember Andrews made mention about the youth, and I wholeheartedly believe that we need to look out for the youth. And the e-cigarettes are getting in the hands of the youth. I believe that e-cigarette retail business should be allowed to have vaping within their walls.'",
        "'speaker_10': 'And I believe that that you have to be responsible and you need to consider the public the effect on the public. And if you want to go forward and say you have to use it in a certain fashion, and so that the rights of the public being espoused, you know, that's in consideration, I approve wholeheartedly on that'",
        "'speaker_10': '. But, you know, I feel that if there's too many restrictions for at least the companies, the businesses that sell it can't have the vaping lounges and be able to let people tested products in their walls that people are going to go to online buying.'",
        "'speaker_10': 'And that's going to be catastrophic for the use. People are going to no longer be going in the stores. They're going to go online. Then they can just get all this and online products. You don't know what sent them.'",
        "'speaker_10': 'It can be very catastrophic. Their contents. Thank you very much.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'My name's Ken. Attorney. Long Beach. Born and raised. I like to keep this discussion relevant. We're not here to ban e-cigarettes, okay? We're here to discuss regulation of e-cigarettes as a tobacco product and throwing them in the same category.'",
        "'speaker_0': 'Anyone speaking about children smoking e-cigarettes or drug use or any any other fact or flavor or this. It's all irrelevant because we're not fighting or banning e-cigarettes.'",
        "'speaker_5': 'We.'",
        "'speaker_0': 'The baby company, are not against regulation of e-cigarettes, okay? We are against regulating e-cigarettes as cigarets and wrongfully applying laws that should be definitely treated as two separate entities. Appearance is the only thing that links cigarets to e-cigarettes, just to parents.'",
        "'speaker_0': 'It is wrong to judge by appearance alone in any situation. Cigaret smoke releases 4800 plus chemicals into the air. These chemicals have been scientifically proven to harm smokers and secondhand smokers justifying their regulations. E-cigarettes release water vapor into the air.'",
        "'speaker_0': 'There are no scientifically proven studies proving electronic cigarets emit any harmful chemicals to vapors or second hand vapors or into the environment. So science can't prove anything yet. It all comes down to discrimination by appearance alone. And that is wrong.'",
        "'speaker_0': 'Public is public health is a concern. And thank you all for questioning e-cigarettes. But let's not base our decision on discrimination, false facts. Please don't jump the gun and jump to conclusions and make decisions on lies or misinformation.'",
        "'speaker_0': 'One point that I'd like to bring up is Long Beach is a beach city. Cigaret butts pollute our streets and get washed into the ocean. And it's a huge problem. And the city spends a lot of money cleaning up beaches and stuff like that.'",
        "'speaker_0': 'And it is a health risk. E-cigarettes help eliminate that. There are so many things that e-cigarettes help alleviate public health. But the general public, I think, is prematurely jumping judgment of electronic cigaret cigarets without really realizing all the benefits.'",
        "'speaker_0': 'We are not smokers, we are ex-smokers. We started vaping to better our health and to be less and less insulting to nonsmokers. If this regulation is passed, we ex-smokers will be forced to vape alongside with smokers endangering our health, which defeats the whole purpose of vaping.'",
        "'speaker_0': 'We smokers are suspect susceptible to relapse, just like recovering addicts being forced to smoke in designated areas with smokers puts us at a vulnerable situation and endangering.'",
        "'speaker_9': 'And thank you for relapse. Thank you, sir.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_9': 'Next, be complete.'",
        "'speaker_6': 'Good evening, Vice Mayor and Honorable City Council. My name is Teresa moreno. I'm retired from the city of Long Beach. I have resided in Long Beach for almost 40 years and I reside in the second district. Next month marks the 20th anniversary of the passage of Proposition K by 68% of the voters.'",
        "'speaker_6': 'Proposition K became Ordinance 8.68 of the municipal code, the no smoking ordinance. We were the strongest smoking ordinance in public places, workplaces and restaurants and bars in the whole United States and for that matter, the world. I was the tobacco education coordinator for the city from 1994 to 2000.'",
        "'speaker_10': 'We were called.'",
        "'speaker_6': 'By cities and counties all over the nation and from countries like Canada, England, Australia and other countries to ask us, how did we do this? We are not number one anymore. And we just received a C from the American Lung Association for some of our our tobacco and our are smoking no smoking ordinance.'",
        "'speaker_6': 'I'm here in support of the e-cig ordinance. L.A. City just passed theirs today, their e-cig ordinance with a vote of 14 to 0. L.A. has over 8 million persons. We are surrounded by other cities that have passed similar e-cigarette ordinances.'",
        "'speaker_6': 'This ordinance is not bad for business. We are not saying don't sell e-cigarettes. We just don't want to allow the vaping of them indoors. It's about alignment. Aligning it with our ordinance. Aligning it with what other cities are doing.'",
        "'speaker_6': 'These e-cigarettes are called.'",
        "'speaker_10': 'Nicotine delivery.'",
        "'speaker_6': 'Devices. If you look up the word nicotine in the dictionary, the first definition is a noun and it is an insecticide. I don't know about you, but I don't want to breathe secondhand vaporized insecticide. Nicotine is a known addictive, highly addictive substance.'",
        "'speaker_6': 'In fact, former heroin addicts have said that it was harder to quit nicotine than it was to quit heroin. Also, it's been determined that at least ten chemicals identified in e-cigarette aerosol are listed among the 65 carcinogens as carcinogens.'",
        "'speaker_6': 'The tobacco industry and the opposition will say that it hurts business. If this don't if this doesn't pass. You're going to have a lot of people like myself and others don't want to go into businesses where there will be people vaping.'",
        "'speaker_6': 'And so we need to we need to understand that while our opponents or the businesses that sell e-cigarettes are saying that they'll lose business.'",
        "'speaker_5': 'Other businesses will lose it.'",
        "'speaker_6': 'For people who don't want to go in. So I say please support it. And thank you so much.'",
        "'speaker_9': 'Thank you so much. Next speaker.'",
        "'speaker_6': 'Good evening. Mayor and Council. I am Patricia ETIM and I'm a resident of the third district. I have a background in public health and have been involved in many public health initiatives. Currently, I am the governor's appointee to the state tobacco.'",
        "'speaker_6': 'It's called Track Tobacco, Education and Research Oversight Committee. It's legislatively mandated, and our charge is to create the master plan for tobacco control for California every other year. And the three agencies that report to the body are the State Department of Public Health Tobacco Control Section, the State Department of Education, Office of Statewide School Safety and the'",
        "'speaker_6': 'University of California, which administers the research in tobacco control. I come actually as a as a resident of Long Beach today, but as a component of the master plan, we are certainly focusing on e-cigarettes and making sure that they are regulated as nicotine delivery devices.'",
        "'speaker_6': 'You know, the I'll just focus my comments since other people have spoken.'",
        "'speaker_3': 'Just about.'",
        "'speaker_6': 'Many different issues related to e-cigarettes. But the CDC has put out an advisory in a report on the use of e-cigarettes among middle school and high school students. And it is shocking. So this really it is an issue because they are the gateway age for tobacco use.'",
        "'speaker_6': 'So it is really the office of Statewide School Safety has really requested that all.'",
        "'speaker_3': 'Districts.'",
        "'speaker_6': 'Utilize the letter that they have issued to really have policies in place at their school level and to work with cities and counties to really make sure that e-cigarettes are regulated. The youth are not just using the e-cigarettes for nicotine as well.'",
        "'speaker_6': 'There are all manner.'",
        "'speaker_3': 'Of.'",
        "'speaker_6': 'Things that are put in the e-cigarettes. So it's really a huge concern. There's a lot of dual use. You can read the CDC report, but there's a lot of dual use among youth so that they aren't just smoking e-cigarettes.'",
        "'speaker_6': 'They also are smoking.'",
        "'speaker_3': 'Regular.'",
        "'speaker_6': 'Cigarets. And so I will I will leave it there. But UC Irvine, also here, quite close to us, has done quite a bit of research into what is what are the chemicals and other components in e-cigarettes, among them tin and nickel.'",
        "'speaker_6': 'And, you know, it's not regulated by the FDA. So it's really a hazard and I hope and encourage that you to support the ordinance as written. Thank you.'",
        "'speaker_9': 'Thank you, Speaker.'",
        "'speaker_6': 'Good evening. My name's Melinda Cotton. I live on Park Avenue in Belmont. Sure. And I thank the council for bringing this ordinance this far. And we hope that tonight you will, in fact, pass it. You've heard testimony that I can't match about the problems of e-cigarettes.'",
        "'speaker_6': 'The doctor spoken to Patti Theresa marino with long experience. So we ask that you pass this ordinance that will both allow people who want to vape to vape in their own homes or in a place where it's safe for them to do so and safe for other people to do so.'",
        "'speaker_6': 'And then the rest of us can be protected from the second hand vapors and from we know not totally what is in these devices beyond nicotine, a lot of chemicals and everything as well. And also to bring them under our city permit regulations so that we have a better knowledge of what's going on.'",
        "'speaker_6': 'So thank you. And we encourage you to please support this in tonight. Thank you so much.'",
        "'speaker_9': 'Thank you, Nick Speaker.'",
        "'speaker_3': 'Good evening. I'm Ron Johnson, resident of Third District. And I just want to say, as humans, we tend to ban things that we don't quite understand are even when it's probably beneficial. I believe that the ban on e-cigs is the primary example of banning something that we don't understand.'",
        "'speaker_3': 'I have a friend named Darren that surely would disagree with the ban. Darren came up in a house with a smoking mom, a smoking dad, and contracted a smoking addiction by the time he was 15 years old. So bad that he would have cigarets behind both ears and one in his mouth.'",
        "'speaker_3': 'Darren came across electronic cigarets or vaporizers and immediately quit smoking and has in turn backed for over 18 months. The fundamental the fundamental reason that cigarets are banned do not apply to vaporizers. You have two different technologies. You have combustion, you have burning, and then you have battery powered heating.'",
        "'speaker_3': 'Would you send a Tesla do a smoke test? Probably not. The technology is different. What I just wanted to say was. We shouldn't ignore the study that was done by Drexel University that actually accounted for 9000 people who use vaporizers and concluded that the effects were so un harmful that there was no there was no evidence for'",
        "'speaker_3': 'it. There is nothing they could even attach it to. So I just want to say not to ban e-cigarettes. To think it through. I feel that we're doing something without even understanding the full benefit.'",
        "'speaker_0': 'I think.'",
        "'speaker_9': 'Thank you. Next speaker, actually, conservatorships typically want to make a quick clarification.'",
        "'speaker_10': 'Yes. Mr. Perkins, can you clarify that this ordinance does not ban the sale or possession of e-cigarettes?'",
        "'speaker_3': 'That is correct.'",
        "'speaker_10': 'When you make that clear, nobody is banning banning these as devices. You're free to buy them in stores. And and I understand that they would be covered under the lounge act. This if they if they have a lounge like we do with Cigarets and I mean Cigarets.'",
        "'speaker_10': 'But with.'",
        "'speaker_6': 'Cigars.'",
        "'speaker_3': 'With cigars, it would be that is the same limitations or the same restrictions would.'",
        "'speaker_5': 'Apply.'",
        "'speaker_10': 'But they could do it with inside the store. Correct?'",
        "'speaker_3': 'They cannot do it inside the store. That is.'",
        "'speaker_5': 'Not correct.'",
        "'speaker_10': 'Well, I thought they were going to have the same provisions as the cigar places.'",
        "'speaker_3': 'That is not correct. These are regulated similar to Cigarets. And so we were not asked or we did not carve out an exception for consumption of the product within the store.'",
        "'speaker_10': 'I wasn't aware of that.'",
        "'speaker_9': 'Okay. Next speaker, please.'",
        "'speaker_6': 'Okay. Well, having heard that, I hope you rethink this ordinance so that you do allow. I am. My name is Donna Coats, and I am against the ordinance as it is currently written. First of all, I wanted to address the issue of selling to children.'",
        "'speaker_6': 'Kids will have the same difficulty buying vape devices as they do now buying cigarets. And the argument that the flavors are meant to appeal to kids is about as ridiculous as saying Wine's called Star Trek. Layer Cake and cherry pie are made to get young kids drinking.'",
        "'speaker_6': 'I have a basically a thesis here in three pages, and I'm not going to bore you with all statistics. But just briefly, a 2011 study on addiction delivered in Amsterdam showed that 96% of e-cigarette smokers said it helped them to quit smoking.'",
        "'speaker_6': 'Dr. Joel Natkin, who has testified on tobacco harm reduction strategies across America and has previously worked as a local health director, a state health director and leader of two national public health groups called the E-cigs a tool in tobacco harm reduction.'",
        "'speaker_6': 'While he was co-chair of the Tobacco Control Taskforce of the American Association of Public Health Physicians, he studied options for reducing tobacco related illness. He concludes that e-cigarettes are currently the most prominent and promising tobacco harm reduction option.'",
        "'speaker_6': 'In addition, in the Oxford journals Nicotine and Tobacco Research study of second hand exposure to vapors from electronic cigaret. The results show that nicotine resulting from smoking tobacco cigarets was ten times higher than from e-cigarettes. In fact, intoxicant levels, toxic levels from e-cigarettes were 450 times lower than in cigaret smoke.'",
        "'speaker_6': 'Electronic cigarets contain no tobacco and leave behind no tar. So the main carcinogenic components are not even present to create a problem like research, like cigaret smoke. But mostly I'd like to stress Dr. Michael Segal, a hard charging public health researcher at Boston University, argues that e-cigarettes could be the beginning of the end of smoking in America'",
        "'speaker_6': '. He sees them as a disruptive innovation that could make Cigarets obsolete, like the computer did to the typewriter. That's all I have to say. Thank you.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Vice mayor and councilman. My name is Pete Flores. I am a co-chair for the Smoke Free Coalition in Long Beach. And I go.'",
        "'speaker_4': 'To every other.'",
        "'speaker_3': 'Coalition meeting L.A., Orange County, San Diego. And I'm a project coordinator for Project Greater Southern Cal. So what I do is that I educate youth. I know that this is an ongoing battle between cigarets and e-cigarettes, vapors and all that.'",
        "'speaker_3': 'I am not going to bore.'",
        "'speaker_4': 'You with all the formalities about it, but I would just like to say that.'",
        "'speaker_3': 'We we would like the council.'",
        "'speaker_4': 'To think.'",
        "'speaker_3': 'Think thoroughly through it and hopefully make a decision tonight. Hopefully for the best. And I'll be going on a trip to Sacramento in April to go meet the legislators. So I hope that I can bring good news to them.'",
        "'speaker_3': 'All right. Thank you.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Hi. My name is James Patterson from the fifth District. I operate a store and I live in that area. First of all, I wanted to thank the mayor's office, the city council, for opening discussion on this topic. Let me preface this by saying We are not against regulation.'",
        "'speaker_4': 'We are against regulating the electronic cigaret device the same as other tobacco products. I think we're part of the downfall as people keep relating e-cigarette to tobacco. It's a nicotine extract. It's not tobacco. It's not like light cigarets.'",
        "'speaker_4': 'It's not a perforated filter. You're still going into combustion with light cigarets. That's where the flavors, you know, they're flavored because for the same reason they still eat Lucky Charms. But like, you know, we like the flavors, too.'",
        "'speaker_4': 'Just to kind of clarify. Like somebody mentioned earlier, there's like 4600 ingredients in the cigaret 4000 when burned. There's four in an e-cigarette and one of them is propylene glycol. It's been approved by the FDA since the 1940s and it's vaporize form for use inside hospitals, restaurants and schools.'",
        "'speaker_4': 'As a germicidal agent, some safe for human consumption. The next ingredient is vegetable glycerin. They use it in large public events or smoke machines also. So the flavoring typically comes from perfumers. So a lot of it's some of the favorites from flavor houses, some are from perfumery.'",
        "'speaker_4': 'So it's a lot of it is designed to actually be inhaled. And the nicotine, all the juices start off at zero. Every shop that I know around here carries zero nicotine available. The nicotine that we sell is upon customer request.'",
        "'speaker_4': 'The effects of nicotine itself is comparable to caffeine. In a study of 20 different juices, they found only one to have any sort of cytotoxicity. And that was a coffee flavor. It was only found in the highest concentration and they actually presumed it was to be linked to the process of processing coffee beans themselves.'",
        "'speaker_4': 'So and to compare even at that level, they found that the concentrate pulled from cigaret smoke was 795% higher at the cytotoxic levels. So as you can see, the e-cig is comprised of completely different ingredients than the traditional cigaret and that's that should be regulated separately.'",
        "'speaker_4': 'We believe regulation should grow with the industry and welcome open discussion with how they should move forward. Thank you again for your time.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_3': 'Good evening, vice mayor and council members. I'm Jeff Miller. I live in Long Beach. I wanted to say a little bit about the comparison here that people have been making. Proponents of these devices are saying they're not cigarets, so we shouldn't treat them like that.'",
        "'speaker_3': 'Well, please remember, cigarets have been regulated for a long time because of the fact that they are dangerous. They contain nicotine and other harmful substances. So they've been regulated. These devices, they want you to say vaporizers, but it's there.'",
        "'speaker_3': 'E-cigarettes is the other term. They also contain nicotine and other dangerous substances. Now, some of the people have made the comparison that the cigarets contain ten times more dangerous substances or 400 times more. But they they aren't saying because they can't say that these other devices have zero danger.'",
        "'speaker_3': 'They still contain nicotine. If the customer asks for it, they still contain other harmful substances. And I don't want to be exposed to that in aerosol form or in a burned form. Either way, we don't need to do that.'",
        "'speaker_3': 'So these regulations make a lot of sense and I urge you to support this ordinance. Thank you.'",
        "'speaker_9': 'Thank you. Next speaker, this is. Is there anybody else going to chew up the speaker macchiatos speaking off here? If you're going to speak, please queue up and then we're going to end this and the speaker's list. Okay.'",
        "'speaker_9': 'Please.'",
        "'speaker_5': 'Hello.'",
        "'speaker_4': 'How you doing?'",
        "'speaker_3': 'My name is Richard Gardenhire, and recently I was eaten outside of a restaurant and a car drove past, and I smelled the exhaust. So I know for a fact the exhaust is way more than the vaporize that you can.'",
        "'speaker_3': 'I'm actually a testimony as far as smoking cigarets. I smoked for about 5 to 7 years and I went to a e-cig not to quit, but more of a more a better alternative way to do it as healthy.'",
        "'speaker_3': 'Because I do play basketball and cigarets are not good. So when I went.'",
        "'speaker_4': 'I actually got a e-cig was it actually.'",
        "'speaker_3': 'Looked like this. Now this right here is 0% basically meaning I went and I got 6% milligrams and end up with 0%. So I am a testimony as far as smoking to not smoking. So with this deal is by me being around my parents, even though they did smoke, I had an alternative to do something other than'",
        "'speaker_3': 'grab the cigaret and puff because I have something else. So as far as the e-cig. It is helping in actually how I got turned on as I was walking into a Starbucks and I seen an older lady. So I asked, I was like, What is that?'",
        "'speaker_3': 'And before that I said.'",
        "'speaker_10': 'Actually, how old are you? And she was like, Oh, I'm 85.'",
        "'speaker_3': 'And she had it easy. So that's how I realized that it's a good thing.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Hi. Good evening. My name is Gina Celso. I am here representing Philippine USA. I do work at a local e-cigarette shop. So if the Long Beach Tobacco Ordinance is amended to include e-cigarettes and vaping, it would be devastating to our business for several reasons.'",
        "'speaker_10': 'One, folks who smoke tobacco cigarets and who are trying to quit or convert to vaping are most times unfamiliar with e-cigarettes and vaping. Our store and the vast majority of other vape shops allow customers to sample e-liquids and different devices that are used to vape.'",
        "'speaker_10': 'The proposed ordinance would prohibit this and therefore would be detrimental to our business. Secondly, a vape shop is a place where people who vape can congregate to use their own devices with other enthusiasts, as well as sample the variety of new flavors that are being continually introduced.'",
        "'speaker_10': 'Again, if the ordinance passes with the current language, this practice would not be allowed. In one fell swoop, the current vaping culture in Long Beach would be seriously jeopardized by the passage of this ordinance. Criminalizing e-cigarettes and vaping in light of empirical scientific evidence that it is a far safer alternative to tobacco is exactly what is not'",
        "'speaker_10': 'needed in Long Beach. Some would even be glad to argue that the vaping industry was not founded by Big Tobacco. It even threatens tobacco sales and future tobacco business. Finally, this is a trending technology which allows people to wean off the habit of smoking tobacco.'",
        "'speaker_10': 'Meanwhile, Long Beach has incorrectly categorized vaping and e-cigarettes into the same unhealthy category as smoking tobacco.'",
        "'speaker_6': 'This forces e-cigarette users who.'",
        "'speaker_10': 'Are trying to quit into the same unhealthy spaces as traditional cigaret smokers. It is a shame many other states are taking the necessary time to consider a more enlightened approach and creating ordinances in a positive and objective manner by looking for intelligent solutions.'",
        "'speaker_10': 'One example recently the state of Wisconsin has excluded e-cigs and vaping from their clean air and anti-tobacco legislation. I have here 692 signatures on a petition created by people in Long Beach who are really hoping that we won't classify e-cigarettes as a tobacco product.'",
        "'speaker_9': 'Thank you. If you want to give me the petition, you're able you're welcome to to the city clerk. Thank you. Next speaker, please.'",
        "'speaker_4': 'I am Rodney Johnson, owner of Beat City Vapers, which is in District four, actually live in Signal Hill. I'm actually actually two thoughts right out of my mouth, but I would like to say that we as vape store owners, we all work together.'",
        "'speaker_4': 'We understand that ordinances, ordinances are important. Just like the gentleman back here said, we're not completely against them. But as she said, you know, not allowing them in the stores would be really bad for business. I can't even begin to go into detail on how how much better I feel after smoking cigarets for 25 years and I'm'",
        "'speaker_4': 'only 43. And the amount of praise that we seem to get from customers that come in, you know, every single day happy that they stop cigarets we have a little area on the wall where we have packs of cigarets empty packs.'",
        "'speaker_4': 'Minder Where we pinned them to the wall. People sign their names and the date that they quit. I'm extremely happy about it. So I'm completely against the ordinance being put through as is. If it is, you know, put through.'",
        "'speaker_4': 'I would ask that you guys at least exempt the vape stores just like Los Angeles did, so that we can at least continue business as usual and then we can all work together to fix this later. Thank you.'",
        "'speaker_9': 'Next speaker, please.'",
        "'speaker_0': 'Hi.'",
        "'speaker_4': 'My name is Nels Hansen. I live in Long Beach. I also own a e-cig store lounge here in Long Beach. I'd like to say out of the hundreds and hundreds of people that come into my store every month that are struggling to quit smoking and struggling for a better lifestyle and to be healthier, to to think that'",
        "'speaker_4': 'we are going to make it harder for those people that want to quit smoking. Cigarets Which is the goal here, is to quit smoking. Cigarets. I don't want to fight for the rest of my life. I'm trying to cut down on cigaret smoking.'",
        "'speaker_4': 'The levels of difference of different the juices. We teach people every day when they walk in how to cut themselves down, how to work down to that 0% nicotine to be able to quit. You know, I just heard just now that the banning of the regulation was going to stop us from letting people experience in trying.'",
        "'speaker_3': 'These these.'",
        "'speaker_4': 'Flavors in the store, which, mind you, in my store, it's 0% nicotine. So all the flavor trials, everything that's going on in my store has zero nicotine, unless they brought that in themselves. It's it's outrageous. It's it's unbelievable to think that.'",
        "'speaker_4': 'We are going to put all these people that are trying to get away from the cigarets right next to him outside smoking. That is crazy talk. I mean, everybody's going to quit. They're going to go right back to smoking.'",
        "'speaker_4': 'And I guarantee you, I promise you, in the outrun and out in the in the long run here, we are going to see that e-cigarettes.'",
        "'speaker_5': 'Might save all of us.'",
        "'speaker_4': 'Who are potentially in risk of being around the secondhand smoke and smoking cigarets. And that's really all I have to say. I really hope you guys could just take a little more time.'",
        "'speaker_3': 'On this and really do a little bit more research.'",
        "'speaker_4': 'I hear a lot of people talking about all the dangerous.'",
        "'speaker_3': 'Chemicals they've named nothing but nicotine and that nothing.'",
        "'speaker_4': 'Not one has ever been caused has ever been brought up. Vegetable glycerin and propylene glycol and the food flavoring extracts. That's all that's in these things. Not one person has brought up any dangerous chemical besides nicotine. Which I.'",
        "'speaker_4': 'It's just wrong. There's none of the facts here for you guys to ban this or regulate it like this. It's not fair. Thank you.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'All right. My name is Matt Jo-Jo in the second district. I just think the way that the thing this ordinance is written as is is not right. Taking vaping away from being able to do it inside shops not only hurts the shops, but it hurts all the vendors that sell there, all the juice companies, the you know'",
        "'speaker_4': ', the people that actually manufacture these e-cigarettes, all these people are going to be hurting because they won't be able to try the products. They won't be able to try the flavors that are being offered. Why not leave it to the discretion of the owners?'",
        "'speaker_4': 'You know, I know Carson has there been they let that go and they're letting it still be. You're able to still vape inside their vape shops to be able to try all the flavors and products that they have.'",
        "'speaker_4': 'I mean, I see a lot of people when they're complaining, they're talking about, you know, I don't want this smoke or vapor in my face. And a lot of it is it's such a new product that it it needs etiquette still.'",
        "'speaker_4': 'I mean, like when you're going bowling, you know, and you're getting ready to bowl and this guy just throws the ball next to you, you know, you get all mad because you can't you know, you can't set yourself up.'",
        "'speaker_4': 'But it's such a new thing that it just needs etiquette, you know, like it shouldn't be in in movie theaters or restaurants. But at that point, you know, leave it to the discretion of the owner. I mean, that's pretty much all I had to say.'",
        "'speaker_9': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Go ahead, sir. Good evening. My name is Michael Schacht, image owner, operator of E-Cig City. And I live in too and operate my business out of a district. And everybody has said everything I've already said here at city council and what we want to get across.'",
        "'speaker_5': 'I opened my doors on November 16th and I now have six people working for me who are unemployed. Before they came to my shop and found a job. The electronic cigaret industry is set to employ another 100,000 people.'",
        "'speaker_5': 'Something to consider. Something else it considers. Have you guys been to any of these shops? They took vacant shops and made them look beautiful. And I will say that my shop, it looks pretty good. Do we have any statistics about what kind of business was was done in the city of Long Beach when Victoria Toll happened?'",
        "'speaker_5': 'People came from all over the place to be together with other enthusiasts, other people that enjoy e-cigarettes vaporizers. And if anything else that we are small business owners trying to make it and that being able to vape in our shops, it's the blood of our business, being able for the consumers to taste what they're going to get'",
        "'speaker_5': '. You don't trade on a T-shirt after you leave Ross or Nordstrom's. You try them in the store. And one more thing. If you're going to do anything, follow suit like L.A. City Council did and make an amendment to this current legislation and allow us to sample our product endorse.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_9': 'Thank you. What kind of unclosed public testimony are going to take it behind the rail? There is a motion on the floor as well. Councilmember Lipski.'",
        "'speaker_10': 'I'd like to ask Mr. Parkin, is there a possibility that there could be a carve out, just as you do for cigar? I know you said you're treating him like a cigaret, but we allow cigar bars. I voted against it.'",
        "'speaker_10': 'We allow cigar bars in this town. And I know the concern is about the age so that if they did check I.D. and that that would be a requirement, they check I.D., but that they in the shop could allow what they're asking for, which is a sampling.'",
        "'speaker_3': 'Vice Mayor members of the council I think you're referring to we do allow or have.'",
        "'speaker_8': 'Smoking lounges which are defined as cigar.'",
        "'speaker_3': 'Lounges, hookah lounges or tobacco clubs. Those currently exist and are allowed under the ordinance. The ordinance that, as it is before you tonight, does not allow for sampling of the product within the store. The your question is, could the ordinance be amended to carve that out or to allow that?'",
        "'speaker_3': 'The answer is yes. We could not do that tonight. What we would have to do is take the ordinance back, redraft the ordinance, and bring it back to the council for first reading and have then a second reading after that, because this would be a material change to the ordinance as presented to council tonight.'",
        "'speaker_3': 'And in order to give the public an opportunity to weigh.'",
        "'speaker_8': 'In on this material.'",
        "'speaker_3': 'Change, you have to go back to first reading.'",
        "'speaker_10': 'With and but also could be and there are very strict provisions that it would have to be checked before they allow the sampling of the product.'",
        "'speaker_3': 'Well, we haven't drafted or we haven't written the exemption, but certainly that could be included in an exemption if there was a carve out asked for by the council.'",
        "'speaker_10': 'Well, because of the rest of the ordinance, Mr. Perkin assumes that these are similar to Cigarets. Then my understanding would be they would have to follow the law in terms of you can't sell that.'",
        "'speaker_3': 'That's correct. It's prohibited sales to under the age of 18. That's correct. Okay. Currently. Okay.'",
        "'speaker_9': 'Councilmember Austin.'",
        "'speaker_4': 'Thank you. And I do have a couple of questions for the city attorney as well. I noticed in this ordinance that in the terminology used by the industry folks, vaping is not necessarily defined here. Is there a specific reason as to why that is the case?'",
        "'speaker_5': 'Most members of the Council we defined.'",
        "'speaker_3': 'Electronic cigarets to mean an electronic and or battery operated device, the use of which may resemble smoking, which can be used to deliver an inhaled dose of nicotine or other substances. It includes such devices and manufactured distributed. It goes on and on.'",
        "'speaker_3': 'So it would include the vaping, but it's a very broad definition.'",
        "'speaker_4': 'I think it is a very broad definition. And I think the the what I'm hearing is the real, I guess, rub here is the fact that, number one, these these things are being marketed as electronic cigarets, which I think is counter to the the the industry argument because, you know, they shouldn't be called cigaret electronic cigarets if'",
        "'speaker_4': 'they don't want to be treated or viewed as cigarets. But at the same time, they are also vapor and not smoke. And I think there needs to be a distinction or some sort of definition to to distinguish the difference between vapor and smoke.'",
        "'speaker_4': 'You know, and I'm not seeing.'",
        "'speaker_3': 'The councilman or I believe that our current definition was drafted broad enough to cover all electronic smoking and vaping devices, regardless of whether or not they're used to deliver nicotine or other substances. That was the direction that we were asked to prepare on the ordinance.'",
        "'speaker_3': 'So I believe as written, it is a very broad definition that we believe and we've looked at other cities on how they find it. It captures the vaping activity and and then regulates it as it would as a tobacco product.'",
        "'speaker_3': 'And that's what we've been asked to craft. And that's what's before you this evening. Well, we could if you'd like. I mean, if there's a direction, we could further define it to to make it clear that vaping is included in the regulation.'",
        "'speaker_3': 'If that was your desire.'",
        "'speaker_4': 'Well, I'm not an attorney, but it just seems to me that to follow up on Councilmember Schiff's key question, and I think the I know the question was raised for me as well, if if we were to allow or somehow move forward with allowing this these vaping devices to be smoked inside of lounges, we're going to have'",
        "'speaker_4': 'to somehow distinguish the difference to be able to do that and not have them fall under a cigar lounge ordinance or a or as is. So to me, it just seems that would be in our best interests to have that more defined.'",
        "'speaker_4': 'And and I like to just command out Councilmember Andrews for bringing this issue forward. I think it is it's it's something that needs to be regulated that we don't know enough about this this product. The fact that, you know, he works on a on a school campus and has seen these devices in the possession of young people'",
        "'speaker_4': 'who don't know exactly what they're doing. And we don't know what they're doing with these things. So to to to set an ordinance that that prohibits these from from these devices, from being in the possession of kids or being sold to kids.'",
        "'speaker_4': 'And then preventing the secondhand exposure is, is what I'd like to see done here. But at the same time, I don't want to see us being harmful to a business. And I do think that there is some some merit to the fact that people are getting off of cigarets.'",
        "'speaker_4': 'And and there's probably more this is more probably more healthy for them and the smoking and the nicotine involved in that. I'm going to reserve my comments and hear from the rest of my colleagues.'",
        "'speaker_9': 'A Council membership scheme.'",
        "'speaker_10': 'Mr. Parkin is correct that the L.A. City Council put in place the regulations we're talking about classifying cigarets. However, they did allow the the sampling of product in what they called labeling lounges, provided the.'",
        "'speaker_3': 'Vice mayor.'",
        "'speaker_8': 'Remembers the council. I'm aware that the city of Los Angeles, I.'",
        "'speaker_3': 'Believe, today adopted an ordinance, but I have not read that order.'",
        "'speaker_10': 'That's what the L.A. Times said. It said that they.'",
        "'speaker_5': 'I believe that's accurate, but I haven't read the ordinance.'",
        "'speaker_10': 'So I would like to if I can make a motion that, well, how can we do this? Because there's a second reading of the ordinance. I know that we can direct him to go back to the first.'",
        "'speaker_5': 'That's correct.'",
        "'speaker_3': 'You can make a motion to amend this ordinance at this time, and we would it's a material change to the ordinance. So we would go back.'",
        "'speaker_8': 'And if the motion was.'",
        "'speaker_3': 'Successful, we would recraft the ordinance for consideration by the council at a future date.'",
        "'speaker_10': 'Well, I'd like to make the motion that we do similar to what the city of Los Angeles.'",
        "'speaker_3': 'This would be a substitute motion. There is a motion on the floor.'",
        "'speaker_10': 'I don't know if he wants it.'",
        "'speaker_9': 'Do you want to first ask if Mr. Andrews wants to accept that before we do a substitute as a as a friendly amendment?'",
        "'speaker_2': 'You know, really only thing that really kind of bothers me about this whole situation is because, you know, we've taken two weeks on this. You know, we can have an up or down vote either way. You guys want to do it.'",
        "'speaker_2': 'But I just think now is the time for us to either make a decision or not make a decision. And my decision is to continue to go along with the ordinance it's already written.'",
        "'speaker_10': 'Well, I'll make a substitute. I'm making a substitute motion.'",
        "'speaker_9': 'Okay. So there's a there's a substitute motion and one of we council worships you if you want to go ahead and read the substitute.'",
        "'speaker_10': 'The substitute would be that we would direct the city attorney to come back, keeping all the ordinance in place, with the exception, as in the city of Los Angeles, to allow the use in vaping lounges provided that it is checked and that the users are of sufficient age to do that.'",
        "'speaker_9': 'I mean, we've got pressure on the city attorney who wants to cue and they're going to go back to the Q and get Mr. Andrews and Mr. Adams, Mr. City Attorney.'",
        "'speaker_3': 'On the substitute motion is the exception. And I'll obviously we'll look at the Los Angeles ordinance, but does that allow the sampling of products within the store that contain nicotine?'",
        "'speaker_10': 'I'm I'm not going to craft it on the floor. I would leave it to you.'",
        "'speaker_3': 'To is it your desire to have it allow for nicotine or not? I'm not sure what it is that you're asking us to craft.'",
        "'speaker_10': 'I don't believe that they are allowing nicotine, but I may be incorrect.'",
        "'speaker_9': 'Jerry.'",
        "'speaker_4': 'Hold on here.'",
        "'speaker_9': 'We're. Give us. Give us just that. 10 seconds to an audience.'",
        "'speaker_4': 'We don't even know what it says.'",
        "'speaker_9': 'Okay, so let me actually. You don't know if this is done for 1/2. Actually, the jury actually still has the floor. What just happened now is Councilmember Andrews is going to accept that as a friendly amendment. Okay. So that is the with only councilman shift gears pulled her substitute from the floor and we now have a motion'",
        "'speaker_9': 'on the floor, from what I understand, and someone correct me if I'm wrong, but there's a motion on the floor to essentially adopt the ordinance we have in front of us with with the carve out that you would be you would be able to have within the stores have vaping with a 18 and over provision that I'",
        "'speaker_9': 'get that correct. Mr. CITY.'",
        "'speaker_5': 'That's.'",
        "'speaker_3': 'Correct.'",
        "'speaker_8': 'But I guess my my question still is, are you allowing the testing of vaping with nicotine.'",
        "'speaker_3': 'Or without nicotine or both?'",
        "'speaker_10': 'I would I would say without nicotine.'",
        "'speaker_8': 'I'm just asking so I can come back.'",
        "'speaker_3': 'And get you what you'd like.'",
        "'speaker_10': 'Because obviously, if you utilize nicotine that they get, then it goes back to the classification of a cigaret. Okay. And that's that's I'm just just saying that. So I would say without nicotine.'",
        "'speaker_9': 'Okay. So that's the motion that would have been accepted by Councilmember Andrews. I do have a speaker's list, so why don't we get through some of these? Did you have a comment first, Mr. Andrews?'",
        "'speaker_2': 'This should be. I want everybody back next week.'",
        "'speaker_9': 'Okay. And Mr.. Mr. Andrews would want that want this brought back next week. Mr. City Attorney.'",
        "'speaker_3': 'We can do that. We can bring it back for first reading next week.'",
        "'speaker_9': 'So I think he wants it to be on the.'",
        "'speaker_8': 'Agenda for coming out on Friday.'",
        "'speaker_9': 'So he would want it on consecutive week. So there's no one week after the other. Is that correct, Liz? Okay.'",
        "'speaker_3': 'It'd be based on the council schedule. Yes.'",
        "'speaker_9': 'Okay. Councilman O'Donnell?'",
        "'speaker_4': 'Yeah? Why don't we go over the motion and let's not reference Los Angeles? That's all we've been told is they did something today and we don't have any evidence of what they did. So let's let's decide what we want to do here tonight.'",
        "'speaker_4': 'Could I have a reiteration of the motion, please?'",
        "'speaker_9': 'Mr. City? Attorney.'",
        "'speaker_3': 'Vice Mayor, members of the Council, my understanding is that tonight it's recommended that the city attorney amend the previously considered ordinance to create an exception of sampling of the product and those only those products without nicotine within the stores, and that the remainder of the motion would remain as written.'",
        "'speaker_4': 'Okay. And Mr. Andrews, you're okay with that? Yes.'",
        "'speaker_3': 'You are.'",
        "'speaker_2': 'Okay. Definitely.'",
        "'speaker_9': 'Okay. JOHNSON Bravo.'",
        "'speaker_7': 'Anthony Thank you, Mr. Vice Mayor. I am wondering if staff can let me know how many of these establishments do we have currently in the city? Do we know?'",
        "'speaker_9': 'Do we have a report from staff on this?'",
        "'speaker_8': 'We'll see if Dr. Kirshner knows. As Mayor and council, to my understanding. And of course, these businesses are opening up regularly. But the last count there were at least.'",
        "'speaker_3': '18.'",
        "'speaker_11': 'Vape shops within the city of Long Beach. At the last reading.'",
        "'speaker_9': 'It was okay. Councilmember Lowenthal.'",
        "'speaker_7': 'Thank you. I'm wondering from the city attorney, in terms of enforcement of this newly amended motion, how would we enforce that other than other than incurring additional costs from our health department staff? And I see them. Mr. Kushner and Dr. Kushner can attest to that.'",
        "'speaker_3': 'Vice Premier Members of the Council. Councilmember Lowenthal. You're correct. This will create.'",
        "'speaker_8': 'An enforcement issue.'",
        "'speaker_3': 'Because in just observing a product being sampled, we will not know whether there's nicotine in that product or not. So from a practical standpoint, it's going to create, I believe, an enforcement issue for the council. We would have to rely on the operators to for their compliance and I guess, testing of that product at some point.'",
        "'speaker_7': 'Thank you, Mr. City Attorney. I just want to caution all of us. I it's while well-intentioned, I do think it sets up a challenge when it comes to enforcement and projecting that we aim to do something, but not really being able to do it, I think is problematic and not really the best direction for us to take'",
        "'speaker_7': 'if we're acknowledging that we're not able to really enforce it without throwing resources at it. And I don't know that we've committed here to throw resources at it.'",
        "'speaker_9': 'Thank you. To go back to Councilmember Andrews.'",
        "'speaker_2': 'You know, I.'",
        "'speaker_5': 'Can't.'",
        "'speaker_2': 'I hear you totally on that because of the fact that we I don't see us having that form of resources at this point, because if it's 18, it could be way more. It could be much more than that.'",
        "'speaker_2': 'And trying to have the resources to be able to enforce those. You know, I think it's going to be very, very hard to do. And I just.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'You know, I think this is going to be something that we're really going to have to take some more time on this because I just don't see us getting through this. I but I want to do it. And I think we want to do it right.'",
        "'speaker_2': 'I just want to come back. What I don't want to have to hear here are these individuals, you know, the people who got up and gave their you know, but I think that we have a doctor over here.'",
        "'speaker_2': 'We're not doctors. We're just giving our opinions. And when a doctor tells you certain things and I hate to come back and at the end says, Well, look, I told you so, you guys, this is a very important issue.'",
        "'speaker_2': 'And we talk about vaping. What do we know? Okay, what is vaping? We know what smoking is. We wouldn't know what nicotine as we know tobacco is. But this is a situation I don't think we should get ourselves caught in saying, oh, okay, because the public says, oh, this is that and about business, we're going to have'",
        "'speaker_2': 'to do it. I think we have to do it right and only way to do it right. I think we're going to have to listen to what the professional people are talking about and the doctors at attorneys based things.'",
        "'speaker_2': 'I just think we have to kind of take more time, look at what we're going to do here. And and if we do, we just have to do it and do it right. And that's the only way I think we're going to do it is get more information from this.'",
        "'speaker_2': 'So I don't know what we are at this point.'",
        "'speaker_9': 'So I think I think where we are right now is we do have we do have a motion on the floor. I have two other speakers. So let me get to these speakers and then count and then we'll go back.'",
        "'speaker_9': 'Councilmember O'Donnell.'",
        "'speaker_4': 'So the the vape shops would be the number of vape shops along which would be uncapped. Right. Yet we've capped cigar lounges.'",
        "'speaker_9': 'Mr.. Mr.. West.'",
        "'speaker_4': 'You're, you were adamant that we cap the number of those. Right. So I'm wondering why tonight we're now going to see these uncapped.'",
        "'speaker_3': 'There's nothing in the world this evening, right? I get it.'",
        "'speaker_9': 'I got some Boston.'",
        "'speaker_4': 'Your first time. I'd like to. I think we've had a good, good discussion here. This is this issue has been before us for at least a couple of weeks now. I think we are all a little bit more informed about the issue than when we first started.'",
        "'speaker_4': 'This is one of those evolving issues that we don't necessarily know all the answers to. And I think that's pretty clear. I think Mr. Andrews or Councilmember Andrews was right on point in his assessment, but I think the meat of the ordinance is still intact.'",
        "'speaker_4': 'I mean, this this provision prevents vaping in public places. It keeps it keeps vaporizing devices and it prohibits the sale of vaporizing devices to to children and underage. I mean, we I think we're accomplishing most of what we're setting out to do by allowing these vaporizing devices to be used inside of the places where they're sold.'",
        "'speaker_4': 'I don't think that we are doing anything to harm public health because the individuals that are in there are have made the individual choice to use vapor in vaping devices. And so there's no there's no secondhand exposure. There's no anybody that that is going to go inside of one of these these establishments knows exactly what they're going'",
        "'speaker_4': 'in there for. And so, like I said, I think the meat of your ordinance is is is intact. I think you're right. We do need to take some time. And it looks like we're going to do that, hopefully, if we support this amendment this evening to take a little bit more time to get it right.'",
        "'speaker_4': 'And so I commend you for for bringing this forth. And I think a lot of it is going to be better for it.'",
        "'speaker_9': 'You have a couple more speakers. Councilmember Lowenthal.'",
        "'speaker_7': 'Actually, I can wait until Councilmember Andrew speaks.'",
        "'speaker_9': 'To Councilor Lipski.'",
        "'speaker_10': 'You know, I understand we're all concerned about enforcement, but, you know, it is illegal to sell cigarets to minors. It happens all the time in Long Beach. It's not right. We don't enforce that to the fullest. In fact, the report just came out that we're a little bit short of how we go out and enforce on that'",
        "'speaker_10': '. So recognizing there's difficulties in enforcement for everything. My concern is that we do actually. Mr. Ralston, I think you just are taking it very well. I just think that this gives an opportunity to regulate where we need to, but to acknowledge that this is a different type of product and that we don't want to take adults from'",
        "'speaker_10': 'being able to have their business and do it in a responsive, wise, responsible way, particularly if they do it for anyone over 18.'",
        "'speaker_9': 'Councilmember Andrews You.'",
        "'speaker_2': 'Know, I think actually kind of going through this tonight and listening to the, you know, the doctor on this, I'm going to reject the friendly motion. I'm going to go back to the original motion and and just leave it at that because it's the way I came in with and this is the way I'm going to deal'",
        "'speaker_2': 'with it. And we can vote either up or down on it and let it be like that. And that's the way I'm going to deal with it.'",
        "'speaker_9': 'Okay. So there the friendly was not accepted. So we're back to the original motion and your substitute was withdrawn. So what it was. So that's where we are right now. So, Councilman Lowenthal.'",
        "'speaker_7': 'Thank you, Mr. Vice Mayor. And I wanted to thank Councilmember Andrews for reverting back to the original motion. I certainly support that. I think the difference initially we had this conversation about cigar lounges. The difference is there is a limit to the number of these lounges, and that could change at any time with the new council, certainly'",
        "'speaker_7': '. But for now there is a limit, whereas with these establishments there is not. And I appreciate if anyone is able to quit smoking as a result of it. I think that does happen. But if the intent is to quit smoking, I don't know that sampling is necessary.'",
        "'speaker_7': 'That's a conviction that someone has is to quit smoking. And I don't know that they require a sample to do that. That's a personal conviction. It's a health oriented conviction. Therefore, it's I'm not convinced that samples are necessary to promote that.'",
        "'speaker_7': 'And so I all in support of anyone attempting to quit smoking through whatever methodology. But certainly I am in support of this item. And I thank Mr. Andrews, Councilmember Anders, for bringing this forward.'",
        "'speaker_9': 'Okay. There no other motion on the floor. So we have the main motion. And the main motion just to repeat it is to approve on a second reading the the approval on the second reading the ordinance that's in front of us was presented.'",
        "'speaker_9': 'Correct. Mr. City Attorney.'",
        "'speaker_3': 'That's the motion on the floor at this.'",
        "'speaker_9': 'Time. Okay. I have one more counts in Boston.'",
        "'speaker_4': 'Well, I like to offer a substitute motion, and that will go back to the original. The amendment. I'd like to have that at least voted on. And that would be to allow for. Can you read me what that original.'",
        "'speaker_4': 'The original.'",
        "'speaker_8': 'Substitute motion as made.'",
        "'speaker_3': 'By council memberships key was to adopt the to direct the city attorney to amend the ordinance before you this evening and bring it back for first reading next week with the ordinance in a to create an exception for the testing of product within the stores with testing within stores of the products, without nicotine with an ID check'",
        "'speaker_9': '. Wound care. There's been a motion and a second. Councilman Lowenthal.'",
        "'speaker_7': 'That's okay. I'd just like to urge my colleagues to vote no on that substitute. Substitute?'",
        "'speaker_9': 'Cancel Boston.'",
        "'speaker_4': 'And then I just want to just go back to the the inconsistency of this council, because we talk about this enforcement issue, and it was the same same argument was made regarding another issue, fireworks just a few weeks ago in terms of the lack of enforcement over something that we can't deal with.'",
        "'speaker_4': 'And so this is the same same issue. When we deal with the nicotine issue, we're creating an enforcement issue. And you guys articulated that very well. I just wanted to bring that to your attention.'",
        "'speaker_9': 'Okay. We're about to get to a very last comment that will go to a vote, just as a reminder to everyone that like every ordinance that we pass, there's always information that's coming in and all ordinances can be changed or adapted as we move forward.'",
        "'speaker_9': 'And so on. Any given Tuesday ordinances can be can be moved forward. So we have the substitute motion on the floor, which is by Councilmember Austin, and then then we'll take a vote on that item first.'",
        "'speaker_1': 'Motion fails. Four votes to no. Five votes no.'",
        "'speaker_9': 'Main motion, please.'",
        "'speaker_1': 'It's the second. Just a minute, please. Sorry about that. Okay.'",
        "'speaker_9': 'Main motion in motion, please.'",
        "'speaker_1': 'Please cast your vote.'",
        "'speaker_3': 'Larry, could you check that vote again, please?'",
        "'speaker_1': 'These were councilman chips key.'",
        "'speaker_9': 'I think you're looking at the wrong screen.'",
        "'speaker_4': 'Steve.'",
        "'speaker_7': 'That Garcia's on the bottom.'",
        "'speaker_9': 'Councilmember asked that they change that. Yeah.'",
        "'speaker_1': 'Mayor and Councilmember Neal.'",
        "'speaker_9': 'Oh, no, no, no. You're fine.'",
        "'speaker_1': 'Yes. He voted yes.'",
        "'speaker_9': 'Okay.'",
        "'speaker_1': 'Okay.'",
        "'speaker_9': 'Okay. We're on the main motion right now.'",
        "'speaker_1': 'Please cast your vote. It's easier. Passage nine vote.'",
        "'speaker_11': 'Yes.'",
        "'speaker_9': 'Motion carries. Next item, please.'",
        "'speaker_1': 'We are done and we're not. I'm sorry. New business. Sorry about that. Sorry about.'",
        "'speaker_0': 'That. Not your new.'"
    ],
    "Recommendation to request City Manager to prepare a letter in support of Assembly Bill 1839 (Gatto/Bocanegra) also known as the California Film and Television Job Retention and Promotion Act.": [
        "'speaker_1': 'Business. That's right. Item 23 is a report from the Office of Councilmember Patrick O'Donnell, Councilwoman Geri Sheepskin Councilmember Stephen Neil with a recommendation to request city manager to prepare a letter of support for Assembly Bill 1839, also known as the California Film and Television Job Retention and Promotion Act.'",
        "'speaker_11': 'It's on the calendar.'",
        "'speaker_9': 'Joining us over to Councilmember O'Donnell.'",
        "'speaker_4': 'Thank you. I take council I ask you to weigh in in support of AB 1839. That's the California Film and Television Job Retention and Promotion Act. Since the late 1990s, film production has been lured from California to other states.'",
        "'speaker_4': 'Louisiana being a key state that has been stealing our our jobs, our film production. In 2009, the state legislature passed the California Film and Television Tax Credit Program to promote film production and create and retain jobs in California.'",
        "'speaker_4': 'Tonight, we ask that you support a rebooting and revamping of that effort by supporting AB 1839. California's current incentive program is one of the smaller programs nationally, and expanding it will allow for more jobs and tax revenue to be created in California and actually in Long Beach, because we are a very film friendly city and consider it'",
        "'speaker_4': 'our job to act as a partner with our region to keep the film industry in California, tax revenue generated from filming helps to pay for teachers, police officers and infrastructure throughout the state. So Council, I'll make a motion that we weigh in in support of AB 1839 to keep quality jobs in California.'",
        "'speaker_10': 'So second.'",
        "'speaker_9': 'There's been a motion and a second, any public comment on the item, please?'",
        "'speaker_5': 'Patrick Kelly, Teamsters Local 952 Joint Council 42. We strongly urge support of this. I think most of you saw the article in the L.A. Times the other day that 16,000 jobs have been lost in California alone over the last several years.'",
        "'speaker_5': 'New York State is providing between 400 and $500 million in film credits to basically raid California. So whatever you can do to encourage and keep film production here is great. Thank you.'",
        "'speaker_9': 'Councilmember Neill, did you have a comment? Okay. There's a motion on the floor and the other public comment. Who made the second councilman. Okay, great. All right, so let's go and take a vote.'",
        "'speaker_1': 'Councilmember Andrews, please. Councilor Dylan. Motion carry symbol? Yes.'",
        "'speaker_9': 'Okay. I think those are last item. So we're going to go ahead and move on to new business. Kathryn Brosnan No.'"
    ]
}