{
    "Recommendation to approve the expenditure of $20,000 as a reward for information helping to solve the murder of Carina Mancera and Jennabel Anaya on August 6, 2016.": [
        "'speaker_3': 'Great. Thank you. Also, we have a continued public budget hearing tonight for health parks and public works and we're going to take item 28 and 20 to start and then we'll go right into the budget hearing. So, Madam Clerk, if we can start with item 28, please.'",
        "'speaker_0': 'Report from Mayor Garcia and Councilwoman Gonzalez recommendation to approve the expenditure of $20,000 as reward for information helping to solve the murder of Karina Mansehra and Jenna Bell Aniya on August 6th, 2016.'",
        "'speaker_3': 'Thank you, Madam Cook. My computer is not working, by the way, so someone can. Can I get a motion in a second? Just. I'll just say briefly. We know that we had an incredible tragedy not that long ago with these two members of our community that were very tragically shot, particularly the little girl, four years old, and'",
        "'speaker_3': 'her mother as well. This is this $20,000 reward matches the county's reward, which also passed today. And it's what we've been discussing with the police department. So I might turn this over to Councilman Gonzales.'",
        "'speaker_5': 'Yes, I, too, just want to say I extend my gratitude to our Long Beach police officers. I know they're working very hard to ensure that we bring this person to justice. I also would like to thank our Board of Supervisors, specifically Supervisor Don Carnaby.'",
        "'speaker_5': 'I know his work in this was very helpful in allowing us to obtain this reward. So thank you very much.'",
        "'speaker_3': 'Thank you. There's a motion and a second. Any public comment on this item? Seeing none. Members, please go ahead and cast your votes.'"
    ],
    "Recommendation to declare the City-owned property, identified as North Village Development Blocks C and D, and classified as Future Development in the Long Range Property Management Plan, located along Atlantic Avenue between South Street and 60th Street, Assessor Parcel Numbers 7125-033-900 through -923, 7124-017-900, -901, -902, and 7125-034-900, -901, -902, (collectively, Future Development Properties), as surplus, authorize City Manager, or designee, to execute any and all documents necessary, including a Purchase and Sale Agreement, with The LAB, Inc., a California corporation (The LAB), for the sale of the Future Development Properties in the amount of $2,580,000;   Authorize City Manager, or designee, to execute any and all documents necessary, including one or more leases, with The LAB, for the lease of City-owned properties located at 5834 Atlantic Avenue, 5870 Atlantic Avenue, 5885 Lime Avenue and 5895 Lime Avenue, and identified as Government Use in the Long Range Property Management Plan, excess to the needs of the Michelle Obama Neighborhood Library, Assessor Parcel ": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you. Next item is item 20.'",
        "'speaker_0': 'Report from Economic and Property Development and Development Services. Recommendation to declare the city on property located along Atlantic Avenue between South Street and 60th Street as surplus. Authorize the city manager to execute all documents necessary with the lab for the sale of the future development properties in the amount of 2.5 million and execute all documents necessary with'",
        "'speaker_0': 'the lab for the lease of city owned properties located at 5834 Atlantic Avenue, 5870 Atlantic Avenue and 5885 Lime Avenue and 5895 Lime Avenue districts eight and nine.'",
        "'speaker_3': 'Thank you. We're going to hear a staff report in just a minute. The reason we're moving this up as well is I want to make sure the council gets a chance to join me in thanking Mike Conaway, who is, as you all know, leaving us.'",
        "'speaker_3': 'And this is probably Mike's I know he does not want me to do this. And he specifically asked not to, but I just think it's really important that we know that Mike's been with the city for a long time and he's really committed himself.'",
        "'speaker_3': 'These properties and the selling of the properties and the dissolution of RTA could not have been hap could not have happened the way they've they've had it not been for Mike's work. He's been incredible with the Economic Development Commission.'",
        "'speaker_3': 'He's been a great friend to a lot of us. He understands real estate better than anyone in the city, and it's going to be a real loss to us. But we're just very excited for his his next adventure.'",
        "'speaker_3': 'So let's give him a round of applause, first of all. And with that, Mike, please, this amazing deal you put together here.'",
        "'speaker_6': 'Thank you, Mayor Garcia, members of the City Council. This item relates to the sale of former redevelopment property located along Atlantic Avenue corridor in Council District nine, including property that was previously approved for sale by the successor agency, oversight Board and State Department of Finance in Council District eight.'",
        "'speaker_6': 'Lab Holding LLC is a Costa mesa based developer of synergistic and boutique restaurant and retail destinations, focusing on historic preservation, environmental sensitivity, eclectic art and support of local and small businesses. The Lab Holdings projects include the Anti Mall, the Anaheim Packing District, the center and the camp.'",
        "'speaker_6': 'We have a few visions on the screen here of a few of the projects that the lab is has developed, and these include the Anaheim Packing District. A few visions from the Anaheim Packing District also includes the camp, which is another development in Anaheim.'",
        "'speaker_6': 'Again, a very eclectic and small business oriented development, and then the downtown Center Street and Anaheim as well. Having this type of a development as a village center concept in North Long Beach, I think will be an incredible economic impact for the for the area.'",
        "'speaker_6': 'And the lab intends to seek approvals to develop the former RDA properties into a North Village center, which has long been contemplated in the guiding documents of the North Long Beach Project area. Staff believes that the lab development will be a significant economic engine and a catalyst to additional investment and job generation and revitalizing the Atlantic Avenue'",
        "'speaker_6': 'corridor in North Long Beach. Purchase price is based on accommodation of fair market value for the for sale property in Council District eight and land residual value for the future development property in Council District nine. The land residual value applicable to the future development property in the long range property management plan allows the city to utilize an'",
        "'speaker_6': 'alternative appraisal methodology in order to reflect the land value necessary to support the contemplated project. This is not a city subsidy, but instead a calculation of the land value required to achieve project economics. The lab also seeks to lease government use properties, access to the needs of the new Michelle Obama Neighborhood Library in order to better activate'",
        "'speaker_6': 'these properties as well. The lab is prepared to proceed to acquire the property, with the city holding a promissory note through the entitlement and construction period, allowing the lab to generate a stabilized cash flow sufficient to refinance construction costs and pay off the note after 120 day due diligence period.'",
        "'speaker_6': 'The lab will acquire the property and begin its entitlement efforts so staff request city council declare the property surplus. Authorize City Manager to execute all necessary documents for the sale of the future development property and the lease to the government.'",
        "'speaker_6': 'Use property and accept categorical exemption. C 16 dash 190 in this concludes my staff report and I'm available for questions.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. First, I want to just acknowledge Mike Conway in the last two months. He's, you know, successfully moved forward on helping the city to encumber every single former successor agency redevelopment lot in District nine. And I have to say, the fact that tomorrow is his last day, this is a this is a strong way'",
        "'speaker_7': 'to finish. This is a really exciting project. I'm really, really happy to see how he was able to use different techniques that were in the land land long range property management plan to incentivize three different types of properties for sale in District eight, the Future Development District nine and the government use to really prepare and situate a'",
        "'speaker_7': 'comprehensive development anchored by the Michelle Obama Library spanning two districts and really a representation of what we've been talking about for a number of years, the Uptown Renaissance. So I can't say this enough. This would not we would not be in this position without Mike Conaway.'",
        "'speaker_7': 'This is a very innovative approach. We did not know whether this could happen and we made it. We made it happen. So I'm really excited to take this vote tonight. I want to say that this is this is the again, the third of three developers on the North Atlantic corridor.'",
        "'speaker_7': 'So we voted to bring in West Linn two weeks ago. We brought it brought voters to bring in Frontier and now it's rounded out with the lab. And we I don't believe we could have found a better developer to complement what we're trying to accomplish here in District nine.'",
        "'speaker_7': 'So I want to acknowledge city staff one announced, acknowledge Councilman Austin for putting, you know, assembling all the for sale properties the way that they did. And I can't wait to see this exciting timeline that's spelled out in this in this motion.'",
        "'speaker_7': 'And I encourage my colleagues support this motion.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'Well, I, too, will be supporting this motion for obvious reasons. This is great news for for uptown, more specifically for the residents who have been waiting for many, many years for something to happen to make the north part of our city relevant.'",
        "'speaker_8': 'And this has been a long time coming. It has been it was very frustrating to sit here for several years. And and when the redevelopment process was unwinding and we could not do anything with those properties. To to work on the state led committee and to lobby in Sacramento.'",
        "'speaker_8': 'To. To get the Department of Finance to approve our land management plan. Once that was done for sale properties were in our storefronts were actually there was interest there was immediate interest in private developers developing those properties. And I can't think of a better, better developer to work on the North Village than the land holdings.'",
        "'speaker_8': 'I had the opportunity to to to welcome Mr. Shaheen Sadeghi, the the principal of the lab to to North Long Beach, and walked him around North Village. And he looked at other opportunities. And and today we have a deal in front of us that is a, I believe, a game changer for Uptown and for all of Long'",
        "'speaker_8': 'Beach. This will make our neighborhood stronger. This will make our city stronger. And so I'm happy to support this. And and congratulations again, Mr. Conway, for your efforts, your strong negotiation skills, being innovative to to make this this deal work.'",
        "'speaker_8': 'I think, along with the Civic Center, this will be a crowning achievement in your career. Thank you very much for your efforts. And I do encourage I vote as well.'",
        "'speaker_3': 'Thank you, Councilwoman Price.'",
        "'speaker_5': 'I want to just echo what my colleagues have already said. This sounds like a really exciting project. And I'm I'm very excited for my council colleagues who are going to be welcoming this new addition to their district. I've visited some of the venues that you put up there as I work in Orange County and fantastic.'",
        "'speaker_5': 'I think they're going to do really well in Long Beach and I support this 100%. And thank you, Mr. Conway. You are totally awesome. We're going to miss you.'",
        "'speaker_3': 'Thank you, Councilman. Mongo.'",
        "'speaker_0': 'I want to take this opportunity to thank Mr. Conway for all that he's done for this city. It has been an amazing opportunity to work with you. The amount of knowledge and history of property and development and everything else that you have about this city is remarkable.'",
        "'speaker_0': 'And I hope that we'll see you back often because all of these things you started, there will be many ribbon cuttings to come.'",
        "'speaker_3': 'Councilmember Pearce.'",
        "'speaker_4': 'Thank you. I want to first just congratulate council member Austin and Richardson, Vice Mayor Richardson, on the transformation that you guys have seen in your districts over the last ten years. It's amazing. You guys talked about the Renaissance and it happened really quickly.'",
        "'speaker_4': 'And so great job doing that. And definitely, Mr. Conaway, you've been an asset to me in my four weeks here, and I just really thank you for being creative. You've set the bar really high. So good luck.'",
        "'speaker_3': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_5': 'Congratulations to my council colleagues in North Long Beach. I think it's wonderful that we'll be having this amazing new development. And I also wanted to extend my appreciation to Mr. Mike Conway. I remember years ago you let me run around the old public service yard and we created amazing opportunities for the Willmore and so many different communities'",
        "'speaker_5': '. So thank you so many, so much for all of your hard years of work here in the city of Long Beach. Appreciate it.'",
        "'speaker_3': 'Thank you. Just to close this out in the media, turn over to Mr. West. He's going to say something as well. But let me let me just say one thing real quick, which is really important. I don't think people in the public don't know, but we sold over 255 parcels of land.'",
        "'speaker_3': 'That's a lot of parcels of land. The city of Long Beach had one of the largest inventories in the entire state of California. And obviously a lot of those parcels you put together to make a larger parcel. But regardless of the process to go through the state's approval and Councilman Alston is totally correct.'",
        "'speaker_3': 'The working with the Department of Finance for the last few years to roll out the the sell, selling and development of these parcels has been probably one of the larger economic development efforts that city has done in the last few decades.'",
        "'speaker_3': 'I will say that if you look at the last few months, Mr. Conaway has led efforts to sell and to sell off, I think almost every if not every parcel in the downtown area now, every parcel in the north Long Beach area.'",
        "'speaker_3': 'And I think we may still have some left in central and maybe a couple in West. But beyond that, all of the downtown and all of the north and some of the central have all been are completed. And that couldn't happen without without Mike.'",
        "'speaker_3': 'And now what we're going to get is hopefully great projects. We think we will in all of these sites. I just wanted to say also one thing about this developer and this project. I think this is one of the most exciting things that happened in North Long Beach in a really long time.'",
        "'speaker_3': 'This if you know, if you're familiar with the lab holdings, if you're familiar with with the camp development or the anti mold development or the Anaheim Packing District, these are really creative and unique spaces in other communities. And the fact that these these developers want to work in Long Beach in a way that's creative and community centered'",
        "'speaker_3': 'is very exciting for for for the North. And this is this Lab Holdings megaproject, which is really a lot of smaller projects that they're building. A community will dramatically impact both District nine and District eight. I mean, there's properties right there along along that border.'",
        "'speaker_3': 'And so I want to thank them for investing in Long Beach and look forward to all of this activity in the next few years ahead of us, which will be pretty exciting.'",
        "'speaker_6': 'Mr. West Mayor, Councilmembers. This is just all about Mike. I've had optioning work with Mike since 2005 and I've learned a lot from him. I'm not going to go on and on about the fantastic stuff that he's done for our community.'",
        "'speaker_6': 'But I do want to say that if Michael Conway was a swimmer and he's not, he would have more gold medals and Michael Phelps. So there you go. And with that, to get to a transition, I want to recognize we're bringing on board an interim economic development and property manager director.'",
        "'speaker_6': 'She'll start tomorrow as well. Her name is Catherine McDermott. Catherine, if you could stand and wave. So Catherine comes to us from the port of Long Beach, where she worked for about 15 years or ten years. I'm not which not sure which.'",
        "'speaker_6': 'And then she went over to the Port of Los Angeles, and she was the number two executive director at the Port of Los Angeles for some time there. And she is a real estate expert, an economic development expert, lives in Long Beach.'",
        "'speaker_6': 'And while she's retired, she'll come out of retirement to go in Michael's stead until you replace a full time economic development director, hopefully in the next two months. Thanks, Catherine.'",
        "'speaker_3': 'Thank you. Welcome as well. Thank you. Without any public comment on this item, please come forward.'",
        "'speaker_0': 'Good afternoon, Mayor Garcia. Council Staff Attendees. My name is Tasha Hunter and I'm the manager of the Uptown Business Improvement District, and I'm going to see how many times I can not see excited up here or how many times I'll say excited.'",
        "'speaker_0': 'I'm very excited about this development. We all are. The community, the businesses, they've all been asking when it's going to happen. And so I think second to the day actually break ground. This is one of the most exciting times.'",
        "'speaker_0': 'And we look forward to the bid. Looks forward to working with Labbe to talk about what's going to happen in the future, how we can help them continue to protect their investment with talk about employment and marketing and being the liaison between the city and and the community.'",
        "'speaker_0': 'Let's see. Even though we have to move out of our office, we're excited. This is a great reason to have to move out of our office because they're coming in and we're excited to get into our new space and watch this process.'",
        "'speaker_0': 'Just want to say thank you to city manager, to Mike Conway, to Councilman Austin, as well as Vice Mayor Richardson in this whole entire process and including the bid. It's been five months for me in there and it's been a great learning process.'",
        "'speaker_0': 'So please vote yes and congratulation. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, Josh Butler with Housing Long Beach and congratulations.'",
        "'speaker_6': 'To the ninth district in the eighth Council District. This is something that will be great for the community. I do want to once again want to point out that this is a the.'",
        "'speaker_2': 'Sale of surplus land and that according to the state law, the Surplus Land.'",
        "'speaker_6': 'Act and conversations I've had with city.'",
        "'speaker_2': 'Staff are we are to be prioritizing the sale of this property for affordable housing development.'",
        "'speaker_6': 'That doesn't necessarily mean that council.'",
        "'speaker_2': 'Or a staff has to select development for that property, but we ought to be reaching out to our affordable housing developers, notifying them of the property and accepting any bids and entering into good faith negotiations. If they do submit said bid, if their bid is not accepted, an affordable.'",
        "'speaker_6': 'Housing development is chosen. Such is not the case here. 50% of those units would have to be set at affordable rates. Now, the mayor has referenced the sale of 255 parcels. We would encourage the council to be proactive and reach out to affordable housing developers and put them on that priority list.'",
        "'speaker_6': 'We understand that it is incumbent upon the affordable housing developers to request to be put on that list. And to date, no developers have made such request in speaking with them. They are unaware. They are unaware of this.'",
        "'speaker_6': 'They are unaware that they need to make a request. And so as we are reaching out to them to have them put letters in or we would encourage the Council to be proactive and reach out to those developers and.'",
        "'speaker_2': 'Start moving forward.'",
        "'speaker_6': 'And honoring the Surplus Land Act and making sure that we're prioritizing.'",
        "'speaker_2': 'A major need in our community, which is the need for affordable housing. And I thank you very much.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Good. You click as the address. Let me begin by thanking the actually the city clerk for coming up with a new filing system that makes it very easily now. She, as most people may know, the agenda is up, posted on a table there.'",
        "'speaker_9': 'And it used to be on a paradigm that was very difficult to get inside of and look at all the details where the devil is often found. Now they have an easy thing set for tabs. You can do it.'",
        "'speaker_9': 'Development as I looked through that. To me, the biggest. Missing point piece. Is any analysis by our city auditor. Period. And I think that automatically raises a red flag. And what raises a red flag even further. Is the absence of a process where you follow what most.'",
        "'speaker_9': 'Municipalities, states, counties, governments do when they have excess property, they advertise it and say and essentially say, say, we're going to be selling this property and x date x tower. The guy with the biggest cashier's check that'll pass the bank, clear the bank gets it.'",
        "'speaker_9': 'Absent that, what you've got, you're dealing more often than not. Not always. More often than not with hankie, panky, period. So I would suggest. That the best course of action for this city, the most prudent course of action for this city that is heading already on a road to bankruptcy.'",
        "'speaker_9': 'Is to hold this off and wait for an analysis from the city auditor. If it's that good a deal. A few weeks is not going to rock the boat one way or another. You have a fiduciary responsibility to act responsibly.'",
        "'speaker_9': 'The data in front of you shows that you have no analysis from your city auditor. So unless you've got something to hide. Vote to hold this off until you get a report from the city auditor. And then follow the process most other governments follow.'",
        "'speaker_9': 'Advertise it for sale on the courthouse step, giving the sale to getting the property to the individual that comes up with the largest cashier's check. Absent that, some of you may be cashiered from your job. Thank you.'",
        "'speaker_3': 'Thank you. Any other speakers? Please see nonmembers. Please go ahead and cast your votes.'",
        "'speaker_10': 'Councilmember peers.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to conduct a Budget Hearing to receive and discuss an Overview of the Proposed Fiscal Year 2017 Budget for the following:  Department of Health and Human Services; Parks, Recreation and Marine Department; and Public Works Department.": [
        "'speaker_3': 'Unanimous. Thank you very much. Congratulations to Vice Mayor Richardson and council member Austin. We're going to go now right into our budget hearing, which is the start of the meeting and then the rest of the meeting. So let staff get ready for that.'",
        "'speaker_3': 'And Mr. West will go through the entire presentation and then do questions at the end.'",
        "'speaker_6': 'Okay. We're going to go ahead and get started. Last week we had our first formal budget presentation reviewing departments. We had the police department at the fire department and disaster management. Today, we're going to hear from three of our departments.'",
        "'speaker_6': 'We're going to hear Kelly Colby, the director of our Health and Human Services Department. After Kelly, we're going to hear from Marie Knight, the director of our Parks, Recreation and Marine Department. And after that, we're going to hear from Craig Beck, the director of our Public Works Department.'",
        "'speaker_6': 'So with that, I just. Thank you. We just want to continue that to note that we are working on a public safety continuum. It's just not all about police and fire protecting our community and public safety areas. It's a lot of other departments.'",
        "'speaker_6': 'It's health and it's Health and Human Services. It's Parks, recreation and Marine keeping kids busy. It's public works, taking care of our streets and our graffiti and issues like that. Obviously, library services as well. Workforce development, code enforcement.'",
        "'speaker_6': 'So there's a myriad of activities that work to help support our public safety continuum and work with our police department to keep our community a great community that it is. So that I'm going to turn it over to Kelly.'",
        "'speaker_11': 'Good evening, honorable mayor, vice mayor and City Council Members. Thank you for the opportunity to present the budget for the Department of Health and Human Services. First, I'd like to recognize my team members. Who in the audience? Raise your hand.'",
        "'speaker_11': 'Raise your hand. All right. Who make of what we do possible? They're bright, committed, caring, and their team are so passionate about their work. I appreciate them fully and know that the Health Department would not be where it is today without them.'",
        "'speaker_11': 'I am truly lucky to be here. I'm going to share with you first some, of course, services. So the Health and Human Services Department provides over 30 programs in nine sites around the city. Together, these services focus on building and supporting healthy communities, families and individuals with pre-natal through old age.'",
        "'speaker_11': 'Many people connect us primarily with homeless services and restaurant inspections, but we do much more. We promote healthy living through many of our programs, including healthy, active, Long Beach, the Hills Zone, Rick, and our public health nursing. We increase safety of neighborhoods, homes and businesses through our environmental health programs, as well as our strengthening families efforts at'",
        "'speaker_11': 'the Center for Families, Centers for Family and Youth. We provide housing and homeless services, work closely with our city, federal, state and local partners to prepare for public health emergencies. We increase access to health care and community supports and prevent, investigate and control communicable diseases through epidemiology, disease, investigation and clinical services.'",
        "'speaker_11': 'We have a diverse list of accomplishments this year. As you know, we achieved public health accreditation, demonstrating our superior level of service. We were the third local health department in California. Out of 61, only 5% of health departments nationally have achieved the status.'",
        "'speaker_11': 'We provided over 350,000 public health visits this year, all at free or no cost to do theirs. We brought in we brought in over $96 million of funding from outside of our city. This provides 225 jobs in the city.'",
        "'speaker_11': '60 million of this funding actually goes back to the community through the housing authority and rent payments to move to apartment owners. We really are an economic driver. We became the only California public health lab to receive our and molecular accreditation, which allows for a significant decrease the amount of time for testing results for Zika, other infectious'",
        "'speaker_11': 'diseases and bioterrorism. It went from days to hours for when we can get results. We had 498 homeless veterans and met the HUD benchmarks for functionally ending veteran homelessness, a level we've been trained for nine months. We work closely with city partners and public works and development services and other community partners to complete the pedestrian master plan'",
        "'speaker_11': 'to the Communities of Excellence and through Kaiser and the Office of Traffic Safety Funding. We implemented bike safety courses and a bike hub in North Long Beach, where youth learn to maintain bikes, receive free helmets. We were awarded a $5 million fatherhood grant, which allows us to work with over 500 fathers to become better parents.'",
        "'speaker_11': 'We opened the Section eight waitlist for the first time in 13 years, received over 18,000 applications for vouchers and over 14,000 more applications for project based sites. Finally, we led planning efforts for a large scale four day bioterrorism exercise that included many partners in the city and other government agencies.'",
        "'speaker_11': 'Our budget is just over $114 million. 61% of that comes from HUD for the Housing Authority. 30% 37% is health fund, which includes funding from grants, fees, sales tax and vehicle licensing fees. 1% comes from Cooper, which was previously discussed by the Health Department's presentation, and 1% comes from the City General Fund.'",
        "'speaker_11': 'This all turns out that we leverage about $1.4 million in city funding to bring in $114 million in resources, which is about an 8,043% return on investment. Our notable changes this year focus on homeless services, internal changes, and broader public health trends.'",
        "'speaker_11': 'The Health Department continues to lead the homeless outreach efforts and partnerships to support homeless in the city. But our capacity does not meet the demand for outreach and services. We do have new funding this year, which includes $100,000 in one time funds for outreach and response activities and $250,000 for Infuse Fellow to help further our innovative strategies'",
        "'speaker_11': 'and identify innovative funding opportunities to help address homelessness. This is added to the $7.2 million we receive from Howard to fund our Continuum of care, which includes 12 community partners that provide case management, mental health services, transitional and permanent housing and so much more.'",
        "'speaker_11': 'Another 1 million come from other grants to support outreach, emergency shelters, homeless prevention and veterans supports. Other notable changes include reorganizing the health department programs to create efficiencies, enhance coordination. In the past, we focused on the different grants and how people access them separately.'",
        "'speaker_11': 'Our goal this year to align our services around individuals, beginning with the common intake process. They'll help determine all the programs they qualify for and to better coordinate those services. We're also redesigning internal administrative processes for efficiency and consistency.'",
        "'speaker_11': 'Public health. Public health at the national level is changing. It's focusing more on the social context that impact health, such as housing, violence, prevention, trauma, environment and education. This requires significant partnerships as it takes all of us to address these issues.'",
        "'speaker_11': 'It also takes reviewing policies and programs through an equity lens to ensure we are building and supporting improve health for those who haven't been supported in the past and who now experience disparate health outcomes. We are looking for also looking at improving data sharing strategies across hospitals and community partners to better connect people to the community supports'",
        "'speaker_11': 'they need to build and maintain their health. Our significant issues include the increasing concerns about homeless across the city, and I've discussed those resources in a previous slide. We face increasing external public health threats such as Zika and other vector borne diseases, bioterrorism concerns and climate change that's impacting our environment, access to food, the heat advisories and'",
        "'speaker_11': 'other things, just to name a few. We're constantly working to identify sustainable funding streams for existing and emerging priorities. We've lost funding for asthma and diabetes. Education have not found resources to support those programs moving forward. In addition, grant funding does not cover full administrative costs or increasing employee costs, which which leaves us running about 110 grants'",
        "'speaker_11': 'and sub grants and responding to over 100 program and fiscal audits annually based on grants. The lack of sufficient administrative resources actually limits our ability to build our grant base. We also face increasing facility cost to aging infrastructure, which is also not covered by grants.'",
        "'speaker_11': 'Often we hear we can fund it through grants and we have been very successful at that. But it is not easy. If it were all work and all nonprofits would be fully funded. Funds, funds priorities shift and reduced and the competition continues to get steeper.'",
        "'speaker_11': 'In addition, writing and managing grants is very labor intensive. Grants are a great part of an overall funding strategy, but as the primary funding strategy, it can be very difficult. We are excited about the potential opportunities to build a more integrated system of services for older adults, as outlined earlier this year in the older adult strategic plan'",
        "'speaker_11': '. We'll be working very closely with Parks and Rec in this work. The potential move of violence prevention and equity efforts into the department is also an opportunity. At the national level, violence prevention and equity have become key focus areas for public health because of their impact on overall wellness and communities.'",
        "'speaker_11': 'In addition, we're participating in many conversations about increasing opportunities to avert people with mental illness from criminal justice settings to treatment settings so that they'll be safer and served in the right place. Finally, health departments nationally are moving toward the role of chief health strategist.'",
        "'speaker_11': 'More of the convener pulling together government agencies, hospitals, community providers and community members to improve health and wellness. We're being approached by a number of partners to take on this role, and we appreciate the opportunity in their trust they place in our work.'",
        "'speaker_11': 'In closing, thank you for your time this evening. The Health and Human Services Department looks forward to working closely with you to continue to build and support a healthy, safe and vibrant Longreach and village of Christians.'",
        "'speaker_3': 'Thank you. Next up is Parks and Recreation Marine.'",
        "'speaker_4': 'Good evening, honorable mayor and members of the City Council. It is my pleasure to present to you tonight the Department of Parks Recreation and Maureen's fiscal year 2017 proposed budget. This has been an incredibly successful and dynamic past year for us.'",
        "'speaker_4': 'And I want to thank the mayor, city council, the city managers and his office and his team, our partners and other city departments and as well as the community for all the support. The investments that are included in the fiscal year 17 budget will help our city continue to be recognized as a national leader in parks and'",
        "'speaker_4': 'recreation services. And even more importantly, we'll help the Parks and Recreation and Animal Care Services team that some of which are assembled here this evening, to continue to have a positive impact on Long Beach residents and visitors each day.'",
        "'speaker_4': 'So our core services, we are one of the most diverse departments. We go from pets to beaches, buildings to youth and turf and trees to seniors. And we touch the lives in every corner of our community. We provide for the maintenance of parks, facilities, open spaces, marinas and beaches to promote an active, healthy lifestyle and improve the'",
        "'speaker_4': 'livability of Long Beach. We take our role in the public safety continuum seriously and work hard to provide access to healthy recreation opportunities and safe environments for the city's youth. Teens, adults and seniors who visit our programs over 2 million times each year.'",
        "'speaker_4': 'We promote responsible pet ownership and the humane treatment of animals and work to reduce animal overpopulation. Our Animal Care Services is a 24 seven public safety and public health operation. As the largest municipally run marina system in the nation.'",
        "'speaker_4': 'Our goal is to make sure our facilities are excellent quality and exceed customer and community needs. And lastly, we continue to implement the city's open space plan with projects that expand community access to parks and facilities. So we had many accomplishments this past year with a focus on livability.'",
        "'speaker_4': 'We've increased our bike ability, swim ability and walkability with the installation of the Bayshore Buoy, swim line, bike, fix it stations and fitness zones across the city in parks, beaches and waterways. We completed over 5500 work orders, many coming from the Long Beach app in our parks and removed over 4000 tons of trash from our beaches.'",
        "'speaker_4': 'And we were again rated one of the 25 best park systems in the country. Additional strategic investments included renovations and improvements to Homeland Cultural Center, Willow Springs, Park Stearns Park, the playground at MacArthur Park and the Community Center and Pool at Martin Luther King Jr Park.'",
        "'speaker_4': 'Also, there were restroom projects at Bixby Recreation and a forest projects done this year. To further our efforts to use irrigation water and our water budget as efficiently as possible. The conversion of over 300,000 square feet of street medians from turf to mulch has started.'",
        "'speaker_4': 'Gun Boehner Park will be completed in the coming months and the DeForest Park Wetlands, Drake, Chavez, Greenbelt and the El Dorado Nature Center projects are just starting. And with the rebuild of the Alamitos Bay Marina well underway, staff is now focusing on improvements of the other Marina amenities.'",
        "'speaker_4': 'And we are marketing the new, larger slips that will soon be available. We also act as an incubator for hundreds of local, micro and small businesses through our contract class and structure opportunities. Demand for our recreation programs continues to grow this summer.'",
        "'speaker_4': 'Excuse me? This summer, our programs were either at or exceeded capacity across the board. And as the demographics in Long Beach shift towards a larger senior population, demand for senior services has also grown. Our Animal Care Services field staff responded to over 28,000 calls for service last year.'",
        "'speaker_4': 'As we work to ensure the safety of all of our residents two and four legged. Through the many community partnerships, spay and neuter programs and improved health care, the live release rate has continued to grow for another straight year.'",
        "'speaker_4': 'Partnerships within the community and outside funding sources such as with the LA Kings and Signal Hill Petroleum have allowed us to continue and enhance programs and services during fiscally challenging times. This past summer, the Long Beach Unified School District provided free access to youth at all city and school pools and free swim lessons at Cabrillo High School'",
        "'speaker_4': '. And once again, we teamed with the Long Beach Convention and Visitors Bureau to provide 100 days of summer program to increase the economic impact of the staycation concept and the impact of our programs. For our fiscal year 17, our proposed budget totals over $56 million across all funds, with 32 million in the general fund.'",
        "'speaker_4': 'The department also has substantial Thailand funds budgets to support our operations in the marinas, beaches and waterways. We have significant revenue streams to help support our many programs with general fund revenue of over 12 million and tidelands funds revenue over 24 million.'",
        "'speaker_4': 'The department is also significant also has significant grant funding for youth services of just over $2 million. This budget provides for 430 full time equivalent positions, and during our busy summer summer months, our total staffing complement grows to over 800 people.'",
        "'speaker_4': 'Each year we provide hundreds of area teens and young adults their introduction into the workforce through volunteer and employment opportunities. Some notable changes in this year's budget in order to reduce the impact to the community from any further critical program reductions.'",
        "'speaker_4': 'We worked hard to develop additional operational efficiencies and look for new service delivery models where possible. For example, we are reducing our mowing frequency and our turf areas during the winter months, saving approximately $60,000 each year. A reduction to administrative staff was made possible by leveraging technology to distribute information throughout our various locations more efficiently.'",
        "'speaker_4': 'We will also redistribute responsibilities in our sports field permitting program and in the supervision of the Long Beach Senior Center, resulting in some staff reductions. These reductions do not reduce recreation services, but will, however, reduce the amount of staff time available to interface with customers.'",
        "'speaker_4': 'Next, we look to make sure all of our programs are right sized by matching budgeted resources to the actual participation. The summer season of youth sports is historically the least attended, so reductions in this program will have the least impact to our city's youth.'",
        "'speaker_4': 'We were able to adjust areas of our budget for strategic investments for the future. For example, one adjustment that is offset by revenue is increased staffing at the El Dorado East Regional Park gates. Our General Fund budget was increased as well to help provide additional resources to maintain our parks and facilities.'",
        "'speaker_4': 'This included resources for City Council district funded improvements and to bridge the L.A. County Parks Tax Levy shortfall. In addition, we identified areas where a small investment will reap larger rewards by providing upgraded equipment for floor care in our 27 community centers and response to plumbing issues in our parks, as well as new equipment to more efficiently'",
        "'speaker_4': 'clean the Belmont Pier. As we continue to deal with the drought. One time resources were identified to further our water conservation efficiency efforts and provide emergency additional emergency tree care. The Be Safe program will be funded once again, and we will have the opportunity to build on previous successes, helping to keep youth and families engaged in positive'",
        "'speaker_4': 'and safe activities on weeknights during the longer daylight hours of the summer season. In the coming year, we will be working to increase efficiencies in animal care services and implement multi-year pet licenses for residents. Saving both staff resources and the customers time and the passing of the historic measure will allow us for long awaited and much needed'",
        "'speaker_4': 'repairs and improvements in our parks and to our many facilities. There are some significant issues and opportunities facing us in the year ahead. The Department will work to continue the investment in our parks and facilities throughout the city to increase the city's livability and safety.'",
        "'speaker_4': 'The identified projects for measure funding have a very aggressive goals in Year one and will require staff to dedicate significant amounts of time to complete the many, much needed projects. And we look forward to that challenge. The city's park trees have been hard hit by the drought.'",
        "'speaker_4': 'Their advancing age, lack of trimming and insect infestations and resources are now provided to start to address these problems. We will work to develop strategies to further impact these issues as we take as well as take action to address the recent audit findings within our current constrained resources.'",
        "'speaker_4': 'Future partnerships will also be critical with stakeholders to develop an innovative approach to address the challenges of homelessness, vandalism and an aging infrastructure and their collective impact on our limited staff and park resources. Our Animal Care services operations have come a long way and further investment will be needed to advance our progress in providing positive outcomes for'",
        "'speaker_4': 'shelter animals as well as those that we encounter in the field. The department sees great opportunity as well in continuing our efforts to seek partnerships with the community to enhance our service offerings in all areas. And finally, the demand for all of our programs and services and the use of our parks, our beaches and all of our'",
        "'speaker_4': 'spaces and places has greatly increased this past year, putting a strain on our limited resources. With over 168 public places and spaces, six miles of beaches, 27 community centers, dozens of athletic fields, 67 tennis courts, five municipal golf courses, 54 playgrounds, three pools, and 330 300 marina slips.'",
        "'speaker_4': 'Our opportunity to impact the residents of Long Beach, both our two and four legged, is great. And through all these facilities in our programs, we have made millions of positive contacts this year as we take our residents from diapers to diplomas and graduates to grandparents.'",
        "'speaker_4': 'Your continued investment in the Department of Parks, Recreation and Marine has been essential to our ability to meet the needs of the community, and we thank you for your support. And this concludes our presentation, and we will be available after the next presentation for questions.'",
        "'speaker_3': 'Thank you. And finally, it's a public works.'",
        "'speaker_12': 'Good evening, honorable members of the City Council, thank you for the opportunity to provide a brief overview of the Public Works Department's Fiscal Year 2017 proposed budget. If you recall, two weeks ago you received a presentation on the proposed capital improvement program, or CHP, which outlined the city's plan investment of roughly $76 million into city infrastructure.'",
        "'speaker_12': 'Tonight, I'm going to discuss the public works operating budget. Public Works is a team of service oriented individuals who actively support the successful operations of the city on a daily basis. These activities are summarized in three core service areas, which include overseeing the maintenance and rehabilitation of the city's core rights of way infrastructure, such as streets, sidewalks'",
        "'speaker_12': 'and our urban forest. We provide services supporting a healthy and sustainable city environment, including waste diversion, stormwater management and enhancing livability infrastructure. The Department also works to safely and efficiently design, construct, deliver and maintain our public facilities. So next time you drive to a council meeting, I'd like you to think about the hardworking public works employees while'",
        "'speaker_12': 'you're on the streets designed by your engineering group, while you obey the traffic signs supported by our street maintenance group. Now, if you don't obey the traffic signs, you'll be thinking about Chief Luna. I want you to think about when you walk into city hall that this building is maintained by your facility team and when you dispose'",
        "'speaker_12': 'of your Starbucks coffee cup that is serviced by an environmental services team. Public Works had a number of accomplishments in 2016, including completing 113 million in capital improvement projects. Some of those highlights include a $25 million investment in arterial streets and sidewalks.'",
        "'speaker_12': 'And I just want to note that to help ensure that our rights of way meet accessibility standards, the city has hired a new ADA coordinator. There was also 15.1 million invested in the new Michelle Obama Library, 7 million for Parks Recreation Improvement, some of which Maria outlined here this evening.'",
        "'speaker_12': 'As well as $35 million to start the new Civic Center project, which included the demolition of the old courthouse. Our refuge crews collected 186,000 tons of trash. This was either recycled or used for renewable energy. Street crews repaired 34,000 potholes, trimmed 25,000 trees, and removed 1.2 million square feet of graffiti.'",
        "'speaker_12': 'Under the Clean Team Initiative, over 13,000 illegally dumped items were collected. Many coming in over the Golden beach at. We assisted residents with 15,000 special item pick up requests, keeping those items out of the alleys. A highlight that particularly worth mentioning is the street sweeping optimization study, which focused on the elimination of the 14 street sweeping routes'",
        "'speaker_12': '. This was done in one of the city's most parking impacted residential neighborhoods. Alameda Speech. This effort will continue in 2017, moving into the downtown and West Gateway neighborhoods. In 2017, Public Works is proposing a $177 million budget. This is divided across nine different funds.'",
        "'speaker_12': 'This includes about 107 million for operating activities and 70 million in capital funds. If you look at the pie chart, I just want to highlight that public works includes roughly 21% of its budget, which is made up of general funds totaling $38 million.'",
        "'speaker_12': 'This $38 million represents roughly 9% of the citywide general fund budget. Additionally, this $38 million is offset by $25 million in revenue from various sources, including parking meters and permit fees. You'll notice the refuse and recycling fund is our largest amount that we have in the department that represents $47 million and it's generated from customer payments.'",
        "'speaker_12': 'These moneys are solely restricted for waste diversion activities, including the city's clean team. The Capital Projects Fund includes the first year of measure investments totaling $27 million. This is in addition to the base amounts. These activities are all detailed in the proposed CIP plan, which again was presented two weeks ago.'",
        "'speaker_12': 'Notable changes that we're working on include working closely with financial management department to achieve the general fund saving target of $733,000. This reduction will result in minimal impact to operations as the savings was achieved by reducing overtime, essentially shifting after our call outs to regularly scheduled hours.'",
        "'speaker_12': 'We also reallocated our survey staff to the oil fund and the Capital Projects Fund, thus aligning staff with the funding areas where the actual work is performed. I want to take a moment to thank the limited gas and oil department for their continued support of our survey team.'",
        "'speaker_12': 'Public Works is proposing to enhance the Clean Team Initiative, allowing for two dedicated clean team crews. This will expand the proactive response to illegally dumped items, litter abatement and other clean services that's included in this year's budget. The budget also includes Measure A again, $27 million will help address many deferred capital projects.'",
        "'speaker_12': 'We are also adding staff to help meet the demands of not only measure but the other side IP projects. When thinking about project delivery. Public Works is is restructuring its organization by establishing a focused project management group. This will align tidelands measure A and base SIPP into one work team, providing more efficient effort and better communication.'",
        "'speaker_12': 'Additionally, it will allow us to support private development as it relates to work within the public right of way. Opportunities in 2017, with the passage of Measure aid, the city can begin to address its aging infrastructure, which has been a constant budget challenge to ensure the city is making strategic investments in its street.'",
        "'speaker_12': 'The Pavement Management Plan, or PMP, will receive an update in 2017, giving council an understanding of what condition all the streets are within the city. The city will also complete its first alley, including courts and Ways Management Plan, funded with $300,000 for measure.'",
        "'speaker_12': 'There is also a new sidewalk management plan which will be prepared to evaluate the condition and help us prioritize repairs based on need. This will also focus on the needed accessibility improvements that we need to make in many of our intersections.'",
        "'speaker_12': 'The proposed budget includes an update to the city's refuse rates. A study is currently being conducted by an outside consultant and those results and recommendations will be brought to council in early 2017. The study will include an evaluation of rates in comparable cities, including Los Angeles, Burbank, Pasadena, Santa monica and San Jose.'",
        "'speaker_12': 'I want to point to the phase the completion of phase one of our led streetlight change out program that updated 1750 intersection lights, or we call safety lights. That program continues with phase two. That will result in replacing roughly 24,000 high pressure sodium lights with LED lights.'",
        "'speaker_12': 'This is in partnership with City Light and Power. And also I'd like to point out that it's a sustainable project and will significantly reduce the city's city's energy consumption for streetlights. And I'm pleased to announce that we are investing in technology, working with the innovation team and our technology and Innovation Department.'",
        "'speaker_12': 'The city will deploy an easy park, Long Beach smartphone mobile application. This will show a parking information for on street and off street parking, allowing users to view parking availability throughout the cities. When that 1651 smart meter on street parking locations and over 10,000 spaces in our lots and garages.'",
        "'speaker_12': 'Finally, the department will continue to focus on citywide mobility programs, including completing the deployment of 50 bikeshare stations, which will result in 500 bike share bikes throughout our city communities. We're also adding 19 bike repair and hydration stations that again will be deployed throughout Long Beach.'",
        "'speaker_12': 'Again on mobility, we will work to continue the construction of the Daisy Avenue, the 15th Street and Sixth Street Bike Boulevard projects. These will be in addition to the newly completed expansion of Alameda Avenue buffered bike lanes and the new parking protected bike lanes on Artesia Boulevard that were just unveiled last week.'",
        "'speaker_12': 'It's also I'm pleased to announce that our beach treats events will continue in 2017 to support the community and make sure that we're working to educate them on mobility options. So in closing, I want to reiterate that our goal is to continue to efficiently and seamlessly provide these essential services to our communities.'",
        "'speaker_12': 'On behalf of the 466 dedicated men and women of the Public Works Department. I want to thank you for your support, and I look forward to working with each of you in the coming year. Thank you.'",
        "'speaker_3': 'Thank you. I think that concludes all of our presentations. I think everyone did a great job. Thank you. And we're going to begin by going into some questions. Again, a lot of members want to speak. So please, if we can just try to note that everyone has has questions, we'll probably get to all of them instead of'",
        "'speaker_3': ', you know, one person asking all of them. That would be great. So, Vice Mayor Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. So I want to start with public works. I just want to say and this isn't a question, I just want to say that it's apparent that you've invigorated your department and it's clear that your staff, in all your all your bureaus and divisions, they're clearly thinking outside of the box and really striving to'",
        "'speaker_7': 'meet the needs of our city. So so I have to say that I recognize that and you're doing a fantastic job and your staff is doing great. That's all I have for public works. Thanks. And Parks and Rec, a few things that came up.'",
        "'speaker_7': 'I noticed you mentioned that you have 800 staff during the summer and that's that's huge. That's a tremendous point of entry for employment. That's you know, this is it's a front line for youth violence prevention. And with all of the constraints with dealing with a department that large it I think your staff does a fantastic job at'",
        "'speaker_7': 'balancing community interests city council interest and needs and you're really the you know, you're really sort of delivering on a number of programs like our concerts in the park are fantastic the Be Safe program, a number of improvements like our de force wetlands, the Harlem Park Community Center, our north town open space masterplan can go on and'",
        "'speaker_7': 'on, but your staff is they're killing it. So keep up the good work on health. I would say, you know, along that same along that same vein too, to think that, you know, it was something you mentioned. So you have a lot of accomplishments.'",
        "'speaker_7': 'I see everything from the heels on to the bike club, the fatherhood initiative, which is huge. All your work. I'm very proud of your work around veterans and homelessness and I think it's to hear all that. I think it's astonishing to know that you only receive 1% of the general fund and as much of as much of'",
        "'speaker_7': 'you know, as much that we talk about it, city council about a lot of these social issues. It's just surprising me that that you receive less than most other departments and you're completely you're completely grant funded and fee funded.'",
        "'speaker_7': 'And I know that we can't expect our departments to continue to be innovative and forward thinking if we can't support them and if our budget doesn't reflect our values. This department continues to be a smart investment. You invest 1% and we literally get 99% back.'",
        "'speaker_7': 'And that's that's just fantastic. And that's a lesson learned. But we can't think long term when we're thinking in terms of grant cycles. So today we did receive this memo here on the Office of Equity and we received a letter from the Board of Health.'",
        "'speaker_7': 'So I do want to thank your staff for your hard work and research that went into this. But because this just came out and I did take the time to read it, I want to ask you if you can just take a moment and just walk the council through this memo.'",
        "'speaker_11': 'Good evening. So we were asked to look at the feasibility of integrating the violence prevention efforts and equity efforts in the Department of Health and Human Services. This is the first the first memo that outlines the steps and initial resources that it would take to do that.'",
        "'speaker_11': 'We provide some background about the the safe Long Beach and violence prevention efforts, as well as the existing equity efforts. But in the end, what I'd like to talk a little bit about is what the structure would be and what we're proposing.'",
        "'speaker_11': 'We see equity as an overall encompassing activity. It is not an activity, but a philosophy and the way that we look at things. And so what we'd like to do is to place an equity office within the Administrative Executive Office of Health and Human Services, and then the violence prevention efforts really to move into the Human Services'",
        "'speaker_11': 'Bureau, which we don't currently have, but we will soon as we're realigning our organization. We see the nice fit there because the we have the Center for Families and Youth, we have homeless services, the Fatherhood Initiative, our kind of strengthening families activities.'",
        "'speaker_11': 'All of those are considered core violence prevention activities. And then that would allow for those integrated efforts to look around prevention as well. We're also been spending a lot of time looking at mental health diversion from incarceration opportunities, which is also violence prevention.'",
        "'speaker_11': 'So we'd like to incorporate that into the Human Services Bureau and then the equity efforts would be within the overall department.'",
        "'speaker_7': 'Thank you. And I think that makes a lot of sense to place, you know, violence prevention with all the human services stuff that you're doing from homelessness to, you know, fatherhood initiative and all that. I think that all make sense.'",
        "'speaker_7': 'And in terms of like the staffing in the Office of Equity, I want to applaud the fact that you've looked at two positions you've already gotten grant funded and you're leveraging that. So that's great. I want to just ask that that, you know, I see a timeline here that says, you know.'",
        "'speaker_7': 'The City Council asked that we look at some time in the next fiscal year to make this happen because I know it's going to take some time to do some some outreach and things like that. Could you just walk me through just what you anticipate to be a potential timeline, like how I know we can't be open'",
        "'speaker_7': 'on day one, October 1st of a fiscal year, but what would it look like, that sort of phase in a ramp up?'",
        "'speaker_11': 'So the in terms of the Office of Equity specifically, we are in the middle of hiring an equity coordinator for the department that was that is funded through the California Endowment. We also have a few fellow who will be joining us for one year that is funded between general fund and grant funds.'",
        "'speaker_11': 'In addition to that, we would we would language access and My Brother's Keeper would be would be incorporated there. So as we look at what it would take to plan, when we talked about the feasibility of what was originally proposed here, there were a large number of people here speaking and wanting to engage in that conversation around'",
        "'speaker_11': 'equity. And what we understand is that we want to be able to be out in the community, to engage with the community over the next 4 to 6 months, to have a conversation about what are the expectations and how do you align the expectations and the resources to really move forward and determine together what we want to'",
        "'speaker_11': 'create with this office. So we would come back in six months with a plan in terms of the violence prevention, we're looking at another probably year sometime in early, early to 2017 to be able to move those over based on space and technology and other things.'",
        "'speaker_11': 'We also the memo outlines the fact that because we are grant funded and all way to pretty much everything that is coming through violence prevention and equity are grant funded as well that we would be seeking an administrative analyst at the most as an absolute core piece to help run all of those grants and monitor them and'",
        "'speaker_11': 'do those kinds of things, as well as bringing on a public health professional level or high level sort of program and person to really look at the data and to help drive violence prevention efforts across the department.'",
        "'speaker_7': 'Thank you. So I'll just end with I'm very comfortable with that timeline. I think it meets exactly what we discussed in initial motion. I'm going to ask our budget folks, Leia, John GROSS and I and our chair of our Budget Oversight Committee, just look at this proposal, talk with city staff, see if there's a way that we'",
        "'speaker_7': 'can make sure that this gets phased in to meet the needs of the health department. Because what I understand is our director saying, yes, we can do the things that the council asks, but at some point we have to talk about real capacity.'",
        "'speaker_7': 'We can't continue to be, you know, grant funded and look at we need to have some support on the administrative side. And that's my analysis here. So I'm to ask folks this to look at that through the BRC process and I look forward to what comes out of it.'",
        "'speaker_7': 'But thank you so much and great job to all of you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_5': 'Yes, thank you. Thank you to each of the department heads. I really appreciate all of the work that each of you have done and also the women and men of each of your departments. It's been phenomenal working with with all of you.'",
        "'speaker_5': 'I will start with public works. Just real comments. I want to say thank you. I know the courts and waste management plan is will be underway. It's very exciting. Also your commitment to parking. Craig, I really appreciate it.'",
        "'speaker_5': 'I know that we will receive a study that will discuss the courthouse area. We're also looking at the greater downtown and city place as well. So thank you. Moving along to Parks summary. I have a couple of questions, so thank you for everything.'",
        "'speaker_5': 'Your reports are always very inclusive and comprehensive and I think we've streamlined a lot of our questions and we've received a lot of answers from you. Have a question? I see a couple of reductions and eliminations. You did talk about the youth summer sports programing.'",
        "'speaker_5': 'I guess historically it's been low, but I have questions also the reduction for Silverado and Veterans Park. So can you just explain that a little bit?'",
        "'speaker_4': 'Yes. The reduction in the youth sports for summer, there was a at one point in time an all city track meet that was produced by our department. It wasn't run last year because the numbers from the year before before were very, very low participation.'",
        "'speaker_4': 'So that was something that we thought we could eliminate in this year's budget without having an impact to some of our other summer programs. As far as then Silverado and Veterans, what we were doing there is really eliminate or not eliminating, but bringing the budget back more right sizing it to the participation level.'",
        "'speaker_4': 'So the numbers are low there during the summer show and the staffing level doesn't need to be as high there.'",
        "'speaker_5': 'Okay. And was the track meet? That's the only youth sport for summertime. Yes. And then as far as the low participation is that that money be placed in other like different types of programing. I mean, that would be great if we were able to do something like that.'",
        "'speaker_4': 'So just that would be great if we were able to do something like that. But as we looked at the need to do reductions in the department across the board, we tried to be as efficient as possible and look at right sizing and and areas where we could reduce without the impact.'",
        "'speaker_4': 'And that's one of those areas.'",
        "'speaker_5': 'Okay. Thank you. And then last question for you. I think it's been a question that we've had historically as park patrols. I know that's been talked about formally. What is the next step? Because I know we talked about it last budget season and I don't know where it's at at this point.'",
        "'speaker_4': 'Well, right now we have our park ranger program is actually housed in the police department, and they are mainly working with our regional park system. We had a pilot program a year and a half ago, I believe it was.'",
        "'speaker_4': 'It stopped in the council district two. That was, again, pilot, and that was to be funded if it was going to go forward through the local homeowners association, if they chose to continue to move it forward. And that was really using some of our part time recreation staff to be at that park, to sort of be eyes'",
        "'speaker_4': 'and ears on the park after program hours and and to help with some of the issues that we were having there. We don't currently have plans or we don't have funding in the budget to start a program or to bring back that pilot program.'",
        "'speaker_5': 'Okay. Thank you very much. That answered my question. I appreciate it and Kelly and help thank you also for everything that you do specifically with homelessness. I feel like it's been really prioritized. We've been talking about it quite a bit and I know there's different funding sources coming through, but I really appreciate your commitment to that and'",
        "'speaker_5': 'all of your your team's commitment as well. Question about the lost funding for asthma. What are the next steps? Because I know that has been lost for some time. So I don't know what where we go from here.'",
        "'speaker_11': 'Right. So recently the port announced, I think it's $47 million that they'll be putting out into the community over the next 15 years to to start to address some of the issues. We had been receiving a human being port mitigation funds in those funds, and it so we'll be reapplying for those resources when they come forward.'",
        "'speaker_11': 'We are also looking at working with different health insurance organizations to see if they will start to fund asthma education as part of this part of an effort. We're in early conversations in that I'm not sure where that will go, but it is a possibility.'",
        "'speaker_5': 'Okay. Would you be able to inform us? I know that you you do regularly just to ensure that we know where it's at, because I know a lot of residents on the West Side specifically will have questions as to the funding.'",
        "'speaker_5': 'And I know you're very tight end, but be good to just get an update on where that said.'",
        "'speaker_11': 'Yeah, sure.'",
        "'speaker_5': 'Thank you. And then just last question. As we are discussing, the Office of Equity is I know there had been discussion of an Office of Aging and I don't know if aging will now be tied into Office of Equity and how that will work out.'",
        "'speaker_11': 'No, they'll be separate.'",
        "'speaker_5': 'Okay. Just just checking on that. Thank you very much. Appreciate it.'",
        "'speaker_11': 'Yeah. Thank you.'",
        "'speaker_3': 'Excellent. Yes. Thank you, Councilwoman Pryce.'",
        "'speaker_5': 'Thank you very much. Okay, so a few questions. We'll start with public works and regarding the measure, plans for 2017. Is it realistic that we will actually be able to complete all of the projects that we have scheduled for 2017?'",
        "'speaker_5': 'And if not, at what point during the year will we have a sense of what projects we likely won't get to in that year, thereby allowing us the opportunity to reallocate some funds?'",
        "'speaker_12': 'Well, Councilmember, I'd just like to say that the mayor has issued me a challenge in completing these projects in three years, which I've gladly accepted. Joking aside, I do believe we will get through our $27 million of measure money in year one.'",
        "'speaker_12': 'A lot of the items on here are are things that don't take a lot of design time. So, for example, in year one, we're going to be doing a lot of street work that's focused on slurry while we we will be designing streets that we would be reconstructing in year two and then we would design streets in'",
        "'speaker_12': 'year two that we would be reconstructing in year three. So that really is the long lead time items. Many of the other things in here we believe we can get to should we find ourselves in a situation where we believe we're not going to achieve that in carryover moneys, we're going to be utilizing the Transportation Infrastructure Committee'",
        "'speaker_12': 'to make regular updates as long as well as the Measure Committee to give them updates on expenditure plans in progress.'",
        "'speaker_5': 'Okay, great. Because I know that we have a lot of public safety priorities as well as infrastructure priorities. And if there were if there was a realization that maybe we couldn't get to all the infrastructure ones, maybe for the 2017 year, we can reallocate some of that money because $1,000,000 may go a lot further with some of'",
        "'speaker_5': 'our public safety priorities than with infrastructure in terms of our our first year plan. So I just want to put that out there, something to think about. Okay. The pavement management update that we're going to get in 2017.'",
        "'speaker_5': 'Is that going to impact at all the three year plan that we've come up with? Or is the three year plan pretty much determined based on the last study that we did and will be identifying new, new challenges moving forward?'",
        "'speaker_12': 'Well, I think best management practices are that you keep your payment management plan current. Our goal is to update it every two years. So we have a very robust plan. I think you've you've spent some time looking at it and understand what's in that plan.'",
        "'speaker_12': 'We want to make sure that the street ratings that we're basing our decisions on are accurate and current. So essentially in 2017, those street ratings will receive an update. And I would imagine that our our strategic approach would remain consistent.'",
        "'speaker_12': 'But if, as an example, we have a street that significantly deteriorates in that two year time frame, we may want to shift some priorities to address those streets.'",
        "'speaker_5': 'Okay, great. Thank you. Okay. And thank you very much for the work that you do. Have shared this with Mr. Beck in private, but happy to do so in public as well. Your team does your department does an amazing job responding to the go along beach app requests, especially in the area of graffiti removal.'",
        "'speaker_5': 'So I think it's that is the one. Service, a resource that we offer our residents that allows them to have direct contact with the city staff and city departments. And when that contact is positive, I think it fares well for the entire city.'",
        "'speaker_5': 'So thank you for that. Okay. Going on to health, if that's okay. I want to commend the Health Department for the amazing work that you do in bringing in grant funding. There's there's no doubt about it. When you look at your budget, like my colleagues have mentioned, you get very little from the city, but yet you bring'",
        "'speaker_5': 'in so much in grant funding. And so for that, you should be absolutely commended. And I can imagine that homelessness is a challenge. For the department at this time, because although you get over $7 million in funding from one source and some money from other sources, it still presents some new and unique challenges that are being presented'",
        "'speaker_5': ', and we're not necessarily able to keep up with those. My question to you is, you know, we're hearing a lot about creative programs and projects that different municipalities are using to try to determine what works when it comes to homelessness.'",
        "'speaker_5': 'This morning, I heard on NPR that L.A. County is going to be implementing another idea of selling city advertising space and using that money to fund homelessness initiatives above and beyond what we do. And we're known for doing as a staple in the area of homelessness in the city of Long Beach.'",
        "'speaker_5': 'What creative methods or ideas or plans do we have moving forward that we can share with our constituents in regards to homelessness? Are we are we planning to try out any pilot projects anywhere? Is there anything that we're looking into that might be a little bit different than what we've done in the past to meet the new'",
        "'speaker_5': 'challenges?'",
        "'speaker_11': 'Yeah. So the Fuze fellow, we will have a Fuze fellow joining our team starting this fall for a one for a one year activity. And the Fuze fellow was the sort of led the much of the planning in L.A. County as part of their work.'",
        "'speaker_11': 'And so they will be looking at different sorts of innovative opportunities for how to address homelessness, as well as creative financing solutions and innovative financing issues to help fund additional resourcing in the work that we're doing right now.'",
        "'speaker_11': 'When we think about the 7.2 million coming in, six over 6 million of that actually goes to all of our partners. So we're doing that. We are providing transitional housing and permanent supportive housing and mental health services, veteran services, domestic violence services, even child care for people so they can begin to find jobs and to be educated'",
        "'speaker_11': '. So we're really spending a lot of time, you know, working with our partners to house people. As for those who come in, the other is we're really spending a lot of time trying to you know, when we think about different ways that we can provide mental health treatment and substance abuse treatment, many that many who are homeless'",
        "'speaker_11': 'experience mental illness or substance use. And so we are working with our partners to try to identify new ways to do business there. But there's work to be done.'",
        "'speaker_5': 'In regards to that. And I know that you attended a recent meeting that we had in the third district that was very well attended by over 150 people on this issue. And some of the folks in the group were asking whether or not we have a plan in place.'",
        "'speaker_5': 'Do we have any sort of strategic plan in place for homelessness? And if not, what would it take for us to create one? I imagine that would be quite an undertaking that would be costly. What would be involved and do you think it would be helpful?'",
        "'speaker_11': 'Well, we do have we have a coordination. We very closely with our region as well. And so there's there are there's a lot of work through the coordinated entry system and through our teams. So it doesn't lay out as the strategic plan.'",
        "'speaker_11': 'It is a it's a highly coordinated effort that has brought together many partners from across our region in an effort to to address homeless. I think the work coming in for the few fellow that's actually going to be a core part of that work.'",
        "'speaker_11': 'So how do we look at the next steps? And we would be laying those out as part of a plan. So that's a one year process, and I'm not exactly sure what it's going to look like yet, but there will be much more engagement and opportunity to think through different possibilities.'",
        "'speaker_5': 'And when does this Fuze fellow join us?'",
        "'speaker_11': 'This fall, the next month or so, one week, October one.'",
        "'speaker_5': 'Would it be possible for us to have a little bit more engagement with this Fuze fellow as a council body? So maybe periodic updates because homelessness is something that's impacting all of our districts. And I know that sometimes we've you know, just in the short time I've been on council in two years, we've had programs that we've'",
        "'speaker_5': 'we've gotten grant funding for. But months have gone by. And by the time council gets an update in terms of what folks are working on, it's a little bit late for us to give input on what can you also work on this or can you also look at that?'",
        "'speaker_5': 'So is it possible for us to have like an early opportunity to maybe give input what we're seeing, what we'd like to see explored so that the Fuze fellow has a little bit of focus in terms of some of the issues that we might be dealing with that might be the same and some maybe not.'",
        "'speaker_11': 'Sure, we can do that.'",
        "'speaker_5': 'That would be great. Thank you. I'd appreciate that. Okay. For Parks, I echo everything my colleague said. Your team does a fantastic job, so they should be commended. Every single one of them, especially the ones that are out there every day, bringing a very positive spirit to people who may not get it elsewhere.'",
        "'speaker_5': 'So I thank them for that. I do have a question about the park safety issue that was raised, and I remember being very involved in the discussions regarding Bixby Park, but I'm not sure if we ever received and we could have and I missed it.'",
        "'speaker_5': 'But any sort of like a summary or overview of, you know, how effective was that program? Was it an effective program? Did we collect any data? And if it was an effective program and we wanted to continue it, what would that budget look like?'",
        "'speaker_4': 'I don't know that I have the budget numbers at my fingertips of what that would look like. As far as an effective program, I think it really is going to depend on what outcome you were looking to achieve.'",
        "'speaker_4': 'If you recall, they are mostly young, part time recreation staff that were in the park and I don't think they had the ability to enforce some of the issues and the concerns effectively that maybe the residents were looking for.'",
        "'speaker_4': 'So the program effective? I you know, I don't know that I heard it was with an overwhelming response that it was an effective program or that on either side from our team or from the residents, that it really did what they were looking for.'",
        "'speaker_4': 'But I think partially that was because some of the outcomes really weren't clearly defined going in as to what the program was to to achieve. I know recently we've worked with the Friends of the Bixby Park and we started to do some things in the park that I think have have created some change and and solve some'",
        "'speaker_4': 'of the issues. So, for example, the skate park, there was great concern that the skate park was attracting somewhat regulars and the regulars were older. So it made it very intimidating for the young kids and families who wanted to enjoy that activity or that space in the park.'",
        "'speaker_4': 'So we started this summer the funding from the Friends of Bixby Park with some free skate opportunities. So Tuesday nights and Saturdays we had one of our contractor instructors out there doing some free skate programing, which sort of broke up a little bit the what activities were taking place at the skate park.'",
        "'speaker_4': 'And it seemed to have a very positive effect. So we're looking at continuing that, moving forward, using that space a little differently, bringing in some of our other program opportunities and ideas for the park and just activating it in a different manner than it had been.'",
        "'speaker_4': 'And we're seeing some great success with that.'",
        "'speaker_0': 'Right. Okay.'",
        "'speaker_5': 'Thank you. I don't have anything further. I actually I do. But the mayor said don't ask all the questions, so I'm going to pass.'",
        "'speaker_3': 'Thank you. And just to something that Councilman Price said with which I want to just clear, because people are probably hearing views. Fellow what's what's his views fellow in and out in the in the world there. Just just to clarify.'",
        "'speaker_3': 'So what what what this fellowship program is, is these are it's a it's a fellowship where they they go out and seek and find kind of the best and the brightest that are experts and innovators in civic innovation.'",
        "'speaker_3': 'And then they get placed in cities and communities to innovate on a topic that the city needs, innovation and development. And so these are some of the some of the the brightest minds out doing this work. And then they're also a network.'",
        "'speaker_3': 'So that, for example, I think my call it we just mentioned that there's a few fellow in Los Angeles that works on homelessness and so that that those ideas and those projects and get network to this Fuze Fellowship network and so in Long Beach from from per staff's kind of recommendation and and hope is that our Fuze'",
        "'speaker_3': 'fellow that will be coming in I guess October 1st they're going to be focused on homelessness and we acknowledge that homelessness is an area that needs new ideas and innovation and commitment as well. And so, you know, want to comes from as prices continued commitment in this area.'",
        "'speaker_3': 'And we're really excited about having this fellow. And I think that that's a good idea to have them hopefully meet the council early. So we all can kind of get to know who this person is and we look forward to their work.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'And Mayor, just just to add that we are actually going to be able to have two few fellows. So you mentioned the one on homelessness, and we're also going to have one that's be working on safe, safe Long Beach and violence prevention as well.'",
        "'speaker_2': 'So we can certainly do that.'",
        "'speaker_3': 'Great. It sounds good. Councilman Ringa.'",
        "'speaker_2': 'Glad to hear that. But I was one of the things that I wanted to add have that that, you know, along with a lot of the questions we might have today in terms of the budget that are being presented, we also have a lot of comments to make in regard to the services we are already currently receiving'",
        "'speaker_2': '. And I think that that is a that is a commendable in the sense that we have great departments in the city and they're working the best they can with the budgets they have. And in regards to homelessness, it is my expectation, my hope actually, that eventually we're going to institutionalize our budgets for homelessness and for a lot'",
        "'speaker_2': 'of the things that we have here, because every year we're always looking at, you know, what grants are available up there or what innovation can we go for to continue the work and continue that battle that we're dealing with, with homelessness.'",
        "'speaker_2': 'And the only thing that we can do is not rely on outside sources, but rely on ourselves to get those budgets at a level that we need them to be to battle the homelessness issue. Throwing money at it is not enough.'",
        "'speaker_2': 'We need to have a commitment from our city staff, from our city farmers, from this from this council to to fund these types of programs, to keep them funded year in and year out, and not rely on budgets going up and down and relying on grants that are made available or grants that may be two, three, four'",
        "'speaker_2': 'years down the road. And then once they go away, the program goes away. And that's that's not the way to operate as far as I'm concerned. So much of what I have to say is I'd like to see some of the a lot of these these programs that we are talking about being more a permanent fixture in'",
        "'speaker_2': 'our budget so that we're not having these kinds of discussions about having the health department, which is the one, first of all, comes up, you know, where they you know, they function 99% outside the general fund, 99%. They're getting all their money from other sources.'",
        "'speaker_2': 'They have people who write grants. They have people who hire they hire part time. They have people they hire for maybe three or four or five years. And then they have to go away. What kind of commitment are we giving those people?'",
        "'speaker_2': 'And we're giving them great training. No question about that. They live us in Long Beach and they go somewhere else to do their job, to do their work because other jurisdictions or other agencies have the money to hire them on a permanent, full time basis.'",
        "'speaker_2': 'And we don't do that. I think we need to have a more much more of a city council commitment to our health department so that they're not functioning at 99% grants and having to rely on and on the federal agencies or the state agencies or even other local agencies to to fund their programs.'",
        "'speaker_2': 'So I want to challenge this, the city council, to find the money. To find the resources. To address the big issues that we have. And we and we have two fellows that are coming in with two of the biggest issues that we have going public safety with kids that the safety the be safe program and homelessness.'",
        "'speaker_2': 'I think it's a great start and we should start looking at that. Maybe these these fellows can find a way to convince this city council that, you know what, you need to devote more of a full time institutionalized commitment to those two areas, and you will make a difference.'",
        "'speaker_2': 'I didn't see it for that reason, but I think I'll get off my pedestal at this point in terms of public health. They're the first ones up. I want to go in that order. I notice in your budget that you have three vacancies, three bureau manager vacancies.'",
        "'speaker_2': 'One is going to repeal very shortly with the excuse me, with the city health officer. Once that city health spots are going to start again.'",
        "'speaker_11': 'Health officials on September 19th, September 19th.'",
        "'speaker_2': 'And it was vacant for a number of years, if I'm not mistaken.'",
        "'speaker_11': 'We've had it filled for the last three years. Yeah. Yeah.'",
        "'speaker_2': 'Well, I hope you get a great one and one who will stay with us longer than a few years. Thank you. You also have a vacancy in the current structure that you have here. So that's what I'm going by, is a vacancy in community health and a vacancy in policy planning and prevention.'",
        "'speaker_2': 'I'm guessing the policy prevention I'm playing with. You'll be a. Prevention Bureau, correct?'",
        "'speaker_11': 'It is. Things are a number of years ago, things were realigned based on what was available in terms of funding during the recession. As we are looking now, we are realigning our programs once again. So we'll no longer have a policy policy prevention bureau.'",
        "'speaker_11': 'Instead, what we'll have is a Human Services Bureau that will align the homeless services, the Center for Families and Youth. And if the violence prevention work moves over, it will align there as well. The the Community Health Bureau will now take on public health nursing risk, and then all the other health promotions work.'",
        "'speaker_11': 'So the Hills, unhealthy, active, Long Beach, all of that work. So those are the those three will align in the Community Health Bureau. We are excited we start interviews this week for both well one on Friday and then starting next week.'",
        "'speaker_11': 'So we're hoping to have those filled within the next within the next month.'",
        "'speaker_2': 'Very good. Because that is going to be my next question to turn to. If you had current recruitment going for these two other positions, and when do you expect it to have a feel to it? That's great that you're you're on your own.'",
        "'speaker_2': 'You're on your toes on that one. You have to have it yet. You want to you want to help your department? Of course. The other question that I had regarding to do your funding was that you mentioned during the course of your of your presentation, you mentioned VLF is that the vehicle license fees?'",
        "'speaker_2': 'It is, yes. I thought those went away. We are still made available now.'",
        "'speaker_11': 'We received we received about $8 million this year from the from the state from the from the vehicle licensing fees. And we used those resources. Those are the only they have to be used for health purposes. But they, in addition to the general fund, are only more flexible source of funding, which we use to cover some administrative'",
        "'speaker_11': 'costs and to support grants where grants cannot be fully supported by the funds that are provided by the grants.'",
        "'speaker_2': 'What would be an estimate of what you get from vehicle license fees and how much do you use or how much of that money goes towards administrative?'",
        "'speaker_11': 'So we get so this year is about $8 Million. It decreased to about $7 million a number of years ago. And it's you know, it's basically about how the economy is doing is how those rates go. So we are at about $8 million this past year.'",
        "'speaker_11': 'And those resources support. They pay for my salary. They pay for the health officer salary. They pay for our administrative salaries. You know, so they cover a lot of administration, but they also because our grants generally administrative costs up to 10% and our overhead is closer to 16%.'",
        "'speaker_11': 'They help to cover those costs as well.'",
        "'speaker_2': 'So if I hadn't been in the health department before, so basically you can't cover a lot of your administrative fees. So a lot of these grants that you get because they have to be basically used for services for the services that they are funded for.'",
        "'speaker_2': 'Correct? That's correct. Yes. Homeless and whatever else.'",
        "'speaker_11': 'Right. That's correct. So many of the grants we get some some include no administrative opportunities. I include up to about 10%, if you will, take us up to our to our actual cost. In addition, if there are increases in employee costs or anything like that, they can't be built in.'",
        "'speaker_11': 'And so we have been using the realignment resource to be able to cover and support what is left of the grants that can't be covered by the grants.'",
        "'speaker_2': 'Okay. And I notice in your budget that you're budgeted for or where is that page again? Well, just go ahead and tell me the your your funding for how many fees.'",
        "'speaker_11': 'Refunded for 374. I believe we have.'",
        "'speaker_2': 'I found the page. And you're hoping to go up to 381. Correct?'",
        "'speaker_11': 'Yes.'",
        "'speaker_2': 'Okay. Now, those those additional positions you're looking at. General, generally, what are they going to be supporting?'",
        "'speaker_11': 'What programs we'll be bringing in? We'll bring in bringing in resources to support the clinic. So a medical assistant in the clinic will also be looking at support for the for homeless services, as well as the positions that that could be involved here through the violence prevention equity work.'",
        "'speaker_2': 'Okay. Well well, thank you. And again, I want to commend you for all that you do, all the health department staff who are here. All the great work you do. Keeping our city safe from bioterrorism for. Are you still having immunizations, by the way?'",
        "'speaker_11': 'We do. We do immunizations. We'll be having we'll be having a free immunization clinic again this year where we practice our response. So we set up as if there is an emergency and we do somewhere between 809 hundred flu vaccines in a couple of hours at the health department.'",
        "'speaker_2': 'Yeah, I was going to say, I think to be laying up for flu this year in terms of parks and recreation, a lot of a lot of the questions and comments that I have, you know, we've dealt with personally.'",
        "'speaker_2': 'I want to thank Marie and your staff for always meeting with me and being open and addressing the issues that I might have in my district regarding the parks, especially with all the work that you're helping us do with the Will Springs area, that is that is very helpful.'",
        "'speaker_2': 'And I also want to commend you for meeting with my two big constituency groups in in the Wrigley area, Wrigley Neighborhood Alliance and the Wrigley Association. And dealing with your questions regarding our Daisy Lane, which is a big area that we have every year.'",
        "'speaker_2': 'We have our Daisy Parade and and dealing with the trees. And I know it's going it's somewhat sad that what's taking place because all trees get old. And when trees get old, they have to they have to be replaced.'",
        "'speaker_2': 'And you dealt with it with the with the community very sensitively and are working with them to deal with how we can replace them or and or do something different on that on their Christmas tree. So I want to commend you and and the work you're doing there.'",
        "'speaker_2': 'One question that I had, I was a back back in the day like. Two years ago. I was a what you call a rec spec recreation specialist, but I was I was a recreation specialist with the Department of Parks and Recreation in L.A. County, and I worked in it in a program called Get High on Life.'",
        "'speaker_2': 'Many moons later I come to Long Beach and I'm driving down Pacific Coast Highway and I see some kids with old T-shirts that say, Well, there's a kid high on that program here in Long Beach. Wow. Amazing. I wonder how long it's been here.'",
        "'speaker_2': 'So that that brings up the issue now in terms of do we have programs in our parks that are funded by the county or any other entities for youth diversion programs? This was a they they can't program that it worked for a long time ago.'",
        "'speaker_2': 'Do we have those types of programs in our parks, recreation programs that they're supported by other other funds?'",
        "'speaker_4': 'We do we have grant funding that comes from different sources, for example, for our rap program and our afterschool programs. We don't have a Get High on life program.'",
        "'speaker_2': 'I'm not sure that's at all true.'",
        "'speaker_4': 'Yeah, I'm not so sure that that moniker would go over very well today. But we do have a lot of you.'",
        "'speaker_2': 'Should have heard the original, you know what it was originally sports addicts.'",
        "'speaker_4': 'That sport. That would be good. That'd be good.'",
        "'speaker_0': 'Okay. Right.'",
        "'speaker_4': 'So we do we do get funding from multiple sources. And of course, you know, that's part of what our B Safe program is about as well is, you know, positive engagement with our youth. So we do have state funding.'",
        "'speaker_4': 'We have our ACES grants that help us with our afterschool funding programs. So we have a few other sources. Yes.'",
        "'speaker_2': 'Okay. Well, great. Well, I want to thank you for all the work you do in public works. You know, you're doing a great job. I'm glad that you added a clean team, an additional clean team. We're looking forward to seeing that around town and keeping our streets free of debris and also to the implementation of our Missouri'",
        "'speaker_2': 'fund. So I want to thank all three of you for being here today.'",
        "'speaker_3': 'Thank you, Councilmember. Super now.'",
        "'speaker_7': 'Thank you. I'll be very brief. I just have a question for health and and the homeless issue. I know you're in the midst of the grant application process and I see Theresa Chandler in the audience. So thank you for being here, but we won't keep you long.'",
        "'speaker_7': 'Get back to that grant writing we talked about the 7.2 million versus the 6.0 million. If you got more money, where would you want it to go? Or would it be equally divided? Oh, I'm sorry. For what? For goes to outside sources versus what you use internally within the race.'",
        "'speaker_11': 'So right now, the funding that comes in from the continuum of care funds, one outreach worker and five, five case managers, intake worker. So when everybody say we need more, we need more outreach and we're seeing a lot more on the street than we would want to support additional outreach workers within it, within the community.'",
        "'speaker_11': 'The other key pieces for us is to really start to look at additional service for those with mental illness. So mental health practitioners and the ability to link people to care as well as for substance abuse practitioners and to be able to link people to care.'",
        "'speaker_11': 'And supportive housing is also a key piece and there are a lot of different models that one can work on in terms of supportive housing, which means that you are providing, you know, treatment and case management and those sorts of things where people are permanently housed so that they can remain housed.'",
        "'speaker_11': 'And so that would be another area where we would look to build additional capacity in permanent supportive housing beds and transitional housing moving in that direction.'",
        "'speaker_7': 'Okay. Thank you. And Councilwoman Pryce referenced a plan, and it strikes me with with limited staffing now that a lot of your duties are day to day putting out fires, and it's so tough to to function in that mode and work a plan at the same time.'",
        "'speaker_7': 'So if you have additional resources coming in. Well, will most of that go to planning or just your day to day, or have you determined that yet?'",
        "'speaker_11': 'I think we do receive we did receive some additional resources to to do planning and also for the unified funding agency, which allows us to shift resource where it is most needed across the different contracts, which we did not have that capability as of two years ago.'",
        "'speaker_11': 'So we are receiving some planning dollars and when we're able to do that. I think this the the Fuze fellow will be joining, you know, so that is a it's a funded it's a funded support person. I wouldn't say support person, but who can really lead and participate in these efforts.'",
        "'speaker_11': 'So that is a fund that's funded as well. But you're right, most of what most of what happened is we are we are on the you know, we are boots on the ground making things work for people and and doing outreach, connecting people to services on a regular basis.'",
        "'speaker_7': 'Okay. Thank you. And my council office is very close to this problem and we put a lot of time and energy into it. So we certainly want to help you and what you do. Just moving to a move to public works first and again reference.'",
        "'speaker_7': 'Councilman Price was talking about any any extra dollars that you have will will throw a different direction. Let's get a a stump removal program in place first. So that's that's just a real issue. We want to go back and and and eliminate this backlog.'",
        "'speaker_7': 'And to my way of thinking, it makes no sense to cut down a tree without removing the stump. Two things. You can't plant a new tree if the stump is to it's still there. And on residential streets, it's just you don't want the neighborhood to get used to a tree not being there.'",
        "'speaker_7': 'You want them to miss that tree and want it back very quickly. And to Parks and Rec. I just want to compliment compliment Marie actually to Craig, too, because you both have been in the job a short time, but you really hit the ground running.'",
        "'speaker_7': 'And to someone who took office eight days after he was elected, elected, I can relate to that. Hitting the ground running. Can we get a shot of Maureen while we're talking about her here? I go ahead. Okay. Also, let me compliment I want to compliment Murray on that necklace that looks great on camera.'",
        "'speaker_7': 'Thank you. All right.'",
        "'speaker_3': 'Thank you, Councilmember. Councilwoman Mongo.'",
        "'speaker_0': 'Our colleagues were so loquacious that Councilmember Supernanny. I had time to comment on how fabulous you look tonight, Murray. I'll start with health. I think you guys are doing an excellent job. I look forward to long term funding streams that have the ability to ensure that our community is healthy.'",
        "'speaker_0': 'Safety and health really do go hand in hand. So please tune in next week to the Budget Oversight Committee, where the I-Team will be making some presentations that I hope the community will really embrace and we can move forward with related to public works.'",
        "'speaker_0': 'Craig, you're doing a great job. Street streets. Streets and more streets. I think that we'll hear from you later tonight on other council items that are in the district but related to streets and traffic. I think you're doing a fantastic job.'",
        "'speaker_0': 'I'd also like to say that with regard to trees, you've really stepped up and we had a tragedy in the community where a tree fell on a home. No one was injured. But we need to be aware that not only are a third of the trees that are in our parks dead, many of the trees in our'",
        "'speaker_0': 'parkways are dead. And so the arborist is having to change because the drought situation has changed the make up of trees. And so the community of arborist. Is happening to change. And I really appreciate the great work that your office has been doing.'",
        "'speaker_0': 'Mr.. BECK And I also support and have been discussing this for weeks. We've used a lot of our council district funds to remove the tree and the stump, and then the replacement program. The Volunteer Day Long Beach last year that was hosted in the fifth District, resulted in many new tree replacements and tree placements, specifically in areas'",
        "'speaker_0': 'that really needed the canopy coverage that make the community cooler and safer. In the end, it really creates a healthier community time in our health department when we have that canopy coverage, especially during these really warm times like we're having now.'",
        "'speaker_0': 'So I'm excited to hope that that tree study from Lemieux will be worked in. And then I'm looking forward to finding a way to fund tree and stump removal with a record breaking tree removal a few weeks ago of 26 tons.'",
        "'speaker_0': 'Yes, one tree. 26 tons. And then finally, I'd like to concentrate on Parks and Rec. I know Marie got a letter from me, an email last night or Sunday, stating about how fantastic the staff were on Sunday at Eldorado Park.'",
        "'speaker_0': 'I think that the added gate staff is definitely being used properly. I think it's fantastic. I'm very supportive of the $370,000 one time funds to properly water our parks and maintain our drought tolerant plants. I think that if we're going to put in all this drought tolerant plants, we need to maintain it.'",
        "'speaker_0': 'The community needs this is a quality of life issue. We need to have it maintained and we do need to water. So no more trees don't die. Very supportive of $150,000 for tree trimming in our parks and removal of some of the dead trees because they are dangerous.'",
        "'speaker_0': 'I'm really excited about the Be Safe program, hoping to add a few more parks to that. And then I think that your staff are doing a fantastic job on the turf management plan. So I think that those modifications under your leadership have been phenomenal and I look forward to the study this fall, and I don't remember if'",
        "'speaker_0': 'we asked for it formally at council or if you and I've just discussed it so many times that I feel like it's coming in restructuring the allocation and fees associated with leasing our parks. Our parks are an amazing asset and we're very lucky to have them and we need to properly fund the utilization of those parks and'",
        "'speaker_0': 'look properly at programs that have been grandfathered in and what it means to add them and bring them up to compliance. And I know it's a tough discussion to have, but to have the assets we have without maintaining them would not be appropriate.'",
        "'speaker_0': 'So I appreciate your leadership on this. Thank you. That is all.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'Thank you. And I want to say thank my colleagues for answering or asking most of the questions that actually that I have. And I want to, first of all, start out by thanking the directors of the Health Department, Public Works and Parks, Recreation, Marine.'",
        "'speaker_8': 'All three of them are exemplary in doing a great job for for our city. All three are relatively new in their roles, but are certainly hitting the ground running as a Councilmember Suber nomination. I want to start with the Health Department and I want to go back to this issue of homelessness.'",
        "'speaker_8': 'It's something it's a recurring theme among my council colleagues, but it's something that we hear from quite frequently from our constituents in the community knocking on doors. People are really concerned about what they perceive as a increase in homelessness, and they would like to see the city do more to address that.'",
        "'speaker_8': 'And so to Councilmember your point earlier, I wholeheartedly agree. We need to look at ways to sustain our efforts in this this budget proposed budget. There is there's a line item for $100,000 and one time funds for proactive homeless initiative.'",
        "'speaker_8': 'Can you. Ms.. Collopy, tell us exactly what that will be utilized for and how that how you expect to utilize $100,000.'",
        "'speaker_11': 'So we received $200,000 last year as well in the way that we have used that is is as needed. So it's really been more of a hotspot approach. So last year, the $100,000 was spent as part of our team.'",
        "'speaker_11': 'So it was part of it was overtime for the police department to do quality of life work with us so that they're going out with our homeless outreach folks to meet with homeless individuals. We had sort of infrastructure maintenance.'",
        "'speaker_11': 'So, you know, Lincoln Park in areas, making sure that that things were being cleaned up, power washing those sorts of things and cleanups from individuals who were sleeping during the day. We've also did some of the river use some of those resources for L.A. River cleanup and then for motel vouchers.'",
        "'speaker_11': 'So we were we used some of those resources from motel vouchers for people who are homeless and who needed housing immediately. We did not have any other options we would foresee using that hundred thousand dollars similarly this year.'",
        "'speaker_11': 'So as things pop up and are needed and they don't fit, they don't fit a certain budget category, we would use those resources to help support that.'",
        "'speaker_8': 'So I guess I have to ask is is that enough?'",
        "'speaker_11': 'Let's see. I mean, there there are there are a lot of different resources that that are needed in our community to help support homeless as they are, you know, throughout the region. So, you know, I'm not sure what enough would ever be in terms of the resources that we need, in terms of mental health service and substance'",
        "'speaker_11': 'use and those kinds of things. We are looking and we are receiving another outreach worker through our emergency services grant and through and through. We are starting to build some capacity. And we are we had a veteran outreach person who retired.'",
        "'speaker_11': 'So we are feeling that and we have funding for an additional in there. So there are a lot of other other moving parts where we are building some of our capacity.'",
        "'speaker_8': 'So I'm here now. We have we will have two outreach workers, correct? Okay. And that seems like an area of need.'",
        "'speaker_11': 'It is an area of need, definitely.'",
        "'speaker_8': 'And I guess the other question I have in terms of your budget is you mentioned the health department seniors, our senior outreach and services. And I would go back to Parks and Rec a little later. But what services does does that supply provide and how many people are we actually reaching annually?'",
        "'speaker_11': 'You know, we have a we have a public health nurse that is co-located at the senior center on Fourth Street. And so she she receives a number of referrals to help, you know, and works to connect people to service.'",
        "'speaker_11': 'We also have a social worker on staff who helps with senior outreach as well. I don't have the numbers in front of me, but I can find that up for you.'",
        "'speaker_8': 'So that's just at the fourth, the Street Senior Center.'",
        "'speaker_11': 'The public health nurse is she is located at the Fourth Street Senior Center. The other is located at the Health Department and receives her first. And then we, our public health nurses, will go out and do home visits.'",
        "'speaker_11': 'They do that for, you know, for for families and seniors and others, but one specifically for seniors services.'",
        "'speaker_8': 'And I know Ms.. Night Marie mentioned that, you know, there is a growing need for for seniors services. Just curious to know what type of coordination and collaboration you have between the departments on that particular issue.'",
        "'speaker_11': 'We worked together very closely on the Seniors Strategic Plan that was presented here earlier this year as part of that effort. We'll be moving forward. We have a management assistant who is agreed to work between the two of us over the next six months to help drive and coordinate through the senior senior planning groups who will be'",
        "'speaker_11': 'pulling people, people together from all different all different parts of the of the older adult service community, as well as older adults to start to identify and plan out more specifically, the resources that are needed. In addition, are our real goal for this, you know, moving forward is that we better coordinate and inform people about what's actually'",
        "'speaker_11': 'available. There are a number of services available. People don't know about them. The lists are incomplete. So there are a lot of people with different lists. Those lists aren't yet all in one place. And then our referral systems are not as effective as they could be.'",
        "'speaker_11': 'And so we'll be working at we are looking at some technology solutions, not just for older adult services, but also for a number of social services about how is it when someone comes in and you refer someone that we know what the capacity of that referral spaces and that they actually have a place.'",
        "'speaker_11': 'And so we are looking at some different technology opportunities so that we can start to improve the coordination and service for folks in the referral system.'",
        "'speaker_8': 'So with one outreach worker for senior services, it sounds like there's some serious need. Is there there as well?'",
        "'speaker_11': 'Yes. Yeah. I believe the senior strategic plan had well, we have five staff members which include any additional public health nurse technology focus, as well as a lot of coordination and staffing.'",
        "'speaker_8': 'Okay. And I guess the next question on the same area, in the same line of questions would be for the Parks Recreation and Marine director. What does it cost to to run a senior center? I think we have three in the city right now.'",
        "'speaker_4': 'We do. And I have some information on our costs. You just bear with me for a moment. So right now we have five park locations for senior programing and that's at Houten Silverado, McBride. And then we have the Four Street Senior Center.'",
        "'speaker_4': 'We also have senior programs at Chavez and El Dorado West. So combine the fourth Street Senior Center, costs 620,000, a little over $620,000 a year to operate. And then the ancillary sites costs 265,000 to operate.'",
        "'speaker_8': 'Okay. Is there a do we do we do a census count for each of those locations? And do we know how many seniors are actually utilizing the services?'",
        "'speaker_4': 'We do have program numbers. I don't happen to have them with me tonight for our overall per site, but I can get those to you.'",
        "'speaker_8': 'That would be greatly appreciated. I'm just trying to understand how we're spending our resources and making sure we're getting. Optimal coverage throughout the city and reaching as many seniors as we possibly can. I know there's a lot of good information that we provide to that population.'",
        "'speaker_8': 'I'd like to move on and ask about our Be Safe program this summer. Do you have any figures on how many kids and families are participating in the program and how that compares to previous years?'",
        "'speaker_4': 'So the Be Safe program has been, again, a very successful program this summer. And as with all of our programs, we have seen an uptick in participation. Interestingly enough, for the B site safes this summer or B safe sites this summer, we're also seeing families participate.'",
        "'speaker_4': 'So in past years, they've been having, you know, their kids come and kids stay on the site. So they stay maybe for the day camp program and then they continue to stay at the site for the Be Safe program.'",
        "'speaker_4': 'But families are coming as well and participating, which is really nice to see that we're also providing that safe space and that safe place for family recreation in the evening hours. For some numbers, I don't have exact numbers per site or participation numbers this summer as we're still in the summer, but I can get those for you'",
        "'speaker_4': '. But definitely we are increased over last year.'",
        "'speaker_8': 'Thank you very much for for that. And I'm encouraged that that the program is actually working so successfully. One thing that I would just request in, and I think we talked about this in our briefings, is that after the summer months, particularly at these parks that are very highly utilized, we look at the maintenance in terms of'",
        "'speaker_8': 'reseeding and, you know, making sure that our parks are still beautiful and appealing for fetal position to families. Thank you. And Mr. Beck, I think. I'm curious about that. You mentioned the payment management plan update occurring biannually to every two years.'",
        "'speaker_12': 'Yeah. Our goal would be to update the street index every two years. So in 2017, when the first plan was presented to council in 2015, so an update in 2017 would stay on that schedule.'",
        "'speaker_8': 'All right. Thank you. And I know when we we initiated the very first payment management plan, it was. Do you have any do you recall how much there was was about $1,000,000.'",
        "'speaker_12': 'I'm told that it was roughly that that dollar amount. The update will be nowhere near that amount.'",
        "'speaker_8': 'Okay. That's mainly.'",
        "'speaker_12': 'Just.'",
        "'speaker_8': 'Next question. It's going to be $1,000,000 every time.'",
        "'speaker_12': 'No, no, not at all.'",
        "'speaker_8': 'Okay, great. And I wanted to get that clarified. And then the the the clean team. This year we're proposing a second clean team, which I think is great. Can you share what the team clean team has been able to accomplish in this initial year?'",
        "'speaker_12': 'Yeah. So some of the numbers that I that I quoted are really the results of our clean team. The clean team gets involved in not only addressing illegally dumped items, but helping coordinate with both the police department and health department on homeless cleanups.'",
        "'speaker_12': 'When there's encampments, when in homeless leave materials behind. The clean team will get involved in cleaning that. I think the real difference in the Clean Team versus a normal refuge collection is that it's proactive. So, for example, we may service your your trash at your residence every Monday, but the clean team's out every day and they're actually'",
        "'speaker_12': 'driving corridors and they're looking for items that have been dumped. Many of those are reported through the Golden Beach app or through our telephone centers. But just additionally, we're out there looking for items that may have been illegally dumped and picking them up right away.'",
        "'speaker_12': 'So the ability to add another team again will be funded out of refuge dollars. Not an impact to the general fund will allow us to expand the number of quarters that we're doing and the number more quickly address those illegally dumped items.'",
        "'speaker_8': 'So if I'm not mistaken, last year we used the clean team was required for us to to buy more equipment. We're going to take a pay by or purchasing more equipment.'",
        "'speaker_12': 'Yeah. So so part of the budget increase would include not only the staff, but a vehicle necessary to do the driving around with the team.'",
        "'speaker_8': 'Okay. And is there a specific area or route that they focus on?'",
        "'speaker_12': 'Again, we're primarily looking at are our main thoroughfares. So examples would be Long Beach Boulevard, Anaheim, PCH, Atlantic, both in throughout the areas of our of our city. So we believe that important corridors to add that we're not currently able to get to as frequently would be Santa Fe some of the areas on our west side up'",
        "'speaker_12': 'in north Long Beach Market, South Street. So there's a number of areas that we believe are a mix between residential and commercial corridors that that should be addressed with our clean teams.'",
        "'speaker_8': 'All right. Well, I look forward to a fiscal year of success. Thank you.'",
        "'speaker_3': 'Thank you. Council member Pearce.'",
        "'speaker_4': 'All right, there's been a challenge.'",
        "'speaker_0': 'I'm going to talk.'",
        "'speaker_4': 'For at least 15 minutes. Okay. Stacey, you ready? I want to just say that everybody that's the comments that have been said. I couldn't agree with more. And it's really. It's really great to come on to a council.'",
        "'speaker_4': 'Be here for a month and know that you guys have been doing so much work for the last several years. On trying to push the conversation around equity. Because what I've heard today is that people on this council want to prioritize equity over a lot of things.'",
        "'speaker_4': 'And so taking that frame, I'm not going to echo all the questions that have already been raised because I think they're really great questions, particularly the ones for our health department. I did want to ask, you know, knowing that that funding and when we all saw the $100,000, I think when we think about that being a priority'",
        "'speaker_4': 'number seems.'",
        "'speaker_5': 'Really small in comparison.'",
        "'speaker_4': 'To things that we're investing in, whether it's capital improvement projects that are, you know, obviously things that we need to invest in. But in my district, we have here City Hall where we've got Lincoln Park, we've got the convention center where we have tourists coming in.'",
        "'speaker_4': 'It is an issue that it's homelessness is an issue for the entire district, for the entire city. But thinking about the impacts here in downtown, thinking about our capital improvement budget, I wanted to just float out there that through future conversations as we can try to prioritize what we're investing in, I definitely want to say that I'",
        "'speaker_4': 'want to push the council and the staff to continue to prioritize the health department. If that means looking at our entire budget and looking at a project that could wait a while or could possibly, you know, isn't as urgent as we work with this fellow, trying to identify opportunities and funding sources to go big is something that'",
        "'speaker_4': 'that I want us to be able to do. And just from hearing the conversations that we've heard today, I wanted to ask, is there are there any grants out there that require matching dollars that we're missing out on?'",
        "'speaker_11': 'There were missing out on there are we actually for the tenure move care requires a 25% match, which we do match. There are some that there are others that are one for one match, like the emergency services grant.'",
        "'speaker_11': 'Emergency Solutions grant is a one for one match. So we we are we work very, very hard to make sure that we can meet those matches and to align the different resources to make that work. There are grants that around the more around the judicial system and things around substance abuse and those that are have a match'",
        "'speaker_11': 'that have very high match rates. And so we have chosen not we have chosen not to apply for them in the past because there are sort of a 50% to 100% match, and that's just not feasible.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'GAO would.'",
        "'speaker_4': 'Be interested if there are some on the 50%.'",
        "'speaker_0': 'Match just to.'",
        "'speaker_4': 'See those so we can start. You know, now that the counsel and folks seem to be prioritizing equity on these issues and if there are things that are there that we can make a decision to say, hey, if we all pull together a little bit and cut a little here, that we could get those grants.'",
        "'speaker_11': 'Because they come forward.'",
        "'speaker_4': 'That would be very helpful. Thank you. Thank you. Yeah, everybody.'",
        "'speaker_0': 'On my.'",
        "'speaker_4': 'My health department stuff. So I'll keep it short on that. I did want to just ask one last question is, is the city doing any work with bridge housing? To try to identify new opportunities for bridge housing that aren't necessarily around.'",
        "'speaker_0': 'Drug rehab.'",
        "'speaker_11': 'That's what I mean. We do rapid rehousing and prevention programs, so we're connecting people through that. And we do have transitional housing. We have we're participating in housing across the spectrum.'",
        "'speaker_4': 'And is would you say that the biggest challenge is staffing? Like, instead of having five days a week, we have seven days a week of people going out and doing outreach. Or is the bigger challenge identifying housing that people can be in long term?'",
        "'speaker_11': 'That's a that's a good question. We have a we have a 24 hour hotline for folks who, you know, who can call in if they see somebody that they would like to have some support and outreach to. And we do do that outreach to our partners specific to, you know, if they're partners that are like the mental'",
        "'speaker_11': 'health America or the veterans U.S. vets, they have outreach workers specific to their population. And so if they're being served by them or if they will fit within their services, then they will help support us. But they won't do just on call outreach.'",
        "'speaker_11': 'So we do have some support around those efforts. Really, what it is, is, you know, many homeless. It takes a lot of time to go out and keep re approaching and keep re approaching. We can approach 15 times or it might be ten years before they decide to come in.'",
        "'speaker_11': 'And so we want to make sure that we have those resources available for them when that occurs. And so providing the the supportive housing, you know, the transition to permanent supportive housing is absolutely essential.'",
        "'speaker_4': 'All right. Thank you so much. I know you've been on the spot tonight for Shade It for our Parks and Rec. Thank you so much for all the work that you've done. Thanks for helping us out with our upcoming budget meeting.'",
        "'speaker_4': 'I really appreciate it. Just I guess my only comment here is a great job. I wanted to say that it seems like with our youth programing, it's something that both connects with violence prevention and crime reduction and making sure that there's any way that we're collaborating with our health department and with the council offices to try to'",
        "'speaker_4': 'get more sustained programing in our parks. And if that means for my office, identifying organizations that can come in and also fill that void that we definitely want to try to activate those parks as much as possible.'",
        "'speaker_0': 'Yeah, I'll leave that.'",
        "'speaker_4': 'At that one. Thank you so much. And then for Public Works, also, thank you so much for handholding with us the last month as we get up to speed on all the great work that you guys are doing for Measure $8, we've talked about slurring in the first year.'",
        "'speaker_4': 'We've had a lot a lot of residents asking about their their maps and and what streets are getting done from the get go. How can our residents identify which streets are going to be slurred in this first year?'",
        "'speaker_12': 'So I believe the maps are already up on our public works website and if they're not, we'll make sure that they're up next week. But we do have a map per year, one which is identified the street segments that we are planning to do from a slurry seal perspective.'",
        "'speaker_12': 'And we will be resurfacing one major corridor in year one. And that is Broadway.'",
        "'speaker_4': 'Thank you. We're excited about that. The one other question I have for you, Mr. Beck, is, you know, we talking a lot about trees lately, and we have a number of parkway trees, you know, the Lovett Focus Tree, which has been damaging some sidewalks.'",
        "'speaker_4': 'And we've done a removal of those trees. I wanted to find out what the cost are to remove bad trees before they they damage sidewalks. That that might be a broad question.'",
        "'speaker_0': 'But.'",
        "'speaker_12': 'I don't we don't normally take out a tree that isn't sick or causing some kind of either damage to the infrastructure or creating some other public safety hazard in as far as removal cost. It completely varies and it depends on the size of the tree.'",
        "'speaker_12': 'We did bring forward a council, a new tree trimming contract recently. And for those councilmembers, you may remember that all of the trimming costs depend on the trunk size of the tree. So, for example, Councilmember Mungo talked about some of the trees.'",
        "'speaker_12': 'They were Italian stone pines in the fifth District. They were very, very large trees. And those cost were much greater than maybe many of the trees we would normally address.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_4': 'It's all my questions, everybody. Fantastic job. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Andrews.'",
        "'speaker_9': 'Fine, thank you. May I thought I waited for this time because I wanted to be less because of the fact I want to group everyone together. I just want to thank each and every one of you for doing such a fine job.'",
        "'speaker_9': 'And with that, I'll have my budget on the 30th, and you can come and ask any questions you like. Thank you very much.'",
        "'speaker_3': 'Thank you. And thank you all again for the presentations. It's budget season. So, you know, obviously meetings start a little bit later and fortunately during these these sessions for the budget. So with that, we're going to go right into the council meeting and public comment.'",
        "'speaker_3': 'But is there any public comment on the budget department that you just heard? Not general public comment. Please come forward and just go ahead. If you have a comment on the budget here, please come to the podium right now so we can do this expeditiously.'",
        "'speaker_3': 'Go ahead.'",
        "'speaker_5': 'Hi. I've never spoken to the city council before I came last year to speak, and there were 40 people talking about coyotes, and I had to go home to bed. I've been ill, but I was trying to do a lot of research last year.'",
        "'speaker_5': 'Okay. My name is Catherine Jet. Four 4102 Cranston Court, Bixby Village, Susie Price's District. I'm speaking tonight about the budget for Parks and Recreation, Long Beach Animal Shelter. We bring animals in from Cerritos, Los Alamitos, SEAL Beach and Signal Hill.'",
        "'speaker_5': 'At the present time, this shelter has two part time vets half time, two full time registered vets for several hundred animals. The staff works tirelessly under the direction of Ted Stevens, who have made who has made such a huge difference toward the goal of having a no kill shelter.'",
        "'speaker_5': 'It is unconscionable that this many animals have actually one vet for all the sick and injured animals. The majority of residents in Long Beach, if you talk to them, have no idea that animals are being killed at the shelter.'",
        "'speaker_5': 'The SPCA is next door. They get very confused. They're actually horrified when I tell them. Last year I did my homework. The shelter received $56,000 more for the year 2016 of a $2.7 billion budget. I asked Ted Stevens for the facts from this year, January 1st to August 31st, how many animals were euthanized?'",
        "'speaker_5': '212 cats, 217 dogs, 469 kittens, and 495 other animals. Total animals killed in six months. 1393. For the budget every year, millions of dollars are given to various organization activities, studies, museums, one time trainings, etc.. I'm a former teacher of 39 years and kids are my first priority.'",
        "'speaker_5': 'These are all needed and important. But as a member from the shelter recently pointed out, these animals are alive and healthy. I doubt seriously if any of the city council members are regularly visiting the Long Beach shelter. Every time I go, I cry all the way home and go, What can I do?'",
        "'speaker_5': 'I'm not with an organization. I'm not with a rescue group. I'm just.'",
        "'speaker_10': 'One person.'",
        "'speaker_5': 'These animals are lost, afraid, and sometimes sick, just like the ads on TV that make us cry. The SPCA, L.A. gets lots of donations. They choose animal from the shelter. And in six months, they took 1099 animals. The problem is, is in the month of July, there was 700 animals, cats and dogs turned in 700.'",
        "'speaker_5': 'Mayor Garcia took office and had a meeting at the El Dorado Park last year, and many of the city's rescue groups were there.'",
        "'speaker_0': 'They were actually begging for help for the shelter.'",
        "'speaker_5': 'The mayor promised to help. I really think the many rescue.'",
        "'speaker_0': 'Groups are doing the.'",
        "'speaker_5': 'Majority of saving animals lives in our city every day. Mr. Ted Stevens.'",
        "'speaker_10': 'Told me one person can make a difference.'",
        "'speaker_5': 'That's why I'm here. I went to Ms.. Price's meeting last Saturday in my neighborhood. I'm very hopeful that those that were there and.'",
        "'speaker_10': 'Those tonight really help this.'",
        "'speaker_3': 'Problem. Thank you, ma'am. Tony Zoller, sorry about that. Okay. Thank you very much. And thank you for caring about our shelter animals as well. Next speaker, please.'",
        "'speaker_2': 'Hi.'",
        "'speaker_6': 'My name is Ramon. I'm in the, uh.'",
        "'speaker_9': 'The fifth district. In the past, I've.'",
        "'speaker_6': 'Been a little bit critical.'",
        "'speaker_2': 'Of some of the the way that the parks has Parks and Recreation has has been going. But now that I'm in, I'm standing here.'",
        "'speaker_6': 'Listening to all this stuff and seeing Marie, I am now very happy with all the way things go. I can't say enough.'",
        "'speaker_2': 'Praise for for Marie in.'",
        "'speaker_6': 'The way that she's handling.'",
        "'speaker_2': 'A lot of the the way the parks are going under the conditions that she's been under. She's been just doing a great job. I think she said she goes something like 160 emails a day.'",
        "'speaker_6': 'And I've been lucky that I got a couple of couple of ones that I sent. The only ones returned with actually correcting some of the assumptions that I had, which was great. And I'm giving a lot of the information that she's given me to the residential groups, and I'm really happy that the trees and the are getting'",
        "'speaker_6': 'trimmed. You know, we can see all that stuff. I have nothing but praise. That's just what I've seen in the last couple of months. It's just been great.'",
        "'speaker_2': 'We had a problem with with a branch falling from it were no park.'",
        "'speaker_6': 'It hurting somebody and it was a safety issue and everything started it looks like the tree trimming started taking place. So I'm sorry it had to take that long, but it's great. And I call today I spoke to someone in the mayor's office about the budget.'",
        "'speaker_6': 'Everybody's like totally on board with what's whatever's taking place, you know, a guy named Daniel, great guy and Stacy Mango. I mean, I know maybe this is kind of confusing to people, but Stacy Mango saying all this stuff about the the the.'",
        "'speaker_2': 'What more stuff got more.'",
        "'speaker_6': 'Money coming in for the water is great. And the only thing really that I would like to see is, is I'm trying to get residential support to try to get more water for our parks. I mean, a lot of people don't realize that we haven't even budgeted enough money to water our parks.'",
        "'speaker_6': 'I mean, this is what she's faced with, that 80%, she could only water 80% of the parks. I mean, this is ridiculous, you know, so and I'm not saying that to be critical of her, but I mean, is elected officials, I think you guys really got to help her get her funds that she needs.'",
        "'speaker_6': 'At least a lot of the park finished the tree trimming 1.1 million. 18,000 or something like that. Let's get it all done and and handle that. Those are the main, main issues. Re planting trees. I got some time left.'",
        "'speaker_6': 'I don't need it. But I mean, Stacy, I know you got to be surprised, but thank you for for for finally, you know. Getting this stuff organized and done. I appreciate it. And please try to help get some more water.'",
        "'speaker_2': 'All right.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Good. You clearly as the address. I echo the gentleman's sentiments relative to our parks director doing a great job. Also, I'd like to echo the support of the lady that spoke before relative to our animal shelters, and I would offer the suggestion that I did last week when she made that presentation at the meeting.'",
        "'speaker_9': 'I would seriously. Request the City Council to consider a tax. On a minimal tax on pet food, I would think with the dollars going toward the projects you was talking about. My sense is any pet owner wouldn't mind paying a half cent or a cent or percent.'",
        "'speaker_9': 'When they go to buy their pet food. And I think that's those people that don't have pets may not do it, but I think enough pet owners in this city to or those that support it wouldn't mind paying a minimum tax on that.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_3': 'Thank you. Any other budget from other departments that we spoke of today? Please come forward. Is there anyone else besides Mr. Boland who's going to speak? Okay. See, now, Mr. Boling would be the last speaker when closing this and then moving on to the council meeting.'",
        "'speaker_13': 'Thank you, Mr. Mayor. And council learnable. And I want to address the issue of the homeless and the fire department's response to these homeless non-emergency calls. Other jurisdictions throughout the country have identified clusters of where non-emergency homeless calls were made.'",
        "'speaker_13': 'These clusters, then they put into that cluster of calls, an SUV with a nurse practitioner and an EMT. Right now, what we do is we send a $500,000 fire engine with four firefighters making from 175 to $200000 cost, plus two paramedics.'",
        "'speaker_13': 'We send six people to sometimes deliver a bandage to a homeless person. It seems fiscal insanity. So here's my thought. The fire department is at five years to do this to cost effectively help the homeless. Why don't we just have the money sent over to the Health Department?'",
        "'speaker_13': 'Let the Health Department put together the SUV with the nurse practitioner in the empty place. That vehicle or those vehicles were the clusters of the homeless are and deliver them the services they need to get at some reasonable price.'",
        "'speaker_13': 'Thank you very much.'",
        "'speaker_3': 'Okay. Thank you. And with that, we're going to go ahead and continue the budget hearing to the next budget hearing, which, again, will be at the start of the next meeting. And we're going to just take a minute to just a quick 30 minute, 30 minute, a quick minute recess to get the council agenda started here.'",
        "'speaker_3': 'Okay. And we'll start here in just a minute. Yeah.'",
        "'speaker_7': 'Okay. We are ready to recommence the city council meeting. Clerk Can you recall the roll call?'",
        "'speaker_10': 'Councilwoman Gonzalez.'",
        "'speaker_0': 'Councilmember Pearce. Councilwoman Price. Councilmember Superman. Councilwoman Mongo. Councilman Andrews. Councilmember Odinga. Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_7': 'And I'm here. So now we're at the consent calendar. So let's go ahead and take up Ms.. Clarke, the consent calendar. Okay. So we have a motion by council member Urunga. Is there a second by Mungo? Let's go ahead and take public comment on the consent calendar items number two through 14.'"
    ],
    "Recommendation to adopt Specifications No. RFP CM16-028 for Professional Engineering Design Services for the Colorado Lagoon Open Channel Restoration Phase 2A Project (Project); award a contract to Anchor QEA, LLC, of Huntington Beach, CA, in the amount of $300,000, for preliminary design services, for a period of three years, with the option to renew for three additional one-year periods; authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto;  Authorize City Manager, or designee, to execute a Memorandum of Understanding with the Harbor Department and grant first rights of refusal to compensatory mitigation credits generated by the Project to the Harbor Department, in exchange for the Harbor Departments continued contribution to the Project;   Accept a Harbor Department contribution of $350,000 for preliminary engineering design services for the Project; and  Increase appropriations in the Tidelands Operations Fund (TF 401) by $350,000 in the City Manager Department (CM) by $350,000, offse": [
        "'speaker_0': 'Report from City Manager A recommendation to award a contract to Anchor QCA for Professional Engineering Design Services for the Colorado Lagoon Open Channel Restoration Phase two A project in the amount of $300,000 execute in MSU with the Harbor Department and grant first rights of refusal to come compensatory mitigation credits generated by the project to the Harbor Department'",
        "'speaker_0': 'and accept a Harbor Department contribution of $350,000 for preliminary engineering design services for the project district three.'",
        "'speaker_7': 'Thank you. Their staff report?'",
        "'speaker_6': 'Yes. Vice Mayor Councilmembers with a brief staff report from Eric Lopez, our Tidelands bureau manager. Thank you, honorable mayor and members of the city.'",
        "'speaker_7': 'Keep me just for a moment, folks. If you could just quiet down on the way out so we can conduct our our meeting, the business of our meeting. Thank you. Continue.'",
        "'speaker_6': 'Vice Mayor, Members of the City Council.'",
        "'speaker_2': 'On June 30th, 2016, the Board of Harbor Commissioners approved.'",
        "'speaker_6': 'A memorandum of understanding.'",
        "'speaker_2': 'With the City for their continued participation in the Colorado Lagoon.'",
        "'speaker_6': 'Phase two A Open Channel Project. The Division of the Open Channel Restoration Project is to improve tidal, flat, flushing and natural habitat and to create new habitat in the open channel footprint. Approval of the MCU would result in an additional 350,000 financial contribution.'",
        "'speaker_6': 'That is, in addition to an existing $250,000 that is currently budgeted and would allow staff to move.'",
        "'speaker_2': 'Forward with the project. That includes house staff.'",
        "'speaker_7': 'Thank you, sir. Councilmember Price.'",
        "'speaker_5': 'Thank you. Well, I want to thank Eric Lopez and the folks on his team and the city managers team who have been working on this project. This is a priority project for the city, I believe, and especially for the third district.'",
        "'speaker_5': 'It's a fantastic project and we're very excited about getting this underway. The Colorado Lagoon, it's an incredible asset for the third district and the city as a whole. So including this investment in a beautiful and unique location that is a valuable ecologically as well as for families to enjoy recreationally.'",
        "'speaker_5': 'The Open Channel project will help improve the environment for marine life, making it a more impressive habitat and creating a more natural vegetated channel further improving title exchange in that body of water. The Port of Long Beach has been a great partner in helping fund this project, and I'm grateful for their role in making this possible.'",
        "'speaker_5': 'The Colorado Lagoon is regularly rated as at an A by Heal the Bay, which is a huge improvement from years past, and the water quality continues to get better. I encourage everyone to come out and enjoy this great lagoon and I look forward to future improvements as we move forward with this phase of the project.'",
        "'speaker_5': 'And again, I can't thank staff enough for not only becoming subject matter experts and working on this project, but also for working so closely with the community and engaging in a process that's very open, transparent and open to input from members of the community who feel very strongly without them, this project would not be happening.'",
        "'speaker_5': 'So thank you.'",
        "'speaker_7': 'Thank you. Councilwoman Price, is there any public comment on this item? I go and state your name, please.'",
        "'speaker_2': 'Good evening. My name is Dave Paparazzi. I'm a resident of the third district.'",
        "'speaker_13': 'I live at 445 Los Altos Avenue.'",
        "'speaker_2': 'And I currently serve on the board of Directors of Friends of Colorado Lagoon. We want to thank the Council for your support throughout this process. We especially want to be thankful to Councilmember.'",
        "'speaker_13': 'Price for her.'",
        "'speaker_2': 'Leadership and support in making this a priority of her administration. We also want to thank the harbor commissioners and the Port of Long Beach for their support.'",
        "'speaker_13': 'They've been a partner.'",
        "'speaker_2': 'For many years. We're coming on 15 years now. We've been working on restoring the Colorado Lagoon along the way. We also have established an educated and devoted community that fully supports this restoration, and they are excited about the future of the lagoon.'",
        "'speaker_2': 'And that's something that we couldn't have said just.'",
        "'speaker_12': 'Five or ten years ago.'",
        "'speaker_2': 'Through this partnership. We've made great progress addressing the sources of pollution, removing contaminate contaminated sediment, expanding the intertidal zones of the lagoon and revegetated with negative with native plants. Residents from all districts of the city of Long Beach use Colorado Lagoon to swim, to picnic, to relax, and to get close to nature.'",
        "'speaker_2': 'Since it began, this restoration has dramatically improved water quality, as measured by the Health Department and reported by Heal the Bay each year. I think we all rest easier now when we see hundreds of kids swimming in the lagoon and some adult swimming in the lagoon as well, thanks to that improved water quality.'",
        "'speaker_2': 'But our work's not done. The Regional Water Board has set challenging targets for the Colorado Lagoon and in order to meet those, like those TMD Isles, the experts all agree that the opening of an open waterway between the Lagoon and Alamitos Bay is required in order to restore full title circulation.'",
        "'speaker_2': 'Tonight, staff is seeking approval to begin value engineering and design work for this waterway. It's been a long time in coming. We, the Friends of Colorado Lagoon, fully support this and urge you to approve this. Thank you. And I'll just close by saying if any of the council members would care to come down to the lagoon for'",
        "'speaker_2': 'a visit, or if we can be answer any questions in any way, please contact us. We can be reached at Friends at Colorado Lagoon, dawg. Thank you very much.'",
        "'speaker_7': 'Thank you, sir. Next speaker, please.'",
        "'speaker_9': 'Very good. Are you fully supportive of this project? And it's important to understand that. Let me share the genesis of how this concept came about. It's not only important to the third district and to the city, but to Southern California and actually nationwide.'",
        "'speaker_9': 'The concept of the open channel flowed from, I believe it was the 1990 that excuse me, the 2005 Olympic bid when the USOC came to Long Beach and it selected the Long Beach Marine Stadium as the rowing venue for the pending Olympics, which eventually ended up in London.'",
        "'speaker_9': 'We all knew that it was a it was going to be a very, very tough, you know, tough bid because 84 had just, you know, it's very close behind us and so forth. But the committee came armed with NASA's satellite photos that showed what could be done by opening that up and the concept, in addition to the'",
        "'speaker_9': 'tidal flow and so forth, the concept was to allow to provide and the channel can be created wide enough not for any racing, but running room after race and entry room from the staging area that would be in Colorado run and on its land areas for the boats after the regatta.'",
        "'speaker_9': 'In addition to that, it provides people that want to go in and kayak and tour the lagoon 365 days a year. They can do that. The it also will provide an additional over water. So there will be a clear, unfettered 1000 meters within the Marine Stadium, which will not require interfacing with the cross-channel through from the back'",
        "'speaker_9': 'waters so far. So it's a it's a tremendous project. The port is picking up the the cost from the mitigation, and that's the goal. The port needs that because they are our largest economic engine. So it's a win win situation all around.'",
        "'speaker_9': 'I'm going to suggest and I mentioned this before, that on every project, every project, no matter where it is in the city. That the project have a the contractors have a public contact so people can keep track of and provide them input if necessary.'",
        "'speaker_9': 'I'm not qualified to. I know the general specs required, but I'm not qualified. There are other people are and I want to make sure they have a contact and knowledge. Thank you, Mr. Good Counsel.'",
        "'speaker_7': 'Thank you. Thank you. Seeing no more public comment. Will the council cast their votes?'",
        "'speaker_5': 'That's why I just wanted to clarify one thing, that the just because if people are watching, they might get confused where this is just an item regarding the cost of the design. It's actually not funding the open channel project.'",
        "'speaker_5': 'That would be many, many, many millions of dollars more. This is just the design. So I just want to clarify that. Thank you.'",
        "'speaker_7': 'Thank you, Councilwoman Price. Let's go ahead and cast their votes.'"
    ],
    "Recommendation to request City Attorney to prepare ordinances to designate the properties located at 344 West 8th Street, 347 West 7th Street, 539 Daisy Avenue, 711 Daisy Avenue, 2202 East Lowena Drive, 2220 East Lowena Drive, 331 Wisconsin Avenue, 3943 East 5th Street, 1162 Los Altos Avenue, 14 Paloma Avenue, and 3020 East Vista Street as Long Beach Historical Landmarks;  Authorize City Manager to execute Mills Act historic property contracts with owners of 15 historic landmark properties; and  Adopt minor revisions to the Mills Act Guidelines effective  January 1, 2017.  (Citywide)": [
        "'speaker_10': 'Motion carries.'",
        "'speaker_7': 'Thank you. Let's have item number 18.'",
        "'speaker_0': 'Report from Development Services recommendation to request the city attorney to prepare ordinances to designate 11 properties as Long Beach historical landmarks. Authorize the city manager to execute mills. Act historic property contracts with owners of 15 historic landmark properties and adopt minor revisions to the Mount Mills Act guidelines effective January 1st, 2017 citywide.'",
        "'speaker_7': 'Thank you, Mr. West. Ms.. Boda because their staff report.'",
        "'speaker_6': 'Amy Burdick, Development Services Department Head.'",
        "'speaker_5': 'Mr. Vice Mayor, members of the.'",
        "'speaker_0': 'Council, thank you. This is one of those staff.'",
        "'speaker_4': 'Reports where it's concluded with this is.'",
        "'speaker_5': 'A good thing. So we're moving.'",
        "'speaker_0': 'Forward with Mills Act contracts and landmark.'",
        "'speaker_4': 'Status for 15 different.'",
        "'speaker_5': 'Properties. If you approve this action tonight.'",
        "'speaker_4': 'We will work with the city attorney to prepare the appropriate.'",
        "'speaker_5': 'Ordinances and then come back to you for final approval.'",
        "'speaker_7': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_5': 'I just want to say thank you very much, Amy, for your hard work. Appreciate it.'",
        "'speaker_7': 'Councilmember Yanga. It's a good thing. Thank you. As any public comment on this saying none. Let's go ahead to the vote.'"
    ],
    "Recommendation to declare the City-owned property located at 550-572 East Vernon Street and 2515-2545 Atlantic Avenue, Assessor Parcel Numbers 7208-006-908, -912, -913, -914, -915, -916, -917, -919 and -920 (Subject Property) as surplus, authorize City Manager, or designee, to execute any and all documents necessary, including a Purchase and Sale Agreement, with DIDM Development Corporation, a California corporation, or affiliate, for the sale of the Subject Property in the amount of $700,000, and accept Categorical Exemption CE 16-192.  (District 6)": [
        "'speaker_10': 'Thank you. Councilman Andrews. Motion carries.'",
        "'speaker_7': 'Thank you. Number 19 Please.'",
        "'speaker_0': 'Report from Economic and Property Development and Development Services recommendation to declare a city owned property located at 553 572 East Vernon Street and 2515 through 2545 Atlantic Avenue as surplus and execute all documents necessary with the IDM Development Corporation for the sale of the property in the amount of $700,000.'",
        "'speaker_0': 'District six.'",
        "'speaker_7': 'Thank you. Thank you. Anchor Mr. West and Mr. Conway.'",
        "'speaker_6': 'Yes, sir. Mike Conway. Vice Mayor Richardson, members of City Council. This item relates to a former redevelopment property located at the southwest corner of Atlantic Avenue and Vernon Street. The RDA was in preexisting and near-final discussions with the IDM Development Corporation for the purchase and development of the property.'",
        "'speaker_6': 'And the IDM has expressed interest in proceeding with the purchase of the property for affordable housing for seniors. So staff request that City Council declare the property surplus authorized city manager exceed all, any and all documents necessary for the sale of the property except a categorical exemption.'",
        "'speaker_6': 'C 16 Dash 192 and this concludes my report.'",
        "'speaker_7': 'Thank you, Mr. Conway. Councilman Andrew Hay Thank you.'",
        "'speaker_9': 'I'm hoping that Amy and Mr. Conway will say this is a good thing, but I do know the pride of this situation here because I am very glad that despite the setbacks, this item is finally up for purchase sale agreement.'",
        "'speaker_9': 'You know, this project is very dear to.'",
        "'speaker_2': 'Me as a seniors housing.'",
        "'speaker_9': 'And in desperate need, not only in the sixth District, but in the entire city. The project sales agreement is only another way to keep this project on track and keep it aligned with the details and goals that are going to benefit our community.'",
        "'speaker_9': 'And I'm hoping that the providers here and letting them know that this is it, we have to get this off the ground. We must get this done, because this is very important not only for the society, but for the city of Long Beach.'",
        "'speaker_9': 'And I'm hoping that he is here. He's here. Thank you very much.'",
        "'speaker_7': 'Thank you, Mr. Andrews. Councilmember Yanga.'",
        "'speaker_2': 'I want to echo Councilmember D's comments. It's a very important project and I hope that we can get accomplished.'",
        "'speaker_7': 'Thank you. Thank you. Any public comment on this item? Seeing none. Will the council please cast their vote? Thank you.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for a Lease with an Option to Purchase, by and between the City of Long Beach and the Jenni Rivera Love Foundation, a California 501 C (3) corporation, for City-owned property located at 1850-1862 Atlantic Avenue for a day care center, community room and Jenni Rivera Museum.  \n(District 6)": [
        "'speaker_10': 'Councilman Price motion carries.'",
        "'speaker_7': 'Thank you. We've already heard item number 20. So let's take item 21.'",
        "'speaker_0': 'Report from Economic and Property Development and Public Works recommendation to authorize a city manager to execute a lease with an option to purchase buy in between the City of Long Beach and the Jenni Rivera Foundation for city owned property, located at 1850 through 1862 Atlantic Avenue, District six.'",
        "'speaker_7': 'Thank you, Mr. West.'",
        "'speaker_6': 'Mike Conway, Vice Mayor Richardson, members of the City Council. This item replaced the city owned property at 1852 1862. Atlantic Avenue contains a 4800 square foot building, a former playground and an adjacent parking lot, all on a total of 14,600 square feet of land.'",
        "'speaker_6': 'Property was acquired by the Environmental Services Bureau with the objective of developing an educational environmental recycling demonstration depot to educate elementary school children on the benefits of recycling. Project implementation was hampered by budget constraints and the property has remained in its existing condition for a number of years.'",
        "'speaker_6': 'Representatives of the Jenni Rivera Love Foundation approached the city with a proposal to rehabilitate the property for use as a child daycare center, community meeting space, space and a Jenni Rivera museum. To pursue this objective, the foundation would need to invest approximately $200,000 to address the deferred maintenance and capital improvements to the building, the playground and the'",
        "'speaker_6': 'parking lot, and additional funds for tenant improvements. Staff proposes at least the property to the foundation for five years, with two five year extensions plus nine months for early access during due diligence. Rent will begin on the 16th month.'",
        "'speaker_6': 'Rent shall be a dollar 35 per square foot. A building or about 60 $480 per month rent shall be increased every five years by the cumulative change in the CPI, but rent shall also be abated dollar for dollar based upon the value of daycare services provided to the community that are below the market rate for such services'",
        "'speaker_6': ', all on a non-cumulative basis. The lease will also include an option to purchase the property at today's value of $850,000, and that option will expire in ten years. So staff request City Council to declare the property surplus. Authorize City Manager to execute all necessary documents for the sale of the future development property and the lease of the'",
        "'speaker_6': 'government. Use property except categorical exemption. C 16 dash 190.'",
        "'speaker_7': 'Thank you, Mr. Conway. Mr. Andrews.'",
        "'speaker_9': 'Thank you, Vice Mayor. You know, I'm excited to see this come into the sixties. Not only with the late Jenni Rivera, but will create a service needed in our community. I will be 15,000 square feet of land as a daycare community room.'",
        "'speaker_9': 'And imagine I was nothing but a success for Jeanne Rivera's love foundation. Finally, I want to give a special thanks to you, Mike Conley, the director of Economic Property Development, who is retired for helping this project and many others in the sixth District.'",
        "'speaker_9': 'I wish him well on his retirement, and I want to thank all of you for the hard work. I know that voice. When you just hear it, you listen to it because this is the last time you're going to hear this individual.'",
        "'speaker_9': 'Sounds like Vin Scully. You will never, ever hear this voice again, you know, because.'",
        "'speaker_2': 'He always said, when we say why, he.'",
        "'speaker_9': 'Say why not? Thank you again, my love. And you very much.'",
        "'speaker_2': 'Yes.'",
        "'speaker_7': 'Thank you. Councilwoman Gonzalez.'",
        "'speaker_5': 'Just want to congratulate Councilmember Andrews. I know he's very close to the family and I know his hard work is now coming to fruition. So great job.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'Thank you. Any public comment on this item? Seeing none. Let's go ahead and cast our vote.'",
        "'speaker_10': 'Councilman Price. Motion carries.'"
    ],
    "Recommendation to receive supporting documentation into the record regarding the debt issuance by the City of Long Beach; adopt resolution authorizing the issuance of Senior Sewer Revenue Refunding Bonds, Series 2016A, by the Board of Water Commissioners on behalf of the City, in a principal amount not to exceed $11,500,000, and authorize the execution of all necessary related documents.  (Citywide)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': '23 Report from Financial Management and Water Recommendation to receive supporting documentation and to the record regarding the debt issuance by the City of Long Beach. Adopt resolution authorizing the issuance of Senior Sewer Revenue Funding Bonds Series 2060 made by the Board of Water Commissioners on behalf of the city in a principal amount not to exceed 11.5 million'",
        "'speaker_0': 'citywide.'",
        "'speaker_7': 'Thank you. Staff report.'",
        "'speaker_6': 'Yes. We have a cook staff report by our city treasurer, David Nakamoto.'",
        "'speaker_2': 'Honorable Vice Mayor and members.'",
        "'speaker_8': 'Of the City Council before you is a recommendation to receive the supporting documentation into the record. Adopt a resolution authorizing the issuance of senior sewer revenue bonds in the principal amount not to exceed $11.5 million and authorize the execution of all necessary documents.'",
        "'speaker_8': 'The purpose of of the 2016 eight bonds is to refund the outstanding principal of 11.25 million for the sewer systems revolving line of credit. The purpose of the revolving line of credit was to it was to fund capital improvement projects for the city sewer system.'",
        "'speaker_8': 'There was no impact to the general fund as this is an obligation of the sewer revenue fund in the water.'",
        "'speaker_2': 'Department and will.'",
        "'speaker_8': 'Be repaid by revenues charged to customers of the.'",
        "'speaker_2': 'Sewer system.'",
        "'speaker_8': 'City Council action is requested on August 16th, 2016 to allow the city to take advantage of the.'",
        "'speaker_2': 'Current low interest rates. This concludes staff's report.'",
        "'speaker_7': 'Thank you, Councilman Alston.'",
        "'speaker_8': 'Yes. Just one quick question. What what impact will this have on the rate payers? Direct. I mean, is it going to increase their your bills in any way?'",
        "'speaker_2': 'Okay. This refunding was part of our long range finance plan. It's been incorporated into our FY17 budget and that is part of our rate increase for the coming year.'",
        "'speaker_8': 'Okay. I just wanted to make sure we're on record with that. Obviously, this is something that needs to happen and it's responsible financing. And so I would recommend approval.'",
        "'speaker_7': 'Thank you, Councilmember Yeager. Okay. Public comment on this item. Please cast your votes.'"
    ],
    "Recommendation to adopt Specifications No. RFQ AP16-105 and award a contract to HNTB Corporation, of Kansas City, MO, and Jacobs Engineering Group Inc., of Pasadena, CA, for as-needed Design Engineering, Construction Management, and other related services at the Long Beach Airport, in an aggregate amount not to exceed $5,000,000, for a period of four years, with the option to renew for two additional one-year periods, including any necessary amendments thereto, provided that the total aggregate amount is not exceeded.  (District 5)": [
        "'speaker_10': 'Motion carries.'",
        "'speaker_7': 'Thank you. Item number 24 police.'",
        "'speaker_0': 'Report from Long Beach Airport and Financial Management Recommendation to award a contract to AT&T B Corp and Jacobs Engineering Group for as needed design, engineering, construction management and other related services at the Long Beach Airport in an aggregate amount not to exceed $5 million.'",
        "'speaker_0': 'District five.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_6': 'Staff Report. Our interim airport director Juan Lopez is.'",
        "'speaker_2': 'There are some slights to it when you put some slides up. Item 24.'",
        "'speaker_0': 'We have a copy of the video.'",
        "'speaker_2': 'Okay. Here we go. But. Vice Mayor Richardson and members of the City Council. This item relates to the award of an of as needed airport design, engineering and construction management contracts with H and TB Corporation and with Jacobs Engineering Group for the Long Beach Airport.'",
        "'speaker_2': 'The projects identified for these contracts are funded under the FAA Airport Improvement Program and will focus on reconstruction of runways and taxiways to sustain a projected 20 year usable pavement life and updating runways and taxiways to the current FAA standards.'",
        "'speaker_2': 'This involves services of a civil geotechnical and electrical engineering nature. The initial projects for these contracts will be to design for the reconstruction and shortening of runway seven right to five left. The reconstruction of Taxiway F. And the conversion of former runway 16 left three for right into taxiway C.'",
        "'speaker_2': 'Other needs may include design support for repairs for existing facilities such as the concourse, or for repairs to runways and taxiways. The RFQ was advertised for bid in March 2016. 7165 potential bidders specializing in engineering services were notified of the RFQ opportunity.'",
        "'speaker_2': '161 of whom downloaded the bid. The RFQ announcement was also sent to 22 local minority and women owned business groups and was also released in Aviation Daily, a national publication as required by and in accordance with the Phase Consultant's selection requirements.'",
        "'speaker_2': 'The statement of qualifications were reviewed by a committee consisting of the airport's engineering officer, civil, senior civil engineer and civil engineering associate. The top four firms were placed on a shortlist for demonstrating exceptional. Exceptional competence and preferable experience performing comparable services.'",
        "'speaker_2': 'The top four firms were invited to present their qualifications and general project approach to the committee, which was expanded to also include the Public Works Construction Services Officer and a public works civil senior civil engineer. The top four firms were ranked according to various criteria, including technical expertize, key personnel qualifications and previous experience in communication and interpersonal'",
        "'speaker_2': 'skills. The selection committee determined that H. A.B. and Jacobs were the most qualified based upon the criteria specified in the RFQ. The FAA prioritizes AP discretionary funding for projects that are construction ready, which is a project that has been designed, advertise and for which bids have been opened.'",
        "'speaker_2': 'Project seeking priority for calendar year 2017 must be construction ready by May of 2017. Staff request council approval of the recommended action so as to meet the FAA priority date for 2017. AP Discretionary funding for the airport's upcoming runway projects.'",
        "'speaker_2': 'Physical construction for any of these projects will be subject to Future City Council approval. This concludes my oral report. I'm available for any additional questions.'",
        "'speaker_7': 'Thank you. Mr. Lopez Rios. Councilwoman. Mongo.'",
        "'speaker_0': 'I appreciate that you did extensive outreach. I think that the comments of this council have been heard in your outreach. And I think that. We appreciate that. Thank you.'",
        "'speaker_7': 'Thank you, Councilman Austin.'",
        "'speaker_8': 'Thank you very much. And thank you, Mr.. Mr. Lopez, for your staff report. I think he answered a few questions that I might have had, but I do want to have just just for the record, I want to know when.'",
        "'speaker_8': 'When was this capital improvement project? How long has this been in the works?'",
        "'speaker_2': 'So these projects, these are the first of the projects that were identified under Alternative three way of the geometry study the council adopted excuse me, the council approved forward to the FAA for approval in 2010. So they're part of that involved the safety of the runways.'",
        "'speaker_2': 'The overall projects for the geometry study will take between 15 to 20 years to actually implement. These are the first three initial projects that we anticipate to be completed in the next five years.'",
        "'speaker_8': 'Okay. And thank you for that clarification, I think. And why are we shortening runway seven or to five IL?'",
        "'speaker_2': 'We're shortening the runway because it was if you look on your on the map, currently, the runway extends all the way further to the east and crosses our main runway 1230. One of the recommendations of the geometry study was to eliminate what they call this hotspot.'",
        "'speaker_2': 'This is the the crossing of three different runways in one area. Are are alternative runway seven left to five right, which is located on the north part of the airfield, is our secondary runway. And so we we do have the capacity shortening this shortening this runway eliminates the hotspot, but also provides for what is typically the general'",
        "'speaker_2': 'aviation arrivals and departures.'",
        "'speaker_8': 'We can I know I've talked about two five right in the past. I would think that that runway should be utilized more. I think it would do a lot to, I guess, mitigate noise in certain neighborhoods and maybe be more equitable with with our noise dispersed.'",
        "'speaker_8': 'Dispersion throughout the city. I'm in. The question that I think many people want to ask is I want me to ask is what does this project have any sort of nexus to the FISA study whatsoever?'",
        "'speaker_2': 'These these contracts have no access to the FISA study. Any design, engineering or any additional further direction from the counsel relative to the FISA would be handled under its own separate procurement.'",
        "'speaker_8': 'All right. Thank you for the clarification.'",
        "'speaker_7': 'Thank you, Mr. Austin Councilmember Supernova. Thank you. I think Councilmember Austin asked all the questions I had. Just to put it in perspective in terms of the timing, though. The geometry study came about two airport directors prior to you.'",
        "'speaker_7': 'Is that correct?'",
        "'speaker_2': 'That is correct. All right.'",
        "'speaker_7': 'Thank you. And to that point about T5, right, being used, I think last week you had 30 closed at 10 p.m. and you had a flight come in at 2:30 a.m.. That use today, right, as I recall. That is correct.'",
        "'speaker_7': 'All right. Thank you. Thank you. Councilmember Supernova Councilmember Pierce.'",
        "'speaker_4': 'Councilmember Austin answered my questions. I think it's great that we've finally taking a step forward to get this done.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'Thank you. That concludes council comment. Any public comment saying none. Please cast your vote.'",
        "'speaker_10': 'Councilman Soprano. Councilman Sabrina.'"
    ],
    "Recommendation to receive and file the application of Mod Super Fast Pizza (California), LLC, dba Mod Pizza, for an original application of an Alcoholic Beverage Control License, at 4230 Long Beach Boulevard.  (District 8)": [
        "'speaker_0': 'Motion carries.'",
        "'speaker_7': 'He was thinking item number 25 Please.'",
        "'speaker_0': 'Report from police recommendation to receive and file the application of mod pizza for an original application of an ABC license at 4230 Long Beach Boulevard. District eight.'",
        "'speaker_7': 'Councilman Austin.'",
        "'speaker_8': 'I want to just say that I support this. This item would ask for your support as well. My piece is a new establishment that is just the latest and greatest in terms of fast food pizza that will be located in our exciting new normal shopping center or actually complete the shopping center there.'",
        "'speaker_8': 'I have met with the with the representatives from my pizza and I have no issues whatsoever with this permit application. So I would ask for your approval.'",
        "'speaker_7': 'Thank you. I don't see a need for a staff report on this. So unless you object past Mr. West, let's go ahead to public comment. Seeing none. Please cast your votes.'"
    ],
    "Recommendation to adopt the findings of the Pedestrian Safety Advisory Committee relating to updating crossing guard locations at intersections throughout the City based on qualification criteria; and  Receive and file the Pedestrian Safety Advisory Committee report on Crossing Guard Deployment Plan for the 2016-2017 School Year and concur with its recommendations.  (Citywide)": [
        "'speaker_10': 'Motion carries.'",
        "'speaker_7': 'We have item number number 26.'",
        "'speaker_0': 'Next report from Public Works and police recommendation to adopt the findings of the Pedestrian Safety Advisory Committee relating to updating crossing guard locations at intersections throughout the city. Based on qualification criteria and receiving final report on crossing guard deployment plan for the 2016 2017 school year citywide.'",
        "'speaker_7': 'Thank you as our staff report.'",
        "'speaker_6': 'Yes. Public Works director Craig Beck and our traffic engineer, Eric Woods from.'",
        "'speaker_12': 'Good evening, Vice Mayor, members of the City Council. This item before you is the result of a citywide initiative started in 1978 to perform a pedestrian safety advisory committee to look at crossing guard locations throughout the city. So many people think that the school districts have crossing guard responsibility.'",
        "'speaker_12': 'Actually, it is the city we utilize general fund to pay for the crossing guards. So tonight, the peace sack recommendation is before Council for Consideration, which is focused on the crossing guard deployment plan for the 2016 2017 school year.'",
        "'speaker_12': 'And I'd like Eric Winston to just walk through some of the criteria that was used to evaluate these locations.'",
        "'speaker_2': 'Good evening, Vice Mayor, Council Members. The recommendations from Peace Act for the upcoming 2016 2017 school year relating to crossing guards include the recommendation of three new locations for school crossing guards and the removal of seven locations for crossing guards.'",
        "'speaker_2': 'These seven locations have not.'",
        "'speaker_9': 'Been staff for.'",
        "'speaker_2': 'The past six or seven years, so this is not a new loss for crossing guards within the within the city. The criteria we use to look at crossing guard placement and removal is number of students, elementary school students, crossing given location and the number of vehicles per hour that students have to cross conflict with crossing streets.'",
        "'speaker_2': 'And that number varies depending on if you've got a traffic signal or a stop sign or uncontrolled. Other locations have been evaluated as part of this program and have not been recommended because they do not meet those criteria.'",
        "'speaker_2': 'In addition to the school crossing guards, public works and traffic engineering, look at additional pedestrian safety improvements at these locations, whether or not school crossing guards are recommended or not. Some locations have been recommended for enhanced visibility, marked crosswalks, continental style crosswalks or other locations.'",
        "'speaker_2': 'I'm happy to take any questions we have at this time.'",
        "'speaker_7': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_5': 'Yes. I'd like to thank you for your efforts in all of this. I think the Public Safety Advisory Committee, their work in finding locations for us is it's incredible. We've been waiting for this for a long time. So I know a lot of us are excited.'",
        "'speaker_5': 'Quick question. I have one question relative to Third Street. I see Main Avenue is one that is selected, but third and Golden was not selected and I don't know the reasoning why. Do you have that information?'",
        "'speaker_2': 'Yes. Councilmember the of the volume of elementary school students at Third and Main was about twice the number over twice the number as a third and golden. That's why that was recommended over and over. Third and golden.'",
        "'speaker_5': 'Okay. So it was just the amount of students. All right. Thank you very much.'",
        "'speaker_7': 'Thank you. Councilmember Pearce.'",
        "'speaker_4': 'I just want to thank you guys for bringing this forward and being really clear about, you know, the fact that the ones that we're removing haven't had stopped there in a while.'",
        "'speaker_0': 'And just thank you for that.'",
        "'speaker_7': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'I, too, appreciate the clarity. And fortunately there's some misinformation out in the community. And so I wanted to ask a couple of quick questions to make sure that we had the record correct. So, Mr. West, if I remember correctly, the Public Safety Advisory Committee was reactivated last year by this council after having not met since 2008, because'",
        "'speaker_0': 'this council cares about safety, transparency and our community's input on safety. Is that correct?'",
        "'speaker_2': 'Yes, it is.'",
        "'speaker_0': 'At that time, August of last year, the committee evaluated six intersections that were last evaluated for crossing guards in 2005, more than a decade ago. And all of those that were in the fifth District have not had a crossing guard at them since 2009, far before my time on this council.'",
        "'speaker_0': 'Is that accurate?'",
        "'speaker_6': 'That is accurate.'",
        "'speaker_0': 'I know this is Councilman Mongo. Not probably. I know there's only one at home to be confused. So to be clear, I'm using the proper questioning methods. Right. So to be clear, this council's vote does not remove any active crossing guards from the fifth District.'",
        "'speaker_6': 'That is absolutely true.'",
        "'speaker_0': 'Maybe I should have been a lawyer. Susie's inspiring me. Furthermore, the proposed budget for school crossing guards budget is budgeted for an increase from last year's 972,000 to a proposed budget of $1.142 million in 2017. So should this Council approve the proposed budget, we would be furthering our commitment to public safety and the safety of our intersections'",
        "'speaker_0': '. Is that accurate?'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Wonderful. I just want the community to know that this council is more active and more committed to public safety than we have seen since, I believe the record shows 2005. Thank you.'",
        "'speaker_7': 'Thank you, Councilwoman Mongo. Councilman Austin.'",
        "'speaker_8': 'So I want to first say objection for leading the witness, but thank you for the staff report and the clarity. I have one location obviously in my district that I am a little concerned with because it is slated for elimination.'",
        "'speaker_8': 'One of the sites is Duley Elementary School and the location is Daisy and Alamo. And I know that it hasn't been starved for for several years, but we are we're there's some changes happening in that direction, that neighborhood that that could could impact this.'",
        "'speaker_8': 'And I just would like to know, how often is this going to be evaluated, the Peace Corps, how often are they meeting? And will there be opportunities for for the community to kind of weigh in? Should there be some changes?'",
        "'speaker_12': 'Councilmember, as you heard, that this committee has been lax in meeting. But we think it's an important thing to review on a regular basis. So we we have actually the city's traffic engineer who participates in the Peace Act meetings.'",
        "'speaker_12': 'We'd be more than happy to reevaluate this site if you believe that that something has changed since we looked at it about a year ago and come back to this council, if we have findings that would dictate that it should be added.'",
        "'speaker_8': 'I would just just ask that you do some outreach to the school community and to the principal at Dula Elementary as well, because I'd like to and I do know that that, you know, the participation on the BP stock has been optimal either.'",
        "'speaker_8': 'And so I want to make sure that, you know, we make sure that everybody is at the table.'",
        "'speaker_12': 'Certainly happy to do that.'",
        "'speaker_8': 'All right. Thank you for the clarity.'",
        "'speaker_7': 'Thank you, Councilman Austin Councilmember. Thank you. If panelists will indulge me, I would just like to mention one crossing guard from the fourth District, Connie Donati, who retired this year after 22 years of service, walking that route between the third and the fourth District on Atherton at Studebaker.'",
        "'speaker_7': 'And Connie is 78 years old. She watches the meeting. So I hope she's watching this item. And she's 78. And they calculated that each day she steps up on the curb 75 times. So it was time for retirement, I think.'",
        "'speaker_7': 'Thank you, Connie. Thank you, Councilmember Eureka.'",
        "'speaker_2': 'Thank you, Councilman. Vice Mayor. Excuse me. I notice that there's very good. Only one that. In West Palm Beach. I have four or five schools in West Palm Beach and only one crossing guard. How is it? Is that a correction?'",
        "'speaker_2': 'It's only for the elementary school. Is that it? That's correct. Only elementary schools. Okay, I stand corrected. Then I will. They will.'",
        "'speaker_7': 'Thank you. Is anything public?'",
        "'speaker_0': 'Councilmember Mongeau I received a text message from the community, so I thought I would add one more clarifying point on redirect. Mr. West, is it true that all of the intersections that we have evaluated in the Fifth District that have not had crossing guards for quite a long time, but are now here on this docket.'",
        "'speaker_0': 'Are now. Signaled intersections with buttons that people can push for green.'",
        "'speaker_6': 'Yes, that's what I understand.'",
        "'speaker_0': 'Wonderful. So we've made those intersections more safe. Yes. Thank you for that.'",
        "'speaker_7': 'Thank you. Councilmember Durango.'",
        "'speaker_2': 'My chief of staff is earning her her pay today. She indicates to me that they have about four elementary schools, some that are key to it, and yet only have one crossing guard was at Garfield. Polina. But in.'",
        "'speaker_2': 'Mr. WEBSTER So I think that there's a disproportionately number of categories lacking in my district, perhaps. I want to take this offline and perhaps let's talk further about what I have my needs in that area.'",
        "'speaker_12': 'Catherine. We'd be happy to work with your office to identify particular intersections that you believe we should study in. Have future inclusion in this in this program.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_7': 'Thank you. And is there any public comment on this item saying non, please cast your votes.'",
        "'speaker_0': 'Motion carries.'"
    ]
}