{
    "Recommendation to adopt resolution approving the 2019-2022 Memorandum of Understanding with the Long Beach Police Officers Association; and": [
        "'speaker_0': 'So I want to make sure that we hear them. And so we're going to do item 21/1 and then we will go back to the regular agenda, including hearing item number one and the other items.'",
        "'speaker_3': 'I am 21 Report from Human Resources Recommendation to adopt resolution approving the 2019 to 2022 Memorandum of Understanding with the Long Beach Police Officers Association. And adopt a resolution of intent to approve an amendment to the contract between CalPERS.'",
        "'speaker_2': 'And the city citywide.'",
        "'speaker_0': 'Thank you. We're going to hear a staff report first.'",
        "'speaker_9': 'Thank you, Mr. Mayor. Members of the city council. We are happy to be here tonight to recommend an agreement with our Police Officers Association for a three year agreement. We'd like to walk through a number of the provisions of that document.'",
        "'speaker_9': 'And for that, I will turn to Alex Vasquez, our human resources director.'",
        "'speaker_2': 'Good evening, honorable mayor and members of the City Council. You have before you a memorandum of understanding and applicable resolutions between the city and the Police Officers Association. The city and PIO had over 13 session negotiation sessions since May of 2019, resulting in the M.O. you before you the way agreed to a three year term contract term'",
        "'speaker_2': 'that provides structural wage increases that are in part offset by having employees pay a portion of the city's pension costs. The general wage increases include a 4% effective October 1st, 2019, 3% effective October 1st, 2021, and 2.5% effective April 1st, 2022.'",
        "'speaker_2': 'There are no structural increases in year two. Instead, the agreement includes a one time payment for all employees, with some exceptions of $2,000, effective October 1st, 2020. As I indicated earlier, the agreement also includes a provision for classic safety employees, which represent approximately 70% of the PEO membership to pay an additional 3% towards the city's employer contribution'",
        "'speaker_2': 'to CalPERS, bringing their total contribution from 9 to 12%. This pension pickup implementation will require a contract amendment with CalPERS. To all the contribute so that all the contributions will be credited to the employees account and the city will still realize the savings from this pension pickup.'",
        "'speaker_2': 'In order to start this contract amendment, the Council must adopt a resolution of intent to approve a contract amendment between CalPERS and the city. The amendment process.'",
        "'speaker_3': 'For the.'",
        "'speaker_2': 'Cost sharing arrangement also requires a vote of the power members and a council vote on an ordinance authorizing this contract amendment. Staff will bring the ordinance to the Council for consideration after the appeal membership vote and after we work with CalPERS to put together this contract amendment.'",
        "'speaker_2': 'In addition, this Simiyu agreement also includes several changes to skill space, one of them being the advanced boss pay certificate. By increasing it from 7.5% to 10% of the top step of police officer salary at step five, it also provides two new additional skill pays for officers assigned to SWAT and officers assigned to the Dove team.'",
        "'speaker_2': 'And there's also a change to the detective administrative and administrative pay, skilled pay. We negotiated agreement that provides for a review of this skill pay and also identified approximately 30 positions that will no longer receive this skill pay.'",
        "'speaker_2': 'Effective October 1st, 2019. Some of the other major provisions of the CMU include changes to the over time bank maximum, which is going to be increased to 120 hours by 2021. The EMU also contains some new provisions that provide parental leave to all employees if they meet certain criteria.'",
        "'speaker_2': 'And it gives them approximately 30 days or 160 hours of paid parental leave for the adoption birth of a child or foster placement of a child in their home. The MCU also provides an additional city holiday to be determined by the city council and also makes adjustments to vacation in lieu holiday that will assist us with when'",
        "'speaker_2': 'we implement our new LBE Coast system. There are no increases to these benefits, but just a modification as to how we track them in the new payroll system. In addition, there are a couple of enhancements for the department operations, which includes modification of the probationary training for police recruits that will allow the department to deploy officers.'",
        "'speaker_2': 'And as long as they're partnered with another officer at month ten, as opposed to month 12, which is current, and they're currently going through 12 months of training. And then we're also implementing a detective rotation program, which will allow police officers to gain experience in the detective assignments.'",
        "'speaker_2': 'This will also assist with. And giving officers an opportunity to experience a different side of police work. There are also other provisions that are included in the Emmylou, that are non-monetary, that are just codifying current department practices, such as including a provision that explains bereavement leave, military leave, a process for processing documented counseling.'",
        "'speaker_2': 'Again, these are current processes that are in place, but the Emmylou just codifies it and has a place where employees can see information regarding these provisions in one place in their Emmylou. In addition, there is a new provision regarding SB 1429 1421, and I'm going to turn over to Tom to explain that provision.'",
        "'speaker_9': 'Thank you, Marin. Counsel and thank you, Alex. I would like to spend a little time talking about the SB 21 provision as that's been a topic in the media. And I know we have some speakers here tonight. So as we all know, SB 1421 is a new landmark law that the state passed, providing kind of unprecedented access'",
        "'speaker_9': 'to certain files that really had not been disclosed before, not only to the public, but also to officers themselves. And so we are in the process of releasing those documents. In fact, we made a big release earlier this week.'",
        "'speaker_9': 'And I want to talk a little bit about this provision to clear up to clarify some things. So first, back in April, this is when this issue started where the Police Officers Association requested that as this information go out because it is public record, that they also had the ability to have access to those records.'",
        "'speaker_9': 'We worked through our city attorney and came up with a process that we believe fully complies with SB 1421, but also provides that balance to give officers the ability to have access to those documents, especially because some of those are going to be coming out and giving them some time for their families to prepare for some major'",
        "'speaker_9': 'information that has not been released before out in the newspapers. So through that, we started that process back in April, the way as we came closer to negotiations, asked to codify that administrative process in the memo you which is appropriate because that's where all of the documents reside that deal with employee management relations.'",
        "'speaker_9': 'And so one of the key tenants is that praise are already public record. So praise are whether you are getting that data as a public record or you're requesting that data as a public record, that is all something that everyone has access to.'",
        "'speaker_9': 'And so the process we created was to notify the officer at the same time that the requester has been notified that documents exist, that that officer would have, at the end of the process, five days to review the documents.'",
        "'speaker_9': 'But I want to clear up some confusion. They cannot change those documents. They cannot delay those documents. They cannot ask for documents to be withheld. And if they do, that will not be honored. The only way that we would do any of those things is if a court is ordering us to do that and they go through'",
        "'speaker_9': 'a due process system to order the city to do that. If the employee cannot, you know, review within those five days, the city would release the documents anyway. So we do believe that this provides a balance between full compliance with SB 1421, but also recognizing that there are both officer safety and officer wellness issues and for them'",
        "'speaker_9': 'to be able to notify and prepare their families for the release of that information. Long Beach is not the only agency to do this. There are six other agencies that we know of. L.A. Sheriff, San San Francisco Police Department, Sacramento Sheriff, San Bernardino Sheriff, Riverside Sheriff and Riverside PD.'",
        "'speaker_9': 'One of the topics that we have heard is that there are, you know, potentially if there's any misuse of this information, that that could have a chilling effect. I want you to know that this will not be tolerated, that any misuse of that information, that is misconduct and that is most likely a criminal act as well.'",
        "'speaker_9': 'And that will not be tolerated by the police department or by the city. We also have the ability for request of public records to be anonymous. We have a system that allows that and people do avail themselves of that today.'",
        "'speaker_9': 'So if anyone wants to submit anonymously, they may. And one other thing that we're doing is we're proactively putting all this information on a website so you don't have to ask for it in the first place so that someone doesn't have to go through a process of asking for it as those documents are available.'",
        "'speaker_9': 'It's on a website, in fact, that website launched earlier this week. So with that, we stand ready to answer questions. The city attorney, myself and our police chief or assistant chief is here. And with that, we will turn it back to the mayor and council.'",
        "'speaker_0': 'Thank you. I do have a motion in the second maker of the motion. We're going to go ahead and ask the public comment and then we'll come back to the Council of the Council for motions and questions. And so I'm going to ask folks to come up as I call you up, please come forward.'",
        "'speaker_0': 'In this order we have. Foster, Stefan, Boris and swallow. Very good, Hugh added. Tushnet and Bridget Cervelli are the first five speakers. Please come forward. Go ahead.'",
        "'speaker_5': 'Thank you, Mr. Mayor. City Council. Mr.. Your city manager. Wherever he left for tonight, I want to say thank you to everyone that's involved in this contract, to the city management staff, specifically to Alex Vasquez and her staff and all.'",
        "'speaker_5': 'If she's here, she worked many long hours and getting this done along with city finance. Just to put it in historical perspective of this financially. Look back when the Great Recession hit in 0809, it was the play that was the first one to the city to do pension reform.'",
        "'speaker_5': 'Then when the economy continued to be very tough, it was the power was the first back to the city that did a contract modification to save the city's finances. And again, here we are first in the city to do additional additional pension pickup for the city.'",
        "'speaker_5': 'So we appreciate that. We're leading the way. We hope others will continue to follow. We think it's the right thing to do. This contract also sets the precedence for our peers in the fact that it is the right thing to do to continue to pick up and make sure that we're doing our part as far as the'",
        "'speaker_5': 'city's finances and pension. I do want to say it's a bit disturbing and really unnerving that the complete conversation about what's really a smart and fiscally prudent contract has been hijacked over the last week by some really irresponsible press.'",
        "'speaker_5': 'Denzel Washington gave a great quote I couldn't find one better and said, If you don't read the news, you will be uninformed. If you do read the news, you will be misinformed. And that's exactly what's happened here. An irresponsible journalist put out a half truth piece of information, has misled the public into believing some falsehoods.'",
        "'speaker_5': 'And I really owe an apology to the people here who are to speak, because you've done a disservice. Thank you, Mr. Potter. Thank you, sir.'",
        "'speaker_0': 'Next speaker is different. Burson Twitter.'",
        "'speaker_5': 'Send Sulu. Thank you. That's a step toward some social democratic socialism in America. Long Beach. I'll be brief, as apparently the mayor is so insecure in his own policies that he can't stand more than 90 seconds of criticism at a time.'",
        "'speaker_5': 'I'm here today to speak on the menu from the IPO to the massive pay rise for police officers, which was deliberate and secret, is offensive in its own right, especially in light of the past patois induced austerity for other city departments.'",
        "'speaker_5': 'The fire department in particular should be asking why they are not receiving any of this benefit when there are only four fire inspectors on the city payroll right now. But the ammo use curious decision to undermine public safety protections, including SB 1421, are even more offensive.'",
        "'speaker_5': 'For a city department plagued by scandals involving excessive force and a complete disregard for mutual discovery rules. This more use inexplicable term, allowing officers both a five day head start and the identity of any requesting party after a Public Records Act request lacks any conceivable public interest.'",
        "'speaker_5': 'As a defense attorney and a resident in the city memo, that was as to why this policy is being proposed tonight. As a socialist state, it's fascist. This prospect of removing even the pretense of accountability over an agency entrusted with the monopoly of force in the city is downright chilling.'",
        "'speaker_5': 'In closing, I please ask that the council review the article written by Steven by retired Deputy Chief Steven Downing, proposing eight different questions as to why this policy is being enacted and what protections are going to be available for the requesting parties for public records of records.'",
        "'speaker_5': 'Record requests. Act. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. Very good. Here. She's not here. Okay, we're moving on. Meditation, please.'",
        "'speaker_2': 'The M.O..'",
        "'speaker_3': 'You with the Police Officers Association contains at least one clause that I'm really thrilled to see, which is the.'",
        "'speaker_2': 'Extended parental leave. I think that's very important.'",
        "'speaker_7': 'Should be a model for the entire.'",
        "'speaker_3': 'City, actually, for the entire nation. On the other hand, releasing names of those requesting public records will have an effect on our suppressing.'",
        "'speaker_2': 'Public involvement in accountability.'",
        "'speaker_3': 'It doesn't have to be active suppression.'",
        "'speaker_4': 'It will have a.'",
        "'speaker_3': 'Chilling effect that people will know that.'",
        "'speaker_4': 'Their names.'",
        "'speaker_3': 'Have been released. No one for a positive city environment. We need accountability and openness. No one should fear. Even if you say it's.'",
        "'speaker_4': 'Not going to happen, any reprisal when they act.'",
        "'speaker_3': 'To ensure true public safety.'",
        "'speaker_2': 'Please do not ratify the memo until.'",
        "'speaker_3': 'The offensive clause is release is removed.'",
        "'speaker_0': 'Thank you very much. Is Brigitte Cervelli here? No. Okay. So let me go to the next set of speakers. I think it is Dawn, Aliya, Jordan, Darlene, carelessly, and Kim to very close folks, please come forward. In that order.'",
        "'speaker_0': 'Dawn first, then Alia, then Jordan over the first three.'",
        "'speaker_7': 'Good morning. So we're going to Don in Canterbury. You're going to switch places.'",
        "'speaker_3': 'Good evening, members of the Long Beach City Council. My name is Kim Tilbury. I'm a resident of Long Beach and a member of Black Lives Matter and other organizations in Long Beach. I'm reading from an open letter to the Long Beach City Council members that was sent via email today.'",
        "'speaker_3': 'And I also have hard copies for those of you that may not have gotten to your email. So the letter is in response to this, definitely the agenda item 21, the LIPA Association request for acceptance of a proposed MRU.'",
        "'speaker_3': 'The provision is a blatant undermining of Senate Bill 1421, a landmark policy police transparency law that went into effect January 2019. Senate Bill 1421 mandates disclosure of police reports and discipline records. Whenever an officer was dishonest sexual abuse to a public, to a member of the public and where there are serious uses of force, such as police'",
        "'speaker_3': 'shooting. Specifically the section that we're asking to be removed, section nine public records request where the officer is notified of the date the person requests the information, the person's name, the organization that they're with, and any nature of information about that person, I think it's completely dangerous.'",
        "'speaker_3': 'So approving this memorandum would show that the city of Long Beach are in the business of valuing police privilege over legal transparency, protecting police, violent police officers, and overlooking the safety of our community. This is a dangerous mistake and unacceptable to the residents of the city.'",
        "'speaker_3': 'In one unified voice, we demand that you remove Section nine of this memo you before voting.'",
        "'speaker_0': 'Thank you so much, Mr. Barak.'",
        "'speaker_2': 'Oh, and lastly, there.'",
        "'speaker_3': 'Are 20 organizations that signed this letter.'",
        "'speaker_0': 'Thank you, Mr. Barak. I think, Don. Yes.'",
        "'speaker_7': 'We do time from 3 minutes to 2 minutes. Good afternoon. And I think this is a it's an opportune time for council to stand with its constituents. Just on the right side of history with this people voices with political pressure from the air.'",
        "'speaker_7': 'And we're all only made aware of this last week. I think it's pretty clear that like these are efforts for police departments across the state to attempt to circumvent Senate Bill 1421. No department wants to disclose records of misconduct by their officers who have raped citizens, who have physically assaulted citizens who have murdered citizens.'",
        "'speaker_7': 'People who have been impacted by state violence have been seeking for years to get information on their assailants who have committed hard harm against them and have not been able to. And finally now we have 1421 and police officer associations are seeking to protect these violent officers, which is troublesome.'",
        "'speaker_7': 'My concern mainly I'm going to cut a lot of this out is for the family members who I've been working with for the past five years who are directly impacted by police violence and murder are the families for Dante Jordan and Tyler Woods know a premium.'",
        "'speaker_7': 'Noelle Aguilar, Hector Motorhome. Jason Coleman, 34. Mariah. Lionel Gibson. Barry Prag. Davon Thomas. If they're family members who now finally have information about how these officers were disciplined, have they murdered before? Are these officers still on the force?'",
        "'speaker_7': 'And where are they? And and you continue to try to block it. And now they want to use city council to try to do that. If they have a problem with state legislation, they have to take that up with the state.'",
        "'speaker_7': 'It is not you guys is responsibility to help them circumvent this law.'",
        "'speaker_0': 'Thank you. Thank you very much, Don Elliott.'",
        "'speaker_4': 'Hi. My name is Aliya Sheik. I work in the labor movement in partnership with several unions. I use public records regularly in my work to hold employers accountable to their job commitments. So I especially understand how important it is for the public to have access to public records without barriers and without fear.'",
        "'speaker_4': 'This provision in the police union contract disincentivizes constituents from requesting public records. It's one thing when staff at a good.'",
        "'speaker_3': 'Governance group.'",
        "'speaker_4': 'With organizational support requests something and another one an individual does. We know that that the most vulnerable residents historically don't have a trusting.'",
        "'speaker_2': 'Relationship with law enforcement.'",
        "'speaker_4': 'And it's not comforting to anyone knowing that an officer can easily overstep boundaries with.'",
        "'speaker_2': 'Information about us. I shouldn't have to remain anonymous. I don't.'",
        "'speaker_4': 'Understand why BPD would seemingly be rewarded with such access when they've already shown contempt for the public's ability to hold them accountable by using Tiger.'",
        "'speaker_2': 'Text. I think that's enough of a misconduct. It's horrifying for democracy.'",
        "'speaker_4': 'If that is something that you care about. While the city as an employer should engage in good faith with organized labor. Please see the.'",
        "'speaker_2': 'Difference between police who have so much physical power and authority over residents how they're different from from other.'",
        "'speaker_4': 'Types of workers. In my opinion, I don't see this as part of a respectable labor initiative. Please negotiate to remove this provision from the police union contract. Thank you.'",
        "'speaker_0': 'Thank you very much. Jordan, darling. Then carelessly. And then I'm going to ask the next set of speakers, Audrina Redman, so I can see and Shante Campbell and and Cantrell, if they can start making their way up to the podium.'",
        "'speaker_10': 'Yes. Hello, City Council. And Mr. Mayor, my name is Jordan. I'm here today to ask you to take out section nine of the EMU contract. Obviously, SB 1421 was passed as a transparency bill. We all talked about that.'",
        "'speaker_10': 'You all know this because you authorized to destroy records right before that law went into effect, thousands of them that we can no longer do public.'",
        "'speaker_5': 'Records.'",
        "'speaker_10': 'Request for. And there's been approval in the new budget, as you know, to charge anybody who files these requests, the costs of police time to redact things, things like that, as well as giving more money to the police department for records.'",
        "'speaker_5': 'These two things are pretty.'",
        "'speaker_10': 'Clear that you're that these are designed to go around that law and discourage people from actually doing these information requests. Obviously, the message is clear. We're all getting it. I think one of most disturbing things about this, though, is the five day notice.'",
        "'speaker_10': 'Pat West recently released a memo where he said that and it's.'",
        "'speaker_5': 'Been mentioned before that.'",
        "'speaker_10': 'The information will not be stopped unless there's a lawsuit. So you're basically just kind of opening yourself up for the Police Officers Association to just sue the city repeatedly every time there's a records request, at least for anything significant.'",
        "'speaker_10': 'So that opens up the city to a lot of legal danger. And I have to ask, like, how many millions of dollars are going to get paid out in wrongful shooting lawsuits before now? We're going to have to play suing us as well.'",
        "'speaker_10': 'Like, where's this money going to come from? It's ridiculous. So I'd ask you to strike Section nine. Thank you.'",
        "'speaker_0': 'Thank you. Carelessly.'",
        "'speaker_3': 'Carelessly. And this is one of those topics that's worthy of more than 90 seconds. First I want to look at the fact that it says here in the newspaper that a pay and benefits increase of roughly 30,000 per year.'",
        "'speaker_3': 'Is is what's been negotiated here. And that seems like it's excessive. I didn't do the numbers myself and I can't validate that. But if someone was presenting that to me, I would be looking in depth at those numbers.'",
        "'speaker_3': 'Secondly, that Section nine, I think, bothers everyone. The proposed MRU. The proposed amendment already operational. I really want to question that already operational. That's not in the law. The law didn't intend that. Somebody here made that up at the company I worked at.'",
        "'speaker_3': 'The ethics coordinator instructed us to always tell the truth and further to avoid the appearance of impropriety. This is the appearance of impropriety when you go off and change the way that this law was intended to work. No one said that the person who's being looked into deserves an additional five days to look at it.'",
        "'speaker_3': 'That came out of the poea and I can understand the peo asking for that. Any department head would want that. What it does is it gives you the opportunity for spin control and it gives you the opportunity to frame your defense.'",
        "'speaker_3': 'So I'm next. Thank you.'",
        "'speaker_0': 'Thank you. Next is andrea redmond for mispronouncing audrina.'",
        "'speaker_3': 'You are is audrina. Audrina, audrina redmond. I am here to close the letter that Kim Tiberi started reading and to list for you the two organizations that have signed on to this letter, all of whom are very esteemed organizations working diligently for families and against police violence.'",
        "'speaker_3': 'And Section nine allows for the continuing sanctioning of police violence because it allows them yet another way to hide from public accountability. So some of these supporting organizations include Black Lives Matter, Long Beach, Black Lives Matter, Global Network, Showing Up for Racial Justice, Immigrants Rights Coalition.'",
        "'speaker_3': 'Los Angeles County Public Defenders Ask Me Local 148. CSU Oby Black Student Union Greater Long Beach Interfaith Communities Long Beach Community Action Partnership. Long Beach Coalition for Good Jobs and Healthy Community Council on American-Islamic Relations. Housing, Long Beach, Los Angeles Alliance for a New Economy Come My Girls in Action Sanctuary Coalition.'",
        "'speaker_3': 'Stop LAPD Spying Coalition. American Civil Liberties Union Long Beach Forward Black Alliance for Just Immigration Long Beach Area Police and Peace Network. National Lawyers Guild, CSU OLB La Raza. Students for Quality Education, Long Beach. Sacred Resistance. Democratic Socialists of America Long Beach Chapter and Affirm.'",
        "'speaker_3': 'They can't all be wrong with the information they have and you be right.'",
        "'speaker_0': 'Thank you so much. Our next set of speakers tonight can be shot at Campbell and Cantrell. I think it's on the side that Mubarak and Camilla Holmes, if those next, please come forward, please.'",
        "'speaker_10': 'So I can say sixth district resident.'",
        "'speaker_5': 'I like many.'",
        "'speaker_10': 'I don't know about a misinformed press. I feel like the press is one of the few safeguards of the rights of citizens. So I just find it odd when state, you know, structures are telling people not to read the paper.'",
        "'speaker_5': 'But that being.'",
        "'speaker_10': 'Said, I did read the paper. I'm a fond subscriber of The Beachcomber, as well as the Long Beach Post, and we have both been press publications that are covering this local scandal. One of many in the last year or two regarding our law enforcement.'",
        "'speaker_8': 'And I just want to I'm sure we've all read this. We all know about why people don't like this.'",
        "'speaker_10': 'So I just I'm just curious. Now they have an opportunity to stand in front of the city council. Maybe Mr. Downing, in his in his article, said that he didn't get any response from anyone from the council. So I'll just ask some of the questions.'",
        "'speaker_10': 'What the 30 seconds I have left. Number one, he says that the employee has all of the rights under SB 1421, as does a citizen if the employee wants to exercise that right. Why does he or she need to know if a citizen has exercise that right?'",
        "'speaker_10': 'This being the you know, the the citizen that's asking about the public records. And number two, to what purpose does the people in the city believe information.'",
        "'speaker_1': 'About the requester it will benefit the.'",
        "'speaker_10': 'Employee. These are the questions we would like the city council to answer. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_3': 'And Cantrell and I agree with all the questions that have been asked, especially. The last speaker's comments about not reading the newspaper. How else are we going to find out about this? It seems that Mr. West had already started this.'",
        "'speaker_3': 'Allowing the. People to get this information from the clerk back in April. And now, just now we're finding out about it. I'm also wondering about the connection between the amount of money that each one of you, except for Janine Pearce, has received from the peel away in between 2017 and today.'",
        "'speaker_3': 'Mayor Garcia. Maybe this is wrong. The Beachcomber says that you have received $117,800.'",
        "'speaker_0': 'That's wrong.'",
        "'speaker_3': 'Richardson 8400. Austin 6950. Susie Price A measly 2650 EUR. Angus 7858. Stacy Mungo 8200.'",
        "'speaker_0': 'Thank you for you catch up.'",
        "'speaker_3': 'And Girls Supernova and the Andrews only 750, etc.. Congratulations.'",
        "'speaker_0': 'Thank you very much. Let me go ahead and is I'm sorry if I want to say, is Shante Campbell here? No. Okay. Nusseibeh Mubarak is next. And then after the sidebar is Camilla Holmes. And then Maureen McHale.'",
        "'speaker_5': 'Please.'",
        "'speaker_2': 'Hi. My name is New Sabir. I'm a community organizer in Los Angeles. On behalf of the Council on American-Islamic Relations Care, California. I wanted to say that it is the right of the people to access police records instantly and anonymously.'",
        "'speaker_2': 'And Long Beach should lead by example. We need to know the record of police officers who we entrust with armed weapons to protect us. Long Beach Police Officers Association should not have the opportunity to hide officer officers information as it has before in the murder of Douglas Douglas Zarb, an innocent, unarmed man, a black man standing on'",
        "'speaker_2': 'his back porch. Police officers do not need extra time to cover their tracks. We, the people do not need to provide our information when we request police records. Police officers already have access to their records. So this resolution does not ensure officer rights.'",
        "'speaker_2': 'It takes our rights. So this is not a balanced resolution. As I heard a speaker say, five days. I should be able to receive a police record instantly as soon as I request it. If citizen's information is public and available, police officers should be held to an even higher standard.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you so much next week and please.'",
        "'speaker_3': 'Good evening. My name's Camille Holmes. So I know you guys already know this, but I just want to emphasize that I think it's really important. SB 1421 mandates that personnel records be made available to the public, where an officer shoots at somebody, an officer uses force that results in death or.'",
        "'speaker_3': 'Bodily injury, an officer sexually assaults a member of the public. An officer has been dishonest, whether it be true for an investigation, prosecution or other police misconduct. In short, SB 1421 applies where it is found that an officer has done harm to the community.'",
        "'speaker_3': 'As proposed Section nine of the Ipoa M.O. you does a disservice to the community. It prioritizes police convenience, comfort over the community, needs the same community that the police have already done harm to and perpetrated trauma on. And for what?'",
        "'speaker_3': 'To protect police officers reputation. So they won't be blindsided. I trust that an officer with a record of misconduct knows what they did and should be prepared to address that at any moment. Section nine unabashedly intends to thwart the intent of SB 1421.'",
        "'speaker_3': 'That is shameful. I proposed this to the Council. Please do not need any more protection. Their union, the legislature and the city already protects the police officers at the expense of the community. We are your constituents. We are the community that elected you.'",
        "'speaker_3': 'We should be your priority.'",
        "'speaker_0': 'Thank you very.'",
        "'speaker_3': 'Much. I urge you not to accept this MRU as it is.'",
        "'speaker_0': 'Thank you very much. And our next set of speakers are two competing importers of Marine Mickael, Sheila and Andrew.'",
        "'speaker_3': 'Hello. I'm Maureen McHale, a long time resident of Long Beach, and I'm in the fifth District. So I'm asking that the. Section nine. Of the memo of understanding that was added b be removed. It was made operational in April and it was never brought to light that this was part of the M.O..'",
        "'speaker_3': 'You we know that a number of the council members and my council member, Stacey Mungo, received money from the Police Officer Organization Association. That was significant since 2017 to support your officials, U.S. officials. Janine Pearce is the only council member not receiving any money from the poppy.'",
        "'speaker_3': 'So there is a quote that says the department will provide this opportunity. Well, with this Section nine, the department will provide the involved officer five days to review the documents. It will also provide the officer sufficient time to file a legal action in court to prevent disclosure.'",
        "'speaker_3': 'So I am asking that Section nine be removed from the memo of understanding. Thank you.'",
        "'speaker_0': 'And Sheila here and then Andrew.'",
        "'speaker_2': 'I'm here on behalf of Black Lives Matter, but.'",
        "'speaker_4': 'I'm going to be reading a letter from Clu, which is the Clergy and Laity United for Economic.'",
        "'speaker_7': 'Justice. This letter is in response to the Long Beach City Council's upcoming vote.'",
        "'speaker_4': 'Regarding 20 item number 21, regarding the Police Officers Association and the memo, you specifically Section I X Long Beach Post September 10th article on this proposal stated that the Long Beach City Council is set to review and approve the menu and provision whereby Long Beach police officers would be informed if someone asked to see officers public records'",
        "'speaker_4': 'of misconduct or times they use potentially deadly force. This is a blatant undermining of Senate Bill 1421, the landmark police transparency bill that went into effect in July and January of 2019. Senate Bill 1421 mandates disclosure of police reports and discipline records.'",
        "'speaker_4': 'Whenever an officer was dishonest, sexually abused a member of the public, or when there was a serious use of force such as police shootings. Approving the levy EPD contract with this provision would show the Long Beach community that you value police privilege over legal transparency and the community's protection and safety.'",
        "'speaker_4': 'That would be a dangerous mistake and unacceptable to the residents of long of the city. This is an open and joint letter by Long Beach residents and organizations, including Black Lives Matter, Long Beach, showing up for Racial Justice and Clergy and Laity United for Economic Justice as people of faith and advocates for workers, their families and immigrant'",
        "'speaker_4': 'communities. Clue strongly urge you to remove Section I of this menu.'",
        "'speaker_7': 'Before the vote.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_10': 'Hello, Mayor and City Council. My name is Andrew Montano with the Democratic Socialists of America, Long Beach. I'm here to speak against Section nine of the Power's menu. Growing up, I would hear stories of police intimidation and violence from police officers attending parties, violating young women and threatening my cousin if she said anything to unjustly handcuffing my'",
        "'speaker_10': 'brother and his friend and purposely dropping them off in rival gang territories. But it wasn't until I started working as a legislative aide to then Councilwoman Lena Gonzalez that I saw and heard of the corruption from within. A trusted community resident approached me during the community event to explain to me that her son was unjustly detained and'",
        "'speaker_10': 'told he was, and I quote, a piece of shit and would never amount to anything by a police officer on patrol. Even though that kid was working and being a positive role model to his friends and family. I forward this information to South Division Commander Michael Lewis and luckily he addressed the issue and had a conversation with'",
        "'speaker_10': 'the police officer. However, a few days after the commander had that conversation, the police officer patrolled the same area until he found the community's community resident son and stopped him. The officer harassed the young man and asked, Why are you trying to get me in trouble?'",
        "'speaker_10': 'Not knowing it was actually a concerned parent who informed me. He then proceeded to ask his friends, Why are you all hanging around a snitch? He tried getting me fired. If you come from certain communities, you know, snitching is not tolerated.'",
        "'speaker_10': 'What would this officer hope to do was indirectly cause harm to this young man by hoping to manipulate his friends to inflict harm. That officer is still on patrol, along with the officers who unjustly killed those individuals Don mentioned.'",
        "'speaker_10': 'If you allow this to pass, you are making it that much easier for these same officers to intimidate, harass and cause violence to our communities more than what they already do. Thank you, Andrew.'",
        "'speaker_0': 'Okay. That concludes public comment. Councilman Price.'",
        "'speaker_4': 'Oh, I'm sorry about that. I have a question for the city attorney. Can you talk a little bit about the petition process that some of the speakers spoke about regarding petitioning the court to prohibit the release of records that the officers would have the option to do?'",
        "'speaker_4': 'It's not listed in Section nine, but I'm sure it's the public has referenced it.'",
        "'speaker_10': 'If I understand the question correctly, if the if the officer who is given the opportunity to review the files believes that the city through our process has either put it in contain records that they believe don't comply with SB 1421.'",
        "'speaker_10': 'The only way that the city will not release those records is if they file an action in the court and the court orders the city to withhold certain documents that are part of the 1421 disclosure.'",
        "'speaker_4': 'And I understand that. I'm aware of the letter. I'm asking, is it part of the Poea contract because it's being referenced and it's not in Section nine.'",
        "'speaker_10': 'That Section nine is reads as it is and it's not in there.'",
        "'speaker_4': 'Or fact, I just wasn't sure if I was looking at the correct version because this is Section nine is a 15 line section that's been included in here. And honestly, some of the comments not necessarily tonight, because I think the comments tonight were accurate, but some of the comments that I read coming into tonight make some inferences'",
        "'speaker_4': 'from these 15 lines that are actually unreasonable given what these 15 lines actually say. The one question that I do have is Perez, can they be filed anonymously?'",
        "'speaker_9': 'Yes, they can. And they often are.'",
        "'speaker_4': 'Okay. What I'd like to do is I'm going to make a motion that we approve this. But as part of my motion, I'd like to request that both the city manager's office and the police department create an interface on their websites, on their public facing websites that allows a PDF billable form that is a public request form'",
        "'speaker_4': 'that allows for an anonymous option so that that would be an option that would come down in the menu. So anybody who wants to file a PRA can easily file it anonymously. And I think making it easy for people to be able to file an anonymous PRA requests will allow individuals to not be afraid of exposing their'",
        "'speaker_4': 'identity when they file the pre. And so I don't know if that's possible.'",
        "'speaker_9': 'So if I can explain our anonymous pre process, so we have for the last several years allowed anonymous praise and we used to do it very much similar to that through a form where someone could give it to us.'",
        "'speaker_9': 'The problem was they still had to transmit it to us in some way. Whether they created an email address that they'd have to create an email address that was, you know, kind of a dummy email address, or they'd have to walk and give it to us.'",
        "'speaker_9': 'Over the past two years, we have enhanced our peer system. We have a third party and it has a complete, separate way to do it, where there is no connecting information whatsoever, there is no email address that is required.'",
        "'speaker_9': 'It just allows you to go in, you get a code that you can use and so that is currently in use. On the city manager side, we are under review today or realizing that is not activated yet on the PD side and we would be happy to turn that on.'",
        "'speaker_9': 'We can turn that on very quickly. PD currently accepts anonymous ones through the the other method where you don't have to say your name, but you can certainly turn that on as an improvement.'",
        "'speaker_4': 'Yeah, I mean, I'm on the city manager's website right now and it could just be me, but it's not as easy to just click on the PRA option and submit it. The PDF form shows up, but at least without clicking on too many buttons and looking at it, it looks like it's a form that you have to'",
        "'speaker_4': 'print. And somehow am I not mine? I'm looking at the site right now. So what can you maybe tell us? I'm looking at requests for public records on the city manager's website and then it says, fill out the public records form.'",
        "'speaker_4': 'So if you click on that, it's a PDF form with no electronic submission option.'",
        "'speaker_9': 'So there should be a when you get into the system, there should be a way to say log in and create your request or to log in anonymously. There's a there's a split. And so the log in anonymously is the way to do that.'",
        "'speaker_4': 'Okay. Well, let me just say again, it might just be me. It doesn't seem user friendly to me. It could totally be me. I do pride myself on being able to get around electronics a little bit, and this doesn't seem easy to me.'",
        "'speaker_4': 'So if we can make that interface easier so that people can go in and file anonymous ones, because what I'm hearing is that's one of the major concerns is that the requesters name and or organization is disclosed and it shouldn't have to be.'",
        "'speaker_9': 'Absolutely. We can certainly enhance that. I'm on the site right now and it has a a log in section and then it says submit anonymously and then gives you examples how to do that. We will make that certainly easier and upfront so that people can understand that right away.'",
        "'speaker_4': 'Are you looking at it on an iPad or a desktop.'",
        "'speaker_9': 'On an iPad?'",
        "'speaker_4': 'Okay. Me too. So maybe you can show me how to do it. But either way, if we could just make it very easy. That would be great. The other thing is, you know, I think that in my opinion, I do believe that the police officers should get notice of what's going to be discovered.'",
        "'speaker_4': 'I think that that is only fair. When anyone is accused of misconduct, they should get notice and they should have the opportunity to review that material before it is publicly disseminated.'",
        "'speaker_0': 'Guys, we need to make sure that. Thank you. We need to make sure that the councilman's speaking. So please, she has the floor.'",
        "'speaker_4': 'So I respectfully disagree. And I understand that there are others who may not agree with me. And that's the beauty of our system, is that we're not always going to agree, but trying to find an opportunity to address the major concerns if there is room to do that, I think is progress.'",
        "'speaker_4': 'I personally believe that our process of justice demands due process when allegations are made against anyone. I will say that while I can't speak for specific instances or specific situations, I work in a profession where every single day the 80 or so employees that I supervise make disclosures all day long with officers who have conduct involving moral'",
        "'speaker_4': 'turpitude or conduct involving what we call Brady. And so we make those those disclosures every day. I take that very seriously. And I have never in my 20 years as a prosecutor ever come across a single police chief who has ever, in my experience, asked us to hide something, redact something or sugarcoat something.'",
        "'speaker_4': 'I'm not saying it doesn't happen. I'm just speaking to my own experience. So I will say that I appreciate this contract. And I think that if we can try to make Perez more accessible for people to file anonymously, I think that will go a long way in addressing some of the concerns that have been raised.'",
        "'speaker_4': 'I think, you know, at this point, the most important thing for us to figure out is how do we improve this process and of the multiple cities that are implementing this process. I will say that allowing for easy, anonymous praise to be filed is more progressive than a lot of cities have that have looked at this are'",
        "'speaker_4': 'entities. So I'm grateful that our staff is willing to do that. Now, I do want to talk about the provisions of the plaza that I think are a huge success for the city of Long Beach. And I want to share kind of my thoughts on that.'",
        "'speaker_4': 'I want to thank our city team from Human Resources and of course, the leadership of the posse on working on what I believe to be a very fair contract. I want to thank the Powar for agreeing to the increased employee pick up for the pension.'",
        "'speaker_4': 'As everyone knows, our pension liabilities, our unfunded liabilities in the area of pensions are by far the highest unfunded liabilities that we have. So it's okay for us to say we have other unfunded liabilities, but it's dissent. Disingenuous to argue that the other unfunded liabilities are even remotely close to where our pension pension unfunded liabilities are.'",
        "'speaker_4': 'So the fact that we're addressing that and we're trying to be more proactive and aggressive with how we're addressing pension issues for for the future is is very important. And again, I think it's progress in terms of our financial status.'",
        "'speaker_4': 'I also like the probationary training police recruits aspect of it. I like that it increases our patrol staffing capabilities. I think that's something that's really going to speak to the needs of the community with the community wants more patrols and they want more police officers in the in the community.'",
        "'speaker_0': 'We're going to and just real quick, Councilman, I want to make sure that we've had a public comment now the council with opportunity to speak and make comments. So please continue. Thank you. I ask those in the public, please, to be respectful of the comments thanking you.'",
        "'speaker_4': 'I know I speak from my own experience in my contacts with with my residents that they definitely want more patrols. We want more police officers patrolling our alleys, our streets, our parks and our beaches. And so allowing this partner.'",
        "'speaker_4': 'Relationship through this contract that we've negotiated, I think allows for higher capabilities for our staffing, and I'm grateful for that. So I want to thank everyone for bringing these issues to light, and I'm hopeful that this contract is going to pass tonight.'",
        "'speaker_4': 'I just want to make sure that we have some provision that addresses the concerns of the residents. And that's why I bring the option of the PDF Sellable Form that allows for easy online submissions of anonymous forms. This contract was going to pass with or without that provision, but I think that provision helps address some of the'",
        "'speaker_4': 'concerns that are raised tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_1': 'Thank you, Mr. Mayor. And I want to thank, first of all, the residents who came out and spoke this evening expressing their concerns. I want to, first of all, say congratulations to our city team, as well as our Police Officers Association for coming to an agreement and for those of who have been involved in the collective bargaining'",
        "'speaker_1': 'process. It's not an easy process. It's long, it's arduous, it's complicated. And to to reach this point, to have an agreement is actually a milestone. Understanding that there are some some some misinterpretation and misunderstanding regarding some of the language.'",
        "'speaker_1': 'You know, that happens. But I'm glad we have an agreement. And I will just say, from from from from my core, I think due process is is very important for for all city employees we represent and for anybody else, for that matter, who may be accused of something or charged with something.'",
        "'speaker_1': 'Like it or not. I would also just like to just say that the city council has invested millions just in the last couple of years in response to many of the complaints that we've heard and many of the concerns that have come to this council from people in the community who have a mistrust for public safety and'",
        "'speaker_1': 'police officers today. I want to say that all of our police officers will be equipped with body cameras. We have invested in data as well as invest in a website portal that actually discloses and provides more transparency than we ever have.'",
        "'speaker_1': 'And in terms of public records, acts request, you know, I know I've been subject to several of them and many of the city council members as well. It doesn't mean that we were all guilty of something, right? Public records request come all the time and it's part of operating a public entity.'",
        "'speaker_1': 'SB 1421 There's been a lot of conversation about that, and this particular clause speaks to that. It does do something. It gives a tool to the public, to the press, to to advocates attorneys today that wasn't there a year ago.'",
        "'speaker_1': 'Right. Today, information and transparency has now forced in disclosure is forced through this legislation. And I have heard nothing coming from our city attorney or city staff that says that we won't be providing that information. So that's a good thing.'",
        "'speaker_1': 'And I want to just say, speak to too many of the advocacy organizations that spoke here today. You've been to the council member meetings before. Your advocacy has been tireless in the community and and in other forums. And you guys have impacted change.'",
        "'speaker_1': 'This legislation that we're speaking out today was largely because of many of the efforts that you guys have put forth. I want to say that also you've impacted change in terms of, I think, the culture of this city, particularly our police department.'",
        "'speaker_1': 'And I do want to have an opportunity to ask a couple of questions to our our deputy chief in city management in 2019 and 2018. How many officer involved shootings that we have? Total.'",
        "'speaker_5': 'Thank you, Councilmember. Let me get that information for you. It was 2019 zero. You asked about that zero officer involved shootings, one unintentional discharge. That doesn't count as an officer involved shooting. And let me pull up the number for you on the back to you on how many for 2018.'",
        "'speaker_1': 'Okay. I'd like to know 2017 and 2018, but I want to mark and note that in 2019 we're seeing zero and it's already halfway through September. I think that's something to be noted.'",
        "'speaker_8': 'Yes.'",
        "'speaker_0': 'Okay. Thank you very much, guys. I want to make sure that we're counterman also on the floor.'",
        "'speaker_1': 'So also what i heard also this was a concern of of possible intimidation and coercion and retaliation. Currently. Are there any administrative provisions or laws that prevent an officer from from engaging in that activity?'",
        "'speaker_5': 'Absolutely. Council Member So first, I'll go back to the numbers. I just pulled them up. 2017, we had eight officer involved shootings. 2018, we had four officer involved shootings. 2019, we have zero. So that's the first part. The second part is if if the use or the information that is released regarding a requester for a public record'",
        "'speaker_5': 'is used in any way to harass, intimidate or stock an individual when it would be misconduct and not tolerated and could potentially be criminal. And we would file against that officer if that was the case.'",
        "'speaker_1': 'So is there any policies currently that specifically state that it is will not be tolerated and you will be subject to just discipline if severe discipline if you did if you engaged in such activity.'",
        "'speaker_5': 'So, Councilmember, there's no policy related to SB 1421 because that's new legislation. But the policy that the officers would have to comply with is professional conduct in conduct unbecoming of an officer if they were to do something like that.'",
        "'speaker_5': 'And also they are required per policy to comply with all state laws.'",
        "'speaker_1': 'I'd like to see a policy developed specifically out of the concern that we've heard here today to put a a check in place, particularly as we move forward. I plan on voting in support of the the item in front of us.'",
        "'speaker_1': 'Again, I understand that it took a lot of sweat equity time effort to get to this point. And I don't think I see anything within SB 1421 or the current provisions that we have for it that would prevent the transparency or disclosure of information as requested.'",
        "'speaker_1': 'And I do think that there's an opportunity to do some public education, particularly for advocacy groups out there, to try to inform folks that they do have that option to to to file anonymously and request an anonymously. Thank you for your information.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_11': 'Thank you, Councilman. Also, Councilwoman Pierce.'",
        "'speaker_2': 'Thank you. I want to begin by saying that I was absent at the last closed session meeting where this contract was negotiated. I had had emergency gallbladder surgery and was not supposed to be back at work for three weeks.'",
        "'speaker_2': 'And I tried to come to work that day and I couldn't make it the whole day. So what happened after that day is nobody raised any flags. No one said we had approved anything until the agenda item was posted and until the post the press had lifted up some of the items in there.'",
        "'speaker_2': 'And so I want to start by saying that I think there are some good things in here that there's some step increases that I think certain officers deserve. I think that we've got a parental leave, which I think is important, although the way that it's done, I have some some questions about I think the the pickup the'",
        "'speaker_2': 'employee pickup is is great. And so I want to applaud those efforts. It's no secret that every time we bring up a police officer contract or issues like that, that I have a lot of questions. I have also said from the very beginning of my term in office that I know that we have a lot of great'",
        "'speaker_2': 'officers that took a risk and they put their life on the line every single day. I've had the privilege of getting to know a lot of great officers in my district that work very diligently to make sure that we're reducing crime, that people feel like they can trust them, and that they're doing that part.'",
        "'speaker_2': 'But I also know that systems are oppressive and that it takes a lot of change and a lot of ground work to make substantial changes so that people feel protected, that they are protected, that they have trust and that they don't feel intimidated.'",
        "'speaker_2': 'And so I think pushing back on some of these issues is absolutely the right thing to do. And I don't want anyone in this room to feel like comments that were made by the first speaker should make you feel like you shouldn't get up and speak.'",
        "'speaker_2': 'You absolutely should read the press. I don't agree with the press. A lot of the times that's no secret. But I think that you absolutely should ask difficult questions. And I applaud you for coming out and speaking, and I applaud you guys for the work that that's been done to get us to this point.'",
        "'speaker_2': 'We wouldn't have police cameras today if it wasn't for your advocacy. So thank you for that on the front end. I want to talk about the parental leave. I know I talked to city management a little bit and I won't take up too much time on this.'",
        "'speaker_2': 'But we had drafted an agenda item where we had asked the city to come up with a way to provide parental leave for the entire city. And I was asked to kind of hold back that we were going to assess what was the best way to do that.'",
        "'speaker_2': 'We had some conversations around should that be in bargaining? And the next thing I know is that we find out that PO has it in their contract. Of course, I'm happy. Of course. I want you to have parental leave.'",
        "'speaker_2': 'Can you answer for me how it was? Decided to offer them 30 days straight parental leave. And what decisions were made around state disability and not having employees pay into that first.'",
        "'speaker_9': 'So I'll have Alex Basco to talk about those specifics in terms of providing and to employees. That is something that we are addressing at the bargaining table and we'd be happy to talk to you more in closed session about how we're going to do that through a negotiation process.'",
        "'speaker_9': 'Alex, if you can answer the other part of the question, please.'",
        "'speaker_2': 'Yes, sir. Just to kind of. Address a meeting, confer items so that providing these types of benefits is a mandatory subject of bargaining. And so we do that through the IMO you process. So the 30 days that we're providing paid parental leave provides of 160 hours for this particular milieu of time off that employees can utilize and'",
        "'speaker_2': 'employees done during those 30 days. This is a separate benefit. Don't have to use their vacation or their sick time and it provides them with paid leave at 100% of their pay. The difference with SDI is that that requires an employee deduction of 1% that they have to contribute and it comes out of their wages.'",
        "'speaker_2': 'And that benefit is not as generous. It provides between 60 and 70% of their wage loss, and it's only it's capped up to a certain amount. So this benefit that we're providing, in my opinion, is much more generous.'",
        "'speaker_2': 'Not a lot of cities are offering this benefit. So we're actually at the forefront. There are very few cities that do provide this type of benefit in California. So I know my office and I know another office has done a lot of research on this.'",
        "'speaker_2': 'And there are some cities that do SDI first. And it should be noted that state disability is not only for pregnancy or having a child, but you have cancer, you have gallbladder surgery, and you have to be out that.'",
        "'speaker_2': 'I've had a lot of employees talk to me about wanting to pay into SDI. So I guess my question is, did you do research to look at what cities and places have done SDI first and then the city backfill the rest to get them longer than 30 days?'",
        "'speaker_2': 'Because I know all of you guys have kids and I know that 30 days is not enough to spend with your child when they're first born. So figuring out that gap, did we look at that as an option?'",
        "'speaker_2': 'And we we did do some benchmarking with other cities to see what they offered. And we are we do have a plan that is one of the first groups that we reached an agreement with. We are in. Close to concluding negotiations with FFA and we are currently at the table with four other groups and going to be'",
        "'speaker_2': 'starting with the remainder of the bargaining units. So I'd be happy to to brief the council in closed session as far as what our plan is for the rest of the bargaining units and go into more detail about that.'",
        "'speaker_2': 'Thank you. And I'll just I know that this isn't the end of the conversation. Again, I support, obviously, paid parental leave being in there. I personally wouldn't want to bargain against my wages and time with my children. And so I have some some concerns about the way that we bring that up.'",
        "'speaker_2': 'And I'll let it sit there for now and bring it back. In reference to the item that we've been talking about tonight. I want to let's see, I want to start off with saying it's good to hear that my colleagues like due process.'",
        "'speaker_2': 'I would like due process to. So can you answer if S.B. 142 requires people to requires the name to be released to police officers or that department.'",
        "'speaker_4': 'So it's not a requirement, but it is something that is.'",
        "'speaker_2': 'Allowed under the PRA. Okay. Can you answer the question for me? What's the purpose of a name on the front end? Why is why did we go with provide your name and then you could opt out to be anonymous?'",
        "'speaker_2': 'Why didn't it start? You are anonymous unless you want your name to be revealed. So since the PRA was enacted.'",
        "'speaker_4': 'Members of the public have been able to file PRA request anonymously. That has not.'",
        "'speaker_2': 'Changed. So I think the conversation that that was had by previous speakers was allowing someone to to check anonymous. But that's an additional step. And if you're, uh, if you're someone that's been disenfranchized, if you're someone that has been going up against a system that you're not used to filling out those forms, I'd want to be able'",
        "'speaker_2': 'to say that very first year it's anonymous. And then you check if you want your information provided. I see. Mr. Parkin, do you guys have a.'",
        "'speaker_9': 'So we have a dual path when you get to into the system. This new third party that we have, they have a you have a decision to make, do I want to go one route or do I want to go another route?'",
        "'speaker_9': 'So if you go the route where you're logging in and you're creating a system, an identifier, and that helps you as the requester to get updates, to be able to email, to tell us what you would like to receive.'",
        "'speaker_9': 'That's one system. The other is completely anonymous. And so they are two different systems. And if we need you, we can put them side by side. So it's very clear that you can go either direction and we can support either one.'",
        "'speaker_2': 'Okay. That would not I'm not going to say which way I think the vote is going to go tonight, but I think that my my press is that we don't that we put anonymous first. And if that means that that's the top of the website, that it's bright, that there's some kind of identifier that people that aren't'",
        "'speaker_2': 'used to filling out these forms, like I'm a mother of a son that's been shot and killed, who is under distress, doesn't accidentally mess up on her pre request and then now is terrified of retaliation. I mean, that's real life situation.'",
        "'speaker_2': 'As much as we can create a system that we think is perfect, real life situations are where those things get blurred. Can you answer for me why this went into practice in April?'",
        "'speaker_9': 'So this was a request from the pope that came to the city via their normal process of of interacting with management. They asked the city attorney for an opinion and how to help create a process. We saw this as an administrative and restorative issue.'",
        "'speaker_9': 'The city attorney ran it by the police department, ran it by city management. And we believe that this meant that both the intent, the spirit of SB 1421 and was something that we could put into place. And so that was put in place by management.'",
        "'speaker_9': 'And then it was then later codified into the memo, you know.'",
        "'speaker_2': 'So can you answer for me how praise are handled with other departments?'",
        "'speaker_9': 'Is there a specific question? I can certainly try.'",
        "'speaker_2': 'Well, I have an example in my head that I wasn't necessarily going to share, but there was a PR done on all of my emails. There were hundreds of them and I got notice 5 minutes before that package went to the press.'",
        "'speaker_2': 'So, yes, I'm an elected and I'm under different scrutiny, but I want to know, it seems like praise to me is a procedural policy that adheres to the entire city, not one department. And I would hate to create a process for one department.'",
        "'speaker_2': 'That's not fair to the entire city.'",
        "'speaker_9': 'So we create a process in general. It's informal that if you are getting a pre, you have access to that as well. I remember that.'",
        "'speaker_2': 'Day. Sure. You guys.'",
        "'speaker_9': 'You had to send that out. And yes, we do believe that they are public records in the person who gets the requests has access to those as well. It is not as formal as what is in the agreement here.'",
        "'speaker_9': 'I would say the difference is this was a formal request from a labor organization going through a process saying, you know, through the bargaining process we would like access to this information. Here is our proposal. And so we were followed a slightly different path.'",
        "'speaker_9': 'The the specific language that you have here on on 1421 is really only for 1421. It is not going to be for every other PRA and honestly, most people who are prayed and we are all prayed very often we see those documents because we're the ones helping to produce those documents as well.'",
        "'speaker_9': 'This was their personnel file, something that they don't haven't seen as they don't have access to normally these types of documents. And so it is slightly different.'",
        "'speaker_2': 'Well, we do know that while the PRA if I gave you one email, you can still go through and say, actually, we think that these other ten emails. So I, I have a real issue with this proposal because I feel like it's a policy that should be adhered to and created for the entire city so that things'",
        "'speaker_2': 'like politics don't get involved, so that it's equal across the board and so that people don't fear retaliation. They can go forward, they can ask for that information and do what they want to do with that information. So if this item is still in this, I will definitely be voting no unless some of my colleagues can come'",
        "'speaker_2': 'up with an option to pull that memo due out and go back to the drawing board or make those changes and come back. But it's not something that I can support today. But I think everybody, again, for speaking, I think the Police Officers Association for their efforts as well.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Thank you very much. I want to make sure just as a friendly reminder, I know we're going to ease into all the rules, but after 5 minutes, if we can just continue going on and then we'll cue back up so we can go back up.'",
        "'speaker_0': 'So I know we've let it go a few times and that's okay. I just want to make sure remind the council as we as we move forward. So, Councilman Richardson.'",
        "'speaker_8': 'Thank you, Mr. Mayor. Still getting used to our new rules. I'll say so a few things. So I want to acknowledge and traditionally with a collective bargaining agreement, you know, we start with the knowledge and all the good things.'",
        "'speaker_8': 'And so I do want to acknowledge all the work on both sides in negotiating a fair deal that also accomplishes and is the first union to address the the full pension pick up. And it's a great standard to to set given we know that we have pension issues, unfunded liabilities and budgetary issues on the horizon.'",
        "'speaker_8': 'So I do want to lift up and recognize that also as as a parent, you know, fairly new parent. Well, not that new, but, you know, got little ones. You know, the parental leave issue and the FMLA and parental leave issues been an issue, an issue in Long Beach for a long time.'",
        "'speaker_8': 'I'm glad to see this is addressed here. And I and to be clear, I think this should be addressed for all city employees. I think all city employees, we should be opting into parental leave and figuring out a way to make that happen.'",
        "'speaker_8': 'So those are my issues there. I want to. So so I want to separate and talk about this issue that's come up and a lot. It's actually been a lot of good discussion from my colleagues on Section nine.'",
        "'speaker_8': 'So my thoughts, my thoughts and my questions are firstly that we've learned a lot in the last in recent years about the shifting legislative landscape around compliance and public records. We also learned a lot during the Tiger tax issue about updating our policies to keep up with shifting laws.'",
        "'speaker_8': 'This is yet another example, in my opinion, of the city council and the city not being proactive on a shifting law and allowing for the guidelines in the process of that law to be determined by a collective bargaining process.'",
        "'speaker_8': 'I want to say that this is not. The community's fault. This is not the police union's fault and this is not the press's fault. We should own up and take our responsibility. If we don't put forth local policies, you cannot hold the union accountable for negotiating the best position for their workers.'",
        "'speaker_8': 'That's what unions do. I understand collective bargaining. You can't blame them for that. You can't blame the press for going out and talking about a collective bargaining agreement if we haven't shaped the narrative. This is on us. I want the opportunity and we've said this during Tiger to text and I'll say it again now.'",
        "'speaker_8': 'I think the council and the city should be proactive and take the opportunity to shape and discuss policy in public within the light of day, not in closed session, but as a part of a larger conversation about how we address and handle public records and transparency.'",
        "'speaker_8': 'I personally believe any question on transparency you should air on the side of being overly transparent. And so. So let's let's get into this issue. I've heard actually a lot of good ideas and discussion from the council tonight.'",
        "'speaker_8': 'I heard Councilwoman Pryce say the process of making, you know, making sure that someone is has the ability to be anonymous is not clear on the website. I also heard Councilwoman Pierce say that, you know, when you go submit a pre adding your identity ought to be the optional part, not making it autonomous.'",
        "'speaker_8': 'You know, anonymous should be the optional part. I think both of those make sense. I subscribe to things and then at the end it says, Would you like to add your name, your email address or so on and so forth?'",
        "'speaker_8': 'I think this is what this process should be giving, number one. It's on us. We didn't proactively address this, and we now have to operate outside of the collective bargaining agreement to shape the policy on the fringes. So, Mr. Moga, is something like that possible?'",
        "'speaker_9': 'Yes. So during this discussion, we've been putting together some thoughts about how we can address the council's concerns. I think they're very valid. I think this is a good opportunity for us to to look at that. I think I'm formulating kind of four different areas that we we can focus on.'",
        "'speaker_9': 'One is to remind people when they submit a pray that your pray is probable, that happens a lot. People will submit something and then they'll submit something else to say. I want to see, you know, if anyone else submitted what I submitted.'",
        "'speaker_9': 'So I think a reminder, when you are submitting a pray that that is by itself creating a public record that is available to others. And I believe we can enhance our anonymity features. We mentioned before just through this review that PD has an anonymous process, but they could be using the same system that the city manager's office'",
        "'speaker_9': 'uses for other praise to enhance that. And then in that feature, and we can turn that on, we can create that even path for anonymity so that you show up and you have two paths. And there it's very clear that you can go one way or the other and not prefer one over the other.'",
        "'speaker_9': 'That certainly was never our intent. But when you lay out a website, you read the top four, so we can address that. And then again, you know, we mentioned this earlier, but I do want to highlight that we are trying to create and putting the data out there so you don't have to request it in the first'",
        "'speaker_9': 'place so that we have that new website. Now, you don't need to log on. You don't need to submit an anonymous request. All of our 1421 data will be available to the public without saying who requested to put that up.'",
        "'speaker_9': 'And so that is active and now and reminding people that want 1421 data to go there first without even having to go through the pre process.'",
        "'speaker_8': 'Thank you. So a few of the things I want to lift up. So so I took took a moment to read this letter that just came in from the ACLU, and I read it while I was sitting here.'",
        "'speaker_8': 'Unfortunately, you know, a lot of this came in, you know, over the weekend, and we're just getting a chance to look at it. Mister City Attorney, have you had a chance to look at this ACLU letter?'",
        "'speaker_10': 'I have just seen it this evening.'",
        "'speaker_8': 'Okay, I will. I will. You know, this is an incredibly legal conversation. There's a claim that we're out of compliance with public records laws. I don't know if that's true. I know laws are changing and shifting, and I actually don't need an answer today.'",
        "'speaker_8': 'What I'd like is I would like for you to actually analyze some of the claims here and the model ordinance that's there and tell us if there are any deficits, what we're doing. I would like to I would like to know that.'",
        "'speaker_8': 'And so would it be possible for you to do some sort of analysis or to run for and come to us and let us know where we are in terms of our California public records laws?'",
        "'speaker_10': 'Absolutely.'",
        "'speaker_8': 'Okay. On the conversational anonymity, it's been brought up a few times and I want to bring it up again, just to be very clear on this on this question. So does this email you in any way diminish the right of a citizen to be anonymous in their records request?'",
        "'speaker_9': 'No, it does not.'",
        "'speaker_8': 'Okay. So it sounds like in practice, the way that we actually achieve that, how we implement this, the council is still fully up to the council and up to city staff on how this is implemented, to make sure that we're not somehow inadvertently giving an advantage to one side than the other in terms of anonymous versus not'",
        "'speaker_8': 'anonymous. You're going to we're going to figure out a way to make that make more sense. That's correct. Okay. And given the shifting in hanging on, I think our my goal here is to try to understand it and try to address the issue and these questions.'",
        "'speaker_8': 'And I think all of our questions are, too, do those things help understand the concerns that have been raised and help figure out a path to address these concerns. So given the shifting lands, the legislative landscape around public records, are there any additional steps that we can take to make sure as changes happen, the public is advised'",
        "'speaker_8': 'or noticed on a regular basis on any changes to to the law. Are we thought through any way to proactively when people come to our website, any prey website, either PD or the city's or maybe it should be one website, not two?'",
        "'speaker_8': 'Is there a way to proactively state, hey, these are the changes and here's how we're implementing these changes?'",
        "'speaker_9': 'So, yes, we have thought that through. We mentioned that earlier so that everyone gets a disclaimer, a reminder right up front in clear language if there are any changes. So we can look at that on the landing page.'",
        "'speaker_9': 'We can also do that as you as you actually file your request, whether you're doing it anonymously or not. We think that's a good practice and we will look to do that.'",
        "'speaker_8': 'So the next area I want to I want to talk about, which has been touched on as well, is there were questions raised in this ACLU letter about the integrity of an investigation or the integrity of a process being somehow compromised through this.'",
        "'speaker_8': 'What I would like to know is what provisions are in place. To make sure that once parties are notified that there's a peel pre, the investigation is no way compromised. Are these things tracked? Right. Has there ever been an instance where we've notified an employee that something's going to go out an employee's engaged and somehow it hasn't'",
        "'speaker_8': '? The information that was going to go out hasn't gone out. Has that ever taken place in our city? And what mechanisms do we have to make sure the integrity in that process?'",
        "'speaker_9': 'As Assistant chief. He wished to respond to that.'",
        "'speaker_5': 'Thank you, Mr. Modica. Thank you, Councilmember. That has not happened. We have released records that were requested and they have not been withheld because of an employee inquiring about those records.'",
        "'speaker_8': 'Okay, so my. My job. Thank you.'",
        "'speaker_10': 'Councilmember, if I could just add to that, there have been cases or instances where an employee has raised an issue or asked that certain records not be withheld. And the police department has a process in place where it goes through the chain of command and they they will review that request.'",
        "'speaker_10': 'And as the chief said, there have been no instances where that request has been honored. Those records have gone out.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_10': 'And there is a process.'",
        "'speaker_8': 'Okay. So what I heard a bit earlier and I want to be crystal clear on this, what I heard a bit earlier was that the only way that could be changed or or held up was through a court order.'",
        "'speaker_10': 'And that's true for the 1421 records. We were talking about other public records, not just 1421. So we have to subject matters here. We have 1421 very specific. And then you have your general public records, documents under the general public record documents.'",
        "'speaker_10': 'There have been requests by employees not to release records at that request has been reviewed and then the decision was made. Note that those records were all going out under 1421 at that five day stage. That's going through the final review process before they go out.'",
        "'speaker_10': 'So there's no delay, like an extra five day delay. And then if if there was a court order, then the city would not withhold, would then not.'",
        "'speaker_8': 'Sit on those records. So the provision email, you were specifically to the 1421 or is it apply to both?'",
        "'speaker_10': '1421 only.'",
        "'speaker_8': 'So as it relates to this provision, only a court order can affect that? That's correct. Understandable. So which raises a separate issue, right. I think in general, we need the time. I think the council needs the time and space to talk about these policies in general as it applies to every department.'",
        "'speaker_8': 'Because simply what you just notice is that I didn't know there was a process for someone to go engage a department and say, I don't want this to be included, make their case, and then that department makes a decision.'",
        "'speaker_8': 'I want to better understand that and make sure that, you know, separate from 1421 across any department we track. When APRA comes in, we fully understand what changes have happened and why we want to. In this environment we have to always erring on the side of more transparency and build slowly, build community trust.'",
        "'speaker_8': 'So, so, so for the sake of sake of this, I think this was actually I would have rather had this conversation sooner than later. But I think it's important that we get to this conversation after tonight's vote on this contract.'",
        "'speaker_8': 'I think it will put the community. The council are all of our bargaining units, all of our employees. It would it would do well to give everyone a bit more stability and confidence in knowing what the rules are and that there are no ways to sort of game the system to create advantage for yourself.'",
        "'speaker_8': 'And so those are my comments. Thanks.'",
        "'speaker_0': 'Thank you. Councilmember Ringa.'",
        "'speaker_1': 'Thank you, Mary. And I really appreciate all the commentary that's come forth so far regarding this issue, because I did read it and it's pretty much square. And what it says in Section nine, the requester, the data, the requests, the requester, name and organization, and the nature of the information request.'",
        "'speaker_1': 'That's pretty black and white right there in terms of what it says directly. So to be devil's advocate at this point right now, I know there was a discussion earlier by Council member Pearce about not wanting to vote for the for the MCU based on section nine is section is the removal of section nine.'",
        "'speaker_1': 'I renegotiated that part jeopardized the passage of the emoji tonight.'",
        "'speaker_2': 'Council member. The Council has the option to either adopt the EMU as it's been presented or not adopt it, receive and file this item and give bargaining instructions to the bargaining team in closed session. As far as instructions on how to modify the agreement, this is a tentative agreement.'",
        "'speaker_2': 'So those are the two options. The council could not just pull this particular item out and then adopt. The more you.'",
        "'speaker_1': 'I just want to I just went blazing. It was okay. You want to be clear that what we have before us is a full document and any changes or adoptions that happened to it have to go back to the table for renegotiation, knowing that negotiations take sometimes years and no question months.'",
        "'speaker_1': 'We're sure a lot of staff time, a lot of staff came from our our management team as well as from the union. So there's a lot of blood, sweat and tears that goes into these these negotiations. And I'm certain understand that other issues I mean, the the Emmylou itself, it's as been discussed, it has a lot of'",
        "'speaker_1': 'positive stuff to it. You know, the certainly the the pension contribution is good. The ability to offer other skill pays for some of our specially skilled officers is certainly well done. There are some issues that was brought up before in terms of parental leave that we should I'm not going to discuss it here, but we should discuss'",
        "'speaker_1': 'about a parental leave policy citywide as you go through that. And I'm certainly very much interested in getting a pre policy that also is citywide. I belong to a number of organizations, not only in city law, but others that I that I represent the city on and I get PR aid all the time.'",
        "'speaker_1': 'I just got a primary today as a member of the Coastal Commission regarding discussions that I may have had or not had with lobbyists or other entities requesting information on whether I've been contacted regarding projects up and down the state of California.'",
        "'speaker_1': 'So I get those all the time. And it's, it's, it's a benefit to the, to the coast commission staff that they let me know about it. And it's it gives me an opportunity to search my records and my files if indeed I have had any kinds of information that I can share with them so that they can'",
        "'speaker_1': 'share to the requester. And the requester hasn't been exposed to me, so I don't know who's who is making the pre request for that information because I guess in that process it's anonymous and this and as it should be here, I think it should be anonymous.'",
        "'speaker_1': 'I'm hearing from staff that that certainly can be added in including to I see this as a procedural administrative way of dealing with it. And and I think that your assessment of this coming to you a few months before at the request of you was was a correct one.'",
        "'speaker_1': 'The only criticism that I have about that is that we should have known, we should have been contacted as a city council to advise us that this is an issue coming down. And it was based on legislation that is that would that passed in the state of California that we would eventually have to contend with.'",
        "'speaker_1': 'And I think that's where maybe the ball was dropped, if at all, that was that. You know, it came to a surprise that it there's any one thing, like we say as elected officials, we don't like it, we don't like surprises.'",
        "'speaker_1': 'And this fell on us as a surprise, especially when it came down to the reaction of the of the public in the respect of what appears here and how it's worded in here. Perhaps we could have provided some kind of language to assist with this in regards to having it in in the email you that it would'",
        "'speaker_1': 'be that there is an option to submit pre request anonymously without having to basically identify the the the request or or the organization. And in addition to this, I think at the there was another time when as a council member, elected officials certainly were always again what to praise.'",
        "'speaker_1': 'And I was just like Councilmember Janine Pearce one time there was a pre as my my responsibility as. Remember that came. I knew nothing about it. And the PRK was sent out. And it was sent out with erroneous information.'",
        "'speaker_1': 'That was not me. But staff sent it out. So I think the the importance of having a citywide PR, a policy that is very similar to this, would be very, very helpful to us as a council and of course, to our to our agencies that have who are pre eligible, if you want to call it, for lack'",
        "'speaker_1': 'of a better term, who who get praise a lot. So that's my basic $0.02 worth of this. I mean, I want to I want people to understand that we can't simply remove Section nine from the on the discussion of the M or you without affecting the whole M, will you?'",
        "'speaker_1': 'And after all the discussion that's been taking place for the last several months between the city management and the PEO, so with the addition of the mayor of the portions of the oh the suggestions made by Councilmember Price in regards to improving that ability to submit praise anonymously, I'm certainly good with that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Andres.'",
        "'speaker_11': 'Yes, thank you very much. I first of all, I'd like to speak on the VOA contract. You know, I'm happy that we have reached agreement on this new contract because I feel like it's fair in all sizes. But I what is more what I think what it provides, especially additional cost sharing of the pension costs and also'",
        "'speaker_11': 'provides a raise in pay to keep us, you know, competitive with the other departments. Know what was more pleasing to me than any, I think was that it was a very pleasing that we're now providing a new pay, you know, apparently benefits that would give new moms and dads 30 days spend with their children.'",
        "'speaker_11': 'I think that should be we hope and I'm hoping that we continue to do this with that bargaining with all employees unions, that everyone will be able to get that form of been it across the entire city. You know, so in all, I would like to commend that the city, you know, management putting this together and to'",
        "'speaker_11': 'speak on the. The items that came in tonight. I would would hope that the individuals that came here tonight to to express their opinion, to let you know that your voice is not being void. People are listening. They hear you.'",
        "'speaker_11': 'And that is the only way you can hear the guys is up here. We spoke on it. We listened to it. And it's the only the way things are going to get done. You continue to speak and let people know your concerns and your feelings about various things that you feel is an injustice or not fair.'",
        "'speaker_11': 'So like I said, I've been on both sides of the law. And like I say, with the grace, I've been able to know both sides of, you know, these issues. And I think transparency is an important issue, but we must have transparency on all issues.'",
        "'speaker_11': 'So that is my comments on this. Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Councilmember Pearce.'",
        "'speaker_2': 'Yes, I think the discussion tonight has been a good discussion in the right direction. I was curious. STAFF You've mentioned that you've got a lot of ideas about how to make this where that anonymous part would be up front.'",
        "'speaker_2': 'How long do you think it would take you guys to make those changes?'",
        "'speaker_9': 'I don't think that it will take us long at all. So we're going to immediately look at the at the issue of how you approach our website and what that looks like. If it's a simple fix of just moving it left or right, we can do that.'",
        "'speaker_9': 'If it's a systems issue because there is a third party vendor, they have certain restrictions on what we can do with theirs. We'll work through them, but we can, as early as tomorrow, start working on this and put things up to to make this clearer.'",
        "'speaker_2': 'And what it would it be something that we could do if we said we vote to move forward with this, but that you suspend that policy until because you've already implemented the policy in April. So have you suspended that policy until the actual contract was completed and those changes had been made?'",
        "'speaker_9': 'The contract is ready. So once you give us the, you know, the direction today. So you either are going to tell us to go forward and do that or you're going to tell us to go back and negotiate.'",
        "'speaker_2': 'So I think the direction that I've heard from many of my colleagues is that they don't like the way the system set up. We would like to see that system change. That is not something that's negotiated as part of that contract.'",
        "'speaker_2': 'So could we suspend the practice until that system change has been made? Does that require to go back to negotiations? Yes, it does. With that, I will still be a no thank you.'",
        "'speaker_0': 'Councilman Price.'",
        "'speaker_4': 'I have no doubt that city staff will be able to address the issues we've talked about in the next 2 to 3 days. If that's not and I'd like I'd urge my colleagues to move forward on this item tonight.'",
        "'speaker_4': 'I will be checking in 2 to 3 days to see with my limited technological challenges if I could file an anonymous request and if it's user friendly and easy. If not, I will bring an item back to council to address that issue.'",
        "'speaker_4': 'And that's my commitment because I think that's very important. I don't want to hold up the contract. I don't want to go back and renegotiate. We've been working on this for a long time, but I will look on Friday and see if it's easy to find and if filing an anonymous PRA is is as easy as it'",
        "'speaker_4': 'should be. If I think if staff has any problems with that, perhaps letting us know so that we know progress is on the way. But we're talking about, you know, a PDF sellable form that makes it easy for people to file prey requests anonymously.'",
        "'speaker_4': 'They have the right to do so. They should be able to do so. We should support and make it easy for them to do so. And if that's not happening by Friday and if it takes needs longer than I expect it to from four, that will tell us that it's going to take longer.'",
        "'speaker_4': 'If not, I expect we'll be addressing that specific issue at another item as another item to council separate and apart from this contract.'",
        "'speaker_9': 'Yes, we commit to that. Absolutely.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman Councilmember Richardson.'",
        "'speaker_8': 'Just just to be clear, before we move forward, Mr. Modica, can you just recap what you heard? I think the there was a lot of good comments and you got a lot of good direction. I just want to hear back from you what you heard.'",
        "'speaker_8': 'I was also a city attorney, if you could chime in on that as well.'",
        "'speaker_9': 'So what we understand is that we are to make a lot of progress on the website on how to file a PRA by Friday, that we are to create an even path so that it is there. You can choose one way or the other and it's very clear that it's not one is preferred over the other that'",
        "'speaker_9': 'we are going to enhance the anonymity features also on the police website, which is a uses of the same system, but it's set up a little bit differently for praise and we will do the same thing on that website that we will also be promoting back to people who want 1421, that they have the ability to go'",
        "'speaker_9': 'to the website. They don't even have to do that. And we'll put that on our 1421 page that that is the place where you can get it without asking for a prior request. We will also be letting people know when they file praise that that is a public record, that the filing of a PRA in and of'",
        "'speaker_9': 'itself becomes a public record that others have access to. And then those are the major items that I had, Mr. Attorney.'",
        "'speaker_10': 'And I just had the request from the council member for a two from four on the ACLU letter.'",
        "'speaker_8': 'Sure. And one thing I would ask, I think in general, I'd like to and we can talk offline, but I'd like to figure out a way for us to have a broader conversation about praise and all of the sort of reporting requirements and how to make sure we have an ordinance that's that's modern and keeping up with'",
        "'speaker_8': 'the standards that serve our state and federal government. So if that's something that staff or city attorney wants to come out and say, hey, this is how we recommend the council go about it, or if you think that we should bring forward an item, I'd certainly want to hear that on how to take that step, because, again'",
        "'speaker_8': ', this is second time that's come up. I want to have a more full conversation about it.'",
        "'speaker_9': 'So that will take a little bit of additional time. We can respond back with a two from four, just explaining how do we do praise, how many praise we get, how are they filed, how are they handled? We can certainly do that.'",
        "'speaker_9': 'That is going to take more time than Fridays. Yeah, it'll be. Absolutely. We can do that.'",
        "'speaker_8': 'Fantastic. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Super now.'",
        "'speaker_5': 'Thank you. I would just like to add to the motion and in addition to creating the more user friendly pre request page that we investigate that there might, may or may not be an outdated city manager page out there, I think Councilwoman Price was able to find it tonight.'",
        "'speaker_5': 'I think you two are looking at two different pages. So if you do make the improvement, it's that's going to be null and void if there's an erroneous page still out there. Thank you.'",
        "'speaker_0': 'Thank you. I'm going to make some comments as well. So let me just say that I think there's obviously I want to thank everyone for the discussion tonight on an important. Part of the contract. I also want to just take a step back and focus on the larger contract in of itself.'",
        "'speaker_0': 'I do support the contract that's in front of us. I think first and foremost, it includes what I believe all employees deserve, which are fair wages and good benefits within our city. I am glad and I support supporting our police officers to ensure that they are paid respectably and that they have the same level of support as'",
        "'speaker_0': 'our peer communities. I also want to thank the team and the leadership and the rank and file for also doing the pension pick up. I think that's a significant part of this contract. I want to thank the staff and the and the officers involved for negotiation, negotiating a parental leave program.'",
        "'speaker_0': 'Really the first the first one that we have in the city of this type. And I think it's going to be a model to ensure that we do the same for all of our employee groups. All employer groups deserve parental wage.'",
        "'speaker_0': 'I think that's been said a few times that we can all agree to that as well. And I want to also just just say that the that the not just on this occasion, but on multiple occasions, our police officers have stepped up and come to the table with fair packages for fair wages.'",
        "'speaker_0': 'And I want to thank them for that. And so with that, there is a motion and a second. Members, please cast your votes.'",
        "'speaker_3': 'Motion carries.'",
        "'speaker_0': 'Thank you. We're going to be moving on to public general public comment I have is king over here. Larry Goodhue, Bernice Jimenez and and control please come forward for. King is King out there.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement with Thomas B. Modica to serve as Acting City Manager.": [
        "'speaker_0': 'Actually. 18, 18, please.'",
        "'speaker_3': 'Communication from city attorney.'",
        "'speaker_2': 'Recommendation.'",
        "'speaker_3': 'Execute an agreement with Thomas B Modica to to serve as acting city manager.'",
        "'speaker_0': 'I can if I can get a motion in the second comment, please. I have Mr. Goodhew in control. Police confirmed for public comment. Nope. Okay, Mr. Goodyear? Yes, go ahead.'",
        "'speaker_11': 'I thoroughly support this. And again, though, I want to make sure we do not reconvene the Council of Trent. Let's get down to business. We know what you want. Just go ahead and pass it so we can move forward.'",
        "'speaker_11': 'We've got plenty of challenges. Will be getting a new mayor. And we'll get getting some new counsel people. Probably from hopefully from the second for the second district, we'll be able to stabilize this city in a way that it hasn't been stabilized for the past year in terms of getting solid, mentally stable council people and.'",
        "'speaker_11': 'An honest mayor. Thank you.'",
        "'speaker_0': 'Thank you, Mr. City Attorney.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_10': 'Pursuant to the government code, the the acting city manager salary shall be $276,815. And down to the 100th of a cent six, seven, six. On a 12 month period, at an hourly rate of $132.63 per hour. Thank you.'",
        "'speaker_5': 'He's casting votes. I'm a no. Oh, wait. I don't get to vote. Damn, damn. No vote.'",
        "'speaker_3': 'Motion carries.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, adopt resolution continuing the Belmont Shore Parking and Business Improvement Area assessment levy for the period of October 1, 2019 through September 30, 2020; and, authorize City Manager, or designee, to extend the agreement with the Belmont Shore Business Association for a one-year term.  (District 3)": [
        "'speaker_0': 'Congratulations, Tom. Next item, please do hearing item one.'",
        "'speaker_3': 'Report from Economic Development Recommendation, receive supporting documentation into the record and conclude the public hearing. Adopt a resolution continuing the Belmont Shore Parking and Business Improvement Area Assessment Levy and authorize the city manager to extend the agreement with the Belmont Shore Business Association District three.'",
        "'speaker_0': 'Thank you. There's a motion in a second, Mr. Goodhue. Public comment?'",
        "'speaker_5': 'No.'",
        "'speaker_0': 'Okay. Do we have a report on this, Mr. Moti? We need to hear a report in order for this hearing. Mr. City Attorney, do we have to have a report on this or can we just.'",
        "'speaker_5': 'We do need a brief hearing.'",
        "'speaker_0': 'Okay. Let's go ahead and do that.'",
        "'speaker_3': 'There is an oath required on this. So if you're going to be, can you please stand and raise your hand? Do you and each of you solemnly state that the testimony you may give in the cause now pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God?'",
        "'speaker_5': 'Yes. All right. Thank you, Mr. Mayor. Economic development director John Keisler and Eric Romero, economic development project manager, will do the presentation today. Honorable Mayor and members of the City Council. The Belmont Shore Parking and Business Improvement Area, also known as a bid, was established by the City Council in 1983, allowing for the levy of an annual'",
        "'speaker_5': 'business license assessment to be paid by businesses located in the bid city of Long Beach. Long Beach contracts with the Belmont Shore Business Association to manage the bid and the Belmont Shore Business Association Board of Directors serves as an advisory board to the City Council on matters related to the bid.'",
        "'speaker_5': 'State law governing parking and business improvement areas requires an annual report be submitted to the City Council by the Advisory Board for the bid. The annual report describes boundaries, proposed activities and budgetary information as well as well as the method and basis for the continuation of the assessment.'",
        "'speaker_5': 'The 2019 2020 Annual Report proposes no changes to the boundaries or the method of living assessment. The proposed activities will focus on marketing and promoting the district, businesses, special events and community and business outreach to continue the assessment levy.'",
        "'speaker_5': 'State law requires that a public hearing be held on the proposed program and the annual assessment. At its September three, 2019 meeting, the City Council approved a resolution granting approval of the annual report, declaring the intention of the City Council to levy the assessment and set today as the date for public hearing.'",
        "'speaker_5': 'The City Council shall here and consider all protests against the assessment program and boundaries as proposed in the annual report. The recommended action on this item receives supporting documentation and to the record, concludes the hearing, adopts the resolution, continuing the assessment and authorizes the staff to extend the agreement with the Belmont Shore Business Association for one additional'",
        "'speaker_5': 'year. That concludes my staff report and I'm happy to answer any questions. Thank you.'",
        "'speaker_0': 'Thank you. I think there's no other comment from any anyone here from the from the assessment district. So we're gonna go ahead and take a vote.'"
    ],
    "Recommendation to declare City-owned property at 652  Alamitos Avenue, Assessor Parcel Number 7266-006-900 (Subject Property), as surplus; authorize City Manager, or designee, to execute any and all documents necessary, including a Purchase and Sale Agreement, with the Robert Gumbiner Foundation, a California nonprofit corporation, for the sale of the Subject Property, in the amount of $27,500; and  Accept Categorical Exemption CE-19-221.  (District 2)": [
        "'speaker_3': 'Motion carries.'",
        "'speaker_0': 'Item 19.'",
        "'speaker_1': 'Well.'",
        "'speaker_3': 'Report from Economic Development Recommendation to.'",
        "'speaker_2': 'Declare city owned property at six, five.'",
        "'speaker_3': 'Two and a half Alamitos Avenue as surplus. Execute a purchase and sale agreement with the Robert Gunn Byner Foundation in the amount of.'",
        "'speaker_2': '27,500 District two.'",
        "'speaker_0': 'As Mr. Goodhue or Ms. Control here? I don't think so. For public comment of our peers comments.'",
        "'speaker_2': 'I just wanted to thank staff for their hard work on this and it was a small parcel, but it's an important key. So thank you, Councilman Austin.'",
        "'speaker_1': 'Second, the motion, I think this is a great opportunity to to really add character to this area of the city.'",
        "'speaker_0': 'And I just want to thank staff on this. Mr. Crusher, you and I have been working on this for a long time with my team and a few other folks. And this is an important opportunity for for a parcel.'",
        "'speaker_0': 'I'm really proud of the partnership and proud of the work here. So I'm excited about the future for for this corner. Please cast your votes.'",
        "'speaker_3': 'Councilman Richardson. Ocean carries. Next Item 20 Report from Financial Management Recommendation to approve the fiscal year 2019 second Departmental and Fund Budget Appropriation Adjustments in accordance with existing City Council policy citywide tendency.'"
    ]
}