{
    "Recommendation to authorize City Manager, or designee, to terminate Management Agreement No. 3557, effective June 1, 2021, with Conservation Corps of Long Beach, for the management and operation of 340 Nieto Avenue, and execute all documents necessary to enter into a Master Lease with the Conservation Corps of Long Beach, a nonprofit public benefit corporation, for the operation and maintenance of (1) Willow Springs Park Urban Wood Recovery and Utilization Program at 2750 Orange Avenue; (2) the building at 340 Nieto Avenue; and, (3) DeForest Park Environmental Stewardship Center at 6255 DeForest Avenue, from June 1, 2021 through May 31, 2041, with one five-year option to renew, at the discretion of the City Manager.  (Districts 3,7,9)": [
        "'speaker_3': 'Okay. Then let's read the item that was bought, please, which was 19.'",
        "'speaker_0': 'Item 19 Recommendation to Terminate Management Agreement with Conservation Corps of Long Beach for the management and operation of 34090 Avenue and enter into a master lease for the operation and maintenance of Willow Springs Park Urban Wood Recovery and Utilization Program at 2750 Orange Avenue and Forest Park Environmental Stewardship Center at 6255 Forest Avenue Districts three, seven and'",
        "'speaker_0': 'nine.'",
        "'speaker_3': 'Councilmember Aranda.'",
        "'speaker_4': 'Thank you, Mayor, for allowing me to speak on this item here as.'",
        "'speaker_3': 'It.'",
        "'speaker_1': 'Is already done.'",
        "'speaker_4': 'As many people know, the Conservation Corps has been with the city now since 1987 and has been doing a wonderful job in keeping our city clean and giving jobs to young people who are in need of some additional guidance.'",
        "'speaker_4': 'And the Conservation Corps provides. I think that this master lease is going to be a wonderful thing for the city. It keeps the Conservation Corps with us for many years to come. In addition to providing them with a new headquarters and other facilities that they will be able to use and maintain.'",
        "'speaker_4': 'So I want to just give a shout out to the Conservation Corps for the excellent work that they've been doing over the years with us. And I hope to strengthen and enforce and of course, reinforce the relationship that we have with them.'",
        "'speaker_4': 'So with that Mayor, I'd like to make the motion to accept the master lease.'",
        "'speaker_3': 'I have a second by Vice Mayor Richardson with no public comment. Let's go and do a roll call.'",
        "'speaker_0': 'District one. I district to. District two. She's District three.'",
        "'speaker_1': 'I. District four.'",
        "'speaker_3': 'Ney.'",
        "'speaker_0': 'District five.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'District six. District seven.'",
        "'speaker_4': 'Keep pushing.'",
        "'speaker_2': 'I thank you.'",
        "'speaker_0': 'District eight.'",
        "'speaker_4': 'By.'",
        "'speaker_0': 'District nine.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Motion carries.'"
    ],
    "Recommendation to request the City Council to recognize and celebrate Asian Pacific Islander American Heritage month.": [
        "'speaker_3': 'Thank you. With that, we will go ahead. And do we have a request to move, I believe 21, 25, 25 as. Go ahead. 25 and then I'll pass it over to Councilmember Saro.'",
        "'speaker_0': 'Item 25. Communication from Councilwoman Sauro Councilwoman Allen, Council Member, Your Anger. Councilman Austin recommendation to Recognize and Celebrate Asian Pacific Islander American Heritage Month.'",
        "'speaker_1': 'Thank you so much. I want to first thank Councilmember Austin for recognizing the Asian Pacific Islander American Heritage Month in the city of Long Beach for the last few years. And appreciate him passing on the mantle for me to introduce this item to lead on it.'",
        "'speaker_1': 'And I'm happy to have his support as well as council member Yuan Guy and Allen on on it. May May is Asian Pacific Islander American Heritage Month. Many will hear Asian Pacific Heritage Month. But the reason why I chose Asian Pacific Islander American is that oftentimes Pacific Islander are left out from being identified as Americans when they'",
        "'speaker_1': 'are as well. So that is why Asian Pacific Islander, American and the month of May was chosen to commemorate the emigration of the first Japanese to the US on May 7th of 1843, and to mark the anniversary of the completion of the Transcontinental Railroad on May ten.'",
        "'speaker_1': 'And as some may know, majority of workers who laid the tracks were Chinese immigrants. And we certainly seen the heroic examples of what APIs have done to sacrifice their lives for this country, serving on the front line of the pandemic.'",
        "'speaker_1': 'Examples are that nearly 31.5% of them nurses have died of the coronavirus in the US are Filipino, even though they make up 4% of the nursing population and according to the 2010 census in the city of Long Beach, Asian makes up 12.6% of our population and Native Hawaiian and Pacific Islander makes up 1.1% of our population.'",
        "'speaker_1': 'And APIs have a rich history here in Long Beach from Japanese arriving in Long Beach in the early 1920. In the early 20th century, by 1907, almost 200 B.C. had established business here. But sadly, in 1942, the executive order of 999066 authorized by President Roosevelt, removed Japanese national and Japanese-American internment facilities, and most did not return back'",
        "'speaker_1': 'to Long Beach because of that. And that's why there's less than 1% of Japanese community members here. But the Japanese community centers still remain as well as Japanese Buddhist church. And we also seen a concentration of Filipinos in the west side of Long Beach because in the 1940s many were enlisted in the United States Navy, and that's'",
        "'speaker_1': 'the location of the naval ship. And an influx of native Hawaiians and Pacific Islanders arrive in California in the 1950s after World War Two. And so after the war, it's brought many Pacific Islanders into Long Beach, as well as you've heard about Cambodians settling resettling in Long Beach due to evacuating the fall of Cambodia to the Khmer'",
        "'speaker_1': 'Rouge back in 1975. And why we have the largest Cambodian community. And today I want to make sure we celebrate by not only hearing from my colleagues, but also we'll be hearing from our diverse Asian Pacific Islander American community leaders and members as well.'",
        "'speaker_1': 'So I like to open up to my colleagues if you can't remember us and if you like to share some words as well as other colleagues.'",
        "'speaker_4': 'Well, sure. Thank you, Mr. Mayor and Councilwoman Sara. Dr. Sara, I appreciate it. It's I look forward to this time of year. Every year I wish we could be together to celebrate culture with food and and and, you know, fellowship with our AAPI residents and staff members here at City Hall.'",
        "'speaker_4': 'We have been recognizing AAPI month, Heritage Month since 2014. And, you know, I think it gets a better every year. This year is special because we have a Sally Sara on the city council and I'm very happy to pass the torch and pass the mantle for you to take over this during your tenure on the council.'",
        "'speaker_4': 'Obviously, the Asian-Americans have and Pacific Islanders have contributed so greatly to our city, to our country. And they are part of the fabric of our city with a significant population here and a very diverse population within the Asian community itself.'",
        "'speaker_4': 'You know, just a couple of the historical facts that we were able to pull up in the early 1900s. Terminal Island here had nearly 3000 Japanese American residents as part of a vibrant fishing village with dozens of Japanese owned stores and restaurants.'",
        "'speaker_4': 'And this community was tragically dismantled as groups of residents were taken into custody and placed into detention centers. During World War Two. Our Long Beach City has such a rich history with the Navy, and it was a major factor in the location of many, many Filipino Americans to our city.'",
        "'speaker_4': 'And according to our census data data, more than 14,000 Filipinos in Long Beach were born actually in the Philippines. And many people don't realize that the Filipino community was was very, very active and instrumental in our farmworker organizing the farmworkers with Cesar Chavez and the the No Graves campaign.'",
        "'speaker_4': 'That was that was Filipino migrants making that happen. A lot of of Latinos in the Central Valley. And today we have a significant Pacific Islander community, especially Samoan, in Target. There are also due to our naval ties in World War Two.'",
        "'speaker_4': 'In fact, some reports indicate that Long Beach has the second largest Samoan community outside of Samoa, only second to Honolulu to significant. We have such a rich diversity and we should continue to support and celebrate the diversity that we have.'",
        "'speaker_4': 'And when I look at the city council, I think it reflects our city in a big way. And so I'm happy to celebrate today. We should also celebrate our Vietnamese residents. Our long residents are Chinese residents are Korean or Indian or South Asian communities as well.'",
        "'speaker_4': 'It is a big continent. And, you know, there are many countries and many languages spoken there. And I would say much of that is represented and proud and much of that is represented here in the city of Long Beach.'",
        "'speaker_4': 'So those are my comments. Proud to celebrate Asian American Pacific Islander Heritage Month, and I look forward to us being together again so that we can enjoy fellowship with that good food as well.'",
        "'speaker_3': 'Thank you, Councilmember. I have some comments as well and a few others, but why don't we go to public comment? Do we have a public comment? And we'll come back to.'",
        "'speaker_0': 'Mayor. We don't have any of the callers on the line yet. We're getting them right now. If any of the other council members would like to speak. We're going to work on getting public comment callers in the meeting as soon as possible.'",
        "'speaker_3': 'Okay. Do any customers want to start with Councilwoman?'",
        "'speaker_1': 'Thank you, Mayor. Thank you very much. A big, big thanks to Councilwoman Ciro for bringing this item forward. I think it's very important. I am very grateful that we are able to celebrate our Asian and Pacific Islander American residents here in our city of Long Beach as we acknowledge the work ahead of us and all the things'",
        "'speaker_1': 'we must do to fully realize the equality and dignity of our AAPI, a neighbors. It's also so critically important that we take these opportunities to celebrate and lift the history and heritage of our communities. I think it is crucial and very important that we we definitely celebrate this.'",
        "'speaker_1': 'The city of Long Beach, as we know, is a very diverse city, and that is what makes us so incredibly strong. So with that being said. Very happy for this item to be brought in front of us and very excited for all the accomplishments and all the contributions that the API community has had in making our city'",
        "'speaker_1': 'such a success. And I'm so delighted that we get to celebrate them this this month.'",
        "'speaker_3': 'Thank you, Councilmember. And next up, I have councilwoman votes.'",
        "'speaker_1': 'Thank you, Mr. Mayor. I, too, wanted to thank Councilwoman Sara for bringing this item forward. I'm very happy and honored to support it and be part of a city that has such a rich and diverse make up. And I think it's wonderful.'",
        "'speaker_1': 'I cannot wait until we're back together again and able to celebrate some of the.'",
        "'speaker_2': 'Traditions of the.'",
        "'speaker_1': 'Cultures and the holidays and the dates of significance to our various communities in person and having them here with us at City Hall. So thank you very much, and I am honored to support you.'",
        "'speaker_3': 'Thank you. Next up, Councilmember Turanga.'",
        "'speaker_4': 'Thank you, Mayor. And I want to thank Customer Sorrell for bringing this forward. It's always a great pleasure to celebrate our cultures and as I look at our city council, we got had, I think what we said before, the most diverse city council in the country, if not the world.'",
        "'speaker_4': 'But I was here when the Cambodian. Individual Cambodians can't allow me back in 1978, when they first started coming here as a result of the Khmer Rouge. Would you call that broke the well anyway. The killing fields. There you go.'",
        "'speaker_4': 'And so, I mean, we need to celebrate that and more. And as a council member, Soros said, West Nile League is one of the largest communities of Filipinos in Long Beach in the area, and I'm very proud to represent that area.'",
        "'speaker_4': 'And I want to say is two words that the only two words that I know. So I might pull it up, but.'",
        "'speaker_3': 'Thank you. Next up is Vice Mayor Richardson. Thank you, Mr. Mayor. My colleagues said very eloquent statements. So I stand up. I'll stand with them on those comments. And I just would add that Long Beach is incredibly diverse.'",
        "'speaker_3': 'We love this city and every particular group in our AAPI community. If you think about the contributions culturally from music to dance to language lobbies would not be the same if it were not for the contributions of our AAPI communities.'",
        "'speaker_3': 'I happen to represent North Long Beach. This is an area with significant AAPI population Somalians, Cambodians and and we're all part of the same cultural tapestry. So I certainly wanted to just chime in and offer my support. Thank you.'",
        "'speaker_3': 'Councilmember Sol sorrow. Councilman Oscar. On this item. Thank you so much. Thank you very much, Vice Mayor. And I'll let me just go ahead and just add another getting to public comment, folks. We are having some tech issues tonight in case it hasn't been apparent.'",
        "'speaker_3': 'And the clerk is also the WebEx system is having an issue with public comments, but moving folks over to, I think, another system right now and not all the mikes are working correctly. So we we'll regroup on on some of the some of the bugs.'",
        "'speaker_3': 'But want to just note that and just to speak to this, I want to just thank council and sorrow. But everyone who signed on and just add I think I've been comfortable and you said it best our our API population community our our neighbors and friends are some of the best things about our city and make it'",
        "'speaker_3': 'such a great important part of who we are and add to the diversity, to the culture, to the fabric of what makes one each, each. And so I'm just very happy to just add my support and thank you for bringing this.'",
        "'speaker_3': 'And with that, Madam Clerk, are we able to be able to get the public comment?'",
        "'speaker_0': 'Unfortunately, not at this time. If you'd like to move on, we may revisit this item and take public comment as soon as we get them on the line. We're not able to get them through right now. They are waiting patiently.'",
        "'speaker_3': 'Okay. Let me let me do this, because this this item actually had significant public comment, and it was the one of the only ones that did. So why don't we just we can just hold this item where it's at.'",
        "'speaker_3': 'We'll come back to it. If there wasn't any objection and do the public comment, we can pose kind of comment, council comment would be public comment and indeed vote on this item and listen to the objection to that.'",
        "'speaker_3': 'So we'll go ahead and do that. They will move on. Can I go back in the consent calendar? There was an item which was item 18 or I believe. And I want to make sure that councilman in the House wanted to pull that item from the consent calendar for whatever reason, did not end up on my call'"
    ],
    "Recommendation to authorize City Manager, or designee, to accept funds in the amount of $8,300 from Sk8 Dojo, a group under fiscal sponsorship with Habitat for Humanity, to place additional cement pathways at Michael K. Green Skate Park in 14th Street Park; and \n\nIncrease appropriations in the General Fund Group in the Parks, Recreation and Marine Department by $8,300, offset by donation revenue from Sk8 Dojo.  (District 1)": [
        "'speaker_3': 'list. And so I want to make sure that we we do that. That could be an office mix up there. So I want to make sure that we do it the right way for her. For her, because you want to pull that and can we go ahead and reconsider item 18, no.'",
        "'speaker_3': 'Objection. Will we consider that? Can I get a motion? Your second to reconsider. 18. It is a motion of a customary ranger and a second by Councilman Zendejas. And why don't we go ahead and talk about.'",
        "'speaker_0': 'District one.'",
        "'speaker_2': 'I district to my.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_2': 'And by district.'",
        "'speaker_0': 'Six I District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'District eight.'",
        "'speaker_0': 'My district nine.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'And then can you go ahead and read item 18, please?'",
        "'speaker_0': 'Communication from Parks, Recreation and Marine recommendation to accept funds in the amount of 8300 from skate dojo taking place. Additional cement pathways at Michael K Green Skate Park in 14th Street Park, District one.'",
        "'speaker_3': 'Great councilman.'",
        "'speaker_1': 'Thank you very much, Mayor. Thank you, Councilmember Ang and Mike, every all my colleagues here for allowing me to first reconsider this item. We have requested it to be pulled. But then, you know, all of these technical difficulties that we were expecting to be.'",
        "'speaker_1': 'That's okay. That's, you know, we roll with the punches. But so thank you for for letting me speak on this item. One of the things that we have that we have that so very, very unique and special to us here in our district, our youth programs, our youth programs are really, you know, fired up and really doing'",
        "'speaker_1': 'the the work of what what's going to be the future of Long Beach and Skate Jojo is no exception. They are a phenomenal a phenomenal new nonprofit organization that is doing incredible work in my district. So I, I just couldn't go let this go without, you know, highlighting them a little bit and highlighting the work that they've'",
        "'speaker_1': 'been continuously doing here in the First District. They have they are a skate organization where they bring together youth from all over the city, especially the first district youth. And they bring them and they, you know, get them involved and get them passionate about, you know, being involved and being engaged in their community.'",
        "'speaker_1': 'They have a great following for being such a new, new organization. And I'm very proud to have them in my in my district. And they focus on right now, they're focusing on 14th Street Park, which is an amazing, amazing place in our Washington neighborhood.'",
        "'speaker_1': 'And I know that, you know, their love for our skate parks, their love for the community is where, you know, feels them. And they've just been great. They've had a couple cleanups where they invite the youth and the youth get to be active in in cleaning up their their 14th street park and clean up their skate park'",
        "'speaker_1': 'and being able to to feel like they're doing something for the community. And I just wanted this opportunity to give them a big, big shout out in addition to these pipe improvements and clean up. So I think it's it's a it's an organization that the city should recognize and should uplift, along with other incredible organizations that our'",
        "'speaker_1': 'youth, you know, put together and develop and really make our community great. We've had a lot of conversations in the past few months about, you know, rising crime in our community. And, you know, they have really, really serious concerns.'",
        "'speaker_1': 'And and so they want to do their part in being able to help, you know, reduce that not only reduce the crime, but also prevent crime and give others an opportunity, other youth, the opportunity to succeed and and to have fun while they're doing it.'",
        "'speaker_1': 'And so I just love the partnerships that Skate Georgia has had. They have partnered up with my office. They have partnered up with Habitat for Humanity, who is also very invested in the Washington neighborhood. They have partnered up with books and buckets and many more organizations around that that service the youth.'",
        "'speaker_1': 'So thank you again for letting me take a moment to really highlight this wonderful organization that's serving the First District. Then keep keep doing the great things that you're doing, Skate Georgia. And you know, you have my support all the way.'",
        "'speaker_3': 'Well, thank you for that, Councilwoman. Yes. And we apologize for for missing the the pulled item. So thank you for that. And let's go ahead and we have a motion filed by councilman in the House. And secondly, Vice Mayor Richardson, vice mayor, to give a comment.'",
        "'speaker_3': 'Also, just keep up the great work. I love hearing all the transformation that continues to happen in the Washington neighborhood is a legacy transformation that's happening. And so it's great to hear that, you know, there's a partner there that's that's a part of these these efforts of graduations, Councilwoman, and skate, don't you?'",
        "'speaker_3': 'Great. And then with that, there is no public comment. So we're going to do the roll call.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two.'",
        "'speaker_1': 'I. District three i.'",
        "'speaker_2': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'District five. I.'",
        "'speaker_0': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Thank you, Madam Clerk. Are we. Do we have a public comment for 25 here?'",
        "'speaker_0': 'Not yet.'",
        "'speaker_3': 'We're not yet. Okay, well, we do have we do have a study session that we have a time certain for. I just what? I didn't want to go into the long study session. Then I have these folks waiting around.'"
    ],
    "Recommendation to amend Employment Agreement No. 35514 with Thomas B. Modica, City Manager, to conclude his voluntary participation in a work furlough program on the same terms and conditions as those applied to other City employees through negotiations with represented employee associations effective April 17, 2021.  (Citywide)": [
        "'speaker_3': 'So why why don't we. Do a couple of items quickly and then we'll maybe give you a few more minutes for that. So again, and then we'll go to the study session and maybe after a few more. So let's see some of the other items out of the way.'",
        "'speaker_3': 'Can we do any 23, please?'",
        "'speaker_0': 'Report from City Manager, a recommendation to amend employment agreement with Thomas Modica, city manager, to conclude his voluntary participation in a work furlough program citywide.'",
        "'speaker_3': 'Particularly in a motion of the second. There's a motion by Mr. Richardson, Second Lieutenant Roston. I don't think it's any public comment on this. So let's please go ahead and cast your votes.'",
        "'speaker_0': 'District.'",
        "'speaker_1': 'By.'",
        "'speaker_0': 'District to.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_4': 'All right.'",
        "'speaker_0': 'District eight. District nine, by motion carries.'",
        "'speaker_3': 'Okay. Thank you. I think we only have two more items. Right. And that we're having public comment issues with with that. So what are we what are we through the the equity toolkit? I know it's shorter than the study session, so maybe that would give us enough time to to then come back and go.'"
    ],
    "Recommendation to receive and file a presentation by the Office of Equity on the Long Beach Equity Toolkit, including an overview of case studies and examples on how to apply it citywide.  (Citywide)": [
        "'speaker_3': 'What information at the end of the meeting once we have the public comment piece fixed. So I don't. 24 please.'",
        "'speaker_0': 'Item 24 Report from City Manager Recommendation to Receive and file a presentation by the Office of Equity on the Long Beach Equity Toolkit.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Members of the City Council. So the Equity Toolkit has been in place since about 2019. It's work that we do every day and it's available to our staff. Back in about March of 2020, just as we were getting into the pandemic.'",
        "'speaker_5': 'The council asked to have a formal presentation so that you could also see some of the tools that city staff are using in their work as they pursue equity. And so we postponed it a little bit for the coronavirus, for the pandemic, and now we'd like to present that back to you per the Council's request.'",
        "'speaker_5': 'So I will turn it over to Theresa Chandler, our deputy city manager, and Katie Boundaries, our equity officer.'",
        "'speaker_1': 'All right. Thank you, Tom. Good evening, honorable mayor and members of the city council. We are excited to be here tonight to present a brief overview of the Long Beach Equity Toolkit, which was designed for city leaders and staff.'",
        "'speaker_1': 'Before we jump in, I'd like to start with some acknowledgments of the incredible folks who contributed to this toolkit. This was a collaborative effort led by the Office of Equity when it still lived in the Health Department under Kelly Colby's leadership.'",
        "'speaker_1': 'And it uplifts the amazing work of staff from across our city departments. In our presentation this evening. We will provide a brief background about the tool kit development, a description of what can be found inside the toolkit. A brief overview of the nine Featured Tools and Case Studies and how the Office of Equity Plans to support its'",
        "'speaker_1': 'implementation moving forward. You're probably very familiar with this image that compares the difference between. Hold on. Technical difficulties.'",
        "'speaker_2': 'Okay. I'll keep going.'",
        "'speaker_0': 'So we have a slide.'",
        "'speaker_1': 'The next slide there. There we go. So this shows a difference between equality and equity. On the top, the image showing equality shows people of different shapes and abilities, trying to ride the same sized bicycle. There's a person in a wheelchair who is not able to use the bicycle at all.'",
        "'speaker_1': 'A tall person for whom the bike is too small. One person who fits pretty well, it works for her and a child who can barely reach the pedals. As you can see, equality means that everybody has the same bike, which some might see as fair.'",
        "'speaker_1': 'But this really only works when everyone has the same needs or starts from the same place.'",
        "'speaker_0': 'Equity, however, as.'",
        "'speaker_1': 'Shown in the graphic on the bottom, shows these same people with varied sizes and abilities. Having a bike that fits their needs. The person in the wheelchair now has an adaptive hand cycle. The tall person has a larger bike and the child has a small one.'",
        "'speaker_1': 'This is an example of what equity looks like, which is achieved when everyone has the opportunity to attain their highest level of health and potential for success for a successful life, regardless of their background, including things like race, gender, income, ability, sexual orientation, gender identity, and other factors.'",
        "'speaker_1': 'Equity is not just for the benefit of vulnerable families or underserved communities. It helps improve outcomes for all of us. For example, if this was a family trying.'",
        "'speaker_2': 'To go for.'",
        "'speaker_1': 'A bike ride together, even the person who fit on the bike wouldn't be able to enjoy the ride because the rest of her family couldn't use theirs.'",
        "'speaker_2': 'The Office of Equity started.'",
        "'speaker_1': 'In the Health Department in 2017 with a focus on engaging community voices to inform the design of policy and systems change, making inequities visible, using data and storytelling, and building our city's capacity to advance equity through training, tools and technical assistance.'",
        "'speaker_1': 'As part of this capacity building, we began offering brief presentations on equity, which provided an overview of our health and economic disparities. A brief overview of the historical root causes, the definition of equity, and an overview of the equity lens them.'",
        "'speaker_1': 'The most common feedback we heard from those presentations was that staff overall were very supportive of equity, but curious about how you take an equity lens and what that actually means and how to put this equity lens into action.'",
        "'speaker_1': 'In short, using an equity lens means we are thoughtful and inclusive in all decisions, including policies, practices, programs and budgets. An equity lens can be applied to decisions around how funding is allocated, how programs are planned and implemented, and how we prioritize maintenance of our existing assets.'",
        "'speaker_1': 'When we use a basic equity tool in our work. It means we look at things like who is burdened or who benefits from a policy or program. What does the what does the disaggregated data tell us about them?'",
        "'speaker_1': 'Looking at data by race, place, gender and language can help us make better decisions. How have we engaged those that will be most impacted? Who is making decisions and whose interests do they represent? How will the proposal be implemented and can we look for equitable benefits for the community throughout this process?'",
        "'speaker_1': 'How can we identify and avoid negative unintended consequences? And how will we be accountable and communicate throughout the process? While these questions are a great way to get started in using an equity lens, we found that they were so broad and sometimes hard to wrap our heads around because we all have different functions and roles across the'",
        "'speaker_1': 'city. I will turn it over to our equity officer, Katie Balderas, who led the development of the toolkit we're sharing this evening.'",
        "'speaker_0': 'Great. Thank you, Teresa. Teresa did a great job sharing the background of why we began developing the Long Beach Equity Toolkit, which the Office of Equity launched in October 2019, prior to moving to the city manager's office last year.'",
        "'speaker_0': 'It's a deeper dove into equity regardless of role, project, department or position. The toolkit includes some background and context, including messages from Mayor Robert Garcia and Health Department Director Kelly Collopy. It includes definitions of diversity, equity and inclusion.'",
        "'speaker_0': 'It includes some tips and best practices on how to use the toolkit. And the heart of the toolkit includes nine tools, which are sets of questions that walk staff and leaders through what it means to apply an equity lens to an area of work.'",
        "'speaker_0': 'Each tool is accompanied by a case study of a city program or policy that incorporated various aspects of an equity lens. Our first equity tour focuses on communications. When we apply an equity lens and are inclusive in our communications, we ensure that all people are heard, informed and engaged.'",
        "'speaker_0': 'The case study highlighted here is on the Health Department Sexually Transmitted Infections campaign, which centered stories of those impacted by STIs in the design of an edgy and authentic education campaign. The next tool focuses on community outreach and engagement.'",
        "'speaker_0': 'When we welcome the diverse perspectives of staff and community, we shape processes and outcomes to ensure that everyone benefits. The case study featured in this tool features the outreach conducted by development services around the Climate Action and Adaptation Plan, which sought to co-create priorities and solutions with community to help shape the plan.'",
        "'speaker_0': 'The next tool is focused on gathering data and information. When we do this with an equity lens, we ensure that our actions better reflect the community's strengths, assets and priorities. The case study featured here is the Everyone in Economic Inclusion Listening Tour, the community conversations, which used both quantitative data about economic inequities and centered.'",
        "'speaker_0': 'The lived experiences of community members who are not historically heard in public decision making to help shape the economic inclusion strategies. The next one is on monitoring and evaluation when we consider equity and inclusion and how we measure success.'",
        "'speaker_0': 'We ensure that all community members benefit from the process and outcomes. This tool features the water department, which used disaggregated data to identify barriers that kept low income residents from participating in the popular land to Garden program. This data led to the creation of the Direct Install Gardens pilot program that had multiple benefits focused on increasing participation'",
        "'speaker_0': 'in water conservation in low income neighborhoods as well as youth workforce benefits. The next tool is on planning services, projects and programs. When we center community voices in our programs and services, we worked to eliminate barriers and create opportunities for everyone.'",
        "'speaker_0': 'This tool features the Clinician in Jail program, which used a human centered design process to research and understand the needs of a population cycling in and out of the city's jail and seeking to break that cycle by connecting them to high quality mental health services and resources.'",
        "'speaker_0': 'The next tool focuses on policy development. When we make sure policies that are we make, when we make policies that are equitable and deliver developed in partnership with community, we ensure that everyone is included in the city's success and well-being.'",
        "'speaker_0': 'This tool features the city's language access policy and the partnership with community members and organizations that have helped to strengthen implementation of the policy and honor the diversity of languages spoken in Long Beach. The next tool focuses on strategic planning.'",
        "'speaker_0': 'When we apply a vision of equity and inclusion to our planning, we work to create a better city for everyone. This features the city's Early Childhood Education Strategic Plan, which centered the voices of our youngest community members in focus groups, including children as young as four.'",
        "'speaker_0': 'And this also elevated the need to invest in the formative early years leading to social and educational success. The next was on training, staff and volunteers. When we apply equity to the training process, we create an environment where everyone can learn, contribute and lead.'",
        "'speaker_0': 'This case study features the Neighborhood Leadership Program, which focuses on cultivating leadership and organizing skills of primarily low income and residents of color to make positive grassroots change in Long Beach. And finally, the last tool is about working with people.'",
        "'speaker_0': 'When we treat all people with respect, we create a welcoming workplace and provide high quality services for our city. This case study discusses the efforts that the Health Department's Homeless Services Division has made to ensure that people experiencing homelessness are treated with compassion and dignity through a co-ordinated interdepartmental team effort.'",
        "'speaker_0': 'The city's efforts to advance equity have been further accelerated and strengthened over the course of the last year and the increased focus on racial and social inequities that harm our community and our country. The Equity Toolkit as a resource that can support GOAL one of the Racial Equity and Reconciliation Initiative, which is to end systemic racism in'",
        "'speaker_0': 'Long Beach and all local government and partner agencies through internal transformation. Our goal is that the toolkit will continue to be applied across the city and we'll continue to learn from our challenges and uplift promising practices, including the lessons learned from COVID 19 CARES Act funding and the forthcoming Recovery Act programs and investments.'",
        "'speaker_0': 'The Equity Toolkit specifically calls out that we are all in a learning journey and that while we may not get everything right the first time, we will continue to learn from our history, from our data, and from our practices to ensure a more equitable Long Beach that benefits all of us.'",
        "'speaker_0': 'We look forward to sharing what we learn by developing enhanced tools and additional case studies. This concludes our presentation and we look forward to your questions and feedback about the equity toolkit. Thank you.'",
        "'speaker_3': 'Thank you. Vice Mayor Richardson. Thank you, Mr. Mayor. I don't know how much feedback I've seen. I've seen tool kit, just more of an acknowledgment of the Office of Equity, the staff and the entire city team. This transition to thinking about equity and rethinking how we make decisions.'",
        "'speaker_3': 'It's been a long time coming. And and it didn't we didn't arrive here all at once. You know, it's a time being involved in the governing alliance, racial equity, the National League of Cities Recycling Leadership Initiative, to sort of get the buy in across the city that we have today.'",
        "'speaker_3': 'And I can tell you, you know, office of we were one of the first with an Office of Equity, but now it's it's pretty standard. Most counties in Southern California now have an Office of Equity. A number of cities have either an equity czar or an office equity, even, you know, cities all up, all the way out'",
        "'speaker_3': 'in more conservative counties in Riverside and San Bernardino and Orange County have embraced this. So it's great to see Long Beach at this stage that we are today around being able to talk about and be comfortable with equity.'",
        "'speaker_3': 'And it's a good example for for everyone. You know, there was a time when when talking about it was sort of political and you had to take issues of race and issues of equity and they didn't belong and or whether they weren't received well or welcome.'",
        "'speaker_3': 'But I like to use the example of when you see the transition in the workplace around harassment, there's certainly still more, more to do in America around harassment. But it didn't happen overnight, you know, 20 years, 30 years.'",
        "'speaker_3': 'Training modules and capacity building to get to a place where, you know, it's everyone's responsibility to create an environment where harassment doesn't exist. You can't be a CEO or a city manager if you don't, you know, if you don't uphold those values.'",
        "'speaker_3': 'And so that's what's happening with equity. It's initially, hey, that's political. It doesn't have a place here in race or equity. But now. By building capacity, having exclusive bias trainings, having equity tool kits, having equity lenses on agenda items.'",
        "'speaker_3': 'It is great to see council members doing that as well on agenda items. What that does is it sends a message to the whole organization that this that we are making this transformation as a city and it sends a strong message to the private sector, the public sector, nonprofit sector.'",
        "'speaker_3': 'And so I strongly support this direction we're heading. I know there's there's certainly certainly more to do, but I'm happy with our progress as a city. It's been embraced by our city manager, our city staff. There's, you know, folks in every department now that are part of the equity task force.'",
        "'speaker_3': 'And and so I'm fully supportive of this. So I want to just chime in, offer my support and my thanks to the Office of Equity, the city manager, and the entire team. Thanks. Councilwoman and de Haas.'",
        "'speaker_1': 'Thank you, Mayor. First of all, thank you so much, Teresa and Katie, for this wonderful presentation of the toolkits of equity. I think that this is a very, very important I myself, being from a district that is absolutely a beneficiary, beneficiary of being seen through the equity lens.'",
        "'speaker_1': 'It is very important to me to be able to celebrate this tool kit. So thank you for all the hard work. And my Councilmember Richardson said, you know, I do know that this has been a work in progress and that a lot a lot of hours have been put into this this tool kit and being able to'",
        "'speaker_1': 'present it to us. One of the other things that is that, you know, we this has always been necessary. Right. But it was exceptionally necessary during COVID, during the times where we were vaccinating and saying first testing people.'",
        "'speaker_1': 'So we had to we were able to use our equity tool kit to be able to identify, you know, where the need was. And then when we when we saw that the distribution of our vaccines were were not where we wanted them to be, again, we were able to go back to the tool kit and be able'",
        "'speaker_1': 'to see see how we could address this issue through an equity lens. And everything seems to be in point for us to go back to this equity tool kit. And the people that are the residents that really need the help are getting the help that they need.'",
        "'speaker_1': 'And I couldn't share of a more better experience than the experience that none of us expected to go through. And that is, you know, COVID 19 and this past couple of months that we have had to use this tool kit.'",
        "'speaker_1': 'So, again, thank you, Katie. Thank you, Teresa, for all the incredible work that you continue to do every day. Thank you to the city manager's office for all the work that you continue to do also, and look forward to working together and and looking through this equity using this equity tool kit as we move forward.'",
        "'speaker_3': 'Councilmember. Sara, please.'",
        "'speaker_1': 'Yes. I also want to add to my colleagues in thanking our amazing director, Kelly Colby, as well as the Teresa and Katie for all being part of helping to establish the Office of Equity in working day in, day out to ensure that we don't just talk about equity and that we actually ensure we achieve equity.'",
        "'speaker_1': 'And one of the steps towards that is ensuring that there is a toolkits and steps and in helping to incorporate it into our departments and infusing it in the ways that we practice it in our work and within our community members and residents.'",
        "'speaker_1': 'And I think that this is just one of the few steps we can take towards ending systemic racism is understanding that that is what we're working to, why we're working towards equity. And I just want to thank everyone who's been involved with it as well.'",
        "'speaker_1': 'If I didn't mention names as well, because I know that it takes a massive effort. So thank you.'",
        "'speaker_3': 'Found and asked him.'",
        "'speaker_4': 'Oh, thank you. Just have a couple of brief comments. I want to, first of all, thank the entire city team, our city manager, health director, Office of Equity for a great representation, but a packaging tool kit that's been talked about for some time.'",
        "'speaker_4': 'I want to say that I think the goal is to change our culture in this tool kit will help us get there. It will provide a practical, I guess, framework, but also some some good information and direction for for our city leaders to think about equity all the time.'",
        "'speaker_4': 'I agree with the conversations about Long Beach or the comments that Long Beach is on the forefront of conversations around racial equity and inclusion. And these conversations are not happening in many other cities governments, private sector, workplaces, including my own, where people are getting a lot more comfortable but also more enlightened about this very, very important subject'",
        "'speaker_4': '. I think we all should have a vision to to to to get to a place where equity is is kind of what we do naturally. And so this toolkit is a great practical tool. I want to see us at a place where it's just part of who we are and what we do.'",
        "'speaker_4': 'And and, you know, the conversation about equity is is just is just a natural part of who we are as a city. And so I think there's tool kit and a lot of the work and the commitment of this council, our city, the leadership that we've had on this issue will help us get there.'",
        "'speaker_4': 'I'm very encouraged. We started this meeting now recognizing a piece. An Asian Pacific Islander month. And in talking about the rich diversity of our community, our city, this just adds to our commitment to that. And so congratulations and look forward to seeing this is actually applied in every aspect of our city.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_3': 'Thank you, Councilwoman Allen.'",
        "'speaker_1': 'Yes. Thank you, Mayor. I just want to also think I'm the Office of Equity in our health department and our entire city team. Just a huge thank you to everyone in our community that make sure that the city just remains inclusive.'",
        "'speaker_1': 'I know that this tool kit will make sure that all of the voices in our community are heard. And I know that it will be a very useful tool in guiding our work in the months and years ahead.'",
        "'speaker_1': 'It is definitely my commitment. And for me and my.'",
        "'speaker_2': 'Staff that.'",
        "'speaker_1': 'We apply an equity lens to all of our work in the community. So just a huge thank you to Teresa and Katie, your team and just all of our equity champions who contributed to this living equity document. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_1': 'Thank you. I want to give a special thanks to Katie. She's come to a lot of presentations and meetings on our side of town and explained a concept that is relatively new in public service. And it shouldn't be, but it is.'",
        "'speaker_1': 'And I think that she's had a great approach to her metaphors that have really helped the community learn and understand why this is needed and why it's important. And so big thank you to the staff who are consistently available for the community and are very transparent and open in answering the questions that the community asks.'",
        "'speaker_1': 'Thanks so much.'",
        "'speaker_3': 'Dr. Murray Ringer your new.'",
        "'speaker_4': 'I couldn't hear you. Mayor, thank you for this very obviously is a very important document and very glad to support it.'",
        "'speaker_3': 'Thank you very much. Okay. There's no public comment. So please, let's go ahead and do Oracle.'",
        "'speaker_0': 'District one. Happy district to.'",
        "'speaker_1': 'Right. District three. I. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District five.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District six.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District seven. By District eight, Earth District nine.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'Motion carries.'",
        "'speaker_3': 'Right now. We're going to go back to item 25. We got the callers on the on the line. So we're going to do without objection or moving to item 25, which is open on the floor. And we will do public comment for item 25.'",
        "'speaker_3': 'Our first speaker is Victor Thompson. Good evening. My name is Dr. Victor Thompson. I'm the executive director of the National Pacific Islander Education Network. I'm a retired school teacher and school administrator. In our organization, it's in our 20th year, and we strive to inspire Pacific Islander students through providing motivational speakers.'",
        "'speaker_3': 'We host an annual education conference and we provide scholarships. But I'd like to thank Mayor Garcia and the City Council for recognizing Asians and Pacific Islanders. My parents, Victor and Desmond Thompson, arrived from American Samoa in the late 1950s, and I was born in St Mary Hospital, where Dad worked as a lab technician and mom worked at'",
        "'speaker_3': 'Pacific Hospital as a nurse's assistant. They were the only Pacific Islanders working there. My sister and I and my friend Edward from the island of Guam, we attended an elementary school and we were the only Pacific Islanders at the school.'",
        "'speaker_3': 'Today we have more Pacific Islander students, educators and other professionals from our community than ever before. However, over 80% of our people in America do not hold a college degree, and we are underrepresented in many professions. I personally have never had a teacher or principal of Pacific Islander ancestry as a student in grades K through 12 and'",
        "'speaker_3': 'college and even as a professional educator for 36 years I knew very few. However, there were many, like all of you who mentored me and cared about me. And truly, that is what all of us can do. Thank you and for supporting this resolution.'",
        "'speaker_3': 'Our next speaker is Elaine Quijano.'",
        "'speaker_2': 'Hi. Good evening, honorable mayor and council members. I am Dr. Olivia Webb up at all calling in support of item number 25. Thank you to Councilwoman Dr. Hill, SRO and Council member Austin Councilmember Roberta Randa and Councilwoman Cynthia Allen for leading this item.'",
        "'speaker_2': 'Asian and Pacific Islander Heritage Month an opportunity for me to reflect about our connected histories as a community. At the same time, I fully recognize that we are not a monolith, that our stories are woven into the American fabric with unique and rich narratives of tragedy and triumph.'",
        "'speaker_2': 'It is a time of sharing my family through the history. My father was a Vietnam vet who faithfully served in the U.S. Navy for 20 years from 1957 to 77. And my mother moved to the United States on July 20th, 1969.'",
        "'speaker_2': 'My family moved back to the Philippines back in 77 and moved back here in the U.S. 1987 after the end of martial law under the Marcos regime and the beginning of the people power revolution. It was a time to reflect and recognize that what is happening globally affects us locally.'",
        "'speaker_2': 'My family in the Philippines is still awaiting the vaccine, and Filipino nurses were the hardest hit with COVID, especially in California, with my sister being one of them. As we cover from the effects of an authoritarian administration, much of the southern Philippines remains under martial law and subject.'",
        "'speaker_2': 'We continue to see political violence by Trump supporters who come to our ally. And we need to support initiatives like the Philippine Human Rights Act to stop U.S. security assistance to the armed forces of the Philippines, of the Philippine National Police, and with the Asian and Pacific Islander communities facing racial violence and police brutality here and abroad'",
        "'speaker_2': '. Everything truly hits home as the wife of an American African-American man and mother of our multiracial children. This is especially a time to truly embody that solidarity begins at home and to root out the anti-blackness and white supremacy that continue to permeate our communities and that we keep each other safe as Asian and Pacific Islander communities.'",
        "'speaker_2': 'We have a strong history of organizing, activism and advocating for those most marginalized. And now, more than ever, is the time to keep making that history. Thank you.'",
        "'speaker_3': 'Our next speaker is Anthony Tanaka. Anthony Tanaka, please begin. Anthony Tanaka please hit Star six to unmute. And Anthony Tanaka. Our next speaker is Fran Luton.'",
        "'speaker_2': 'Couple days to file. Aloha. Look away. All mayor and council members. I am Fran Duhon, director and curator of the Pacific Island Ethnic Art Museum. I am an indigenous tomorrow woman born and raised on the Pacific Island of Guam and a resident of Long Beach.'",
        "'speaker_2': 'I'm calling in support of item 25, a recommendation to recognize Asian Pacific Islander Heritage Month. Thank you to Councilwoman Tilly Ciro for leading this item. The multiplicity of our Pacific Islander and Asian communities have long contributed to the vibrancy of our city.'",
        "'speaker_2': 'Our Pacific Islander people are anchored in Oceania, the Pacific Ocean, which is the first, largest and deepest ocean. Our heritage comes from over 20,000 islands, and we hold approximately 20% of the world's languages. We, the Pacific Islanders, stand in solidarity with our Asian community and all people of color.'",
        "'speaker_2': 'We believe we are accountable to each other. We are accountable to the land. The Pacific Island Art Museum is the only Pacific Island Museum in the continental United States. Our priority is to ensure that how we share knowledge is in alignment with the diversity of the Pacific Islander people we serve.'",
        "'speaker_2': 'We recognize the value of our language arts. Cultural practices are intrinsically linked to the value of the ongoing participation of her people. We recognize the unique kinship that exists between objects, people and their histories, and the obligation that comes with this recognition.'",
        "'speaker_2': 'I urge the Council to vote yes in recognition of our family of Asian Pacific Islander Heritage Month. Thank you for receiving us.'",
        "'speaker_3': 'Our next speaker is knock Naquin.'",
        "'speaker_2': 'My name is not going to the honorable mayor and members of the City Council. I was born to two Vietnamese refugees who made West Beach their home in 1979, the youngest of nine children, all of whom are proud products of Long Beach Unified School Edition, went to grad school in council, only to currently serve as an assistant'",
        "'speaker_2': 'principal in Long Beach. I speak to you today feeling a wide range of emotions in support of Agenda Item 25. I feel proud to be able to witness this historical moment in our community, to request the City Council to recognize and celebrate Asian American Pacific Islander Heritage Month.'",
        "'speaker_2': 'My dad, if he was alive, would be so proud of this city, a place he made his home for over 30 years after the fall of Saigon. As an API educator, I know firsthand that there's underrepresentation of APIs in education and underrepresentation of AAPI leadership.'",
        "'speaker_2': 'I want to thank Councilwoman Julie Sorrell for her trailblazing leadership as a third Cambodian American Council member and so proud of who she is and who she represents. In addition to feeling proud about this work, I can't help but feel invisible.'",
        "'speaker_2': 'I feel invisible. That is not until this year when an API council member sits on our city council and AAPI Heritage Month is brought forward. So I reflect and ponder, is it not until an Indigenous Native American Council member has a seat at the table?'",
        "'speaker_2': 'Do we recognize indigenous Native American life? Is it the responsibility of those on the margins to lead this work? We do lead this work, but it's also exhausting. And as a community, as we strive to do better, to be anti-racist and to elevate voices of those in the margins.'",
        "'speaker_2': 'I want all stakeholders to think about how we can really be an ally and a coconspirator to black, indigenous and peoples of the individual and collective. Learning must occur as we lead our community. How do we serve alongside folks?'",
        "'speaker_2': 'How do we come alongside, encourage and lead the next generation to be better versions of themselves so that we have a better version of our community? This work requires all of us to have authentic, cross-cultural relationships with one another.'",
        "'speaker_2': 'It requires us to dialog, to have uncomfortable conversations, to use the Long Beach Equity Toolkit. And it's particularly important to diversify our spheres of influence. Language is on Tongva land. Language is our home. It's our community. Now, more so than ever, we need love to drive up the fear and hate.'",
        "'speaker_2': 'And we need unity to bring us together. And thank you, Councilwoman Julie Sorrell, for unifying us on behalf of all AAPI educators. Much love and thank you in advance to the Honorable Mayor and to all the members of the City Council for voting yes to recognize Asian American and Pacific Islander Heritage Month among.'",
        "'speaker_3': 'Our next speaker is Wang Zhang. Wang Zhang. Please press star six to unmute. Wang Zhang. Anthony Tanaka, please press star six to unmute. Good evening, honorable mayor and council members. My name is Anthony Tanaka. I'm calling in support of item number 25, a recommendation to recognize the Asian Pacific Islander Heritage Month.'",
        "'speaker_3': 'Thank you, Dr. Councilwoman. Councilwoman Dr. Foley, Carol and Councilwoman Austin, Councilwoman Robert, under what I would anger at Councilwoman Cindy Allen for leading this item. Again, I'm the acting vice president for the language Japanese call center. The position has been around since about 1951, close to 70 years now.'",
        "'speaker_3': 'So Long Beach has obviously has a rich history of embracing the Asian community. It has an extremely large community. Historically, from even within our own cultural center, where a lot of the returning internees were able to make a home.'",
        "'speaker_3': 'Largely a lot of them were originally based in San Pedro or in Terminal Island, specifically after returning from Manzanar or Encampment in Utah, in Arkansas. So to us, our centers, our mission is to enhance the lives of the people throughout Long Beach and felt that even as a Japanese community isn't as large as it used to be'",
        "'speaker_3': ', we still serve the rest of the community at large. Know Southeast Asian, Chicano also from the activities which includes taiko, kendo, judo, TYC, Taiko being a very prominent activity throughout our community also. And we have a yearly festival, summer festival as well.'",
        "'speaker_3': 'And hopefully after COVID is over, we'll be able to return to that. So I thank you for listening to all of our support, and I look forward to hearing your responses to this item. Thank you. Wing Zhang, please press star six.'",
        "'speaker_3': 'Sound so passive. Your time begins now. So on. Your time begins now. Star six. Say on Cyprus. Time begins now. That concludes public comment.'",
        "'speaker_0': 'Mayor Garcia, public comment has ended.'",
        "'speaker_3': 'Can you hear me okay? Yes, my mike. Okay, great. That concludes the item. And we already did the the council comment for the item. So that was just the product of a comment. I'm glad we were able to do that.'",
        "'speaker_3': 'And again, thank you, Councilwoman Zoro, for being able to bring that forward. If we can, can we go ahead and do the roll call? Vote on that item, please. Madam Clerk.'",
        "'speaker_0': 'Yes. District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District to. I district three.'",
        "'speaker_2': 'Districts.'",
        "'speaker_1': 'I. District four.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'District five. I.'",
        "'speaker_0': 'District six. I. District seven.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'District nine. A motion carries.'",
        "'speaker_3': 'Thank you. I believe the last item that we have is the study session. Do we have were you able to move over the over the public comment box by any chance? The other the open public comment, folks?'",
        "'speaker_0': 'Yes. We have one person on the line for public comment.'"
    ],
    "Recommendation to conduct a study session to receive and file a presentation on the results of the user fees and cost recovery studies for the Development Services, Health and Human Services, and Parks, Recreation and Marine Departments and associated departmental recommendations.": [
        "'speaker_3': 'Madam Clerk, if you can please read the the study session item, and then I'll turn to.'",
        "'speaker_0': 'Recommendation to conduct a study session to receive and file a presentation on the results of the user fees and cost recovery studies.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Members of the City Council. So we have a presentation to give to you tonight on a strategic objective of a council's that's been underway for a couple of years now. This started back with the Budget Oversight Committee making a recommendation to the council to really focus and bring some attention to how we set'",
        "'speaker_5': 'our fees, doing some real analysis through outside experts to help us understand at what level should we be doing cost recovery? How do we determine cost recovery? And then where are the areas that we want to essentially subsidize?'",
        "'speaker_5': 'Because we want to make sure that our community has access to our services at a at a price that is affordable or at no cost at all. And so we are bringing you this as kind of an action item study session.'",
        "'speaker_5': 'And you're actually not taking action tonight. No fees are going to be approved tonight. This is more of a policy discussion. And then we'll be bringing you some of the first round of of the recommended fees on May 18th for you to consider.'",
        "'speaker_5': 'So I will turn it over to Grayson and Jody and Alejo, who will walk us through our presentation and the complex analysis that's been conducted.'",
        "'speaker_0': 'Great. Thank you very much, Tom. Good evening, Mayor and members of the city council. This agenda item, as Tom said, is to present to you an overview of the citywide fee study that has been completed for three departments, Health Parks and Development Services, and also present the department's recommendations on any changes to fees as a result of'",
        "'speaker_0': 'the study. Today's item is a presentation of the study and departmental recommendations that was previously transmitted and received by City Council on April six and similar to April six. As Tom mentioned, there are no actual fees changes being proposed tonight.'",
        "'speaker_0': 'The purpose of today's presentation is to provide City Council with an overview and an opportunity to make comments. The actual hearing to change fees as recommended by departments as well as other midyear fee changes is scheduled for May 18th.'",
        "'speaker_0': 'If the City Council has any changes to staff recommendations on fee changes, those can be made on the floor on the May 18th fee hearing. Geraldine Alejo, our revenue officer, will first provide a general background on fees as well as a background and overview of the citywide fees study.'",
        "'speaker_0': 'Then we will be turning the presentation over to Health Parks and Development Services, who will each go over the highlights of the study for their respective departments and their recommended fee changes? We will be available for questions at the end of all of the presentations.'",
        "'speaker_0': 'Before I turn it over, I do want to comment that this study and review has required a great deal of work analysis and time on the part of the departments. And Geraldine and I just want to appreciate them for their work towards this effort.'",
        "'speaker_0': 'And with that, I will turn it over to Geraldine. Thank you, Grace. Good evening, Mayor, and members of the City Council. I will first start with a brief overview of fees and charges. Fees and charges include two types of categories user fees and regulatory fees, both of which are included in the city wide master fees and charges'",
        "'speaker_0': 'schedule. User fees are charged for the use of a public service program such as recreation programs. Regulatory fees are charged to pay for the costs of a government program which regulates fee payer activity or use to mitigate the impact of the payers activity, such as building permits or pet licenses.'",
        "'speaker_0': 'Rents and penalties are also included in the master fees and charges schedule for convenience, but are not subject to the cost of service limitations. Rents include facility rentals and off street parking. Penalties include parking citations or late payment fees.'",
        "'speaker_0': 'Next slide.'",
        "'speaker_2': 'I you.'",
        "'speaker_0': 'User fees and regulatory fees may not exceed the estimated reasonable costs of providing the service or program. City policy requires that fees are set at the cost of service, except where there is a greater public benefit using a lower fee.'",
        "'speaker_0': 'This is important to point out because in many instances the city actively sets fees lower than the cost of service to achieve other goals, including maintaining access to public programs and seeing competitive comparable jurisdictions or market rates. Some of these goals and dynamics will be highlighted as part of the department presentations and their fee change recommendations.'",
        "'speaker_0': 'The city currently has routine processes in place to ensure that fees are reviewed and updated regularly to capture annual cost increases. The city implements an annual inflation adjustment based on city cost increases called the City Costs Index, or CCI.'",
        "'speaker_0': 'The master fees and charges schedule is adopted each year with the budget with any proposed changes by the departments as well as any CCI updates applied to the fees. Mid-Year adjustments are also periodically submitted to City Council, either as a coordinated citywide effort managed by the Budget Office or on an as needed basis by individual departments.'",
        "'speaker_0': 'The next city wide fee adjustment letter will be presented to City Council on May 18th. Each fee adjustments council letter includes an estimated revenue impact from a proposed fee change. The revenue impacts are theoretical and may not necessarily result in a budgeted revenue change by the same amount.'",
        "'speaker_0': 'Any adjustments to actual budgeted revenues must be evaluated holistically and consider a variety of factors such as the stability and certainty of the revenue source, as well as whether the department is meeting its current overall budgeted revenue commitments.'",
        "'speaker_0': 'This review and update is typically part of the overall budget development process. Now I'd like to provide an overview of the Citywide Field Study Project. As a reminder, in fiscal year 19 and at City Council's direction, staff initiated an updated citywide study.'",
        "'speaker_0': 'This will be a multi-year project where all city fees will be evaluated, with some exceptions, such as the cases where separate rate studies are in progress or rates are set by external agencies. Each department study will identify and review the fees charged, calculate the full service costs with indirect and direct costs.'",
        "'speaker_0': 'Determine subvention rates by comparing fee revenue to the full cost of service and provide recommendations for fee levels or structures. The project continues to move forward on a rolling department basis and is anticipated to conclude in 2022. The first round is complete and covered development services, parks, parks, recreation, Marine, as well as a portion of Health and'",
        "'speaker_0': 'Human Services. Each of the round one departments will be presenting study findings and the recommendations later in this presentation. The second round started in November with energy resources, public works and police departments. Pull in. Preliminary results are anticipated for these departments this summer.'",
        "'speaker_0': 'A consultant applied a consistent methodology across all department studies, which started with identifying service centers and fees and reviewing cost components. Cost components are based on the FY 20 budget and include direct costs, salaries, benefits and operating expenses as well as indirect costs, which includes departmental overheads such as administration and citywide indirect costs based on the city's'",
        "'speaker_0': 'indirect costs plan, the cost components are then included in a fully burdened hourly rate per position. The allocated cost is determined by multiplying the fully burdened hourly rate to the staff. Time spent to support a service after the fully allocated service cost is determined.'",
        "'speaker_0': 'It is compared to the current fee revenues to identify the subvention rate by service. This table is a summary of the costs, recovery and subvention rates per department and shows that the city is generally under recovering for calculated service cost.'",
        "'speaker_0': 'More information will be included as part of the department presentations with costs and subvention rates reported at the General Service categories or areas. The departments have reviewed the results of the studies and have recommendations on any changes they are proposing to make.'",
        "'speaker_0': 'The majority of department recommendations align with the study recommendations on full cost recovery, but deviate in some cases based on prioritizing different goals other than full cost recovery, as I noted earlier. These various factors will be noted as part of each department presentation.'",
        "'speaker_0': 'The departments will share more information on the recommendations. But to summarize here, the first table is a summary of the department's FY 21 midyear recommendations. Of the 1147 individual fees reviewed by the consultant, 470 remained unchanged. 276 or increase 190 were decrease.'",
        "'speaker_0': '188 were restructured. And finally, there were 23 deleted fees. The fees reported here are proposed clean ups to the department. Fee schedule for services are no longer provided by the city. The estimated theoretical annual revenue impact from the department recommendations is 2,013,978 and spans across various funds.'",
        "'speaker_0': 'Again, budget and actual revenues will be reviewed during the budget process and will vary based on usage and market or economic conditions. Although departments will be presenting an overview of study findings and propose recommendations, no changes to the master fees and charges schedule are requested tonight during this study session.'",
        "'speaker_0': 'Proposed changes to the master fees and charges will be brought to City Council for approval on May 18th. The proposed changes on May 18th will include the department recommendations discussed today, as well as other midyear fee changes typically proposed by departments as part of the midyear fee change process.'",
        "'speaker_0': 'Regarding fee changes from the city wide fee study, there have been no changes to the recommendations since they were first received by City Council on April six. After May 18th, the next citywide fee adjustment process will be part of the FY22 budget adoption process.'",
        "'speaker_0': 'This concludes the overview. I will now turn it over to Health and Human Services. Pamela Bright for an overview of study findings and the Department recommendations for fiscal year 21.'",
        "'speaker_2': 'Thank you very much. Good evening, Mayor, Vice Mayor and City Council Members. Physician Services. Preliminary results are as such. The vendor reviewed 77 fees within a physician's services bureau. Next slide, please. Within a physician services bureau. They reviewed service categories in the following areas vital records, travel, immunization, laboratory services.'",
        "'speaker_2': 'As a result, the study found that the department is at a 46% cost recovery rate and a 54% subvention rate. PS. An Environmental Health Bureau will be reviewed in a later phase, tentatively scheduled for later this month. Next slide, please.'",
        "'speaker_2': 'The bottom of the screen represents the total, which is a combined total for each respective service category, which those service categories are in column one. In Column two. That is the combined actual cost to render the services, which is the 1.1 million.'",
        "'speaker_2': 'Column three. That $508,603 is the amount collected for the services rendered. The total profit or subvention is a 594,866, which represents a 46% cost recovery and a 54% subvention rate. Next slide, please. While determining whether or not to accept the fee study, we had to consider many factors.'",
        "'speaker_2': 'Enhancing access to public health services. Essentially the overall public benefit. Comparisons to neighboring jurisdictions. Medicare. Medical fees for clinical services. Or clinical fees. Regulatory requirements for laboratory fees. With this in mind. Out of the 77 fees reviewed at this time, we are not requesting any changes.'",
        "'speaker_2': 'Next slide, please. Next slide, please. Okay. I'm sorry. Okay. So this particular slide. Is the key items to consider. So for today's presentation, we really wanted to focus on vital records and vital records. We wanted to look at the full cost for recovery.'",
        "'speaker_2': 'When we did a comparison to other jurisdictions, what we noticed was what we were able to information we were able to get back was that the expedited copy of birth certificate fee would be 113% higher than L.A. County.'",
        "'speaker_2': 'The studies propose letters for non contagious disease b would be 450% higher in L.A. and Riverside counties. The study's proposed emergency weekend death fee. Death certificate fee would be 280% higher in Berkeley. Next slide, please. So overall, increasing these fees or increasing these vital records fees to recover the full cost of providing these services would inhibit or'",
        "'speaker_2': 'hinder access to these public services due to all preceding factors, as well as detrimental impacts of COVID 19 pandemic. The Health Department is not proposing any changes at this time. The Department will review the study recommendations for physician services fees and may move forward with proposed fee increases as part of the fiscal year two fiscal year 22'",
        "'speaker_2': 'budget process. However, there's a high probability that we will not recommend any fee increases. I know there was one flight that was missed and that flight talked about some of the reasons why. We do not want to increase the fees.'",
        "'speaker_2': 'And those were okay. And. City services reform, I think is further up. Further back. But essentially, when we looked at all day, we compared it to other jurisdictions. We looked at Medicare, medical fees, studies, office schedules. We also took into consideration that the benefit to public.'",
        "'speaker_2': 'So that's why at this particular moment in time we are not making any recommendations to increase anything is. Not sure if there are any questions. I have a.'",
        "'speaker_1': 'Question. Sure. But I don't know if we're saving them till the end.'",
        "'speaker_2': 'I could. Okay. So I'm going to turn it over to Parks Recreation and the Marine Department.'",
        "'speaker_5': 'Thank you very much. Honorable Mayor and members of City Council. My name Brant Dennis and I serve you in this community as a director of Parks, Recreation and Marine. This evening I present to you an overview of our department's cost of services study and a summary of recommendations.'",
        "'speaker_5': 'I'd like to point out another major area that our department supports is Animal Care Services. The department is appreciative. Of the opportunity to complete the cost of services, study fee revenue and its impact to the department's ability to provide programs and services is important to PRM.'",
        "'speaker_5': 'We take our responsibility seriously to establish fees that are fair and equitable, to provide affordable and diversified services to all individuals. Next slide, please. The department has over 800 fees spanning multiple funds during this round of the study.'",
        "'speaker_5': '654 current fees were evaluated. The remaining fees, not including in the study, are regularly reviewed through other established mechanisms. The study discusses changes to current rates and possible new fees pursuant to the City Charter. The Parks and Recreation Commission has authority over recreational programs and facilities, which includes the approval of related fees.'",
        "'speaker_5': 'Fees within the Commission's authority that were approved at their meeting in January will be presented today as they were part of the study. It's important to note that full cost recovery is not always recommended in order to encourage access to important recreational opportunities.'",
        "'speaker_5': 'Next slide, please. Here you will see a summary of subvention rates by service area. The columns represent service costs. Fee revenue at the current rate and the total profit or subvention. This chart includes all group funds. This chart does not include revenue unrelated to fee charges and doesn't represent fees that were excluded from the study, such as'",
        "'speaker_5': 'golf and marine slip fees. At the current level of fee and fee revenue represented here, the department is achieving a 13% cost recovery rate overall. Next slide, please. At the conclusion of the Study Department recommendations include changes, including both rate increases and decreases to meet cost recovery and operational needs, as well as changes in fee structures to'",
        "'speaker_5': 'align with service provision. The total estimated annual revenue impact from the recommended changes is approximately $514,000 in general fund and over $60,000 in the Tidelands operating fund groups. Next slide, please. During the course of the study, it's important to consider the impact of prime services and programs to the community as part of the compassion sales policy.'",
        "'speaker_5': 'Animal Care Services rate changes are recommended to encourage the best outcome for treatable animals. Implementing changes in fee titles to clearly identify services is recommended for consistency and to align with our service offerings. Market based fees such as rent, space and equipment are set by what the market can bear and public demand.'",
        "'speaker_5': 'Cost recovery is often calculated at an aggregate level of cost center, which considers the costs of a group instead of individual fees. Next slide, please. Of the total fees included in the study. PRM proposes that 340 remain unchanged.'",
        "'speaker_5': '20 fees are proposed to decrease. 162 are proposed to increase. 109 are restructured fees and 23 fees have been deleted. Recommendations in the study for new fees that are not proposed as part of the fiscal year. 21 midyear recommendations will be brought to City Council at a later date.'",
        "'speaker_5': 'Next slide, please. Examples of recommended adjustments are decrease fees for animal in pounds, increase fees for field use permits and facility rentals, and new fee structures for artificial turf fields just to name a few. Rates set below cost recovery are charges for staff time, animal impound and medical services and the youth sports program.'",
        "'speaker_5': 'Keeping these fees below costs recovery removes barriers to access programs and services. Next slide, please. Comparisons to other jurisdictions and agencies can be difficult because other agencies have different fee structures and fee types then prime such as sports field use and facility rentals.'",
        "'speaker_5': 'Animal licensing fees are in the higher range when compared to other agencies. Marine Bureau rates maintain a competitive price point when compared to similar marine agencies, helping to ensure a financially sound enterprise while remaining in competitive balance with marine industry price trends.'",
        "'speaker_5': 'Finally, I want to thank financial management and the consultants for their leadership. These are important to our city and the department finances and help us provide critical programs and services that our community needs. This concludes my presentation, and then I'll turn it over to the Department of Development Services Director Oscar Orsi.'",
        "'speaker_3': 'Thank you, Mayor, and members of the city council. Next slide, please. Unlike the other departments that you've heard from tonight, the development services is funded largely from the Development Services Fund rather than the general fund. And it is funded through the collection of fees for services that include entitlements, client checks and inspections.'",
        "'speaker_3': 'The consultant helped us analyze over 400 fees, and it was determined that overall the department was under collecting the most significant subventions were in our current planning and historic planning services. However, we also determined that the building bureau was over collecting by approximately 30%.'",
        "'speaker_3': 'Next slide, please. As illustrated in this chart, current planning and historic planning have the largest fee recovery variance at 69 and 40%, respectively. As a whole, the department's invention rate is approximately 11% or $3.64 million. Next slide, please.'",
        "'speaker_3': 'Development services are recommending both increases and decreases, decreases in fees as well as restructuring fees to align with the services provided. As previously indicated, the theoretical revenue rate would be $1.45 million. The fees would be aligned with the study's recommendations, with the exception of historic of certain historic and current planning fees.'",
        "'speaker_3': 'Next slide, please. Although historic and current planning fees are not at full cost, recovery staff has recommended recommending that certain higher historic and current planning fees be phased in over a 2 to 3 year period because of the nature of the increases.'",
        "'speaker_3': 'Staff will evaluate the increases each year to determine if there was a need for an increase. Next slide, please. This slide provides a summary of the proposed changes to the fees. As indicated, 41%. Rather, 170 applications are proposed to be decreased, whereas 27% of the other fees are proposed to increase for 114 total fees.'",
        "'speaker_3': 'At this point, we are recommending that no changes be made to our to certain fees, particularly our fees, as we need further study to better assess the vacancies and the COVID impacts that we've had. As indicated on the next slide, 19% of the fees are proposed to be restructured to align with services.'",
        "'speaker_3': 'New fees for new programs or services with no fees such as a short term rental program and appeals are also proposed. Next slide, please. In an effort to compare our fees and to determine the competitive nature of of Long Beach versus other communities.'",
        "'speaker_3': 'We did do a comparison, but please note that it's difficult to compare with each jurisdiction because of the potential in difference in a difference of service delivery model. And we may those other communities may be under collecting for that similar service.'",
        "'speaker_3': 'That said, staff selected a few common fees and found that they were within the range of other cities. Next slide, please. This slide provides several examples of some of our most common permits. Just to highlight a few of those.'",
        "'speaker_3': 'The CHP, for example, at 8400, is within the range of other communities, although a range of other communities. As another example, the hypothetical 2500 square foot addition at 4500 lies also within the middle range of other communities. And that's it.'",
        "'speaker_3': 'Thank you. I'll turn this over to Grace for further information.'",
        "'speaker_0': 'Great. Thank you very much. So wrapping up this presentation, in summary, the city is generally under recovering for costs based on the studies done for health parks and development services. The three departments are proposed recommendations that are generally aligned with the study's finding for full cost recovery.'",
        "'speaker_0': 'However, as we've mentioned tonight, there are deviations from the study's findings where the department proposes setting fees lower than the cost of service based on prioritization of other goals, such as program participation, competitiveness, maximizing revenues, residents needs and ability to pay, etc. The theoretical revenues potentially generated from the proposed fee changes will be evaluated and if adopted'",
        "'speaker_0': 'by council included as appropriate as part of future proposed budget processes in line with our financial policies. And lastly, these proposed changes discussed today, along with other changes to the master fee and charges schedule, is scheduled to come before council on May 18th.'",
        "'speaker_0': 'City Council can officially adopt these changes on that date. This concludes the presentation and Geraldine, myself and the departments are available for questions. Thank you.'",
        "'speaker_3': 'All right. Thank you. I'm going to take over. At this point, I don't have the cue system. So I'm going to call I'm going to call through council members from 1 to 9 and just let me know if you have comments.'",
        "'speaker_3': 'Council District one.'",
        "'speaker_1': 'Thank you, Vice Mayor. I just wanted to thank staff for this presentation. One of the things that I'm looking forward to is not seeing fees increase for our residents. Right. Especially during this pandemic. But I really look forward to in the near future getting the opportunity to really dig deep into this presentation and the fees themselves.'",
        "'speaker_1': 'So thank you very much for this presentation to start.'",
        "'speaker_3': 'Fantastic. Thank you. Council District two.'",
        "'speaker_1': 'Yes, thank you. The ICE mayor. And I also want to thank the staff for this presentation. One of the things that, you know, we hear a lot about is that, you know, government is inefficient. And so I just want to make sure as we're looking at our direct and indirect cost, that we are looking at restructuring any'",
        "'speaker_2': '. Of our products or.'",
        "'speaker_1': 'Services just to make sure that we're being efficient as can be. And and definitely want to make sure that we are aligning our fees so that all of our residents can utilize our services.'",
        "'speaker_0': 'And that it's, you know.'",
        "'speaker_2': 'Accessible and affordable for all of our residents. So where you think you.'",
        "'speaker_3': 'Thank you. Council District three.'",
        "'speaker_1': 'Thank you very much. Appreciated that presentation. Thank you very much to all of the departments that presented this evening. I do have a question for our PRM team.'",
        "'speaker_0': 'The first thing is I.'",
        "'speaker_1': 'Want to acknowledge and really thank you for being able to take a look at our swim of fees and reducing those. I think that's a really fantastic. I like that we were able to reduce those both for adults and youth and really try to promote some more aquatics programing so that the residents can take advantage of that'",
        "'speaker_1': ', that offering that we have. So that that's really fantastic.'",
        "'speaker_0': 'I did have a question on page.'",
        "'speaker_1': '57 of the 455 page Appendix A. There are some increases for group rentals.'",
        "'speaker_0': 'And.'",
        "'speaker_1': 'The rate seem to increase based on the number of people. But then there are different categories. So if you look at, for example, item number 436 for a group rental of 41 to 80 people, there's a certain cost.'",
        "'speaker_1': 'But then if you look at 440 for a group rental, 41 to 80, there's a different cost. Is that is that based on the venue or is there a different table that goes along with this with this appendix that I'm not aware of?'",
        "'speaker_5': 'Yeah, Councilwoman, that's a good question. So in many in many cases depends on the change of venue, but also as the group size increases for pools, it does require a ratio of increased lifeguard coverage. So that could be a factor that's clearly distinguishing some increases.'",
        "'speaker_5': 'But yeah, we were pleased to keep a lot of our rates are swimming rates for the general public at or at a reduced level. Thank you.'",
        "'speaker_1': 'Okay. Got it. Yeah. I don't think I have any additional questions. I mean, obviously we have to strike a balance in terms of the the services that we provide and the fees associated with those. And I'm sure that metric is different for each department.'",
        "'speaker_1': 'I will say when I was looking at.'",
        "'speaker_0': 'And I just sent.'",
        "'speaker_1': 'A photo of it to someone on our staff when I was looking at the development services fees, one of the biggest fees we get complaints about from people is the concessional conditional use permit fee. And it's noteworthy and I think it's worthy of mention that our conditional use permit fee is much lower, I think, than other cities'",
        "'speaker_1': 'of our size, or at least along the same lines, insignificant in terms of the difference if there is an increase from other jurisdictions. And I think that's really worth noting and something that I hope to cite in the future if that complaint is directed at the city, because I think that it takes a tremendous amount of work'",
        "'speaker_1': 'to process those conditional use permits and to be able to do it at a rate that is consistent with and in many cases lower than neighboring jurisdictions. I think it's worthy of mention. So thank you very much for the presentation tonight.'",
        "'speaker_3': 'Thank you. Counsel before. Thank you, Mr. Vice Mayor. I have kind of a general question. I can certainly wait till the 18th to sort this out. But just to kind of plant the seed. So I understood that one of Grace's concluding remarks was that in some cases, we have fees that do not cover the cost.'",
        "'speaker_3': 'Conversely, I assume to balance that budget, you'd have to pay fees that are over the cost. So if we can kind of cover that topic on the 18th, I greatly appreciate it. Thank you. Thank you. Edition five.'",
        "'speaker_1': 'Thank you. I've been working towards this report for several years, and I think that the pandemic has really highlighted the disparities in our systems and the great need for us to be able to target specific. Reductions in fees through need and need is not always determined by a person's participation in a type of program, but really their'",
        "'speaker_1': 'true costs and burdens and in their position in life. And so one of the things that I think is really important is for us to continue to work towards a universal access card for Long Beach, where a person could qualify for assistance, and that card would then allow them to receive lots of our services at a reduced'",
        "'speaker_1': 'rate. So an example of that is in another jurisdiction. The Junior Lifeguard program is. $540 per session. However, if you meet a certain threshold, you get a subvention of somewhere between ten and 90%. So that would really target pulling in communities that would not otherwise have had those opportunities.'",
        "'speaker_1': 'Instead of spending a program on the whole. Next, I would say that there are certain costs that we haven't because we've always invented them. And in certain cases I think that. Some individuals need that support more than others.'",
        "'speaker_1': 'So an example might be, and I try not to pick one out, but I think that the the example is important. If a vital record service is subsidizing the costs by 49%, and then we say if we were to do true cost recovery, then we would be at a 113%.'",
        "'speaker_1': 'And I wasn't clear it was 113% of L.A. County's fee or our fee, but a birth certificates, $28. And if you're a family that needs assistance and aid, $20 is still a lot of money versus a family that may have had.'",
        "'speaker_1': 'Means and was able to provide. A different level of of opportunity. They would be comfortable paying the $56 for the birth certificate. And I think that we do ourselves a disservice as a city just reducing the fees for every unit of every person.'",
        "'speaker_1': 'And I think that we as a city would be able to provide more assistance to the people who need it most. If we were able to really push forward with our qualification card and the reason I say that is I had a discussion with another councilmember today that was really enlightening about how do we get people in'",
        "'speaker_1': 'the system? Well, people are already qualified if they're a resident of Long Beach through the utilities. So even if you don't have an ID card, you may pay utilities in our city. And so if you've already gone through the process, either with Southern California Edison or the Long Beach Community Action Partnership or with the gas company or'",
        "'speaker_1': 'the water company to demonstrate that you're of low income, you should be able to scan your card anywhere that services are needed. And we should be able to, as a council, determine that there are programs and services that you need that we should subsidize.'",
        "'speaker_1': 'And then, on the other hand, if you're not in need of those services today, we had a great presentation at the Infrastructure Committee by Mr. Mario Cordero, who talked about the K-Shaped recovery, where certain people and certain income groups have amassed more wealth in the last year with the inability to spend money than they've ever needed to'",
        "'speaker_1': 'before. And I know that that's apparent in my community that has median incomes that range from the I guess it doesn't range because it's an actual number, but this year's numbers not out yet. We have a high increase in permit requests.'",
        "'speaker_1': 'And so if we're not burdening the true cost of those permits onto the person and applying, then the the catch on that is that then their projects are often delayed. So there are people who tell me I would have paid the extra $200 if you would have let me process my roof, because not letting me process my'",
        "'speaker_1': 'roof means that there's significantly more costs because now I have a leak and that leak has caused this and that and the other. And now my costs are $3,000 more because I wasn't able to get the services I needed in a timely fashion because we either vented the costs and did not have enough staff.'",
        "'speaker_1': 'I know that COVID was a specific, unique scenario in development services this year, but. It's important for us to put a couple of things of messaging on everything that has a fee associated, in my opinion. I believe that we should put on any document that states a fee that the city does not make money on residents, business'",
        "'speaker_1': 'owners or landlords, that the true cost of recovery of this service would be. X So let's say there was a fee that was 80 $500 this up and Councilman Price brought this up. We get a lot of requests to reduce the cost of a cop.'",
        "'speaker_1': 'Perhaps it would make sense for us to say that the city does not make money through fees. Therefore, cost recovery. The true cost recovery of this fee would be $12,860. Through an action of the City Council. We are supporting this fee because we believe there's a value in having a conditional use permit presented to the Council.'",
        "'speaker_1': 'And so to incentivize that, we reduce the fee by 25% and your fee is 80 $500.'",
        "'speaker_2': 'Councilwoman, obviously that's.'",
        "'speaker_0': 'Your 5 minutes is up.'",
        "'speaker_1': 'Thank you. Obviously, that's very verbose and we could hone that down considerably. But I plan to meet with each of the department heads that have gone through this process so far. I look forward to hearing their insights and and opportunities for improvement.'",
        "'speaker_1': 'And I have some specific questions on some specific fees, but I guess I'll meet with them individually on that. But there's one thing that's happening in my district that doesn't have a fee associated with it and that individuals should not get a free service if we don't feel that there's a need to segment it because there's not'",
        "'speaker_1': 'a value that the city as a whole. Thank you.'",
        "'speaker_3': 'All right. Thank you. Council District six, please.'",
        "'speaker_1': 'I just want to thank staff for the presentation, and I think it's really important and I appreciate the process that takes of getting us a report on user, just the fees and reviewing it. And I look forward to our May 18.'",
        "'speaker_1': 'As you know, they're similar. My colleague just questioning how we can ensure that the fees are done in in a way that ensure services are appropriately provided in consideration of those it's serving. So so that's pretty much it for me on my end.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'I think. All right. Thank you. Council District seven, please.'",
        "'speaker_4': 'Thank you, Mayor. Well, the most important is, I think that this study really comes out of the fact that we really have to look at market based fees, what's out there, what can the market tolerate in regard to some of the structures that we have in many of the services to make sure that, you know, at these'",
        "'speaker_4': 'things, you said it best right there to make sure that that people understand that the fees that we're charging is not because we're out to make a buck, but because we're providing a service. And I think that's very important that we get that message out, that the fees that we had is a cost, recovery of the cost'",
        "'speaker_4': 'for our employees out there, of vehicles, of gas, whatever, whatever it takes, all the other infrastructure type type of costs that we have to bear and those fees cover those costs. So, I mean, it's very important that we get a real robust market fee structure in there in place to make sure that we are aligned with what'",
        "'speaker_4': 'our neighbors are doing so that we don't overprice ourselves out of the market to to have people eventually say, I'm leaving Long Beach because you're just too expensive. I know that comes up a lot with with our license fees or business license fees.'",
        "'speaker_4': 'We get that all the time. I get that all the time. But you guys cost too much. Also, we were always been criticized for the fact that our parking fees seem to always be going up. And, you know, we have to be careful about if we have an increase in fees, we have to make sure that it's'",
        "'speaker_4': 'within the market and what and what people can stand. So I'm looking forward to the 18th. We will be able to have a more robust discussion on this and be able to review all the other 1000 fees. Are there 2000 fees that will be reviewed across all the department?'",
        "'speaker_4': 'So I want to thank staff for an overview. Thank you.'",
        "'speaker_3': 'Thank you. Council District eight.'",
        "'speaker_4': 'Thank you. Join. Want to join with my colleagues in thanking staff for this detailed presentation. I think we missed this a few weeks ago, but I'm glad we are. We're having this conversation. It's very enlightening. I, I want to just to sort of give recognition to our previous form about budget share Stacie, Margo Councilmember lingo for being'",
        "'speaker_4': 'or harping on this issue of subversion. And I think the first time I heard that term, I was doing a, B or C meeting and she's been talking about this for some time. And so to have this report, I know it's something that she's been working towards for for some time.'",
        "'speaker_4': 'And so I want to thank her and especially our financial management staff, but all the departments who participated in this, this is very eye opening, understanding that our mission is service as a city. It's not we're not a corporation.'",
        "'speaker_4': 'And so we don't necessarily need to balance the cost. But I think we should do a better job of cost recovery where we can. And this gives us a really bird's eye view of where opportunities could lie, but also where where we we we may have some some challenges.'",
        "'speaker_4': 'I want to be mindful of the 23 projected shortfall that we have. And and this is a great opportunity for us to start making adjustments to to address some of our budget challenges that we know we will be facing in the very near future.'",
        "'speaker_4': 'And, you know, based on what I'm seeing are our we've got a $55 billion subvention and the recommendations from staff is is to recover about $2 billion of it here. I think we can do better, better. And this council I put upon each and every one of us to go and dig a little deeper and look at'",
        "'speaker_4': ', you know, where we can, you know, make make adjustments. I did have a question for, I guess, that our city manager is when it comes to subvention in terms of local government practices, is there any sort of like standardized?'",
        "'speaker_4': 'Methodology to to to understand switching cost. And where we should be. Is there is there a standard or best practice recommended councilmember Austin.'",
        "'speaker_0': 'We do have city are part of our city wide financial policies is a policy on cost recovery and our financial policies that council have adopted is that we would cost recovery at the rate of service except when there are other priorities that the Council deems as higher.'",
        "'speaker_0': 'And as we mentioned during the study and the departments also addressed this as well. There may be other goals such as program participation, staying competitive in the market, different ways to maximize our revenue, looking at our residents needs and abilities to pay.'",
        "'speaker_0': 'Overall, I think cities in general do factor in all of these things when setting their rates and for their cost recovery. And our goal for these citywide studies that we're doing right now is to get to the data and the facts for what the data tells the subvention rate is.'",
        "'speaker_0': 'But then also each department is customizing and looking and evaluating with the consultants what is our goals and our priorities and why we might be setting rates at a lower level than the actual cost of city. So and one thing just to clarify from a comment earlier is we are not setting any fees higher than the cost'",
        "'speaker_0': 'of the service, at least not intentionally. And so part of the goal of this study is to to make sure that we know that we are not doing that and getting the data and the facts so that we know if there is any overages will bring them down and if there is subvention to evaluate whether or not'",
        "'speaker_0': 'we want to bring the cost up to cost recovery or to continue this event for these other purposes.'",
        "'speaker_4': 'Thank you. And I just had a clarification on that. I'm sure we'll have a lot more discussion on May 18th, but I want to get some clarification. Were all of the funds considered here, general for or for other departments, or were other funds factored in reserve?'",
        "'speaker_5': 'So health fund is in the health department is almost all health fund fees in the Development Services Fund. It was a little bit of general fund, but almost all of it is Development Services Fund, which is a fully contained enterprise and is designed to be cost recovery and self-sufficient.'",
        "'speaker_5': 'And then in Parks and Rec, it's mostly general fund, but there's also some tailwinds there as well.'",
        "'speaker_4': 'So related to the Marine bureau, would that be tailored mostly? Yes, sir. Okay. Thank you. And no further questions. Look forward to more conversation about this. Thanks.'",
        "'speaker_3': 'Fantastic. Thank you. Just a few thoughts on this. So look forward to this has been a good discussion. Great presentation. I look forward to the discussion in a few weeks. I hesitate to raise fees on. I always hesitate to raise fees on low income families and youth, particularly on quality of life programs.'",
        "'speaker_3': 'I know that we do full cost recovery, but I think just the staff mentioned it. Sometimes the council has a different priority and historically we've, you know, focused on removing barriers for people to be able to participate in some of these programs.'",
        "'speaker_3': 'So I would you know, I hesitate to raise any any of those fees, and I don't see those being proposed here. I think our policy on full cost recovery, you know, I think that that's a that's a good thing.'",
        "'speaker_3': 'Most most businesses that I know and and you know and from what I know, folks, as long as they get a value add, as long as they understand what they're getting for their fee, they're fine paying what the market fee is and and making sure that full cost fees go directly to the city.'",
        "'speaker_3': 'If anything, folks like seeing it actually come into the city's coffers and not go to a third party contractor to provide service. So these fees, they do support, you know, our city having quality public services and public employees providing those services.'",
        "'speaker_3': 'So. So I think as long as we keep them, you know, think about the value added, particularly as it relates to the development services fees. If that be into development services, you know, if they're fully funded, they're going to move faster, that people are going to get projects done quicker, ultimately saves money.'",
        "'speaker_3': 'And so so we just have to think about the value add. The other thing is and this is the issue of raising the past, I'm just going to ask, you know, staff to kind of respond to this. You know, I've I've I've I remember, you know, one time we opened a burger place in North Long Beach.'",
        "'speaker_3': 'They opened all their fees and they were closed within a year. And, you know, we have areas of town where the failure rate of small business, like they like many, many small businesses, fail in the first three years.'",
        "'speaker_3': 'We always ask the question, why charge fees in the first place and add to a barrier for a business that we know is going to struggle in this in this particular area of town. And so I would just ask staff, you know, as we're thinking about these fees, are we factoring in and how we go about making'",
        "'speaker_3': 'sure that we I know we have to make sure fees are fair across the board, but that we sort of, you know, target cents or rebates or whatever it is to make sure that they advance some of these, you know, strategic goals.'",
        "'speaker_3': 'I would ask staff, how would how would you respond to some of those recommendations in the past about, you know, structuring fees or rebates related to fees to create, you know, more opportunity in areas of the town where, particularly with small businesses, just haven't thrived within within the first three years of establishment.'",
        "'speaker_5': 'Yes. Vice Mayor. So in that particular instance, that would probably mostly be the Development Services Fund. So again, it's designed as a self-contained fund so that it's not drawing upon general fund. In some of your other areas, we might just say, hey, we just want to cut the fee in half for certain areas or for certain types'",
        "'speaker_5': 'of businesses, but for their own services. If you if you aren't doing full cost recovery, then you're going to end up having general fund go in and subsidizing that, which we've always tried to avoid. So in that particular instance, we would recommend that you achieve your full cost recovery.'",
        "'speaker_5': 'You set what the rates are, you make sure you've you're collecting it, and then you create a separate fund, could be Recovery Act, could be something else, and then be really surgical and really intensive about where you want to provide a subsidy.'",
        "'speaker_5': 'So then you can say these are the types of businesses that fail. This is what we want to try to, you know, create and make it easier for them and use that funding to reduce the burden on the business.'",
        "'speaker_3': 'Thank you. And it all makes sense to me. You know, I know this is really the forum for that. But, you know, as we move forward, those are things I'm interested in seeing. We have the ability to make things work a little bit easier, particularly in areas that have dealt with generations of the same economic condition.'",
        "'speaker_3': 'And we have to change the condition in order to have a different outcome. And so those things I'll be looking forward to in the future. Those are my comments. Thank you so much, staff. I see Councilman Mungo's queued up, queued up for a second round, Councilmember.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember at. I want to address some of the things you said, because I think it really goes back to a discussion that you and I and the council had in 2014 or 15 where. There was a first year refund and rebates program that we did, and we set aside general funds to pay back'",
        "'speaker_1': 'some of the fees that a business has to pay in the first year that they have a business. And one of the things that was really interesting is the business community really supported the idea that if you open a new business, you shouldn't have to pay the fees for two years.'",
        "'speaker_1': 'And the council was supportive. We had a unanimous vote. We moved in that direction. Then in alignment with the business community, they said it would be really easy for them to get these refunds. And so it was literally a one page document that had maybe five things to fill out your name, your business, your address, the amount'",
        "'speaker_1': 'of fees you want refunded. It was simple, and it was at every station in the Development Services Office. And what we found was that in the. Strain and struggle of opening a new business. The number of people that actually applied for it was significantly lower than the anticipated projection by both the business community and the city.'",
        "'speaker_1': 'So I am in agreement. It would be great if we could figure out a way to. Incentivize opening businesses. I know that from our presentation from Mr. Chrysler Economic Development, our restaurants are on the low end of the number of new businesses in the city and your district.'",
        "'speaker_1': 'In my district, we don't have as many. But it is interesting as a a person who's opened my own business before, as a person who comes from a family that had 16 businesses in the lowest income areas of Long Beach and a franchise.'",
        "'speaker_1': 'When you're opening a business and when I interview individuals who have gone through these processes, there's just so much paperwork and guidance at the beginning. And I think that something else that I want to say, Councilmember Sorrow and Councilwoman Allen and you spoke about earlier that has also been a real gem to my heart is really that'",
        "'speaker_1': 'mentoring and coaching that's available from our Small Business Development Center and other areas. Because when you're starting that business up and you're trying your financials and order and your marketing and all that, this one form, which was the simplest we could possibly make, it wasn't a top priority to these businesses.'",
        "'speaker_1': 'So we really need to reflect on hopefully times have changed and that would be something that they would be interested in. But I know that we ended up repurposing that money after two years of underutilization. I'm I want to comment on a comment from Councilmember Otunga.'",
        "'speaker_1': 'I thought it was really a really smart comment to say about market rate fees and as a champion for the libraries and having brought forward many items that waived the fines on books. The way that we're able to do that is because the individuals who can't afford to make those those payments do.'",
        "'speaker_1': 'And there were some unique stories. I talked to a couple of moms and my mommy group about how Councilmember Ortigas item really brought forward their just knowledge and awareness that they had outstanding books and they ended up not needing to not pay their fines and fees.'",
        "'speaker_1': 'It was $5 and they felt it was important to pay it. So they taught their children and they did. But the item and the ability to do that is possible when we have market rate fees and other areas, not that we want to raise fees, especially in a time of COVID, but Councilmember Austin's point about the best'",
        "'speaker_1': 'practices of cost recovery, the city would have $55 million to target and say, we believe that the most important thing in these communities is considered an apex to health. And so we don't want to have sports fees, and we could do that if we were cost recovery in other areas.'",
        "'speaker_1': 'But it's about tough choices. So I know one of the things that happened in another area that I worked in, in another government was when we found out what those cost recoveries were. We also put ourselves on a three year path for cost recovery.'",
        "'speaker_1': 'We did not burden those entities with the full cost recovery in the first year. And so potentially that would be a strategy. We know we're in a deficit. I would love to be in a position where we had the Long Beach access card, where families that needed it most and qualified for income assistance could scan.'",
        "'speaker_1': 'And when they needed to go to Eldorado Park or when they needed a park at the library, they would pay nothing but individuals who were making $180,000 a year, $400,000 a year, which we're very fortunate to have lots of people in our community that do that.'",
        "'speaker_1': 'Perhaps it wouldn't make the most sense to be subsidizing their parking or subsidizing their $7 to go to the park. So I think that those are the ways in which we really get the communities that need it most instead of just an overarching fees, our fees, and we should lower them all because they're high, then we don't'",
        "'speaker_1': 'really get to use the funding to help the communities and lift them up in an equitable way. So those are just some of my thoughts and I hope that. The transparency component of this is appreciated because I think it's important for each of us to know what the true cost of things are so that we as a'",
        "'speaker_1': 'city and as individuals can prioritize where we believe that funding needs to go. So thanks so much. And I don't support raising too many fees. I'm in the downturn, the economy, and I never support raising them on our our families that are most need.'",
        "'speaker_1': 'But I think it's important for us to make those tough decisions. That's why we were elected. So thanks so much.'",
        "'speaker_3': 'All right. Thank you. Any public comment on a study session? No public comment. All right. Let's go ahead and have a roll call. We need a motion and second to resume on file.'",
        "'speaker_2': 'Some moved.'",
        "'speaker_3': 'Moved. Okay. I think I saw Austin second. Or is that your second? Okay. All right. Let's go ahead to the roll call vote.'",
        "'speaker_0': 'I'm sorry, who is the seconder on the motion?'",
        "'speaker_3': 'The usually ranga.'",
        "'speaker_0': 'Ranga? So Zondi house was a mover or ranga was a seconder.'",
        "'speaker_3': 'Right.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'District two I, district three.'",
        "'speaker_1': 'I, district four.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'District five I.'",
        "'speaker_0': 'District six i. District seven.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'District eight. By District nine. I motion carries.'",
        "'speaker_3': 'All right. So that satisfies the agenda. As we close, I'm going to go to four new businessmen, go to council member Zoro first, who has a request to close the meeting.'"
    ]
}