{
    "Recommendation related to the Public-Private-Partnership to Design-Build-Finance-Operate-Maintain a re-envisioned Civic Center, including City Hall, Main Library, Lincoln Park, Private Development and a possible new permanent headquarters for the Harbor Department (Project), the following actions are hereby requested:  Receive and file the Evaluation Summary Report, dated October 2, 2014, which summarizes the analyses and scores of the responses to Request for Proposals (RFP) No. CM14-040;  Confirm the findings in the Evaluation Summary Report that both Plenary Edgemoor Civic Partners (PECP) and Long Beach CiviCore Alliance (LBCCA) submitted proposals responsive to the RFP and are eligible to receive payment of the stipend;  Confirm the recommendation of staff to select PECP as the Citys preferred Project Team for the Project;  For the Port-In alternative, authorize City Manager to negotiate and execute an Memorandum of Understanding (MOU) with the Board of Harbor Commissioners (BHC) detailing rights and obligations of both parties during the Exclusive Negotiation Agreement ": [
        "'speaker_4': 'Okay. We are moving now on to item ten, which is the Civic Center. So let me begin first by going over what this this item here and this item slash hearing will entail as far as the process. And then will begin and so.'",
        "'speaker_0': 'What will begin with, like all.'",
        "'speaker_4': 'Items before us will begin with a staff report. Staff will begin and make a full report on the civic center. Also, after the staff report, we will then have civic core, which is one of the two teams. It was the team that was not selected by staff who are here who would like to address the council.'",
        "'speaker_4': 'They have been given 10 minutes to make to address the council. Then we will go on to plenary edge Moore, who did receive staff's recommendation to move forward. They will then address the council for 10 minutes. Then after that, it will come back to the Council for any questions or deliberation.'",
        "'speaker_4': 'After the council, we will open it up for a public comment. And at that point, we may or may not have a motion in place. And we'll go we'll go from there. So that's typical of most. And both teams were informed that this would be that we would have a process with the 10 minutes for each.'",
        "'speaker_4': 'So that's what we've set in place. So with that, of course, I'm going to go and turn this over to Mr. West and he'll begin the staff report and presentation.'",
        "'speaker_11': 'Thank you, Mayor. Council members, this is an exciting night to us. We've got two fantastic teams that went through the RFP process. Unfortunately, we can only recommend one. At this time, I'm going to turn it over to Mike Conaway, our director of property and business services, who's going to give the primary staff report.'",
        "'speaker_11': 'With him is our development services director, Amy Bodak, our finance director, John GROSS. Also in the audience is Glenda Williams, our library director, all members of the team that has been meeting for 22 months to go through this.'",
        "'speaker_11': 'In addition, we have our two port employees that were also members of this 22 month team. So with that, I'm going to turn it over to Mr. Connelly.'",
        "'speaker_10': 'Thank you, Mr. West. Mayor Garcia, members of the City Council. This item furthers the visioning of the new Long Beach Civic Center, evaluates the proposals submitted in response to the RFP, and recommends certain next steps should the city council elect to proceed.'",
        "'speaker_10': 'As information. Last night, the Board of Harbor Commissioners elected to participate in the Civic Center project and confirmed staff's recommendation to select Plenary Edge as the city's preferred project team. The format of tonight's presentation will be as follows quick background on the history of the process.'",
        "'speaker_10': 'An overview of the proposals from the two project teams. A summary of the evaluation process and scoring the results of the scoring and staff's recommendation. The next steps in the process should city council look to proceed and finally recommended actions.'",
        "'speaker_10': 'But for a little background first. In 2006, the Civic Center revisioning process was started with concepts and ideas for a new civic center continuing through 2008. The efforts were expanded to Mr. Marshall Courthouse site.'",
        "'speaker_0': 'Mr. Conway said.'",
        "'speaker_9': 'I think we have the audio increased. I'm not able to hear you that.'",
        "'speaker_10': 'Well, I'm sorry.'",
        "'speaker_9': 'I just just.'",
        "'speaker_4': 'Maybe just speaking to the mic a little bit more. I'll try to or maybe if the audio. If it's still. Thank you.'",
        "'speaker_10': 'So in 2006, the Civic Center revisioning process was started with concepts and ideas for a new civic center, and continuing through 2008, the efforts were expanded to include the old, old courthouse site and further planning was conducted. However, the effort was delayed by an economic recession.'",
        "'speaker_10': 'But in February 2013, the process was reengaged. When City Council authorized the preparation and release of a request for qualifications for project teams experienced in public private partnerships and capable of delivering a design, build, finance, operate and maintain delivery model and in particular experience in delivering public facilities similar to city halls and main libraries in the context'",
        "'speaker_10': 'of a civic civic center was critical. The revisioning process now includes nearly 16 acres, including three blocks of downtown, along with a vacant lot at the corner of third and Cedar. This process has led to the release of an RFP, to which responses are received from two eminently qualified teams.'",
        "'speaker_10': 'More recently, the mayor has redirected the project timeline to ensure a more more robust public outreach process. Toward that effort, there has been three study sessions to open houses and additional community meetings held in different locations throughout the city.'",
        "'speaker_10': 'In the September 16th study session, considerable information was presented regarding the three alternatives available to address the seismic deficiencies of City Hall in the main library. The rebuild and alternative under a P3 dbf for one delivery model was offered as the best value and lowest risk to the city.'",
        "'speaker_10': 'And then November 11th study session background was provided on the P3 DB awful delivery model summarizing the DB F1 benefits. This model shifts the risks of delays, change orders, market conditions to the private partner. This model has the shortest delivery timeline.'",
        "'speaker_10': 'This model includes a 40 year maintenance contract and a levelized annual cost within the city's lease payment and ownership of the buildings revert to the city at the end of the term at a specified condition. To quickly highlight the significant dates related to Syria's efforts to pursue a form delivery model.'",
        "'speaker_10': 'On February 12th, 2013, City Council directed staff to prepare and release an RFQ for Dbf away on public private partnership. On April 1st, the Board of Harbor Commissioners agreed to participate. On October 22nd, City Council selected a short list of RFQ respondents directed staff to prepare and release an RFP to that shortlist.'",
        "'speaker_10': 'On January 27th, Board of Harbor Commissioners agreed to participate in the RFP. RFP was released on February 28th, 2013. Proposals were received on June 2nd, 2013 from Long Beach Civic Alliance and Plenary Edge Morris Civic Partners Staff and it's consultant ARP has been analyzing, clarifying, assessing and scoring the proposals since that time.'",
        "'speaker_10': 'And as mentioned earlier on December eight, 2014, the Board of Harbor Commissioners elected to participate in the Civic Center project and have confirmed the recommendation of staff to select plenary age more as the city's preferred to project team.'",
        "'speaker_10': 'Steering the project teams and their responses to the RFP City Council established certain guiding principles reflecting City Council's desired outcomes for the revisioning process. And these principles include redeveloping the Civic Center, including a grand civic plaza, reconnecting the Civic Center with surrounding communities, reactivating Lincoln Park, using best efforts to remain cost neutral, and promoting private development on'",
        "'speaker_10': 'excess property to increase density in the downtown and increase property sales and transient occupant occupancy taxes for the general fund. Similarly, City Council identified project goals that align with the objectives of the DB form procurement model, including remaining cost neutral shifting of risk for focus on lifecycle costs and require that the buildings revert to the city at'",
        "'speaker_10': 'the end of the term in a good or a better condition. So now we will.'",
        "'speaker_0': 'Take a look at.'",
        "'speaker_10': 'The proposals submitted by the two project teams. On the left hand side of the slider images from Civic Cause proposal. On the right hand side, images from plenary edge Morse proposal. Both teams propose locating City Hall and the Harbor Department headquarters on the former courthouse property.'",
        "'speaker_10': 'Both teams extended Chestnut and Cedar Avenues from Ocean Boulevard to Broadway and connected these streets by a new first Street extension through the middle block. Both teams relocated the main library to the northern end of Lincoln Park, and both teams focused private development in the middle block and the third and Cedar site.'",
        "'speaker_10': 'However, there are some significant differences which will be discussed later on in this presentation. From an aerial perspective of civic course proposals. This shows the significant massing and dominating scale of the public and private development and its integration with the downtown core.'",
        "'speaker_10': 'From an aerial perspective, a culinary headquarters proposal massing as appears more balanced and gradual, reflecting its integration and cohesion both internally and with downtown. This perspective of civic course proposal is from the future intersection of Chestnut Avenue and Ocean Boulevard, showing the shared space to be used for chambers and with the proposed 11 story port headquarters on'",
        "'speaker_10': 'the left and the proposed 13 storey City Hall on the right. This Prospected plenary edge March proposal is from the intersection of Magnolia Avenue and Ocean Boulevard, offering a pedestrian friendly entryway into the Civic Plaza with a shared chambers adjoining the public entry way and the proposed nine story port headquarters on the right and the nine story'",
        "'speaker_10': 'of City Hall on the left. So with this preliminary index introduction of the proposal, have to move into the evaluation process and starting out with a little bit of background. In 2013, the Project Team Selection Committee was assembled, which includes the directors of Financial Management, Development Services, Library Services and Economic and Property Development, and two members from'",
        "'speaker_10': 'the Harbor Department, the Chief Harbor Engineer and the Managing Director of Finance, and additionally, a Deputy City Attorney participated in every meeting. The role of the committee was to direct and fearlessly facilitate the preparation and release of the RFQ.'",
        "'speaker_10': 'Recommend a short list of RFQ respondents. Prepare a thorough evaluation matrix against which the RFP would be scored and which was included in the RFP. Prepare and release the RFP. Assess and score the responses relative to the requirements detailed in the RFP.'",
        "'speaker_10': 'Consistent with the evaluation matrix. And lastly, the committee's final role is to recommend the preferred project team to City Council for its consideration. The evaluation criteria identified specific categories of interest against which proposals would be evaluated and scored.'",
        "'speaker_10': 'The evaluation criteria were designed in part to reflect the guiding principles and project goals as approved by City Council and as set forth in the RFQ and the RFP. The evaluation matrix is aggregated into six categories containing 35 elements and 84 criteria.'",
        "'speaker_10': 'The six categories are administrative whose elements are pass fail, technical, whose elements reflect a total potential score of 118, which is 44% of the total possible score. Facilities management, whose elements reflect a potential score of 18 points. Private development reflecting a total potential score of 43 points.'",
        "'speaker_10': 'And Financial Proposal Public and financial proposal private whose elements reflect a potential score of 50 and 38 respectively. Total points available in the evaluation criteria is 267. And whether that's in the port in scenario, in the port out scenario, it's 259.'",
        "'speaker_10': 'So moving into the evaluation of the proposals. The first category is administrative. There are ten elements and ten criteria, all of which are pass fail. Both project teams passed the administration administrative evaluation. The next category of evaluations is the team's technical submittal.'",
        "'speaker_10': 'This category contains seven elements 41 criteria and is worth 118 points. Clearly, this category was of critical importance to the committee and to the project teams. This category accounts for 24 of the 28 points that separate civic core and plenary edge and clearly demonstrates the areas of disparity between these proposals.'",
        "'speaker_10': 'So considering the critical importance of this category, I'd like to spend a little bit more time presenting the aspects that served to distinguish one proposal from the other. And civic leaders lay out the civic component as assembled on the courthouse property to the left while the private development is proposed in the middle block.'",
        "'speaker_10': 'The main library is proposed to be shifted further north into Lincoln Park. In analyzing the cohesiveness and connectivity of the site plan. Each block appears to be independent of the others, without clear and inviting elements that link the blocks.'",
        "'speaker_10': 'Civic core proposals. A small forecourt in front of City Hall instead of a civic plaza. There is no area to provide public gathering, special events, peaceful protests or a civic engagement. Civic Corps proposes that First Street and therefore Chestnut Avenue would be used for a Civic Plaza.'",
        "'speaker_10': 'However, this would require street closures, which require permits in order to function as a civic plaza. While the inclusion of a new parking structure has beneficial attributes. Its location serves to eliminate any activity along Magnolia Avenue between Ocean and Broadway.'",
        "'speaker_10': 'Rather than welcoming visitors from the World Trade Center and the courthouse. The parking structure instead dissuades the pedestrian. The location of the shared chamber space is on the hard corner of ocean and Chestnut in close proximity to vehicles, which could present a safety risk.'",
        "'speaker_10': 'The main library is proposed to be located on the north end of Lincoln Park. However, civic core proposals to leave the vehicular ramps in place. This result in a main library that is set well back from Broadway and bifurcating Lincoln Park with the front door of the main library facing south to Lincoln Park.'",
        "'speaker_10': 'The main library essentially turns its back on the communities to the north. Who are the most likely to use the library? The remaining portion of Lincoln Park provides less area for large planned events. The somewhat austere landscape and disconnected hardscape do not reflect the quality anticipated for such a strategic asset.'",
        "'speaker_10': 'The integrating backbone of the Civic Center is not apparent for visitors and residents that arrive via the first Street Transit Mall. There is no clear, visual or pedestrian path that welcomes the visitor to the park. Instead, the park seems to be oriented toward Ocean Drive as the front yard of the main library.'",
        "'speaker_10': 'The proposed hotel includes a service road with a curb cut onto Ocean Boulevard delivery and refuse vehicles. Entering and exiting onto Ocean Boulevard will be a significant inconvenience to the driving public and an undesirable visual element. The private development north of First Street results in a super block that is now not allowed under the downtown plan.'",
        "'speaker_10': 'While Civic Aura has provided a pedestrian walkway at the surface level through this super block, the private development remains visually obtrusive and overwhelmingly massive. In contrast and in a more edge more is layout. The civic component is again assembled in the courthouse property with the main library also moved to the north end of Lincoln Park.'",
        "'speaker_10': 'But the plan appears more connected, integrated and cohesive, with each block related to the other. There is an inviting civic plaza, well sized for public gatherings, special events and civic engagement. The linked visual corridor through the three blocks welcomes pedestrians from the West and the pedestrian pathway through Lincoln Park invites pedestrians from the east, both of which'",
        "'speaker_10': 'can enjoy the retail elements along first Street. Parking for City Hall and the main library are proposed to continue to occur in the Broadway and Lincoln Park garages. Parking for the port headquarters is proposed to be below ground.'",
        "'speaker_10': 'Unobtrusive to the view sheds or pedestrian scale. The shared chambers is located at the focal point of the visual corridor and surrounded by the Civic Plaza. The main library is brought north to the direct Broadway frontage, eliminating the vehicular ramps and offering dual entrances to the community.'",
        "'speaker_10': 'And this creates a larger open park area as the park is not bifurcated. Deliveries to the proposed hotel will occur below ground access by new ramps to the Lincoln Park garage. The private development does not create a super block, which is more inviting to the pedestrian by offering physical connectivity from the east to the west.'",
        "'speaker_10': 'The residential development is not overwhelming and carefully steps up in mass and scale as development moves south towards Ocean Boulevard. Civic Corps is answer to a civic plaza is proposed to include First Street and therefore Chestnut Avenue. Planned events would result in street closures requiring permits, which will eliminate access to the retailers on First Street and bring'",
        "'speaker_10': 'civic engagement into an area proposed for residential and hotel uses. Unplanned events would result in considerable redeployment of resources. For Civic Corps. The minimal setback from Chesnut Avenue does not create a sufficient opportunity for public gathering as a destination port point or as a forecourt to City Hall.'",
        "'speaker_10': 'Plenary edge more is inclusion of a civic plaza, connects the civic uses and creates an entryway and gathering point for special events, pre meetings, outdoor dining and activities and civic engagement. Rather than a forecourt. The Civic Plaza and plenary edge Morse proposal creates a destination for the pedestrian that can be activated with events, music, outdoor dining venues'",
        "'speaker_10': 'and a rest stop for coffee and conversation. Accessing the connectivity and cohesiveness from the site plan perspective, civic core has achieved a vision where City Hall is the focal point of the interconnected blocks and establishes a certain level of cohesiveness.'",
        "'speaker_10': 'However, that connectivity ends somewhat abruptly at the forecourt at Chestnut Avenue and in contrast, plenary edge more achieves connectivity and cohesion from Magnolia Boulevard to Pacific Avenue and actually works to draw employees and visitors from the World Trade Center and Deukmejian courthouse to the West and from the transit mall pipeline and the promenade to the east.'",
        "'speaker_10': 'The Magnolia Garage proposed by Civic also presents a logistics problem for the visitor to City Hall in order to maintain sufficient security in City Hall. The City Hall visitor would need to exit the Magnolia Garage at Magnolia Avenue, travel south to Ocean Boulevard, then travel east to Chestnut Avenue and then north to First Street in order to'",
        "'speaker_10': 'enter City Hall. The entire path of which has no real retail component and avoids bringing the visitor through the first first street retail corridor. There is an entry from the Magnolia Garage into the shared space near the near the chambers, but that was proposed to be an ADA access and is not convenient to accessing either City Hall'",
        "'speaker_10': 'or the port headquarters. In Plenary Edge. Moore's proposal to Broadway Garage remains in place, which has long been the parking location for visitors to City Hall with wayfinding. The short walk to First Street, either from Chestnut or Cedar, will bring the visitor to the Civic Plaza via the first Street retail corridor with a clear visual.'",
        "'speaker_0': 'Path.'",
        "'speaker_10': 'To City Hall.'",
        "'speaker_0': 'Comparing the main library.'",
        "'speaker_10': 'Citing civic core is on the left plenary edge. More is on the right. Civic Cause main library is set back from Broadway and is inaccessible because Civic Core proposes to retain the vehicular ramps to the Lincoln Park garage.'",
        "'speaker_10': 'This eliminates access to the library from the north. This also results in bifurcating Lincoln Park, reducing its functionality for programing and as a gathering place. Plenary Edge more is main library is sited directly on Broadway with dual entrances to the north and south because the vehicular ramps are proposed to be removed.'",
        "'speaker_10': 'The park is not bifurcated and therefore becomes a more attractive area for large public events and programing. And now a few comments about the bouncing of the proposals. Civic Core has not successfully integrated the massing and scale of City Hall in the Harbor Department headquarters in relation to the public safety building and the private development.'",
        "'speaker_10': 'The massing of private development appears abrupt, inconsistent and somewhat overwhelming in scale. Evaluating culinary edge, Morris Massing City Hall and Harbor Department headquarters align well and offer consistent massing with the public safety building. The private development graduates in both scale and mass.'",
        "'speaker_10': 'As the development moves south towards Ocean Boulevard and at Ocean Boulevard, the proposed tower integrates well with the height and character of Ocean Boulevard. Now a couple of comments on floor plates and stacking. Civic Corps provides a pre function space at the entry to City Hall with high demand services on the first floor.'",
        "'speaker_10': 'This layout may serve to create a concentration of visitors at the entryway impeding the traffic flow. Civic. Civic Core is City Hall, located on a secondary street, has floor plates that narrow in the upper floors. From 16,000 square feet to 12,000 square feet.'",
        "'speaker_10': 'And finally down to 10,400 square feet on the top two floors. This works to split many departments under two floors, including the Mayor and City Council. Reducing Efficiency and collaboration. Plenary Edgware is use of a pre function arcade along the Civic Plaza for high demand services, works to reduce time and frustration and provides ease of access for'",
        "'speaker_10': 'residents dealing with regular city business on a monthly basis or on an as needed basis. The system also works to reduce the number of people needing to enter City Hall and get process through security. The floor plates are consistent at 24,000 square feet and include raised floors that provide unlimited flexibility in relocating offices or workstations.'",
        "'speaker_10': 'Few departments are split onto two floors, offering greater efficiency and collaboration. Mayor and City Council occupy the top floor with an outdoor viewing area. So putting the technical category behind us, we now move forward with the next category of evaluation, which is facilities management.'",
        "'speaker_10': 'Facilities management contains five elements, five criteria and a potential of 18 points. Both teams achieve a full score in this area. Both teams have a first class facilities management firm. Both teams have well-defined and robust own operations and maintenance protocols with leading edge technology and building management systems that minimize energy consumption.'",
        "'speaker_10': 'Both teams have web based work order systems customized to levels of criticality, and both teams will employ sophisticated building maintenance systems that will monitor fire life safety, security, mechanical systems, parking services, escort services, utility monitoring, and all other major systems.'",
        "'speaker_10': 'The next category is the evaluation of private development. Private development category contains five elements, 14 criteria, and 43 possible points similar to the technical submittal. The urban form element where 30 of the 43 points reflects the greatest disparity between the teams submittals.'",
        "'speaker_10': 'Civic Corps is artist's rendering of their private development proposal reflects an inconsistent integration with the height and massing of the downtown, as previously stated. This is particularly evident in the massing of the residential development and the creation of a super block and the discontinuity of scale of the civic buildings and the hotel component.'",
        "'speaker_10': 'Plenary edge. More as artist's rendering of their proposal reflects a graduated integration with the height and massing of the downtown, both from the development's transition from Broadway to Ocean Boulevard and integrating a tower element along Ocean Boulevard frontage.'",
        "'speaker_10': 'Next category is financial models. The evaluation matrix for financial proposals related to the public elements of the project contain six elements, six criteria, three of which are pass fail and 50 possible points. The scoring was very close to a civic core.'",
        "'speaker_10': 'Three points ahead of plenary adds more. It is important to understand that the evaluation of civic course financial proposal is based on their inclusion of $112 million in revenues over 40 years that the city would have to pay to civic core derive from new property and transient occupancy tax.'",
        "'speaker_10': 'Plenary Edgware did not propose any tax sharing agreement. The committee conducted a sensitivity analysis to reflect the impact of the removal of this revenue source, which will be discussed in the next two slides. The subordinated debt, which is used as equity pledged by civic core, was 12.4% of project costs, while the plenary edge more was lower at'",
        "'speaker_10': '9.2% of project costs, both of which were below the recommended 15%. Civic core is proposed. Contingency funds for construction cost and capital expenditures were at 3%, while plenary edge more proposed higher contingencies at 5%. This results in plenary engineering providing a larger reserve to address unanticipated costs or change orders.'",
        "'speaker_10': 'Moving on to the stress test, a financial model stress test analyzes the flexibility of a financial plan to absorb market fluctuations and cost increases not anticipated nor built into the financial plan. A base case stress test what was conducted on the financial models as they were submitted in response to the RFP, which included tax sharing as proposed'",
        "'speaker_10': 'by civic law and reduced equity positions by both teams. This slide indicates that under the proposals as submitted, that both teams were similarly flexible, with plenary edge more able to absorb higher increases in project costs and civic for being more flexible from the standpoint of increasing interest rates and operating cost.'",
        "'speaker_10': 'As previously stated, the stress test assumes that the addition of revenues derived from new property taxes and transit occupancy taxes as submitted by civic core and reduced equity as proposed by both teams. So under this scenario, civic core was judged to have a superior financial model.'",
        "'speaker_10': 'But since both project teams submitted inconsistent elements in their submittals, including tax increment sharing and reduced equity levels, each project's team's proposals were adjusted to make them comparatively consistent, and the stress test was again conducted in the readjustment of the stress test.'",
        "'speaker_10': 'The tax increment sharing was removed. Both teams were inputted at a 15% subordinated debt.'",
        "'speaker_0': 'Levels.'",
        "'speaker_10': 'And in the adjusted case test plenary edge more as financial model appears to contain superior flexibility to withstand increased project costs, increased interest rates and increased operating cost. This flexibility reduces city risks, resulting in plenary edge more as financial model being superior to civic cause in the adjusted case.'",
        "'speaker_10': 'There has been some discussion that speaker's proposal offered to the city has a lower lease rate than the $12.6 million stated in the RFP. While the city's lease payment was indeed lower than the level stipulated in the RFP, when the payment of tax increment as proposed by civic law is added to the lease payment in every year'",
        "'speaker_10': 'of the 40 year term Civic Corps proposed. Total payment by the city was greater than the stipulated amount in the RFP and greater than plenary edge because. This slide compares the payments proposed by civic or in plenary edge more starting in year 2020, the first full year of occupancy and looking forward in five year increments when the'",
        "'speaker_10': 'lease payment and tech sharing payments are added, it can be seen that plenary edge more proposes a lower annual payment by the city than civic or. When looking at the city payments over the 40 year term as submitted by the project teams, city payments are $13.7 million higher under the plenary edge.'",
        "'speaker_10': 'More proposal. This is due to a greater investment by plenary edge more in both Linkin Park and the main library. The net present value of these payments are actually less under the plenary edge more proposal than Civic Cares proposal, and this is due to a final payment to the by the city to plenary edge more a year'",
        "'speaker_10': 'after the final payment by the city to civic core. When looking at total port payments over the 40 year term as submitted by the project teams, total payments are 201 million more under the plenary edge more proposal. The net present value of the difference is $51.6 million discounted at a 5.5% rate, which is the blended rate of'",
        "'speaker_10': 'the cost of funds for Civic. This difference is due primarily to plenary edge more as proposed underground parking for the port headquarters, greater amount of shared space, the inclusion of a civic plaza, higher grade exterior treatments and dual core building design.'",
        "'speaker_10': 'The Board of Harbor Commissioners have indicated their intent to revisit the building design, underground parking, financing and operations and maintenance after value engineering. It is expected that this difference will be dramatically reduced. The next category is financial proposal, private development.'",
        "'speaker_10': 'This category contains six elements and six criteria, with 38 possible points. Both teams achieve the same score in the port in alternative for this category. Civic Core proposes 764 residential units, 69,000 square feet of retail and 250 hotel rooms.'",
        "'speaker_10': 'Civic Core has received letters of interest from certain users, including a hotel, retail, grocer and fitness club. While this might appear positive, it is not clear that the market five years from now will support that level of development, and those letters of interest may no longer be valid.'",
        "'speaker_10': 'It is also important to recall that civic cause financial plan requires a defined level of private development in order to generate the incremental tax revenue needed to fund the project. If the market in five years cannot support the level of proposed development, civic course financial model may need to be revised.'",
        "'speaker_10': 'Alternatively, Plenary Edge More proposes a range of residential development between 594 and 792, depending upon the market at the time of development. Plenary more also proposes a more conservative retail component of 48,000 square feet and a hotel component of 200 rooms, while plenary edge more has not solicited letters of interest.'",
        "'speaker_10': 'Their proposal does not rely on incremental tax revenues to fund their project. Therefore, project development can be dictated by the market forces at the time that development comes to the market. The city's exposure to risk is reduced in plenary insurance proposal, and this brings us to the valuation results and the recommendation.'",
        "'speaker_10': 'So the various categories, elements and criteria are scored in this slide and in the port in alternative plenary edge more receive 232 points and civic were received 204. The committee unanimously selected plenary edge more to recommend the City Council as the preferred project team.'",
        "'speaker_10': 'Similarly, in the Port Out Alternative Plenary Edge More received 222 points, while civic core received 188 points. So in the port out alternative as well, the committee again unanimously selected plenary edge more to recommend the City Council as the preferred project team.'",
        "'speaker_10': 'So as a result of a stronger technical design, including citywide amenity, urban forum and programing, the Project Team Selection Committee unanimously unanimously selected plenary edge more to recommend to City Council as the project team that provided the best value to the city.'",
        "'speaker_10': 'The Committee recommends the City Council to select plenary edge more civic partners as the city's preferred project team. So if the City Council elects to proceed, the following are the anticipated next steps. There are a number of next steps that need to be quickly undertaken to maintain our aggressive schedule of occupancy in 2019.'",
        "'speaker_10': 'These include executing an E and A with a harbor department and the preferred project team, executing an MRU with the harbor department and executing or extending the contract and increasing the budget with North America Limited. Additionally, the city would need to enter a contract and establish a budget for legal counsel.'",
        "'speaker_10': 'Enter a contract and establish a budget for financial expertize for one or more special purpose entities to issue bonds. Pursue special legislation if it will benefit the project. Appropriate $4.6 million from the Civic Center Fund and pay the stipend to the non selected project team.'",
        "'speaker_10': 'I'll now spend a couple of minutes and go over each of these items. The Board of Harbor Commissioners, as a party to the INA, seeks to ensure that the Harbor Department retains the right to modify certain elements of their financial proposal, conduct value engineering on the building and consider alternative parking configurations.'",
        "'speaker_10': 'This will occur during the E and A period. Concurrently, a term sheet will be negotiated that details the terms and allocations of risk and brings the parties through the entitlement period. The Global Executory Agreement will control and implement the elements of the Dbf form and facilitate commercial and financial flows.'",
        "'speaker_10': 'The Global X Agreement will not be executed until such time as the project has been approved by the Planning Commission and City Council and has received clearance under California Environmental Quality Act. The city in the harbor department will also enter into an MCU that details the rights and obligations of the parties during the TNA period through financial'",
        "'speaker_10': 'close and ultimately up to the point of occupancy. It is expected that a separate MLC will be needed after occupancy to properly and appropriately allocate costs related to the shared use space. Our group has successfully supported the city through phase one and phase two of the project, which includes providing the following services support in preparing and issuing'",
        "'speaker_10': 'the RFP. Project management and coordination of meetings, clarification of technical information, financial modeling, market verification and construction delivery assumptions. Support and preparation in issuing the evaluation report. So for the next phase of the project, continuing support is needed to project, manage this complex project and maintain the schedule, provide technical support and expertize regarding financial, commercial, technical and'",
        "'speaker_10': 'risk allocation management. Refinement of the various documents needed for closing and continuation of community outreach, education and support through the entitlement period. Additionally, legal assistance and support will be needed to support the City Attorney's Office and preparation of legal documents, including the documents listed in this slide.'",
        "'speaker_10': 'Creating one or more special purpose entities for the purpose of issuing bonds and providing certain services relative to the bond documents. The financial consultant assistants will also be required to support the Department of Financial Management in ensuring that expectations of City Council, relative to the proper allocation of risk, the protection of city finances and the preservation of'",
        "'speaker_10': 'the city's cap on lease payments is achieved during this complex implementation period. There also may be an opportunity to pursue special legislation to eliminate the small risk of legal challenge, reducing this perceived risk but served to serve to reduce the bond interest rate, resulting in increased bond proceeds for the project, further strengthening the underlying financial model and'",
        "'speaker_10': 'offer additional flexibility to absorb market variations. If Council elects to proceed, the following actions are recommended. To proceed with the next steps of the project. Staff is recommending that City Council confirm staff's recommendation of plenary edge more as the preferred project team authorize the city manager to proceed with the actions detailed in the Council letter.'",
        "'speaker_10': 'Authorize the execution of an E and a Nemo, hue and term sheet, and all other documents needed to achieve clearance on the Environmental Quality Act and pursue entitlement of the project. Authorize the pursuit of special legislation if beneficial to the project.'",
        "'speaker_10': 'Form special purpose entities and appropriate the necessary funding. So in summary, I'd like City Council to consider the following in their deliberations. First, the teams appear to have approached the new Long Beach Civic Center project with different perspectives.'",
        "'speaker_10': 'Civic Core seems to have started by maximizing private development, fully developing the mid-block parcel with considerable density, sometimes at the expense of established design guidelines. The civic elements of the project seem to have taken a second priority. Plenary Edge more seems to have started with the civic elements, including the need for a civic plaza and a well-situated'",
        "'speaker_10': 'main library, and as a result, retained the Broadway garage and developed one third less of the mid-market mid-block parcel, even while developing one third less of the Mid-Block parcel plenary edge. More has committed to the same property value to the city as civic core for the private development.'",
        "'speaker_10': 'It's also important to consider that the scoring in the evaluation matrix is intended to reflect the project's team's responsiveness to the requirements of the RFP and to the committee's guidance and direction. During the all day one on one meetings, the weekly teleconference calls and the 18 addenda issued in this RFP when considering considering a project team rather'",
        "'speaker_10': 'than a project, the responsiveness of the team to staff's concerns is critical to project success. Considering plenary edge more as responsiveness to the requirements of the Civic Plaza, a main library whose dual front doors welcome all communities, a redeveloped and robust Lincoln Park, clear connectivity between the three blocks and balanced integration within the downtown traffic fabric from'",
        "'speaker_10': 'the standpoint of massing and scale. Plenary Edgware is clearly the project team that partnered with and best responded to the city. Lastly, this development model is not intended to be based on low bid that is inconsistent with a db4 m delivery model.'",
        "'speaker_10': 'Instead, this model seeks the best value for the city, considering the best value. I respectfully suggest that City Council reflect on the project team that provided the best amenities and highest quality for the city, its residents and visitors consistent with the city's affordability cap.'",
        "'speaker_10': 'Considering the best partner to consider which project team best fulfilled and achieve the City Council's guidelines and goals, best responded to the committee's suggestions and recommendations and offers the best opportunity to collaborate and cooperate over a 40 year timeline.'",
        "'speaker_10': 'And with that, I conclude my presentation Amy Warwick, John GROSS, Glenda Williams, myself Rich Anthony or Ryan Fulton and Sean Gohmert from the Port are available to answer your questions.'",
        "'speaker_4': 'Thank you. We're going to go ahead and do our have the the responses from our teams here in just a minute. Also, want to review and cheer for the council. A quick review. The what has been the public outreach process for the project and what will happen moving forward?'",
        "'speaker_4': 'So I think the council knows that we've had three full study sessions all scheduled throughout the city to discuss the project on a variety of levels. We've also hosted two open houses for the community to meet the project teams, as well as a handful of community meetings that were requested that staff went and presented to also the'",
        "'speaker_4': 'same amount of study sessions or meetings happened on the port side so that the port would also engage. I think that we're aware the port held a meeting yesterday and and took a vote on the project as well.'",
        "'speaker_4': 'And most importantly, I think, is what happens after the council makes a decision on whether to move forward with the staff recommendation. And that is that regardless of of the selection, a extensive community process would then begin. That would take anywhere from six months to nine months to a year, depending on on the need to get input'",
        "'speaker_4': 'from the community on everything from design elements to connectivity to the downtown to use to looking at ways of making this and ensuring that this is a a civic center for the whole city. In addition to that, those meetings would happen in all nine districts and throughout throughout the city as needed.'",
        "'speaker_4': 'So that's all will also be in the works. Obviously, regardless of the outcome staff's made their presentation. I will now give Civic Core 10 minutes to make a their presentation. And Madam Clerk, soon as they begin, we'll just set the ten minute mark.'",
        "'speaker_4': 'We're not going to set the 10 minutes. So you're ready to go. Okay. Let me know when you're ready.'",
        "'speaker_3': 'Just check that that's working.'",
        "'speaker_0': 'We're ready.'",
        "'speaker_4': 'Okay. Set the timer. Please begin.'",
        "'speaker_11': 'Thank you, Mr. Mayor. Members of the Council for this opportunity to present to you today. And thank you staff for all your. And thank you to the staff for all your hard work in bringing the project this far.'",
        "'speaker_11': 'What I'd like to do here today is very simple. I'd like to describe for you why we feel strongly that Long Beach Civic Alliance is the best choice for Long Beach. We bring together the largest TBP developers in the world, along with local partners with have true mixed use development experience right here in Southern California, including over'",
        "'speaker_11': '5000 square feet of private development in the LAX to Long Beach market. Our proposal generates approximately 250 million in savings compared to the competing proposal over the term of the agreement. We think that's a very substantial amount of money that can't be ignored.'",
        "'speaker_11': 'It's the only plan that fully resolves the seismic concerns, which were the primary reason for doing this project in the first place. And I'd like to finish by just making a couple of comments on the design. Clearly, we just heard a detailed presentation from staff on that.'",
        "'speaker_11': 'I think needless to say, we don't agree with a number of elements of their review of our design. Just to pick one example, the description of the path of travel from the Magnolia Garage into the two civic buildings was not described accurately.'",
        "'speaker_11': 'In addition, there are a number of other areas there that I think deserve further discussion. But I'm not going to go into those today. We have a limited 10 minutes, and what I'd like to spend our time on is to talk about a number of other areas that we believe deserve more consideration and are key differentiators between'",
        "'speaker_11': 'the two teams. We've framed this around five significant questions that we think should be asked and answered before a decision is made. First, coming back to the money, why spend the additional $247 million on a project when it's not necessary?'",
        "'speaker_11': 'Let's think about what else that money could go towards. Second, why was the team experience not considered or scored as part of the RFP process? Third, seismic concerns, and I'm referring here specifically to the Broadway garage and the fact that it remains and is not seismically upgraded.'",
        "'speaker_11': 'In the competing teams proposal. Fourth, I want to come back to the $12.6 million, which has been the starting point throughout this whole process. And just point out that within the staff report in recommending the competing proposal, they note that financing issues remain to be resolved and possibly could result in any increase in the affordability limit.'",
        "'speaker_11': 'This relates directly to the fifth, which is another point that I believe is critically important and needs further consideration, and that is how the staff can recommend selection of a materially nonresponsive proposal. The city's own report concluded that the PCP financial proposal does not meet the RFP requirements.'",
        "'speaker_11': 'To touch on that just a little bit further, the staff report and it provided the page reference here states that the PCP without port financial proposal does not meet the RFP requirements and could be considered non-responsive. The staff report goes on to describe that they have the latitude to determine that responsiveness and waive it.'",
        "'speaker_11': 'However, it's important to understand that under California law, a public entity may only allow deviations from the requirements of the RFP if they are inconsequential or immaterial. We don't believe that applies to the financial plan. We believe this is a critically important issue that needs to be investigated in more detail.'",
        "'speaker_11': 'And I've asked the city to explain the basis on which they waived this failure to meet the RFP requirements. Next. I want to come to some of the numbers. The first point that I want to make here on the slide in the prior presentation, there was a description of the numbers that included a reference to the tax'",
        "'speaker_11': 'revenue sharing that was presented as an alternative in our proposal. I'd like to point out that the numbers used here on this page do not do not include that tax revenue sharing. The 12.1 million that we're showing is an amount that does not include that, and it is substantially below the 12.6 million in the competing proposal.'",
        "'speaker_11': 'And even more importantly, the port annual payment comes in at about $4 million lower. That's a significantly lower total cost for the project, totaling 247 million over the term of the project. I'd like to go into a little more detail on what that cost difference means.'",
        "'speaker_11': 'According to the Press Telegram recently, a city budget crisis may be looming. In particular, there's not enough revenue to fund tidelands capital projects with some of the oil price declines. This is not the time to be spending more than is necessary on a civic center and port headquarters.'",
        "'speaker_11': 'Some of the things that that additional $4 million per year could go towards funding lifeguards, firefighters and police in the tidelands parks and beaches, the Belmont Plaza Pool. The last point I'd like to make on the financing, I talked a lot about cost.'",
        "'speaker_11': 'That's one element of it. Another element of it is risk. The our proposal, as compared to our competitors, we invest more of our own money and rely less on external debt. We believe that balance sheet and equity investment is critically important and reduces risk to the city.'",
        "'speaker_11': 'With that, I'd like to hand over to my colleague, Bob Darnovsky.'",
        "'speaker_0': 'Thanks, Elliot. Good evening, Mr. Mayor. Members of council. My name is Bob Darnovsky.'",
        "'speaker_12': 'I've been a resident of the city of Long Beach for over 30 years, and I live in the third district.'",
        "'speaker_0': 'For those who perhaps aren't.'",
        "'speaker_12': 'Familiar with all the members of our team, I'd just.'",
        "'speaker_0': 'Like to quickly brief them. Macquarie and Lindley.'",
        "'speaker_12': 'Simply put, the largest three development team in the world, Continental Development Corporation, has.'",
        "'speaker_0': 'Developed over 5 million square feet of U.S. private.'",
        "'speaker_12': 'Development in the LAX to Long Beach market.'",
        "'speaker_0': 'Our partner, Holland Partners, has 3.6 million square feet of.'",
        "'speaker_12': 'Residential development in Southern California.'",
        "'speaker_0': 'And in downtown L.A. alone, they have delivered and have in the market pipeline.'",
        "'speaker_12': '2500 residential units.'",
        "'speaker_0': 'ABM, they are the only OEM operator that does not outsource core functions. They will employ hundreds of Long Beach citizens, and they are the only OEM.'",
        "'speaker_12': 'Operator that can.'",
        "'speaker_0': 'Commit to a long.'",
        "'speaker_12': 'Term facilities management business.'",
        "'speaker_0': 'PCL. Simply North America's most prolific.'",
        "'speaker_12': 'Design build contractor.'",
        "'speaker_0': 'And Fentress architects and Civitas are planners have over 100 million square feet of public projects worth over $30 billion. Due to our outreach with will be okay you know the quality of the hotel residential and retail development that will comprise the private sector piece of the civic center.'",
        "'speaker_0': 'It's not. Don't worry. We'll figure it out later. Why would the City of Long Beach hand over the most complicated, mixed use P3 project developed in the United States to a team with limited mixed use development experience and none in the state of California?'",
        "'speaker_0': 'If the city is serious about 12.6 million. Unfortunately, then private development needs to work. Otherwise.'",
        "'speaker_12': 'None of us will have a new civic center.'",
        "'speaker_0': 'How did both teams receive the same score on private development when by their own admission? Our competitors tower that you saw shining on the horizon at 35 storeys isn't financially feasible in the marketplace. Before you select a team that made a proposal to the city of Long Beach that was $247 million more expensive to the city than'",
        "'speaker_0': 'to the LBC proposal. Before you select the team whose proposal leaves the Broadway garage untouched without bringing the garage up to current seismic standards. When the genesis of the entire project was the seismic instability of City Hall. Before you select a team that ignored the stated needs and security concerns of the Port of Long Beach and places'",
        "'speaker_0': 'subterranean parking under the entire port office building. Before you select a team whose library, contrary to staff reporting, is actually 2000 square feet smaller than the ABC Library when the actual library usable square footage is measured. And before you select the team that didn't have the foresight and creativity to come up with the Innovation Village and doesn't'",
        "'speaker_0': 'have $8 million, it's in it and its private sector development budget to fund it. Members of council, we ask you to pause and reflect. As a 30 year resident of the city. Please don't relinquish the decision making authority entrusted to you by your constituents on the most significant city project in decades.'",
        "'speaker_0': 'Ask the tough questions. Demand forthright answers. And then let us come together next month as a community, continue our journey forward and bring to fruition a new civic center that will benefit all Long Beach residents. Thank you for your consideration.'",
        "'speaker_0': 'Our team members are available to answer any questions you may wish to ask of us.'",
        "'speaker_4': 'Thank you. Thank you very much. Now we're going to be moving on to our next team, which is plenary age more. Who will also first set up. And they will. We won't start the time until they're ready to go like we did for the last one.'",
        "'speaker_4': 'So you just let me know when you're all ready and set up.'",
        "'speaker_3': 'In the first. Try this.'",
        "'speaker_0': 'Mr. Mayor, I believe we're waiting for the.'",
        "'speaker_4': 'They're switchgear in the back. So just just give them a minute and they'll. They'll get to it.'",
        "'speaker_0': 'Is that right? Right. Okay, great.'",
        "'speaker_4': 'Madam Kirk, do you have the time ready to go? Okay. Begin when you're ready. Please go ahead.'",
        "'speaker_0': 'Thank you, Mr. Mayor. Members of the Council for the record on Dale Bonner, the executive chairman of Plenary Concessions, and on behalf of Plenary Edge more civic partners, we wanted to thank you for the opportunity to be back with you this evening to talk about the Civic Center Project.'",
        "'speaker_0': 'As you've heard, we've been engaged in a very thorough and robust procurement process, and we want to offer very appreciative of the staff's recommendation that we proceed as your partners. All along the way, we have kept in mind that this is really about the people of Long Beach and making sure that they realize the.'",
        "'speaker_11': 'Social and economic benefits of a fully revitalized civic center.'",
        "'speaker_0': 'And so you can rest assured that if we are selected to be your partners, that will be fully committed to making sure that all of the people of Long Beach are included in the process. And what we wanted to do with the brief time that we have available this evening is to showcase some of the world class'",
        "'speaker_0': 'experience that we want to bring to Long Beach and explain why we believe our vision best reflects the vision of the city and the people. Thank you, Dale. Mr. Mayor, members of the city council. Good evening. My name is Paul Dana.'",
        "'speaker_0': 'I'm design director with Skidmore, Owings and Merrill. I'm also the design leader for the plenary edge more team. Just as our process began with people. So did our design. With the goal of creating a great place for the citizens of Long Beach.'",
        "'speaker_0': 'The employees of the city and port and visitors. We created a great new civic plaza for people to participate in the democratic process, to celebrate and to improve the daily lives of those working in or doing business at the port headquarters or city hall.'",
        "'speaker_0': 'We also created efficient, collaborative, healthy and secure work environments and sustainable LEED platinum buildings. Visitors, workers and residents are all invited to the retail Paseo, where we've created opportunities for local entrepreneurs and artisans and a tree lined pedestrian scaled environment.'",
        "'speaker_0': 'We'll program these retail spaces based on community input and would welcome the inclusion of educational components. We'll also bring new life through new residents and hotel guests. All in support. Safe. 24 seven atmosphere. For the new Lincoln Park, our design team created a series of landscape rooms with playgrounds, dog parks and places to simply sit and enjoy'",
        "'speaker_0': 'Long Beach. For locals and visitors. There will be an art and history walk to display the story and culture of Long Beach and flexible event spaces to accommodate hundreds or thousands of people. For people who want to learn, we've designed a sustainable new main library with improved access technology and an expanded makerspace so that we can look'",
        "'speaker_0': 'forward to a day when an idea or a company is born in the Long Beach, Maine, library instead of a Harvard dorm room. City Council.'",
        "'speaker_11': 'Members. My name is Geoff Fullerton. I'm a director with Exmoor Infrastructure and Real Estate, and I'd like to talk a little bit about our experience. As you.'",
        "'speaker_0': 'Said, this project is.'",
        "'speaker_11': 'As much about picking the team as it is about picking the project, and our experience and our team are stellar. We've developed over 83, our 33 mixed use project, 33 projects around the country, including a mixed use project.'",
        "'speaker_11': 'And we've developed over 35,000 residential units, including this Pacific Beacon project here in San Diego, which is a mixed use project in California. We are resum of our design team includes some amazing spaces, including the Millennium Park in Chicago and the draw on that experience to create a regional park draw here in Long Beach.'",
        "'speaker_11': 'And as a builder, we've built some of the most transformative spaces in California. These urban developments include L.A. Live, the capital area, East End, Petco Park and San Diego. So we certainly have experience in California from a development, from a building and from an ownership and management standpoint.'",
        "'speaker_11': 'We currently own and operate over 11 million residential units around the country, over 5 million square feet of office, industrial and retail projects. And we own four hotels and are building three more for our own account today. And with that.'",
        "'speaker_11': 'But I could go on and on and on about my in our experience. But I have a video here that we have from a few people who've worked with us before, and I'd like you to listen to what some of them had to say about their experience in working with our team.'",
        "'speaker_0': 'There's just a million decisions to be made. This was essentially the first.'",
        "'speaker_11': 'Major public private partnership that the U.S. system was.'",
        "'speaker_0': 'Taking off. We never really had a discussion that started out with, Well, I'm sorry, Clifford, we can't afford that. It was always, what do we need to do and how can we get there?'",
        "'speaker_1': 'They came up with ideas and solutions to things we didn't ask them for because they thought it was the right thing to do.'",
        "'speaker_0': 'Trustworthy group. Great group to work with. Collaborative, which is obviously a big.'",
        "'speaker_11': 'Part of a public private partnership. The overall experience.'",
        "'speaker_0': 'With Ashmore Clarke was incredibly positive. This is my fourth project.'",
        "'speaker_3': 'Prove it over the last 20.'",
        "'speaker_0': 'Years is that they always deliver the project and they always deliver the project in the manner they say they're going to deliver. I would recommend Clarke and Ashmore to my colleagues in and out of state government for this project.'",
        "'speaker_0': 'It's marked by calmness, creativity and cooperation, and I've been on a lot of construction projects in my career and this is the highest level of that.'",
        "'speaker_1': 'I think they're a fabulous team and whoever hires them and works with them will be very pleased.'",
        "'speaker_0': 'Thank you. And, you know, this project is also about creating jobs. And our proposal.'",
        "'speaker_11': 'Creates 3700 jobs, particularly in the districts that need it the most. And I want to tell you two tangible ways we're going to do that. We're committed to it. We're committed to an aggressive local hiring goal in our proposal, and we're committed to an aggressive minority and disadvantaged business outreach program.'",
        "'speaker_0': 'And we have another video to talk a little bit about that program.'",
        "'speaker_11': 'We typically exceed these goals, and I'd like you to hear from some of the people who've been a participant in that program.'",
        "'speaker_1': 'Rebecca Enterprises has been in business since 2006. We're small, but we've been recognized in the community and were very excited when we were chosen to participate in the Strategic Partnering Program. But since the class would have been larger jobs, both federal and local jobs, and we've built our confidence, our bonding has increased, our revenue has doubled, and'",
        "'speaker_1': 'we partnered with Glock on the Highland Park Project. And CLOC is actually sincere about helping smaller businesses. And the perfect examples this program, because you're spending a lot of resources in energy and helping and training smaller businesses and also their participation in the local community.'",
        "'speaker_1': 'We have residential areas on to other surrounding size. And then the fourth side is an elementary school of Chavez Elementary, and we really decided to plug in and support that elementary school the entire time that we were on this project.'",
        "'speaker_1': 'We would go to the school every week and mentor the kids and make sure that we had a consistent presence so that they knew that we were there and reliable and what an impact it was on not only us as the staff, but the kids and the principal as well.'",
        "'speaker_1': 'It was a great experience and I will miss them immensely. So I hope I get to have another project here in Long Beach so I can come back and serve at Chavez again.'",
        "'speaker_0': 'My name's Stewart Marks. I'm a senior vice president at Plenary Group and the project director representing the Plenary Age Milosevic Partners team. First of all, I want to say that we do respect our colleagues at Long Beach Civic Alliance.'",
        "'speaker_0': 'I can't speak to their proposal. I can understand why they would be disappointed, given all of the work and effort that's been put into the process so far. We understand the significance and importance of the project, and we also appreciate the responsibility that comes along with that.'",
        "'speaker_0': 'It's why from the outset we listened to the city staff and focused on the civic and public elements of this project, knowing that those were the core elements that we needed to get right and that the private development would flourish if we were able to deliver on those on those aspects.'",
        "'speaker_0': 'But it goes goes further than that. We understand that this is and we heard one of the council members bring this to our attention, that this is a once in a lifetime opportunity to give back to this to the people of of Long Beach through the creation of jobs for all people, for all the people in Long'",
        "'speaker_0': 'Beach, and most importantly, for the ones that need them the most. We've built that into our plan. And as we demonstrated in the in the presentation earlier, I also wanted to point out that from day one, we've wanted to incorporate a hotel into our development.'",
        "'speaker_0': 'We do believe that it's feasible today. At the same time, we understand that all.'",
        "'speaker_10': 'Private development.'",
        "'speaker_0': 'Particularly a hotel, is dependent on market conditions and we don't want to preempt what the market conditions will be and what that hotel might look like in the future. Greatly respect the process that's been conducted to date, and we're here to answer any of your questions.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. That concludes the project presentations. And I just want to remind both teams that when we do go to public comment, public comment is for members of the public. And the teams have had a chance to do their to do their comment through that process.'",
        "'speaker_4': 'Now, we're going to take this back to the city council. Four for comment in discussion. And I have some queued up here. I start off with Vice Mayor Lowenthal, and then after this, we will go to public comment.'",
        "'speaker_9': 'Thank you, Mr. Mayor. I wanted to go ahead and ask some follow up questions to staff. I'd like to thank the staff for the entire process, and and I'll have some remarks a little bit later. But I think it would be important to address questions right now, since both teams came before us to make their short presentation'",
        "'speaker_9': 'about the staff recommendation. So, Mr. City Manager, if I could just ask a couple of follow up questions based on some things that were said that were asked and said and certainly asked of our of our council team to consider.'",
        "'speaker_9': 'There's a considerable focus by civic board, the civic core team on on the finances and how the plenary team's proposal is more expensive. I know you have a slide and we have copies of that showing what the financial side by side is.'",
        "'speaker_9': 'But could you address that issue that was just raised in their ten minute challenge of staff recommendation on. The issue of the other proposal being more expensive.'",
        "'speaker_11': 'Vice Mayor and councilmembers. I'm going to turn these questions over to the evaluation team, whichever department head needs to respond to which question. So. Team.'",
        "'speaker_10': 'Vice Mayor Lowenthal, Members of City Council. Yes, I'd be happy to talk about the the $247 million that was raised in Civic Hours presentation. They actually did an estimate for that number. The actual number in the evaluation report is 215 million, but that's still a pretty large number.'",
        "'speaker_10': 'When you bring 215 million back to present value. Considering both the city hall and port payment schedule, it results in $40 million in present value at 5.5% discount rate, which is the appropriate London rate for Civic Corp.. That $40 million is the ports portion of that large number, $250 million that, as I indicated before in the slides'",
        "'speaker_10': ', particularly on slide 53, that is the elements of the port development that were separate or different from civic core, including the underground parking, the proportionate share of the civic plaza, the higher quality of building, and the dual core building design as well as discussed before the port of looking at alternatives and value engineering.'",
        "'speaker_10': 'That $40 million present value number will likely reduce significantly. The other element of that $215 million is the city portion. That's about $3.75 million in present value dollars. I'm sorry, that's not a present value dollar. That's a over the 40 year term, that 13.7 million is essentially reflected in the more robust development of Lincoln Park, the additional'",
        "'speaker_10': 'investment of about $5 Million into the main library. And with that additional investment by plenary edge more. Our $12.6 million cap has not been breached. The focus of the RFP was to provide $12.6 million income stream to each project team and to provide us with the best value given that income stream.'",
        "'speaker_10': 'And so I continue and the committee continues to support planetary edge more as providing the best value with that specific income stream. Does that help respond to your question?'",
        "'speaker_9': 'That does help respond to the question. And so when we look at the present value of the $215 million cited, the 40 million being the ports portion, is there any any concern or consideration that that is not an adequate transfer of expenses?'",
        "'speaker_10': 'Well, Vice Mayor, we have both teams presented to alternative strategies and how best to allocate the costs. One was by square footage, another one was by employee, with some shared costs at equal 5050 allocation. We don't know yet if that's proper.'",
        "'speaker_10': 'I think we'll have to spend some time in it reviewing the design and the construction cost estimates and sit down with port staff and determine the appropriate allocations so that we can protect both General Fund and the Tidelands Fund from further scrutiny.'",
        "'speaker_9': 'And is it true under your estimation that that would be a flexible aspect of the project design and proposal where we could protect ourselves as well as the harbor department from any of that challenge?'",
        "'speaker_10': 'That's absolutely the intent of this process.'",
        "'speaker_9': 'Thank you. The next question I have is the contention that there are still safety concerns, seismic safety concerns with Flannery's project. Could you address that, please, as it relates to the Broadway garage?'",
        "'speaker_10': 'I'd be happy to do that. Vice Mayor. There's been no seismic study conducted on either the Broadway or Lincoln Garage, so there is no clear evidence that either structure is seismically deficient. I think it is safe to say that the building was built at an older and aged building code.'",
        "'speaker_10': 'So I expect that there could be building code upgrades that would benefit the parking structure. But at this point in time, there is no evidence to indicate that there are seismic issues with either of those structures.'",
        "'speaker_9': 'Okay. And in both proposals treated at the Broadway garage differently, is that correct?'",
        "'speaker_10': 'That's correct. So culinary edge more is retaining the garage a civic core is demolishing the garage. Okay.'",
        "'speaker_9': 'And it's your statement that we do not have any evidence to seismic concerns at this time regarding Broadway Garage.'",
        "'speaker_10': 'I can say that the city would be no worse off in the position if the Broadway garage remains in city ownership.'",
        "'speaker_9': 'Absolutely. I appreciate that. I think the next question you had already addressed in terms of the $12.6 million city commitment, you had indicated in your earlier statement that that the plenary proposal does not breach that $12.6 million threshold.'",
        "'speaker_9': 'Is that correct?'",
        "'speaker_10': 'That's correct. Plenary more matched the the cap every year of the 40 years. And if I could spend a couple of minutes on slide 51.'",
        "'speaker_9': 'Please.'",
        "'speaker_10': 'What's up there? Mr. Jamison indicated that one of the alternate proposals included the tax sharing arrangement, though in his in civic cause submittal to the city. And in the clarifying questions that were presented to Civic here, they stated pretty directly that our original proposal, which included the sharing of incremental tax revenue, remains our proposed response to the'",
        "'speaker_10': 'RFP. So as a result of that, we did spend a lot of time evaluating their submittal with that element as part of their financial model. Nonetheless, we did look at the stress care stress case analysis and on slide 51, you'll see that this is the adjusted stress test that was conducted, that stress test eliminated or pulled out'",
        "'speaker_10': 'the tax increment sharing out of civic cause proposal and also brought both teams up to a 15% subordinated debt level. And so when you take out and and both teams were maximized as far as the annual city payments so both teams were civic was pushed up to 12.6 plenary edge more remained at 12.6.'",
        "'speaker_10': 'So we increased Civic Core's revenue stream. When we eliminated the tax increment sharing. And as a result of that adjusted case, you can see that the civic core financial proposal in this stress test under project cost interest rates and operating cost is less flexible than plenaries financial model.'",
        "'speaker_10': 'And we quickly did a stress test today and in another adjusted case, we limited civic cause payment to 12.1 million instead of 12.6. And we looked at just project cost as that's the amount of time we had. And Project Civic is ability to withstand adjustments in project costs reduced from 4.4% to 2.7%.'",
        "'speaker_10': 'We expect that reduction would also be reflected in interest rates and operating costs. So I think in best case scenario, without a tax increment sharing perspective and providing civic core with the maximum amount of revenue from the city, their financial model is still less robust than plenary assurance.'",
        "'speaker_9': 'Does that address the indication they made that plenary hedge? Moore's proposal does not show the tax revenue sharing aspect.'",
        "'speaker_10': 'Vice Mayor Plenary Edge Moore did not propose any tax sharing.'",
        "'speaker_9': 'That was my understanding as well. If I thank you for that explanation of Slide 51, if I could go back to another aspect of affordability, there was a statement that several aspects of plenary age, Moore's proposal was not financeable.'",
        "'speaker_9': 'What are your thoughts on that?'",
        "'speaker_10': 'Vice Mayor I think the private development of plenary edge more as is focused more on the future uses. Five years from now what what I believe they're seeking to do which I think is a strategic move on their part, is to develop the civic center and create an interest to create a a place in downtown.'",
        "'speaker_10': 'And as a result, that will increase demand and increase interest in developing in the downtown. And I think at that time, they'd more appropriately seek their partners for development. It it's correct that plenary would seek partners to develop their mixed use residential and hotel.'",
        "'speaker_10': 'And that partner is relatively open and could even include current members of Civic as team. So it is a, an opportunity in the future and I think that future opportunity will be more viable than today's opportunity.'",
        "'speaker_9': 'Okay. During the challenge, there was a statement that without the port's financial proposal, plenary does not meet the RFP requirements given the given the unanimous vote that the Harbor Commission took yesterday. Would that not make that a moot point?'",
        "'speaker_10': 'I think perhaps I'll turn that over to Mr. Anthony.'",
        "'speaker_12': 'And vice mayor and mayor and members of the Council. I think that's right, but that's not exactly what civic course contention is generally, they contend. You may have received the letter earlier today in my response memo, both of which will be part of the record tomorrow morning, that that plenary should have been disqualified prior to any action'",
        "'speaker_12': 'taken by the Board of Harbor Commissioners. I agree that the point is moot. But with respect to speakers contention, I respectfully disagree with their analysis of the law, and I don't think that the city staff has acted improperly in going ahead and scoring the plenary proposal and in fact, recommending it to you tonight.'",
        "'speaker_12': 'I think everything has been above board in accordance with the law, and no one has acted improperly. That's the opinion of our office.'",
        "'speaker_9': 'And I know you sent that letter out by email. Do both proposers have a copy of that?'",
        "'speaker_12': 'No, they do not, but they will. It will be part of the public record, both civil calls, challenge letter and my response. Memo to you.'",
        "'speaker_9': 'Okay. Thank you, Mr. Anthony. If I could go on, Mr. Conway, with regard to the challengers I'm sorry, Civic Corps statement about the true cost to the city. I think that's always compelling, especially those of us that were part of this city government and policymaking body during our worst years.'",
        "'speaker_9': 'And there's a there's a statement that it's $4 million less per year that their proposal would actually result in. And I know you address some of that by going over previous slides, but if you could just reiterate the salient points, that would give confidence that this would not be a greater cost to the city.'",
        "'speaker_10': 'Vice Mayor. Yes. To respond to that. The $4 million is primarily a port expense, and that, again, is a result of not having restrictions, a financial cap for the port. So plenary actually, both teams approached the port alternative from the standpoint of their revised needs assessment and proposed and conceptualized buildings that were of higher quality than City'",
        "'speaker_10': 'Hall. Additionally, plenary edge more has a subterranean garage or parking area which significantly increased costs about $26 million. So with value engineering moving forward during the year and a process that for $1,000,000 could be dramatically reduced.'",
        "'speaker_9': 'Okay. Thank you. And in terms of questions, that's all I have at this time. But I would just like to make a few remarks regarding the process, the effort, and really just my my personal delight. I have no better word for us to even be in this position to make a decision such as this.'",
        "'speaker_9': 'This is certainly a very difficult decision. I look at many staff members that have been a part of this process for the last probably eight years. I kept referring to it as seven years. But Mr. Conway reminded me that we started this in 2006 with a proposal for civic center re-envisioning that I was a part of when'",
        "'speaker_9': 'I first came on this council. And we are here today because of the. Tremendous due diligence that staff members have provided. Amy Bodak, the city manager, former assistant city manager, head of Planning and Building, Mr. Craig back during his time with redevelopment.'",
        "'speaker_9': 'And certainly Mr. Conway and everyone else that's been working on this and several council members and former council members and this really is a moment of privilege for someone like me to be a part of this truly once in a lifetime decision.'",
        "'speaker_9': 'I don't think it's even once in a generation. This is something that will impact many generations going forward, especially a project built right, done right. And I have from the beginning indicated that my greatest hope and aspiration for civic center is that it would be designed for the people that will use it.'",
        "'speaker_9': 'We can have iconic buildings and structures throughout the world, and there there is much talent that can deliver that for us, but truly a space that speaks to the human interaction and the human scale. First is something that I believe addresses the vision of of our council and really our city.'",
        "'speaker_9': 'And so when I when I think of that and I look at both proposals, they are both magnificent proposals. Truthfully, if you look at them both both teams are qualified. But when we look at the proposal for a civic center, that would have the greatest potential to achieve human scale and the human scale, purpose and goals, I'",
        "'speaker_9': 'do think that the staff's recommendation for the plenary team is one that delivers that I've mentioned before. At one time, civic institutions and the spaces around them were some of the most vital places in the city. That really is our aspiration and hope and ambition for this project that it will be returned to the people.'",
        "'speaker_9': 'I look at what Los Angeles City Hall has done in its civic center, and what it's done is it's reclaimed the space for the public, and we have an opportunity to do that here. There are many questions that have been raised with regard to proposal specifics.'",
        "'speaker_9': 'But when I look at the volume of of documentation and due diligence that the staff has put together with its team, I'm confident that they have made the right recommendation with financing, with design, with team composition, with experience, all of which I believe will definitely deliver a civic center and a public space.'",
        "'speaker_9': 'The true public living room that we look for that this city has set out as its goals. We have many goals that have been identified at what what this proposal should do, what this project should do. But woven through each of those is this commonality that it needs to be returned to the public for the public use'",
        "'speaker_9': '. When you look at how you approach civic centers, not just in the United States or in California, but really anywhere, is it inviting? Is it a majestic invitation for the single human being to feel significant? And the answer has to be yes.'",
        "'speaker_9': 'It has to be majestic for that individual. And that is what I think we have an opportunity to do. And I am very, very pleased that we are at this position. I know council members, this is the largest decision that we will make.'",
        "'speaker_9': 'I put my 100% confidence behind the staff recommendation. I submit to you that I have personally worked on this for eight years, increment by increment, starting with the downtown visioning plan, with the Civic Center Visioning Plan, with the downtown plan, updating our planning and building codes with the mobility element, the bicycle master plan, the adaptive reuse ordinance'",
        "'speaker_9': 'that had to be done in order for us to be able to do other aspects of it. When we look at the size, height and massing of this project, it would not have been possible if none of those installments had not taken place, to which I give the stakeholders and the community and city staff a great deal'",
        "'speaker_9': 'of credit. We can all have great ideas, but none of this matters unless we have a team of experts that come together and pull it off. And they pulled it off installment by installment. This is a long narrative in our history, one which over the last eight years we have delivered chapter by chapter and I, in a'",
        "'speaker_9': 'heartfelt way, applaud everyone that's been involved. I see many members of the downtown visioning team that's been here. Steve Goodling, Larry Jackson, Caramel. Yeah, I know there are others in the audience. This is something that you help deliver.'",
        "'speaker_9': 'Whichever team is selected, your vision will be realized. But I asked my colleagues today to start to support the staff recommendation as I make the motion to all of those motions.'",
        "'speaker_1': 'How many motions here.'",
        "'speaker_9': 'Mr. Anthony, is it.'",
        "'speaker_1': 'One single motion?'",
        "'speaker_12': 'It's one single motion. And that's proper for you to make it one motion.'",
        "'speaker_9': 'Thank you. There are many pieces to it, but. I will make the motion to move the staff recommendation second.'",
        "'speaker_4': 'Okay. There's been a motion and a second to the staff recommendation. Councilmember Gonzalez.'",
        "'speaker_8': 'I also had a few questions as well first and then I'll say what I need to say. But there had been a $44 million in construction costs that the court had brought up. Additionally, can you discuss that a little bit, Mike, please.'",
        "'speaker_10': 'Councilmember Gonzales. The 44 million in construction costs, if I recollect correctly, is the combination of city hall and port construction costs that 44 million being a present value number. The City Hall variation between Civic Hall and plenary age more was about nine, eight or $9 million of that.'",
        "'speaker_10': 'So about 30 to $32 million is related to the port. And that again goes directly back to $26 million for underground parking. You know, a higher quality building with dual core layouts, participation in the construction of the Civic Plaza.'",
        "'speaker_10': 'So the majority of that is a port cost, which we expect to address during with value engineering during the DNA period. So we expect that cost to go down.'",
        "'speaker_8': 'Great. And then I know we've gone over this quite a few times, but just so it's very clear, what are the significant differences between both teams, the library in regards to the Civic Park acreage and then also the Port Building and City Hall Synergy, if any?'",
        "'speaker_10': 'Councilmember Gonzalez Right. The first part I think you're referencing the library. So plenary Edgware is proposing a 93,500 square foot library, about 91,000 square foot net. Square foot. Civic Core is proposing a 78,300 square foot library. I don't have to have my head know what what the net square feet is for that.'",
        "'speaker_10': 'But I know a statement was made that they have 2000 more programable space. I'm not sure how that would work with 20,000 additional net square feet in plenary more as proposal. But that's something that I think the Director of Library Services can certainly work to program the library whichever way is most appropriate for the community and the'",
        "'speaker_10': 'neighborhood. And then the second part of your question, I didn't completely hear.'",
        "'speaker_8': 'The port building and city hall and how those two would I mean, if there's any synergy between those two or not and probably different each.'",
        "'speaker_10': 'The the. So there is a number of elements of synergy. One of them is, of course, the shared space. So there's shared chambers. There's also shared, shared meeting rooms. In sum, in one scenario, there are shared parking. And of more importance, I think, to the city is the economies of scale for concurrent construction.'",
        "'speaker_10': 'So the port has indicated their interest in financing separately and perhaps doing operations and maintenance separately. That has a smaller impact on the financing. But the economies of scale relative to construction is where there's a lot of savings for the city and the port, and that's our primary interest in having the port as a partner from a'",
        "'speaker_10': 'financial perspective is the savings in economies of scale of construction.'",
        "'speaker_8': 'Okay. Thank you. And then lastly, I know plenary had discussed a little bit more in detail about a local job creation commitment. I don't know if there's anything that's been discussed. I mean, a little bit on the Civic side, but has there been anything additional for civic core in regards to local job?'",
        "'speaker_10': 'Anything additional? I think to go into some numbers, what's been submitted to us from civic core for construction jobs is 596 direct jobs, 628 indirect jobs, 2816 induced jobs. Similarly, on the plenary edge, moorside for construction 583 direct 694 indirect 650 for induced.'",
        "'speaker_10': 'And then over the term of the Project for Operational Jobs, Civic Corps has 477 direct 360 indirect 796 induced plenary edge more 726 direct 94 indirect and 127 induced. So relatively similar from a job generation standpoint. I know plenary added more in their statement today has indicated their interest and commitment to local hiring, which is a, I'",
        "'speaker_10': 'think a positive event for us. It's also required in the RFP to enter into a project labor agreement. Any hotel that's intended to be constructed, it needs to be a union hotel. So I think both teams are kind of on the same playing field in that regard as well.'",
        "'speaker_8': 'Great. Thank you. So I will just go on to say that, you know, tonight it's obviously very clear that we had to vote on a team rather than a project. And after observing each team's vision from the very beginning for Long Beach and understanding each team's foresight for our Dear City, I really personally observed basic components that'",
        "'speaker_8': 'truly. Represented the distinct uniqueness of our city of Long Beach. I saw that in Plenary Edge more from the very beginning, a presentation that was truly mindful of Long Beach with historic components that are very important not only to our city but to my district personally.'",
        "'speaker_8': 'Being the birthplace of Long Beach, I have folks here from Wilmore, but in addition to that, a presentation with uniform architecture and well-suited site planning that married the poor and our city hall together and looked beyond the bare minimum for our park space and programing, while also fitting clear and concise criteria for our city's financial boundaries, not'",
        "'speaker_8': 'adding any additional risks to us in the coming decades, while also talking robustly about a local jobs plan, which is certainly very important to the western parts of the city. And so it is my thought today that we move forward with this process now not to delay this impactful project, which can add costs potentially and further add'",
        "'speaker_8': 'complexity and perhaps add more of the same discussions, which we know now unfortunately are just not possible. So I strongly support staff's recommendation for plenary age, more civic partners, and I look forward to continuing community discussion regarding all of the important details to our City Hall.'",
        "'speaker_8': 'And I thank each team for their hard work and efforts. I think the city staff, as well as the Port of Long Beach and all of our community members, and I look forward to continuing discussions.'",
        "'speaker_9': 'Thank you, Councilmember Gonzalez. Councilmember Richardson.'",
        "'speaker_6': 'Thank you, Vice Mayor. So I want to begin by applauding both teams. I think both presentations would obviously give us a world class civic center. And from the first time we saw what you've come back with, both teams really demonstrated a commitment to jobs and working families, a commitment to diversity, a commitment to creativity.'",
        "'speaker_6': 'And a lot of work has gone into that. I want to thank staff because, I mean, this has been a great process so far from my perspective. And, you know, it's been a learning experience for me. And but more specifically, I just want to say that, you know, although there are a number of accounts of people that'",
        "'speaker_6': 'just came on board, including myself, there's you know, it's clear that this there has been a very robust process for a long, long time. So I want to acknowledge the council members sports, more specifically Vice Mayor Lowenthal and Vice Mayor and Councilmember Gonzales for ensuring that that input is there.'",
        "'speaker_6': 'I know that when projects come up in my district, I count them. You know, my colleagues count on me to be a local expert on how that impacts my local community. So I'm listening. I've intentionally held off on meeting with both teams.'",
        "'speaker_6': 'I met with both today and had a conversation with them. And, you know, I heard about the different concerns and high points. And so I've had been able to have some of those conversations. There are a number of questions I still have.'",
        "'speaker_6': 'I believe the major question was the $250 million or so disparity or claim that one is more expensive than the other. I spent the majority of the day doing my homework to see if if in fact, that's true and if that's a real number.'",
        "'speaker_6': 'I am I am comfortable with the response that I've gotten from city staff in terms of the majority of that is borne within the port portion. And so that brings me to the question on my first question, which is I understand that they've gone ahead and selected plenary edge more.'",
        "'speaker_6': 'And if this group were to for some reason select an alternative group. What what would that mean for us if we select one group and they will be the process at that point.'",
        "'speaker_10': 'Councilmember Richardson That might be a process question. I don't know if I can turn this over to Richard Anthony.'",
        "'speaker_12': 'You have.'",
        "'speaker_0': 'You're welcome.'",
        "'speaker_12': 'That's an interesting question. It's not one that we have thoroughly considered. I think the city could move forward with its selection without the port's participation, because I think what would happen is, is effectively that would be a port problem, not a city problem, because the land that is contemplated to be used for the port headquarters is city'",
        "'speaker_12': 'property. So the port, although it has selected a partner in that instance, it wouldn't really have anywhere to build its headquarters. So I think the city would be okay that the port would have some serious decisions to make.'",
        "'speaker_6': 'Okay. So if we made an alternative decision, then they would need to take some action to see if they're going to participate with us or not.'",
        "'speaker_12': 'I think that's.'",
        "'speaker_6': 'Right. So maybe they should have waited to see what we were going to do before they made a decision. But I have confidence that those harbor commissioners did do their due diligence and evaluate those claims at the cost will be significantly higher.'",
        "'speaker_6': 'So I don't think that that's I mean, my concerns have been answered there. But there was also a claim that the hotel tower, the 30 foot tower, as proposed by plenary, would have feasibility issues. So I want to I want to just ask about that.'",
        "'speaker_6': 'Are there undue was was was due process not conducted to determine the feasibility? Is one project more feasible than the other in terms of the hotel? And then if for some reason in five years, because they determined that at this point the market may not you know, may not prove to be able to support a hotel.'",
        "'speaker_6': 'Well, in five years, if we're not in the position where the market can support a hotel, what is our game plan? Does that mean we have to increase our monthly or monthly commitment? How would that work?'",
        "'speaker_10': 'Councilmember Richardson First, the hotel use is purely market driven, whether it's today or five years from now. I think has as has been mentioned earlier, I think if we create a place here to begin with by completing the civic center element and the main library and the robust Lincoln Park, we could create more of an interest for'",
        "'speaker_10': 'the hotel element downtown. But for each team, that element is subject to the demands created by the marketplace. So I don't think one team's hotel is any more feasible than the other as it relates to its impact on city payment.'",
        "'speaker_10': 'In the plenary more proposal. The private development has absolutely no influence on the $12.6 million, and in the civic core proposal as submitted, there was a tax sharing element which would of course rely upon totals for that hotel as part of their income stream.'",
        "'speaker_6': 'Great. So I would just say that I and I'm I'm satisfied with that response. We've said all along that we're going to evaluate the team and not the project. But I saw some good elements in both projects. And I know it's going to be difficult to, you know, marry two projects.'",
        "'speaker_6': 'But I really you know, I really thought that the Innovation Village was a great concept and it was in the the the team that wasn't wasn't recommended a proposal. And I know that there, you know, we've said this time and time again, we can select certain elements and integrate into the the project we finally move forward with'",
        "'speaker_6': '. But my question is, I know that there were specific dollars carved out for Innovation Village. I don't remember what the number was, you know, 5 to 8 million or something. How would we how would that work if we said, hey, we like we want to move forward with plenary, but we want to, you know, introduce we want'",
        "'speaker_6': 'to put innovative village innovation village in the grocery store. And how would that impact our payment or the project or his finances? How would that work? Giving $8 million of the private sector element was invested in the the innovation village.'",
        "'speaker_10': 'Councilmember Richardson Firstly, the private development from the plenary edge more perspective will not affect the $12.6 million cap. The proposed private development by plenary edge more in the committee's opinion is a little bit more conservative as reflected in the range of residential units, as opposed to a fixed 765 units.'",
        "'speaker_10': 'Also, plenary edge more proposes 49,000 square feet of retail versus 60,000. So we think that's also somewhat conservative and certainly. Provides more flexibility in providing alternative uses in the plenary edge more proposal. So we think that there is room available in that conservative private development model that can accommodate a innovation village.'",
        "'speaker_10': 'And certainly the funding wouldn't come from city, it would come from private sources, and so that would be the partnering that plenary edge more would do great.'",
        "'speaker_6': 'So I want to talk about the library. I know there were a number of size claims and as I understand it and let me know if I'm correct. But as I understand it, we you know, in this we this isn't the final iteration of the library, right?'",
        "'speaker_6': 'This is going to be we're going to this is sort of a top line concept of the library. And we'll be able to go back and determine what is actually programable space and what is not, and if necessary, readjust the floorplan or increase space in some in some regard.'",
        "'speaker_6': 'Am I right in that assumption?'",
        "'speaker_10': 'You are correct, Councilman. We're interested in this is conceptual at this point. There's been a lot of detail on the programing and interior layout of the library. But as has been mentioned, more than once, we have 6 to 9 months of public outreach, all of which will influence the final product.'",
        "'speaker_6': 'Okay. So I just want to wrap it up by saying that I you know, I think comparing apples to apples, the find it seems to me that there are some creative elements in, say, core that I, I really like.'",
        "'speaker_6': 'But it seems split plenary Ed's more was more responsive. And in terms of the financial the financial concerns, I'm satisfied with those. I think that either team would likely be able to carry it out. So I'm going to be supporting staff's recommendation.'",
        "'speaker_6': 'I do want to say that when I look at the courthouse across the street, I'm really impressed by I love that courthouse. I don't necessarily know that the Civic Center design in plenary age more really complements that or challenges that.'",
        "'speaker_6': 'So I would say that when we get to the next level, I would love to see I mean, should should this be advanced and I would love to see us really put some design have a design discussion about that.'",
        "'speaker_6': 'That's Civic Center. Thank you.'",
        "'speaker_4': 'Thank you. Councilmember Price.'",
        "'speaker_8': 'I actually am going to move the discussion a little bit in another direction just because I think there were some issues that had come up in the past that I want to talk with Mr. Conway about and kind of close the loop on.'",
        "'speaker_8': 'At one of our last study sessions, one of a third district resident had given you are given to me to give to you however way a thesis that had been done on the retrofit option. And one of the commitments that we receive from you was that you would review that thesis and determine whether or not there was'",
        "'speaker_8': 'any viability in terms of the retrofit option. Have you had a chance to do that? And if so, before we proceed with this vote, I'd like to know your thoughts on that.'",
        "'speaker_10': 'Councilmember Price I did read the thesis a very informed and thorough document. The two areas of particular interest that I was looking for was an engineering analysis and a cost estimate. I think it's been stated out there in a few areas that the estimated cost is $30 million in in the thesis.'",
        "'speaker_10': 'Actually, it's not clear in the in the thesis there is no direct statement as to where the $30 million came from. But in a subsequent email from the author, she stated that the $30 million was from a rule of thumb that she was familiar with at $100 a foot for office retrofitting.'",
        "'speaker_10': 'That detail is not sufficient for analysis. And in actually, I believe the other two levels of rule of thumb she had was up to $500 for a a facility that is intended to be a first responding facility. I think City Hall would follow that level of rule of thumb rather than the $100 a square foot.'",
        "'speaker_10': 'We would be closer to $500 a square foot if we wanted that level of retrofit. The other area was engineering. There was no reference to any engineering drawings. It was a conceptual approach to weaving a tubular structure into the the structural members of City Hall, thereby strengthening the exterior curtain walls and the interior structure of the columns'",
        "'speaker_10': 'and beams. But there is no detail with that as well. And so there was nothing to have reviewed other than concept statements. So while it was an interesting proposal, there is no way to verify whether or not the proposal would work in the real world and what the cost would be.'",
        "'speaker_8': 'Thank you. And in terms of the retrofit option, before we move on from it, is there any reasonable scenario under which the city could retrofit this building giving, given our existing financial status and reality.'",
        "'speaker_10': 'Councilmember Price a reasonable scenario? I. I. Yes, a reasonable scenario would be go to the residents for a tax measure that would fund the retrofit. I'm not sure if the residents would countenance that approach, but the struggle we have, even if we could find the funds to do that, is that the retrofitted City Hall would again be'",
        "'speaker_10': 'subject to a significant seismic event and may not be Occupy able, in which case city government essentially shuts down for a period of time until we can find more funds to lease buildings throughout the city because there isn't a building that can accommodate staff at this point.'",
        "'speaker_10': 'And currently City Hall is inefficient, functionally obsolete. Investing that level of funds and into the City Hall is probably not advisable. My last recollection was $194 million estimated in 20 $13 reflects about $600 a foot, far less than the cost of rebuilding the Civic Center.'",
        "'speaker_8': 'And you don't based on your expertize and vibe, you don't feel that the residents would want to pay a tax to build a retrofit. The City Hall.'",
        "'speaker_10': 'I my experience comes from measure I and that measure, though very popular for some, did not achieve the amount of votes necessary for a tax measure. So I relying upon that I think the the interest in the residents might be low.'",
        "'speaker_8': 'In terms of the two teams that are before us tonight, in terms of the vote that's before us tonight, I mean, I want to take a moment and thank both teams for the effort that you've put into this project.'",
        "'speaker_8': 'It's it's truly impressive. I was educated further on this project when I attended the Open House. I appreciate you taking the time. I did have the opportunity to meet with Civic Corps. I did not meet with plenary that that opportunity didn't arise.'",
        "'speaker_8': 'And I will say that there were a lot of points that were raised that were very good points. And I think that staff has addressed those points this evening. And just for clarification, I want to go back to the finances, because to me, that was the biggest concern moving into tonight's vote.'",
        "'speaker_8': 'And, you know, I was under the impression prior to tonight or prior to today that in fact, one proposal, the civic core proposal was a lower cost to the city or would result in a lower cost to the city.'",
        "'speaker_8': 'What I'm hearing you say is that that isn't necessarily true when you consider all the factors. Is that correct?'",
        "'speaker_10': 'Councilmember Price Yes, that's correct. And to expand on that just a little bit and not to get into excruciating detail, but in speaker's proposal, they have a single bond issue that they proposed that would fund City Hall and the port.'",
        "'speaker_10': 'And it's in that model that they're suggesting that they can bring the payment down to $12.1 million. We think that's an inferior model to plenary edge more. But still, if with the port financing they're building themselves, civic corps would have to relook at that model and and the bond issue as well.'",
        "'speaker_10': 'So my expectation is without the port as a partner to that bond issue, the interest rates could go up and then the city's payment will go up as well. So I don't think even the 12.1 is accurate at this point.'",
        "'speaker_8': 'I also want to ask you about that. There was some requests made earlier today that perhaps we delay this decision and think about it further, other than possibly additional lobbying efforts and things going on. Is there any substantive benefit in your mind of continuing this this decision?'",
        "'speaker_8': 'Is there any more work that you think the city could do to get more answers? Is there anything outstanding in your mind that you feel you would need to do to be able to address the questions that have been raised?'",
        "'speaker_10': 'Councilmember Price. I don't think there's any more due diligence that we can do. I think a piece of information that might be reflective of our readiness to proceed is that our preferred recommended team has already executed the INA.'",
        "'speaker_10': 'The other team has not. So we are prepared to move forward tomorrow.'",
        "'speaker_8': 'And that is that would not be the case with both teams.'",
        "'speaker_10': 'That's correct.'",
        "'speaker_8': 'In regards to delaying the project or the idea that we would delay the decision tonight, what would be the negative or detrimental impact of that?'",
        "'speaker_10': 'I can't remember price. We're on a path at this point that's relatively rapid to protect life safety in this building and the residents that visited on a daily basis. And I think with that schedule in place, I think we've given some level of confidence to the employees and the visitors that we're going to be providing them a'",
        "'speaker_10': 'seismically safe facility at some time. Forestalling that process, I think, creates doubt and concern and may expose the city to litigation. That's we're not sure of that, but certainly it could be an option if this process slowed down.'",
        "'speaker_8': 'Would there be any foreseeable financial impacts of delaying any further?'",
        "'speaker_10': 'Councilmember Price One doesn't know the direction of interest rates other than they will likely go up. And I think the Federal Reserve has indicated their intent about mid-year next year to start bringing up interest rates. That would clearly have an effect on the bond proceeds that would be issued and reduce the potential funds available for the project'",
        "'speaker_8': '. I want to echo something that Councilman Richardson said regarding relying on the expertize to a large extent of our council colleagues who take the time to study the needs of their districts. And I want to thank Vice Mayor Lowenthal, Councilwoman Gonzalez and Mayor Garcia, because I know that they've been intimately involved in this project for many years'",
        "'speaker_8': ', far longer than the five plus months that the new council members have been on this body. And so I want to I want to thank them for the work that they've put into this project and into determining what the needs of their community is.'",
        "'speaker_8': 'This is a city wide asset, much like many of the projects we pass, we consider as a city council, including the Belmont Pool. But having just recently been through that experience, I know how taxing it is to get involved and get in the weeds on some of those projects and figure out what really works and what would'",
        "'speaker_8': 'be a positive addition to our district. So I want to thank them and and I've said this to the group I met with and to anyone who's asked. Their opinion carries a lot of weight with me. I respect their opinions and I know that they've gone into a lot of work and coming up with their recommendations.'",
        "'speaker_8': 'Thank you. I don't have any additional questions.'",
        "'speaker_4': 'Thank you. Councilmember Income.'",
        "'speaker_7': 'Thank you there. Obviously, there's still a lot of questions to be asked. I look forward to the comments from the public with that when it comes to that. But before I begin with my line of questioning, a lot of the questions that I've had, I'm just taking them off as people here.'",
        "'speaker_7': 'People are are asking questions that I had others a few things that I that I'd like to clarify. But both projects both had excellent projects and ideas. Both had the people in mind when they're talking about what they want to see in terms of a civic center, being welcoming, being a citizen friendly, resident friendly.'",
        "'speaker_7': 'Also the the educational component on it for our civic core was was a big plus with me having come from the community college into this body. And I know that also with the mayor, but in in that respect, there were also components in the in the other plan that I they could have done better as well.'",
        "'speaker_7': 'But the way it's been the way it's been described to me and the way I was informed about it and it's been brought up and we had we're looking at picking the best team that the best project. So I'm guessing it's a guess that there is going to be a possibility or an opportunity to incorporate both in'",
        "'speaker_7': 'one way or another with whichever project we pick, because I certainly hope so. Because from from the perspective that there is the one team to one project and that's it, it's set in stone. I don't really like I mean, I think that we have to be as flexible as we can.'",
        "'speaker_7': 'Especially if the plan is to go forward in a six to go with a 6 to 9 month vetting process, if you will, with the community in regards to getting their input. So I'm going to see somewhat of an evolution of the plan that's that's being presented or that will be adopted.'",
        "'speaker_7': 'One correction on the measure I a council member measure, I was a measure put forward to the people with a 66% threshold. If they had gone, I believe if they had gone to a Prop 39, which is a 55% threshold, it might have passed.'",
        "'speaker_7': 'The reason being that in that Prop 39 type of of measure, there is better opportunity for transparency. There is transparency in regards to creating a oversight committee that would review all the projects, all the plans and all the finances to it.'",
        "'speaker_7': 'That would be at a at a at a threshold where nothing could go forward without that committee's review and recommendation to go forward with that. So I think that if measure I had gone to a Prop 39, it might have had a better chance of success.'",
        "'speaker_7': 'That was one of the criticisms that when that was going through, I was one of those individuals saying, why are you going at a two thirds majority when you can go at Prop 39 and have lower that threshold to 55%?'",
        "'speaker_7': 'And at that time, as we know, there was a lot of infrastructure issues that we needed with the city streets, sidewalks. We also had a library issue there at the time and also enhancements and retrofits and fixing all of our fire department facilities as well.'",
        "'speaker_7': 'So it failed. And the reason I know about that is that community college back in 2002 did a bond. It passed. It was a prop, 39, 55%. And every project was clearly identified and clearly specified in terms of what it was going to cost and how that was going to be moving forward.'",
        "'speaker_7': 'So I think if the city had done that, we would have had a better chance. But that opportunity has now passed for the city, so we're moving forward with what we got now. One of the questions that I have is, and I was asked somewhat well was asked by a council member price in terms of the time'",
        "'speaker_7': 'frame on this whole thing. There was mentioned earlier that there's an energy out there already and I met with the city manager, I've met with staff, I've met with the member representatives from the both bodies in regards to what's taking place.'",
        "'speaker_7': 'And when the city manager advised me that there's a DNA ready to be signed. I was taken aback by that to a certain extent because I was hoping that there would not be in DNA presented or signed until there was a selection.'",
        "'speaker_7': 'So if you could please clarify to me what the what the sensitivity of that or the or the timeframe of that comes through to to this point here, where we're looking at a DNA being signed or presented by one and not the other.'",
        "'speaker_4': 'Mr. CONAWAY.'",
        "'speaker_10': 'Councilmember Urine, the DNA was an exhibit to the RFP and each team has commented on the DNA and we've gone through quite a few iterations of that DNA. And it's council's action tonight that would provide the authority to execute the INA.'",
        "'speaker_10': 'But it's important for staff from a negotiating posture to have an inch in place from the project team's perspective, so that further negotiation on the elements of the project are not subject to negotiation. Moving forward, I think we'd be at a significant disadvantage from a negotiating perspective if we didn't have that document ready to be executed upon'",
        "'speaker_10': 'council approval.'",
        "'speaker_7': 'So that was part of the requirement in the RFP is to be flexible and available to retain the DNA.'",
        "'speaker_10': 'The requirement of the DNA was in the RFP execution was expected much earlier, but many issues were raised. We came to a resolution much more quickly with Plenary Edge more, but both teams received the latest draft of the RFP probably three weeks ago in a I'm sorry, about three weeks ago.'",
        "'speaker_10': 'And there were a few comments from Plenary Edge more. A number of comments from civic core. We sent out an executable copy about a week ago and plenary plenary Edgware executed that civic or indicated that there are still items yet to be negotiated.'",
        "'speaker_7': 'Thank you. The next two questions are somewhat related, and perhaps you can explain more. I'm still at a at a kind of crossroads with the whole concept of the trip, the public private partnership and how that's going about in listening to both groups.'",
        "'speaker_7': 'One of them already had some partners lined up. What I heard tonight is that there's still some partners to be lined up. Can you explain a little bit further in terms of what does that mean in terms of for this project and how the city's commitment for the 12.6 million plays into that?'",
        "'speaker_10': 'Councilmember Yanga Yes, I'll be happy to do that. The public private partnership is generally between the city and a developer, so that's the public and the private. Our project is a civic center and in order to achieve that project, we've added in some land that could work for private development to fund the gap between what the 12.6'",
        "'speaker_10': 'provides and what it cost to construct the Civic Center. Both teams have committed to a certain value for that land $30 million, even though plenary edge more is taking down less land. So from the standpoint of P3, we have established the partnership or will be establishing the partnership with the project team.'",
        "'speaker_10': 'If council acts tonight, it doesn't require all of the development partners to be at the table. It's intended to be a process for the city to shift risk associated with design, development, construction operations and maintenance to the private side of the project and the team that executed the INA that reflects that.'",
        "'speaker_10': 'Risk shift is our preferred project team.'",
        "'speaker_7': 'And the last question I have is, of course, the continuing issue with the parking garage. I had asked about this a few meetings back in regards to either knocking down or keeping it. And my concern with keeping it was the fact that there hasn't been any real seismic studies done on it.'",
        "'speaker_7': 'We don't know. And the verbiage that I heard today was it's unknown at night at this time in terms of what its needs may be. I'm concerned about that in that regard, because if it's if it's not going if it's going to continue to stay there and we find something during the course of construction that there is'",
        "'speaker_7': 'some retrofitting or a seismic event that would create a danger to the public and to us. Who's going to pay for that? I mean, how is that going to to be addressed if something like that were to happen?'",
        "'speaker_7': 'And then the second part, which is actually a simple yes or no, was the the comment that I heard and correct me if I'm wrong, that it remains in under the city the city ownership, but it doesn't go to the to the receiver of the contract.'",
        "'speaker_7': 'Is that correct?'",
        "'speaker_10': 'Councilmember Urania that's correct. And to follow up with your prior question in the INA, there is a due diligence period that I believe runs for 90 days. It could be 60. I'm not clear in my mind right now in that due diligence period, the project team, the selected project team would conduct their due diligence relative to the'",
        "'speaker_10': 'Broadway garage, identify deficiencies that may be inherent in the Broadway garage. And if there are indeed costs that cannot be accommodated within the the financial plan of plenary ngema, the city may sit down to either talk about funding those costs from a one time perspective or assuming some of the risk relative to the seismic condition of the'",
        "'speaker_10': 'property. But in no case would our position be any worse off than we are today.'",
        "'speaker_0': 'Well.'",
        "'speaker_7': 'I'm not sure about that, because it's still a city property and it's incumbent upon the city to maintain that its property. So I'm still unclear about that. But again, I'm ready to to hear what the public has to say on this.'",
        "'speaker_4': 'Thank you. Next, we have Councilmember Mongo.'",
        "'speaker_1': 'I want to start off by thanking both teams to take the time to prepare the thorough presentations and analysis and designs and financials that each of you have takes a significant amount of investment on behalf of both. On behalf of.'",
        "'speaker_8': 'Everyone here, and I'm sure many, many people who are back at the offices.'",
        "'speaker_1': 'Watching this council meeting with enthusiasm and energy to be a part of such an important and meaningful process. As Vice Mayor Lowenthal.'",
        "'speaker_8': 'Said, probably one of.'",
        "'speaker_1': 'The most important votes of our 4 to 8 year terms is really remarkable.'",
        "'speaker_8': 'So it would not be possible without both of your teams. I was disappointed when I first started that we had lost a team, but I'm so thankful that both of you stayed in it. So just my hats off to you and thank you for your investment in and belief in us that we would follow.'",
        "'speaker_1': 'Through to the end and see a day where we can offer the employees of this great city a safe place to work for the residents of the.'",
        "'speaker_8': 'Downtown community, a vital place to live.'",
        "'speaker_1': 'Just a place where we can be happy and enjoying each other. To the community members. I have received a significant amount of.'",
        "'speaker_8': 'Community input over the last several weeks. I really appreciate the dialog that we have had.'",
        "'speaker_1': 'I know that under a prior regime of this council, there was a lot of back and forth related to seismic retrofitting. And I really appreciate the openness to hear and understand both proposals.'",
        "'speaker_8': 'The amount of detail that our.'",
        "'speaker_1': 'City staff was willing to provide my staff to work hand in hand with community members that had questions to move us from a place of misunderstanding to a place of open dialog is really a significant.'",
        "'speaker_8': 'Accomplishment, and it would not have been possible without the hard work and dedication of our team.'",
        "'speaker_1': 'So thank you very much to the staff. When we talk about moving forward, it is a moment where we talk about the importance of both protecting our future and investing together. And one of the things that I.'",
        "'speaker_8': 'Had talked about earlier at a prior.'",
        "'speaker_1': 'Meeting was our options should negotiations stall with one.'",
        "'speaker_8': 'Team.'",
        "'speaker_1': 'And I should also take a step back and thank you to both teams. I know I got.'",
        "'speaker_8': 'To meet with the entire team of Leica and I got to meet with one.'",
        "'speaker_1': 'Member of Planetary Edge more.'",
        "'speaker_8': 'As my colleagues have said.'",
        "'speaker_1': 'This was a quick turnaround and we appreciate your ability to be flexible with us and work with us on our schedules to make sure that we had all the information.'",
        "'speaker_8': 'And I know several city staff took dozens of calls from my staff as we fielded.'",
        "'speaker_1': 'Questions from the constituents. With that. Under the exclusive negotiating agreement, Mike, would we still have the option? Should we not come to a conclusion and a resolution with the team that we decide on tonight to move and re.'",
        "'speaker_8': 'Negotiate with the other teams should they eventually turn in their documentation for negotiations?'",
        "'speaker_10': 'Councilmember Mongo under the INA there is the ability of the city should negotiations fail or come to an impasse with the existing team to approach the second team. I it's unclear to me whether or not the second team consortium would be intact at that time, but we are preserving that right in the A as a bit of'",
        "'speaker_10': 'impetus for the selected project team to continue towards negotiation and negotiation of a term sheet.'",
        "'speaker_8': 'While I hope that whichever team is decided on this evening, I will be encouraging my colleagues to support Vice Mayor.'",
        "'speaker_1': 'Lowenthal with her motion to move forward with plenary agenda and with that to also know that we're a tough team and we're going to negotiate hard for our constituents. So stand by and be ready and also stand by and be ready because the wind could turn at any moment because we know that.'",
        "'speaker_8': 'We're invested in what's good for our residents. And if you are as invested as.'",
        "'speaker_1': 'You say you have been.'",
        "'speaker_8': 'Or as you say you are, then I know we will make a great resolution together. But. But the residents come first. And thank you for both of your contributions.'",
        "'speaker_4': 'Okay. Now we have Councilmember Austin.'",
        "'speaker_5': 'Thank you, Mr. Mayor. And I, too, want to salute both teams for sharing their their vision and creativity with us. Both proposals were were. You know, awesome. I think in terms of just allowing us to to envision what our civic civic center can be.'",
        "'speaker_5': 'I had an opportunity to meet with both teams today for the first time. And you they found each group affable and capable of executing this disagreement. I want to congratulate and compliment our city staff. The team actually exercised due diligence and professionalism throughout the process.'",
        "'speaker_5': 'And what we have before us today is a very difficult decision. And before we get to that, I want to get some clarity on on a few of the financial questions that that are that are still very important for us.'",
        "'speaker_5': 'And I guess this question is for city staff. Is the city manager can you currently our operating costs for city hall, it's been been estimated to be about $12.6 million a year. Can you break down the current costs that are included in that baseline figure what that pays for?'",
        "'speaker_10': 'Councilmember I will try to do that for you in our latest. As of I think this is September of 2013, we have costs that total, if I can find it here, $10.5 million plus. We have offsite leases that total about $2.1 million.'",
        "'speaker_10': 'Those costs involve utility payments. There are a lot of personnel costs associated with occupying the civic center. There is tech support. There are.'",
        "'speaker_0': 'Costs for.'",
        "'speaker_10': 'Maintenance.'",
        "'speaker_0': 'Throughout the.'",
        "'speaker_10': 'The building itself in the main library and the Broadway garage. There is a repayment of a bond issue that is still outstanding. And there are a number of debt service being about $2.5 Million a year. So that adds up to about 10.5.'",
        "'speaker_10': 'We add in that 2.1 million from offsite leases that total to the 12.6. I don't know if that helped answer your question or thought it would.'",
        "'speaker_5': 'It would be great to see that in in text. And we're at some point.'",
        "'speaker_10': 'I'd be happy to provide.'",
        "'speaker_5': 'That. And as I understand the staff report, the city will now be moving some of the offsite leases to city hall or contracting out some of the staffing that were included in the $12.6 million total if we move forward with this proposal.'",
        "'speaker_5': 'These costs are potentially $3.4 million, of which $2.6 million would be unbudgeted costs to the general fund. Is that correct?'",
        "'speaker_10': 'Councilmember I believe you're correct. Those numbers are more than just offsite leases. Those are cost that will continue even if we move to a new civic center such as technology services, such as security. So so when we originally put this together almost two years ago, we hadn't filtered out those costs that were.'",
        "'speaker_10': 'That will continue. Mr. GROSS has done that within the last six months or so. So we do know that there's costs that will continue. We haven't completely determined what offsite leases will come in to city hall. And that, frankly, is a part of our negotiation with the project team and balancing that with what services are more appropriate'",
        "'speaker_10': 'to be in the neighborhood and in the community. So as Mr. GROSS indicated on our November 11th study session, those costs become a budget issue on an annual basis and just included within our our budget presentation.'",
        "'speaker_5': 'So so your staff report identifies the potential future tax revenue as the obvious offset for these costs, correct?'",
        "'speaker_10': 'Yes, that's correct. The since we're not clear yet to how much tax revenue we are going to receive, the maximum we expect is about $2.5 million in the first year after full buildout that we're we're in order to be conservative in that estimate were ranging anywhere from 0 to 2.5.'",
        "'speaker_10': 'So we're not sure where it'll come in. So I think Mr. GROSS gave you a range of what could affect the general fund.'",
        "'speaker_5': 'And the revenues will be actually realized from the private aspects of the development, correct?'",
        "'speaker_10': 'That's correct.'",
        "'speaker_5': 'And those that that component won't happen for two or three years after the Civic Center is actually complete?'",
        "'speaker_10': 'It will be. That's correct. Two or three years, probably accurate. So that's.'",
        "'speaker_5': 'Correct. So the question I have is how do we make up the difference in between?'",
        "'speaker_10': 'That will be part of the annual budget effort. And Mr. GROSS has indicated his ability to handle that within the annual budget exercise, pointing.'",
        "'speaker_8': 'Out all the areas.'",
        "'speaker_5': 'All right. So, so my my, my my concern and is that we we don't and I'll just just take you back. I was I've been on the council for now two and a half years. And my first year, the first budget, we were about 17 million plus in the hole.'",
        "'speaker_5': 'We were looking at cutting every type of service imaginable that that that our citizens enjoy today. Parks and rec, public safety, infrastructure, public works, everything was on the table. Libraries. We're in a much better position today because of a lot of prudent financial decisions by this council and great leadership from our city staff.'",
        "'speaker_5': 'However, I do not. I'm going to just be very clear. I do not want to compromise those services, the quality of life for the rest of the city to get this project done.'",
        "'speaker_10': 'I understand that. And it's, I guess, important to kind of keep in mind that not proceeding creates, I think, more potential liability than proceeding. So I think if if the increase general fund cost is anywhere from 500000 to $1000000, I think that would be a wise investment for the city in order to avoid the potential results of'",
        "'speaker_10': 'a significant seismic event or some potential litigation.'",
        "'speaker_5': 'So we will have to make some some some budget adjustments in the coming years to make sure that we are making good on our commitment for for this project and making up the difference before there is actually real tax revenue realized.'",
        "'speaker_10': 'I think that's correct, yes.'",
        "'speaker_5': 'Okay. There's also a something in the staff report that jumped out to me as well. It talks about the negotiating agreement. And I think Councilmember Mongo touched on that briefly. But the terms of the when when we actually reach agreement with for example plenary edge more since they are the recommended proposals group team were those those terms'",
        "'speaker_5': 'that him or you come back for the council for approval.'",
        "'speaker_10': 'Councilmember Austin There is an E8 in a with the project team and the Board of Harbor Commissioners. The more you is specifically with the Board of Harbor Commissioners. Action tonight is intended to authorize staff to actually execute the negotiated in a.'",
        "'speaker_5': 'So so to execute the negotiating and actually explain what the NRA actually is that okay, we're going to negotiate or is that the agreement.'",
        "'speaker_10': 'That the NRA council person is an exclusive negotiation agreement? So we will exclusively work with the selected project team within the broad guidelines of the NRA to come to project terms in a term sheet which will lead eventually to a project agreement.'",
        "'speaker_10': 'So this is the first step, very important step, but very broad in that this is just a right to negotiate. But in our DNA, we do have a lot of of of guidelines in that in a for instance, the shifting of risk, the limit of $12.6 million, certain other performance milestones that have to be met as we'",
        "'speaker_10': 'go through the entitlement process, just like the the due diligence period coming up with submittals for design review. That whole timeline is included as an exhibit to the INA to make sure that the process continues in a proper manner and on the correct schedule while we continue to negotiate terms and conditions of the project agreement.'",
        "'speaker_5': 'So my question again is will the final terms come back to the City Council for review or approval?'",
        "'speaker_10': 'Thank you. I must have misunderstood you. The global excretory agreement, which is kind of the culmination of all the agreements that will lead to commercial and financial close will come to city council.'",
        "'speaker_5': 'Thank you. I have no further questions right now. I'm looking forward to hearing from the public.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_4': 'Okay, great. I think now we are going to go ahead and go to the public and we'll come back for for some final deliberation. So I'm an open this up to the public and please come down and and line up.'",
        "'speaker_0': 'Larry. Good you clearly has the floor.'",
        "'speaker_4': '1/2, Mr.. Could you start just a minute? Okay. I'm going to have the extra 3 minutes. So, Mr. Goodyear, please begin.'",
        "'speaker_0': 'Very good to Clark. As the address, I think, began with taking strong disagreement with the Councilman Austin's statement that this is the most difficult decision. That a very difficult decision. Actually, one point in fact, it's one of the simplest decisions to make.'",
        "'speaker_0': 'The city has spent, you know, how long making and studying this coming to their conclusion. They've made a recommendation. The intelligent thing then to do is to go the alternative route. And if you have any doubt of that, look at the debacle of the Marina Rebuild plan.'",
        "'speaker_0': 'Look at the tobacco of the blood. Look at the debacle of the bike path. The barn really is not on fire. Another 1690 days is not going to rock the boat. This is a lifetime decision as it was suggested.'",
        "'speaker_0': 'One of the things that I object to and if you please keep that up there is those buildings are uninspiring. It looks like just like downtown L.A.. I would hope that when you come back, let me make a suggestion that you use as a model.'",
        "'speaker_0': 'One of the things I think it would be really great is the Nebraska's state capital as a centerpiece go with that type of art architecture. It's something that the city can be proud of. Its distinctive something along those lines I think would work very well here.'",
        "'speaker_0': 'Also, one of the reasons I don't like glass is, first of all, it would cost a fortune in Windex. All right. Period. Number two. Last the explosions two days ago when the fire in downtown L.A. and the abutting buildings demonstrate the dangers of gas, a glass is something like that happens.'",
        "'speaker_0': 'The glass on it. It's uninspiring. It looks like any you go to any city and you'll see that. And I think Long Beach should have the intake. You never should have the sense of pride enough to come up with something more.'",
        "'speaker_0': 'It's more distinctive. And let's see what else I've got. Barnes not on fire takes exceeds days of U.S. and I think I think that is it. Take it back come back to the Barnes and out on fire. I have not studied the financial aspects.'",
        "'speaker_0': 'I certainly don't trust the city. And that one of the reasons why we can wait, I think, is wait until the federal master comes and I think will be here before the Ides of March and let him take a a objective decision at a review of it.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Good evening. My name is Margaret Smith. I'm a resident of the third district. But I am speaking as vice president of public affairs for the Long Beach Public Library Foundation. Thank you, Mayor Garcia and City Council members, for your commitment to this open and transparent process.'",
        "'speaker_1': 'Thank you to city staff for your respectful and inclusive approach to concerns of library advocates. From the beginning of this process, back in February of 2013, we've asked for three things that main library remain a vital part of the Civic Center.'",
        "'speaker_1': 'That there be experts in library design and planning involved in the creation of a new main library, and that there would be extensive community output and input so that that can be incorporated into the final design. We are gratified to see that these three issues are being addressed.'",
        "'speaker_1': 'But up to this point, it's been theoretical. We've had two impressive proposals as a basis for choosing one of the teams. We feel now that the real work starts to define and design and build a main library that will serve the current and future needs of the city of Long Beach.'",
        "'speaker_1': 'And right now, there is just a big, pretty box on the drawings, and it's 93,000 or 78,000 square feet of space. But it's not about the box, the location of the box or the square footage. It is about what will be inside.'",
        "'speaker_1': 'So we will continue to ask the questions about features and services and technology and maintenance and security and staffing and parking. And we will continue to encourage the public to give us their input about what they want in a main library.'",
        "'speaker_1': 'So it serves the unique needs of Long Beach. And it also is flexible enough to meet the changing role of libraries in our society. We look forward to being active participants in this process to ensure that Long Beach gets the main library that it needs and it deserves.'",
        "'speaker_1': 'Thank you so much. We look forward to working with you.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_0': 'Good evening, mayor and other council members. I'm Dale Whitney. I've lived in East Long Beach since 1971, and I've been the manager of the downtown Long Beach Certified Farmers Market since 1989. I'm going to give you a little history lesson, if you don't mind.'",
        "'speaker_0': 'Five points. I'm going to come right along here. The first point is a downtown lobby which has had a farmer's market of some kind for more than 100 years. There was one that lasted from 1913 to about 1973, and most of that time was around Lincoln Park, the old Lincoln Park, around the old library building.'",
        "'speaker_0': 'Point number two, the current farmers market in downtown, the one that I work for, has been here since 1980. That's 34 years. It's been in six different locations around town, including the current one, which is that property at Third and Pacific that looks like it's going to be developed.'",
        "'speaker_0': 'There have been others, I think for particular of a Tuesday market at the World Trade Center, Saturday market in district to an East Village, and just recently, another Tuesday market at the Molina building across the street. That's .3.4.'",
        "'speaker_0': 'I just mentioned it. The pictures that you had up before show a building on our current Friday farmer's market location. Point five Why not look at this modest proposal to include a plan for some work at farmer's market space in the in the new city city center.'",
        "'speaker_0': 'Recommendation maybe even in Lincoln Park, I think especially of maybe some special serve surface that would support farm trucks. And it could also be green from a distance, some driveways or that way, for instance. I did mention this to Mr. Conway the other day and I got his attention and I appreciated that.'",
        "'speaker_0': 'He said, If you have an opinion, go to a new website. I think it'll be civic center dot com, it'll be civic center dot com. I did that left my opinion and I thank you all for considering this modest proposal.'",
        "'speaker_0': 'I do have a little Christmas present for you. A current schedule card in red, green and blue for the harbor area farmers markets. Thank you. You.'",
        "'speaker_4': 'You can just leave it with the clerk. Thank you. Next week, complete.'",
        "'speaker_11': 'Jim McCabe, a resident of the third.'",
        "'speaker_0': 'District, 44 year resident of the city of Long Beach and retired deputy city attorney. Starting with something of a footnote. I think that. The mayor and others should get public input on whether or not the public wants to pay for a majestic city hall.'",
        "'speaker_0': 'I hope I trust the public wants a workable and and well-designed building, but majestic. Maybe you should ask some of the citizens and possibly some of the taxpayers in this vein. The scorn that Mr. Conway has for the taxpayers citizens is astonishing.'",
        "'speaker_0': 'The reason expressly the reason you shouldn't consider retrofitting. The reason you shouldn't consider.'",
        "'speaker_11': 'Retrofitting is because the taxpayers citizens can't be.'",
        "'speaker_0': 'Trusted to vote on. So you should. The council members should. Make your way around the taxpayers and the citizens. This is expressly what Mr. Conway is saying, that the last resort watch. What you don't want to do is ask the taxpayer, taxpayers of, the citizens of and the citizens of Long Beach in a letter that I emailed'",
        "'speaker_0': 'to the Council. I'd like to again reiterate that you're going forward with a project where the one and only the one and only financial incentive for the developer for 40 years is to spend as little as possible on maintenance.'",
        "'speaker_0': 'This is rife with the. Likelihood of arbitration litigation are some point in this process you're not going to be happy with how much maintenance is being carried on. We listen to Mr. Conway. Mr. Conway. Tells us about all the advantages of this financial vehicle.'",
        "'speaker_0': 'I warrant a wager and someone can tell me later whether I'm wrong, that he has never told you one single downside to this elaborate financial vehicle and. Project of of significance building for the city of Long Beach that this is without downside.'",
        "'speaker_0': 'You should look into whether or not that kind of thing is believable. I see the red light is on, Becky, and I thank you for your time.'",
        "'speaker_4': 'Next speaker, please.'",
        "'speaker_0': 'Thank you, Mr. Mayor, and members of the city council. I'm Joe Ganim. I'm a downtown resident in District two or District one. Thank you. I didn't move. And, you know, we've heard lots of accolades tonight about the the two projects that have been proposed here.'",
        "'speaker_0': 'The two teams. I have to say that my mindset has shifted significantly. I initially like the project from its parents standpoint that Civil War had and some components of it. And when I listened to the explanation of the staff and understand how they came to their conclusions, while at first I questioned the wisdom of getting the information'",
        "'speaker_0': 'out, I fully understand they had a legal requirement to do that. And I understand how they made their their decision. I don't think we could really go wrong with either team, honestly, but it looks like plenary is going to be this successful party here tonight.'",
        "'speaker_0': 'And yet, you know, when I hear the questions of the city council members and they're actually quite excellent, I have to tell you, you kept us so spellbound that no, hardly any members of the of the citizenry out here took a bathroom break, and that's over 3 hours.'",
        "'speaker_0': 'That's pretty significant, especially as you get a little older. I can tell you that for sure. And so I, I unlike previous speakers, I want to echo my my personal confidence in the city council and the staff thank the staff down an outstanding job.'",
        "'speaker_0': 'The more I listen to Mike Conway, I don't know how he goes to sleep at night with this compendium of knowledge in his head about all these incredible details. And I know Amy and other people have been. Oh, wait, I agree with that.'",
        "'speaker_0': 'They're incredible. What I really am looking forward to is, is where we're going with these next steps, because now the public gets an opportunity to weigh in with plenary and the city staff and the city council on what we want to see as the final product.'",
        "'speaker_0': 'Because I, like one of the speakers said before, you know, that we just got boxes we're dealing with. Now what we've got to do is turn them into the public space that we're all looking so forward to. And in terms of the speed of this, I kept wondering if we were setting up there waiting for some slight'",
        "'speaker_0': 'little tremor to help the vote get moved along. Fortunately, we haven't had that situation. So I urge you, with all good speed, to move ahead and approve your your project team. And let us get started with this. The downtown residential council looks forward to being a part of and encouraging the residents in particular in the first and'",
        "'speaker_0': 'second District and being involved. Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Hello, Mr. Mayor and council. I have lived here for about 30 years and I'm planning on moving to L.A. and I'm not very happy about it. But there's a brain drain going on, and I really want to see Long Beach concentrate on some of the fundamentals of what the deeper part of the city has to offer and'",
        "'speaker_0': 'its in its kind of civic center, its infrastructure that'll help maintain the businesses and and other deeper aspects of the of the of the community. And I and I, I see it in planner plenary. And I don't have I don't I can't stay.'",
        "'speaker_0': 'But I really want to. And I really hope that Long Beach comes up and and doesn't do what it did with the pike. And then in all of that, you know.'",
        "'speaker_7': 'Retail stuff and offers a little more.'",
        "'speaker_0': 'And that's all I have to say. So thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening, Mr. Mayor. Members of the city council. I'm Douglas Domingo Forest. Stay a resident of a third district and have lived here since 1988. I'm not very good at math. I think that 16 years. But I speak tonight as president of the California Faculty Association, the union on the Long Beach campus, the union that represents the'",
        "'speaker_0': 'the faculty, both adjunct and tenure line at Long Beach State and as part of the Long Beach Coalition for Good Jobs in a Healthy Environment. And as you know, the mission of the Long Beach Coalition is to address the growing inequality of our city and poverty in Long Beach generally.'",
        "'speaker_0': 'And we do this by promoting good jobs with living wages and responsible development and affordable housing and healthy communities. We are here today to urge you in particular to whichever team you approve of, to urge to see that they enter into negotiations quite quickly with the hotel workers union so that they may have workers voices in the'",
        "'speaker_0': 'process, they may hear from them, and but also that there is labor peace. Now, Mr. Connelly suggested this be a union hotel that's up for the workers to decide. But we do want you to pursue the the car check system.'",
        "'speaker_0': 'And I want to thank you for all your hard work. I know it's a difficult decision. Spending gazillions of dollars is not what anyone likes to do. So we want to thank you. And I particularly want to thank the staff for their diligence today.'",
        "'speaker_0': 'Thank you very much, Mr. Mayor.'",
        "'speaker_4': 'Thank you. Go to you next.'",
        "'speaker_0': 'Speaker Good evening. My name is Richard Lederer. I was born and raised in Long Beach. I've owned a home in Long Beach for 31 years. I own a business in Long Beach for 24 years. As a native resident and long time taxpayer, I'm primarily concerned with two factors with respect to awarding the bid for the Civic Center'",
        "'speaker_0': '. Number one, quality, which is largely a function of the project teams, it seems to me from what I've heard, both groups have considerable experience. But it also appears that only one Long Beach Civic or alliance has the history of doing complex public private partnerships with hotel and retail and residential construction and private sector clients and partners.'",
        "'speaker_0': 'Number two, and perhaps most importantly, is the financial impact. The difference in lease payments starts at $500,000 per year and it escalates from there over the life of the 40 year project to a total over $40 million or nearly $50 million.'",
        "'speaker_0': 'If you consider the $8 million funding for the Innovation Village with Long Beach City College and Cal State Long Beach. As a result, the difference in the two bids works out to an average of $1 million per year without considering the difference of the financial impact on the port, which totals over $200 million, which works out to'",
        "'speaker_0': 'about $5 million per year. As a stewards of my taxpayer money and my fellow taxpayers money, I would hope that you would not dismiss what appears to be a difference of up to 200 to $250 million, especially given that the city is struggling to find a multitude of projects and perhaps facing a budget crisis down the road'",
        "'speaker_0': ', particularly in view of the fact that the current price of oil is well below what has been budgeted not only for operations but for capital projects. I would also ask you that if you thought of this as with your own personal money, as opposed to taxpayer money, and let's say you were going to remodel your home and'",
        "'speaker_0': 'let's just change the zeros. So instead of being 200 to $250 million, maybe the difference was if you were building a new home, 200000 to 250000, the difference or if you're remodeling the home, it was 20 or $25,000.'",
        "'speaker_0': 'What would you choose? Would you pay 200000 to $50000 more with your own money? To build a new home or 20 to $25000 of your own money to remodel your home. I hope you give that some considerable thought.'",
        "'speaker_0': 'As a taxpayer and a lifelong resident of Long Beach, I think that really deserves a lot more attention that has been given tonight. Thank you for your time.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_1': 'Good evening. Thank you to the council members and staff for all the great work you did. I really appreciate how much detail.'",
        "'speaker_11': 'And.'",
        "'speaker_1': 'Due diligence was done. I'm not a financial expert, so I have to rely on your expertize. I can say that as a resident of the First District that it's very important to me how the Civic Center is. And having just spent over 200,000 and remodeling my house, I can understand why you might want to spend a lot'",
        "'speaker_1': 'of money on a new civic center. I think it's a really good thing that Plenary Edge More.'",
        "'speaker_0': 'Approached this project from a people.'",
        "'speaker_1': 'Standpoint. They really listened to what we wanted and what was important to us. And having lived down the street from the courthouse while it was being built, I have to say that there were no problems. It was built on time, under budget.'",
        "'speaker_1': 'And that's a really great accolade for them and also their management. We have not seen any problems. We've not seen graffiti, trash, nothing. They've done a great job of managing and that's what I have to say. Thank you.'",
        "'speaker_4': 'Kathleen, next speaker, please.'",
        "'speaker_0': 'Good evening, Mr. Mayor. Members of the city council. My name is Craig Koch, and I serve as the president and CEO of the downtown Long Beach Associates is the business improvement district for the business community in our downtown.'",
        "'speaker_0': 'I'm very excited that this project has come to this point and this realization. I think Vice Mayor has provided some excellent historical perspective on where this project has come from over the years, and it serves as an excellent foundation in resurrecting this plan to implement this project as highlighted in the past six months by the by Mayor'",
        "'speaker_0': 'Garcia and Vice Mayor Lowenthal and Councilmember Gonzalez, which clearly identify the process to ensure that this process is fair, it's it's measurable, it has transparency, there's an expeditious manner, but also, most importantly, there's community engagement to it. Dolby's role in the past year has included a number of community input meetings.'",
        "'speaker_0': 'We have conducted workshops as well as encouraged our stakeholders to participate in the website with comments. And it's very, very important to us and it's good to hear that the port is interested in this project and to bring that that asset back into our downtown debate will continue to work and recommend with the project developer of this'",
        "'speaker_0': 'team to bring the best project Long Beach deserves. It will begin discussions with a select team to be involved in becoming the best, serving as the best practice and model and provide services to activating and maintaining the public space associated with this project.'",
        "'speaker_0': 'I think there's some great examples throughout the country that we can look at. Bryant Park is one of them where a public private partnership is developed in the private sector, manages the the project as well as the maintenance to it.'",
        "'speaker_4': 'Okay, time's.'",
        "'speaker_0': 'Up. Great. Thanks. Thank you, Mr. Burgess.'",
        "'speaker_4': 'It was 3 minutes right there. All 3 minutes. Max is our next speaker, please.'",
        "'speaker_11': 'Ellie Gonzalez, 71 Cedar Avenue.'",
        "'speaker_0': 'So I wanted to bring up the issues.'",
        "'speaker_11': 'That I brought up last time, and I was wondering if any of them were resolved. So, you know.'",
        "'speaker_0': 'I'm glad we were this step in developing a new civic center. But my main issue is that we have a civic center and we have 20 years left to pay for this civic center. And it looks really bad.'",
        "'speaker_0': 'And you guys noticed that because it's on your address, because you can see that there's issues with it. One of the issues is that it doesn't open up on Monday. The library doesn't open up on Monday. The library opens up on Tuesday at 12:00.'",
        "'speaker_11': 'I don't feel that's an appropriate time for a main library.'",
        "'speaker_0': 'So we're talking about building a brand new, beautiful civic center, but we're not ready to open up the library at a decent time on Monday morning. So I wanted to talk really quickly. I have a bunch of points.'",
        "'speaker_0': 'Let's talk about the 27 study that's on Long Beach Civic Center dot com. There was a study that we're basing this whole safety issue on in that study. Christina Andersen, then the director of Public Works, makes a recommendation on page 19 of the 27 study for a retrofit of the main library rooftop park that would gain access'",
        "'speaker_0': 'to a public park that we have here at the center of the city that almost everybody has forgotten about. I just think that's an important issue because we're talking about a public park that we currently have that we have been paying for that is just not used.'",
        "'speaker_0': 'That's right here at the center of the city, accessible to everybody from the transit mall. And that just hasn't been brought up in any of the designs because we're not talking about a retrofit because we're afraid to ask the taxpayers to invest in a building that they have to pay for no matter what.'",
        "'speaker_0': 'For the next 20 years and they have been paying for it for the past 30 years. So in order to avoid that, we've decided to go to a P-3, a practice that has only been done once with the courthouse during a time when we didn't have money to find anything else.'",
        "'speaker_0': 'During a time when our justice system is going through a major crisis. So, I mean, I wouldn't really use the courthouse as the best example. Also, we talk about safety and we talk about leadership. Some of you leaders behind the dais are not new to this council.'",
        "'speaker_0': 'This safety issue is not new. Is safety was your number one concern, which is remember again, that's why we're here. Safety. We would have looked into a retrofit a long time ago because what you're doing is putting yourself and all of us at risk.'",
        "'speaker_0': 'Assuming that this goes through, that today's the day and we're going to choose. Plenary I realize of 20 seconds we're going to choose plenary and today's the big day that we're going to move forward. We still have five years, so we're hoping that between now in the next five years, some big earthquake doesn't come.'",
        "'speaker_0': 'So I really wonder if safety is the issue or if the issue is money and development and you guys are going to get suckered into building something that we don't need again. Case in point, the Pike Eggers, the books most of Pine Avenue and a dozen other projects at Long Beach has seen over the years.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thanks. Speaker. Mayor. Members of the city council. Excuse me. My name is Jim Gooden. I love it. 600 East Ocean Boulevard. I am the vice president of ORCA, which is Ocean Residents Community Association. I'm also on the board of the Downtown Residential Council.'",
        "'speaker_0': 'We who live on Ocean Boulevard are very excited about the project. I especially like to point out a part of the staff report that it gets me. Gets me jazzed, gets me excited. And that says private development near the new civic center will serve to invigorate the area, adding residential density, retail opportunities, hotels, supply and activation of'",
        "'speaker_0': 'Lincoln Park. Rather than locking the door on three blocks of downtown at 530, the Civic Center could be thriving, gathering place for activities other than municipal. Creating a new catalyst for future managed growth. Offering ongoing benefits to the entire city.'",
        "'speaker_0': 'We and Orca are your neighbors. We live right across the street from the project and we would like to be actively involved in the community input process. We would like to help. Thank you.'",
        "'speaker_4': 'Thank you very much. Next speaker.'",
        "'speaker_0': 'Please. Good evening, Mr. Mayor. Council Staff I'm Ron Miller, executive secretary of the L.A. Orange County Building Trades. And I'm going to try and cut a little time off this by speaking for my group. If they would stand up, though, I'd appreciate it.'",
        "'speaker_0': 'Building Trades Guys Stand Up. We represent 140,000 craftsmen and women, many thousands who live in this area. And there's going to be some local guys here from Long Beach that's going to speak anyway. We've partnered with these two to general contractors in the past and in the present.'",
        "'speaker_0': 'We currently partner with them now in various projects across the country. They're both good projects. Both teams did a great job. I'd like to commend staff on their due diligence in our selection process. I think they did a very good job.'",
        "'speaker_0': 'They answered the questions. I think we have a very fiscally prudent council here. You guys answered you ask the questions that are needed, and I think you got the answers. Now, I can tell you something I know about is construction.'",
        "'speaker_0': 'The longer we wait to go for this project, the more construction costs go up. And with increased construction costs means more money. And the seismic issue.'",
        "'speaker_10': 'Is an.'",
        "'speaker_0': 'Issue. But we all know that since we live in California, that the big ones coming, we just don't know when and we don't know where. So I urge you to move ahead with this project tonight. Let's get some shovels in the ground and put some people to work and get a beautiful complex for the city of Long'",
        "'speaker_0': 'Beach. Thank you.'",
        "'speaker_4': 'Thank you, Ron. Next speaker.'",
        "'speaker_3': 'Please.'",
        "'speaker_0': 'Horrible. Mayor Garcia, distinguished city council and staff. My name is Alex Safaga. I live at 7 to 7 terminal and I believe, like most of you would, you guys will probably agree with the statement. Long Beach is perhaps the greatest city in the world to live in.'",
        "'speaker_0': 'All right. Now, being such.'",
        "'speaker_6': 'An amazing.'",
        "'speaker_0': 'City, I think one of the things that Long Beach deserves is a quality, safe and cutting edge civic center, library and City Hall as its main centerpiece. Now, I stand strongly in favor of this moving this project project forward without any due delay.'",
        "'speaker_0': 'And as Long Beach resident. I would also like to urge you to attach language that encourages the hiring of Long Beach residents for the building of this project, and also as a ten year veteran of the Marine Corps with two trips overseas.'",
        "'speaker_0': 'I would also like to encourage aggressive and enforceable language that requires the hiring of veterans for this project as well. I thank you for your time, and I trust in this Council to make the best decision possible for the city, its residents and the men and women who have so courageously defended it.'",
        "'speaker_0': 'Thank you. Yeah. Thank you for your service and experiences. Hi, I'm Tim Ryan. I'm with CBRE. I represent the.'",
        "'speaker_11': 'World Trade Center. And I came tonight just to hear the process, sort of look at what you're doing.'",
        "'speaker_0': 'I've been following this project for quite a while, excuse me, quite a while. And one of the.'",
        "'speaker_11': 'Things that jumped out at me in listening to the analysis tonight, the Port of Long Beach was in escrow for $130.'",
        "'speaker_0': 'Million for.'",
        "'speaker_11': 'A half a million square foot building. And at the end of, they voted twice to approve it. At the end they said, oh, it. Cost too much. And but primarily the parking underneath the World Trade Center is a major problem.'",
        "'speaker_0': 'So I'm here to ask you to consider or.'",
        "'speaker_11': 'Look at how can you choose a group that is actually proposed that when that's something that the port has indicated they've not.'",
        "'speaker_0': 'Wanted all along, more importantly. So it goes back to cost. More importantly for me as I listen to the speakers that were here tonight and very good questions.'",
        "'speaker_11': 'By the various.'",
        "'speaker_0': 'Council members, what if the Broadway garage is not seismically fit? You're guessing that that you're able to. Well, I don't think it is. We don't have anything to say that it is. Well, do you have anything that says that it is not?'",
        "'speaker_0': 'What is the cost there for that group?'",
        "'speaker_11': 'Secondly, the costs cost seem to be.'",
        "'speaker_0': 'So important in my mind.'",
        "'speaker_11': 'And if you had a project that you could have gotten for 130 million, you're now having a difference in these two projects.'",
        "'speaker_0': 'Of 144, 179.'",
        "'speaker_11': 'Of her 247 million. I was personally moved by the young lady who talked about being homeless in this city. And I don't know how you can sit there and say every one of you talked about how great each of these teams are.'",
        "'speaker_11': 'I don't know how you could say, well, let's go ahead and spend 247 million.'",
        "'speaker_0': 'More or 47 million more.'",
        "'speaker_11': 'When you have people like that in the city.'",
        "'speaker_0': 'That need your help. So in closing, I'd ask you.'",
        "'speaker_10': 'Not to vote.'",
        "'speaker_11': 'Tonight. Before fully reviewing those costs.'",
        "'speaker_0': 'Make sure that the decision you make is a good one because you're going to look in the mirror and you've got to think about that lady. So that's my statement. Thank you.'",
        "'speaker_4': 'Thank you. Next speaker.'",
        "'speaker_11': 'Please. Good evening. My name is Rusty and the executive secretary treasurer elect. I'm not there yet of the L.A. County Federation of Labor. And it's my honor and privilege to stand before you representing 600,000 hardworking men and women all across the county of Los Angeles, many of which you live here in in Long Beach.'",
        "'speaker_11': 'You, as the council, have the opportunity to do something that many people don't get the chance to do. People have talked about it as a very hard decision. A difficult decision, one that you deliberated time and time again, month after month after month in 2008.'",
        "'speaker_11': 'In 2009, we saw a great downturn in the economy and many people really suffered. Those in Long Beach, those in L.A. County, those all across Southern California. And we've seen some recovery. Those jobs have been replaced, the ones we lost.'",
        "'speaker_11': 'But on average, those jobs pay 23% less than the jobs that they actually replaced. This project allows you, the council, to give 3700 people a good paying, solid job that they can support themselves and to support their families with.'",
        "'speaker_11': 'I think that is something that this council that has committed to the quality of life of the residents of Long Beach would commit itself, do and do immediately and move forward this project as soon as possible. Thank you.'",
        "'speaker_4': 'And thank you for your service as well. Okay.'",
        "'speaker_11': 'Good evening, Mr. Mayor, and city council members. My name is Derek Smith. I am the political director of Unite Here Local 11, which represents hotel workers and airport workers here in Long Beach and in Orange County. We want to commend the City Council for having the vision necessary to conceive of an ambitious project like this.'",
        "'speaker_11': 'I know it's been said many times before, but this job or this project will result in good construction jobs, good hotel worker jobs, and obviously will improve the quality of life for for Long Beach residents. At this point, we don't have a recommendation as to the applicant that the city should select, although I have nothing but praise'",
        "'speaker_11': 'for the two projects and the visions, the projects and particularly the forthright manner in which they have addressed our concerns. That said, we urge the Council to move quickly and expeditiously to select an applicant so that we can get this project moving and and get to work.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'All right. Joel Weinstein, 4000 Linden Avenue, District eight. You know, you never asked the citizens whether we really wanted to spend the kind of money in this particular way. So don't be surprised if the citizens will say no to anything you'll put on the ballot, and therefore this devious route of trying to avoid putting something on the'",
        "'speaker_0': 'ballot so that in effect, it's dumped on later generations who will have to decide which services they will live with with further cuts, because this project will just have to be funded or else. You know, just these you know, the bonds are going to have to be issued and paid for somehow.'",
        "'speaker_0': 'And the kicker is we're going to give away public land for the privilege of paying ever more money every year to a private developer, not just the private sector in general, but one selected private developer. We didn't ask for this.'",
        "'speaker_0': 'You came up with it. You rubber stamped it. You're going to have to live with that kind of.'",
        "'speaker_5': 'Decision, if that's what you want.'",
        "'speaker_0': 'To do. You claimed the claim. The pretext was that there's a seismic problem. If it was urgent, it was never addressed. Where are the seismic precautions that were taken, that were imposed after the year 2005 or whatever in the meanwhile?'",
        "'speaker_0': 'Where will the people go when this building is demolished? For several years. There's no plan for housing city workers effectively and safely. And yet that is really the issue. How do we do that? Well, there's one obvious way.'",
        "'speaker_0': 'Eventually we retrofit, we release for a while, but then we bring them back and a retrofit facility. The another alternative, which of course, wasn't even dreamed of, let alone considered, is exactly the digital age circumstance in which I have been working for the state of California for ten years and more.'",
        "'speaker_0': 'Namely, we're dispersed in small offices. My team is dispersed in small offices throughout the state. No expansive, high rise city center, vulnerable, uneconomic facility, which just has to concentrate us into plush offices. But we are connected every day, every hour by modern telecom.'",
        "'speaker_0': 'That approach was never even considered, was it? The idea was that you would never consider a spectrum of approaches, and by refusing to do that, by making it difficult to seriously consider and entertain retrofit proposals or other proposals, you made sure there would be no viable alternative.'",
        "'speaker_0': 'And of course, under these circumstances, the citizens will have no confidence in a decision to move forward in this way. Of course, we know downtown is going to love it. Some people think you. But that's going to be the bottom line.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Next week, complete.'",
        "'speaker_0': 'Good evening, counsel. Mr. Mayor, my name is Albert Ramirez. I am a job developer, Winter YouthBuild. We service students primarily in Long Beach, Wilmington and San Pedro. Just wanted applaud everyone here for your hard work. I see firsthand what with students, unemployment can be.'",
        "'speaker_11': 'With respect to their personal lives and.'",
        "'speaker_0': 'How it affects their family, their health, and even the ability to buy food. And we I see this and we see this. And matter of fact, I have a student here, Steve Miller, not related to musician, but, you know, setting out to be here and, you know, just support this effort.'",
        "'speaker_0': 'And I know that with Unite here local and they actually spoke to some of our students and we look forward to their hospitality training academy as well as our sisters and brothers with the construction trade and the apprenticeship program.'",
        "'speaker_0': 'So again, we're in full support. We applaud your efforts and all this with respect to local hire. And I know that the job and employment, especially with our Long Beach youth, will change their lives and increase their quality of life.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_11': 'Good evening, Marion Council. My name is Jack Smith. I live at 50 Elm Avenue. That's in the East Village in the second district. Tonight is a question of which one. It's not a question of go or no go.'",
        "'speaker_11': 'Which one of these is.'",
        "'speaker_0': 'The preferable.'",
        "'speaker_11': 'One, the better one, for the city and for the community? As you know, I stick my nose into a lot of things in the community. I'm involved all over the city since day one of this part of the process.'",
        "'speaker_11': 'Once it was clear that it was going to move forward with a new city, a civic center. I had personally the preference.'",
        "'speaker_0': 'Of the planner group. My what?'",
        "'speaker_11': 'Just watching their behavior in council and at presentations in the audience, it was clear to me that that group. Was more interested in listening to the community than the other group. Since this appeared on the agenda in the past week, I have spent time talking to various community association leaders across the city in anticipation of what we'",
        "'speaker_11': 'can do.'",
        "'speaker_0': 'All of those working with the choice.'",
        "'speaker_11': 'You make tonight, which if the staff recommendation is the one to make. And make sure that now the community is heard, not just presentations and PowerPoints, but actual important, clear, meaningful discussions with the community.'",
        "'speaker_0': 'I believe that the group you're choosing tonight.'",
        "'speaker_11': 'Will make those efforts. To meet face to face with the community members, particularly in the downtown area and in the central area. I cannot speak for any of those organizations. I'm a private citizen up here speaking. But I can tell you that organizations like the Downtown Residents Council and the Community Associations that are part of that, the'",
        "'speaker_11': 'Central Project Area Council and the Community Associations that are part of that, the North Long Beach Good Neighbors Group and the community associations.'",
        "'speaker_0': 'That are part of that excuse me.'",
        "'speaker_11': 'The West Side organizations.'",
        "'speaker_0': 'Over there all across the city. Are ready to meet with these sort these this particular group and.'",
        "'speaker_11': 'Make, as I said, meaningful, clear, important contributions to this effort over the next few months. Thank you very much.'",
        "'speaker_4': 'Thank you, Jack. Next speaker.'",
        "'speaker_8': 'Hello. My name is Sarah Myers. I'm a resident of the fifth District and executive director of the Long Beach Public Library Foundation. As Margaret Smith, my colleague, stated, one of our second key messages was that we really wanted design experts in library design and space planning to be included in the teams.'",
        "'speaker_8': 'And I do want the council and the public to know that we commend both teams civic core for bringing on Susan Kent and plenary for bringing on Lynda Demers, who is here tonight, both library experts who really brought the touch of their library background, what what should go into a library, how they should look at it to'",
        "'speaker_8': 'this process. And so we thank the city staff for putting that in the RFP. And for both teams looking at that, we as a stakeholder, the library stakeholder and the library have respected the RFP not to engage in any level of of great detail with the teams.'",
        "'speaker_8': 'And so we really are looking forward to this next phase of the 6 to 9 months of public outreach. We encourage the community to come out and we look forward now to to holding you, Mr. Conway, to your word that Glenda Williams will have an opportunity now to really sit down with these library design expertize and really'",
        "'speaker_8': 'plan out what will go inside the building and what are the services that we can provide. And I do want you to think about as we look at this library, this new main library, to think about the library as an innovation center.'",
        "'speaker_8': 'We have our small business center. We have our new makerspace with the 3D studio. We just had classes and patents, and I've had small business owners say that they got their MBA by way of the library where they came and learned everything they needed to know about tax laws and leases at the library.'",
        "'speaker_8': 'So I look forward to us all coming together as a community and thinking about what the current needs are and the library of the future. So I thank you and we'll be talking more.'",
        "'speaker_4': 'Thank you. Next speaker.'",
        "'speaker_11': 'I'm Larry Jackson. Nearly 40 year resident of the city. But I'm here as secretary of the Long Beach Convention and Visitors Bureau to report to you that the unanimous recommendation or endorsement of the staff recommendation came from the board of directors of the Convention Visitor Bureau.'",
        "'speaker_11': 'We met I personally have sat through two presentations. As Vice Mayor Lowenthal mentioned, seven or eight years ago, I was part of the visioning committee, stood on top of this building where I worked and I worked in Old City Hall and watched and saw what this city could be, but saw what the deterioration and having worked in'",
        "'speaker_11': 'this building, this is it's it's long overdue. This is a tough building to be in. Larry Black couldn't be here today. Small business owner of Arden Hotel. Larry is ecstatic about the project and asks that I send his mention as well in terms of his endorsement of the project.'",
        "'speaker_11': 'Convention Advisor Bureau. Again, it's not just the hoteliers, although they unanimously, large and small, support the staff recommendation. It's the cab company, Long Beach, Yellow Cab. It's restaurants. It's Catalina Express. It's the businesses that serve the tourism industry.'",
        "'speaker_11': 'And we are so pleased and happy to see the project go through that. You're moving forward with the project and hope that it goes through. And lastly, for me personally, my life has been wrapped up in public transit and to see, as Pat West mentioned in one of his presentations that I attended, the linkage, a pedestrian linkage'",
        "'speaker_11': 'to those people who use those of us that are public transit users is a great design element in the plenary project. So I have others from the hoteliers that want to add. So it's not just me. But I thank you for listening to Long Beach Convention and Visitors Bureau for the support that you've given us over the'",
        "'speaker_11': 'years. And I hope that this project as staff recommendation moves forward. Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Hi. Good evening. My name is Greg Keebler and I'm the general manager of the Hilton Long Beach. We are.'",
        "'speaker_6': 'Either the gateway to the port or the gateway to Long Beach, depending on which direction you're heading.'",
        "'speaker_0': 'On the ocean. We are very happy to support the staff recommendation for plenary based upon more than just the overall impact that this facility in this complex, mixed use complex will have here. But the overall economic catalyst, it will provide another development with additional residential, additional office space development.'",
        "'speaker_0': 'All of that continues to make this a much more thriving and prosperous area. One of our meeting planners who hadn't been to Long Beach in a while, who brought a convention here, went back and said, When did Long Beach get so happy?'",
        "'speaker_0': 'So the work that has been done in the city to create the kind of vibe that is exists continues to be that much more important for us to do so. Good luck on your decision tonight. We support the staff recommendation for plenary.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Next speaker, please.'",
        "'speaker_0': 'Good evening, Honorable Mayor and Distinguished Council Member and City Staff Silvano Mallon, the general manager courtyard by Marriott downtown. And also we are supporting of staff recommendation not only because it's been proven over and over that developing downtown is going to make the economy flourish, not only for the city but therefore its residents creating jobs and keeping'",
        "'speaker_0': 'the economy growing. So we thank you for all you do. I know it's not an easy decision and thank you for your support.'",
        "'speaker_4': 'Thank you. And I'm closing the speakers list after the lady that's in line so I don't see anybody else lined up. So we're closing the speakers list. Mr. Goodling.'",
        "'speaker_11': 'Mary Garcia, council members, city staff.'",
        "'speaker_0': 'First of all, Larry shared our board's discussion and vote yesterday, and it was a vote that actually was extremely unanimous, strong support. We hear from the visitors that convention visitors that come, they stay at the Hilton. They walk this breadth of Ocean Boulevard to the convention center.'",
        "'speaker_0': 'And this is a really strong gateway for us as a city. And it creates that walkway or that pedestrian walkway that we're looking for all of our visitors and residents to enjoy. In addition, as as a business community, we work with each of the council members.'",
        "'speaker_0': 'And we also know that jobs are so critical for all of our council members. And it was exciting to hear tonight the number of jobs that this will create for residents in our districts. And it again is Silvano said all of this helps to create a more vibrant environment, but also a long term, vibrant environment.'",
        "'speaker_0': 'Lastly, we appreciate the work that city staff has done. They've truly researched it and we were pleased to hear their report tonight and the questions that they answered. And so our support as a as an organization is that we hope that you all concur and that you actually support the recommendation of staff.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Next speaker.'",
        "'speaker_1': 'Good evening, mayor and city council members. My name is Alexander Torres Galan seat and I'm the executive director of Women in Nontraditional Employment Roles and also a resident of Long Beach. I'm here to support this project and to urge you to move forward with it and work really hard in getting a really good, strong play and in'",
        "'speaker_1': 'this project, local hire and to have a strong support of this community and for you to support the community and for us to support you as well. So thank you. Thank you.'",
        "'speaker_4': 'Thank you. The speaker's list is now closed. To take this back here. And I'm going to I'm going to make some comments now. And I will also then have a couple I have a couple more council speakers and then we'll we have a motion on the floor and we'll see where that discussion goes.'",
        "'speaker_4': 'Let me begin by saying that I think that the the one thing I'm really proud of on this throughout this whole last few years has been the process. And I remember when I sat on the visioning process team with a lot of people that were in this audience as a president of my neighborhood association.'",
        "'speaker_4': 'And there were two things that came up that we wanted to make a big impact on. One was to rezone the downtown. And the second was to reimagine the Civic Center. The first, which ended up being the downtown plan, was pass and move forward by this council.'",
        "'speaker_4': 'Huge accomplishment. And you hear from folks like John and Mario Molina that because of the downtown plan, they were able to build the new mall in a headquarters in North Pine. 6 to 9 to a year ahead of schedule because that zoning document was in place that came out of the work of the residents that kind of'",
        "'speaker_4': 'came together. And Larry was on that group who just spoke as well. The second piece of that discussion, and this happened before I even joined the council, was how do we re-imagine and rethink the civic center being us feeling that there was a need to to rethink the civic center.'",
        "'speaker_4': 'And I'm really proud that here we are having this discussion and important discussion about the process. I also say that I believe that the project's been described a lot of ways, but I believe this to be a transformative project.'",
        "'speaker_4': 'This is a transformative project for Long Beach. It's a transformative project for downtown. What we're talking about tonight is the construction and development of not just private development, private developments. Great. We're going to end up with incredible new density, some great residential projects, hotel property, other private development.'",
        "'speaker_4': 'But what I'm most excited about are the.'",
        "'speaker_0': 'Four public.'",
        "'speaker_4': 'Projects that will come out of this process. Yes, we will have a new city hall, but in my opinion, that's the least exciting of the group. We will bring our port headquarters to the downtown core for the first time.'",
        "'speaker_4': 'In the we've all known the modern operations of the port. They will come into the core of the downtown in a new port headquarters. We will be building what will be a new iconic park in Lincoln Park. A park that really will bring the community together.'",
        "'speaker_4': 'And finally, to be honest, the portion that I'm the most excited about is that we will be constructing and building a new main library. And I can't really emphasize enough that I view the library as the centerpiece of this project.'",
        "'speaker_4': 'That library, that Center for Innovation, as it was well described, that place that will welcome families and our youth will be inviting and it will be something that we will be very proud of. It will be one of the best libraries in the country.'",
        "'speaker_4': 'We're committed to that. This will be one of the best libraries in the country and on as good, if not better, than the great new facilities that have opened up in San Diego and Cerritos and and other places.'",
        "'speaker_4': 'In addition, I believe that staff has been responsible both financially as well as with their deliberative process to members of. The Council. I want to thank staff for their hard work. And I also want to point out that.'",
        "'speaker_4': 'Our City auditor. I have sat down and I have had some conversations on. I have asked her to also serve as an independent and objective extra set of eyes throughout this whole project. And I want to also thank Councilmember Ranga for also suggesting that and that was something that he discussed.'",
        "'speaker_4': 'So Auditor Doud will serve when we have briefings and when we are briefed when this comes forward. She will be invested in this project as well to ensure that not only do we have that financial set of eyes that will be coming from staff, but also an independent set of eyes that will be coming from our city'",
        "'speaker_4': 'auditor. So I want to thank her for agreeing to serve in that role. And I think it's one that provides extra financial oversight over the project. In. The last thing I'll close by saying is that I believe that we're a city that can do big things.'",
        "'speaker_4': 'And at some point as a city, we've got to step up and do big things. This tonight is this is a big deal.'",
        "'speaker_0': 'This is a the.'",
        "'speaker_4': 'Largest public construction and development project on our city side that we have probably done in decades. Sure the ports had some large projects, but the city has not invested itself in this type of endeavor in decades and decades.'",
        "'speaker_4': 'And so I believe that Long Beach is ready to take these types of projects on, and not just in downtown, but in North Long Beach and in West Palm Beach and in other parts of the city as well.'",
        "'speaker_4': 'And so I believe in big things. I believe us. We're going to take a great step tonight. And I fully support staff's process and the recommendation that they're making tonight. So I want to thank everyone involved in the process.'",
        "'speaker_4': 'And I especially a lot of a lot of our working men and women that actually build our public projects are here tonight. And I want to especially thank all of you for for building not just a good looking courthouse, but all a lot of the public projects we see in our community.'",
        "'speaker_4': 'So thank you all for your hard work and thank you to both teams. A lot of hard work went into them and I believe today what I believed when I first saw both presentations is that for us, we we have we got to we hit a homerun.'",
        "'speaker_4': 'We ended up with two great teams and really proud of both. And I'm looking forward to the process moving forward tonight. So with that, I'm going to bring this back to the council. There is a motion on the floor.'",
        "'speaker_4': 'Councilwoman Pryce.'",
        "'speaker_8': 'Thank you. I did want to ask, based on some of the comments that we heard, I wanted to ask staff, what is what are our options in terms of adding a local hire component to the project going forward?'",
        "'speaker_10': 'I think that's going to be clearly a subject of discussion with plenty more. Should city council go in that direction? We've heard of a number of parties interested in that, and I think that's an appropriate thing for a council to suggest.'",
        "'speaker_8': 'Is that something that would be appropriate to suggest tonight or at some future date?'",
        "'speaker_10': 'I'm happy to hear it tonight.'",
        "'speaker_8': 'Okay. Well, then with that, I'd like to make a friendly amendment that we have a local hiring component with the contract as we move forward.'",
        "'speaker_4': 'It was just a friendly amendment.'",
        "'speaker_0': 'Okay. Okay. Yeah.'",
        "'speaker_8': 'I appreciate that. Thank you. Okay.'",
        "'speaker_4': 'Vice President Gore, would you accept that friendly amendment?'",
        "'speaker_9': 'I do. And the enthusiasm from council member Austin.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Great.'",
        "'speaker_4': 'Councilwoman Price.'",
        "'speaker_8': 'A few other comments that I heard. You know, it doesn't need to be said. I echo many of the mayor's sentiments in regards to the positives of the project. There were a few comments that were made during public comment that I take issue with specifically that council didn't consider alternatives.'",
        "'speaker_8': 'As someone who spent a lot of time educating myself on this, I reject that completely, that we didn't give this enough time. There was enough opportunity for public outreach. Again, completely misinformed opinion and thought. And I would encourage those folks to do their research before they start spreading that.'",
        "'speaker_8': 'And really, I'd like to come to the defense of Mike Conway, and he's done a fabulous job on this. And I want to thank him for the work that he's put into this. I believe that this project on this proposal was was very transparent.'",
        "'speaker_8': 'And for anyone to claim that there wasn't enough time, it just shows me that they weren't paying attention. So thanks.'",
        "'speaker_4': 'Thank you. Sorry, Vice Mayor Lowenthal.'",
        "'speaker_9': 'Thank you, Mr. Mayor. Just a couple of points I wanted to make. One is I wanted to thank the men and women that came forward to talk about the workers and really that matters to this city as well.'",
        "'speaker_9': 'And I'd like to thank Rusty, as well as the others that were here to address the workers issue. I'm very excited about the project labor agreement and the potential for that through this project. This is the largest public project that we'll ever do.'",
        "'speaker_9': 'And and it's very important. So I'd like to thank you for raising that issue throughout these years and helping us see it come through. The other question I have is it's actually the only question that I have I wanted to ask the city manager or Mr. Conway.'",
        "'speaker_9': 'When we look at what the Harbor Commission voted on yesterday, they required the term sheet and all of the other agreements that are negotiated to come back to the board. How different is that process from what you proposed to do with your council?'",
        "'speaker_10': 'Vice Mayor Lowenthal I do believe that the Board of Harbor Commissioners modified their recommended action to bring the memo you back for approval. I don't recall off the top of my head if the DNA was intended to go back as well.'",
        "'speaker_12': 'I think I can speak to that. The. I think Vice Mayor Lowenthal is correct. The NRA execution of the NRA has been authorized, but not the term sheet. So, in fact, I think the board of Harbor Commissioners, the only action that they authorized is execution of the NRA.'",
        "'speaker_12': 'Any other document requires for the Board of Harbor Commissioners approval.'",
        "'speaker_9': 'Since this will be the largest project that any one of us will have been a part of. As council members, I would like to request that staff come back every six months with an update to this council. I think that would be important after we make this decision.'",
        "'speaker_9': 'It shouldn't be that the first thing that that council hears about it is, is when we're ready to break ground. I think it would be very important for us to do that. Your thoughts, Mr. Cobb? Mr. Conway.'",
        "'speaker_10': 'Every six months at a minimum.'",
        "'speaker_9': 'At a minimum, absolutely. If you'd like to overwhelm us, that would be fine as well. And also, I know you've assured us that contractually speaking there, there are items that are required to come back before the council. But but a briefing and a briefing document to support that would be helpful as many hours a week as these'",
        "'speaker_9': 'council members work. It's technically supposed to be a part time job and there's nothing part time about it. And but I do think having that knowledge will be important. Do I have your assurance, sir?'",
        "'speaker_10': 'Absolutely. Vice Mayor.'",
        "'speaker_9': 'Thank you. I'd like to close with just something that I was reminded by when I had we had our friends from labor come up and speak. June 24th of 2011, I had the great privilege of taking a water inspection tour to the Hoover Dam with a small delegation of Long Beach business owners, residents and policymakers.'",
        "'speaker_9': 'And that was a time when we were experiencing one of the installments of this great drought that we're experiencing. And I was struck by a life sized photo, black and white photo of a man who was working to build the Hoover Dam.'",
        "'speaker_9': 'He was one of more than 5000 men who built the Hoover Dam during our nation's hardest times. And the caption was Hard times, hearty people. And I thought, that has to be the Long Beach story as well. The Great Depression devastate devastated the nation's economy and spirit.'",
        "'speaker_9': 'Constructing a great dam in the desert of all places bolstered both the nation's economy and the spirit. This and other public works projects stand today as a testament to the indefatigable human spirit. Great nations and great cities did this the world throughout.'",
        "'speaker_9': 'I believe our city can do the same. Thank you.'",
        "'speaker_4': 'Thank you, Councilmember Austin.'",
        "'speaker_5': 'Thank you. And I do want to thank the many members of the public who came out and and spent their evening with us and sharing your thoughts about this, the direction that you like to see your city go into in this regard.'",
        "'speaker_5': 'I want to follow up on Councilmember Lowenthal request from staff to come back every six months. And again, I just want to be clear on what the exact exclusive negotiating agreement does. And if coming back every six months, what does that entail?'",
        "'speaker_5': 'Would you be reporting progress? Would you be reporting agreements that have been negotiated up to that point?'",
        "'speaker_10': 'Councilmember Austin. Attached to the INA Exhibit A is a group of milestones that the team and staff have to achieve over the next 17 months. I think that would be a good starting point on how to brief city council, on how we've kept our schedule, what we've achieved relative to those milestones, and receive any feedback from council'",
        "'speaker_10': 'on how best to proceed going forward.'",
        "'speaker_5': 'Thank you, Mr. Conway. I just want to make sure that this Council is ultimately going to be and I'm making a statement, this council will ultimately be held responsible for this project for better. And I'm just going to keep it positive for better.'",
        "'speaker_5': 'And and so I want to make sure that there's there's sufficient oversight from from this this body moving forward. I'm in full support of moving forward tonight. I think, you know, I woke up this morning with the mindset that I wasn't really ready to vote on this project.'",
        "'speaker_5': 'However, after listening to many members of the public getting phone calls and getting clarifying questions from this this council, and I want to compliment my council colleagues for for asking very thoughtful and insightful questions. This evening, I am ready to take a leap of faith of progress for the city of Long Beach tonight and support the recommendation'",
        "'speaker_5': 'I'm going to support going big. I think this is a great opportunity, a unique opportunity for our city. This is Long Beach life. This is the transformation of our city, which I'm going to be very proud to be a part of.'",
        "'speaker_5': 'And I'm going to be watching this process to make and commit to making it a success moving forward. Thank you very much.'",
        "'speaker_4': 'Thank you, Councilmember. Councilmember Richardson.'",
        "'speaker_6': 'Thank you. I've been moved by this discussion in terms of, you know, it's it's an opportunity to think big. We should be thinking big here. I think we know and we maybe we've lost our way in terms of our public leaders nowadays, that the way that you can help course correct the economy is by investing in infrastructure'",
        "'speaker_6': '. That should be one of our predominant and primary desires and reasons for doing this. We can put people to work. We can help our local economy. We can give a shot in the arm to the downtown. That's it.'",
        "'speaker_6': 'I think we move forward tonight.'",
        "'speaker_4': 'Thank you. Counselor. Maria Ringo.'",
        "'speaker_7': 'Thank you, Mayor. I want to thank you also for your discussion with the creator, and that includes meeting Clooney inclusive in her participation in this project, because it's very important that we have that independent oversight and if that independent, at least from the city's perspective, as to what's taking place, because I think we need to know exactly'",
        "'speaker_7': 'what's going on as we move forward. This project, I may also want to recommend if if it's possible to establish a committee of oversight one way or another comprised of city council members. That doesn't have to be five.'",
        "'speaker_7': 'It could be three. To look at the progress we're making on this and this project as it moves forward. It appears we're going to be moving forward tonight. It's going to be a defining moment for us on city council.'",
        "'speaker_7': 'There's no question about that. It's going to be defining this for many years to come. It's clear it's going to be one that will stand as a a defining moment for each one of us. It's going to be one that will be remembered for a long time when people walk, walk by the Lincoln Park, go to a'",
        "'speaker_7': 'library, visit city hall and say, you know, that city council in 2014 made the decision to go forward with this project. So there's going to be pressure, pressure that we felt today, pressure that we're going to feel tomorrow.'",
        "'speaker_7': 'But it's a pressure that I'm going to put on the winning team in regards to making sure that this is a civic center complex that is going to be responsive to the community, that is going to be responsive to the needs of the city, that is going to be responsive to the city council and more importantly, to'",
        "'speaker_7': 'the voters of Long Beach, because that's what we're all about. It's about engagement. It's about participation. And that's what we need to have. And I want to welcome and thank you folks who came out and express your views and your ideas and your preferences.'",
        "'speaker_7': 'I also want to thank the Labor for it. Can we now in expressing their views, I know that there was a comment made that saying that time is money. It certainly is. So we want to move forward in that and I don't think that we can delay this any further.'",
        "'speaker_7': 'So I think we need to move forward. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Andrews.'",
        "'speaker_0': 'Yes. First of all, I just want to congratulate both teams in after sitting up in my office, you know, viewing all the speakers. And first of all, I'm so touched by vice mayors at Hoover Dam that just that that really got to me.'",
        "'speaker_0': 'And I thought that was wonderful. You know, the statement you made about Hoover Dam, that is really touching. So I'm going to move on from there and let the individuals know that I am voting for this tonight for my residents in the sixth District and all of Long Beach.'",
        "'speaker_0': 'And because of Long Beach, there's a vibrant civic center for all who enjoy it, because we see that this project in a way to create jobs. And if you know me, ever since I've been here, all I spoke about was jobs.'",
        "'speaker_0': 'Construction jobs and permanent jobs, especially for my district and for the residents I serve. Six District received a huge positive economic impact through an an aggressive employment. The play on the project will help our residents join unions that will help to get other jobs.'",
        "'speaker_0': 'These jobs are not just jobs, but a career. And these careers will support a family, especially for minorities and people who look like my residents. I've been promised this extensive outreach hiring in the sixth district. I'm the city manager, the mayor, and as well as winning team members.'",
        "'speaker_0': 'I will make sure that every moment that this comes back to the council, my promise to my residents will be honored. I want to thank every one of you.'",
        "'speaker_4': 'Thank you. And finally, to close it up with Councilman Gonzales.'",
        "'speaker_8': 'Everyone's ready for us to vote already. I just real simple want to thank you all for being here. Again, the teams to everyone that spoke. I know I've long advocated for local hire. So I think Councilwoman Price's friendly amendment for that, because I know that all of us are committed in some form or fashion to that.'",
        "'speaker_8': 'So just very quickly, thank you very much.'",
        "'speaker_4': 'Thank you. And with that, please go out and cast your votes.'",
        "'speaker_3': 'I'm going to have to the.'",
        "'speaker_1': 'One motion carries eight zero.'",
        "'speaker_4': 'Great. Thank you all very much. Thank you very much. I want to I wanted to just real briefly, I'm going to take a five minute recess, but I want us to give a big round of applause to our city staff who worked very hard.'",
        "'speaker_0': 'On this process. Thank you.'",
        "'speaker_4': 'Five minute recess.'",
        "'speaker_3': 'I not. And. And. And.'",
        "'speaker_0': 'Okay. Jazz 88.1. Freddie Hubbard, a great tune from Freddie First Light, going all the way back to 1971. That's the title track from First Light and Kenny Burrell doing Motown's swing from his blues in around as CD Paul James into the final hour here.'",
        "'speaker_0': 'Got music coming up from Chet Baker will also hear from Stan Kenton right now it is David Ben Wah on member supporting key jazz 88.1. And. Was.'",
        "'speaker_1': 'Gonzalez. Vice Mayor Lowenthal. Councilwoman Price. Councilmember. Mongo. Councilman Andrews. Councilmember Durango. Councilman Austin. Councilmember Richardson. Mayor Garcia.'"
    ],
    "Recommendation to authorize City Manager to execute a Solar Power & Services Agreement and related documents with SunEdison Government Solutions, LLC, for a 25-year term for the purchase of energy produced from solar photovoltaic installations at five potential municipal sites within the City of Long Beach, and any necessary amendments that do not change material terms.   (District 5)": [
        "'speaker_4': 'I'm here. Moving on to item 11, please.'",
        "'speaker_1': 'Item 11. Recommendation to authorize city manager to execute a Solar Power Service Agreement and related documents with Sun Edison Government Solutions District five.'",
        "'speaker_4': 'Can you get a motion move for a second? Okay. There's been a motion and a second public comment, please.'",
        "'speaker_0': 'Yes, very good. You clear the trash. If Jim HANKLA, Jerry Miller or the city manager would not have to ask this question. But given that.'",
        "'speaker_4': '1/2, Madam Quirk, is the timer on in the mic.'",
        "'speaker_0': 'Going to be too short? Okay. Just need some. Given the. Dubious conduct and shenanigans around the electrical pad at Marina Vista Park. What I would like to get specifically is knowing that the five locations for these sites. R will remain within the fifth District.'",
        "'speaker_0': 'And that before any other location is cited, the council person for the district. At least for District three will be notified. If you've done your homework. What? But this is. It's. It's. To project into the future. They're entering into a contract and going to set up solar energy systems at five different locations.'",
        "'speaker_0': 'The there are five now that are set forth in the fifth District. But the way the contract is written, you're going to have the type of conduct that happened in with electrical pad in Marina Vista Park. So I'd like to.'",
        "'speaker_0': 'I'd like to. All this over our head, get a commitment from the city attorney that there will be no other installations unless the council is duly notified. Is there a problem with having that assurance that we're going to expect honesty?'",
        "'speaker_0': 'And integrity and not have somebody try to slip something in. Or will it be the same West of Orleans approach?'",
        "'speaker_4': 'Sure, as you know, that you're not able to ask questions of the council during this time unless they want to ask the question.'",
        "'speaker_0': 'All I'm looking for is an honest person. Is there one here? Let the clock tick and see if there is an honest person here.'",
        "'speaker_3': 'What?'",
        "'speaker_0': 'For the record, Mr. Cole made this it's 930 in the evening on this on the. December the fifth. Excuse me. December the ninth. You get an idea of what the the problem is here. Thank you for making my point.'",
        "'speaker_4': 'Thank you, sir. There's motion on the floor. Councilman Gonzalez, to the question.'",
        "'speaker_8': 'Just had a question for our city management staff. I know that there had been discussions about a local hire component for this, and I just wanted to confirm that there was just a preliminary discussion on this. I don't want to hold this up.'",
        "'speaker_8': 'I just want to ask whether that was a confirmation on your end or not.'",
        "'speaker_11': 'Councilmember I certainly know that there were conversations today between SunEdison and one of the labor groups. Mike, do you have anything to add on that?'",
        "'speaker_10': 'I understand that there is some preliminary discussion going on that may lead to an agreement with this group, though not necessarily a completed this evening.'",
        "'speaker_8': 'Okay. That's all I wanted to know. Thank you.'",
        "'speaker_4': 'Okay. There's a motion. Please cast your votes.'",
        "'speaker_1': '10:00 motion carries seven zero exciting plays. Item 12 Recommendation to authorize City Manager to submit an application for the Airport Improvement Program Grant for Fiscal Year 2015 District five.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-6999 for the East Division Police Substation, award the Base Bid and Alternates 2, 3, 4 and 5 to Robert Clapper Construction Services, Inc., of Rialto, CA, in the amount of $5,617,736, and authorize a contingency in the amount of $498,774, for a total contract amount not to exceed $6,116,510; authorize City Manager to execute all documents necessary to enter into the contract, including any necessary amendments thereto, and adopt and accept Mitigated Negative Declaration No. MND 02-13;  Increase appropriations in the Capital Projects Fund (CP) in the Public Works Department (PW) by $7,063,951; and  Increase appropriations in the Capital Projects Fund (CP) by $226,348, increase appropriations in the General Grants Fund (SR 120) by $132,762, and increase appropriations in the General Fund (GF) by $660,000, all in the Police Department (PD).  (District 5)": [
        "'speaker_1': 'Item 15 Recommendation to Adopt Plans and Specifications Award a bid to Robert Klapper Construction Services for a total contract amount not to exceed 6,000,116. Increase appropriations in capital project funds. District five moved.'",
        "'speaker_4': 'A contribution to Java.'",
        "'speaker_5': 'Yes, I think this is great and long overdue and in the spirit of consistency, I just wanted to, I guess, raise a question to to step in and ask whether or not there's a local hiring agreement in place for for this project.'",
        "'speaker_10': 'Montgomery Councilmember. I don't believe that that was included in the RFP.'",
        "'speaker_4': 'Constable Austin.'",
        "'speaker_5': 'So is there a possibility to do that?'",
        "'speaker_10': 'I at this point, it would require renegotiating with the the bidders. Possibly rebidding.'",
        "'speaker_5': 'Them. What I would just just say in the future and this is a rather large, large project that that understand understanding that for an interest of expediency that we need to move forward but but future and I think we're addressing that through other means anyway that that we would consider this as well because this is a significant'",
        "'speaker_5': 'public works project that will benefit the entire city. And again, we have made a commitment on numerous occasions now, and I've heard from just about every council member, most of us want to see a local preference in terms of hiring for projects in the future.'",
        "'speaker_10': 'Message received. Thank you.'",
        "'speaker_11': 'Mr. Mayor. Councilman, if I can just point out that that's absolutely true. The Council's directed us to do that, and Mr. Miller was earlier in this evening. We're in the process of negotiating that right now. So the Council did directives to come back.'",
        "'speaker_11': 'And I'm hoping in the next 30 to 60 days you'll see a play project before the city council that would allow all projects above $500,000 to be.'",
        "'speaker_0': 'Involved for that. So we certainly would do that.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_11': 'And, Mr. Mayor, one the before we leave the subject, I do want to I see Mr. John Keisler standing back there. I want to highlight John. John is our finance guru in the police department. And he was although Mr. Conway's been incredible getting us here tonight, it was Mr. Keisler who was able to work so wonderfully with'",
        "'speaker_11': 'the police department's budget to guarantee that this facility is all that the police department wants it to be.'",
        "'speaker_10': 'And if I could I'm sorry to follow up with that, Mr. West. I can't overlook Sarah Price, who's in the audience here this evening as well, who's really project managed this through a couple of arduous periods of time.'",
        "'speaker_10': 'So thank you, Sarah, for your efforts as well.'",
        "'speaker_4': 'Thank you, Katherine Mungo.'",
        "'speaker_8': 'It would be. I would be remiss not to thank the police department and the.'",
        "'speaker_1': 'City management staff.'",
        "'speaker_8': 'Not only did we take this project and I think we're financially in a better standpoint than we thought we would be when we originally bid the project. It also is a lead certificate certified facility all within the context of the current.'",
        "'speaker_1': 'Contract before you.'",
        "'speaker_4': 'Thank you, Councilman Ringo.'",
        "'speaker_7': 'Thank you, Mayor. I want to also well, I want to thank Councilmember Austin for bringing up a very important issue in regard to local hires. But I think more importantly, I think I want to bring up the point that there were a number of maybe Whidbey Seabee.'",
        "'speaker_7': 'Enterprise enterprises that applied for this and that want got got appointed. So I want to in the future date, I want to have a report on how many contractors we have out there who are maybe will be the BCB entities out there because I'm not seeing it.'",
        "'speaker_7': 'I'm not seeing it on this report. We talk about diversity. We talk about diversity on this on this council. We talk about diversity in hiring. We talk about diversity in in the city. And I'm not seeing it in contracts.'",
        "'speaker_7': 'And if we're going to affect local hires and we're going to affect providing job opportunities for people who live in Long Beach, people who look who look and live like us, I think we need to hire contractors who have that type of sensitivity.'",
        "'speaker_7': 'And I'm not I'm not I'm not seeing that. So I'd like to perhaps get a report later on, just like I want a report on diversity to bring this forward so we can start addressing how we can go out and find those.'",
        "'speaker_7': 'Maybe we BCB DB enterprises that can do the job that we want to do.'",
        "'speaker_4': 'Do you want to explain what that is for? I there's a couple of customers who may not.'",
        "'speaker_5': 'Know what you're referring.'",
        "'speaker_0': 'To. Okay.'",
        "'speaker_7': 'Minority business, enterprise, we have been in enterprise. I don't know what SB is small, but small business enterprise and.'",
        "'speaker_0': 'There's a disadvantage advantage.'",
        "'speaker_7': 'Business enterprise. And you know, I mean, I think that should be an important aspect of what we look for when we go out and look for contracts. It's not only about the lowest possible bidder, but it's also looking at the types of businesses that we contract with.'",
        "'speaker_0': 'Mr. West. Hello.'",
        "'speaker_4': 'The council was asked for either a public update or some kind of report back on the process, because I think that there's a lot of interest in that. And so, I mean, maybe this is a larger discussion. You and I have talked about this, but I think that we need to have a conversation at the council about'",
        "'speaker_4': 'that process so that everyone understands what it's like. And there's a there's a commitment to supporting, obviously, that that process as well.'",
        "'speaker_11': 'Certainly, we'll come back to you. As you see, every project that we do award has a list on where we have the disadvantaged businesses, minority businesses, and we'll get back to a report on how that some evaluated in the bid process.'",
        "'speaker_4': 'Thank you. There's a motion on the floor. Any public comment on the item? Seeing none. Please cast your votes.'",
        "'speaker_1': 'Motion carries seven zero. Next item item 16 Communication from Mayor Garcia Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Charter Chapter 2.36 relating to the Economic Development Commission. Read an adopted as read Group.'"
    ]
}