{
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Section 2.01.380; and by repealing Section 2.01.390, all relating to officeholder accounts, read and adopted as read.  (Citywide)": [
        "'speaker_2': 'Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code all relating to officeholder accounts read for the first time and laid over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_1': 'This was this was the EOC municipal could change recommendation from last time. There's a motion in a second. Is there any public comment? Please come down. It's going to be very good.'",
        "'speaker_8': 'You click as the address. I very face. This measure. Does not and could never pass the smell test period. Those who have proved it and those who approved bringing this forward now have and will forever more, as long as they are in office, have a target on their back.'",
        "'speaker_8': 'Place their. But the United States Department of Justice, period, it simply does not pass the smell test. And those who voted against this measure in committee are to be commended. Those who voted for it should find the nearest door and leave.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. There's a motion and a second, please. Members, cast your votes.'",
        "'speaker_2': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute any and all documents necessary to enter into a License Agreement with the California Military Department for the property located at 854 East 7th Street.  (District 1)": [
        "'speaker_1': 'Item 17. And then we'll go back to the hearing.'",
        "'speaker_2': 'Report from economic and property development. Recommendation to authorize the city manager to enter into a license agreement with the California Military Department for the property located at 854 East Seventh Street, District one.'",
        "'speaker_1': 'Councilman Gonzales.'",
        "'speaker_6': 'Yes. Do we have a quick staff report?'",
        "'speaker_8': 'Yes. John Keisler, our economic and property development director, can give you the staff report.'",
        "'speaker_0': 'Good evening, Mayor, and members of the city council.'",
        "'speaker_8': 'Tonight's item will allow the city to enter into a license agreement with the state of California, who owns the Armory at Alamitos and Seventh Street. This will allow a temporary use of the facility to install fencing, actually to extend the fencing to further secure the property across the frontage facing Seventh Street so that we can address some'",
        "'speaker_8': 'of the safety and health concerns that occur because the armory uses it only periodically. So this action allows us access to the property. It does also allow us to to install the temporary fence in the near term and extend the permanent fence over the long term.'",
        "'speaker_8': 'And we appreciate your support because once we execute this agreement, it will provide indemnification for the armory and allow us to enter the property once executed. That's the conclusion of my report and I'm happy to answer any questions.'",
        "'speaker_1': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_6': 'Yes. I just want to say thank you, John, and your team. I know that this is a an area that has long been an issue for the neighborhood. It's next to St Anthony's. It's also next to our new combined park.'",
        "'speaker_6': 'So I appreciate your diligence in this. Thanks so much.'",
        "'speaker_1': 'Hey, Councilman, we ringa everything now? Councilman Andrews? Yes.'",
        "'speaker_8': 'I want to thank our councilman, Lena Gonzalez, who's bringing support, because the fact that this is a very important of for safety is concern. And I think it's an excellent idea. And I think our kids are really enjoying also.'",
        "'speaker_8': 'Time is of the essence, but we sure want to see this come up. I'm looking forward to this. And thank you again.'",
        "'speaker_1': 'Great. Thank you. Is there any public comment on this item you're going to hear?'",
        "'speaker_8': 'I think it makes sense to fortify it and make sure it's in excellent condition, given the specter of federal troops being dispatched to Long Beach to help patrol the city. Until we get the crime paradigm and the crime eviscerated and the police department staffed 100%, 100% with professionals, with the overwhelming majority of members of the police department'",
        "'speaker_8': '. Certainly are. But there's a cadre of. An element in there that our fifth columnists that are at war with the policies of Chief Luna and will soon be leaving. So we will probably have in their place because I don't think we can get people trained fast enough, federal troops providing the security that the citizens deserve.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. See no other speaker. Come forward, please.'",
        "'speaker_9': 'Thank you. I was just unaware of the use that will be for this facility. It could be documented somewhere where I could be advised to read about it. Unless you can answer the question.'",
        "'speaker_1': 'Thank you. It's not and there's not an additional use at this moment. It's just securing the site. I believe there's a motion and a second. Members, please cast your votes.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, find that the area to be vacated is not needed for present or prospective public use; and, adopt resolution ordering the vacation of the alley north of Spring Street between Elm Avenue to the east and Long Beach Boulevard to the west.  (District 7)": [
        "'speaker_1': 'Okay. We're going back to the hearing. Item number one.'",
        "'speaker_2': 'Report from Public Works recommendation to receive supporting documentation into the record, conclude the public hearing. Find that the area to be vacated is not needed for present or prospective public use and adopt a resolution ordering the vacation of the alley north of Spring Street between Elm Avenue to the east and Long Beach Boulevard to the West Seventh'",
        "'speaker_2': 'District.'",
        "'speaker_1': 'Okay, great. We're going to go ahead and I'm going to go ahead and have Sast first to the presentation and then we'll go back to staff comment in the public. So, Mr. Modica.'",
        "'speaker_9': 'Thank you, Mr. Mayor. We'll have Sean Comey, the deputy director of Public Works, give the staff report.'",
        "'speaker_1': 'Q Good evening, Honorable Mayor Council.'",
        "'speaker_3': 'This item moves.'",
        "'speaker_1': 'Forward of vacation of the alley north of Spring Street between Elm Avenue and Long Beach Boulevard. The recommended actions tonight are to conduct a public hearing, make a finding that the alley is not needed for public use, and adopt the resolution ordering vacation of the alley.'",
        "'speaker_1': 'Just a real quick summary of the actions that preceded tonight's vacation include a general plan consistency finding by the Planning Commission on December 15th and notice of intent to vacate that was brought before the City Council on March 7th.'",
        "'speaker_1': 'With that, I'm available to answer any questions. Okay, there is a motion and a second I would go ahead and have any public comments first on this item. Please come forward.'",
        "'speaker_4': 'Put it in Mayor Council members. My name is Pedro Blanco. I'm with Current Design. We've been assisting the Salvation Army on this project for a few years. We really are very thankful of the assistance that we have from staff and really appreciate your recommendation for approval.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Brisard.'",
        "'speaker_9': 'I keep referring to the city website for the latest homeless count since it has not been posted to date. I was unable to look at that record, but I couldn't help but wonder with this alley just sitting there and being that the homeless are considered part of our citizen, public and creative cities who are are looking to'",
        "'speaker_9': 'be more progressive in their assistance toward the homeless. Some are using alleys to create seat slates, safe sleep ways they patios lounging areas. Harvey Milk has a park that now has an outdoor office. And I'm wondering for the homeless, could we not find some creative use?'",
        "'speaker_9': 'Where were these people who have been asked now to leave the corridors of the city while we build another civic center? And they've been removed, some of them now wandering who God knows where. Only God knows where these people are.'",
        "'speaker_9': 'And I wonder if anybody spoke for that. And is it too late to say maybe we can take another look at this alley being that the homeless are part of the citizens, some of them job used to hold jobs.'",
        "'speaker_9': 'Some of them are taxpayers whose taxes purchase parks and and help rehabilitate many of our facilities. Maybe we could put outdoor showers there. Could the homeless feel better enfranchised or helped if they knew that? Over on Elm Street there's a shower every day.'",
        "'speaker_9': 'Free, free shower. And then maybe somebody can set up a confession, stand where they can get free food in the alley that can be used for public use. Why are we continuing to act like the homeless are not part of our public when we're making these types of decisions?'",
        "'speaker_9': 'These types. Now we borrow $40,000,000,000 million to rebuild this city. But that vacant lot over there is vacant. It empty and free. And what do we do? Just put a gate up there and close it off. There are volunteers right now who are waiting to work for the homeless, who live right in that area, where if you'",
        "'speaker_9': 'would provide an atmosphere and a place for them to serve every day, you have free people, free employees who will do it for free. Why would you do this and not consider? Hmm. Can the homeless use that alley?'",
        "'speaker_9': 'How can you not think about that?'",
        "'speaker_1': 'Thank you. See no other public comment. I'm going to go ahead and close the hearing as they come back to the council and Councilman Ringa.'",
        "'speaker_8': 'Thank you. This alley has been determined by the my staff has all of the practical uses and it is part of the project for the Salvation Army. So I request my staff, my council to support this motion.'",
        "'speaker_1': 'Thank you. Councilman Mongo.'",
        "'speaker_0': 'Some great projects.'",
        "'speaker_5': 'Thank you for bringing it.'",
        "'speaker_1': 'Okay. Seeing no other comment from the council. There's a motion and a second. Please cast your vote.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay. Thank you. And next up, we have more of our business. So we're going to turn over to item number 16. I'm sorry. Item number 11.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for a Sublease to Lease No. 9351 between Million Air North, Inc., a California corporation, and the City of Long Beach for office space at 4401 Donald Douglas Drive, to house the Engineering, Accounting and Security Divisions of the Airport Department; and  Increase appropriations in the Airport Fund (EF 320) in the Airport Department (AP) by $303,036.  (District 5)": [
        "'speaker_2': 'Report from Long Beach Airport. Recommendation to authorize the city manager to execute a sublease between millionaire north and the city of Long Beach for office space at 4401. Donald Douglas Drive, District five.'",
        "'speaker_1': 'Canada Motion to second in his Motion at a second. Any public comment? Seeing no public comment back to the council. Councilman Andrews Nope. Councilman Austin Nope. Vice Mayor Richardson.'",
        "'speaker_3': 'I'd like to just to get a staff report and if the city attorney could just weigh in on if there's any potential conflicts of interest. Thanks.'",
        "'speaker_8': 'Just Romo can give the staff report for the airport. And then we'd like to hear from the city attorney. Mayor Garcia, members of council. The item before you is a proposed five year lease for office space at Long Beach Airport to help support functions including our accounting group, engineering group and security group.'",
        "'speaker_8': 'We're in dire need of additional space to house these functions that are critical for the airport. The council letter lays out the process under which this lease was developed, including rental surveys and identifying space that was both competitive and convenient for staff.'",
        "'speaker_8': 'Answer any questions you have relative to the lease terms itself. Otherwise, I defer to the city attorney on the other question.'",
        "'speaker_1': 'Mr. City Attorney.'",
        "'speaker_4': 'Mayor, members of the Council, thank you. As you recall, on December 13th, the city council requested the city attorney to seek an opinion from the SPC on this lease. We did so in writing on December 19th and then we have followed up with the PPC since that time and as the date of this evening in this Council'",
        "'speaker_4': 'letter, we have not received any information from the PPC subsequent to the request. Mr. Glen Ray notified the city that he had stepped down from the A.S., the Airport Advisory Commission, and at this time we advise the PPC of his decision to do so, and we are still not received any official word or opinion and have no'",
        "'speaker_4': 'indication from FBC when that might be forthcoming. That being understood, this office, we do not believe that there is a conflict or that this country creates a conflict or is prohibited. We have a similar issue or had a similar issue with a city employee and we received written correspondence from the see that this was appropriate contract to'",
        "'speaker_4': 'enter if the individual did not have or act in his capacity while with the city to process or to approve the contract, the AJC does not receive or these items of contracts do are not presented to the AC.'",
        "'speaker_4': 'So even his sitting on that was not part of the process. So therefore, we believe we can legally move forward with this contract.'",
        "'speaker_3': 'Thank you. Okay, that's fine.'",
        "'speaker_1': 'Okay. There's a motion and a second. Please cast your votes. Motion carries 12, please.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute a contract, and all necessary amendments, including term extensions, with the Department of Homeland Security to receive and expend Department of Homeland Security grant funding for the FY 2016 Port Security Grant Program, in an amount not to exceed $1,125,450, for a period ending August 31, 2019; and  Increase appropriations in the General Grants Fund (SR 120) in the Fire Department (FD) by $250,450 and in the General Grants Fund (SR 120) in the Police Department (PD) by $925,000.  (Citywide)": [
        "'speaker_2': 'Report from Disaster Preparedness and Emergency Communications. Fire and police recommendation to authorize the city manager to execute a contract with the Department of Homeland Security to receive and expend grant funding for the FBI 16 Port Security Grant Program in an amount not to exceed 1,125,450 citywide.'",
        "'speaker_1': 'There's a motion and a second. Any public comment on this item? Please come forward.'",
        "'speaker_9': 'Surely you're sorry. Every time I look at this name, Department of Homeland Security. And I wonder. If this department thinks they can keep this city safe, if God decides it's time to reorganize some things here. I couldn't. I can't help but wonder, do we really believe?'",
        "'speaker_9': 'I don't care how much money you get, grant money or wherever it comes from. When God decides it's time to move the building, rearrange where the ocean flows on the port. On Artesia. Belmont Shore. Heading toward Redondo. None of this here will matter what we have done, how much money we get from the government.'",
        "'speaker_9': 'But thank them. Receive the money. The issue with us in this city is that God is asking you, will you please start acting like I own the world? Will you please give me my due and conduct business in a manner that honors me?'",
        "'speaker_9': 'That's what he's saying. Now, you got some free money tonight. I'm glad. I wonder how much will the homeless benefit from this? They are your first business clientele here. They are the ones there that are outnumbered and undone and underserviced.'",
        "'speaker_9': 'Homeland Security. Really? And all this is for the record. Remember we went entering into Passover now. And on the night of Passover, first born animals and children and families all died at the same time in Egypt over there.'",
        "'speaker_9': 'A place that is part of our world history because God decided it's time for some people who have been held as slaves to let go and fill you in on the Egypt. But you won't listen to me. Long Beach.'",
        "'speaker_9': 'You were in that time frame now. You're in that frame where God is saying, I'm about to show you some things and it will be him doing it. Because you've had people up here telling you, asking you to just acknowledge him and conduct business in a manner that honors him.'",
        "'speaker_9': 'And looking out for the poor in a way that is if it were you, is how you honor him, not the prayers you say at night, not saluting the flag, one nation under God when you're conducting, conducting business on your own.'",
        "'speaker_9': 'Now we are entering the time zone where he is about to move some real estate for real, and it will be him doing it.'",
        "'speaker_1': 'Thank you. Others in motion. Any second. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Thank you. I got five speakers. Can I just have you line up, please? At the front. Dale Whitney. Jim Oberst and Summer Hanson. I think you're all three on the same topic. Then Mr. Goodhue and Ms.. Broussard.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any subsequent amendments with the State of California Department of Health Care Services, to receive reimbursement for allowable Medi-Cal Administrative Activities, in an amount not to exceed $2,250,000 for the period of July 1, 2017 through June 30, 2020.  (Citywide)": [
        "'speaker_2': 'Please report from Health and Human Services recommendation to authorize the city manager to execute an agreement with the State of California Department of Health Care Services to receive reimbursement for allowable medical administrative activities and an amount not to exceed 2,250,000 citywide.'",
        "'speaker_1': 'There's a motion and second public comment on this item.'",
        "'speaker_8': 'Very good. Very briefly. This is something I've had in my mind, because I see this every day and it it is deals with the health issues. At the corner of. The transom at ocean and pine as the shoe get off the blue line and walk toward the convention center.'",
        "'speaker_8': 'There's a sign there that deals with health issues that I think does not represent this city well. And we don't want you know, we want people to have a good mental frame of mind. But that sign lists down anxiety, staph infection, PMS, sciatica, backache, sinus infection and acupuncture here.'",
        "'speaker_8': 'I don't think that's a sign is. Helping engender a positive image of this city. When we people, they don't want to see that or hear that when they come in. They don't want to hear they want to divorce themselves and put whatever problems they may have behind them and so forth.'",
        "'speaker_8': 'So I would suggest relocating that same someplace. Thank you.'",
        "'speaker_1': 'Thank you. There is a motion and a second. See no other public comment. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': '14.'"
    ],
    "Recommendation to declare ordinance relating to a temporary limitation on the establishment, installation, placement, construction, expansion, or issuance of permits for the use of unattended donation/recycling collection boxes or bins in or on any private or public lot in the City; declaring the urgency thereof; and declaring that this ordinance shall take effect immediately, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Thank you. Next item 15.'",
        "'speaker_2': 'Communication from City Attorney. Recommendation to declare ordinance relating to a temporary limitation of unattended donation recycling collection boxes or bins in or on any private or public lot in the city, declaring the urgency there thereof and declaring that this ordinance shall take effect immediately.'",
        "'speaker_2': 'Red and adopted as red citywide.'",
        "'speaker_1': 'CARNEY Public comment on this item. Please come forward.'",
        "'speaker_8': 'I support this one 100%, and it's engendered by the experience we went through. I think it was around the year 2002 when somebody who didn't live in the city, I believe the individual with with goodwill wanted to set up a donation spot in at the entrance to Marine Stadium where people would put couches and chairs and whatever'",
        "'speaker_8': 'stuff they donate. And obviously that would be a blight. And I don't think any neighborhood wants that. There's certain areas. It's certainly things can be put in. No ifs, no answer. No, but. But you don't want to have it in a residential area no matter what district you live in.'",
        "'speaker_8': 'You just have to find the right place for it. Thank you.'",
        "'speaker_1': 'Okay, there's a motion and a second. Please cast your votes.'",
        "'speaker_2': 'Motion carries.'",
        "'speaker_1': 'Okay. Thank you. We've already done 16 and 17, so I believe now we're going to is there any second public comment period?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay. Please come forward.'"
    ]
}