{
    "Recommendation to request a presentation from representatives of the Aquarium of the Pacific on recent and upcoming events, its financial performance and future plans to conserve and build Natural Capital (Nature and Natures services) by building Social Capital (the interactions between and among peoples).": [
        "'speaker_1': 'Communication from Vice Mayor Lowenthal. Mayor Garcia. Recommendation to request the presentation from representatives of the Aquarium of the Pacific on recent and upcoming events. Its financial performance and future plans to conserve and build natural capital by building social capital.'",
        "'speaker_0': 'Thank you. I'm going to turn this over to Vice Mayor Lowenthal.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And I want to thank Dr. Schaeuble for being here as well. It's always informative and inspiring.'",
        "'speaker_1': 'To get an.'",
        "'speaker_3': 'Update from you about the aquarium and its programs. And I'm always impressed by the challenging exhibits and guest speakers covering a host of subjects that are so topical. And I also want to thank your board of directors. I don't know if any of them are here, but your staff and your board as well for maintaining and expanding'",
        "'speaker_3': 'a world class caliber learning institution. Thank you, Mr. Mayor.'",
        "'speaker_0': 'Thank you. So with that, I'm going to welcome we have not only Dr. Schaeuble here, but a longtime chair of the board, board member, leader of the aquarium, which is also which is Mr. Molina. John Molina The whole family's been involved.'",
        "'speaker_0': 'So I think. John, you're going to kick it off. I'm going to kick it off.'",
        "'speaker_2': 'Thank you, Mr. Mayor.'",
        "'speaker_0': 'Vice Mayor Lowenthal and all the council members. I think it's fitting that we get to present on the same day that you honor Hispanic heritage. Councilmember Andrews during this month. Everybody's Latino, don't.'",
        "'speaker_2': 'Worry about it. Our involvement and.'",
        "'speaker_0': 'The Molina family involvement with the aquarium goes back. Actually, before it was built, my father used to go out and watch the construction crew as they built the aquarium and was fascinated and enthralled by it. Unfortunately, he didn't live long enough to see it opened and we became charter members and our interest and love for the aquarium'",
        "'speaker_0': 'continue to grow. So I want to thank you all for letting us be here tonight to give you a presentation was about a year ago that Dr. Schaeuble and I were here last to talk about the aquarium. And I know we have new council members, all of whom have visited the aquarium.'",
        "'speaker_0': 'But I do want to go through a few.'",
        "'speaker_2': 'Things because it is.'",
        "'speaker_0': 'Your aquarium. The board is just the caretaker. But we want you to know what we have done with the city's assets. The aquarium has 1.5 million visitors a year. That makes us the fourth most attended aquarium.'",
        "'speaker_2': 'In the country.'",
        "'speaker_0': 'That is pretty special given all the other activities that folks in Southern California can do from Disneyland to the beaches to the L.A. Zoo, they come here quite a bit. We have 113,000 members and 3 million website viewers.'",
        "'speaker_0': 'So. The city of Long Beach gets a lot of attention through this world class organization. 1.6 million teachers visit us online.'",
        "'speaker_2': 'And we're part of the Coastal American.'",
        "'speaker_0': 'Network of 25 Aquarium. No margin, no mission without the ability to finance ourselves with your help. We wouldn't stay in existence and we are experiencing our second best financial year ever. And that's without a special event like the 10th anniversary of the 15th anniversary.'",
        "'speaker_0': 'We continue to build we continue to get the reputation and the continue to be on solid footing.'",
        "'speaker_2': 'We were just accredited.'",
        "'speaker_0': 'By the Association of Zoos and Aquariums. Not every zoo or aquarium in the country is a member. But in order to be a member, you have to go through accreditation. And this happened earlier this year. And as the executive director said, the use of multimedia and telling the conservation story in the aquarium is unique to this facility'",
        "'speaker_0': '. We have tried we strive to be more than just a place where people can go see fish. We tell a story. We tell a story of people and the environment and the role that the ocean plays in that.'",
        "'speaker_0': 'Award winning. Everybody talks about their award winning this. They're award winning that. We want you to see that we actually are award winning. And here are the awards, TripAdvisor Award, PINNACLE Award for video conferencing programs. The ESRI Award.'",
        "'speaker_0': 'Five International Telly Awards for films. Most people don't know this, but there is a film crew at the aquarium. They do produce their own documentaries. They entered into international competitions. Most of the time they are competing against folks who have much greater budgets and they continually win awards.'",
        "'speaker_0': 'And the finalists at the Blue Ocean Festival and most recently, the Cool Planet Award.'",
        "'speaker_2': 'Which we are nominated.'",
        "'speaker_0': 'For, keeping our fingers crossed. I think the award will be announced here shortly. We also recognize that we have a big impact on the community. And with that comes a special obligation, economic impact as studied by, I believe it.'",
        "'speaker_2': 'Was Cal State, Long Beach.'",
        "'speaker_0': 'External firm, $60 million economic impact to Long Beach, 150 million to the county. We have a huge volunteer staff. 1400 volunteers contribute 115000 hours. People come to the aquarium to volunteer because they love it. My daughter our daughter was a volunteer in the summer of 2014.'",
        "'speaker_0': 'She came back in 2015. She loved it so much and now she's going to do volunteering during the school year. We also have quite an educational program. 165,000 educational visits. Of those, about a fifth are free. So we want to make sure that we give back and we have life programs that are piped into a military children's'",
        "'speaker_0': 'hospital and that children love visiting the aquarium virtually. And they especially love the Molina Animal Care Center so they can see how the sick animals are taken care of and see that they're taken care of with love just the way they are at Children's Hospital.'",
        "'speaker_0': 'Let's back up here. And we have a special fondness for our friends here in Long Beach. So there's 50% off coupons to residents. There are you get a pass to the at the library. We have free nights hosted by all of you folks.'",
        "'speaker_0': 'I don't think there's a single council member here that doesn't have a free night and it's always a wonderful time. And Free Shark Lagoon nights for for residents. So again, I want to thank you all for your continued support.'",
        "'speaker_0': 'We continue to grow the reputation of the aquarium and by association the reputation of Long Beach or vice versa. And with that, I would like to introduce my good friend, our CEO and President, Dr. Jerry Schaeuble.'",
        "'speaker_2': 'We're just going to see it's done. Let's see what just happened. Oh. All right. This is in response to the mayor's mandate to make Long Beach a model of a climate resilient city. Over the last nine months, we've been engaging experts from across the country on different aspects of climate change to determine which of those events are'",
        "'speaker_2': 'most important to Long Beach. And the list starts with drought and then hot spells, sea level rise and coastal flooding, deteriorating air quality. And we've been looking at options to reduce the vulnerability of Long Beach and particularly of populations at risk to those different threats.'",
        "'speaker_2': 'We have a citywide education and outreach program that's going to be done in collaboration with Cal State, Long Beach Professors Wade and Ingrid Martin. They have about 35 MBA students, all of whom are mid-career managers in Long Beach businesses.'",
        "'speaker_2': 'They're going to get to the business community and then we're going to get to the not for profit community and to the general public. And we're forming a partnership with four other cities that have signed the Compact of Mayors, all of whom have aquariums that are part of the Noah Coastal Ecosystem Learning Center Network.'",
        "'speaker_2': 'And we're also, as you. The city is part of this NRC study. Pathways to Urban Sustainability. The NRC is the National Research Council. It's the operating arm of the National Academies of Sciences. It was established by Abraham Lincoln to shorten the time between advances in science and the benefits to society.'",
        "'speaker_2': 'And we will be leading a panel loaded, Ezra, on Coastal Resilience next month. Great cities have great cultural institutions. In the Aquarium of the Pacific is our city's best opportunity to have a world class cultural organization. After only 17 years, it ranks number four in attendance.'",
        "'speaker_2': 'It has the most diverse attendance of any aquarium in the country. That wasn't true ten years ago, but we've worked hard to make that true. And not only do we bring the diversity there, we work hard to build social capital because that's when the society benefits.'",
        "'speaker_2': 'It's the most distinctive aquarium in the country because of its combination of live animals and media and technology. And our goal is to have it become the most distinguished and distinctive aquarium in the world. And as soon as Pacific visions is complete, we will have achieved that goal.'",
        "'speaker_2': 'And we thank you for your support, because we couldn't have done it without you. Once it's expanded, the steady state attendance, we expect, will be at least 1.8 million a year. That's a 20% increase over what it is now.'",
        "'speaker_2': 'That will be very important to all of the stores down in the pike and it will be important to Long Beach. In the first couple of years, we expect the attendance will be 2 million. There's where we are.'",
        "'speaker_2': 'And since this slide was made, the gifts that have been pledged, that's increased from 29 million to 30 million. And if you look over at the far right, the 7 million in foundation grants, that's about as close to being certain as anything is in life.'",
        "'speaker_2': 'So we think that we're in pretty good shape and we're still we're working hard to complete this. These are a few of the things that have happened. You recognize some of the people in there. Betty White government. Lieutenant Governor Gavin Newsom with Mario Molina.'",
        "'speaker_2': 'And down in the right hand corner, Carmen Diaz. And I think if we could play a very short video now that Carmen Diaz made for us.'",
        "'speaker_1': 'Why should we care about the ocean? Well, because the ocean takes care of us.'",
        "'speaker_3': 'We are all connected at.'",
        "'speaker_1': 'Sea, from the tiniest plankton to the largest marine mammal. We are all part of one living earth system. Take a look at these plankton. These microscopic algae are the most abundant form of phytoplankton and make up an essential part of the food web.'",
        "'speaker_1': 'Even more importantly, they create most of the oxygen we breathe. And after they bloom and die, well.'",
        "'speaker_6': 'The plankton rain down to supply nutrients. Even the largest animal on the planet, the magnificent blue. Well, depends on plankton.'",
        "'speaker_1': 'The food web that connects these creatures is only one example of the many complex systems that help sustain life on Earth, even on land. What you do in your neighborhoods by recycling, avoiding harmful pesticides and not littering. Help sustain a healthy marine ecosystem because gutters.'",
        "'speaker_6': 'And drains make their way.'",
        "'speaker_1': 'To the ocean. Eventually, from a hurricane gaining.'",
        "'speaker_6': 'Force in the Gulf of Mexico to the mysterious.'",
        "'speaker_1': 'Hydrothermal vents found.'",
        "'speaker_6': 'At the deepest parts of the ocean. It's the conveyor belt that drives ocean circulation.'",
        "'speaker_1': 'Across the entire globe. The Earth's systems.'",
        "'speaker_3': 'Are interconnected.'",
        "'speaker_1': 'Complex and dynamic. We depend on these complicated systems for the oxygen we breathe, the food we eat, the water we.'",
        "'speaker_6': 'Drink, and the energy we use. We need to.'",
        "'speaker_1': 'Understand how our actions affect the planet, which is why.'",
        "'speaker_6': 'We need.'",
        "'speaker_1': 'Organizations like the Aquarium of the Pacific to educate the public and to inspire action. If you surf.'",
        "'speaker_3': 'Dove, snorkel.'",
        "'speaker_1': 'Swim, or just enjoy going to the beach like I do, you know how beautiful our oceans. But our ocean is changing. And it's up to us to create a better future for all people and the environment.'",
        "'speaker_6': 'That we all depend on.'",
        "'speaker_1': 'That's why I'm asking you to join me in supporting the aquarium's expansion. The Aquarium's Pacific Vision's expansion will engage audiences in new and creative ways. The Aquarium's Pacific Visions wing will use innovative technology, immersive theater experiences and live animals to share the most important ocean and environmental stories of our time.'",
        "'speaker_1': 'This project will help educate everyone about the challenges we face and the inspiring solutions that are possible. The aquarium is more than just a place to see beautiful sea creatures. It's a resource for all of us to learn about our ocean planet.'",
        "'speaker_1': 'The aquarium has gained distinction by bringing together stakeholders scientists, policymakers, entrepreneurs, environmentalists and artists.'",
        "'speaker_3': 'To explore complex.'",
        "'speaker_6': 'Contemporary issues.'",
        "'speaker_1': 'And to develop alternative pathways to the future. We've only got one planet.'",
        "'speaker_6': 'It's more than 70% ocean. And it belongs to all of us. I hope you'll join me by supporting.'",
        "'speaker_1': 'The Aquarium of the Pacific. Every gift truly has a difference.'",
        "'speaker_3': 'We're all connected and we're depending on you. Thank you so much.'",
        "'speaker_2': 'We have had a great partnership with this. We look forward to continuing that partnership to make Pacific visions come true. We will file a building plan with the city in the first quarter of next year and we expect to break ground about 12 months later.'",
        "'speaker_2': 'And it's an 18 month project, so we hope you'll all be there when we have the grand opening. Thank you very much.'",
        "'speaker_0': 'Thank you. Thank you, Dr. Schubert. I have a couple of folks who want to say a few words. Let me let me just also just thank Dr. Schaeuble and John and the whole aquarium team that's here. I think as the council is aware, the aquarium has embarked on a pretty ambitious climate change and climate resilience study on'",
        "'speaker_0': 'behalf of the city of Long Beach. And they've really gathered some of the top thinkers and scientists and minds from across the country, including from our federal government, to put together a report on ensuring that Long Beach is is a climate resilient city.'",
        "'speaker_0': 'And that report will come to the council, we expect could be December, could be January. But as they finish their work, we expect to have Dr. Schaeuble and his whole team before this body to present that report to this council, which I think will be very instructive, very important.'",
        "'speaker_0': 'And really, we are very thankful to you and to the board and the team for taking on this this challenge, by the way, on much of on their own dime. Might I also add on behalf of of the city of Long Beach.'",
        "'speaker_0': 'And so thank you for doing that as well, Councilwoman Mongo.'",
        "'speaker_1': 'Thank you. The annual visit for council officers to take people to the aquarium has been a very rewarding experience. Oftentimes, the fifth District seems so far from downtown, but this year we were proud to almost reach 900 attendees for one night, and that's record setting for the district.'",
        "'speaker_1': 'So thank you to what you provide. Thank you for for opening your doors to the Special Olympics. Councilwoman Gonzales and I really enjoyed an evening with our international competitors. And they're the way that you see the world through the eyes of children is just so amazing.'",
        "'speaker_1': 'So thank you for that opportunity and giving them that education at such a young age.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_6': 'Thank you very much. I, too, want to thank you for the presentation this evening and especially want to thank you for allowing the aquarium to serve as a place where the residents of this city and outsiders can congregate.'",
        "'speaker_6': 'I know that the vice mayor and I hosted a community evening and you allowed us to invite residents from both of our districts as well as residents citywide. And it was a huge success. We look forward to doing that every year.'",
        "'speaker_6': 'So I want to thank you for that. The aquarium offers so many educational programs for people of all ages and hands on activities and lectures by leading scientists. These programs and all of the different experiences that the aquarium provides gives us opportunities to develop a deeper understanding into ocean science and learn more about our planet.'",
        "'speaker_6': 'I know I myself have had the opportunity actually very recently to meet with Dr. Schaeuble regarding some of the issues that are really global issues, but will have an immediate impact on on my constituents in the area that I represent.'",
        "'speaker_6': 'And actually, as a result of that conversation, I do need to speak with the mayor and city management about really taking a closer look about the around those issues and using the expertize that we have in-house to make sure that we're being proactive in terms of some of our more vulnerable communities on the water here in Long'",
        "'speaker_6': 'Beach. So I want to thank you for being here for the impressive presentation. You guys do amazing work. The most important thing that I think that you do and that you do very well is outreach and sharing your efforts with the community.'",
        "'speaker_6': 'I think that there are a lot of people who think of the aquarium as a place to visit for the day. But you do so much more and you do so much to educate each of us. And through that, we educate our residents about what you do.'",
        "'speaker_6': 'So thank you. Thanks for being here and thanks to the vice mayor and the mayor for putting this on the agenda tonight.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_6': 'Let's say my congratulations to all of you and the Molina family. Every time I'm listening to the radio or I'm I'm watching TV, the aquarium pops up and I become so very proud of our city to hear of the aquarium and also the Molina animal care space.'",
        "'speaker_6': 'And it's just a really great reminder of how amazing our city is and what great work you all are doing. So thank you so much.'",
        "'speaker_0': 'Thank you, Councilman Tauranga.'",
        "'speaker_2': 'I too, want to add my voice to in gratitude to the aquarium. You're much more than just about paying rent seals. You're about learning. You're about research. I had the opportunity to participate in one of your workshops where council member Congressman Lowenthal presented a workshop on global warming, and she was a very integral, important part of that'",
        "'speaker_2': 'presentation. I was here as a member of the Coastal Commission, but at the same time it's something that brings to the community and your access to the community is absolutely amazing, wonderful. And it's a footnote. I'm going to have my seventh District narrative choir tomorrow night.'",
        "'speaker_2': 'So looking forward to seeing you there.'",
        "'speaker_0': 'Thank you. Thank you, Councilman Richardson.'",
        "'speaker_7': 'Thank you, Mr. Mayor. And Dr. Schaeuble, Mr. Molina, your whole team. Thank you all for this presentation and a great presentation. It was. I believe that this this is a tremendous asset for our city. And I think it's great that you ensure that every part of town understands that this is our aquarium, from the mobile aquarium to'",
        "'speaker_7': 'the district nights. I got to tell you that, you know, people from all over Southern California come come out when we have our free night at the aquarium. It's not just the people in your district. It's hard to control it.'",
        "'speaker_7': 'People want to come out and see that aquarium. It's one of the one of my favorite things to do as a family in Long Beach is to attend the Aquarium Pacific. Then go probably eat what? I shouldn't eat bubble gums, but that's that's me.'",
        "'speaker_7': 'And so I wanted to just just also thank the sponsors of this vice mayor and Mayor Garcia for bringing this forward. So you do have an ally and a friend here in the ninth District. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Andrew.'",
        "'speaker_4': 'Yes, thank you, Vice Mayor. I also would like to thank Dr. Schaeuble and Mr. Merlino and your staff, because the fact that I just want to take the time to tell you how much we enjoy working with the Pacific because it's such a positive impact and you've made our city a landscape.'",
        "'speaker_4': 'Of course, my favorite event is the sixth District United Aquarium. And each year is is it's getting better and better because we had more than 900. We had 1300. So I was just counting that it happened to come up.'",
        "'speaker_4': 'But but the biggest part about all of that, I was the wonderful part about it was my daughter got married in Yokohama. So it's kind of happy to get rid of her. So. But thank you again.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Thank you, Councilman.'",
        "'speaker_8': 'Super nice. Okay. Thank you, Mayor. And thank you very much for the presentation. Really enjoyed it. And I'm looking forward to hosting my very first aquarium night. And for fourth district residents out there within the sound of. My voice.'",
        "'speaker_8': 'It's no. November 5th at 6:30 p.m.. So contact our office. 570444, four. Thank you.'",
        "'speaker_0': 'Thank you. And Councilman Austin.'",
        "'speaker_7': 'You have to learn to queue up a little sooner because they say all that I want to say. But I did appreciate the presentation. And the aquarium is certainly certainly an icon here in the city of Long Beach has become one.'",
        "'speaker_7': 'It is something that many of our tourists look forward to going to many people who don't know Long Beach, they know of the Long Beach Aquarium. And as far as the district nights are concerned, I look forward to doing those every year.'",
        "'speaker_7': 'We we have kind of cornered the market on Halloween. And as a result, over 5000 people show up to our aquarium night each year. And we are able to to have a great opportunity for families to come together.'",
        "'speaker_7': 'And so thank you again for all that you do. Thank you.'",
        "'speaker_0': 'Thank you. And thanks again for for all you do. I've always said that the aquarium is not just a tourist attraction. The aquarium is an education institution. It is a cultural institution. It's a place that does research, that leads thinking, that promotes environmental stewardship.'",
        "'speaker_0': 'And it's great to have one of the best scientists leading that institution as well. And Dr. Schaeuble, so think. Thank you, Dr. Schaeuble. And I see a lot of the aquarium workers and folks here, too. So thank you, guys, for for all the hard work you guys do a great job all the time.'",
        "'speaker_0': 'Thank you. Is there any public comment on this item? Seeing nonmembers, please cast your votes on receive and file.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you and thank you all again. It was a great presentation. Appreciate it. We're going to be moving on now to the next item we're going to do item 23. This is Madam Clerk.'"
    ],
    "Recommendation to request City Manager to report on any past discussions, memorandums, codes, ordinances, and regulations on the matter, as well as submit recommendations that would ban or limit long-term oversized vehicle parking citywide.": [
        "'speaker_0': 'Thank you. And just because I think there's a few folks here for this item, I want to make sure we hear the item on the oversize vehicles, the RVs, which I believe is item seven. So if I can have Madam Clerk, please read item seven.'",
        "'speaker_1': 'Communication from Councilman Price, Councilmember Supernormal Councilwoman Mongo recommendation to request the city manager to report on long term oversize vehicle parking and submit recommendations that would ban or limit long term oversize vehicle parking citywide.'",
        "'speaker_0': 'Thank you. I'm going to now turn this over to the makers of this motion. I believe Councilwoman Suzy Price would be first.'",
        "'speaker_6': 'Thank you very much. I want to thank my colleagues, Councilwoman Mango and Councilmember Super now for signing on to this item as well as my other colleagues for entertaining this discussion this evening. This conversation is not new, and perhaps it's long overdue.'",
        "'speaker_6': 'The number of oversize vehicles we have, in particular recreational vehicles on city streets is a public safety, quality of life environmental issue that has an impact citywide. City Council offices have been contacted by several community groups and citizens regarding the parking of oversize vehicles.'",
        "'speaker_6': 'Constituents report that vehicles are parked in front of their homes and businesses for weeks or even months at a time, taking up valuable parking spaces, blocking view corridors and limiting access to driveways and alleys. In many cases, the occupant is illegally living inside the vehicle, although that is not always the case.'",
        "'speaker_6': 'Additionally, residents have observed several instances instances of individuals disposing waste from vehicles into stormwater drains, as well as reports of portable gas generators being used as a power source. Cities such as Lakewood, Paramount, San Diego, Bellflower and Torrance have imposed citywide bans on oversize vehicle parking.'",
        "'speaker_6': 'It's not just RVs that are an issue in this city. Boats, boat trailers, jet skis and motor homes advertising for various products are also an issue. I think it's very important moving forward in regards to this particular item for us to have an education on this issue as it's been presented to council before, if at all it'",
        "'speaker_6': 'has been presented to council before, and then some options in terms of how we could limit some of the issues that we've seen or mitigate some. So what are some of the options that would be available? Obviously, a city wide ban might be available, but are there other options that might be available that could eliminate some of'",
        "'speaker_6': 'the issues that we've discussed? I have a few questions for staff, and I'm not sure if staff is is prepared to answer these. And if not, maybe when the report comes back, the answers could be incorporated. Do we know how many streets in the city are currently signed for no oversize vehicle parking?'",
        "'speaker_2': 'I think we'd have to come back with those answers.'",
        "'speaker_6': 'And when you come back, is it possible to provide maps showing areas in the city where oversize vehicle parking is problematic?'",
        "'speaker_2': 'Yes, we certainly could.'",
        "'speaker_6': 'And also if there if staff could provide some recommendations on what constitutes a commercial vehicle in terms of height and length dimensions and weight, that would be helpful.'",
        "'speaker_2': 'We could certainly do that.'",
        "'speaker_6': 'Thank you. Again, this is merely asking for some information and data so that we can move forward from there and make the decisions that we think are going to address some of the issues that have caused problems for some of our residents.'",
        "'speaker_6': 'And, you know, a lot of people have reached out to our office in the last few days saying, you know, what about when we want to load or unload our RV? Certainly any recommendation that that comes back would hopefully include some reasonable provisions to allow people to actually use their RVs and be able to load and unload'",
        "'speaker_6': 'them. But we're we're really the heart of it here is long term parking over a period of time where it appears there's no other storage solution other than parking it on a residential or commercial corridor. So thank you.'",
        "'speaker_0': 'Thank you so much, Councilman Mongo.'",
        "'speaker_1': 'Over the last 18 months because this discussion started before I was sworn in to council. We've come up with some short term solutions in terms of eliminating the oversize parking on certain streets, and a lot of neighborhoods get concerned.'",
        "'speaker_1': 'Many of our much of our district borders a city that has banned RVs. And so we do have that overflow. We actually had the police department win ticketing these vehicles and our scanning their license plates identify how many were from within the city and how many were from outside the city.'",
        "'speaker_1': 'We have had numerous complaints related to individuals living in these RVs, and as we've tried to find resolutions, the cadre of RVs continue to move through the city. Your neighbor who has an RV that they prepare to go on a trip.'",
        "'speaker_1': 'Permits associated with residents, I think are a great idea that we need to make sure is available and being able to exercise our right to own vehicles and go on vacation and enjoy the habitat that we have around us in ability to go take our snowmobiles or our water crafts or RV camping and experience nature.'",
        "'speaker_1': 'And within that, to still protect the next door neighbor, the next door neighbor who can't get out of their driveway because they can't see because that RV just doesn't fit exactly in that that usable space or the neighbor who we've in many parts of our district, we've had to paint the curbs on the corners red so that'",
        "'speaker_1': 'we can see the stop sign that an RV could have blocks before. So we've put in a lot of No six foot and over parking near a stop signs. But I think that it's time that we look for a city wide solution.'",
        "'speaker_1': 'And so I appreciate the residents that are here from the fifth District who have been working through this item with us over the last 18 months. And I look forward to some interesting and encompassing alternatives from our city staff.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Councilwoman Gonzalez.'",
        "'speaker_6': 'I want to thank Councilmember Price, Mango and Councilmember Super Na for bringing this forward. I think this is a great item to just look into the research of of what this could be and manifest in two. And I think it is.'",
        "'speaker_6': 'I know in the West Side specifically, we've had many issues. A lot of our business owners have complained because there are RVs, oversize vehicles blocking their their place of business. And then what results is trash? You know, sometimes urination, other things that are a major issue for those business owners in addition to some other residents in the'",
        "'speaker_6': 'Willmore who've also complained. And it's just become a real big problem. I know in the Magnolia Industrial Group we've had to put up signs in certain areas and that only does so much to say that you can only park here for a certain time.'",
        "'speaker_6': 'And I think we've had at one point we had no overnight parking in one area, but a lot of the businesses were impacted because they do have overnight employees. So it becomes an issue. And I think Lakewood does have a really good plan in place.'",
        "'speaker_6': 'I, I know some time ago we looked into that and how that would work out here in Long Beach. So I just want to reiterate that it'd be great to look really look into Lakewood and their permitting system.'",
        "'speaker_6': 'I think they have it down pretty well. But thanks so much for this item.'",
        "'speaker_0': 'Thank you. Next up is council member Richards.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Thank you, Councilwoman Pryce. And co-sponsors for this. So I'm going to rise in favor. I think it's definitely something to look look into. I think across town, there might be different issues, but still issues that warrant study and review around oversize vehicles.'",
        "'speaker_7': 'I can name very different stories in my neighborhood, in other neighborhoods where, you know, you might have vagrancy or homeless homeless folks who might rent rent an oversize vehicle or camper for hours or for a night. And it creates major issues.'",
        "'speaker_7': 'One thing I would say is I think even though it might they may it may be a city wide issue. It's very different for different portions of town. So whatever recommendations come back, I like that we ask for like a hotspot map that allows us to have localized solutions.'",
        "'speaker_7': 'I can think of an example where we had a parking circumstance, we were against a different city and there was construction happening in that city impacted us and it was too big of an issue to address our preferential parking ordinance.'",
        "'speaker_7': 'We created something very different that allowed us to move around with flexibility locally. So whatever comes back, I hope it allows us to be to have a tailored approach for these neighborhoods that may have very different issues, but all related to the same the same impact.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Supernova.'",
        "'speaker_8': 'Thank you. I just wanted to request the staff that they engage. The Cal State University, Long Beach Police. University police. My staff and I met with the university on Friday and actually spoke to President Connelly on Saturday about this topic.'",
        "'speaker_8': 'And they have some very interesting intel on this subject, and I think we should get their input. Thank you. We'll do that.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. I'll be really brief. I'm going to also support this. I want to thank you for bringing it forward. This this issue does we hear from our constituents all the time. It serves as a nuisance issue in many of our neighborhoods citywide.'",
        "'speaker_7': 'I'm just I just want to get some clarity on the the. The definition of over oversize vehicles. Are we talking about just RVs or are we talking about boats?'",
        "'speaker_6': 'Well, in terms of the item, we're asking staff to come back with a definition of what a commercial vehicle size height would would be based on other ordinances. But the problem really has stemmed from not just RVs, but boat storage and things like that.'",
        "'speaker_6': 'So it's multiple commercial vehicles.'",
        "'speaker_7': 'And do we know and just just out of curiosity, how many RV parks we have in the city of Long Beach?'",
        "'speaker_2': 'We'll come back with that information.'",
        "'speaker_7': 'Great. I would love to have that. And I'd also look at like to look at designated areas in the city where we could possibly designate areas that would not be impeding on neighborhoods and this quality of life for our residents and also for us to be mindful that these are these are oftentimes one step above homelessness.'",
        "'speaker_7': 'And they are homes for many, many, many folks who use them. So thank you.'",
        "'speaker_0': 'Thank you. Any public comment on this item? Please for. May we come forward and just make sure you say your name. And for the record, please, on the mic. Thank you.'",
        "'speaker_2': 'My name is Robert Cornwall. I live at 1920 Lees Avenue and the 15th Street, a street that runs north and south and and tees into a street called Fair Brook that runs east and west. The 17 homes on Lee's Avenue travel north to Fair Brook for access to Studebaker Road.'",
        "'speaker_2': 'The left hand turn coming from Lee's Avenue and approaching Fair Brook is immediately confronted. With a huge boat and trailer on the north west side of Hare Brook on the turn. This boat and trailer is 42 foot long, nine foot wide and 11 four inches high.'",
        "'speaker_2': 'Give or take to ensure they're on all my measurements. This vehicle at 6913. Fair Brook has been parked. That is stored. In front of this house for several years. It is seldom used for fishing. It's a large oceangoing vessel and has moved every week to Studebaker Road to avoid Friday sweepers.'",
        "'speaker_2': 'The boat is not hooked up to the three or 4 to 3 quarter ton tow truck most of the time. And on the opposite side of the street, on Fair Brook, right across from this boat, there is always a car parked directly on the other side.'",
        "'speaker_2': 'So that makes it very difficult to pass safely. We're asking the council to address the problem of parking storage, if you will, of such oversight vehicles in our area and possibly in other areas of Long Beach. And we're extremely happy to have read the press telegram.'",
        "'speaker_2': 'So you felt it was an important enough issue to discuss? The existing Long Beach code that we have seen on Stearns Avenue, which is a major contributing street that comes off of Studebaker Road and on other streets that like I think at Poitiers, they have a sign on this that has a municipal code ten, dash 22, dash'",
        "'speaker_2': 'oh 70, and it says that any vehicle 85 inches high, 80 inches wide and 20 feet long, that exists on other Long Beach residential 30 foot streets such as patios. Okay. So. The odd thing about it, when we as neighbors asked the owner of the boat why he stores this vehicle on the street, he has said he'",
        "'speaker_2': 'has a special permit. Well, I don't know what a special permit would be for a vehicle. You know, that is that wide, that high and that long.'",
        "'speaker_0': 'Thank you, sir. Time is up on the clock. Thank you very much. No, thank you very much. Next speaker, please.'",
        "'speaker_3': 'No shorter than he is. Good evening, honorable mayor and members of the council. And I would like to start off with thanking Suzy Pryce and Darrell, Sabrina and Stacy Mungo for bringing this issue forward to this council. This has been an ongoing issue, and Stacy has worked with our district for quite some time now.'",
        "'speaker_3': 'My name is Sherrie Perkins, and my husband and I have lived at 5255 East Wardlow Road. Well, probably for some of you were born, but we've been paying taxes for 47 years. When we first bought the home, it was a fixer upper.'",
        "'speaker_3': 'And we have worked very hard to make this a beautiful home. And I don't want to cry. I'm not trying not to. But it's very upsetting when you have these homeless people. And I agree with Senator, Counselor, Mr. Richardson that they have a problem, too.'",
        "'speaker_3': 'Okay. And this should be addressed as well. So when you bring your manager here and try to get some information, I would also recommend that you look at Huntington Beach as planned. They have an outstanding plan that they have put into place and it's working just fine.'",
        "'speaker_3': 'I would also recommend that you look at Los Angeles plan for the homeless that have been displaced because of their codes and try to work this thing, this whole issue as a whole package. But my special interest is Wardlow.'",
        "'speaker_3': 'Down the street where I live, there is a golf course, skylands golf course. And on both sides of the street there were at least 25 RVs, vans, trailers and different vehicles that have been making this their permanent home.'",
        "'speaker_3': 'They bring out their look. I want to paint a picture in your mind because it's hard to visualize this. You have. People living inside these homes with the curtains drawn and beware of the dog signs on the side.'",
        "'speaker_3': 'They have their barbecues set up, their lawn chairs set up in the evenings. They cook their meals, they watch TV inside in their comfort, and meanwhile, enjoying this beautiful golf course that we have. The rest of the neighbors are very fed up with this type of behavior.'",
        "'speaker_3': 'And recently I've made a study with some of the neighbors to see how they feel about it. And we seem to all be in agreement that something has got to be done about this. This has been going on since 2008.'",
        "'speaker_3': 'Before most of you people were involved with this at all. And as I said, we're pretty fed up about the whole thing. This is a safety issue. I'm very concerned about the golfers that try to cross the street there with all these trailers and RV park.'",
        "'speaker_3': 'People can't see them as they're trying to cross. There's two pedestrians in.'",
        "'speaker_0': 'Their type times. Yes.'",
        "'speaker_3': 'Okay. Thank you. Can I ask a question?'",
        "'speaker_0': 'Time is up. But what I will do is we will have some come over here to the side and we get your question answered.'",
        "'speaker_3': 'Okay. Okay. Thank you very.'",
        "'speaker_0': 'Much. Thank you very much. Mr. West, can we have someone go talk to this lady? Thanks, Miss Amy Borek will do that. Okay, sir, please come forward. Hi. How you doing?'",
        "'speaker_8': 'I'm Brett Lewis. I'm a fifth District resident, but I'm also glad to hear that this topic's being raised and kind of addressed. I'm kind of looking at it as like a two piece, maybe people with truly recreational vehicle that just aren't paying to have it stored.'",
        "'speaker_8': 'But there is a large amount I see of people on the verge of homelessness living in these RV's and just being able to look at it that way and addressing the situation. I can speak from having our business on the outer traffic circle.'",
        "'speaker_8': 'We deal with a lot of water thefts. If you kind of go when all the everyone's closed down or you come in when you're not really supposed to be working, there's a line, well, pots, pans, whatever, being filled with water.'",
        "'speaker_8': 'I mean, coming from Oregon, I feel for the people there. It's like something where we're contacting the police department about and stuff too. But I imagine if it's happening with us, probably where they're congregated, other places, there's probably a large amount of water theft to that business owner that they can see on their bills, too.'",
        "'speaker_8': 'So I think it'll be somewhat of a complicated issue in a way of the different circumstances, why the vehicles are there. But I just want to thank everyone for taking it under consideration, looking into it more.'",
        "'speaker_0': 'Thank you very much. Seeing no other public comment, take this back to the council. Councilman Mongo.'",
        "'speaker_1': 'I want to thank the residents who came out today and spoke. And I particularly want to thank Cheri because as a neighborhood leader who's involved in so many things in our community, I think that you've done an excellent job of prioritizing.'",
        "'speaker_1': 'Within your neighborhood association, I remember when we met. Your community had several issues that we needed to address. And one by one, through a community who is engaged together, we have come up with collaborative solutions. And I know that we can find that for this as well.'",
        "'speaker_1': 'And we want to make sure, as Councilmember Richardson and Councilmember Austin mentioned, that we're not just finding a solution that moves the issue. And I know that you and I have talked a lot about that because the issue started on Lakewood Boulevard and then it moved to Wardlow and then it moved to Studebaker.'",
        "'speaker_1': 'And as these vehicles move across the city, we're not finding a city wide solution. And so I think we've come to that time where where we're going to be able to get there. So thank you for your patience and your diligence in maintaining a community that's engaged on our issues.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. With that, we have a motion in a second. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, adopt resolution; and authorize City Manager to execute an agreement with Bixby Village Homeowners Association providing for enforcement of traffic regulations on private streets in Bixby Village with easements for public access for the following three streets: North Greenway, South Greenway and Avenida de Castillo.  (District 3)": [
        "'speaker_0': 'Thank you. We're going to do the two hearings and then go on to the regular agenda. I know it's been a long meeting. So what have you hearing? Number 2/1, then hearing number one. Then we have public comment and the agenda.'",
        "'speaker_0': 'So hearing item number two. Actually public comment. I think I've only got one member of the public, but we'll do that one right after the two hearings. Hearing item number two, please.'",
        "'speaker_1': 'Madam Court report from Public Works and Police Department recommendation to receive supporting documentation into the record, conclude the hearing, adopt resolution and authorize the city manager to execute an agreement with Bixby Village Homeowners Association providing for enforcement of traffic regulations on private streets in Bixby Village with easements for public access for the following three streets North Greenway'",
        "'speaker_1': ', South Greenway and Avenida de Castillo, District three.'",
        "'speaker_0': 'Thank you. I'm going to turn this over now to staff.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Members of the council, the staff report will be given by our Malloy and our.'",
        "'speaker_4': 'Director of.'",
        "'speaker_7': 'Public Works, Honorable Mayor and Council Members. Basically, the item before you is a hearing to allow a private homeowners association with private streets to come and have a contract with the city for us to enforce truck traffic enforcement on those private streets.'",
        "'speaker_7': 'The homeowners association had a meeting in in September of 2014, and they concluded that they wanted to get into this contract with the city of Long Beach. They contacted us in October of 2014. And we have conducted our studies.'",
        "'speaker_7': 'And we came to the conclusion that it's feasible to allow streets that are contiguous with other public streets, and they don't have gated gates that distinguish the private street from the public streets. To have this this provision. So the item before you has that the staff has has concluded and has three provisions in there that for this'",
        "'speaker_7': 'to go forward, the homeowner association has to agree that all traffic control devices shall comply with California vehicle code and will be reviewed and approved by our city traffic engineer. The cost of these new signs and striping changes will be borne by the Bixby Village Community Community Association.'",
        "'speaker_7': 'And the second item is any speed limit lower than 25 miles an hour on narrow streets that are not exceeding 25 feet shall require an engineering and traffic survey conducted every five years, and any cost associated with surveys shall be borne by the Bixby Village Community Association, and finally, that the city shall enforce traffic and parking regulations'",
        "'speaker_7': 'with approximately the same regularity as provided in public streets. So those are the three conditions that will be in the agreement, and that concludes my report.'",
        "'speaker_0': 'Thank you. With that, I'm going to go and do public comment and we'll take it behind the rail as part of the hearing. So please, public comment, please come forward.'",
        "'speaker_3': 'Thank you, Mr. Mayor, and key members of the city council. My name is Daniel Zoon, and I am president of the Bixby Village Homeowners Association and like to start by saying that Susie Price, his office, has been absolutely wonderful to work with and so thank you.'",
        "'speaker_3': 'As has the city traffic engineer, they have really cooperated and helped us know what we needed to do. The issue really is that because we have private streets, we are required to maintain both the streets, the sidewalks, the curves, the other three of those streets.'",
        "'speaker_3': 'There was a condition place that they be, have public access. Bixby Village is off seventh Street, just below Cal State University at Long Beach. And and there's traffic around the school as well as the VA. We are experiencing problems with speeding and people running through stop signs.'",
        "'speaker_3': 'So we are hopeful that the Council will support this resolution and let us move forward to make our neighborhood safer for our residents. So, you know, this is not done in the dark ever since last August, when the issue came up before the board in all the newsletters and at every meeting, we have reported on the progress'",
        "'speaker_3': 'and what we need to do at the end of August. Today, yeah, October in August we had a special meeting at which about 70 residents attended, which is a bit we're a neighborhood of 374 homes. And there was there were some concerns raised.'",
        "'speaker_3': 'But the board, after taking into consideration the pros and the cons, voted unanimously to make this request. We've done everything we can to reach out to the public, let them know and and follow all the rules that we've signed up for.'",
        "'speaker_3': 'We've already replaced the stop signs and done most of the things that are required. So I urge you to vote yes on the resolution. Thank you.'",
        "'speaker_0': 'Thank you very much. Any other public comment as sir, please confirm.'",
        "'speaker_3': 'Actually.'",
        "'speaker_2': 'I don't get in an arm wrestling with Bob. I know he's going to win. Good evening. Thank you. Mayor and city council people for your time and energy and service to the community. And we all appreciate, regardless of what district we live in, we all appreciate your service and time.'",
        "'speaker_2': 'My name is David Balloon. I live at five 4102 Stoneham Court in Bixby Village have lived there for 24 years. I've been a former board member with the association and now I'm just a regular homeowner. I'm not going to go into a great amount of detail on this subject.'",
        "'speaker_2': 'You all have the paperwork and reports in front of you, but I do want to make several points in opposition of this. First and foremost, while presence of law enforcement who will be mitigating and siting for moving violations within the community may offer a temporary solution to a problem that is perceived not necessarily a realistic problem, but'",
        "'speaker_2': 'is perceived. I want to think that that's a temporary solution, not going to be a permanent solution. Two Driver Habits. Point number two Removing an officer from the normal tactical duties in their day to day operations will just to monitor traffic control in Bixby Village, I think is a poor use of resource for that police officer.'",
        "'speaker_2': 'There is clear consensus in the Bixby Village community from a independent survey that I conducted myself where there is opposition of this particular motion before you. And final note, several townhomes in our community have front doors that face the traffic areas that are being affected by this motion.'",
        "'speaker_2': 'Some of those homes have front doors within ten feet of the curb and the traffic where moving vehicles would be driving by. So with that, I hope these statements are taken into consideration. I can offer a copy of the results from the independent survey that was conducted to get that to the city clerk, if that's helpful.'",
        "'speaker_2': 'And I conclude my statement. Thank you very much.'",
        "'speaker_0': 'Thank you very much, sir. Singh any other any other public comment? Yes, sir. Please come forward.'",
        "'speaker_2': 'Thank you for the opportunity. I'm Harry Ivey, and I live at 480-101 Cactus Drive. I lived in Bixby Village now for. 27 years. We when we first built this community, I was a member and I participated in the Neighborhood Watch and security discussions over those numerous years.'",
        "'speaker_2': 'I think this is an excellent move to have the Long Beach police provide the same service they provide to the balance of Long Beach. I can't understand why our some of our neighbors don't understand what the octagonal red sign says stop means.'",
        "'speaker_2': 'But we've had problems with people running the stop signs. And we had a couple that got a ticket and they decided to fight it. And that's how this all came to be as a discussion item. I urge you to consider that we, like the rest of Long Beach, deserve traffic control, especially our stop signs.'",
        "'speaker_2': 'And I thank you for your time.'",
        "'speaker_0': 'Thank you very much, sir. Any other public comment? Yes, sir.'",
        "'speaker_2': 'Yes. I'm Bob Bennett and I live at Chelsea Court Village. And I walked the community probably six mornings a week. And most of the time it's right during rush hour. And I personally witness many cars driving through those stop signs when I say driving through there, not doing these California slow rolling stops, they're driving through the sides'",
        "'speaker_2': 'like they're not even there. And it's time for it to come to a stop. And we need Long Beach police in there, if that's what it takes to issue a few summons a few days a week until we get this under control.'",
        "'speaker_2': 'If that's what it takes, then I'm for it. Thank you.'",
        "'speaker_0': 'Thank you, sir. See no other public comment? I will take it behind the rail for deliberations that I'm in. Turn this over to Councilman Price.'",
        "'speaker_6': 'Thank you. I want to thank staff for working very closely with the Bixby Village Homeowner's Association to work through this item. This is an item that Jan Hall brought to our attention about August of last year. So we've been working on it for over a year in trying to figure out how best to meet the needs of'",
        "'speaker_6': 'the community. I understand that this is one of those issues where not everyone in the community is going to be 100% on board. That happens all of the time. But I also do appreciate and respect that the outreach that was conducted by your organization.'",
        "'speaker_6': 'I know having served in my position over three decades ago, Jan Hall knows the importance of community outreach and making sure that people have information. And I appreciate your homeowners association informing the residents of the proposed changes, and that was very important to us before we decided to move forward on this.'",
        "'speaker_6': 'Now, the area that we're talking about, I just want to make sure that my colleagues are clear. We're talking about patrol and enforcement on three streets and Bixby Village, three private streets that have public access easements. These streets are major thoroughfares through the Bixby Village community and some of our major corridors.'",
        "'speaker_6': 'And the one thing that I am concerned about for the residents, and I would ask that the homeowners association really do a good job of outreach on this is encouraging the residents in your community to actually use the sidewalks because a lot of times they'll walk right in the streets because it's such a small community.'",
        "'speaker_6': 'If, in fact, there is going to be patrols there and more visibility, then it's important that pedestrians and drivers follow the rules and make sure that they take precautions to be safe. Beyond that, I'd ask my colleagues to support this motion and support the will of this homeowner's association in the work that they've done.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_1': 'I have a couple of quick questions. I'm always supportive of a neighborhood association coming together to find a solution. Councilman Price. Is the vision of this that the normal amount of service provided in traffic enforcement to normal communities would be available in this area?'",
        "'speaker_1': 'Or would this be more like a contract services model?'",
        "'speaker_6': 'To answer that question in terms of what the the model is going to be.'",
        "'speaker_0': 'Mr. West.'",
        "'speaker_2': 'Will answer that.'",
        "'speaker_7': 'Honorable mayor and honorable councilmembers. I believe this is going to be a regular patrol. So if there is a complaint and it will be like anywhere else in the city if somebody is running through a stop sign. PD If you call the PD, they're going to respond the same way.'",
        "'speaker_7': 'It's not going to be anything special. That was the third condition that I read. They're not going to do anything special. And beyond that, they do throughout the city. We want to be very clear that it's not going to be 24 hours patrol for this neighborhood association.'",
        "'speaker_7': 'That was one of the conditions that the PD wanted us to have. So they're going to provide the same level of service that they will provide on any other street within the city. So if if you have in District nine, somebody is running a stop sign, we will provide the same level of service that we would do'",
        "'speaker_7': 'in District three or five or one so and all other one one through nine.'",
        "'speaker_1': 'So I think that that's part of the the resource challenge that I think one of our constituents mentioned. I know within the fifth District we have had emails lately where actual license plate numbers have been provided to PD because the number of people who choose not to follow the laws that we have in place is continuing to'",
        "'speaker_1': 'grow. And while community associations look for solutions like speed bumps and other things, I think that what we really need to also do is remind people to follow the laws that we have and apply that peer pressure our police forces.'",
        "'speaker_1': 'It's small but mighty, and traffic enforcement is a sliver of what they do and an important part of what they do. But just to ensure that we're not going to be straining any other resources and that we make sure that the city is equitably serviced.'",
        "'speaker_1': 'I'll be supporting this motion tonight.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_6': 'Yes, I have a couple of questions myself as well. So I understand this will be part of our within PD. How did this come about? I heard, you know, it started with a citation among neighbors. But is there a certain criteria you have to hit to be able to make your private?'",
        "'speaker_6': 'Area, essentially. Able or accessible to public services. How does that work exactly?'",
        "'speaker_7': 'I think the anomaly is that this this private community doesn't have gates. So it's not distinguishing the outsiders and insiders that this is a privately held community. When a private development occurs, the streets are private. The homeowners association is responsible for maintaining everything the infrastructure, the curbs, gutters, everything that we do for public streets.'",
        "'speaker_7': 'They provide because they want to have the gates. When you provide the gates, it basically it's not a public street anymore. That's the definition of a public street. I cannot as general public access that street because it's gated.'",
        "'speaker_7': 'So when in this situation, I don't know how that occurred 20, 30, 40 years ago when this development was proposed that did not install gates. And it's it acts like a private it's a private street. That means the homeowner association is maintaining the street.'",
        "'speaker_7': 'They're maintaining the integrity of the infrastructure. But it's public because it's not gated and public have access to it. Now, there's a city anymore.'",
        "'speaker_2': 'That as part of the condition of improvement of the movement of this development. They were required to maintain those three streets as accessible to the public. So from the public standpoint, you wouldn't know the difference if you're driving down the street until you turn onto their street.'",
        "'speaker_2': 'So it is different from a private development in that one of the requirement of the city 27 or 30 years ago was that it remained public access.'",
        "'speaker_6': 'Okay. And I think that's all of my questions. I just wanted to ensure I was clear on that and how that came to be. All right. Well, thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Pryce.'",
        "'speaker_6': 'Thank you. I just want to clarify a couple of the questions that were asked. These these three particular streets that we're talking about have public access easements. And and and when this issue came up, we actually had the homeowners association meet with the city attorney's office to figure out legally what options are available for traffic enforcement.'",
        "'speaker_6': 'Because, like I said, there major access points for corridors, major corridors in the city. So they are if they don't appear at all to be private roads, if you drive through them, they're very much public roads that are used for public access on a daily basis because they link to major corridors, streets together.'",
        "'speaker_6': 'So that's how it came about. And it went through the city attorney's office and trying to determine whether or not they were a public access easement. So. Thanks.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Members, please go ahead and cast your votes on hearing item number two.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing, and adopt resolution continuing the East Anaheim Street Parking and Business Improvement Area assessment for the period of October 1, 2015 through September 30, 2016; and authorize City Manager to extend the agreement with the East Anaheim Street Business Alliance for a one-year term.  (Districts 3,4)": [
        "'speaker_0': 'Thank you. Hearing item number one, please.'",
        "'speaker_1': 'Report from Economic and Property Development recommendation to receive supporting documentation and to the record. Conclude the hearing and adopt resolution. Continuing the East Anaheim Street Parking and Business Improvement Area Assessment for the period of October 1st, 2015 through September 30th, 2016, and authorize the City Manager to extend the agreement with the East Anaheim Street Business Alliance for'",
        "'speaker_1': 'one year term districts three and four.'",
        "'speaker_0': 'Thank you. We can have the staff report, please.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Members of the council, the staff report will be given by Mike Conway, Economic and Property Development Director and Jim Fusco, Development Project Manager. Mayor Garcia, Members of the City Council, the East Anaheim Street Parking and Business Improvement Area, uses business license assessment funds to promote and market the commercial areas along East Anaheim Street'",
        "'speaker_2': 'on behalf of the businesses located there. Council action on this item continues the assessment for another year and extends the agreement with the East Anaheim Street Business Alliance. There are no proposed changes in the district boundaries, the basis and method of leaving the assessment and no significant change in the proposed activities.'",
        "'speaker_2': 'On September 15th, 2015, City Council approved Resolution Number Arias 15 Dash 0115 granting approval of the annual report, declaring the intention of City Council over the assessment and set October 13th, 2015 as the date of public hearing. So at this time, staff requests City Council received the supporting documentation into the record, conclude the hearing and adopt the'",
        "'speaker_2': 'resolution of this concludes my report.'",
        "'speaker_0': 'Thank you. I'm going to turn this over to any public comment on the hearing first. So any public comment on the hearing? Seeing none. Council member non.'",
        "'speaker_8': 'Thank you, Mayor. I just wanted to thank to the board members in the audience tonight. It's been a long night. Appreciate you being here. And I think you guys had a board meeting today, too, so it's been a long day also, but that's Brett Lewis and Leigh Vera.'",
        "'speaker_8': 'They've done an outstanding job. They've basically taken over running the bid. And we really appreciate what you guys have done. Thank you.'",
        "'speaker_0': 'Thank you very much. Councilwoman Pryce.'",
        "'speaker_6': 'Thank you. I want to echo that and thank is the president, Lee Vieira and Brett Lewis and and the entire board of directors for leading the business community and positively influencing the city's economic landscape. Is there I know is working hard to support more than 600 businesses within the district and the board is instrumental in empowering local'",
        "'speaker_6': 'businesses to achieve their business goals. I look forward to speaking at SBA on October 27th, and I know that Councilman Superhot and I share mostly it's Councilman Supervised district, but we have a few a sliver of businesses that fall within your jurisdiction.'",
        "'speaker_6': 'And I want to thank you for all you do for all the businesses and and those in the third as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo. I'm going to go back to Councilmember Super now.'",
        "'speaker_1': 'I, too, want to thank your business association for all the great things that you've done. I've enjoyed meeting with your business owners on several occasions, and I think that you're a model of what an organization can be. While your SBA, we have SBA over on our side of town and they look to you guys for guidance and'",
        "'speaker_1': 'hopefully potentially a name change. So people won't confuse us so much anymore. But at the end of the day, as long as they shop local, we're all winners.'",
        "'speaker_0': 'Thank you. Councilmember Brown, I.'",
        "'speaker_8': 'Was just going to say, I apologize for not having the I-Team there to present, but we have so many great speakers. And Councilwoman Pryce, it's hard to work a man. So. Thank you, guys.'",
        "'speaker_0': 'Thank you. With that, we have a motion in a second. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Now back to the regular agenda. So we're going to go. We have one member of the public who wants to speak with Larry Goodhew, and then we'll move on to after Mr. Goodhew comes up. We're going to be moving on to item number 20.'"
    ],
    "Recommendation to direct City Manager to implement a Dog Walker Watch program as part of the City's current Community Watch Program and report back to City Council within 90 days.": [
        "'speaker_0': 'Thank you. That concludes public comment. We're going to be going to item number six.'",
        "'speaker_1': 'Communication from Councilman Andrews, Councilwoman Gonzalez, Vice Mayor Lowenthal, Councilmember Superman recommendation to direct the city manager to implement a dog walker watch program as part of the city's current community watch program and report back to city council within 90 days.'",
        "'speaker_0': 'Thank you, Councilman Andrews.'",
        "'speaker_4': 'Yes, thank you, Mayor. First of all, I could think of my colleagues who signed on with this item. I brought this to the neighborhood crime prevention item forward to assist the city of Long Beach Police Department, who's always in need of public assistance and keeping a watchful eye on the community.'",
        "'speaker_4': 'With over 63,000 dog owners households in the city. They are implementing a dog watch dog watch dog walk. Watch program, we can very many of those walkers, two extra eyes and ears for the police department. Dog walkers can be available resources in helping to make our community safer.'",
        "'speaker_4': 'If most of you individuals know with your dog walking and just running a jogging, whatever you do, it's still another eyes and ears for our community. The idea is that we walk where residents, you know, are taking their dogs out on a walk to their neighborhoods.'",
        "'speaker_4': 'They can do also be trained to watch for suspicious activities. Police have been asking people to report. And a lot of times when you talk about this, you guys realize that our police department is very, very limited and very resources in a lot of things.'",
        "'speaker_4': 'But this is something I thought that we could bring together, let you understand that your dog can be the eyes and ears and your dog is a man's best friend, so why not use him in this capacity? Foremost, I would like to make the motion to forward this item to the Housing and Neighborhood Committee, you know, for'",
        "'speaker_4': 'more time. Because the fact that the impact that it would bring on the police department, I think it right now we should take a little more time and look into this. But I'm very, very serious about this item.'",
        "'speaker_4': 'And I would hope that that my diocese would feel the same way and vote for me to do this also.'",
        "'speaker_0': 'Thank you. Let me first do public comment and public comment on the item. CNN. I have Vice Mayor Lowenthal.'",
        "'speaker_3': 'Thank you. And Councilmember Andrews, I can withdraw the the motion if you if you'll queue up for it. I just. Can I. So hold on.'",
        "'speaker_4': 'Right.'",
        "'speaker_3': 'Go ahead. Do you?'",
        "'speaker_4': 'And yes, I made up. I made the motion.'",
        "'speaker_3': 'Can you hit the button, though? Thank you, Mr. Mayor. May I ask a question? I know that Councilmember Andrews has been working on this for the better part of a year. And I'm wondering why you think it should go to a committee?'",
        "'speaker_3': 'I'm happy to support that. I'm just. I know you've just been working on it for so long and. Yeah.'",
        "'speaker_4': 'One reason is because the fact I think the input that the impact that it would bring on our police department right now has been, you know, with the social resources in which they have. I just think we should take a little more time in by taking into the house and neighborhood.'",
        "'speaker_4': 'We would have more time to do that.'",
        "'speaker_3': 'Okay. Thank you. That's all for me. Is there any other member that would like to make a comment? Councilmember Mongo.'",
        "'speaker_1': 'I think this is a fantastic idea, Councilmember And I think that you bringing this forward is really an opportunity for us to highlight the opportunities that so many of our neighbors have when they're walking their dogs at night and hopefully train them on knowing what to look for and how to be a good how to be a'",
        "'speaker_1': 'good witness should something suspicious arise that they see. So congratulations on all the work you've done on this. This is phenomenal and I look forward to being supportive as well.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_3': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_6': 'Councilmember Andrews, I want to thank you for this. It's you know, sometimes we got to get really creative on how we do things. And I think this is another opportunity to train individuals who need to be trained. What I would also suggest to our Housing Neighborhoods and Housing Committee is to maybe even look at some of our'",
        "'speaker_6': 'resources that are already existing. For instance, you know, we in the first District, we're trying to roll out a large community watch, which I know this will be mirroring. And we have great partnership with the DLB, our downtown Long Beach Associates or our business improvement districts.'",
        "'speaker_6': 'Many of those employees are already trained, so perhaps that could be another way for us. So we don't use so many police resources, as you mentioned. That could be another avenue for us to look at. Leveraging, you know, is another option.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Supranational.'",
        "'speaker_8': 'Thank you. And I'd like to thank Councilmember Andrews for bringing this item forward. I signed on originally. I just thought it was a, you know, a broad range of resources that will work. And then last Tuesday night during council meeting, I found out that a dog watcher in my district was able to inform me about some serious'",
        "'speaker_8': 'crimes. And to Councilwoman Gonzalez's point. We are now forming a community watch group as a result of that. So I didn't have to wait till the Senate approved to see the fruition. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Pryce.'",
        "'speaker_6': 'I, too, want to thank the councilmember and the co-sponsors that brought this forward. I think it's innovative and we try to encourage that. And I also think that it supports the police department's mission of increasing the number of community watch groups and allowing extra eyes to be put on the issues that impact quality of life and neighborhood'",
        "'speaker_6': 'safety. So anything we can do to help the police with adding additional eyes and ears I think is helpful for us to do at this time. Will they? Do you have have we thought about whether or not they will have shirts or patches or anything like that?'",
        "'speaker_4': 'Maybe. Sure, Cherry Dog in his district will have his district number on it to let people know. That's just one of my ideas. Yellow shirts for them in that district. One, two and three. You know.'",
        "'speaker_6': 'Polo shirt.'",
        "'speaker_4': 'Anything.'",
        "'speaker_6': 'Great. Thank you for bringing this item forward.'",
        "'speaker_0': 'Councilman Richardson. Thank you.'",
        "'speaker_7': 'Just want to chime in and say anything we can do to add more eyes to keep our neighborhoods safer that I can be in support of that. So congratulations, Councilman Andrew.'",
        "'speaker_2': 'Councilman.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_7': 'Yes. I want to thank you for bringing this forward. Councilmember Andrews. I'm a dog watcher and Walker and our guest watcher as well. And oftentimes walking through my neighborhood and through the community at night, I see a lot.'",
        "'speaker_7': 'We really do our report. I don't see a lot of crime, but I think this is a common sense approach to, you know, being good neighbors. So thank you for bringing forward our support. Look forward to coming through to coming to the Housing and Neighborhoods Committee, who will be have a chance to work on it.'",
        "'speaker_0': 'Vice Mayor Lowenthal.'",
        "'speaker_3': 'Okay. Just to take it full lifecycle, do we see deputizing these dogs and then can we have a special dispensation where they don't have to be on leash? How else are they going to fight crime? So, Councilmember Andrews, have you thought this through?'",
        "'speaker_4': 'Yes, I really have. And I think that would be the best thing to do, is to be able to deputize the dogs and.'",
        "'speaker_3': 'Have them off leash and.'",
        "'speaker_4': 'By all means, and maybe even have them carry weapons here.'",
        "'speaker_0': 'This is get it's getting late.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'What about? What about the cat? Yeah. We need to send the cat fighters to help Councilmember Richardson.'",
        "'speaker_7': 'Councilmember Austin had a suggestion that we could use the dog walking to help with the RV problem in the city.'",
        "'speaker_0': 'Okay. That's. I like that. Any public comment on this item? Now seeing none. Please cast your votes. Motion carries you item number nine.'"
    ],
    "Recommendation to adopt Plans and Specifications No. R-7013 for the Improvements of Studebaker Road between Spring Street and Wardlow Road; award a contract to Sequel Contractors, Inc., of Santa Fe Springs, CA, in the amount of $1,245,065, and authorize a 15 percent contingency in the amount of $186,760, for a total contract amount not to exceed $1,431,825; and authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments thereto.  (District 5)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Next item. Which I believe is 1514 was withdrawn.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_1': 'Report from Public Works Financial Management. Recommendation to Award and contract to school contractors for the improvements of Studebaker Road between Spring Street and Wardlow Road. For a total contract amount not to exceed $1.4 million. District five.'",
        "'speaker_0': 'Give us a motion in a second and a public comment. Seeing on Councilwoman Mango.'",
        "'speaker_1': 'We are really excited to share that this rehabilitation work will consist of removing and replacing the damaged concrete curbs, gutters, driveway aprons, alley entrances and sidewalks. We're going to trim and do root shaving on our trees and reconstruct the area in the Studebaker street to be a first class street with very innovative, cold in place recycling methodology'",
        "'speaker_1': 'that should this come to be as exciting as we anticipate it will be, and if the process goes as easily as we hope, then we will be able to use this across the city to be able to pave more streets more effectively and less expensively.'",
        "'speaker_1': 'So we are really excited about this great opportunity to be the pilot project in the fifth District on a street that really needs a rehabilitation. So thank you to the Public Works Department for all of their work on this.'",
        "'speaker_1': 'It has been a exciting process to learn about and thank you to the city staff for their innovation. I hope that this turns out as great as we anticipate and that all the major corridors of our city can get a revamp with cold in place recycling.'",
        "'speaker_0': 'Thank you. Please cast your vote.'",
        "'speaker_1': 'Councilman Andrews. Motion carries.'"
    ],
    "Recommendation to refer to the Parks and Recreation Commission to revoke the new senior water exercise fee at Martin Luther King, Jr. Pool and Silverado Pool, as well as, all City Pools and report back to City Council.": [
        "'speaker_0': 'Okay. Now we're going to move on to new business. We have one item, which is item 24.'",
        "'speaker_1': 'Communication from Councilman Andrews, Councilman Price, Councilmember Wodonga recommendation to refer to the Parks and Recreation Commission to revoke the new senior water exercise fee at Martin Luther King Jr. Pool and Silverado Pool as well as all city pools and report back to city council.'",
        "'speaker_0': 'Okay. There is, you know, can we back up the.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Councilman Andrews, I think it's your right.'",
        "'speaker_4': 'Yes. Yes. Thank you, Mayor. You know, on September the 17th, the Parks and Recreation Commission voted to increase the fees of the senior water aerobics classes at King and Silverado. A new fee was established at $2 a class or 4 to $450 a year per year individual.'",
        "'speaker_4': 'The average income in the city of Long Beach is $26,000 annually, which is below the national poverty level. Creating this new fee places an unnecessary burden on our aging population, as well as creating a burden to the physical activities to our older adults.'",
        "'speaker_4': 'I am simply asking our Parks and Recreation Commission to revoke the fee for seniors and look into taking other steps to increase their mainstream attendance to offset the pool cars by promoting pool use with families or additional programs to increase the revenue.'",
        "'speaker_0': 'Okay. Thank you. There's been a motion and a second. Any public comment on the item? CNN. Please cast your vote, please. Oh, I'm sorry about that. Councilman Price.'",
        "'speaker_6': 'Thank you. I just want to make sure that this would be to all polls citywide, correct?'",
        "'speaker_4': 'Yes.'",
        "'speaker_6': 'So that seniors would have the same.'",
        "'speaker_4': 'All the seniors. Okay.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you. Members, please cast your votes.'",
        "'speaker_4': 'Yeah. Yeah.'",
        "'speaker_1': 'Councilwoman Mongo.'",
        "'speaker_3': 'Motion carries.'",
        "'speaker_0': 'Thank you. With that, we have any final public comment. Anyone is in the audience seeing none and any new business that counts. I'm going to share with Councilman Andrews. Okay. He has nothing. That's a first councilman. Your anger.'"
    ]
}