{
    "Recommendation to receive and file a report from the Everyone Home Long Beach Taskforce. (Citywide)": [
        "'speaker_0': 'We also have some hearings. So I want to begin today. We I believe we do have a11 hearing. We're going to go ahead and do item 19/1. If you don't mind, Mr. City Attorney, then we'll go right into we'll go right to the hearing and just give us one minute to set up and then we'll we'll begin'",
        "'speaker_0': '. Can we please read the item? Madam.'",
        "'speaker_1': 'Item 19 report from Health and Human Services Recommendation to Receive and file a report from the Everywhere Home. Long Beach Task Force Citywide.'",
        "'speaker_0': 'Everyone Home. Long Beach Task Force. Thank you very much, Madam Kirk. Before we begin, I just want to just begin by saying that this past May, the city of Long Beach launched an important initiative to address our statewide homelessness crisis and it and its impacts here in Long Beach.'",
        "'speaker_0': 'This was the creation of the Everyone Home Long Beach Task Force. I know we have members of the task force that are here, some of which will speak during public comment. But as part of the presentation that staff is going to begin making.'",
        "'speaker_0': 'I do. I'm going to be asking asking to come to the front in just a minute. The president of Cal State, Long Beach, Jane Close Connelly, who is also the chairperson of of this task force. I want to note that the purpose of this task force was to really look at our homeless services from a comprehensive lens'",
        "'speaker_0': 'and to address all the issues that we have with this incredibly important issue that faces us as a community and as the state of California. We know that the city is already doing a lot of amazing work in the area of homelessness.'",
        "'speaker_0': 'We also know that many members of the council are very involved in this work, have presented items that have been adopted by this council and continue to work within their communities to address these critical needs. This final report of everyone at home, Long Beach Task Force is an important report that we will be receiving tonight, which will'",
        "'speaker_0': 'then really guide our work and policies over the course of the next year as different things develop across the city. I really want to thank the staff for their amazing work. This was not just a project of the task force itself, but a lot of contributions from our Homeless Service Advisory Commission, as well as numerous continuum of'",
        "'speaker_0': 'care partners, and our most importantly, input from members of the community across the city. The report makes a several policy and service recommendations, but it's also important to note that the report isn't also just a comprehensive, one size fits all report.'",
        "'speaker_0': 'There are numerous other ideas and numerous other ways of addressing and working towards solutions on this very critical issue. And so while I think the report is certainly important, it is certainly for us in Long Beach and I've heard the city manager say this, it's the most significant report on homelessness that we've probably done in over ten'",
        "'speaker_0': 'years. There's always other ideas and other considerations that we must take into into account. I'll have some more words later, but I want to begin by welcoming Dr. John Carlos Connolly, who is the president of Cal State Long Beach.'",
        "'speaker_0': 'She does have a few events tonight, so she is going to kick off with some words and then we'll turn this over to Mr. West.'",
        "'speaker_4': 'Thank you very much, Dr. Connelly. Thank you. And thank you, Mayor Garcia, for allowing me to be involved with the everything home. Long Beach Task Force. I wanted to say just a few words before Kelly Colby presents the outcomes of the task force work in detail.'",
        "'speaker_4': 'First, let me give my special thanks to co-chair Andy Kerr to the city staff and all the task force members who showed up and did the hard work of listening, contributing their substantial expertize, arguing, disagreeing and on and on.'",
        "'speaker_4': 'But as you can see in the report, the members came from many sectors of our community and cared deeply about the issues associated with experiencing homelessness. I also urge a careful reading of the background material because you will see that the complexities that surround are a transcendent goal to make.'",
        "'speaker_4': 'Homelessness in Long Beach, a rare and brief experience are all connected to the goals and the sub goals, as you said earlier. Mayor Garcia one size does not fit all. Long Beach is home to several unique populations that are affected by or on the verge of homelessness.'",
        "'speaker_4': 'Solutions will require bold action. They will depend on developing a coordinated governance structure that keeps everyone on the same page. These solutions come with a high price tag, but the price tag is much lower than the cost of doing nothing new measured not only in human suffering, but in the costs of police, fire, health, lost educational opportunities'",
        "'speaker_4': 'and other services that we are now investing in the challenge. Obviously, we need more affordable housing. Making that happen is key to the city's success. Getting this done will require we all examine our commitments to community, well-being and development.'",
        "'speaker_4': 'We definitely need to have a focus on prevention so that we turn off that stream of people being forced out of their homes and into shelters or onto the streets. We must look at increasing education and employment options and that creating innovative connections to health services.'",
        "'speaker_4': 'The report thanks to. His great analytic skills illustrates the complexity of the problem, but does set attainable and measurable goals and offers evidence based strategies that will work. Long Beach has already achieved remarkable successes in this area and can be a city where the experience of homelessness is rare and brief.'",
        "'speaker_4': 'Nothing short of that is really acceptable in a caring community. Thanks for this chance to address you. I can commit all of the resources at sea. Issue will be we have many faculty and many many students who are committed to partnering with the city to reach the the lofty goals set by the report.'",
        "'speaker_4': 'So thank you again for the chance to address you.'",
        "'speaker_0': 'Thank you. And President Connelly, I just want to say, just on I know on behalf of the of the city council, the amount of work that you personally and your team at the university and the task force, I know Andy Kerr, who's the vice chair here, is here and others.'",
        "'speaker_0': 'I just want to we just want to thank you not just for what you did here, but your work every single day at our university, which is our we're so proud of. So giving Dr. Conolly a big round of applause.'",
        "'speaker_0': 'Thank you, President Connelly. And thank you for your for your work.'",
        "'speaker_4': 'And we're willing to do more.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Absolutely. Thank you. And I'm gonna turn this over to, I think first to Mr. West and then to Colby.'",
        "'speaker_5': 'Thank you, Mr. Mayor. Council members, as you pointed out, this is a work in progress, has been going on since June on the task force is making the recommendations tonight. It's very, very exciting stuff. These are things that, as you pointed out, it's a very comprehensive report.'",
        "'speaker_5': 'It's things that the city has been talking about for over a decade. I remember in 2005, the redevelopment agency was talking about many of these things, as well as the former community development department within the city. So it's wonderful to see all these things coming forward now at this time to the city council's recommendations.'",
        "'speaker_5': 'You're going to see Kelly talk about three goals. Goal one is she's going to talk about financing and governance and how that's going to happen. Goal number two is to increase housing access and that's going to go through emergency shelter.'",
        "'speaker_5': 'We all know that the winter shelter opened up this past week and that'll be open through March also to get permanent supportive housing in addition to that, to have low and very low income housing. So the goal here is to expand housing opportunities.'",
        "'speaker_5': 'We want to do that in a short term fashion with inclusionary housing ordinance, perhaps motel conversions, nondiscrimination for vouchers, and other sources of income, shared housing models, expanding the number of units that are rent stabilized. We have about 6000 now in the city through our housing, through our housing department and bureau.'",
        "'speaker_5': 'In addition to that, we want to incentivize and engage landlords for pilot incentive programs and also to design and implement anti-discrimination training. Goal three finally is to reduce homelessness. That's primarily through prevention, immediate intervention and also chronic homelessness.'",
        "'speaker_5': 'So services and incentives to present prevent that would be tenant assistance policies, support services and prevention for homeless people falling into homelessness and things like that. So I'm going to introduce the person who's been leading the task force with Ms..'",
        "'speaker_5': 'Connolly, and that's Kelly Collopy. She's the director of our Health and Human Services Department, and she also oversees our Homeless Services Bureau. We're one of the only few cities in California that has a homeless services bureau and also a health department.'",
        "'speaker_5': 'So that. KELLY If you could walk us through the task force recommendations.'",
        "'speaker_6': 'Thank you. Good evening, honorable mayor and city council members and to all of you here, here in the audience. Thank you for this opportunity to present the Everyone Home Language Task Force recommendations. The task for the Everyone Home Line, which was an initiative launched by the mayor in May of 2018.'",
        "'speaker_6': 'In June of 2018, the city convened the first everyone home Long Beach Task Force. The task force met five times over six months. We had sub-group meetings and opportunity for feedback throughout and we also held public comment at each meeting and those comments were taken into consideration as the recommendations were being designed.'",
        "'speaker_6': 'The task force. The task force was made up of 31 members chaired by Jane Close Connelly as you've just heard from Andy Kerr, who is Measure H citizens over advisory board member and a strong advocate for homeless services within the city.'",
        "'speaker_6': 'Everyone home. Long Beach was designed to build on the city's comprehensive homeless services and affordable housing efforts already underway, and to identify innovative approaches to provide new pathways into housing to residents from falling into homelessness. The task force has provided the context of the current homeless service gaps gaps and help bosses listen to people with lived experience'",
        "'speaker_6': ', organizational infrastructure and financing. The task force membership included representatives, CEOs and directors of organizations that reflected a broad array of interests in the city. These included higher education in K-12 education or hospitals, housing, development, business and employment, mental health, faith based organizations and transit veterans.'",
        "'speaker_6': 'Domestic violence organizations. The Cambodian community. Latino Community. LG, LGBTQ Community. Children and Family Services. The Continuum of Care Board and the Homeless Services Advisory Committee. It was the first time in many years the City of Long Beach has engaged in this level of representation and learning and planning to address the issues of the homeless, prevention, services and'",
        "'speaker_6': 'housing in the city. I want to thank Jean President Connolly and Annie Kerr for their leadership in this work and the task force members for their time, their insights, their lively discussions and expertize that brought these recommendations to you.'",
        "'speaker_6': 'So if you're here and you were on the task force, could you please stand up? I know the task force members and the community. Great. All right. Thank you. I heard from many task force members that this is the holiday season and their kids are out doing stuff and they need to be out there with them.'",
        "'speaker_6': 'So here you see a list of all the different task force members. So each each task force meeting included a sharing of information, time for public comment and then working on recommendations. So in the first meeting, we talked about the city team.'",
        "'speaker_6': 'We heard stories from the streets. We defined success and we affirmed the statement of possibility and then then had a complete overview of homeless services. In the second meeting, there were more stories from the streets. A presentation from Patrick Geary, from the development services around affordable housing development and production policies and initiatives.'",
        "'speaker_6': 'And then another presentation on prevention the gaps. The third meeting included services information on services for the new and Chronically Homeless Homeless Emergency Assistance Program, the state hip funding, and then also started in conversation and policy breakout sessions.'",
        "'speaker_6': 'So we identified a number of policy breakouts and people moved into those committees and talked through them. The fourth meeting focused on the governance, structure, data and funding, and then also started a secondary review of recommendations and prioritization.'",
        "'speaker_6': 'And then in the fifth meeting, the final recommendations were presented and approved. So setting the context of homeless. I know you've been hearing a lot about the data lately, but I just want to share a little bit. So in 2017, we did the point in time count.'",
        "'speaker_6': 'We'll be doing another one in this upcoming year. We found that 1863 people were experiencing homelessness on the streets and in the shelters. Of these one third still illness and 21% reported a substance use condition. These numbers are a decrease.'",
        "'speaker_6': 'We've had a 21% decrease from the previous count. We believe that this was due to a strong, coordinated outreach system across the city, as well as our coordinated entry system that links people to services that they need. But in addition to what we found on that and in the homeless count numbers, it's also important to talk about'",
        "'speaker_6': 'those who are precariously housed. When we talk about precariously housed, we're looking at those who make 30% of the average media average median income, which is about $16,000 for a household. We're also look at those who pay at least 90% of their rent, their income on rent and in long waitresses over 20,000 households.'",
        "'speaker_6': 'We also know that while the point in time counted as a 1 to 1 day count, that we actually have at least 4000 people falling into homelessness in Long Beach every year. They fall in and out of homelessness.'",
        "'speaker_6': 'You may not see them on the streets, but they're engaged. They may be couch surfing. They may be entering services in other ways. We only have prevention resources available for 430 households. We have 550 housing choice voucher holders.'",
        "'speaker_6': 'Their rent are fully paid. Looking for units on the street. We have fewer than ten detox beds when it comes for substance use and our residential substance use treatment beds are at capacity. We are doing development. We are in the middle of building 806 homeless and low income housing units that are in the pipeline.'",
        "'speaker_6': 'Currently we have 275 emergency shelter beds, 339 transitional housing units, 380 rapid rehousing units, and 162 permanent supportive housing units. Those permanent supporting housing units are utilized. They're essentially full and they continue to be utilized. So when someone moves into permanent supportive housing, it is a permanent space.'",
        "'speaker_6': 'So we need to be creating additional unit. Our analysis demonstrates that in addition to what we currently have, we are seeking 500 emergency, 500 additional emergency shelter beds, 350 permanent supportive housing units, 2400 units that will accept rental subsidies, such as Section eight and 450 rapid rehousing units.'",
        "'speaker_6': 'The regional area, the Regional Housing Needs Assessment, shows the need for about 2500 additional low and very low income housing units. So that is the need. Our current structure and funding. So currently the stream, the structure for homeless services includes includes multiple governing bodies and multiple coordinating bodies.'",
        "'speaker_6': 'While there is some coordination across these systems not currently operating as a seamless system, homeless services governance includes the Continuum of Care Board, as required by HUD and the Mayor appointed Homeless Services Advisory Committee. Services are coordinated through the continuum of care, the Street Outreach Network and an inter-departmental team.'",
        "'speaker_6': 'Housing development is governed by the ALB, CIC and the Planning Commission and is managed by Development Services and Workforce Development for the city is operated by Pacific Gateway and also provided by other nonprofit organizations in the city. Our current funding is approximately $30 million for services and approximately $10 million for housing choice vouchers and voucher vouchers that'",
        "'speaker_6': 'are specifically carved out for homeless households. We've received $13 million to purchase and renovate 125 bed year round shelter, as well as to purchase a storage facility. So if someone is homeless and has a lot of materials, it's a safe place for them to store their belongings.'",
        "'speaker_6': 'We have approximately 4.5 million available in home funds to support new housing construction incentives. These funding sources. Um, you can see the. You could see through these funding sources that you could see all the different percentages and there are multiples of them.'",
        "'speaker_6': 'So the services we provide include a multi-service center. Street outreach and connection. Our quality of life teams through the police department, the Hart teams through our fire department, shelter beds, transitional and rapid rehousing services, permanent supportive housing and many other support services is a significant set of services and the most comprehensive provider by any city in our'",
        "'speaker_6': 'region. The city of Lombard has taken a strong stand to address homelessness in the city, and our continuum of care is nationally recognized for its service model. However, there are funding and service limitations. As mentioned above, its currently provides prevention funding for only 430 households, which is far lower than the need given 4000 people entering homelessness each'",
        "'speaker_6': 'year and over 20,000 people are precariously housed. Funding does not cover child care. It does not cover behavioral health services. Buildings planning beyond the cost partners, communications or data infrastructure. This leaves real gaps in services and coordination. To share with you a little bit about how many we see during the year.'",
        "'speaker_6': 'We have approximately 13,000 visits at the MSI and we make at least 2000 Street outreach contacts each year. In the past year, our call or call volume to the MSI increased by nearly 250% to over 900 calls and emails.'",
        "'speaker_6': 'And as we've shared, it takes an average of 17 contacts on the street before someone will engage in services. But all of these services in context.'",
        "'speaker_0': 'Coping is just to just to be clear that I hadn't seen this number before. So on the outreach side, the the increase. So that's a one year increase.'",
        "'speaker_6': 'For the reports of homelessness to that to the hotline, an email. Yes, it's a one into one year increase increase over last year.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'But all of this is working. In the past year, we have permanently house 1035 individuals and families and that so far we haven't ended then. We haven't gotten through December yet, so the number will go up. So we're very excited about the fact that we are able to to move that forward.'",
        "'speaker_6': 'We are making progress in terms of housing. We are 361 units of low income housing has been completed. We have funding for a 125 bed emergency shelter. There are 806 homeless and low income units that are in the pipeline, which includes 235 permanent supportive housing in 571, low and very low income housing units.'",
        "'speaker_6': 'The city provided just under $40 million and leveraged an additional 324 million in construction to be able to build both those units and for those that are in the pipeline. So I want to talk a little bit about prevention, because this is something when you're in public health and homeless services, you talk a whole lot about.'",
        "'speaker_6': 'We spend a lot of time in language talking about our interventions for homelessness. So we see people on the street. We're trying to figure out how to intervene and how to really work so that we can house them from the street.'",
        "'speaker_6': 'But these interventions often are that are the last. They're there. It's because other things have broken down. So to understand the need for prevention, it's really important to discuss why become people who become homeless in the first place.'",
        "'speaker_6': 'So what we see here is that 50% of people fall into homelessness either because they've lost their job or because they have insufficient income to pay their expenses. 20% of people fall into homelessness due to substance use addiction or a disabling health or mental health condition.'",
        "'speaker_6': 'So while we had 50% of people on our streets during the street count and express that they had a mental illness or substance use condition, they don't often enter homelessness. Because of that, only 20% enter homelessness. And from that often mental illness or an addiction to substances takes place from being on the street.'",
        "'speaker_6': 'For many others, it's due to breakdown or violence in the family. So it's important to address these issues as we start to think about homelessness and really slowing the stream. We need to move upstream in our work. So I often say that people don't become homeless when things are working well for them.'",
        "'speaker_6': 'It's important that we look upstream to understand the breakdowns in our system. Upstream determinants of homelessness are those overarching factors that are largely outside of the control of the individual and which have a significant trickle down effects. These may include low vacancy rates, increasing cost of living and rentals, inadequate social safety nets, mental health or health conditions'",
        "'speaker_6': ', untreated substance use and family violence. Right now, we're catching people after they've gone off the waterfall. We're doing the interventions when they're already on the street. Instead, what we'd like to do and what we are doing is we're working really hard to pull them back up the waterfall, and that is not easy.'",
        "'speaker_6': 'So our goal is to begin to address the efforts while we're still up above the bridge to create that bridge. So we think about a prevention continuum. When we look at our upstream prevention opportunities, we focus on employment and training, strengthening families, health and behavioral health services, and increasing access to housing that is affordable to low income'",
        "'speaker_6': '. Downstream preventions are where we currently focus. It's more of a last minute intervention in the middle of a crisis. We receive almost no funding for upstream preventions and only slightly more funding for downstream preventions. Our goal is to stop people from falling down the waterfall slowing to a trickle, the number of people falling into homelessness in the'",
        "'speaker_6': 'first place. So I now like to share the everyone home Long Beach Task Force recommendations. The Task Force listened and engage in a number of presentations where we provided this information and much, much more. They were thoughtful in their dialog, bringing their different expertize and perspectives into the conversation.'",
        "'speaker_6': 'They asked tough questions and pushed each other's thinking, as well as ours on a number of topics. From this process, they developed seven key goal areas and over 40 recommendations. I won't go into every single recommendation in depth, but will provide an overview and foundation for the recommendations.'",
        "'speaker_6': 'In addition, I'm going to be starting with goal number two, as I'd like to have the funding a governance conversation. At the end of the presentation. First, I'd like to share the statement of Possibility for homelessness in Long Beach in 2017, a gathering of over 100 community providers and community members developed a statement of possibility for homelessness'",
        "'speaker_6': 'in our city. The task force affirmed that statement. It reads The experience of homelessness in Long Beach is rare and brief when it occurs. The recommendations that you'll be hearing tonight align with that statement. So we started with goal two increasing housing access.'",
        "'speaker_6': 'The task force that three goals for access. First, creating 200 new emergency shelter beds by the end of 2020. 200 new permanent supportive housing units in the pipeline by 2023. And 2000 new low and very low income housing units in the pipeline by 2023.'",
        "'speaker_6': 'The key areas for recommendation are expanding housing opportunities and incentivizing landlords to provide housing to low income and homeless households. The recommendations for expanding housing opportunities are broken into short term and long term opportunities. In the short term, they recommend designing and implementing a progressive inclusionary housing ordinance that creates housing opportunities throughout the city.'",
        "'speaker_6': 'This work is just starting now through the development services and the community. Conversations have started to provide zoning accommodations to developers who wish to convert existing motels into permanent supportive housing. Developing and adopting an ordinance that prohibits discrimination based on housing subsidy and other sources of income.'",
        "'speaker_6': 'Identifying properties and incentivizing property owners in Long Beach to participate in shared housing models that allows for master leasing of property and matching tenants to affordable housing, and expanding the number of rent stabilized units through production, policy and preservation.'",
        "'speaker_6': 'For the long term. They recommend that we establish more geographically equitable distribution of lower income housing units and supportive cities across the city. This would continue to build on an opportunity for every council district to participate and being part of the solution for homelessness.'",
        "'speaker_6': 'The recommendation is that every council district would commit to provide for a certain number of affordable or supportive housing units or developments, including supportive services within within each council district. These may include new development. It may include repurposed units, may include accessing increasing access to units.'",
        "'speaker_6': 'Utilizing subsidies, may include substance use services, mental health service services, or other support units. Anything that we can be bringing together across our city to support reducing homelessness. They also recommend increasing mobile emergency shelter beds and increasing accessibility for populations that currently have limited shelter options, such as those who are like families and couples who have children'",
        "'speaker_6': 'and pets who want to be together. Transition age youth, older adults, the reentry population, portable people with multiple diagnoses, and individuals experiencing homelessness that don't meet the requirements for other shelters. The final recommendation here is to utilize assets to utilize assets that are underutilized in government or privately controlled land, assets that would be redeveloped to provide affordable'",
        "'speaker_6': 'housing opportunities while incorporating public uses. As part of this strategy. They are also looking to incentivize and engage landlords. The purpose is to increase access within existing units for homeless and voucher holding households. The first recommendation is to finance a pilot and implement a number of different incentives similar to the housing incentive or the homeless incentive program'",
        "'speaker_6': 'for landlords that is currently were funded through Measure H that were utilized through the housing authority. Possible options may include funds to cover holding fees, damage mitigation feeds, move in assistance, a variety of bonus structures for landlords partnering with the Housing Authority and communities where housing choice vouchers are limited.'",
        "'speaker_6': 'Call maintenance to assist with fixing up buildings or 24/7. Calling available to support property owners renting to formerly homeless or housing subsidy tenants. The next recommendation is providing case management and support services to people utilizing housing choice vouchers.'",
        "'speaker_6': 'As often we have people who have who have a voucher and they're living in their unit. And they may fall into they may have they may engage in substance use or sometimes they may not be taking their medications.'",
        "'speaker_6': 'And so to be present for those to help support them in those services. So they remain housed. We also seek to design and implement an anti-discrimination training required for landlords participating in any incentive program to ensure that landlords understand how to avoid discrimination in rental practices.'",
        "'speaker_6': 'Goal three is reducing homelessness and really focusing on prevention. The goal here to reduce the number of people falling into homelessness to 1500 instead of 4000 or fewer annually by 2023. That 75% of people that exit into housing do so within six months of becoming homeless and that we reduce the number of chronically homeless to 350 or'",
        "'speaker_6': 'fewer by January of 2021. The prevention recommendations include a tenant assistance policy that provides for relocation assistance to households impacted by rising rents and displacement support to increase the state's noticing requirement for no fault termination of tenancy to a minimum of 90 days.'",
        "'speaker_6': 'Providing rapid rehousing services and deposit assistance for displaced very low income older adults. And setting aside housing choice vouchers for displaced or extremely low and very low income adults. The tenant assistant policies are currently under development in partnership with community advocates and landlords and will be presented at the January 8th City Council meeting.'",
        "'speaker_6': 'The task force also recommends providing support services and prevention to households up to 60% of area median income. Currently, our funding only serves people who are at 30% of area median income, and we seek to increase that level to help support people in their homes.'",
        "'speaker_6': 'The last recommendation is to proactively identify buildings who may be sold or otherwise are at risk of increased rent. Increases are evictions so that as a city and with our partners, we can proactively respond and reach out and support people.'",
        "'speaker_6': 'The next goal is really focused on providing employment, training and opportunities. As we discussed, 50% of people become homeless due to loss of job or inadequate income. Here, the task force seeks to provide 600 job opportunities for adults and 240 job and job opportunities for transition age youth.'",
        "'speaker_6': 'The task force recommends a focus on living wage jobs. The recommendations include expanding training opportunities for those at risk of experiencing homelessness, partnering with business business leaders, business organizations besides the Chamber of Commerce to provide job training and employment opportunities to reduce barriers to employment for those who have criminal histories.'",
        "'speaker_6': 'To promote social enterprise opportunities. To expand the city's youth internship programs, especially focused on those who are precariously housed at risk of homelessness. Or homeless. And researching. Worker co-op models. The next goal focuses on families and supporting children and families who are precariously housed or homeless.'",
        "'speaker_6': 'Given that our funding sources do not cover child care, the task force focused on increasing access to child care by creating at least 400 new child care sites by 2021. It's very difficult to have a job job training, participate in any sort of education if you don't have quality health care for your children.'",
        "'speaker_6': 'The recommendations here to increase childcare opportunities for low income and homeless families, particularly infants and toddlers, including at provider sites to support family access to services. Improving coordination between organizations to improve access. Utilization of physical and mental health care by children and families.'",
        "'speaker_6': 'Expanding the availability of low skills training for families. Increasing services supports and housing for families. Families experiencing domestic violence and strengthening education and coordination of services for children, youth and young adults experiencing homelessness to support their academic access and success.'",
        "'speaker_6': 'The next goal is focused on health and increasing the access to behavioral health and physical health services. The goals include 32 new detox beds in the city. A new sobering center, reducing emergency room visits by 25% by 2023 and implementing 30 new recuperative care beds.'",
        "'speaker_6': 'We also seek to reduce the number of people who are discharged from hospitals to homelessness to 0% by 2023. The recommendations to do this are to establish agreement with L.A. County's Housing for Health Program, to allow for more coordinated referral program to serve the city's most vulnerable and most frequent users of city resources.'",
        "'speaker_6': 'Partnering with Los Angeles County and the State to implement a substance use detox center, a sobering center, increase recuperative care beds, and a safe needle exchange program in the city. Recuperative care beds are really an opportunity for people.'",
        "'speaker_6': 'When someone is in the hospital and they are released, many times they can't they don't have a safe, clean space to go to recover recuperative care beds, provide a place where they can they can have care. It's not a medical facility necessarily, but it is someplace that has nursing visits, medication and places that will let people recover'",
        "'speaker_6': 'from various illness and wounds. The sobering center is an important aspect. As many times we see on the streets, people who are experiencing they're highly intoxicated. A sobering center allows for someone to walk in. It's a 24 hour opportunity and they can sleep and shower and also to engage in services.'",
        "'speaker_6': 'And then we start to build relationship over time for those who are on the street. We seek to engage nonprofit partners in hospitals to increase substance use treatment opportunities throughout the city, and to advocate for state and federal government levels to significantly increase the availability of long term mental health capacity both in the city and in our'",
        "'speaker_6': 'region. And finally, we seek to expand discharge planning processes that engages hospitals, institutions and community organizations to ensure that people experiencing homelessness are not to the street. We have a discharge planning group that is already working on this, working very closely with our hospitals.'",
        "'speaker_6': 'The goal is that when someone walks in the door, they are identified as homeless. And then we work to case manage to ensure they release to shelter. And our final goal is the task force recognizes that specific populations face additional barriers to services and that existing models may not have the current capacity to sufficiently address the range'",
        "'speaker_6': 'of needs presented. Therefore, it recommends that the city, its partners and the community work together to develop population specific models for older adults. Transition age, youth, LGBTQ and reentry populations. Now for the real fun. This is how we make it all happen.'",
        "'speaker_6': 'This. These goals. Focus on these. This goal focuses primarily on the governance and what it takes for a full system of care, the data, capabilities, communication and funding. It is the essential backbone for an effective system. For governance.'",
        "'speaker_6': 'There is a recommendation to redesign the Continuum of care board so that it fully engages all the partners around homeless services. Right now, the Continuum of Care Board is specific to the two HUD funding, and the members are from providers that are part of the continuum of care.'",
        "'speaker_6': 'We would engage and strengthen that that board and to create a position to prepare the city for future housing funding, to really engage and be paying attention to various legislation, policies and other areas to make sure that the city is ready when funding becomes available to be able to access those funds.'",
        "'speaker_6': 'We also there are also recommendations to expand existing data sharing agreements. Often we have people who are in many systems and each of those systems holds the data and we don't know where people are landing. And so we want to be able to really be able to coordinate services for the best service for individuals and their families'",
        "'speaker_6': 'and design a common client consent that allows for all partners and consent to be able to work from the same forum. And when one is signed, then it works for all. And also to implement a data system to include our partners in the homeless services system and maybe a new platform and maybe our homeless management information system'",
        "'speaker_6': '. We're not sure. But what we do know is we need a stronger data system. We also seek to increase our communications, education and advocacy. So the recommendations here focus on implementing. Right now, there is a strategic plan, a communications strategic plan that was created with the city and its partners in Dolby.'",
        "'speaker_6': 'And we seek to implement that communications plan to reduce stigma around homelessness. There is a lot of fear around homeless and is one of the reasons why people are concerned about having services within their communities. And we seek to address the stigma around homelessness also to start to build a yes in my backyard campaign.'",
        "'speaker_6': 'You hear a lot about NIMBYism and not in my backyard. We're here to turn it around and turn it into a yes in my backyard campaign. So you'll be hearing more about that and then continuing to advocate and to educate at the county, state and federal levels so that people understand the importance of all the different pieces'",
        "'speaker_6': 'of homeless. And we policies and funding follow that. And finally, the funding to meet the goals outlined in the plan, the city would need a dedicated $220 million in capital funding and 25 million in ongoing prevention and services funding.'",
        "'speaker_6': 'There are many avenues for identifying funding, including state and local opportunities. But to reach the outcomes we seek, there must be additional resources. In August, the City Council directed the city manager to identify different funding options and models.'",
        "'speaker_6': 'This work will begin in the New Year and will be presented to you. This is our umbrella. This is what the governance structure that we're seeking. So the continuum of care board would oversee and set outcomes and hold accountability, help oversee the data and implementation, build and strengthen the communications and education of those in our communities and'",
        "'speaker_6': 'in our governments to strengthen our advocacy approach and to coordinate our street response. Our services, workforce development and housing opportunities. In the end, this is our. This is our goal that we have a vision for an integrated system.'",
        "'speaker_6': 'It's really that we pull everybody together and everybody's coordinated so that we have a fully integrated approach for our department. I was one of our staff said we would need a trampoline. So we created we created this. So what we seek is that that we have been a safety net and there have been holes in the safety'",
        "'speaker_6': 'net. What we want is a trampoline so that we catch people, even if they fall through the safety net and they can bounce into the services that they need. Homeless housing and other opportunities for success. We have made a lot of progress toward the trampoline addition.'",
        "'speaker_6': 'A lot of additional funding has come in in this year through Measure H and through the state funding. We have we have additional homeless and low income housing units that are have already been built and are in the pipeline.'",
        "'speaker_6': 'We have a new behavioral urgent crisis center, which is a 24 hour mental health facility that people can go to in moments of crisis. We are in the process of negotiating a year round shelter. Beacon Point has been built for the permanent housing for veterans and mental health.'",
        "'speaker_6': 'America is building a comprehensive health and service center for those with mental illness. I'd like to thank the mayor for his stand, for convening the task force and his stand to end homelessness. I also think the City Council for keeping homeless services in the forefront of conversation.'",
        "'speaker_6': 'I think the staff in the City Manager's Office, Development Services and the Homeless Services Division for all their work behind the scenes to support a successful task force process. The research on preparing the report. None of this could have happened without all of you.'",
        "'speaker_6': 'So Honorable Mayors, City Council and those in the audience. As I've lived and worked in Long Beach, I've been in many conversations where it's people, where I've learned that people that I work with, people they were friends and others were once homeless.'",
        "'speaker_6': 'They've lived in their car. They've been very poor. They've had relatives who had very difficult mental illness situations and serious drug addictions. These stories are pervasive and they're your friends. Some turn out well and others are still seeking help.'",
        "'speaker_6': 'It's a conversation that impacts so many and needs everyone to engage to change the conversation. I hear most people talking about street homelessness. There's so much more to the story that you've heard about those on the street who are chronically homeless, or at some point they're because the system of prevention and early opportunity failed them.'",
        "'speaker_6': 'This could be a family system. It could be a school system. It could be an employment system. It could be a health system or a combination of two or more. Or many people don't generally choose homelessness when all is going well.'",
        "'speaker_6': 'The goal of the Task Force report is not only to create better opportunities to bring those who are chronically homeless into permanent housing opportunities, but also to slow the stream. We are much more humane when we work with those who are on the brink of or newly homeless to ensure they remain housed or have access to housing'",
        "'speaker_6': 'and to to income that meets their need. Then when we allow for chronically homelessness, chronic homelessness, we ask all of you to work with us to end homelessness in our great city. We all have skills, knowledge, expertize, connections and heart.'",
        "'speaker_6': 'Let's come together and end homelessness for the city. Thank you. And that concludes my presentation and I'm available for questions.'",
        "'speaker_0': 'Thank you, Ms.. Collopy. And I want to thank the staff. I'm going to first go to the city council for. For some questions and comments, and then we'll open it up. I want to just say a few and then I'm going to turn this over to those that have queued up.'",
        "'speaker_0': 'Let me let me just begin by again by thanking the staff and everyone that served and everyone that came out to speak on this topic. And I want to repeat, I'm saying that this is the biggest issue and challenge that faces us as a city.'",
        "'speaker_0': 'There is no bigger issue than the issue of homelessness. And it's not an issue that just is affecting us, but it is affecting every major city in the state of California and cities that often never had a deal and never had to experience what it's like to work and see people experiencing homelessness and the tragedy that that'",
        "'speaker_0': '. That is. I'll also say that one thing that's very important for us as we think about this report is that particularly when we talk about funding this issue and the issue around homelessness and more broadly, the issue around housing will be the number one issue that our incoming governor.'",
        "'speaker_0': 'We'll go and work on in this first year. I know that he has asked for plans and ideas and funding opportunities that could make its way through the legislature this year. And so I will say that once this council adopts an official plan, and certainly there are a lot of policies that will have to be discussed and'",
        "'speaker_0': 'of course, voted on separately. All of those will happen, you know, not today, but other days. This are an opportunity for us to have a document and a plan that is ready for the governor and for the legislature to begin working on right away.'",
        "'speaker_0': 'And I'm really proud that we will have something to share as a starting point and something to guide our work ahead. And so I'm very optimistic that on the funding. We are better positioned than most cities to really begin.'",
        "'speaker_0': 'I'm seeking support from the state. As a member of the governor's transition team, this certainly will be the key issue that is highlighted at the table from myself, but as well as I know from others that are part of that team as well.'",
        "'speaker_0': 'It is, I think, almost everyone's top issue that are members of of that team. Let me also say that there are some things that are significant about this report that we've never done before in Long Beach. The first is it's important to recognize that those that were at the table included business leaders, included providers, including folks that'",
        "'speaker_0': 'actually have experience homelessness and of course, those who are doing the work every single day for the first time. And this is something that I asked for early on of the task force and a staff. We have actually set targets.'",
        "'speaker_0': 'If you look through your report, the report is actually full of numbers and data and actual targets. As a city. We actually have not done that before. We have not. We have always said we need we know we need more emergency shelter beds.'",
        "'speaker_0': 'We know we need permanent supportive housing. We know that to prevent. Additional people from falling into homelessness. Which staff estimates is thousands of people a year. We know that we need additional housing opportunities and the type of supportive housing that we have.'",
        "'speaker_0': 'For example, at the Villages at Cabrillo, which is really the model for for the future. And this report really talks to those targets and it sets numbers that were developed by staff and the task force. Around emergency shelter beds, which they set at 200 around permanent supportive housing, which they set at 200 additional units by 2023.'",
        "'speaker_0': 'And of course, around low income housing that is needed for homeless veterans, for families, for for people that are trying to get off the street. And that we can have access for people to go. These are the first time that we have actual numbers as presented by staff and by the group.'",
        "'speaker_0': 'I will also attest, important to note that we are building already a lot of this housing, so we have 5000 units currently in production. We also know that most of those units. Are in the downtown and around the downtown.'",
        "'speaker_0': 'And we know that we have a need for more projects like the project that's currently under construction at Anaheim. At. I'm sorry, at. Anaheim in Long Beach Boulevard, which is the Beacon Project, which is right now under construction and is building exactly the type of units that we're talking about supportive units for seniors, supportive units for veterans'",
        "'speaker_0': 'who are experiencing homelessness, supportive units for families. And so we know that we can do this work. We are doing it already, but now we have some targets. And for me, I like having numbers on the board and being able to see our progress every year to ensure that we're making our targets.'",
        "'speaker_0': 'I'll also note that this report does something else that we found to be interesting at the task force, which is that all of these organizations. Whether it's Cal State, Long Beach, Lombard City College, the school district. And I see our superintendent who was on the task force is here as well.'",
        "'speaker_0': 'Our hospitals and our providers. And the city. We we're all not sharing data. And while some information is being exchanged, we are all seeing the same people in different capacities. When the hospitals bring people in and the hospitals are seeing individuals that are homeless every day.'",
        "'speaker_0': 'That information is not rerouting back into our service delivery model. When Lombard City College is seeing students who are experiencing homelessness in their food pantry or going signing up for their classes, we're not connecting them directly to services that might be available at the Multi-Service Center.'",
        "'speaker_0': 'And so this idea of creating master data sharing agreements and perhaps a platform where all of this leads is something that we need to really work on as a community. There is an opportunity for all of us to do this work, and we're already doing it.'",
        "'speaker_0': 'In fact, when it comes to our Long Beach College promise, and if you look at the college promise and what what we've done around that program, there is incredible data sharing that that is happening. And so I think there's an opportunity for us and these recommendations to really begin to share information and be able to identify who'",
        "'speaker_0': 'we are talking to, what assistance they need, and know what we can do to improve their condition and their families condition. I will also just note that in this in this report, besides the direct targets on on housing, I'm very grateful to the focus on employment.'",
        "'speaker_0': 'There is a goal here to ensure that we are creating at least 600 new jobs for people experiencing homelessness. There are other recommendations around restructuring our workforce development work and engaging the Chamber of Commerce. Our bids and business leaders for programs are on opportunities to bring in people that are experiencing homelessness.'",
        "'speaker_0': 'And the idea, of course, is that folks should have access to work. But we also knowing what those barriers to work are. And that's ensuring that people that we're working with people to help clear records within our legal framework that we have and to ensure that we are providing the resources that people need.'",
        "'speaker_0': 'To get work. How do we expect people to work when they have nothing to show up in to work or may not have access to a computer? I may not have access to a place where they can even get a return phone call back.'",
        "'speaker_0': 'We also are aware and I think this is something that's very important and one that I personally am going to take up as a personal mission of mine besides all of this and hear. Is this goal set to create at least 400 new childcare slots for our low income families?'",
        "'speaker_0': 'We should be proud as a city that thanks to the work of Lambert Unified, especially, I think more than anyone in the city, we have increased the number of preschool seats and early childhood ed centers. And I really learned and focus on this idea of educating the child from birth through the school system and more of our'",
        "'speaker_0': 'low income kids. And low income youth today are in a pre-K or early childhood program than they were a few years ago. But there is still a need. And so if we can work together with the school district and with the state, who is looking at passing a comprehensive early childhood ed plan?'",
        "'speaker_0': 'We might be able to get some direct funding to really come closer to achieving universal preschool and to ensure that if there is a child experiencing homelessness with their family, that they have access to child care immediately. And so this is a great target and one I think that we can also take to the state and begin'",
        "'speaker_0': 'to work on. I also want to add that I think it's important to note that everyone on this council has contributed to this conversation and has stepped up in a variety of ways, and I'm really proud of everyone for doing that in the last few years.'",
        "'speaker_0': 'We have across the city committed to opening up our new mental health center in in the center of the city. We recently opened up the county partnership and the crisis emergency center up up just north of that. We have we have moved and ensured that our winter shelter is operational and part of the community, thanks to Councilman'",
        "'speaker_0': 'Austin. And we have continued to grow our income units and support low income folks, especially through the development of affordable housing for. Homeless individuals, which many of these units are for. Across across the city. And everyone here is working on these challenges.'",
        "'speaker_0': 'You've seen numerous pieces of legislation, whether they've been around motel conversions and housing from Councilman Richardson or whether they've been in a variety of other issues from Councilwoman Susie Price on the issue of homelessness and on addressing the challenges that we have as a community.'",
        "'speaker_0': 'And of course, everyone on everyone up here has contributed and is willing to to work. And so I just want to thank everyone here. They feel like everyone understands that this is a huge challenge. I also will. Well we'll just say and to to conclude my my points is every no reporter plan is static and exists permanently'",
        "'speaker_0': 'in one form. This will evolve. This will grow. This will change as we add and learn from what's working. What's not working. But I do think it's important for us to have targets. And I do want to thank everyone that's been involved in this work.'",
        "'speaker_0': 'And we have to all work together to really help solve this challenge. And so I just want to, again, thank the staff for for their work. And oh, and I'm sorry. And finally, I will say the idea of.'",
        "'speaker_0': 'Reforming our current continuum of care board to an umbrella wide organization that would include all of our partners, including our education partners in our hospitals and the private sector. I think is also a very good recommendation, which I'm very excited about.'",
        "'speaker_0': 'And so thank you again to everyone. And I know we have a lot of council questions and comments and I want to begin by turning to those. So with that, Councilmember Pearce.'",
        "'speaker_2': 'Oh, great. Thank you so very much, Mayor. And thank you. Staff. I know that this council gives you a lot. We are not short on ideas, that's for sure. Obviously, it's just the resources to get those ideas across the finish line.'",
        "'speaker_2': 'But I want to thank you guys for trying to put that in a comprehensive box so we can really understand all the areas that we're working on. I want to also say thank you so much for the task force, for the group that have been doing this work.'",
        "'speaker_2': 'A lot of you guys are volunteers that might not be in aligned with your direct mission as your organization. And so I just really want to recognize and appreciate you guys for stepping up for the last six months and know that it is here.'",
        "'speaker_2': 'And we are going to take this report and really try to put teeth to it. So I have not a lot of questions. I have just a few. I know when we have talked about different items, like we just got through the first part of our short term rental, we've got through identifying some funding for transitional parking'",
        "'speaker_2': '. We're talking about the inclusionary housing policy. When we talk about the funds needed, are we looking at what resources we need as staff? I mean, in my mind, looking at all this work, this is a 3 to 5 year plan to be able to get where we need and have we identified we need extra staff and development'",
        "'speaker_2': 'services or we need extra staff in the health department.'",
        "'speaker_5': 'Okay. So yes, certainly. So I'll let Kelly talk specifically about some of the estimates. And these are estimates at this time. But this all gets done with people while we have a need for capital funding and we try to spell that out in the report.'",
        "'speaker_5': 'That could be for things like affordable housing and shelters and buildings. A lot of this needs to have an ongoing, stable funding source, and that is funding city staff. Kelly.'",
        "'speaker_6': 'So we haven't narrowed it down to specific numbers. But generally as part of the the 25 million that you see includes all the funding that we would need to be able to to staff all of the different aspects of it, as well as the data and the governance and all of those different pieces.'",
        "'speaker_6': 'So we currently the staff, at least in homeless services, are primarily funded through the continuum of care. And so the focus there is around community of care as it would be able to expand. Beyond that, we're going to have to look at additional funding, but that is built in.'",
        "'speaker_6': 'That was part of the estimate in that part, yes.'",
        "'speaker_2': 'And one of the reasons why I bring it up, as I know I've had this conversation with city staff a couple of times and I know bureaucracy. Sometimes we move a little slow, but particularly when we're throwing everything at you guys and trying to prioritize it.'",
        "'speaker_2': 'But recognizing like with the inclusionary I know we've brought on consultants, that work has been started and staff is telling us it'll be a year before we have a policy in front of us. It's been three years since we've been talking about it.'",
        "'speaker_2': 'So just wondering for thinking outside of the box about how to get that work done on a shorter timeline. So I don't need an answer on that, but just hear that that's a concern that I have, is that we're doing a lot of work and what is it going to take to kind of bring some of that'",
        "'speaker_2': 'low hanging work home? That's not necessarily capital. But again, you guys have done a fantastic job, so don't let me jumping right into questions, diminish the fact of how proud I am of the work that's in front of us.'",
        "'speaker_2': 'One other question I had on demographics. I'm looking at the presentation that was presented today and it says 30% women and the remaining men. I'm curious what happened to the transgender number?'",
        "'speaker_6': 'So 33% of the of those who are identified on the street were LGBTQ. So we didn't break out transgender versus versus non transgender in this last count.'",
        "'speaker_2': 'Okay. And the reason why I bring that up is I think it's important that we talk about LGBT seniors, youth and today as well, but understanding that those populations each have a very different resource need and health need.'",
        "'speaker_2': 'I mean, you're talking about somebody that might be in the middle of, you know, some type of transition. And so leaving them out of the conversation and we've just had two or three items talking about our transgender community, I think it's a little short sighted.'",
        "'speaker_2': 'So I want to make sure in the future that we are pulling those numbers out.'",
        "'speaker_6': 'It was agreed. So one of the key pieces was in goal seven is really understanding that there are different levels of service and things that we need to address separately. So we didn't in the count ask specifically the question around transgender.'",
        "'speaker_6': 'And so that's why I can't call it out differently. There was it's so it's 3% overall, but that may be something we could do in the next account in January. We'll have to look and see what the survey looks like.'",
        "'speaker_2': 'I appreciate that. I thought I had saw the number in a previous report and then saw it left out in this one. So yeah, if we could include that in our in our homeless count.'",
        "'speaker_6': 'Sure. We'll look at the possibility of doing that.'",
        "'speaker_2': 'Thank you. I appreciate that. And then the one thing I wanted to say just for for folks listening and really trying to get my head around, we often feel like we're throwing a lot of ideas at this, this challenge that we have.'",
        "'speaker_2': 'And I know across the city, different parts of the cities have different beliefs on why people are homeless or what's what's happening with them. But I think the numbers that you provide, I mean, putting it together, 50% are homeless because of jobs, incomes or bills, not because of drug addiction or incarceration.'",
        "'speaker_2': 'And so I really appreciate you know, I was looking at the list that you put together of who was on the the task force. And it was good to see some of our business leaders on there. And thinking outside the box on that one thing that we brought up a couple of years back, but I don't think'",
        "'speaker_2': 'we agenda is it and I really haven't had conversations with folks until I looked at this report. One idea that was brought up to us by somebody in the apartment association was renters insurance. And the fact that renters insurance doesn't just cover if your home is burglarized, but it also covers damages done to the home by a'",
        "'speaker_2': 'renter. And so I'm curious if we've had any conversations around that. I think Michigan has some requirements to have renters insurance. And then there's another type of insurance called gap insurance. So wondering if we've had conversations of the biggest challenge, 50% is jobs and income.'",
        "'speaker_2': 'If there's a gap insurance option where you say you pay instead of $10 a month, you're paying $25 a month, and then it might provide you a cushion whenever you lose your job. Unexpectedly.'",
        "'speaker_6': 'Insurance was not part of the task force conversation, but it could be, you know, it would be something we could look at in the future.'",
        "'speaker_2': 'Yeah, I see it. I think it would go under. So. The incentive to engage landlords. There was an idea brought up by the apartment association, so I think I've got a memo I'll share with you guys, but I would love to see that in conversations moving forward and maybe that's a great thing at the state level to'",
        "'speaker_2': 'be talking about. Is is there a gap insurance option?'",
        "'speaker_6': 'Okay.'",
        "'speaker_2': 'Give me a second. Again, I think that the tracking I love the idea. As a mayor, I go around sharing information. I have numbers from the LGBT center on what they believe the LGBT homeless population is. I have numbers from my girls in action that say one in seven youth are homeless.'",
        "'speaker_2': 'And so while we have the count, I think being able to across the board, who do you have that's struggling? Are they sleeping on a couch? Therefore, they're not considering themselves homeless, even though they're looking for transitional support.'",
        "'speaker_2': 'So I think that those are all things that I would love to see in the future. And the biggest and the last thing is just timelines. When we talk about a strategic plan like I've done for nonprofits in the past, it's how do we prioritize and how do we say, okay, these three things work together.'",
        "'speaker_2': 'So here's our timeline. And working with the council officers on resources, I know this issue is really important to a lot of us. And so I've got great staff there itching to to help out. And so just thinking strategically about how we prioritize them and how we leverage the stuff that we have on on our teams.'",
        "'speaker_2': 'The last thing is the child care. So you mentioned co-op models. One great co-op model that I would love to work on with the mayor at the state level is a co-op child care model. Where you have co-op, you're building ownership with those that are providing child care to those that need it most.'",
        "'speaker_2': 'And so I'm really excited about working on that as well. I will let my colleagues speak now. And just again, congratulations to the team, to everybody that's played a role in this. And I'm really looking forward on getting some timelines and next steps.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Price.'",
        "'speaker_7': 'Thank you. I too want to echo the comments of my colleague and thank staff and the members of the task force to their excellent work on this on this endeavor. It absolutely is a much needed discussion that we need to have, and I'm grateful that we're having it together with the members of the task force, because I'",
        "'speaker_7': 'think that it's it's just a multifaceted issue. And although there are groups that believe there's one solution, I believe there's multiple different areas that we need to be looking at this and approaching the situation from several different vantage points.'",
        "'speaker_7': 'I don't believe there's one need or deficiency that if we were able to solve it would solve the problem because that's not been replicated any other place in the country or internationally. I do have a couple of questions that I that I had based on the report, which was excellent.'",
        "'speaker_7': 'But are the demographics that we've noted in Long Beach similar to similar sized cities within the region?'",
        "'speaker_6': 'Yes, there.'",
        "'speaker_7': 'Are in terms of gender, racial demographics, that kind of thing or.'",
        "'speaker_6': 'Well, the city of Long Beach is more is is more diverse in its demography than many other cities around us. And so it reflects it reflects that demography overall. But I think in terms of around substance use and mental illness and others, it it reflects what we're seeing in other locations and nationally.'",
        "'speaker_7': 'What about the data on the cause of homelessness? Is that data derived from the point in time count?'",
        "'speaker_6': 'No, it is not. It's a national study that was brought that was brought forth. And so those are national numbers.'",
        "'speaker_7': 'Okay. So those aren't based on in Long Beach, are we able to do any sort of data gathering when we do our next point in time count for our local homeless population to find out what some of the individual demographics and causes of homelessness might be?'",
        "'speaker_7': 'Is that something that's a possibility?'",
        "'speaker_6': 'We are working on developing the survey at this time and we're working on it. There are so many data elements we want to capture and it's just how long will someone speak to us in the middle of that, you know, early in the morning at a park.'",
        "'speaker_6': 'So we will be working to capture as much data as possible, and we can look at that as one of the data elements. Certainly.'",
        "'speaker_7': 'Great. I agree with the mayor and Councilmember Pierce regarding data sharing. And this is something we've been talking about for a long time. And I think it's that has to be the number one priority right now, because figuring out a way to connect multiple departments and multiple agencies is something that is critical, I think, to our long'",
        "'speaker_7': 'term success. Whatever solutions we decide to implement, if those solutions and services aren't shared among multiple agencies, then they're really not as effective as they can be. So figuring out through the use of technology how we can share data is is really important.'",
        "'speaker_7': 'And, you know, one of the things that I'm going to talk about when I give some of my comments is, you know, we have as a council and I agree with the mayor wholeheartedly that everyone on this council has taken a part and trying to figure out what to do with this problem, because it's affecting our residents'",
        "'speaker_7': ', it's affecting everything that we see, what we read. And so if you look at the past two years on this council, I know several of my colleagues and I have brought various items to try to approach this issue in a piecemeal fashion.'",
        "'speaker_7': 'I, myself and Jack and I have put together a list. We've brought 15 items in the last year and a half to deal with homelessness or homeless related issues or quality of life type issues infecting residents. You know, things like requiring our police department to use to carry Narcan so that they can take advantage of the opportunity'",
        "'speaker_7': 'to reverse symptomology of of an overdose. Things like better enforcement mechanisms that within the law take take some of the public safety or public health threats that we've seen away, things like, you know, how we can design our environment such that they're safer, how we can you know, last week we brought an item that talked about having'",
        "'speaker_7': 'an audit of the number of shelter beds and service beds that are available. And so I think we've approached this issue a bit piecemeal because frankly, we're all looking for out of the box ideas that are implemented by other cities in other jurisdictions that we might be able to try here.'",
        "'speaker_7': 'Our homeless work program, which was an item that we brought, is one such example. And so I'm grateful that we're having this discussion. But all, every item that we've brought really can benefit from data sharing and data sharing methodologies because there's so many different departments involved with addressing the homelessness issue on a day to day basis.'",
        "'speaker_7': 'This the. Access to services. Opportunity for services. Availability of services. All of that can be made much more efficient with data sharing. So in my opinion, that should be a major priority. I know that we as a council have also discussed providing incentives for landlords to take vouchers.'",
        "'speaker_7': 'Do you know what the status of that endeavor is?'",
        "'speaker_6': 'Currently the measure h funds incentives for people coming through the homeless services division. So we are able to do that specifically for people who are homeless. It does not provide funding for people who are not coming through the coordinated entry system.'",
        "'speaker_6': 'So if someone is if someone is eligible for a housing choice voucher but does not have access, is not homeless, then the incentives do not apply. So one of the recommendations within this report is to look at various incentives to be able to do to be able to do that.'",
        "'speaker_6': 'At this time, we haven't had the funding to be able to provide those those incentives. And so that program has not moved forward.'",
        "'speaker_7': 'Okay. That's good to know. Do you have any thoughts on what accounts for the 250% increase from last year and reports of homelessness?'",
        "'speaker_6': 'Yeah, I think so. What we've seen is while there's a decline in homelessness overall or that we saw in the 2017 count, is that that we see homeless people in different locations than we used to see them. And so, you know, as we've seen and you've seen the maps before, there's been a sort of shift as to'",
        "'speaker_6': 'where people are, where people are spending their time, and they've moved into neighborhoods where they didn't used to be in neighborhoods before. And so I think what is happening is that with more people are now being faced with homelessness in their communities and so that they're calling for additional supports and trying to figure out what to do'",
        "'speaker_6': '. We get calls about how do we help? And then we get calls about, please come help somebody. Or sometimes it's please can move this person. So it's really a mix of different calls.'",
        "'speaker_7': 'I know that in for the winter shelter and looking at the stats from last year there there was routinely vacancy at the winter shelter. Yes. What what how do you. I'm just trying to educate myself. How do we.'",
        "'speaker_7': 'To account for that. If the housing need is great and shelter space is something that we need, why is it that we have vacancies at our winter shelter?'",
        "'speaker_6': 'Sleeping in a shelter. Um. But it comes with structure, it comes with rules, it comes with things that many people who live on the street are not ready to engage in. And so if unless the weather is really bad and last year it was a pretty mild winter, there was not as many needs for people to move'",
        "'speaker_6': 'forward. When the weather is worse, we find much higher utilization. In the past, we've oversubscribed it and we fit people wherever we could find them. But so we do market. I mean, we we get the information out there through all of our providers.'",
        "'speaker_6': 'And everywhere we can, there are pickup locations. So people can't just walk up. There are pick up locations. We have three this year. We had two last year because of all the construction that was growing and continues to go on.'",
        "'speaker_6': 'But we were able to identify a third site. I think that that will help as well.'",
        "'speaker_7': 'And so that that leads to a really great point. If if. Having to adjust to a structured environment if that is a hard thing, which I granted, it absolutely is for individuals who are living on the street. How would additional housing assist us in getting those folks to accept the structure and and overcome that?'",
        "'speaker_6': 'That's what permanent supportive housing does. So as I as we've talked about, you know, an average of 17 contacts on the street. That's relationship building. So it's ongoing relationship building either through outreach team or quality of life teams, the heart team.'",
        "'speaker_6': 'Everybody out there is kind of the relationship that if someone is finally ready to come in. So the winter shelter doesn't have the opportunity for those relationship building. And so once that relationship is built and there's the beginning of an engagement and service, then at that point we start to really be able to build capacity.'",
        "'speaker_6': 'But we know that when people move into housing, sometimes they're sleeping on their balconies, sometimes they're putting up a tent in the living room, sometimes because they're trying to recreate what was comfortable. And so it is it's a long term change process that needs a lot of support.'",
        "'speaker_6': 'And the winter shelter doesn't it doesn't meet the same levels of capacity.'",
        "'speaker_7': 'And probably a year round shelter wouldn't either. That would just be a temporary solution.'",
        "'speaker_6': 'The year round shelter would be something that people could stay in for longer periods of time before they get access to other kinds of other kinds of shelter.'",
        "'speaker_7': 'I'm sorry, Kelly. Can I ask you to repeat that? I apologize.'",
        "'speaker_6': 'All right. You two over there just came the the year round shelter would allow. So the winter shelters, nightly people leave, you know, so it's open at 5:00 at night and people leave at seven in the morning. The year round shelter provides for longer term access.'",
        "'speaker_6': 'So if people are working but need shelter until they can afford to move into them. So there is that possibility of more engagement and service.'",
        "'speaker_7': 'Okay, that's great. And you touched on a really great point. I mean, I think everyone here has an opinion of what they think would mitigate or potentially even solve homelessness. In my opinion, I think that outreach is there's nothing more effective than individual outreach.'",
        "'speaker_7': 'There's nothing more effective in changing the course of someone's life than support relationship building, providing opportunities for substance abuse or mental health counseling and assistance, providing job skills and training life skills, and really supporting people through that process.'",
        "'speaker_7': 'And you see it all the time when people, you know, in my day job, when you see people go through a court incentivized treatment program, which basically is a court order and they go through that collaborative process, you see amazing transformations, but that's based on outreach.'",
        "'speaker_7': 'And so investing in future, an additional outreach, I think is is a very important part of this puzzle. You know, one of the consequences that we've seen as a result of the increase in homelessness or the redistribution in homelessness in terms of going into neighborhoods, is impact on quality of life for residents.'",
        "'speaker_7': 'And I think that's something that we really have to address and talk about. And I know sometimes that comes across, as, you know, maybe off topic a little bit, but it's hard to have the conversation about preventative and supportive services for homelessness without the discussion about what do we do with the impacts that some of the residents'",
        "'speaker_7': 'around us might be experiencing in terms of being victims of crime, even if they may be lower level crimes? And what are we doing to responsibly, humanely and productively address those issues so that individuals have the opportunity to get help that they need?'",
        "'speaker_7': 'For example, our in-house jail clinician. That's not one of the topics that was highlighted tonight, but I think that has been an amazing program. And the fact that the police department has picked up that clinician's salary for the remainder of the year I think is huge and it is something that I think we should invest in more'",
        "'speaker_7': 'because when you have the opportunity and you get somebody at the moment where they want to take advantage of services and they want to participate in something that might be life changing, I think you want to invest as much resources as you can into that moment.'",
        "'speaker_7': 'The quality. The I team a few years ago did a presentation on high frequency offenders and they found that between and I, I'm going off the top of my head here. But what I believe was something like 835 individuals had committed.'",
        "'speaker_7': '12 or more offenses in a period of, I believe it was 2012 to 2016. And when they interviewed those individuals and again, those numbers may not be exact, I'm literally going off the top of my head from a presentation that was a couple of years ago.'",
        "'speaker_7': 'But the gist of it was that 47% of those individuals that were identified as high frequency offenders listed themselves as being homeless. Less than 5% listed their address as a P.O. Box or connected with a nonprofit provider, which which clearly indicates that we have individuals who don't have a permanent residence, who probably don't have a job and'",
        "'speaker_7': 'are probably committing these quality of life offenses out of necessity, whether it be, you know, urinating in public or camping illegally or, you know, theft, minor theft. And those are things that we really, I think, need to focus on in terms of as a result of the homelessness situation, the residents might be experiencing some of these quality'",
        "'speaker_7': 'of life impacts. And so I think that some of the programs that we've participated in and really focused on, like the jailhouse clinician, have been very valuable. And I and I hope that we're able to find those more so that we can have more of those resources for individuals who do, you know, find themselves in the criminal'",
        "'speaker_7': 'justice system and also our investment in diversion programs. We've done a really great job, I think, as a city in investing in diversion programs, and I think that's been really, really important. You know, the one thing I've gone on a few ride alongs with our homeless outreach team and the one thing that repeatedly comes up is the'",
        "'speaker_7': 'lack of detox beds. And I'm glad that that was included in this report. But what is the plan for us to increase the number of detox beds we have? Because that is such a barrier to entry for a lot of housing.'",
        "'speaker_6': 'It is. So funding for substance use services is L.A. County funding. And so the L.A. County subsidy, their substance abuse prevention and Control Bureau right now is actually in a needs assessment process. So you've asked for a needs assessment around that.'",
        "'speaker_6': 'That's not data that I have, but they are doing it. And so I'll be bringing that back to you when it becomes available. So what the what the issue is, is, one, provide finding providers who are willing to be providers around detox and then looking at the different abilities to fund it.'",
        "'speaker_6': 'Some of the services are available through Medicaid. So it's so it's covered detox in many cases and not a covered space. And so we have to figure out all those different things to try and bring it in. But we'll be looking very closely, working very closely with the county to identify those possibilities.'",
        "'speaker_7': 'Okay. And I know the city wide data on the demographics of our homeless population, but every right along that I've been on and every officer I've talked with, substance abuse and mental illness, seem to be major factors in terms of what they're seeing when they interact and try to do outreach.'",
        "'speaker_7': 'And so I think investing in additional training that helps to deal with those populations is also really important. You know, I'm going to finish my comments here by just sharing one thing, and I shared it with our city manager today.'",
        "'speaker_7': 'We have all as a council come together with different ideas that we've seen used in other cities, things that we've seen, tried and presented them as far as possible pilots in the city of Long Beach. And that's great.'",
        "'speaker_7': 'And while I think it's good for us to be proactive, I think this is an issue that affects multiple departments in the city. And I think we as a council should really think about prioritizing a single individual that's housed out of the city manager's office that can take charge of the homeless issues and coordinate all of the'",
        "'speaker_7': 'departments and address all of the different factors that are associated with homelessness. That individual should be the one that's coming up with ideas that they've seen tried in other cities that we can implement. As a pilot here, that individual would be working out of the city manager's office, so there would be no single focus, whether it's, you'",
        "'speaker_7': 'know, housing, enforcement, health, you know, treatment, all of those things would not be to various departments, but they would be housed within the city manager's office so that they provide a focal place for us to be able to, you know, have the fresh ideas, the out of the box ideas come because it may be that right now'",
        "'speaker_7': 'the health department has taken the huge burden of this topic. You absolutely have. But there are pieces of this crisis that really are outside the scope of the health department, and it's not fair to request the health department to solve those issues.'",
        "'speaker_7': 'So if we get a call from residents saying there's, you know, a homelessness situation and someone is afraid for their life, let's say, because someone's mentally unstable, that's really not an issue that the health department should have to carry the burden on.'",
        "'speaker_7': 'That might be a police issue and that kind of thing.'",
        "'speaker_6': 'So just there is an inter-departmental team that meets across all of this. So there so while the Health Department does lead a lot of these efforts, there is strong coordination on the ground for just those kinds of calls.'",
        "'speaker_6': 'So I'm sorry to interrupt, but I just like so there are there many opportunities where all of our departments are on the street in contact every day about addressing things, but there is a recommendation within their support as someone who really overseeing and coordinating like not just around identifying possible opportunities for additional funding, but what does it'",
        "'speaker_6': 'look like to help look at it as an overall system? So between the continuum of care board and that that's that is one of the key focus areas of the recommendations.'",
        "'speaker_7': 'Great. And please don't mishear me. I am so proud of the coordinated effort that the city does with multiple departments. Please don't miss hear me on that. I, I absolutely am aware of that. And I think that is a very, very positive aspect of what Long Beach offers in this area.'",
        "'speaker_7': 'I do think, however, that we should have a like a homeless czar type person whose number one focus is to focus on the issues of homelessness. It should not be a council office that's expending over 40 hours to put together an agenda item based on research that they've done for projects throughout the nation.'",
        "'speaker_7': 'And to bring that back, you know, we brought an item over a year ago. It was called Comprehensive Approach to Homelessness. You know, I will say candidly, it was not met with open arms. It took our team weeks and weeks to put that item together.'",
        "'speaker_7': 'And I would encourage and ask that that you go back and look at it, because what it was was us researching all these different programs that have been utilized from housing to substance abuse to mental health. Everything that we have seen done in other states to say, is this something we can try in Long Beach?'",
        "'speaker_7': 'What would it take for us to try this in Long Beach? We appreciate that that we had the opportunity to do that, but that we're not subject matter experts. And it would be nice to have a subject matter expert within the city who's focused on homelessness, not just the housing piece, not just the health piece, not just'",
        "'speaker_7': 'the criminal justice piece, but the totality. And looking at it, there are a lot of other cities that have done that. And how's that? Homeless coordinator, homeless czar, whoever, whatever you want to call it, within either the CEO's office or the city manager's office in order to give it some independence and objectivity and neutrality outside of connection'",
        "'speaker_7': 'with a particular department. Because this issue affects every department. It affects our development services in terms of our zoning and density. It affects our police department, it affects our public works department, it affects our health department. Every department is affected by this.'",
        "'speaker_7': 'So in my opinion, it should be the city manager's office that has someone in-house that that coordinates and oversees the program. But but that's not to take away from the amazing work that we've been doing. And certainly it's just me sharing candidly some of the observations in terms of what other jurisdictions have done.'",
        "'speaker_7': 'But I think this was an excellent report and I look forward my my hope would be that we have a plan that comes back that, as the mayor suggested, there are some specific, quantifiable goals associated with. This report.'",
        "'speaker_7': 'It would be great to have a plan come back. That would be the city of Long Beach's plan that has these quantifiable goals and these recommendations incorporated therein that we can really follow and track and work towards as as a council.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilmember Richardson.'",
        "'speaker_8': 'Thank you, Mayor Garcia. I have a lot of notes. I just have to say, I really love this approach. You know, it started with convening a group of stakeholders. You know, multidisciplinary, different backgrounds, different expertize, opened up a forum for people to come out and share.'",
        "'speaker_8': 'And in the end, you have a very clear book that frames the context, gives the data, and gives very clear recommendations. I really appreciate the support this approach, especially with an issue as complex as homelessness and housing. This makes it very much easier for us to understand our role here as city council and how we can help'",
        "'speaker_8': 'move this plan along. Specifically, I want to give some attention to the sit in the context page in the report. It's balanced. It's not just focused on the responsibility of the individual that's facing homelessness, but it does address systems, largely economic systems, and aligns well with the focus that the Economic Development Committee and the Economic Development Commission'",
        "'speaker_8': 'and Department are taking up with economic inclusion focus. I also love the context of upstream versus downstream, and the visual was very clear. I'd never seen that before, but to me it's smart. You invest in upstream, you save money downstream.'",
        "'speaker_8': 'The more you place in upstream, the less you have to spend downstream. And it's very similar to this this change we made around violence prevention. If we spend and make more investments into violence prevention and youth development, then on the back side, you spend a lot less.'",
        "'speaker_8': 'You save money on the sit to the entire system. So I think that makes sense there, you know. You know, I've heard a number of colleagues talk about, you know, all the things that the council has done is true.'",
        "'speaker_8': 'We've we've come up with idea after idea, and it's almost impossible to, you know, place it all together. But this this attempt I see a lot reflected here. You know, I know we talked about we had a comprehensive item where we looked at landlord incentives.'",
        "'speaker_8': 'I know that we've rolled out the funded portion that goes toward homelessness. And I was a part of our strategy. We had we had funding identified to sort of target those vouchers and landlord incentives to those experiencing homelessness.'",
        "'speaker_8': 'Homelessness. And the idea was that, you know, if there is funding to deploy, let's figure out how to deploy those as fast as those funds, as fast as we can to those who need it most. That made sense.'",
        "'speaker_8': 'Now we can probably it seems like they're supported here at the council to identify more more money to expand this outside of just homelessness. But people on the brink, I know that a part of that conversation was also creating the policy around establishing a nondiscrimination policy on source of income, essentially saying that you can't, you know, advertise'",
        "'speaker_8': 'we don't accept Section eight. You have to look at, you know, evaluate the profile of every single prospective renter. I think that makes sense. I love the focus on the conversation about, yes, we need a permanent Year-Round shelter.'",
        "'speaker_8': 'I've expressed support for this, but that's only a fraction of the shelter beds that we need. It's 125 of 600 beds that are needed. And so we have to really focus on what's next beyond this year round shelter house to expand shelter beds.'",
        "'speaker_8': 'I want I'm going to get to this later. But the dedicated revenue for housing development is very clear here. And I think that's important because it's not something we can hide from. It's something we have to deal with.'",
        "'speaker_8': 'And I appreciate that motel conversion is included here because, you know, it's it's low hanging fruit and other cities are engaging in this. And they could help us free two birds with one key by addressing our nuisance motels, investing into those to create real transitional housing opportunities.'",
        "'speaker_8': 'The context of this this report really tells me that there's two needs from the city council. One policy. There are a number of policies here. And in order for us to really understand and implement those policies, we're going to need a timeline to go along with this.'",
        "'speaker_8': 'So a timeline understand if there are ten different policy items associated as report and we're already talking about council meetings are running longer. And in all of that, we need to have a realistic understanding on when these are going to come to council so we can be prepared to deal with it.'",
        "'speaker_8': 'Are we going to dedicate one month in 2019, one month to housing and bang everything out? Are we going to space it out? You know, one major housing piece per quarter. I really want to understand a timeline so that we can really approach this with utmost seriousness.'",
        "'speaker_8': 'The other part that I know that we're going to need is is is funding. And I know that that, you know, we advocated for funding in this last budget, $50,000 to kick off this conversation. I have some content.'",
        "'speaker_8': 'I have some some feedback to give today, but I think we should kick that off immediately. Next, in terms of back to the context, you know, on this first page setting the context, there's a very interesting statement that I you know, I appreciate that how candidate is in placing this into the report because I know there have'",
        "'speaker_8': 'been other reports and there's been resistance with placing this in. So I want to call this out. I want to read this out. It says, African-Americans are approximately 13% of the population in Long Beach, but are one third of those experiencing homelessness.'",
        "'speaker_8': 'This overrepresentation in the homeless population mirrors poverty and unemployment trends within the city. Historical housing segregation practices that led to decreased homeownership and housing access nationally and in Long Beach has led to long term impacts on the financial success of the city's African-American population.'",
        "'speaker_8': 'I know that it took it took effort, and I know that it was a little bit of a risk to speak so clearly. But this is this is essentially the way that we have to begin to think about things and address racial equity in our city if we want to continue to if we value diversity, if we'",
        "'speaker_8': 'truly do, we have to acknowledge and address those populations who are having a difficult time surviving in our city if we want those communities to continue to live in our city. It's a it's a moral and social and economic essential in our in our city.'",
        "'speaker_8': 'We have to we have to focus on this. So I think we should dig a little bit deeper. And given the magnitude of this with the African-American community moving forward, I think that we should involve African-American leadership into this discussion to a greater degree.'",
        "'speaker_8': 'So there's a few, few other things I just want to kind of call out here. So on the page where he talks about recommendations. You know, I think all these recommendations are great. We've talked about the motel conversion.'",
        "'speaker_8': 'We've talked about the source of income prohibition policy, but where it talks about identifying properties and incentivize property owners to look at shared housing models. That was also a recommendation from the EC in the economic development work around the everyone in initiative.'",
        "'speaker_8': 'And since then, you know, the city has been given a grant to focus to bring in an organization called Project Equity that focuses on establishing worker owned co-ops. Since we're looking at co-op models for housing and co-op models for for workers, I think there's a synergy there to unite those two conversations.'",
        "'speaker_8': 'So I would I would certainly say whoever elevated this co-op piece to be represented here, we have to connect the dots there. Also on long term 2fi highlighted this says establish more geographic geographically equitable distribution of lower income housing units and supportive services across the city.'",
        "'speaker_8': 'Elicit commitments from every council district to provide for a certain number of affordable, affordable housing units. I think we have to expand that to say not just the affordable housing units, but also shelter beds. And the reality is we you know, north lobbies between districts eight and nine have hosted the winter shelter eight of the last ten'",
        "'speaker_8': 'years. And so unless we talk about that very publicly, that there needs to be I don't know what the barriers are, but there's more geography, the north Long Beach to address homelessness. And so we should we should get very serious about that.'",
        "'speaker_8': 'Next. I really love the fact that we have some some goals here, some tangible goals with some timelines, you know, reduce the number of people fall in the homelessness to 1500 or fewer by 2023. That seems like, you know, that seems like a very clear attainable goal.'",
        "'speaker_8': 'That's so I truly support that. Also, see, when we talk about reducing barriers to employment, to those with criminal histories or systems impacted by the criminal justice system, it raises a question. I see that we reference the RISE initiative and we've talked about expanding our employment opportunities.'",
        "'speaker_8': 'But the question I have is do we have a local ban, the box policy that applies to jobs and or housing?'",
        "'speaker_5': 'I think we'd have to follow up with you on the on that specific one.'",
        "'speaker_8': 'I know that we've talked about implementing statewide ballot box policies, but if we don't have one locally, I would love to see that called out here. It's a best practice in cities to start changing the culture from the culture to say when people reintegrate into the communities, they have to have a job and they have to live'",
        "'speaker_8': '. And so the man the box policy is something we should you know, we should revisit. If we haven't, we haven't already. But again, this is this is.'",
        "'speaker_5': 'And Councilmember on that, I do recall that there was that state legislation about ban the box. I believe you mean that you can't ask whether or not somebody has been incarcerated. Unemployment, you know, unemployment. So, yes, and we do with the city of Long Beach, we do adhere to state law.'",
        "'speaker_5': 'We don't ask that question anymore until after you go through the lifespan process.'",
        "'speaker_8': 'Now, that's the city, but having a local policy would apply to two businesses.'",
        "'speaker_5': 'We'd have to do more research on what this law required and whether that was just for public agencies or for.'",
        "'speaker_8': 'Okay. Well, look for I look forward to hearing back the context. I want to know if this is something that the business community would be open to, if this is something that's feasible, because if so, then we should pursue it, something we should pursue.'",
        "'speaker_8': 'There's a lot here and I, I truly plan to engage here, but I want to close out with two things. One, when we talk about the funding, the estimate to need the estimated funding that we need to meet our goals.'",
        "'speaker_8': 'I appreciate Councilwoman Pearce acknowledge, you know, requesting that staff is included. So that's good that this level of funding will deliver the non policy elements of this plan that I'm clear on how we get to that number. It's a big number, 25 million ongoing.'",
        "'speaker_8': '217 one time. Few questions that I have. Number one, we California just passed a new bond, housing bond. Has that been factored into this? The new California housing bond. It has that source of revenue been factored into this?'",
        "'speaker_8': '17, 217 million. The.'",
        "'speaker_6': 'The the bond is not. I don't believe in Patrick. Where's Patrick? You know, as Patrick, you're from Development Services. Much more aware of how the funding works through that. Sure. I don't believe that we can directly apply for that, but it has to go through non-profits.'",
        "'speaker_6': 'Is that a true?'",
        "'speaker_8': 'Yes, that's correct. None of that funding is directly available to the city. But does it will it help us close the gap? Because we have partners like century villages, Cabrillo and, you know, link housing and others. Will it help us close this gap?'",
        "'speaker_8': 'Yes, sir. Yes, Councilmember, it will. It'll be part of the funding that's leveraged with the with the funding that we contribute to the project will still need local sources of revenue, but we may need not need as much if.'",
        "'speaker_6': 'We actually the so that the 217 there is the funding the city would have to generate to leverage the rest of the funding necessary for the unit. So that actually doesn't buy you that many units. It's what the city would need to capitalize to be able to pull down and address the state funding and other resources that'",
        "'speaker_5': '. Councilmember, I think your point is, is is what color of money are we going to be looking for? We're looking for every color. So we would look for that bond money. We'd look for county money, there'd be other state money.'",
        "'speaker_5': 'There could be local money. We're not specific on where the funding source would come from.'",
        "'speaker_8': 'Okay, great. And then secondly, I know that we used to have the 20% set aside redevelopment from tax increment. We didn't have to raise our taxes. We knew it generated 2022 million a year dedicated to affordable housing. And that's been gone for five years now.'",
        "'speaker_8': 'And we do know that there are models now that to restore tax increment finance, one is the new affordable housing district and second is the Korea Community Redevelopment Investment Act. Whatever it is, they both allow for us to do a few things.'",
        "'speaker_8': 'We can establish a tax increment finance district specifically for affordable housing. And two, you can bond against it. You can bond against it without raising any taxes. You bond against that future increment. Now, I'm you know, Tom, I'm on the SAG board and we do have funding available to do a preliminary study.'",
        "'speaker_8': 'I would like for us to engage with that funding to have a top line study on a citywide, affordable housing district if we're not able to restore the 20 million a year from redevelopment. But what if we were able to restore ten by looking at this model 2 million a year that significantly would drop what we need'",
        "'speaker_8': ', cut what we need without raising taxes. So have we have we have evaluated this or have we met with SAG about this?'",
        "'speaker_5': 'So we haven't met directly with SAG on this, but we are very interested in that conversation. One of the things that staff are recommending is when that 50,000 becomes available that you appropriated in the F18 budget, I'm sorry, 19 budget, we expect that to become available in February, that we would use a portion we estimated to be'",
        "'speaker_5': 'about $10,000 to do a high level study of those revenue options so that we can fully understand them and see if we get some estimates. If there's SAG money available to do that, I'd be very there.'",
        "'speaker_8': 'Is that. Well, I know that it's available and they're looking for cities to to engage them to leverage that funding to do the top level, at least the initial analysis. So that's the final thing. I'll say that the governance structure I appreciate the fact that we put some attention to the governance structure moving forward.'",
        "'speaker_8': 'I think it's it's it's great that we have a long, broad coalition here, private sector, public sector, nonprofit developers, everyone at the table, community groups at the table, but also understand the value of having an entire department that is dedicated to this to this work and the value that it brings.'",
        "'speaker_8': 'Given that we're we're one of three cities, an entire state with a health department, I think our city managers department has deputy city managers, assistant city managers that have made sure that they've lent that city wide support from the city manager's office.'",
        "'speaker_8': 'I like that model. I like that the governance structure has been endorsed by the Everyone Home Task Force. And I think as a City Council, we should just acknowledge that this very important department has the only department head in the city that is not supported or funded through general fund revenue.'",
        "'speaker_8': 'So our health department director, her salary, her position is not funded from our general fund. And frankly, you know, if we're serious about the health department, we need to get more serious about making it a permanently funded department of our city as we're taking on these issues that impact all of us.'",
        "'speaker_8': 'And so I'll I'll close with that. Thank you all for your comments. And I look forward to continue this conversation.'",
        "'speaker_0': 'Thank you. Councilmember Councilwoman Gonzalez.'",
        "'speaker_1': 'Thanks to all the task force, first and foremost, for your hard work. I know many of you come from different angles and experiences, and I really appreciate the work as well as our health department and the mayor for pushing this forward and getting us to a plan.'",
        "'speaker_1': 'So first and foremost, I would say similar to what Councilmember Price mentioned, I think a lot of our council colleagues have had we've put together policies. I remember when I first started, I had one, and it seems like there's a lot that, you know, was included in here, but it would have been nice to maybe have a'",
        "'speaker_1': 'an aggregate policy sort of tracker of what we've done on the city council, because I know a lot of us have done that. That work in that sense? That's first and foremost. I agree with that because I think all of us have done a bit of everything relative to this subject.'",
        "'speaker_1': 'So first, on the issue of affordable housing. I love the fact that we are implementing we're saying it very clearly that it is a city wide approach and we had our short term rental rental discussion and I certainly, you know, made mention specifically about Adus and the ADU should be used for affordable housing.'",
        "'speaker_1': 'And that was the state intention. And I think that that is something that we I will continue to reiterate, and I know that other areas like L.A. and L.A. work to incentivize. And I was part of those discussions in my in my other career about how to connect people who have to use with the health department or'",
        "'speaker_1': 'with, you know, perhaps if we have the data system to be able to get the most vulnerable populations and get them into to rentals and adus. I will also say, as a committee member on the L.A. River Master Plan Committee, we are absolutely discussing affordable housing along the river, which I think is absolutely needed.'",
        "'speaker_1': 'And that is from the whole 51 mile stretch along the 710. So data sharing, absolutely important. But I will add to that is we also need a data aggregation system and I and I see this and I'll explain I see this a lot with a lot of the faith based organizations in downtown.'",
        "'speaker_1': 'We have multiple meetings monthly my staff to talk about. You know, First Congregational Church, and I'm just picking people. But First Congregational Church has no idea what, you know, Christian Outreach is doing. And Grace Church on Atlantic has no idea what first friend's church is doing.'",
        "'speaker_1': 'And I sit down with ten of these faith based and social service providers, and a lot of them don't even know what each other is doing. I've had Elsa at these meetings, and I don't know what could be done on a micro level to assist in that.'",
        "'speaker_1': 'Aggregating data to see who who has lunch at a certain hour, maybe we can supplement that. I know we've we've talked about that, but I think it's very important just to, you know, because I have downtown and a lot of the social services are in downtown.'",
        "'speaker_1': 'And I think a lot of times they just need help in that sense. It could also be in the form of a best practices guide as well. Not to influence their models because we never want to do that overtly.'",
        "'speaker_1': 'But I think just being able to provide them with some sort of best practices guide in the city of what a good neighbor policy could be. Because, you know, we've had issues in front of some of these establishments where, you know, people are lining up.'",
        "'speaker_1': 'There's encampments out front. There's a lot going on. And I know it's a lot for businesses and neighbors. So something to share there. And then access to services city wide as well. I think we just had a discussion, I know many of my colleagues have regarding our with our veterans commissioners about, you know, services for veterans in'",
        "'speaker_1': 'different areas. You know, I don't even know. Like the VA provides services in terms of health care that MSK has services, but where else can we have services that maybe, you know, mothers and children? I don't know if there's another idea on that.'",
        "'speaker_1': 'Have we discussed additional health.'",
        "'speaker_7': 'Care.'",
        "'speaker_6': 'For, you know, for people for individuals experiencing homelessness or families? So the children's clinic is loco, is co-located, multi-service center. They also have a van. And so they the they will they locate at various points throughout the city to provide service.'",
        "'speaker_6': 'There will be an additional clinic as part of the new Mental Health America Center. So they'll have an additional clinic there. So there are there are multiple opportunities through the children's clinic, as well as the comprehensive the county's comprehensive care system as a clinic space there.'",
        "'speaker_1': 'Okay, great. And I'm certainly aware of those. I just think maybe there's other vulnerable populations that we can look at. And, you know, like I said, just talking to the veterans commissioners, I think there were other areas and ideas that they had so that I'm sure will come to fruition once they provide additional information on their strategic'",
        "'speaker_1': 'plan and then in terms of child care. Are there any grants currently for expanding services? I know like for instance, the Long Beach Day Nursery wanted to expand to infant care. A lot of the resident residents leave their three year olds there, but unfortunately can't leave their one month old.'",
        "'speaker_1': 'So they're still in the same situation.'",
        "'speaker_6': 'I'm not aware of grants right now for that opportunity, but through our early childhood education plan, that's one of the areas is to look at the expansion of opportunity. So we will be through that plan, also engaging and looking for different opportunities.'",
        "'speaker_6': 'So it's a nice coordinated model, but at this moment I'm not aware of any.'",
        "'speaker_1': 'Okay, great. Thank you. And then moving on to transition to aged youth, I know our housing authority does a wonderful job. Just another thought here is in reducing in that prevention piece of reducing the cycle of recidivism and homelessness.'",
        "'speaker_1': 'I know there are a lot of L.A. County programs that provide you know, once you're in housing authority and you have a voucher, if you have children, you know, being able to get them to understand like a career pathway so they don't continue the cycle of homelessness.'",
        "'speaker_1': 'There is a great group called Teens Exploring Tech, and they actually work with housing authority, the housing authority, if they're in foster care or housing, that they help them get into careers in tech or at least think about it.'",
        "'speaker_1': 'And they're in a program throughout, you know, their their school years, basically. So just something to think about there and then in terms of record clearing. Supervisor Hilda Solis just put out a press release regarding a mobile outreach program she's working on, which I think would be great.'",
        "'speaker_1': 'And in addition, quote, America, they have a site called Clear My Record, Dawg. You can actually clear your record online. It's like a ten minute process. And they've cleared about 500,000 records, if you can believe that. And, you know, maybe it's something that our team can coordinate with, but I think it's certainly a value to connect with'",
        "'speaker_1': 'them. They connect with ten other counties in California. And then lastly, digital inclusion. I know that's a plan I'm certainly very passionate about. I know I hope that we can overlay this. And I'll just say that, you know, in January we're reconvening discussions and I would hope that we can overlay that plan with this plan.'",
        "'speaker_1': 'And then very last thing is, I know I've talked about this and it's very low hanging fruit, but a lot of residents still don't understand services. And as much as like we, I feel like I tell them over and over and over again.'",
        "'speaker_1': 'I'm wondering, it's something very easy, but perhaps thinking about fake news on our website and or just a one sheet that tells them exactly what to do that we can just share around in social media. I feel like that's half the battle with downtown residents is they have no idea all the great work that we're doing.'",
        "'speaker_6': 'So that is that we're working on that right now as a city therapy office and others. And we do have a sort of a communication strategy plan that that we're getting ready to implement that part of the recommendations.'",
        "'speaker_6': 'But we are we are moving forward on that as well. But we do have through the everyone on the Everyone Home Language Task Force, there are places like, you know, how do you help all those different things. Those are are on the website right now, but we are looking to expand that.'",
        "'speaker_1': 'Okay, great. I know the city of Portland has additional like a lot of FAQs, but just something to think about. I just want to say thank you again, Patrick and Kelly and your team Theresa. You all do an amazing, amazing job.'",
        "'speaker_1': 'And I thank you every time I'm in meetings because people oftentimes don't get it right and they don't understand all the great work that you're doing. So I really appreciate it. And again, thanks to the task force.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Vice Mayor Andrews.'",
        "'speaker_3': 'Yes, thank you, Mayor. First of all, I'd like to thank my colleagues for the questions that they ask and some of the suggestions that they brought forward. I don't want to go too long, you know, overlay of what we've talked about, because the fact that I know this has been a long, drawn out conversation, because the fact'",
        "'speaker_3': 'we all know that homeless is real and in in everything we all can do and become a part of, we're going to have to go out and be very humble and let everyone know that we are here with you and we're going to try to work and get something done.'",
        "'speaker_3': 'Because the fact that if we don't, we're going to see more of this. So I want to thank, first of all, the task force who's been serving with this with that committee. And recently because recently I've heard our state and legislators, you know, and our new governor spoke on it.'",
        "'speaker_3': 'You know, they spoke on, you know, deserve to create a program to find housing in California. And I'm hopeful that they will craft some solutions that will enable the city to create new housing opportunities. You know, I'm hoping that we also can move forward on this crafting plan, that we can work with the state and California to'",
        "'speaker_3': 'ensure our plans, you know, that are complementary and not detrimental to a city of Long Beach. And this is why I think it's so important that we all get involved in this. And thank you, Kelly, and your group, because, in fact, I know it's been a long six months, but those six might seem like we're very worthy'",
        "'speaker_3': 'of what we're trying to do because these things will come to fruition. And thank you very much for being a part of that.'",
        "'speaker_0': 'Thank you. Vice Mayor Councilmember Ringo.'",
        "'speaker_9': 'Thank you, Mayor, for putting this task force together. And of course, I want to thank all the task force members for your participation in this. And it's long overdue. I think we've we've needed needed something like this for a very long time because of as we know, homelessness has been affecting our communities for many, many years.'",
        "'speaker_9': 'And we always talk about the balloon effect of homelessness, where we might clear a homeless encampment here or or address some homeless issues there and alleys and coming into the neighborhoods. And then all we do is see them moving somewhere else and not really addressing the whole aspect of what the causes and some of the effects and'",
        "'speaker_9': 'as well as some of the solutions that we could come up with with homelessness. I see this report as a holistic approach to dealing with with this issue, you know, because it brings in all all stakeholders into this conversation.'",
        "'speaker_9': 'And it was something that was very brought up a lot within the last two years especially. But there's there's a one very, I think, ambitious part of this report that that stood out to me because as I go around the state and talking to other council members in other cities, you know, we're always talking about the NIMBYism'",
        "'speaker_9': '. When you brought it up here about the using a yes in my backyard education model, I'd like to see what that is because I mean, obviously in my district when I brought forward a a the star behavioral health center to my district to address the these these issues of, of, of individuals who needed immediate services and needed'",
        "'speaker_9': 'maybe a 24 hour stay. There were individuals that were protesting that center that lived a mile or two away from it that were really not immediately affected by it. And it's a continuing issue where we're going to be, you know, let's put it out there that NIMBYism is real and it comes in and we need to address'",
        "'speaker_9': 'that. And this yes, in my backyard education model, I think I'm really looking forward to that. I mean, I like to see what what that entails and how you go about changing people's minds about that. It's that it's okay to all of us.'",
        "'speaker_9': 'You take a step to take a moment to make a commitment to address this issue? I mean, you can't always be decrying that the the the impacts of homelessness and and then say we need more services, we need more behavioral health centers, we need more beds.'",
        "'speaker_9': 'We need more affordable housing. But not in my backyard. You can't have it both ways. We have to be more open minded about where some of these establishments are going to be. And it's going to be everywhere. It can be all over the city.'",
        "'speaker_9': 'One of the things that I really am not pleased with in terms of some of these affordable housing models that are coming up, it's always in the West or part of Long Beach is a long 710 corridor. It's the first district.'",
        "'speaker_9': 'It's the seventh. It's the eighth. It's the ninth. It's always those districts that we talk about when we talk about getting affordable housing and addressing more beds and more homelessness services. You know, it's a it's a whole city commitment.'",
        "'speaker_9': 'We have to look at it that way. And I'm glad that this report is out to be cut because it is a one that is comprehensive. And I'm really pleased, again, that we have all the stakeholders involved in this, and it's something that we need we need to really address.'",
        "'speaker_9': 'The other item that stood out to me and I've had it before because I had a few. Homeless discussions in my district because it was becoming an issue where more people were were getting angry at my district office, where why am I letting more encampments grow?'",
        "'speaker_9': 'And in my community, where am I letting more homeless people in our in our alleys and in my backyards? And and why are there more homeless appearing in front of liquor stores and markets where they're in camping there?'",
        "'speaker_9': 'So I brought up a I brought the the homeless services people to come to one of our community meetings to talk about what it is that we're dealing with here. And one of the biggest issues they came up with is, of course, the the the the bubble, the balloon, where you squeeze one and go, they go somewhere'",
        "'speaker_9': 'else. But one of the most important things that came out of those discussions was and it was brought out earlier by a by Kelly in terms of, you know, there's 17 points of contact sometimes with these homeless individuals that it takes 17 points to convince them to get some kind of service.'",
        "'speaker_9': 'And why does it take 17 points of contact? Kelly mentioned about why it's establishing and building relationships with these people. And but why does it take 17 points? I mean, if if we see in this model here that it says 35% of the homeless people getting into homelessness is because of lack of or a loss of a'",
        "'speaker_9': 'job. Then why did it take 17 points of contact to get them a job? I mean, that does not make sense to me. So there's there's a lot more going on here than just the loss of a job or or loss of family status or or divorce or substance abuse drugs or or domestic violence.'",
        "'speaker_9': 'There's something else going on here. And that's why I'm very much supportive of of getting those services out there that would provide people with mental health issues much more support, much more help in addressing those points. They should not take 17 points of contact to get to convince someone to get out of homelessness and accept services.'",
        "'speaker_9': 'So we're not doing something right. We need to do. We need to look at that much more seriously. As far as what are those points that what is at one point, maybe that 17th or that 18th point that says, okay, I want to go get help.'",
        "'speaker_9': 'So we need to seriously look at that much more closely and determine what did that what is is there data on that even? I mean, what is it that they're refusing? Why now? Now we know it's trust and we know that there's a lot of mistrust out there.'",
        "'speaker_9': 'It's a perhaps a bohemian lifestyle of the people. Like it doesn't matter. Point is that there are 17 points of contact before someone finally decides. I need I need help. And what what is that? We need to get there.'",
        "'speaker_9': 'And then finally, it's obviously funding. We've talked about it today. And I look at the funding, some of the funding sources that we have here. And a lot of them are just grants. A lot of them are just temporary.'",
        "'speaker_9': 'Some of them are three or four or five years in length. And then you have to reapply and look at it again. And we have to look at our our models and evaluations. Are we being effective and do we deserve to be funded at the same level as we were before?'",
        "'speaker_9': 'We need something more sustainable. We need some funding that is going to be permanent, that is going to be addressing these issues in a consistent, holistic manner all the way through. And I agree with you. Councilmember Richardson, our health department, that needs to be institutionalized.'",
        "'speaker_9': 'It needs to be sustained. It needs to be part of our general funding and not totally reliant on outside grants as it has been for the last 110 years or whatever length of time it's been in existence. It's part of it's part of our city, our city family.'",
        "'speaker_9': 'And it's always being funded by outside funding and reliable and great grant writers, which I know they have. So I'll end with that that we need to address it holistically. Thank you again to the task force for all the work they've done.'",
        "'speaker_9': 'It was very comprehensive. I mean, it was holistic as it can possibly be. And now we need to get into the minutia and get our hands dirty and get in there and try to really make an impact in our community.'",
        "'speaker_9': 'Thank you very much.'",
        "'speaker_3': 'Thank you. Councilman. Awesome.'",
        "'speaker_8': 'Thanks. And Councilmember Iraq, I do agree with all of your points and most of the points raised by most of my colleagues here. But I'll just say on that last point, if it's been here for 108 years, it's sustained.'",
        "'speaker_8': 'OC comes to Health Department funding. I want to thank the task force for their work. I want to thank the Council and the mayor for for bringing it forward. And obviously, the Health Department is down for the great work.'",
        "'speaker_8': 'And in presenting this. I'm encouraged that we as a city are are committed to focusing on fixing this crisis that plagues our city, but also plays out our entire region and state. I think this this report has done a great job of identifying the problem, the needs, as the mayor said, laying out some goals and targets.'",
        "'speaker_8': 'And I hope to get to a point where we have a have a plan with some some specifics. Clearly, it's going to be the responsibility of this council to try to get there with with some policy direction. There's there's some.'",
        "'speaker_8': 'I do have some questions, but I do do have a couple of points that I'd like to raise that I don't think were necessarily identified in this this this report or the recommendations. But I'd like to see considered as well, because as I mentioned, this whole issue of homelessness is not just Long Beach is problem.'",
        "'speaker_8': 'It's a it's a problem that that that impacts in our neighboring cities. And I'd like to know what what our neighboring cities are doing to contribute to this to this issue, to the solutions and what they're doing to help address the issue of homelessness in terms of supporting our our shared communities with shelter.'",
        "'speaker_8': 'And affordable housing as well. It seems to me that this conversation around homelessness is really focused on the larger cities in the in the throughout the state of Los Angeles, San Francisco, Long Beach, Oakland. But there are a lot of suburbs that that or I'll say suburbs, cities that that connect to those cities that that could be'",
        "'speaker_8': 'helping to share in the burden and responsibility to to help eliminate that the crisis as well. And so that's a that's a challenge that I would issue to staff, but also to our neighboring cities to to help support our efforts.'",
        "'speaker_8': 'I do appreciate Councilmember Richardson for bringing out that that point. As I was reading this this report, it jumped out at me. You know, the fact that there are housing segregation practices over many years and those policies over many years have contributed to where we are today.'",
        "'speaker_8': 'That is a reality. But I also would like to say that we also have a homelessness segregation practice that needs to be addressed in this city, because the entire city recognizes that it's a party. It's a problem. Right.'",
        "'speaker_8': 'But the not the entire city is really a party to the problem. But the entire city needs to be a part of the solution as well. And so and I would extend that to turn to that, to say that we need to really address that as well.'",
        "'speaker_8': 'I think many of the recommendations are gloss over some of the realities. Council members, we talked about NIMBYism being a major challenge and that is a challenge in our city. People want good quality of life. They want to to ensure that that, you know, their their their neighborhoods are strong and vibrant and and not interrupted.'",
        "'speaker_8': 'I share with that data that concern and desire as well. But recognizing that that this is a problem that's not going away. And to me, this is a recognizes or represents a snapshot today. And if we don't act.'",
        "'speaker_8': 'Right now, act immediately, act with with with deliberate aggression on this issue. This these numbers will grow and they are growing. I've watched the number in L.A. County just in the last few years grow from, you know, I seem like in two years from 42 to close to 60,000.'",
        "'speaker_8': 'These numbers are real and this crisis is not going to go away with us talking about it for too long. So we have to to act. I did have some questions for staff, particularly regarding one of the recommendations.'",
        "'speaker_8': 'I mean, obviously, a lot of this is going to be on funding and how we arrived at the numbers in terms of funding. Recommendation one J it it, it states that for us to build 202,000 low income housing units, it will cost this $170 million.'",
        "'speaker_8': 'And how did we come about quantifying that? And also is a one 200 permanent supportive housing units. What kind of cost will cost this $17 million? Can you explain? How do we arrive at those numbers? Sure. Yes. Councilmember So we took a look at all the projects that we've done over the past decade and the cost that'",
        "'speaker_8': 'it was that was required, the city contribution that was required. And we compared them and average them and came up with an estimate on what it would cost to produce those units going forward. Okay. So in the second part of that question is in terms of, you know, we've we went through a very, very exhaustive land use'",
        "'speaker_8': 'element in that land use element where I think it was very clear that that we have a a built out city, the city that doesn't have a lot of capacity for for new housing. And so I think part of the conversation, when we talk about adding 2000 new units of affordable housing, I guess the big question is'",
        "'speaker_8': 'where do we do that and where is the capacity for that? Well, I think we have a lot of opportunities along our corridors, certainly along Long Beach Boulevard from downtown, all the way up through the ninth District and along Atlantic Avenue and some of the other corridors around the city.'",
        "'speaker_8': 'We have a downtown plan. We have a midtown specific plan. We're working on an uptown plan. There's certainly other large sites where we have uses that are.'",
        "'speaker_9': 'Become becoming no longer useful.'",
        "'speaker_8': 'That could be reused and redeveloped for housing. Okay. I think thank you for for that response. I think we still need to really work on developing a real plan around, you know, where we would identify those that that type of new housing, which is so sorely needed in our city.'",
        "'speaker_8': 'I'd just like to also just say one point that wasn't any I don't think I saw it in here. And this is pretty voluminous. I haven't had an opportunity to to read the entire thing in detail. But the new economic development tools that are coming into fruition like opportunity zones that we're giving consideration to to that, because'",
        "'speaker_8': 'I think that would help identify some of where some of these new housing units can be developed. And then to one of my other colleagues points, I'd like to see a lot more coordination with faith based organizations in the city who are already doing a lot of this work around homeless support because it's their mission anyway.'",
        "'speaker_8': 'And I think I think funding relationships with some of these faith based organizations would represent real partnerships. It's been an exhaustive issue. I'm looking forward to, again, engaging on this over the next several months and really doing some good work with my colleagues here.'",
        "'speaker_8': 'And I look forward to hearing from the public today. Thank you.'",
        "'speaker_0': 'Thank you, Councilman and Councilman Mongo.'",
        "'speaker_2': 'Thank you. I would like to thank the task force. This is excellent work. I also want to thank everyone who provided input at all of the task force meetings. I think that this report is a great start and very comprehensive.'",
        "'speaker_2': 'Many of you know that something that I've championed and continued to champion is a plan and standardization of receiving input and from the community. Because I think that one of the things that's really important is for each and every one of you who wants to provide additional input, whether it's through a report like this or after a'",
        "'speaker_2': 'report is written or before an implementation, is to have clear expectations of what that timeline looks like. And so one of the things that I was fortunate enough to have a dialog with City Manager Pat West this afternoon about was what that next step looks like.'",
        "'speaker_2': 'So I know that some of the pieces of this are coming back in January, and I know council members have each kind of talked about what comes next and when it's not all being decided tonight. Tonight is a receiving file and we have lots of opportunity for additional dialog.'",
        "'speaker_2': 'When we talk about the opportunities to advertise what we're doing in the city, I know that that came up with a lot of council members. I would also encourage us to utilize some of the blank billboard space available.'",
        "'speaker_2': 'They donate that to charities and opportunities in the city and governments and nonprofits. And I think that we can really share the story of what we've done. And I think that that gives a lot of hope. And hopefully through that hope and through additional education of residents, we can really reduce the.'",
        "'speaker_2': 'Number of contacts necessary to get help because of the contrast in the way that the community is being supportive of that effort. Data. Data. Data. I think that one of our biggest barriers continues to be data sharing across agencies.'",
        "'speaker_2': 'If someone is homeless in Lakewood and crosses across to Long Beach, we don't know what services the sheriff's department has already provided or L.A. County Health Services. I think that we do need our data available and online, but we also need to get those memorandums of understanding in place with L.A. County, because so many of our borders'",
        "'speaker_2': 'are touching cities that are serviced by L.A. County health. And I think that that's a continued opportunity. And then I'd also like to just say a quick statement. I've talked with a lot of people over the last several weeks, one of which has been homed through the Section eight program, but was homeless and and the plight he'",
        "'speaker_2': 'went through to get services and his medical care and all of those. But I think that one of the things that really rang true to me about what he said was the reason he was able to survive as long as he was before he became homeless was because the landlord he had had market had rent below market'",
        "'speaker_2': ', but the landlord didn't know it. And so when the landlord sold the property and the new landlord came on and evicted them and raised their rent. I don't think that the original landlord would have sold had they known they were a part of that solution.'",
        "'speaker_2': 'And I don't think we say thank you enough and inform people of the impact for them. It might just be a property, but they don't necessarily realize that the impact that that happens when that property transitions over and in an ownership.'",
        "'speaker_2': 'And we talk a little bit about a property that was sold for.'",
        "'speaker_4': '$200,000.12.'",
        "'speaker_2': 'Years ago, is now selling for $600,000. And just to cover the costs on that is a variance of $7,000 in rent I'm sorry, $7,000 in taxes a year. And that often gets burdened by the new renter or the current renter who gets a rent hike.'",
        "'speaker_2': 'And so it's not that anyone's trying to be greedy or any of that, but I don't think that the initial owners, no one, understand that impact of that sale and what it can do to a family. And I think that on the flip side, too, it's it's a dialog and an understanding that everyone is in this together'",
        "'speaker_2': 'and that landlords are providing those opportunities and just making those ends meet. So I really appreciated that, that dialog with one of our residents, it was really touching to hear the relationships he's built and the real the real fear of moving back into housing once he was not housed.'",
        "'speaker_4': 'I know that, Councilmember.'",
        "'speaker_2': 'Your anger talked a little bit about why it takes so many contacts. But again, they have a a community they're a part of out there when they're homeless and they lose that community when they become homes and and getting them into a new community and or linking them up with their family and the work that the health'",
        "'speaker_2': 'department and the police department have already been doing to make that a reality has been really moving. And I really appreciate both Kelly and our police commander and our homeless task force for coming out to our community meetings and sharing that story.'",
        "'speaker_2': 'So I appreciate that. I know it's been a long night already. It is 7:00 and I know we have a time certain, so I'm going to keep it brief. But thank you again to all of you who have provided that input.'",
        "'speaker_0': 'Thank you. We're just so that we know I'm going to call public comment in just a minute. Not yet. A couple of things. The first is too important to just as a note, because I know we have our time certain that's passed.'",
        "'speaker_0': 'We are going to do our AR that item next. And so as soon as we're done here, we will get to our time certain and then continue with the rest of the. We're on our first item on the agenda still tonight and it's a very long agenda.'",
        "'speaker_0': 'So I just ask us to to please in our comments to just be brief and and to give our input. I also want to be clear, because if someone had asked me this question before the meeting started, the motion that's on the floor and there's a motion and a second is to receive and file the report that'",
        "'speaker_0': 'we have in front of us. This is not no one is passing or creating new policies tonight. I think I had two questions. One are is there being decisions being made tonight on the tenant protection laws? And that's not the case that's happening in January.'",
        "'speaker_0': 'And the other at another meeting, another conversation I had another question about are we deciding on funding? Again, that is happening that'll be an ongoing conversation tonight is just receiving this report. Any major policy decisions on any of the items will all come back to the City Council for discussion and for adoption and for community input.'",
        "'speaker_0': 'And so I just think that's important to note because I want to make sure people know what is actually in front of us. This is a receiving file of the committee's report. If you're here for one of the other larger policy items, please, there will be plenty of opportunity to comment on those when they're in front of'",
        "'speaker_0': 'us and in front of the city council. So with that, I'm going to begin by asking the vice chair of the Everyone Home Task Force to make public comments and everyone please line up. It's good to speak behind Ms. occur and and then we'll go from there.'",
        "'speaker_0': 'Thank you. And Mr. Kerr, before you start, I am going to be closing the speakers list. I'm. I'm going to be closing the speakers list. So if you're one before you start, I want to close it. Hold on.'",
        "'speaker_0': 'Okay. Okay. I will. I will be closing the speakers list. I am dealer right now.'",
        "'speaker_9': 'One one.'",
        "'speaker_0': 'Okay? Yeah. Okay. Seeing that we have a couple of hours of public comment right now, we are going to look at the direction. We're going to go down to 90 seconds like we did at the last meeting. We'll let Mr. Kerr, who's a vice chair, speak.'",
        "'speaker_0': 'And we're going to go down to 90 seconds unless there's objection from the council. Seeing none. Mr. KERR.'",
        "'speaker_9': 'Thank you, Mr. Mayor, and members of the Council. I won't take long. Kelly Colby did a wonderful job today presenting the recommendations or presenting to you as well as President Connelly. Thank you for the opportunity to serve on this very important issue that's been really important to me and close to my heart for for many years.'",
        "'speaker_9': 'And so I thank you for my trust in me. It was also wonderful to get to work with the professionals of the health department that work with with Ms.. Collopy, Shannon Parker, Teresa Chandler and and their entire team.'",
        "'speaker_9': 'We really have, as a city, put together a wonderful group of people that have an amazing understanding of this issue. And so I commend the health department on that. Mr. Mayor, you mentioned at the beginning in your remarks that that we do have the housing crisis right now.'",
        "'speaker_9': 'And you mentioned that we have a new governor coming in, and that has recognized that as a very important issue. And I just wanted to to underline that a little bit. I think that was the biggest challenge in going into this work is is in it's not something that we've done well in the homelessness homeless services sector'",
        "'speaker_9': 'is understanding that upstream upstream visual that councilman Richmond Richardson talked about that we've always been good at addressing the downstream and Canada bandaid approach to addressing this issue. But it really is a challenging issue to look at this issue as a whole, especially the upstream version, because at the end of the day, I think what we're talking'",
        "'speaker_9': 'about is we're talking about an issue of poverty. And for every one person that we we see that's either living in an encampment or is on the street, that I think it'd be really easy to focus completely on that and not see for every one of those people.'",
        "'speaker_9': 'I think we have perhaps dozens, maybe hundreds of people that are living in extreme poverty. There's been some really interesting reports lately about the poverty level in California and especially in Los Angeles County. And it's I think we can work harder and making sure that we there's been a lot of effort done on making sure that people'",
        "'speaker_9': 'are paid a livable wage of a livable wage. But one of the things we haven't done enough of is addressing the housing crisis. And that's that that bigger context that I think is the bigger challenge. So I think it'd be really easy to completely focus on just the Band-Aid solutions and and keep working it on that level'",
        "'speaker_9': '. But I think we also have an opportunity to make sure that that we also address the bigger picture. The bigger picture. One of the issues that in my work with the county is the homeless services folks are trying to figure out.'",
        "'speaker_9': 'We know that for every family that's in poverty and living in poverty and at the risk of homelessness, that only one out of ten of those people are actually going to fall into homelessness because those folks are resilient.'",
        "'speaker_9': 'And so the focus has been, okay, how do we better think you figure out which one is going to going to fall into homelessness? But let's focus on how do we get everybody out of poverty. Thank you. Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_5': 'Council members, Mayor Kelly Coakley. Thank you for the opportunity to speak. This is something that I feel that I have addressed many issues and various council members or community meetings. I'm just concerned that when I attend a community meeting on Measure H that I don't see anybody from city council or from our own city participating.'",
        "'speaker_5': 'But I do have the notes that I'm more than willing to share with Kelly from the county event.'",
        "'speaker_9': 'That I went to in October at Torrance.'",
        "'speaker_5': 'And also regarding discrimination, the LGBT, there's parallels to LGBT and the black community. So I think there needs to be more discussions there, as well as cultural competency for our staff and training and held accountable and for capacity.'",
        "'speaker_5': 'Mr. Austin. Sears is closing and Kmart is closing. And I hope you know that wraparound services doesn't need to be revised. I'm making this quick. But Kelly, I will be in contact with you. I know you received my past information very well because it's been researched across national platforms.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker.'",
        "'speaker_5': 'Please. Yeah. Hi, I'm Dave Freeman. I've lived in Long Beach for 77 years and the last two years I've spent as an advocate in Orange County and Los Angeles, Skid Row, and also in here in Long Beach. I want to I'm going to cut this short.'",
        "'speaker_5': 'But in April of this year, I came to the city hall. I couldn't see the mayor, but I did see Mark Taylor. And I said, Are any new villages at Cabrillo in the works since that time, you've wasted almost seven months to to try to come to the understanding of what to do.'",
        "'speaker_5': 'You need affordable housing. The shelters you put up there, 2000. That needs to be reversed. And until you do and address affordable housing, all this other stuff is just going to continue to get worse and worse. And you're going to have to have a huge trampoline.'",
        "'speaker_5': 'A huge trampoline. Okay.'",
        "'speaker_0': 'Thank you, sir. Next speaker, please.'",
        "'speaker_5': 'John Toya, resident of the eighth District with rental property in the second and third district. Marion City Council members thank you for the opportunity to speak as a resident, born and raised in the city of Long Beach. I am proud of and think the task force and the staff for the comprehensive work done to address homelessness in'",
        "'speaker_5': 'the city as seen in the report. I agree that setting targets and addressing housing, employment and pay are a good starting point moving forward. I also want to make sure that we don't get restrictive on small property owners by adding any form of rent freeze, rent control or just cause eviction.'",
        "'speaker_5': 'None of these will help address homelessness or housing will likely hurt housing in Long Beach. I appreciate the inclusion of all parties involved and look forward to continue helping address this issue.'",
        "'speaker_0': 'Thank you very much. Everyone's comments are great on the timing, by the way. Thank you.'",
        "'speaker_5': 'Next speaker good will be brief in your research. I think it would be helpful to find out how many of the homeless are products of the de facto DNC policy of encouraging people to pop out a kid every 18 to every 12 to 18 months.'",
        "'speaker_5': 'And number two, and we know who some of those are there. Number two, in terms of the funding. That should be relatively easy. We tripled the cost of marijuana. Period. No ifs. No answer. No buts. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Karen replied. I'm a resident of District.'",
        "'speaker_7': 'One and I.'",
        "'speaker_4': 'Was homeless for five months. I want to thank everybody that contributed to this report. What I appreciate most about it is it reflects a caring attitude. That's a shift, a change in the way we looked at homeless. I actually went to one of the inclusionary housing meeting and I got so upset because people kept talking about those'",
        "'speaker_4': 'other people. It's time we have to realize that the homeless are part of our community. There are people like me.'",
        "'speaker_2': 'Whose boyfriend locks them.'",
        "'speaker_4': 'Out at midnight on a Saturday night and has no place to go, so goes to sit in a Denny's all night. It's not people that get counted necessarily in the homeless counts, and it happens to our families, our friends and our neighbors.'",
        "'speaker_4': 'So. You're right about the NIMBYism. We all have to help our neighbors so that we can all be wholly house because this program is about homelessness. Not going to go away. And we have all these people that are going to be reassigned because they had low level marijuana offenses.'",
        "'speaker_4': 'What's going to happen to them when they're released with their very minimal funds to try and find housing? So I didn't hear that mentioned anywhere. So thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker, please. And before the next speaker. I think that I think the person in the last who's got the black and gold will be our last speaker who I think is in line. Right.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_5': 'Good evening, mayor councilmembers. My name is Mike Murchison and I'm here tonight on behalf of the rental property owner community. I want to commend, Mayor, your appointment of the task force. The voluntary time. It's been commended. Five or six meetings, a busy day of their schedules is wonderful.'",
        "'speaker_5': 'I really appreciate that. One of the stakeholder groups that was missing, mayor, though, however, from that task force was the rental property owner community. We have five major organizations in Long Beach. I would encourage the mayor and the council prior to January 8th to do some outreach because those groups, there's five of them, are very interested in'",
        "'speaker_5': 'these issues, specifically in the city manager's report that was provided to the mayor in the Council page 19 through 21 two, way through to II and three through three C were tenant and property owner issues. That's something that needs to be addressed with the rental property owner community at the table.'",
        "'speaker_5': 'So I would encourage you all to try to see if you can find the time to do that prior to January 8th. Finally, and probably the biggest issue for me from an affordable housing standpoint, we can build all the affordable housing, low income housing in Long Beach.'",
        "'speaker_5': 'But when we bring in funding from the state and the federal government, I find that the individuals that live in those units are outside of Long Beach. We need to find a way to ensure that Long Beach residents, homeless and others, seniors and others are given first opportunity, not second and third opportunity.'",
        "'speaker_5': 'First opportunity for housing in the low income and senior housing developments that we build in Long Beach. It's Long Beach that we need to take care of. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. I was Mr. Motor Commander. I was under the impression that there's been a handful of sub meetings that actually included many property owners and other housing advocates. And there've been multiple meetings and including some of which I know many folks here attended.'",
        "'speaker_0': 'Isn't that correct?'",
        "'speaker_5': 'Yeah, that's correct. And I can have Patrick talk a little bit about that.'",
        "'speaker_0': 'Okay. Listen, that's all right. I just wanted to make sure that I know there have been some meetings that are clearly ECB needs to be more and we'll make sure that those happen. Next.'",
        "'speaker_9': 'Speaker Good evening, Mayor and councilmembers. My name is Brock Carter with downtown Long Beach Alliance and I wanted to start off by thanking the mayor for inviting Delbert to be part of the task force and also for including such a broad group with engaging them in the conversation about this most important topic deal, which of course is'",
        "'speaker_9': 'very proud of our commitment to the issue of homelessness in the form of a of a few elements. Of course, our advocacy at council council meetings and other meetings with city staff, but we also have a dedicated position as a homeless outreach specialist.'",
        "'speaker_9': 'We have an alley busters job training program, and we have we've hired formerly homeless individuals on our clean and safe team. So we're proud of those elements. And we think that that's part of a testament of why we're invited to participate in some of these conversations.'",
        "'speaker_9': 'I also want to take a moment to thank Kelly Colby and her her team for being so responsive to our comments and our questions during this process. It's been very helpful and just I'll be submitting some written testimony on behalf of the LBA.'",
        "'speaker_9': 'But real quickly, I just wanted to cover a few things that will be in that written testimony. Making sure that we have that comprehensive communications plan that Kelly talked about for reaching out to residents and to businesses, developing matrix of short, mid and long term goals so that we can track them and timelines, ownership of each recommendation'",
        "'speaker_9': 'by departments or organizations to make sure that we know who's responsible. And finally making sure that there's one entity that's responsible for ensuring consistency of program formation and measuring progress and efficacy.'",
        "'speaker_0': 'Thank you so much. Thank you so much. Next speaker, please.'",
        "'speaker_10': 'Good evening. My name is Porter Dahlberg. I'm the executive director at the LGBTQ center of Long Beach, and I also served on the Everyone Home Task Force. I'm incredibly grateful to the Mayor's office for the opportunity to serve on this task force and am incredibly pleased with many of the recommendations.'",
        "'speaker_10': 'However, I do find it incredibly concerning that the city and in particular the Health and Human Services Department is reporting two different data sets as it relates to gender identity. The city manager was provided with one data set in June of 2017, noting that 1% of our population experiencing homelessness identifies as transgender through a graphic that looks'",
        "'speaker_10': 'very similar to the PowerPoint provided and very similar to the graphic that is provided in the Everyone Home report. However, that one does not include transgender people. The same issue was brought up by me in an email communication to the Department of Health and Human Services after the first everyone home meeting and the data still was not'",
        "'speaker_10': 'corrected. So as a city that has begun prioritizing the needs of the transgender community, especially in a national climate that is working to address our. Munity. I think it's very important that we continue to report out accurate and accurate data that we are collecting.'",
        "'speaker_10': 'And just in all, honestly, stop providing two different data sets for gender when one is clearly inaccurate. So thank you very much.'",
        "'speaker_0': 'And no, absolutely, I'm not aware of this exact issue, but Mr. West, we've got to fix that. So thank you. Next speaker.'",
        "'speaker_9': 'Good evening, Mr. Mayor. Members of the council, thank you so much for this opportunity to speak. My name is Rene Castro. I'm the director for Community Engagement at Century Villages at Cabrillo, located in the seventh District. I'm also a resident of the third District and Susie Price's area.'",
        "'speaker_9': 'I'm here on behalf of Brian D'Andrea, our president at Century Villages, that Cabrillo. As all of you know, we provide housing for 1500 formerly homeless people in any given night, 2200 in any given year. That includes 600 children and over a thousand veterans.'",
        "'speaker_9': 'So I know. I appreciate. I also want to thank the task force that, of course, the leadership of our councilmembers to really lean into this issue. I actually facilitated the plan to end homelessness over ten years ago. And it's a different conversation today.'",
        "'speaker_9': 'And it's a different conversation for many of the reasons you all pointed out. Our councilmembers, the metrics, the courage, the risk taking. In particular, at the villages at Cabrillo, we're very excited to be a part of that effort to build 2000 low income, extremely low income housing units.'",
        "'speaker_9': 'I just want to point out one thing. Know the mayor brought up Beacon at the corner of Long Beach in Anaheim. And one thing, you know, Long Beach Community Investment Corporation committed over $12.2 million to that effort. We could not have built those 160 units without your support.'",
        "'speaker_9': 'So thank you so much. We look forward to a long term partnership.'",
        "'speaker_0': 'Thank you. And the villages, that is the model. There is no better model anywhere than what you guys are doing. So thank you. Next speaker, please.'",
        "'speaker_5': 'Good evening. My name is Paul Babcock. I'm a resident of the fifth District. My wife and I have a rental unit in the third district. And we've been providing that unit to renters in the area for about the last 20 years.'",
        "'speaker_5': 'Uh, we're retired, we're seniors, we're on a fixed income. And I'm a Vietnam vet. In 2008, as a result of the recession, we lowered rents by 300 per month per unit. We have not increased rents. We have never terminated tenancy, nor have we ever initiated a eviction.'",
        "'speaker_5': 'Our costs continue to rise. We pay $735 a month in property taxes, and that's just part of our expense. We urge you that the that any that you not increase our costs any further with relocation allowances. We have renovated our property and continue to upgrade and modernize our building in order to continue to improve our property and'",
        "'speaker_5': 'contribute to this stabilization of the neighborhood and the well-being of our tenants. We must have a reasonable return on our investment and we thank you for giving it consideration in your going forward.'",
        "'speaker_0': 'Thank you for your service, sir. Next speaker, please.'",
        "'speaker_5': 'Thank you, counsel. My name is Jordan Wynn, lifelong Long Beach resident. Currently, I'm serving as the Long Beach coordinator for the Everyone in campaign not to be confused with everyone home. And it's not exactly a homeless czar kind of organization, but we do do kind of what you were alluding to.'",
        "'speaker_5': 'We've been working across L.A. County to try and create united strategies around ending homelessness for good. And these are comprehensive resources that work multi departmental and look at different resources around the city. As the representative, I'm really excited about these objectives and goals that have been set by the study and I'm excited that hopefully you guys will'",
        "'speaker_5': 'be receiving and filing this tonight. I wanted to just bring up a story from one of the events that we've had recently the around the tables that have been taking place for the past week in the city that were hosted by the Long Beach Community Foundation.'",
        "'speaker_5': 'I was fortunate enough to have a homeless resident at my table and we got to the portion where we talked about what are the policy solutions that we want to see in the city? And the three things that this person identified were the following.'",
        "'speaker_5': 'Number one was a rent control policy to catch us up with the past 40 years that we've been missing with L.A. County and the rest of California and, frankly, the rest of the United States. Number two is an inclusionary housing policy.'",
        "'speaker_5': 'And I was fortunate enough also to be at the inclusionary housing presentation. I'm excited to see what manifests from that. And number three was supportive housing. Supportive housing has a 90% success rate of keeping people off the streets and in housing.'",
        "'speaker_5': 'It's success you don't see in any other sorts of developments. So I'm excited to work with the rest of you guys and get to know you guys a little bit better as we move forward. And finally, solutions for homelessness.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Thank you very much. Everyone in L.A. program is a fantastic program. Let me just also add, I think I'm not sure if I had heard those hissing or what I heard in the audience, but please, let's let's let everyone have a chance to speak.'",
        "'speaker_0': 'And everyone deserves a respect to speak. So if that was hissing, please stop whatever that was. Next, next, next. Speaker And then. And just making sure that the speaker's list is closed. So that lady in the back that I had identified in the black and gold was the last speaker.'",
        "'speaker_0': 'Speaker's list is close. Yes.'",
        "'speaker_9': 'Josh Butler, executive director for housing Long Beach. And I want to thank the task force for taking the time and putting the energy in to come up with the recommendations. And now the impetus is on this body to implement the recommendations.'",
        "'speaker_9': 'As you will recall, the mayor convened a task force, a study group in 2017, the middle of the year that convened. It came up with 30 recommendations, 29 of what you all approved. A scant number of them have have moved forward and some of them that are scheduled to move forward are still a year away.'",
        "'speaker_9': 'So when you all talk about there being a housing crisis from where I'm standing, I don't see crisis level responses. And so at some point you have to stop saying it's a housing crisis, unless that's how you respond to a crisis, not how I respond to a crisis.'",
        "'speaker_9': 'And someone's coming to me in their arms dangling off that. That was a different level response than a Band-Aid or a cut. Right now we have a gaping wound here in Long Beach. We have people who are barely hanging on.'",
        "'speaker_9': 'We have landlords who are raising rents at exorbitant rates and driving people into homelessness. So we want them to be at the table as well as part of the solution. Right now they're not. And so it is important that they be part of the solution.'",
        "'speaker_9': 'So I want to thank the Council and Task Force, and we look forward to the actual implementation of this. The one thing that we haven't talked about is the $25 million and the $215 million gorilla in the room, which none of these recommend interested in any of those conversations goes anywhere unless this body figures out how to'",
        "'speaker_9': 'come up with the money so that we can implement them and make an impact on our homelessness.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_9': 'Good evening, Georgia Rivera with Libra. I want to thank also the taxpayers for their time investment in this process. But I do want to scrutinize the process because I hear from some of the city council members that you really want to hear our input.'",
        "'speaker_9': 'Yet Libra wasn't invited to be a part of the task force. And then when we came out to speak, I was told that I couldn't speak at one of the meetings because I spoke at the previous one. So if we really want to invite community input, really scrutinize the process there.'",
        "'speaker_9': 'Also, we had suggested to the task force that they adopt the regional housing need assessment goals, which is one a much smaller timeline and a much more robust goals as far as housing production. But that wasn't taken into consideration.'",
        "'speaker_9': 'And so their goals are actually less than the regional housing needs assessment. We appreciate that there is a commitment for every council district to create affordable housing and also when it comes to employment, do the math, $15 an hour, even with two house, two people working there is still going to put them in a precariously housed situation'",
        "'speaker_9': 'according to that task force definition. And also.'",
        "'speaker_5': 'If if 35%.'",
        "'speaker_9': 'Is due to job loss, yet the city funded construction projects are not hiring local Long Beach residents. We need a local hire policy to try to close that gap. And instead of a trampoline, let's just close the holes.'",
        "'speaker_9': 'And and Mr.. Mr. Pryce, if when you start talking about criminalization and homelessness in the same same sentence, we are not removing the stigma by doing that. Thank you very.'",
        "'speaker_0': 'Much. Next speaker.'",
        "'speaker_3': 'Please excuse me. Excuse me 1/2. I was hoping you can legally.'",
        "'speaker_9': 'Be at those meetings.'",
        "'speaker_5': 'Okay.'",
        "'speaker_3': 'Speaker, please.'",
        "'speaker_4': 'Hi.'",
        "'speaker_10': 'My name is Tiffany Davey, a resident of the second district. I just wanted to lift a couple of points. Thank you for the report and your time from each department of the city. Timeline is important. This is a crisis.'",
        "'speaker_10': 'Numbers are important. I think I looked at a rental just the other day for something that's not even quite physically up yet, and it's 4000 for a two bedroom. I think the quick math on that is 48,000 per year, $200,000.'",
        "'speaker_10': 'Just wondering who those citizens are that will be renting the 4000.'",
        "'speaker_0': 'Thank you. Next speaker, please. Please come down. We can have everyone else kind of come down the stairs. Thank you.'",
        "'speaker_9': 'Dave Shukla file. I'd just like to thank the homeless and this task force for all the time and effort they put in. And I very much look forward to the operational details for how to implement this.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_9': 'Jonathan said I work for various service providers in the downtown, east and southeast regions of L.A. and I also volunteer with a local faith based organization that provides social services to the homeless community in Los Angeles. Um, and I'm truly looking forward to.'",
        "'speaker_9': 'It's implementation that that some of the initiatives look a lot like the, you know, Los Angeles County chief executive office, homeless unit, homeless and Homeless Initiative initiatives. And so I'm looking forward to that very much. Thank you very much.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'I am Jacqueline Case, a local realtor, and I also had the privilege to work with Rex Richardson and others and everyone in I know you guys have talked a little bit about people living in their cars, but I just wanted to know, like, how do you really identify that I currently have a parent living in a car'",
        "'speaker_4': 'and so I've been learning quite a bit about how they maneuver and and how they kind of keep discreet in living in their car. And so and there's a bunch and they're with a group of seniors. So I just want to know and have an understanding that we're really identifying those individuals that are living in their car'",
        "'speaker_4': 'or do we haven't talked about folks, you know, that is their dwelling. Do we have a place for them that they can park to feel comfortable? We haven't really discussed that and I just would like to put that on the table.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Nick Speaker, please.'",
        "'speaker_9': 'My name is and I can say I'm a resident of the sixth district, also a member of the Teamsters Local 397. Just got here I'm you know came to be a representative of the working class just finished the ten hour shift over at UPS, you know, sending your holiday cheers and presents to your family.'",
        "'speaker_9': 'So you got anything locally? I probably throw it on to the conveyor belt. That being.'",
        "'speaker_5': 'Said, you know, I mentioned being a.'",
        "'speaker_9': 'Working class member as well as a union member because these are I'm building towards the future. You know, I'm a 30 year old man and I'm going to be here for the next couple of decades. So it's great to see these kinds of reports coming in because what you're detailing is the future that I'm going to live'",
        "'speaker_9': 'through and what eventually my children are going to live through. That being said, city staff mentioned a couple economic corridors that they would like to position this low income housing and affordable housing. And I would also like to mention a couple of myself.'",
        "'speaker_9': 'You know, there's a Willow Street going east. There is spring. You know, believe it or not, there's other places in the city that build affordable housing and local and local low income housing. That's not just west of Cherry.'",
        "'speaker_9': 'You know, this is a citywide issue and it should be dealt with citywide.'",
        "'speaker_8': 'You know.'",
        "'speaker_9': 'Mayor Garcetti in Los Angeles is dealing with it. And I just want to thank the mayor and the task force for dealing with it in our own way. Just let's let's spread it. You know, let's redistribute poverty. Doesn't have to just be in a certain part of the city, doesn't have to be in the sixth, seventh or'",
        "'speaker_9': 'eighth.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_5': 'Hello. Honorable Mayor and City Council. My name is Fred Sutton. I am here on behalf of the California Apartment Association. We represent housing providers throughout the city of Long Beach and the state of California. We want to thank the mayor for convening the task force to address this crisis that is homelessness.'",
        "'speaker_5': 'There are so many recommendations within this report that we enthusiastically support, particularly as it relates to the incentives. That is what's been working in the county, and they're all our models for the flexible subsidy pool. So it's great to see programs like the Hip being looked at closer here.'",
        "'speaker_5': 'On a local level, there are few recommended items which should be further vetted, as there are nuances that require more discussion with private rental housing providers. There are ways forward on these issues, but further discussion with housing, housing providers and community operators to achieve effective and productive policy is appropriate.'",
        "'speaker_5': 'We applaud the task force on all their work and respectfully request these items pertaining to private rental housing be discussed in the appropriate format and with housing providers. So thank you so much. Greatly appreciate it. Thank you.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_9': 'Mr. Mayor. Rex you know me. I'm one of those private housing providers. I live in the ninth district. I've been a housing provider for 20 years. My properties are my retirement. I never had a job going to pay me any retirement benefit.'",
        "'speaker_9': 'So this is something I've spent the majority of my life saving up for and some of these proposed ideas for funding this a quarter million dollars worth of money for these for your proposals is probably going to land on the backs of some of these private housing providers, namely me.'",
        "'speaker_9': 'But the additional taxes on property is going to raise rents. This is very basic, you know, that we just had a tax bond issue for a parcel tax it, which is voted in this November. You know, they got new taxes and new regulations.'",
        "'speaker_9': 'Let's see how this new parcel tax works before.'",
        "'speaker_5': 'We add more.'",
        "'speaker_9': 'Costs onto the back of it. I'm a property owner and, you know, I just spent close to a quarter million dollars improving my property. So they're making a first class dwelling unit. And if these policies are loaded onto the back of the landlords, I'm not going to be able to survive.'",
        "'speaker_9': 'And then there's going to be an adverse action, not just against me, but against the people who are living in the houses. I love the people who live in there and they're great tenants. I want them to stay.'",
        "'speaker_9': 'But costs are a major factor in keeping the property. Thank you.'",
        "'speaker_0': 'Thank you, sir. And a speaker, please.'",
        "'speaker_5': 'I'm Steve Warshaw. I've been a resident of the third district since 1969, and I'm also a housing provider. That was quite a report we got tonight. And we I don't think there's anyone in the room that would disagree.'",
        "'speaker_5': 'We have a housing crisis. A couple of things in the report, though, did kind of. Caught my attention. Changes in policy and rent stabilization sound like maybe tenant relocation fees and just cause eviction. There are major aspects of rent control, and rent control hasn't worked.'",
        "'speaker_5': 'New York's had rent controls for 76 years. It is the second most expensive place to rent in the nation. They got beat out by San Francisco, who is number one? They've had rent control for 45 years. So if we are going to implement rent control and any aspect of that, we are going to be caught trying the'",
        "'speaker_5': 'same old chore and expecting different results. And that's kind of the definition of insanity. I don't think it would be a good idea.'",
        "'speaker_0': 'Thank you, alex. Speaker, please. Next speaker.'",
        "'speaker_7': 'Good evening, mayor robert garcia and all the honorable dignitaries of the city board and council persons and the beautiful, extraordinary people of Long Beach. My name is Brandy Alexander, and I'm here on a variety of representations. A mother of a high schooler at Long Beach Poly and an independent contractor as a realtor for the state of California'",
        "'speaker_7': 'and resident of Long Beach.'",
        "'speaker_4': 'Go Beach.'",
        "'speaker_7': 'I'm here to shed light on a topic that has been misrepresented to the public. Please excuse me as my intention is not to generalize everyone present this topic. This topic is homeless prevention and the call to place on the voting ballot a possible rent freeze.'",
        "'speaker_7': 'I'm here to dispel the myth about residential income owners being greedy. These people, everyday working people, are my clients in attacking or placing the focal point of this issue on them does not solve the homeless problem. It actually creates more homelessness.'",
        "'speaker_7': 'I'm committed to working with my clients in the spirit of excellence, and it's also my fiduciary responsibility to alert them to any issue which may potentially threaten their rights as property owners. This isn't about the rent strike. Rent control or saddling property owners with any potential increases.'",
        "'speaker_7': 'This is about helping the homeless by not destroying the industry designed to house them. Thank you very much.'",
        "'speaker_0': 'Thank you. Speaker, please. These are last two speakers.'",
        "'speaker_4': 'Inclusionary right is inclusionary. It's designed or intended to accommodate diversity in age, income, race, or some other category. When it comes to housing, landlords are also impacted and not always in positive ways. Inclusionary should include all people being impacted by proposed changes, including landlords.'",
        "'speaker_4': 'Honestly, there are some housing providers who are one or two vacancies away from being homeless themselves. And where are the resources for them? There. There is so much inaccurate information disseminated about housing providers and there's a lack of protections for landlords for unpaid rents, damage to property and criminal activity.'",
        "'speaker_4': 'Homelessness is usually the symptom of larger issues, such as drug addiction and mental illness. As a single woman who's also a provider of housing, this has me very concerned, especially if you implement just cause evictions. Protections need to be provided for landlords and housing providers need to be part of the conversation.'",
        "'speaker_0': 'Last speaker.'",
        "'speaker_2': 'Good evening. Mayor Garcia and Long Beach City Council members. My name is Johnny Weir and I'm a resident in Long Beach and I have a.'",
        "'speaker_4': 'Rental property in the first, second, third and fourth districts. I'm the president of Better Housing for Long Beach, and I'm also here.'",
        "'speaker_2': 'Representing AOA, the largest membership in California.'",
        "'speaker_4': 'And I'm a member of the apartment association Southern Cities.'",
        "'speaker_2': 'We believe in inclusionary.'",
        "'speaker_4': 'Housing, but not the exclusion of personal property rights and over taxation. We are opposed to rent freezes, rent strikes and more taxes.'",
        "'speaker_2': 'For the community to pay. We had many tax increases in California towards the homeless. Let's give them these increases a chance to work before adding more taxes on the Long Beach community.'",
        "'speaker_4': 'For all the tenants here, is there any tenants here tonight? Okay. I want you to listen to what I'm going to say.'",
        "'speaker_2': 'Stop voting for bonds.'",
        "'speaker_4': 'And tax increases.'",
        "'speaker_2': 'If you don't if you want to.'",
        "'speaker_4': 'Have affordable housing because it raises your.'",
        "'speaker_2': 'Rent. When you when you increase.'",
        "'speaker_4': 'Taxes, the rents go up. Stop listening to the advocates who tell you to support rent strikes, rent freezes or rent control because rank and file cities have the highest rent.'",
        "'speaker_2': 'And the highest homeless population in the country. So housing providers did not create.'",
        "'speaker_4': 'The homeless problem. Housing providers house people. So I just want to say that.'",
        "'speaker_2': 'We brought a lot of people out here tonight. I'm just happy to be here. And thank you very much.'",
        "'speaker_0': 'Thank you very much. That concludes public comment. We have a motion and a second on the floor. Members, please cast your votes on the Everyone Home Report and Task Force. And again, as we vote, I just really want to thank the staff and the team for for their work.'"
    ],
    "Recommendation to receive and file the Parking Study for Downtown and Alamitos Beach.  (Districts 1,2)": [
        "'speaker_0': 'So please cast your votes. Great motion carrier. And I went, thank you to the council and everyone that came out to speak tonight. We're going to transition into the time certain. And so I think if you're not if you're here for next the item that's coming up which which is the parking study report that's what's next.'",
        "'speaker_0': 'If you're not here for that, please just quietly exit so we can transition into the next time into the time serve that we have. And we'll start that in just a minute as people exit.'",
        "'speaker_5': 'Are they? I'm sorry. Yeah, I think they're think. Don't believe Joe anywhere.'",
        "'speaker_3': 'Yeah. Yeah, yeah.'",
        "'speaker_5': 'Yeah. Well. I'm a landlord and tenant in Chicago. The only thing worse than landlords and tenants. I don't know where it comes. Their natural enemies or.'",
        "'speaker_0': 'Okay. We're going to go ahead and move on. Madam Court, can you please call that the time?'",
        "'speaker_1': 'Certain item item 15 report from Development Services recommendation to receive and file the parking study for Downtown and Alamitos Beach District one.'",
        "'speaker_0': 'And to thank you, I'm going to ask the item, please, guys. Everyone that's talking. You guys, I'm going to go outside. Please. Please read the item. Mr. West.'",
        "'speaker_5': 'Mr. Mayor, council members, this is an item that we've been working with the community on for a parking study in the downtown. It comes to us as a result of a settlement agreement with the TAPS Group in the downtown.'",
        "'speaker_5': 'So with that, I'm going to turn it over to Linda Tatum of our development services team, as well as Christopher Coons and our public works director, Craig Beck. So Linda.'",
        "'speaker_7': 'I'd just like to introduce our project team, which was and included the Development Services Department staff, as well as the city's traffic engineer, Eric Lidstrom, as well as Christopher Coons, and previous to Christopher Carey, Ty, as well as our consultant who is in the audience tonight and will be available to respond to technical questions regarding the report'",
        "'speaker_7': '. So I'll turn it over to Christopher for the staff presentation.'",
        "'speaker_11': 'Good evening, Mr. Mayor, and members of the Council.'",
        "'speaker_9': 'So as.'",
        "'speaker_11': 'Was mentioned, this parking study looking at downtown and Alamitos Beach came out of a settlement agreement, but really became more than a legal settlement. It became an opportunity for the city to work with the community and get really good data and chart a pathway forward to address parking issues in two very different environments one being downtown and'",
        "'speaker_11': 'one being Alamitos Beach. So there's basically four aspects to the study that Kellaway did with staff. One is collecting data so that we're basing our assumptions on facts and not just on implied assumptions, and then identifying strategies to increase parking availability, a public outreach and engagement component.'",
        "'speaker_11': 'And then the final documentation, which is the report that's in front of you this evening. So as mentioned, after we came to an agreement on a number, a complex set of litigation related to certain successor agency projects, sales, project, property sales.'",
        "'speaker_11': 'We came together with Albie Tops, which is Long Beach Transportation and Parking Solutions. They were at the table with us as we crafted the RFP. They were part of the RFP process where we selected the consultant. We selected KOA Corp., which in our view and staff's view did an excellent job on this study.'",
        "'speaker_11': 'They were that was a choice that I'll be tops was involved in and supportive of. And the entire process was data driven, as I mentioned. So when we look at what we found, we start with downtown. And based on Kayleigh's assessment, the factual assessment, there is an excess of available parking downtown.'",
        "'speaker_11': 'Now, when we say there is an excess of available parking, that does not mean that on any given hour that every visitor or resident is able to find exactly the parking space they want. AT Exactly. Exactly the moment they want.'",
        "'speaker_11': 'What it does mean is that there is numerically an excess supply of parking and that that is demonstrated in accounts that were done weekday off Street. There's a good amount of parking available. And then when you look at the weekend, there's a good amount of parking available.'",
        "'speaker_11': 'The other thing that we look at is parking turnover. So businesses especially need parking to be available not just to one person that parked there all day, but for customers to be able to come and go throughout the day.'",
        "'speaker_11': 'So that's why we look at turnover, how many times a specific space is used during the course of the day. Turnover is fair within downtown at about 2 hours and time, and parking is generally available throughout the day.'",
        "'speaker_11': 'What we did find, however, was a lot of that available parking can be hard to find and that signage is lacking. So a recommendation of this report, which is just one example of many items where our work has already begun, has to do with improving wayfinding.'",
        "'speaker_11': 'And this council previously placed a wayfinding package not just for downtown, but citywide. That's being implemented already. So this just shows you we went blocked by the consultant team with the city, went block by block measuring parking and measuring parking availability.'",
        "'speaker_11': 'And as I mentioned, it doesn't mean that parking is always available perfectly on every block. But as you can see illustrated here in color that it's not more than a single block walk to a block, that there is more parking availability based on the data.'",
        "'speaker_11': 'So what we found in Alamitos Beach is very different than what we found downtown. So I think all of us that live in the study know these findings from firsthand experience. There is a parking shortage within Alamitos Beach.'",
        "'speaker_11': 'There is very limited off street parking and there is on street parking, but not enough at peak periods. Parking is oversubscribed, especially on weekends, when businesses and residents are competing for the exact same on street parking. Turnover is generally fair to poor, so instead of the 2 hours that we saw downtown, you see longer turnover.'",
        "'speaker_11': 'And that relates directly to residents and businesses competing for the exact same parking. And obviously a resident wants their home. They're going to park for the day, for the evening, not for a limited period of time. What was interesting is there was the public outreach component that we talked about, and many residents admitted that their garage is'",
        "'speaker_11': 'used for storage rather than for parking, and that increases the demand for already constrained on street parking. I'm looking at the data all over a majority. Most of the buildings in Alamitos Beach were built before modern parking requirements, so they have significantly less parking than what the zoning code requires today.'",
        "'speaker_11': 'This is a map of parking availability within Alamitos Beach. And again, we went block by block to understand what that data was telling us. So this study provides data and it provides a point in time. But what's happening within public works and we're glad to assist here.'",
        "'speaker_11': 'And Development Services is a day by day progress and continual attempt to increase parking availability. So downtown, that's really about signage and wayfinding, but it's also about changing the angle of diagonal parking. It's about parking being added through various roadway reconfigurations.'",
        "'speaker_11': 'It's about prioritizing red curb and yes, having necessary red curb every moving it where unnecessary to add additional parking. And it's also about using technology such as various apps too, so that people do know where the available parking exists in terms of public outreach.'",
        "'speaker_11': 'So we mentioned that all Taps was involved in every step of this process, but we wanted to reach a broad section of the community. More than 4000 online surveys were completed, but we wanted to make sure that we were reaching folks that maybe did not receive an online notification or advertising.'",
        "'speaker_11': 'So we did what are called intercept surveys. That's the low tech solution. That's someone with a clipboard at specific locations throughout the study area asking people about their parking experience. The public generally favors increasing parking supply, not unsurprisingly, changing parking restrictions, having specific parking that's residential restricted and providing alternative forms of transportation.'",
        "'speaker_11': 'So that could be a traditional transit, but that could also be scooters and bikes and the next thing that we haven't seen yet. So summarizing the findings of what we found, the study had found that Alamitos Beach has a major parking shortage or has a significant parking shortage.'",
        "'speaker_11': 'As a reminder, most structures in Alamitos Beach were built before 1952. That's a critical day when the city started requiring parking. And even that data in 1952 was not until the 1980s that we required significant amounts of parking.'",
        "'speaker_11': 'So 20% of survey respondents noted that they use their garage for storage, not for parking. So it doesn't account for is folks that tend to want to be forthcoming about what they're using their garage for. Um, residents and businesses are competing for parking and Alamitos Beach in a more significant way than we find in other parts of'",
        "'speaker_11': 'the city. And that results in existing on street parking being oversubscribed, varying from just slightly oversubscribed during some daytime periods to very oversubscribed during the kind of dinner period where restaurants are competing just as residents are coming home and looking for their place to park.'",
        "'speaker_11': 'So the point was not just to document the problem, it was to see where we go forward. So there are recommendations that are attached to your staff report, both for downtown and for Alamitos Beach, and these are things that we're already doing.'",
        "'speaker_11': 'So adding supply of street parking and then things that we will be doing over the longer term. So looking at robotic parking facilities and use of technology, working with parking applications to help those technology providers provide the public with information about where they are and promoting making it as easy as possible to understand our parking signs and'",
        "'speaker_11': 'where you can park and when and when not. So that work is already happening. On the development services side, we've made substantial strides in the last two years to allow for parking, lifts and automated parking, and you'll see that reflected in the marketplace over the next couple of years.'",
        "'speaker_11': 'So as we talked about, there are different recommendations for downtown, as there are for Alamitos Beach and downtown. The issue really is helping people understand where existing parking resources are already available. And we're working in partnership with the LPGA to do some of those signage improvements, among other improvements.'",
        "'speaker_11': 'Whereas in Alamitos Beach, it really is about providing parking as we can, but also finding ways to encourage people to that do have access to garages, to use those garages for parking and improving transit service so that if folks do have to park out of area, that it's easy to get to their destination within Alamitos Beach.'",
        "'speaker_11': 'So as part of the settlement, there is a Parking Solutions implementation fund. It will fund some of the improvements outlined in this report, but it will not fund all of them. The report itself does talk about longer term funding strategies, and there are budget implications to many of these recommendations that would have to come back to this'",
        "'speaker_11': 'body. So today we're here to present this report and you're being asked to accept this report, but that is not the end of making parking improvements. So as a partnership between development services and public works, the work will continue to get additional parking resources, but also to provide funding mechanism for the Parking Solutions Fund going forward.'",
        "'speaker_11': 'So with that staff does recommend that you receive and file the parking study. This will conclude our obligations under the settlement agreement, but as I mentioned, will not conclude our efforts to increase parking supply in Alamitos Beach and parking accessibility downtown.'",
        "'speaker_11': 'So with that, we look forward to your questions.'",
        "'speaker_3': 'Public comment. You guys are going to come in first so anybody become an item to please come up. 3 minutes.'",
        "'speaker_5': 'Please.'",
        "'speaker_3': 'Uh. 3 minutes up.'",
        "'speaker_5': 'Yeah, right.'",
        "'speaker_3': 'No questions at public comment right now.'",
        "'speaker_5': 'Yes, Larry, good record because he addressed just a comment. When you're dealing with parking, it is also then parking meters and heard an interesting comment. From two dogs walking down the street. And I think it's important to understand how they view parking meters as paid toilets.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you. It's video.'",
        "'speaker_5': 'Uh uh.'",
        "'speaker_9': 'I live downtown in the East Village, and some of the people in the East Village have parking meters in front of their apartments. So it's not fair to them to be paying a parking meter seven days a week to park for their own apartments.'",
        "'speaker_5': 'Also, too, you're putting all these new high rise.'",
        "'speaker_9': 'Buildings into the downtown area. ALAMITOS Enough. First Street. I mean, second Street. You have the tallest building coming up on a on a Alamitos and ocean. You got the tall building right there.'",
        "'speaker_5': 'Opus Pacific and others. And most people.'",
        "'speaker_9': 'Today have 2 to 3 cars.'",
        "'speaker_5': 'Per unit. So if you're putting one car per unit in these buildings, what does the other oh, the other two cars go?'",
        "'speaker_3': 'Thank you, sir.'",
        "'speaker_12': 'Hi. My name is Beverly Lifer and I live in Alamitos Beach. I'm fortunate enough that I found a home when I moved here eight years ago that has a garage that I do use for my car. But I think we need to look at other alternatives.'",
        "'speaker_12': 'I can't take credit for this, but so on our next door there were complaints about people parking at a shopping center during the day. But then someone said, What about taking that parking lot in a shopping center, that all the stores are closed overnight and have some kind of paid parking?'",
        "'speaker_12': 'That is organized between the city, the property owner and the stores, and can be from five, six, 7 p.m. to six in the morning the next day so that people, residents will have parking. Also, there are plenty of empty lots that used to have buildings that no longer have buildings, and I've seen a few of them.'",
        "'speaker_12': 'And I don't know if it was through the city or privately that have opened up as paid parking and you see cars that are parked or ARVs for days, which is fine. It's a parking lot and that's what they should be used for.'",
        "'speaker_12': 'So I'd like to see the city coordinate and work with property owners of these empty lots and shopping centers to have some kind of overnight parking provided. And it's paid or a long term parking. Thank you for your time.'",
        "'speaker_3': 'Thank you very much. Next, bigger. Okay.'",
        "'speaker_4': 'Hi. My name is Debbie Tobias. I live at 100 Atlantic and Long Beach. I'm president of Long Beach Taps. Long Beach could be a shining example of how to do parking right while still accomplishing its mobility goals. Many new parking programs can pay for themselves and fund others.'",
        "'speaker_4': 'We are asking for your help and need your leadership to do this. After four long years of trying, we failed to get the city to look at the parking issues and solutions. The lawsuit asked for a court order that would have required the city to follow sequels.'",
        "'speaker_4': 'Not following those laws would make parking problems worse, resulting in more traffic and air pollution. Taps did not ask for money. The city's attorney led the city to settle. When we agreed to the settlement, we gave up something valuable.'",
        "'speaker_4': 'The court orders. The intent of the settlement was to bring data, professional valuation and new options to you. The city agreed in the settlement that the parking study would do certain things, bringing an unusual opportunity to make things better.'",
        "'speaker_4': 'The study was required to be solution oriented, comprehensive and close inclusive of all users of parking, identify funding, recommend pricing strategies. Find ways to integrate private parking for public use, protect existing residential parking, review all existing standards, and make any recommendations deemed warranted based on the data analyzed.'",
        "'speaker_4': 'KOAT and City Reps. Tom Modica, Eric Wood Strand and Kerry Tai are professionals who are trying to address the parking issues. They had thorough, creative, open and honest discussions on multiple fronts. At some point, something changed, especially on the subject of the downtown parking regulations.'",
        "'speaker_4': 'When Draft two came out, it looked like big holes had been punched in the study. There is a parking problem in downtown Long Beach and we do need to address it now. The city is concluding the study without adhering to the work scope, leaving out things that are crucial to planning for $250,000.'",
        "'speaker_4': 'You got something that looks more like a staff report stating little more than what the city was already willing to do. History tells us that very little will change regarding action on parking if you turn over further action to staff.'",
        "'speaker_4': 'Now, unless you decide to help out your residents and really work with us to find solutions, we ask that you hold a study session on parking with the Planning Commission, include Michael Kodama because he has more expertize on parking and toady than anyone on city staff that has worked on parking.'",
        "'speaker_4': 'We ask that you declare a moratorium on accepting new development applications until you have the data and professional evaluation that's needed to plan better for parking. Thank you.'",
        "'speaker_3': 'Thank you very much. Next speaker.'",
        "'speaker_4': 'Good evening. I'm Laura Greco. May addresses on file on it for Alameda speech as more people are added to our area the planet for them this study will make it very well make very little difference in our ability to park.'",
        "'speaker_4': 'This is not just our opinion, but also that of our parking consultant Michael Gadamer, who taps paid to advise us and give us feedback to the study team. We've provided you with his written opinion of the parking survey.'",
        "'speaker_4': 'In his memo, he states that important elements are missing from the study that are needed to make the recommendation work. His he points out some of the key conclusions are not backed by data. Data, for instance, it should be noted that field observations stopped at 6 p.m. and therefore the analysis missed some of the impact related to'",
        "'speaker_4': 'residential parking needs later in the evening. He also says that a false statement. It's a false statement to say that there is no parking problem downtown. He explains why it does not analyze blocks, but rather only looks at total numbers for a large project area.'",
        "'speaker_4': 'Please consider asking for alterations to the study. Don't just receive and file. The study relies heavily on parking management to self-parking issues without four key needs to accomplish that. Management. A parking plan. Parking for new buildings. And a funding plan.'",
        "'speaker_4': 'And a funding plan. Parking Management. The study only describes how parking management is currently spread over multiple city departments and tells the city how to go about hiring management should they decide to do so. Kodama says it is important that the city of Long Beach find a parking manager to focus on this complex issue.'",
        "'speaker_4': 'I cannot think of a large city without a parking manager or parking department. It is critical that the parking management program not be seen as a one time deal. It must be continuous, collaborative and comprehensive. The parking plan, the existing downtown plan considers visitor parking, not parking for residents and employees.'",
        "'speaker_4': 'The area needs to be a comprehensive parking plan that is balanced to include the needs of all types of parkers. Kodama points out several things that should be considered, including using incentives rather than more enforcement in the area that has parking issues regarding residential permits, he says.'",
        "'speaker_4': 'We need a new approach to develop residential. Parking programs and management options beyond the concept that the residents should set up a parking assessment district or hire their own management operation firm themselves. Thank you.'",
        "'speaker_3': 'Thank you very much next week.'",
        "'speaker_5': 'Lane car crash of Atlantic Avenue. This parking study probably will not make parking easier for people because there's too much missing from the study. The study relies heavily on parking management to solve parking issues of other four key needs to accomplish that management a parking plan, parking for new buildings, and a funding plan for parking for new'",
        "'speaker_5': 'buildings. Parking consultant Mike Adams says this As members of the city, how can they find no evidence that a new development in downtown Long Beach has triggered any parking shortage or that there is no need to consider parking requirements for new development without an analysis linking parking requirements and utilization to existing and proposed square footage.'",
        "'speaker_5': 'This analysis is incomplete without that. He also says it is not a comprehensive program as it does not address the extremely important issue of residential spillover. Parking does not set parking priority users in some areas around the downtown commercial core, nor developed an evaluation mythology based on parking data.'",
        "'speaker_5': 'In addition, any analysis of future parking demand must consider the loss of parking spaces usually associated with new development in a dense downtown environment. As for funding, many parking studies include an analysis of new revenue streams from parking programs they can buy.'",
        "'speaker_5': 'They combine that info with an analysis of parking pricing. The result is a planning tool that allows the city to create a funding plan to improve parking parking improvements. Besides big parking structures, structures are available like automated parking loan programs and partnering with developers.'",
        "'speaker_5': 'The study does not provide such an analysis. Mike Goodall also says this in his Memo to the City. It is also suggested that potential parking revenues be reinvested back into a parking management system. This can be from the parking management program.'",
        "'speaker_5': 'This is not a new concept and has been effective in cities such as Portland, Seattle, Ventura, Pasadena, San Diego and many other places. It creates transparency and opens up a willingness to pay for parking, knowing that it is being reinvested back into the community with the parking issues.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_3': 'Thank you very much next week.'",
        "'speaker_5': 'Hi, Robert Mills, 100 aspirants.'",
        "'speaker_3': 'Mr. Mill, I think you answer my questions right. You wanted to ask some questions? I don't.'",
        "'speaker_9': 'Know. I just have a statement.'",
        "'speaker_3': 'Okay, fine. Thank you. Go. Gwen.'",
        "'speaker_5': '100.'",
        "'speaker_9': 'Esperanza. I went to the meeting where you unveiled your plan for Long Beach, and I must say, I thought it was very, very impressive. Just like the homeless plan or the plan for the homeless. Rather very, very impressive.'",
        "'speaker_9': 'Some of the words that were used included thoughtfulness, foresight, the minutia of the plans, the meticulous planning, and uptown, downtown and Midtown plan. There's a lot of fodder there for a new Bruno Mars song. But, you know, with all of this planning, it just seems like we're getting short shrift when it comes to parking in Alamitos Beach'",
        "'speaker_9': '. I hope that you guys use the same due diligence with the homelessness and any other plan on our own parking in Alamitos Beach, because you are talking about our quality of life. And government is supposed to work for everyone, not just select neighborhoods.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_3': 'Thank you, sir.'",
        "'speaker_5': 'You know, I think. Speaker Hi, my name is Romeo Pineiro. I live here in Elementos Beach. I've been visiting Long Beach since the park was a big parking lot. I just recently became a resident of Long Beach about a year and a half ago in which I've collected over 30 parking tickets.'",
        "'speaker_5': 'Because I am a self-employed, I come home at whatever hour of the day. Sometimes I come home at night. I have to circle the block from bonnet all the way up to Esperanza, maybe up to Second Street, Pass Broadway, maybe even parking.'",
        "'speaker_5': 'As far as where the Vons is over here, because there is no spots. Not only that, but heading down all ocean. Or even friends living up towards Long Beach and PCH. Or all the way up to. PCH and Redondo are those problematic parking spots not only for Alimentos Beach, but everywhere else?'",
        "'speaker_5': 'If you take a drive at 3 a.m., at least in Alameda Beach, you'll find a lot of cars parked on red, which should be actual parking spots. There's a lot of red curbs that can allow maybe two or three more cars parked.'",
        "'speaker_5': 'But it's a red spot. And we're giving. We're getting tickets at night. Sometimes we residents, our friends around my area, don't even want to leave their house over the weekend because we don't want to lose our spots to where?'",
        "'speaker_5': 'I have to tell one of my friends who has a motorcycle to give me a ride down the street or give me a ride to the grocery store or Hey, let's go eat at Marina because I don't want to lose my parking spot.'",
        "'speaker_5': 'And this goes. For everyone that's impacted by the parking problem. My main thing is take a drive at 3 a.m. around these impacted places and you'll see all these cars not bothering anyone. Just trying to look for a parking spot.'",
        "'speaker_5': 'Just getting tickets left and right as I accumulated over 1300 dollars worth of tickets already, where I was happy to be moving into Long Beach. And I'm just sad that I might be moving out of Long Beach because of this.'",
        "'speaker_5': 'And I have a beautiful apartment on Ocean Boulevard that I don't want to give up, but. Worse comes to worse. I maybe I should give it up because nothing is being done in the area, at least Alamitos Beach area, and paying over $600 for a parking permit to park behind the the main building here or at the'",
        "'speaker_5': 'Marina Green. Waking up at eight in the morning so you don't get a ticket by not seeing the meter. I mean coming home from work late still have to get up to. Move your car to another parking spot doesn't seem pretty fair.'",
        "'speaker_5': 'I just ask that you guys take a look at that and maybe just make those red curves actual spots and and and see that for yourselves, that it could create a better solution than just keep giving us tickets.'",
        "'speaker_0': 'Keynote speaker, please.'",
        "'speaker_1': 'Hi. My name's Kelsey Simpson. I'm a resident in Alamitos Beach, and I've gone to a lot of the meetings that we've had. We've talked with Councilwoman Pearce about the parking issues in our neighborhood, specifically. I live on Cherry and first.'",
        "'speaker_1': 'So what I want to do is kind of humanize parking for a second because I feel like the study makes it look like a bunch of numbers and a bunch of data, and you can count cars and count spots and count, you know, garages.'",
        "'speaker_1': 'And much like the speaker before me talked about what happens a lot in Alamitos Beach are people are having to rethink their entire life based on parking. So it's what time do I have to leave work? What time am I going?'",
        "'speaker_1': 'Where am I going? What's going on? And then if you are fortunate enough to find a spot on the street, it's happened to me the other morning. I'm leaving to go to work. I'm a teacher. I work in Downey.'",
        "'speaker_1': 'I was leaving at 6 a.m. and there was a car just parked illegally behind me because I'm guessing that they circled for hours and hours and hours and couldn't find a spot. I waited for 35 minutes as much as they allowed.'",
        "'speaker_1': 'I knocked on people that I knew. I mean, it was super early in the morning. I also don't want to be an extremely rude neighbor, you know, and unfortunately live.'",
        "'speaker_2': 'With somebody else who I just took their.'",
        "'speaker_1': 'Car and sent them in taxes and inside I left my keys for you. This is where my car is parked. I couldn't leave. What's happening to is I know that Long Beach in that specific area has done, you know, adding more spots.'",
        "'speaker_1': 'So they repainted the diagonal lines and change the angles. What that did is allowed the the guy on my street.'",
        "'speaker_2': 'Who collects hearses.'",
        "'speaker_1': 'He currently has six of them. And he's just added actually, I think a seventh I counted on a bike ride the other day and it allows him to continue to add to this on street parking problem. I'm guessing that he doesn't drive a hearse in his normal car.'",
        "'speaker_1': 'So then that would add an eighth car that a resident is storing in our neighborhood. And the more you circle around, the angrier you get at the hearses. Then it also allows and people that live in Alamitos Beach know exactly what I'm talking about.'",
        "'speaker_1': 'They also turn old.'",
        "'speaker_2': 'School busses into cool busses.'",
        "'speaker_1': 'Literally scraping off, you know, the letters to make it like that as well. And those cool busses end up taking up three or four spots on the street as well as like ambulances that people buy, I'm guessing, in auctions and whether they're living out of them.'",
        "'speaker_1': 'And that's the larger issue.'",
        "'speaker_2': 'But what the issue is, is that these these are.'",
        "'speaker_1': 'Taking up our spots, basic things in place like residential permit parking.'",
        "'speaker_2': 'Which was discussed, as well as having somebody in the city who who's specifically.'",
        "'speaker_1': 'In charge of parking and has a parking planning background that has a lot of the knowledge of what is being spoken about and written about in the study would really help and be beneficial, I think to everyone. And we've talked about that with Councilman Pearce at the Abney meetings with Alamitos Beach and we've gotten community support, we've'",
        "'speaker_1': 'got the we were a huge part in getting a lot of people to take the online survey. We want to live there. We want to like actually live and not, you know, live to park in, park to live.'",
        "'speaker_2': 'I apologize to you on behalf.'",
        "'speaker_1': 'Of most of Alamitos Beach residents who couldn't make it tonight because they didn't want to lose their parking spot.'",
        "'speaker_0': 'So I make you last speaker, please.'",
        "'speaker_9': 'Hi. My name's Christopher Hassler. I'm an urban planner and I'm currently serving on the board of the Elements Peach Neighborhood Association and here I City Council to amend city code so that residents can band together to create overnight breaking for districts in Alamance Beach just as city allows residents in other parts of the city to create preferential'",
        "'speaker_9': 'parking districts that keep out commuter traffic. As you've seen in the parking study, our curb parking has been abused. The point where you can take a resident 30 minutes or more when they return home or turn home at night.'",
        "'speaker_9': 'There are a number of factors at play here, but the most important is the waste of off street parking space. As you saw in the presentation, at least 20% of residents with garages do not use those garages to store their cars.'",
        "'speaker_9': 'Given that most residents would be reluctant to admit that it's safe, say that the percentage is much higher than that. The city's inappropriate policy of asking residents to report on their neighbors garage use has been ineffective. Furthermore, the season action on our breaking problems has led some residents to try to take matters into their own hands by'",
        "'speaker_9': 'leaving threats on their neighbors windshields for, you know, the father of this person in park well enough or some other perceived issue. Others use junk cars to claim extra space. And then there's a few residents that use collect hearses and other recreational vehicles.'",
        "'speaker_9': 'Since there's no room to really increase the parking space in the neighborhood, we need to focus on reducing parking demand as recommended by Highway and overnight Premiere district. That limits demand and encourages more residents to actually use their garages for their cars would go a long way in relieving the intense competition for curb space.'",
        "'speaker_9': 'From speaking with Councilmember Pearce and other members of the community, there seems to be some concern about Coastal Commission approval. But plenty of plenty of coastal neighborhoods and other cities have established similar parking restrictions as long as enforcement powers are kept within the hours when our beaches are closed.'",
        "'speaker_9': 'We aren't interfering with public access to the beach. By creating an overnight policy. The city isn't forcing a permanent district on anyone, but instead giving residents a tool that they can decide to use for themselves. Residents would need to gather signatures.'",
        "'speaker_11': 'Just as they do for the existing.'",
        "'speaker_9': 'Preferential parking districts. Overnight parking permit districts are crucial to establishing a more equitable system of parking. I would love for the opportunity to sit down with Councilmember Pearce and her staff to form a new policy that works for Alamitos Beach and that can serve as a model for so many other neighborhoods in Long Beach that are suffering'",
        "'speaker_9': 'from the same issue. Thank you.'",
        "'speaker_0': 'Thank you very much. Bob, a comment is closed. Oh, sure. Please come forward. No, no, no problem.'",
        "'speaker_5': 'It's good enough.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_5': 'Name is now g livin. Let me no speech at five o East Ocean. Um the young lady earlier when she say that the comment and next thought I was I was on I made that comment. Some business high rises or businesses says the parking is empty all night whatever the cases what if he could work something as'",
        "'speaker_5': 'a Long Beach transit so to have some kind of shuttle gone up and down so that way the tenants or whoever the looking, the parking, it's not like we're going to be parking for free, but they will pay some kind of fee.'",
        "'speaker_5': 'So at least the shadows would be going all the way around. Pretty much. Until the morning hour. So that was a win win win situation. So the office building, their will or the business area there will get some kind of income.'",
        "'speaker_5': 'The tenants are willing to pay for this money on this one. So that just one suggestion I have. Thank you.'",
        "'speaker_0': 'Thank you for that. Let me go and close public comment. Councilmember Pearce.'",
        "'speaker_2': 'Thank you. And thank you all for all your efforts through the years for staying here through another discussion, a lengthy discussion. And I want to thank staff as well. I know that this is kind of house with development services.'",
        "'speaker_2': 'It started with public works. And so I know that there's been a lot of conversation. And so ago, similar to our homeless challenge, is that we've got a lot of great ideas, but having a way to kind of lead those ideas and making sure that we're implementing those.'",
        "'speaker_2': 'And so I want to start off by saying, obviously, parking is has always been a big issue for me, transportation, making sure that we have safe neighborhoods, making sure that people feel safe walking, you know, five blocks from their car to their home.'",
        "'speaker_2': 'And so it's an issue that I take really seriously. And I know this my council colleague does as well. I want to start. I guess by saying that I do know that I did see I don't know if it was a first draft, but with the maps it had, like the timing of when you guys were looking'",
        "'speaker_2': 'at things. And so I recall looking at that. And if we break it down in between downtown and I made a speech that downtown did have more openings, as is relayed in this report. I'm curious, what is our housing vacancy right now in downtown?'",
        "'speaker_2': 'I know we've got a lot of new developments. I know we have a lot more coming on. I don't know if you have that answer off the top of your head.'",
        "'speaker_7': 'We we know that citywide the vacancy rate is around 4%, somewhere just under 4%. But we don't have specific vacancy rates.'",
        "'speaker_4': 'For.'",
        "'speaker_1': 'The downtown area.'",
        "'speaker_2': 'Okay. Because I know that there's some discussion around the difference in between, you know, how full downtown is and how full Alamitos beaches and downtown. We have new residential units. We have different type of of folks that are living there versus in Alameda speech, which is almost 100% renter.'",
        "'speaker_2': 'And it's basically stacked on top of each other without any parking requirement. So I just wanted to identify that difference in between the downtown and Alameda speech. I have a lot of notes, so let me try to start off with the conversation around having a parking czar or a parking manager.'",
        "'speaker_2': 'This is something that we've talked about since I've been in office. I know that we have a lot of mobility items, whether it's bikes or transit, the free ride. What would it take for us to have one person that is committed to a parking management plan that can lead across all departments?'",
        "'speaker_7': 'Then what that would take, I would say, would be funding. Because right now we do have a staff in the public works department that devotes a substantial amount of time to parking issues and managing and operating some of the city's parking garages and even the multi-modal means of transportation.'",
        "'speaker_7': 'However, we do not have a staff that's dedicated full time to parking. And if if the council were to consider that, that is certainly something that they could consider in the upcoming budget to fund a position for that.'",
        "'speaker_2': 'Great. Thank you. And I think the reason it's great that we have somebody that's in there dealing with it, but it's even better to have somebody says, this is our point person across the entire city that can work in trouble.'",
        "'speaker_2': 'Areas can look across and say, okay, this works in Bixby, this works in Belmont Shores, Alma's beach. We've never done anything. And, you know, I'm glad that this I meant to say at the beginning, I'm glad that we're to this process because I've felt like my hands have been tied from being able to do big items.'",
        "'speaker_2': 'So I'm very happy that we have this today so that 2019 we can really be focused on implementing some of the strategies that are in here and putting teeth to them. And so one of them is I definitely would support having a parking person that would help us across the city, particularly because we are developing a lot'",
        "'speaker_2': 'more residential units. We've got 4000 planned in downtown. We've got the land use element with everything that's coming up with that. So I think it's an important time and that's something that I would definitely support to the comments around the open lots.'",
        "'speaker_2': 'This is something that my staff personally went lot by a lot my first six months when I got into office. We know that Didi's on seventh is open to having their lot out. We know that the Thai place on Alamitos and Broadway is open to having their lot.'",
        "'speaker_2': 'One of the questions we've always asked was, What would that take? And we've had the conversation between insurance or is it putting in a meter like we have at fourth and cherry? And so I hope that I can get an answer from staff today so that coming in the new year we can give some direction to because'",
        "'speaker_2': 'that's very low hanging fruit. So is there a comment on what it would take to make that happen?'",
        "'speaker_7': 'In order to make that happen, it is actually something that staff is already working on. Economic development staff is actually currently contacting various property owners with parking lots that they don't use overnight and currently exploring the option of establishing some kind of contractual relationship with those organizations or those property owners so that we can use those properties'",
        "'speaker_7': 'on an overnight basis. And we think something like that, along with some of the other initiatives that we've talked about here tonight, we think that those can start to make a dent in that that that parking issue.'",
        "'speaker_2': 'Okay, great. And I think one of the I don't want to go through the entire report today, but I think it's there's a lot of recommendations in here and similar with the homeless issue is knowing where we're at and giving some timelines and saying, you know, with this issue and Alameda speech, I'll commit one of my whole'",
        "'speaker_2': 'staff members to say three days a week, you're only working on parking with development services. And just to make sure that we are engaging and moving quickly. And so that's one area that I think is low hanging fruit.'",
        "'speaker_2': 'And we'll make sure you have the same list that we have of those businesses or economic development. Parking, homelessness. Ah, there you go. And one of the conversations I'd like to have with talking about opening up those private lots, we just had a transportation committee meeting last week where we talked about free ride and talked about some'",
        "'speaker_2': 'of the funding sources. So if we're identifying lots like this, if we're saying, well, part of that funding, if we have a contract share where they get part of the funds, the city gets part of the funds, that those funds would go toward something like free ride that would be able to take somebody from Alamitos, you know'",
        "'speaker_2': ', into the downtown or vice versa. So getting to the permits so I think is great to read through the idea of the permits and understanding that nighttime permits are more likely to get passed through the Coastal Commission, which is something that I did not understand until recently.'",
        "'speaker_2': 'And so curious on a timeline, if we wanted to, to look at this in looking that it's resident led but that the city first has to change its code. Correct.'",
        "'speaker_7': 'I'm not sure that right now there is a prohibition. It really would be initiated by the staff, but certainly I'm sorry by the residents. But staff is certainly available to sit down with them, work with them and come up with a program that we could at least direct and guide them into the procedures to establish some type'",
        "'speaker_7': 'of overnight parking program. And again, I think to the point that many of the commenters spoke tonight, I didn't I don't think that I heard many suggestions that we aren't already working on or that we think are fairly low hanging fruit the.'",
        "'speaker_4': 'Staff could continue to pursue.'",
        "'speaker_7': 'And that is certainly one of those.'",
        "'speaker_2': 'Okay. So again, I mean, I think it's great that you guys are working on it, but understanding, you know, this is three months out, this is four months out. And I know that timelines are tough. I know that this was supposed to be in front of us in July.'",
        "'speaker_2': 'And but if we can have a benchmark and we say, okay, we're not where we thought we should be at this time, what staff resources need to change? What community resources can we engage in so that we can get it get it done?'",
        "'speaker_2': 'I don't want to have this same conversation in two years. The last thing I will say is that I expect in January I'm going to work with with Taps, with Alamitos Beach, I'm going to work with staff. And in January, I hope to bring forward some of these items that after we have a conversation that we understand'",
        "'speaker_2': ', need a little bit more council direction to get done, whether that's a committee or task force, whatever that looks like, that's short term that we can make sure that we implement quickly. I know there are a lot of other things on here, but I do want to just thank community members, especially those that that that reach out'",
        "'speaker_2': '. And I, I know that this is a challenge I have I'm a rancher myself, live in Alamitos Beach, have walked blocks in the middle of the night and understand the safety issues that are of concern for us. One more thing on the garages, I do have a question.'",
        "'speaker_2': 'So my house that I previously lived in had a garage. The neighbor called code enforcement on us. Our car didn't fit in the garage. And so is there an opportunity for us to create a register of garages that would be available to rent should somebody's car doesn't fit or they don't have a car?'",
        "'speaker_2': 'So you know what? My neighbor can rent out my my garage. Like, just some challenges that we have with old garages.'",
        "'speaker_11': 'Sure. So the registry is not currently on our implementation list, but certainly we can take a look at that. But just to clarify, for the council and for the public, the requirement under the city's codes is that the garage should be available for you to park in, and we can't force an individual to park in their garage'",
        "'speaker_11': '. So even if I don't know what kind of car you drive, but even if.'",
        "'speaker_2': 'Chevy.'",
        "'speaker_11': 'Even if you know your car doesn't fit in the garage, a different style of vehicle by.'",
        "'speaker_9': 'Name.'",
        "'speaker_2': 'And they said, you can fit a motorcycle in here so that we don't drive a motor.'",
        "'speaker_11': 'So that's why from a code and enforcement standpoint, even if your particular vehicle doesn't fit in that garage, the requirement is that the garage should be clear enough that it be available to park in. And that way, whether it's a third party parking in that garage or some future different toys and vehicle that we can get those'",
        "'speaker_11': 'cars into those off street parking spaces to relieve the on straight parking demand.'",
        "'speaker_2': 'Great. Thank you for that. I'm sure I have lots more comments, but I fully expect to have an agenda item in January following up on some implementation with us. So I've got Connor here. He's going to come over and connect.'",
        "'speaker_2': 'I think we had a challenge with getting our most recent meeting on the calendar, so I want to make sure that happens soon. Thank you guys very much. And thank you, staff.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzales.'",
        "'speaker_1': 'Yes. And thanks to everybody for being here. I know I met with a couple of you yesterday, so I really appreciate the time. And similar to what Councilmember Pearce mentioned, you know, I really hope this. Stay is a living document that we continue evolving it.'",
        "'speaker_1': 'I also believe we do need to consolidate resources and definitely reevaluate policies and so I look forward to working with Councilmember Pearce in the coming year. So first and foremost, I think the parking revenue sort of the parking revenue plan, it seems like historically we've been very reliant on parking meter revenues only as the only source and'",
        "'speaker_1': 'increasing the parking meter revenues which, you know, we have to do every so often. But it just seems like that's the only thing. So I know this plan looks at other options as well, which I'm encouraged by. So I that's one sort of thought.'",
        "'speaker_1': 'In addition, I know private lots, they're being managed by various different companies. And I don't know what kind of conversations we're having in terms of consistency about rates. Consistency about. You know, everything related to accommodating residents. Can you give us a little bit of update on that?'",
        "'speaker_1': 'Because I know that's been an issue historically. And where are we at with just private lots and.'",
        "'speaker_7': 'I'm sorry. You mean private lots? That private parking lots?'",
        "'speaker_1': 'Yes, private parking lots. And their rate, the rates that are being charged, I mean, from what I remember and when you look on the website, there's various different rates. So I how where are we at?'",
        "'speaker_7': 'I'm not sure where we are on that. The parking study did a fairly comprehensive job of identifying a different private parking lots and parking structures, but I'm not sure that it actually went into the actual parking rates. That's something we would have to go back and take another look at.'",
        "'speaker_7': 'I don't think we have that information currently.'",
        "'speaker_1': 'Okay. That's one thing that continues to come up. I know with businesses and residents in downtown just the seems like there's an inconsistency with rates and it just one area might be $25 a month. There might be another area that might be 50 or $100 a month.'",
        "'speaker_1': 'And I think that it's just not consistent at all. So if we can look into that a bit more, that would be great. And I am of the same mindset. I believe we need a parking manager. I remember Luis Maldonado back in the day for all of you have been here for a long time.'",
        "'speaker_1': 'It was nice to have somebody that had the experience to go to, to talk about parking management and just where can we reassess and reevaluate policies? Where can we add meters, smart meters, or not take them away, whatever we need to do.'",
        "'speaker_1': 'I think I would like an emphasis on on that next year as we look at our budget and you know what it is that we can do and I know that we're looking at that currently.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_11': 'And council member just to go back to your question, so in your report, um, it's on page 97 of your report, we do survey what's being charged as far as off street parking that's available on commercial lots. And certainly we're working with economic development to make additional commercial spaces available overnight.'",
        "'speaker_11': 'The city's regulatory arm doesn't reach regulating that parking rate, but certainly we can have those discussions with the parking operators.'",
        "'speaker_5': 'At.'",
        "'speaker_1': 'Least to recommend, you know, those. And I know that's always very difficult, but thank you. And to that point as well, in terms of talking, I know John Kaiser's team is working on that and talking to private lot owners, private property owners.'",
        "'speaker_1': 'I would also like us, and I think we've done this in the past. I mean, public public partnerships, you know, perhaps some of the school districts. I know sometimes it's a little bit difficult that through our joint use committee options, that could be an option.'",
        "'speaker_1': 'In some cases, they have often 200 spaces at any given time. So I think that's something to consider as well if we're not considering that already. And I'm also just interested in sort of revamping our preferential parking policies, looking more towards an overnight parking district, I think is great, especially for areas like the West Gateway, right by'",
        "'speaker_1': 'the courthouse. They have outside impacts. Most of the residents come in at night and there's like no parking. So that I think, could be very fruitful on the point of outside impacts like the courthouse. I hope that we can do a little bit more in that respect.'",
        "'speaker_1': 'Outside impacts and events. That's one thing I think we don't plan well for. I know when you go on the special events website, it says some of the events that we have in downtown, but it doesn't showcase all of the events that we have and that doesn't make a good experience for tourists coming in and looking like'",
        "'speaker_1': 'there's how do I know that there's parking for, you know, the I don't know. I'm just going to pick on myself the day of the event. Not good for them, not good for the residents coming in or the residents that are already there.'",
        "'speaker_1': 'So I just think we need to streamline that process as well in terms of events and overflow and what that looks like. And then again, outside impacts like a courthouse, like for instance, a temple on seventh, you know, that has constant flow of people every single Sunday and impacts the neighborhood that we know, that special temple that'",
        "'speaker_1': 'we love that does that. And I just think being able to be a little bit more proactive and finding solutions for these and these owners and these agencies and organizations would be great. Relative to the garages, I think.'",
        "'speaker_1': 'You know, we have a lot of that in some areas. And I'm wondering if we can cross-reference the parking enforcement data. So. We know that in some areas like in the Wilmore around like eighth and Magnolia eighth and Chestnut area, there are tons of owners who have garages that they use not for parking.'",
        "'speaker_1': 'And I know we can't necessarily enforce that, but I'm wondering, like tons of people are getting parking tickets in that area. And I don't know. I think we just I don't even have a solution right now, but maybe getting a little bit more creative on cross-referencing that data and being able to provide some relief.'",
        "'speaker_1': 'I don't even know what that looks like. I've tried to study other cities and I don't really have a good answer, but I just I really worry for those those residents. The last thing is just the consolidation of our sites.'",
        "'speaker_1': 'We have a city website with parking information, Easy Park, LP, Park, MLB.com, an app that not too many people know about. So it's like we're all it seems like we're all over the place. It'd be nice to have everything consolidated into one a bit more.'",
        "'speaker_1': 'I know. We know that. And then just lastly, I will say this. Better coordination with Long Beach Transit. You know, I'll tell you from experience in downtown. Not only is it parking impacted in certain areas of North Pine, but then language transit cut lines for seniors in North Pine at the same time.'",
        "'speaker_1': 'So it's sort of a double impact in that sense. So I would just hope we can coordinate a little bit better given these parking impacted neighborhoods. And I know we know that. I just need to see that. Other than that, thank you very much.'",
        "'speaker_1': 'I hope to work with Councilmember Pearce on many of these issues and along side many of you as well on these issues to continue the discussion. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Pryce.'",
        "'speaker_7': 'I just wanted to add, and this is a lot of these. Comments that that I'm listening to are obviously issues in Belmont Shore as well and other parking impacted areas in my district. And one of the items that we brought to council and I don't know if staff has an update on it that my team drafted was'",
        "'speaker_7': 'an item to look at whether we could streamline the process for people to remodel their garages so that they can fit modern day vehicles in their garages. And I don't remember. It was right around the time that we did the Belmont Shore parking study and we came back with a series of recommendations.'",
        "'speaker_7': 'One was we actually had public works come out and help with a resident garage cleanup day where people were cleaning out their garages. And we put huge bins throughout the district in certain areas so that people could dump large items and clean out their garages for parking.'",
        "'speaker_7': 'But I do know that we also explored the feasibility of streamlining the garage conversion process, and I don't know if staff has done any work on that. Maybe this is an opportunity for us to revive that with discussion, that this would be an opportunity.'",
        "'speaker_7': 'It's something that we have on our work program to go back and take a look at that, given the number of small garages that are in the city's housing stock inventory. Yeah, that would be great. I know our home was built in the thirties and our cars certainly could not fit in our garage today.'",
        "'speaker_7': 'So we did have to do some some minor work when we remodeled. But if we can help residents with that by streamlining that permit process, I think that would go a long way as well for folks who want to utilize their garages.'",
        "'speaker_11': 'So Councilmember, we can definitely look at the permit process, but part of that is also working with, I guess, our partners in the architectural and construction industry because for a lot of folks, a project like that can seem very intimidating.'",
        "'speaker_11': 'But the issue isn't actually the permitting process. It's finding an architect, finding a contractor so we can do a lot better on the communications front and making that easier for the property owner. And that's already on our work plan for 2019.'",
        "'speaker_7': 'That's great. It would be great if there was an architect that specialized in that and parking impacted areas and they could have some, you know, some packages available that made it worthwhile for residents to do that. So thank you.'",
        "'speaker_0': 'Thank you. Council Member Pearce.'",
        "'speaker_2': 'Sorry, I just had two more things I left off. I was wondering if there was anybody on staff that could give us an update on Mola. I know that I've pushed pretty hard and I know that they're in the middle of revisioning their.'",
        "'speaker_2': 'Their property, but.'",
        "'speaker_3': 'I think.'",
        "'speaker_1': 'Economic development.'",
        "'speaker_7': 'Will be the only person. And I don't know if John has an update on Mullah specifically. John, do.'",
        "'speaker_3': 'You?'",
        "'speaker_2': 'Wah, wah, wah, wah. Okay, let's let's.'",
        "'speaker_7': 'So it sounds like the discussions are in process.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'Thank you. And then my other question is, going back to Salinas, Councilmember Gonzalez's point, have cities ever said we're not going to ticket for red curbs in between 9 p.m. and 6 a.m. or 7 a.m.? I know. That's.'",
        "'speaker_2': 'I'm just asking. I'm not saying that I'm going full speed with it, but in parking impacted areas, we get a lot of people to park in the red.'",
        "'speaker_5': 'Councilmember Pearce, to my knowledge, know that if you look at how the code is written, it's illegal to park in a red curb area regardless of the time of day.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. There is a motion and a second. Please cast your votes.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for a Management Agreement with Long Beach Center, LLC, for the maintenance of City-owned property at 185 East 3rd Street, commonly known as Harvey Milk Promenade Park and Equality Plaza.  (District 1)": [
        "'speaker_0': 'Thank you. Consent, please. We're not going. We're not doing six on consent. But everything else on consent. Any public comment on consent signal, please cast your votes. Motion carries item six from consent. We pulled. We do that one item, please.'",
        "'speaker_5': 'Yes, Mr. Geisler.'",
        "'speaker_0': 'Well, we just I don't think we're getting a report. I think we want it pulled.'",
        "'speaker_5': 'Right. We have to, like amend that.'",
        "'speaker_1': 'Correct, John? There's an amendment on the floor.'",
        "'speaker_0': 'Okay, so let's make the amendment on the floor.'",
        "'speaker_5': 'Mm hmm. An honorable mayor and members of the city council. Yes, essentially the agreement reads as submitted, except for a single item relative to the reporting of and a quarterly calendar by our management partner. We are withdrawing that requirement as a part of the agreement.'",
        "'speaker_5': 'Otherwise, everything else as is submitted in the council letter, is still consistent.'",
        "'speaker_0': 'I think any public comment on the change of the agreement? Please catch Vice Mayor Andrews.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_0': 'No, I think she's I think she's good. Please cast your votes. Okay, we're going back up. 818, please.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all agreements necessary, and any subsequent amendments, with the Long Beach Community Foundation, a California nonprofit corporation, to establish and administer the Mayors Fund to End Homelessness;   Transfer the balance in the Mayors Fund-Homeless Trust (EX 440) to the Long Beach Community Foundation Mayors Fund to End Homelessness; and  Authorize the Health and Human Services Department to receive and expend funds from the Long Beach Community Foundation for Homeless Services Division programming.  (Citywide)": [
        "'speaker_1': 'Motion carries. Item 18 report from Health and Human Services recommendation to execute all agreements necessary with the Long Beach Community Foundation to establish and administer the Mayor's Fund to end homelessness. Transfer the balance in the Mayor's Fund. Homelessness Trust to the Long Beach Community Foundation.'",
        "'speaker_1': 'Mayor's Fund to End Homelessness and authorize Health and Human Services Department to receive and expend funds from the Long Beach Community Foundation citywide.'",
        "'speaker_0': 'Thank you. I'll just briefly I'll just just maybe I can get you a brief report in a in a nutshell, I think there's been for decades a mayor's fund for the homelessness. It's existed has not been active and probably it's been active, but it hasn't been proactive, I guess, in the last ten, 15 years or so.'",
        "'speaker_0': 'It collects maybe at any given year between 25000 to $30000 a year through the utility giving program. That's that's there. As part of the long term efforts around homelessness, there's a strong interest to activate the fund. And there has been the staff's recommendation, which I support, is to move the fund to the community foundation.'",
        "'speaker_0': 'They're willing to fundraise, manage the fund, and then maximize their work around homelessness to support that fund. And so I know it's something that that board strongly supports, and they believe they can significantly raise dollars as well as putting in their own matching dollars to work with the city on managing the fund instead of it being operated'",
        "'speaker_0': 'out of the health department. And so, Kelly Cartwright, did I miss anything on that?'",
        "'speaker_6': 'No, I think you've got it.'",
        "'speaker_0': 'Okay. There any public comment on that? Okay. Richardson, you have any comments on that? Nope. Country Ranga? No. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Okay. We're moving on to public comment.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and grant an Entertainment Permit with conditions on the application of Green Apple Event Company, Inc., dba The Loft on Pine, 230 Pine Avenue, for Entertainment With Dancing.  (District 2)": [
        "'speaker_3': 'Thank you very much. That concludes public comment. Now we're going to go back to hearing number one.'",
        "'speaker_1': 'Report from financial management recommendation received supporting documentation into the record, conclude the public hearing and grant an entertainment permit with conditions on the application of the loft on Pine, located at 230 Pine Avenue for Entertainment with Dancing District two.'",
        "'speaker_3': 'Why do I have any public comment on it?'",
        "'speaker_5': 'Thank you, Vice Mayor. The staff report will be given by Brett Jaquez and Emily Armstrong from Business Licensing. You get? I'm sorry. This one does require an oath.'",
        "'speaker_3': 'Okay. Hi.'",
        "'speaker_1': 'You and each of you solemnly state that the testimony you may give in the courts now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_2': 'Good evening, honorable mayor and.'",
        "'speaker_1': 'Members of the city council. Tonight you have before.'",
        "'speaker_2': 'You an application for entertainment with dancing for Green Apple Event Company Inc doing business as the loft on Pine located at 230 Pine Avenue, operating.'",
        "'speaker_1': 'As a hall rental in Council District two.'",
        "'speaker_2': 'This application originally came before you on October nine, 2018 and was continued to allow the applicant enough time to address all requirements of the municipal code as it pertains to the.'",
        "'speaker_1': 'Downtown dining and Entertainment District.'",
        "'speaker_2': 'The applicant has since met all requirements of the municipal code. All of the necessary departments are recommending approval subject.'",
        "'speaker_1': 'To the conditions as contained in the hearing.'",
        "'speaker_2': 'Packet. I, as well as the police department, stand ready to answer any questions council may have. And that concludes staff's report.'",
        "'speaker_3': 'Thank you. No one I public comment anyone to speak on this item. Now we'll go back to diocese council and.'",
        "'speaker_2': 'I just urge support of this item. It's a great venue. Thank you guys for tackling it.'",
        "'speaker_3': 'Thank you. So where first and second, would you please cast your vote?'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive and file the Department of Health and Human Services report on Suicide Prevention provided in a memo on October 16, 2018; direct staff to participate consistently in the LACDMH Suicide Prevention Network and its response to existing suicide prevention plans; increase the number of trainings available for Long Beach residents, businesses, and city staff; and report back annually on the progress and effectiveness of staff recommendations.": [
        "'speaker_3': 'Now we move to item 14.'",
        "'speaker_1': 'Communication from Councilmember Pearce recommendation to receive and file. The Department of Health and Human Services report on suicide prevention and direct staff to participate consistent consistently and the LA MH Suicide Prevention Network.'",
        "'speaker_3': 'It's not going to report on this.'",
        "'speaker_2': 'Like to postpone it since Kelly Colby's not available.'",
        "'speaker_3': 'Okay, fine.'",
        "'speaker_2': 'Unless she is. There she is. I would love to hear this item now. Thank you.'",
        "'speaker_3': 'The judge. Yeah.'",
        "'speaker_6': 'Good evening, honorable mayor and council members. I want to thank you for the opportunity to highlight suicide and mental health as a public health concern for the city of Long Beach. The age adjusted death rate due to suicide for the city of Long Beach during the three year period of 2014 to 2016 was 10.5 for every 100,000'",
        "'speaker_6': 'people, which runs slightly higher than we find in Los Angeles County at 7.8 deaths per 100,000. In California, overall 10.4 deaths during that same period. So populations like older adults, whites, African-Americans and the LGBTQ community and our veterans commit suicide at higher rates.'",
        "'speaker_6': 'Long Beach has services to address these to address the suicidal ideation. But the money doesn't come directly to us, and nor do we control or manage it. L.A. County Department of Mental Health is the agency responsible for providing mental health services in Long Beach and a managers and administers state and federal funds for mental health services.'",
        "'speaker_6': 'These funds don't come directly to us, but they do provide many services in the city of Long Beach. So with these funds, they're able to they co-locate mental health clinicians, which we paired with our local police department to operate six mental evaluation teams.'",
        "'speaker_6': 'These met teams respond to calls for service when a mental health concern is involved. They operate a psychiatric mobile response team, which is different from our met units. They operate the Access Center helpline, which is a 24 hour, seven day a week phone number to respond to mental health emergencies.'",
        "'speaker_6': 'And they fund outpatient mental health services at 22 different locations within the city. And they also provide a number of trainings, a through an annual conference and be through others that we can request. The Long Beach also has recently opened the Star View Behavioral Health Urgent Care Center, which is a 24 hour psychiatric, urgent care for up'",
        "'speaker_6': 'to 12 adults and six adolescents. They provide 24 hour nursing staff and mental health therapists, as well as walk in opportunities. Many of the nonprofits within the city and national organizations also offer support, such as NAMI, Long Beach, which is the National Alliance on Mental Illness, which provides education, skills, training and support related to mental illness, including'",
        "'speaker_6': 'suicide. The Trevor Project, which provides crisis intervention and suicide prevention training specific to Lgtbq youth and the National Suicide Prevention Lifeline, which is one 800 273 talk. So there are others. There is a statewide suicide prevention plan in the county.'",
        "'speaker_6': 'L.A. County also participates and has their own because the county is the primary lead agency for suicide prevention. Our recommendation has been to participate primarily with them in their work and to be able to coordinate with them as best as possible and to request different training opportunities to be able to come in and train different parties and'",
        "'speaker_6': 'folks within the city of Long Beach with that andrea report. And I'm open for questions.'",
        "'speaker_3': 'Thank you. The only public in and say. So. Yes, mysterious.'",
        "'speaker_5': 'Very good to click as the address. Suicide obviously is a very serious issue. And what I read when I read this item, I thought the last thing in the world, anybody with mental instability and contemplating what might be one two might commit suicide.'",
        "'speaker_5': 'The last thing in the world that person would want to do. Is interface with a councilperson from the second district.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'My view is certainly the most mentally unstable councilperson that this city has ever had. Based upon. I've lived here and I've been to one or two meetings. Since 1976. In fact, I even thought that maybe the best way.'",
        "'speaker_5': 'She could. So server district. Was. Give the district and the city a nice Christmas present. By sometime in the next two weeks.'",
        "'speaker_2': 'You know.'",
        "'speaker_5': 'Walking over to and start across. The bridge. To San Pedro. Stop in the middle of the Vincent Thomas Bridge.'",
        "'speaker_3': 'Mr.. Good here, please. Mr.. Good you. I think we should stay on the seven max. That's a.'",
        "'speaker_2': 'You're done.'",
        "'speaker_3': 'Yeah. We can move on from there now.'",
        "'speaker_5': 'And I realize.'",
        "'speaker_3': 'Thank you. That's all I got. That's okay. I can handle this, please. Thank you, Mr. Guru. Thank you very much.'",
        "'speaker_2': 'I would like to thank you. Yes. I want to thank Kelly for her work on this. I want to thank our health department. I really fortunate to have the county as a partner in this. When I brought this forward several months back, I would remind people that it's not only brought to my attention that Long Beach has'",
        "'speaker_2': 'a higher rate than L.A. County, but it's often with people that don't have a history of having suicidal thoughts. And these are not long planned out suicidal attempts, often as the majority of people that all of a sudden have an episode and don't know where to go for resources.'",
        "'speaker_2': 'And I say that because one of the things that I left off of this agenda item, in addition to doing trainings, is also a public face to it. And I don't want to ask for a budget to go and do a big, you know, PR stunt.'",
        "'speaker_2': 'But I would like to work with the Health Department at a citywide level with our violence prevention and whoever we think would make sense to do a public march. I know some other cities have done a Suicide Awareness Day, something that is very public so that we can engage with folks that might not have a history of'",
        "'speaker_2': 'engaging with our mental health systems. And also to remind folks that this item is really important to me since my mother did commit suicide and had several attempts to do so. And so recognizing that sometimes you don't know what might happen and might happen to somebody close to you.'",
        "'speaker_2': 'It might happen to somebody in the workplace. And as a council member in downtown, we do have the most public suicides, whether it's from buildings or bridges. And so I wanted to make sure that this time in the holidays, when we have an increased suicide rate, that we as a city are demonstrating to our constituents that we're'",
        "'speaker_2': 'here and we want to have as much resources as possible. I think partnering with the county is a smart choice instead of doing our own suicide prevention plan. And so I urge my council colleagues to support this item.'",
        "'speaker_3': 'Thank you. Thank you very much. Mr. Price.'",
        "'speaker_7': 'I think this is an excellent item and I thank Councilmember Pearce for bringing it forward. I do have a question about our Met team. Do we keep any sort of stats on the kind of work that they do, the encounters that they have?'",
        "'speaker_7': 'You know what to what data do we have about the effectiveness of the program? I've been on many ride alongs. They are a very, very effective program. I'm just curious what data tracking we do.'",
        "'speaker_5': 'Councilmember Price We do keep stats. I just don't have them with me right now. But they do do extraordinary work. Make many contacts a day and I believe saved many.'",
        "'speaker_8': 'People's lives during the.'",
        "'speaker_5': 'Course of their work.'",
        "'speaker_7': 'So. So, Chief, we might maybe have that as an item for public safety down the road. Maybe we can get kind of an update on that, and I can provide a summary for Council on that topic, because I think that's an important topic.'",
        "'speaker_5': 'Yes, ma'am.'",
        "'speaker_7': 'Thank you. I'll let you know. Thank you.'",
        "'speaker_3': 'Thank you. Constable Price. Councilman Austin.'",
        "'speaker_8': 'Thank you. I'll be very brief. I think this this item was very education of anything. And there were a few data points that that jumped out at me. And one was the fact that was in most many a good majority of these things that methods to that that individuals use to get to are in their lives are'",
        "'speaker_8': 'with firearms. And we I know had a commitment as a city a few years ago to to crack down on prohibited possessors. I think we need to continue that, because I think that that could have an impact. But the the issue of of of guns and guns being used in the wrong way, gun violence, not only does'",
        "'speaker_8': 'it contribute to suicide numbers, but it obviously contributes to our homicide numbers as well. And so I think that that's an important number and important data point to point out. And I just want to understand that this is not a new partnership.'",
        "'speaker_8': 'This is an ongoing partnership with the county of Los Angeles to correct. That is correct. Thank you.'",
        "'speaker_3': 'Yes. Councilman Pierce with.'",
        "'speaker_2': 'A yes and two, clarifying your last question. It's that we're participating partially right now, but your recommendation was to participate more fully with them. Correct?'",
        "'speaker_6': 'Yes. So we will we have identified one or two staff members who we're hoping that can attend most of the meetings when they're when their schedules allow. But we were recently at we were at the most recent meeting, and we learned a whole lot of we learned some about some curriculum and other things for the school district'",
        "'speaker_6': 'and other things. So we'll be gathering that information and posting it along the way.'",
        "'speaker_2': 'Great. Thank you for that. And then to go to your point around the gun violence, I know that we've done gun buybacks, but we might have a change policy on that. I'm not sure. Police Chief, if you could talk about some of the the tools that we've done to try to reduce the number of firearms that we'",
        "'speaker_2': 'have in our community. I remember. What was it two years ago there was a gun buyback program in North Long Beach. I think.'",
        "'speaker_8': 'It was way more than that.'",
        "'speaker_2': 'Four years ago.'",
        "'speaker_8': 'Five years ago.'",
        "'speaker_3': 'Okay.'",
        "'speaker_2': 'I remember it vaguely.'",
        "'speaker_5': 'Councilwoman Pierce, we have had a gun buyback programs in the past, at least for our city. We found that that wasn't as successful as some other things that we've been doing. Again, I don't have the stats in front of me, but I can provide them to you.'",
        "'speaker_5': 'Our officers and detectives have been doing an amazing job. Our confiscation of weapons is up by double digits this year. And as Councilman Austin commented on before, we do focus on prohibitive possessors, and that's when we're dealing with not.'",
        "'speaker_8': 'Only individuals who are suffering from mental illness, but when.'",
        "'speaker_5': 'We're dealing with, for example, threats that we get.'",
        "'speaker_8': 'To our schools when we do.'",
        "'speaker_5': 'Follow up and search warrants. So, for example, on a dispatch in the last 24 hours, we were on an incident where we seized over 35.'",
        "'speaker_8': 'Weapons from.'",
        "'speaker_5': 'Somebody who shouldn't have had them from a calling party, who was afraid that this her male counterpart was going to hurt her. So it's calls like that where we're we're very successful and our numbers are up this year.'",
        "'speaker_5': 'And as soon as I get the numbers, I can share them with all of you, as I do with the crime stats.'",
        "'speaker_2': 'Great. Thank you so much.'",
        "'speaker_5': 'You're welcome.'",
        "'speaker_3': 'Thank you very much. I'd like to say a few words on that, because the fact that I think this is a great item that you brought to the that you guys, Suzanne, has a lot of, you know, I think stigma attached to it and anything to educate our communities and employees is always welcome to our city.'",
        "'speaker_3': 'So thank you very much for bringing this item for, you know, normal community to come attend this. If not, we go for the vote.'",
        "'speaker_1': 'Councilman Austin. Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary enter into a 15-year lease-purchase agreement and related financing documents with Banc of America Public Capital Corporation, of San Francisco, CA, for the financing of the Advanced Metering Infrastructure Project for the Long Beach Water Department, in an amount not to exceed $36,000,000, including interest costs and fees.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_3': 'Item 17.'",
        "'speaker_1': 'Report from Financial Management and Water Recommendation to enter into a 15 year lease purchase agreement with Bank of America Public Capital Corporation for the Financing of the Advanced Metering Infrastructure Project for the Long Beach Water Department in an amount not to exceed 36 million citywide.'",
        "'speaker_3': 'Remaining private companies under this price. We get.'",
        "'speaker_2': 'Sorry. I know it's late, but I would love to hear from staff on this item.'",
        "'speaker_5': 'Vice Mayor, Council Members We have a staff report on this by our city treasurer David Nakamura. And also Fidel will serve in the audience to members from the water department. We have Paul Fujita and Anatole Colligan and they'll be here to answer any questions as well.'",
        "'speaker_5': 'So, David, take it away. Thank you very much, Mr. West.'",
        "'speaker_9': 'All Fidel Aguayo will be giving.'",
        "'speaker_8': 'Us.'",
        "'speaker_5': 'Our staff report tonight.'",
        "'speaker_8': 'Fidel, is this the city's debt manager?'",
        "'speaker_5': 'Honorable Mayor, Members of City Council. On November 1st, 2018, the Board of Water Commissioners authorized the financing of the Events Infrastructure Project. The A my project is a network of smart meters that allows meters to be read automatically and uploaded electronically.'",
        "'speaker_5': 'Automating the meter readers will allow the water department to increase operational efficiencies and achieve annual cost savings. City Council approval is required to execute.'",
        "'speaker_8': 'A lease purchase agreement and not to exceed $36 million.'",
        "'speaker_5': 'With Bank of America. The estimated annual lease.'",
        "'speaker_8': 'Payment will be approximately $2.4 million.'",
        "'speaker_5': 'Payable over the next 15 years. The lease payment will be payable equally from the water and sewer fund enterprise funds and will be partially offset by the elimination of the manual meter reading contract. This concludes the staff report.'",
        "'speaker_5': 'Staff and members from the Water Department are available for questions.'",
        "'speaker_0': 'Thank you. If any public comment on this item? Seeing none. There's a motion concern, Ringo. Consumer price cap. Please cast your votes.'",
        "'speaker_5': 'Vice mayor. Yes.'"
    ],
    "Recommendation to adopt Plans and Specifications No. RFP PW18-058 for design-build services for a public safety parking structure; award a contract to W.M. Klorman Construction Corporation, of Woodland Hills, CA, in the amount of $9,279,400, with a 10 percent contingency in the amount of $927,940, for a total contract amount not to exceed $10,207,340; and, authorize City Manager, or designee, to execute all documents necessary to enter into the contract, including any necessary amendments;   Authorize Public Works Department to initiate the realignment of the public safety fueling facility and the preliminary design for a new fleet maintenance facility, previously housed in the Lincoln Garage, in an amount not to exceed $500,000;   Express intent to issue a bond to finance up to $13,300,000 for the costs associated with the construction of a public safety parking structure including project management, relocation of the fuel station, preliminary design of a police fleet maintenance facility, and costs associated with issuing a bond; and, authorize City Manager, or designee, to ex": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': '23.'",
        "'speaker_1': 'Report from Public Works, Financial Management and Police Department Recommendation to award a contract to W.M. Clurman Construction Corp. for Design. Build Services for a public safety parking structure for a total contract amount not to exceed 10,207,340 authorized public works department to initiate the realignment of the Public Safety Fueling Facility and the preliminary design for a new fleet'",
        "'speaker_1': 'maintenance facility. An express intent to issue a bond to finance up to 13,300,000 for the cost associated with the construction of a public safety parking structure.'",
        "'speaker_0': 'District two Any public comment on this? Please come forward.'",
        "'speaker_8': 'Dave Shukla on.'",
        "'speaker_9': 'File in.'",
        "'speaker_8': 'The staff report pdf with the item.'",
        "'speaker_9': 'There's no mention of meeting the zero net energy.'",
        "'speaker_8': 'Requirements for building.'",
        "'speaker_9': 'Construction or for.'",
        "'speaker_8': 'Putting battery storage.'",
        "'speaker_9': 'Or doing any of the other fun things that you can do with a parking grid, a parking structure like a microgrid. It would be encouraging.'",
        "'speaker_8': 'To see opportunities like this not go to waste. Thank you.'",
        "'speaker_0': 'Thank you. There's a motion in the second. Please cast your votes.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending and restating Chapter 14.14, and by adding Chapter 14.15; all relating to sidewalk dining and parklets within the City's right-of-way, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you, Adam.'",
        "'speaker_1': '24 Communication from City Attorney Recommendation of Declare Ordinance Amending the Long Beach Municipal Code all relating to sidewalk dining and parklets within the city's right of way. Read for the first time in lead over the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_0': 'Any public comment on this item? CNN. Is there a question come from Boston?'",
        "'speaker_8': 'Yes, just a question really quick for staff, our public works director.'",
        "'speaker_0': 'Mr. Beck.'",
        "'speaker_8': 'I wanted to just make sure the delay maybe for the city attorney, the language regarding the 10% parking is actually in the ordinance.'",
        "'speaker_5': 'I didn't see it. I have. I do not have it right in front of me, but I believe it is in there and we will make sure it is in there or I will bring it back.'",
        "'speaker_8': 'Okay. Thank you.'",
        "'speaker_0': 'Okay. There is a motion in a second saying no public comment on this, so please cast your votes.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Sections 8.68.020, 8.68.060, 8.68.065, 8.68.075, 8.68.090 and Subsection 8.68.110.A; all relating to smoking in public places, read and adopted as read.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': '25 please.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to declare ordinance amending the Long Beach Municipal Code all relating to smoking in public places. Read for the first time and laid over to the next regular meeting of the City Council for Final Reading Citywide.'",
        "'speaker_0': 'Any public comment on this item? There's a motion and a second. Please come forward if you have public comment for this item.'",
        "'speaker_5': 'Good evening. Bill Balding, a resident of five. District five. I'm here to talk in favor. Speak in favor of smoke free outdoor dining and shook in Long Beach. I'd like to see that ordinance passed without any amendments or restrictions, no time limits or exemptions.'",
        "'speaker_5': 'And I'd like to tell you why I think that's very important. So, first of all, residents of Long Beach overwhelmingly support smoke free outdoor dining. 85% of our population is nonsmokers, and the other 15% like to try to quit if they could find out a method that is effective.'",
        "'speaker_5': 'The up and down the coast of California, cities like Los Angeles, Huntington Beach, Redondo, Laguna Beach have gone smoke free. Their dining patios are completely free of smoke, and the residents support those measures entirely. Residents of Long Beach do the same here.'",
        "'speaker_5': 'They'd like to see smoke free outdoor dining. The second point is that we have a health equity issue here. 70% of office workers like myself and like you are protected by smoke free. Air ordinances don't have to deal with tobacco in the workplace.'",
        "'speaker_5': 'But if you're a low paid service worker working in a restaurant, you're forced to breathe in. To a second hand smoke on a daily basis, greatly affecting your health. Third, I'd like to address very quickly the notion that somehow there's a negative economic impact with smoking restrictions.'",
        "'speaker_5': 'That's absolutely opposite of the truth. The truth is, every time smoking restrictions are put in place, business improves. We know that. You know that because you've gone through that fight here in the seventies and Long Beach when you made bars and restaurants smoke free, I ask you to continue the work that you began then and put Long'",
        "'speaker_5': 'Beach back in the progressive column in bringing smoke free outdoor dining throughout the city. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please. Please come forward.'",
        "'speaker_1': 'Hi. Good evening, Mayor and council members. My name is Amanda Staples and with the American Heart Association. And I've reached out to a number of the officers regarding. Just wanted to touch base and introduce myself. However, what we are looking at this piece of legislation very closely and as is I mean we are in support of is'",
        "'speaker_1': 'smoke free dining here in Long Beach. With the considerations made, we feel that the policy as is has been introduced here would not address that issue. So we feel as a mission, as our mission is, to ensure folks have longer, healthier lives, that this will be a determinant to that.'",
        "'speaker_1': 'Smoking is deadly not only to the smokers, but with regards to secondhand smoke. And so we want to just ensure that Long Beach is right there lung protecting those folks that work there and want to enjoy here in Long Beach.'",
        "'speaker_1': 'I understand that this city is a very tourist and engages in welcoming so many new folks. But I do ask that this legislation be look like be looked at to not only those that visit and come here to play, but those that live and work here.'",
        "'speaker_1': 'So we ask that that the considerations, considerations be removed, the amendments made be reconsidered, and we hope to continue working with the offices here. So thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Yes.'",
        "'speaker_9': 'I'm here as one of the co-founders of the Long Beach Farm and Alliance.'",
        "'speaker_5': 'And since our city is based on this new design.'",
        "'speaker_9': 'Of putting retail at the bottom and apartments on top of our a lot of our new apartments in a lot of these retails are.'",
        "'speaker_5': 'Going to help restaurants with outside dining.'",
        "'speaker_9': 'Which means the smoke would go up upstairs to the apartments. We've seen the commercials every day on TV where they show people smoking down below and the smokes, traveling into people's apartments with children and so on. And this was going to happen to everyday life.'",
        "'speaker_9': 'We need to have.'",
        "'speaker_5': '100% smoke free dining so people can bring their families, their children. And we're known for being a.'",
        "'speaker_9': 'Dog friendly city. And it shows now that our dogs are now getting cancer, too, from secondhand smoke. And we do a beach cleanup every four Sunday of the month and we pick up cigaret butts and we're.'",
        "'speaker_5': 'Losing the battle. We're seeing more cigaret butts on the beach and so on. And some of these cigaret butts will come from the dining.'",
        "'speaker_9': 'Area where people will be smoking if you let it stay in place. And one of the thing that came up was about the special permits, because children are not out after 1030. Well, Long Beach does not enforce its curfew laws.'",
        "'speaker_9': 'I hang out.'",
        "'speaker_5': 'In the Pike Shoreline.'",
        "'speaker_9': 'Village and down in Belmont Shores. I see.'",
        "'speaker_5': 'Children out every time on the weekends past.'",
        "'speaker_9': 'Midnight, coming from the movies.'",
        "'speaker_5': 'Coming from special events that family events have. We have.'",
        "'speaker_9': 'Down in the downtown area a lot of.'",
        "'speaker_5': 'Events going on. Some of the events are like.'",
        "'speaker_9': 'Gymnastics for youth. And these people come and spend the whole weekend doing these engagements and they're out about hanging out until past midnight. So the idea that having special permits where people can smoke after a certain time, it would not work because children are out during these times.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Our last speaker.'",
        "'speaker_4': 'Thank you, Mayor Garcia. It's been a long evening, hasn't it? My name is Melinda Cotton and I live in Belmont Shore. I've worked with the Health Department and the Coalition for a smoke free Long Beach for many years.'",
        "'speaker_4': 'And we thank the Council for bringing forward the outdoor dining ban on smokers dining smoking in the dining areas. I and my friends are very excited about it because Belmont Shore has a lot of children walking along the street and to have smoking in the patios would certainly drift over toward the children and toward them.'",
        "'speaker_4': 'The problem I think with this is, is it was done late at night without a lot of consultation with the health department and the the Coalition for a smoke free Long Beach. And there's two exemptions that are concerning the one allowing smoking in dining areas after 11.'",
        "'speaker_4': 'There's still children on the street there, young people still the smoke still travels. And as we've heard, we have many multi-use buildings now that have retail and restaurants on the first floor and homes above. And the people above 11:00 are had their windows open.'",
        "'speaker_4': 'They're trying to sleep and there will be smoke coming in from them. And then there's the workers themselves, service workers who will be affected by the smoke. And then, I don't quite understand, to allow a site, a restaurant, to have two, ten day periods a year when they can allow smoking in the outdoor area, just open again'",
        "'speaker_4': ', the restaurant and the public to smoking. And this is during the daytime hours. There's no limits on it. So we would certainly ask you to reconsider those two exemptions. If you talk to the health department, the tobacco education program, which does a great job and we'd all like to participate in and to try to improve that because'",
        "'speaker_4': 'as I say, people are really excited to have smoke free outdoor dining. Thank you very much.'",
        "'speaker_0': 'Thank you. That concludes public comment. Councilwoman Price.'",
        "'speaker_7': 'Thank you. I'm asking my council colleagues to support this item. This is an item that we've actually been working on for a few years. We have consulted with the health department. In fact, we postponed the item to tonight to ensure that they would be present in order to assist or answer any questions.'",
        "'speaker_7': 'There are some limited restrictions that applied to a very, very small number of facilities within the city. And those facilities include facilities that we have a lot of in the downtown area. So we did a lot of outreach with business owners as well, and they're really restricted on the time in order to reduce exposure to the children'",
        "'speaker_7': 'and youth, which for me was the reason that I initiated drafting this item and doing outreach on it a few years ago. So we think that the restrictions are limited in scope to address some of the concerns that were raised by some of our business entities in researching other cities and how they've done it.'",
        "'speaker_7': 'The smoking ban has been expanded over time in many cities. And so I think one thing that we can do as a city is maybe reevaluate in a year and see if there's an interest on council to expand this to include to to remove any and all exemptions.'",
        "'speaker_7': 'But I will say that the exemptions as outlined below are extremely limited in scope, affect very few establishments where the primary service is not food service and they do allow for special events permits to be obtained at the discretion of city staff and in regards to exemptions that would apply to this for a limited period of time'",
        "'speaker_7': '. So I believe that this is an effort for a city of our size to be able to strike a balance and initiate some policy that is very positive and forward thinking and protects our residents from secondhand smoke and our visitors as well.'",
        "'speaker_7': 'And certainly I think this is something we can reevaluate in a year to see if we want to expand it further. But I think, again, we're talking about a very nominal, a negligible number of businesses that would even qualify within the exemptions that are listed here.'",
        "'speaker_7': 'So thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor. Councilman Austin.'",
        "'speaker_8': 'Hello. I just wanted to get some some clarification. And just in terms of intent, because I know that there are and I think you you alluded to it. Councilmember Price businesses that that that are tobacco related with this particular item prohibit them from smoking on their patios.'",
        "'speaker_7': 'You know, we've received some questions about that with cigar lounges in particular. I don't believe this word, but I'll defer to the city attorney on that as that is something we talked about when the item was first brought forth.'",
        "'speaker_5': 'I'm not sure I got the whole question on cigar lounges. And does this apply to cigar lounges? Yes, it would.'",
        "'speaker_8': 'So. So cigar lounges would not long be no longer be able to smoke on their patios.'",
        "'speaker_5': 'Yeah. I think it if it's smoking.'",
        "'speaker_8': 'Because if the intent is outdoor dining.'",
        "'speaker_5': 'I think if the I'm sorry, if the if the, if it doesn't meet the definition of eating establishment, then it wouldn't apply, right? So then the answer is no. If it's the cigar lounge. I'm getting confused with the cigar lounge.'",
        "'speaker_5': 'We we have a lot of issues going on with the scar lounges and alcohol and whether alcohol is served or not. But I believe the answer is this does not. Could could we have Laura Turnbull or Kelly Collopy just answer that definitively?'",
        "'speaker_4': 'No the ordinances for smoke free dining.'",
        "'speaker_2': 'And so it does not apply to cigar lounges that do not serve food or alcohol.'",
        "'speaker_8': 'At this point, yes. Understood. Thank you for the clarification.'",
        "'speaker_0': 'Thank you. There's a motion in a second. I believe we did public comment on this, so please cast your votes.'"
    ]
}