{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, find that the area to be vacated is not needed for present or prospective public use; adopt resolution ordering the vacation of the portion of Roble Way between Solana Court and Pacific Avenue and a portion of the east side of Pacific Avenue between 3rd Street and 4th Street, upon execution of an agreement with Ensemble Real Estate Investments, LLC, a California limited liability company (Applicant), memorializing the conditions imposed on the right-of-way vacation; and   Authorize City Manager, or designee, to execute an agreement with Applicant, memorializing the conditions imposed on the right-of-way vacation.  (District 1)": [
        "'speaker_1': 'Item 16 report from. I'm sorry. Or from public works recommendation to receive supporting documentation into the record concluded the public hearing find that the area to be vacated is not needed for present or prospective public use and adopt a resolution ordering the vacation of the portion of roadway way between Solana Court and Pacific Avenue, District one.'",
        "'speaker_2': 'Hey. I heard of theft.'",
        "'speaker_0': 'Good evening, Mayor and Council. I'd like to introduce Eric Lopez, the director of Public Works will make the staff presentation for this item.'",
        "'speaker_3': 'Thank you, Linda. Mayor and members of the city council. This is a standard item for us. We are recommending a vacation of the portion of Robles Highway between Salina Court and Pacific Avenue and a portion of the east side of Pacific Avenue between Third Street and Fourth Street.'",
        "'speaker_3': 'This is associated with one of our private developments. We can go into details you may have on that development. On the call. We have Joshua Hickman, who's our project management officer, that also assist with private developments that impact the public right away.'",
        "'speaker_3': 'And we can answer any questions you may have.'",
        "'speaker_2': 'Thank you. I have no public comment on the hearing. I mean, you have over two council members and they have.'",
        "'speaker_0': 'I just wanted to mention this item and supportive of this item. Thank you.'",
        "'speaker_2': 'Can I get a second, please? Can I get a second on the Q system? Okay. I have a second by Councilman Austin. Roll call vote.'",
        "'speaker_1': 'District one. I District two. I. District three.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five. I District six.'",
        "'speaker_2': 'Yes, I do.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $12,000, offset by the Fifth Council District One-time District Priority Funds transferred from the Citywide Activities Department to provide donations to Lakewood Village Little League at $6,000, to Partners of Parks at $3,000, and to Junior League of Long Beach at $3,000 for various community projects; and  Decrease appropriations in the General Fund Group in the Citywide Activities Department by $12,000 to offset a transfer to the City Manager Department.": [
        "'speaker_2': 'Thank you. QUESTION Karis, we're going to here. Let's do items 18 and 19 briefly. Those are some district funds transfers. Item 18, please.'",
        "'speaker_1': 'Communication from Council on the Mango recommendation to increase appropriations in the General Fund group in the City Manager department by $12,000 to provide donations to Lakewood Village, Little League Partners of Parks and Junior League of Long Beach for various community projects.'",
        "'speaker_2': 'I have a motion by Sir Mungo, a second by Councilman Ashton. I have no public comment. Councilman Mongo, anything.'",
        "'speaker_0': 'I just really appreciate these organizations for stepping up and taking the lead on some needed community work that needed to get done. And this small token from us to contribute to their outcomes is something that I know the community will find meaningful.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Austin is on the second. Let's go to a roll call vote.'",
        "'speaker_1': 'District one. A district to. I'm District three.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five. I District six.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'All right.'"
    ],
    "Recommendation to increase appropriations in the General Fund Group in the Parks, Recreation and Marine Department in the amount of $2,250, offset by the Fourth Council District One-time District Priority Funds transferred from the General Fund Group in the Citywide Activities Department to purchase a new storage container for Stearns Champions Park; and  Decrease appropriations in the General Fund Group in the Citywide Activities Department by $2,250 to offset a transfer to the Parks, Recreation and Marine Department.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Thank you. And item 19, please.'",
        "'speaker_1': 'Communication from Councilman Super Not recommendation to increase appropriations in the General Fund Group and the Parks Recreation and Marine Department in the amount of $2,250 to purchase a new storage container for Stern's Champions Park.'",
        "'speaker_2': 'Thank you. There's a motion by Councilmember Superdog. A second vote. Councilwoman Price, there's no public comment, controversial or not. Thank you. Appreciate your appreciate your support for supporting Long Beach. Lovely. Okay. Councilman Price, anything on the second gear?'",
        "'speaker_2': 'Okay, we'll call the police.'",
        "'speaker_1': 'District one.'",
        "'speaker_0': 'I'm.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'I, i.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District five. By District six. By District seven. I. District eight. All right. District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to request City Attorney to draft a Council resolution in support of the universal basic income initiative established by the Mayors for a Guaranteed Income, as well as federal and state efforts to support residents disadvantaged by the COVID-19 pandemic;   Request City Manager to seek grants and private foundation support to fund the pilot and to bring back specific grant approval to City Council; and   Report back to the City Council on progress of pilot development.": [
        "'speaker_2': 'Thank you. Item 17, please.'",
        "'speaker_1': 'Communication for Mayor Garcia. Recommendation to request city attorney to draft a resolution in support of the Universal Basic Income Initiative established by the Mayors for a Guaranteed Income.'",
        "'speaker_2': 'Thank you to the clerk. I just want to thank the the council for entertaining this and having a conversation about what I think is a really exciting conversation about the future of the way the economy is going to work in this country and really around the world.'",
        "'speaker_2': 'I think all of us understand that income inequality is the single biggest challenge when it comes to working people's livelihoods. That that that we have the very wealthy at the very top continue to get we know and accumulate wealth while it's much more difficult for those that are struggling and to get by to really accumulate any wealth'",
        "'speaker_2': 'and income inequality, a challenge becomes larger every year and we see that through studies that are happening all across the country. We'll also note that what we're what we're trying to propose is we want to support what is really a pilot project.'",
        "'speaker_2': 'We think I certainly agree that the concept of guaranteed income or universal basic income has a lot of names, for it is a viable concept that cities are going to have to lead on in the future. There is a coalition of cities of which Long Beach, as mayor I've been involved with, which is a group called Mayors'",
        "'speaker_2': 'for a Guaranteed Income. It's about 15 cities of which there are foundations and private organizations that want to support this group to fund pilot programs in their cities. We there are obviously folks that have been huge champions for guaranteed income.'",
        "'speaker_2': 'You have entrepreneurs like Andrew Yang and then mayors like Michael Tubbs in Stockton who actually kind of pioneered a guaranteed income pilot in his city over the course of the last few years. And so the request is is is really three parts.'",
        "'speaker_2': 'The first is just to have the council draft the resolution to support this pilot program that we are setting out to do in the Mayors for a Guaranteed Income group, as well as through federal and state efforts. And we are right now, to be quite frank, with the council and our rental assistance program that is a form'",
        "'speaker_2': 'of guaranteed income. $3 a month at $1,000 is a form of guaranteed income. We're already, in a way, piloting a type of a program. And so this would set that as far as a resolution to to show interest.'",
        "'speaker_2': 'The second thing this would do would be request the city manager to begin seeking and accepting private foundation grants. And nonprofits. And that all grants would have to come back to the City Council for approval and discussion because there is enormous interest and in guaranteed income across the country.'",
        "'speaker_2': 'And as an example, you know, the founder of Twitter, we're all we all are familiar with Jack, and he is already stepped up to fund the initial cities and wants to do some of that work. And there's a lot of other folks that are interested in funding this, these pilots.'",
        "'speaker_2': 'And then, of course, the last piece of it is to ensure that any development of the pilot gets approved by the council and all of this would come back. This is a new, very new economic shift that that is being piloted.'",
        "'speaker_2': 'We understand that there's a lot of a lot of questions, as there should be there should be a lot of discussion about how these programs can work. But we believe that a pilot program is the best way to really discover for the country, and this is a way that we can move forward.'",
        "'speaker_2': 'And again, the city and the council will have an opportunity to mold the pilot after staff looks at kind of what the best approaches are. And the idea is for the different cities to pilot different types of guaranteed income programs.'",
        "'speaker_2': 'And again, our rental assistance program could be an example of one type of of guaranteed income program. But there's obviously a lot more. And so I think it's an exciting opportunity for us. The last thing I will say is, for me, the COVID pandemic has highlighted more than ever why it's necessary to explore these types of direct'",
        "'speaker_2': 'support for people. The future with automation in front of us, with other crises ahead of us, like climate change, are going to disrupt the economy. And Long Beach has always led the way with innovative solutions. And so I am excited to pilot this and to work really with the private sector to bring in that money.'",
        "'speaker_2': 'So the idea isn't that the city would be funding the pilot. It's really going to be a private foundation and not private sector work. We would be managing through staff time, of course, the pilot, but the funding itself would be coming from other sources.'",
        "'speaker_2': 'And so I'm happy to answer any questions or to hear comments from the council, have a motion here by Councilmember Richardson in a second by Councilmember Pearce. So let me just go down the line. Councilmember Richardson. Thanks, Mr. Mayor.'",
        "'speaker_2': 'So I'm supportive of the concept. I you know, I've paid attention to the basic income and basic needs for a while now. I think the concept fits well with a lot of the conversation and study that we've done the last few years around economic inclusion and addressing barriers.'",
        "'speaker_2': 'I'm glad to know that you're exploring private, private funds. I don't know that public dollars for the pilot are what we should utilize, but I think it has a lot of synergy with the things we're already doing, which you mentioned the direct support for rental assistance, which was federal dollars, and that made a lot of sense.'",
        "'speaker_2': 'I've said it before. The role of local government has expanded well beyond our traditional services. And so it's it's important that we do make a meaningful commitment to go along with these changes and and sort of help create a front door for a lot of these needs where we're doing this today.'",
        "'speaker_2': 'As always, the many basic needs of housing. You know, we are putting a front door on it. We are we have more shelter capacity. We have ever had a hunger. We made a meaningful commitment to hunger and basic needs through the CARES Act funding.'",
        "'speaker_2': 'And that is a form of basic needs. And basic income aligns with food, housing, hunger, food, housing and basic income. And so we actually have a basic needs pilot in Long Beach, a lobby city college in Cal State, Long Beach, already UCLA, UC Berkeley, UC San Francisco has a National League of Cities has outlined a number of'",
        "'speaker_2': 'cities are exploring this. You mentioned Stockton, but also Chicago and New York. Jackson, Mississippi, Santa monica, California, Omaha, Nebraska, Twin Cities in California. So I think we know enough about this, too, to express our support. I'm going to support this practice in my Committee of Economic Development, and I'm thinking about this in a way that it aligns'",
        "'speaker_2': 'with a lot of the commitments the council and the public has already made in terms of economic inclusion and overcoming barriers. So this has my support. Councilmember Councilmember Pearce.'",
        "'speaker_0': 'All thanks. I really want to thank you. Working on this matter and bring it to the council for a discussion. You know, in the middle of COVID, I think one of the conversations. Councilmember Mondaire to need to mute again.'",
        "'speaker_0': 'Thank you. One of the conversations that we had in the middle of COVID was really the opportunity for us to shift a system. As you mentioned, Mayor, we have poverty that existed before COVID. I know in Long Beach, in between different census tracts, there is a 17 year life expectancy difference just in the city of Long Beach'",
        "'speaker_0': '. And we know that poverty directly impacts life expectancy. We also know that while our system, as it's set up today in our health care system as well, often could be in a position to really benefit from poverty, where cities have a lot to lose from that.'",
        "'speaker_0': 'And so I think being able to have a universal basic income is something that doesn't just benefit that person that's receiving it. It benefits the entire system. When people are living in a city and they I think it's that every dollar that they make additional an hour, it equals something like $7 back in the community.'",
        "'speaker_0': 'On a multiplier effect. And so what we've seen happen with our small businesses here in the city of Long Beach is that it's been really tough because of the beginning of COVID. A lot of people weren't working, and we still have some people working, but there are a lot of people that are receiving eviction notices, whether they're'",
        "'speaker_0': 'legal or not. A lot of people that are struggling to try to stay on, you know, the income that they get from unemployment, even though that number is reduced a significant amount. And so being able to say that we need to have a basic income not only during a moment of crisis, but if we can have a'",
        "'speaker_0': 'model, a pilot program that we can really test out and see if it's successful, then I think the entire system gets a chance to be overhauled. And we can make sure that small businesses and big businesses that are focused on improving quality of life and supporting community members can see a big shift.'",
        "'speaker_0': 'And so I wholeheartedly support this initiative. I think that it's great that we've got foundations that are paying attention. You know, my life before council was in that world and obviously foundations really a little bit of their money can go a long way.'",
        "'speaker_0': 'But a lot of that resources, when given to a city like ours, we've been able to really shift programs. I think one which has a great track record of that. So I love the idea of starting with foundations, but I also think that we as a city have to look at the cost of poverty, how many sick'",
        "'speaker_0': 'days affects our community. I was doing some research today and found that data shows that one week of someone that's living on a minimum wage job means that they can't pay their rent that month. And so we don't even have a system where people can afford to be sick without the chance of being evicted, particularly if we'",
        "'speaker_0': 'don't have protections for them. And so everybody from the landlords, the property owners to the local city, that is spending a lot of resources on making sure that we're housing those that are already unhoused. So spending our money on this level makes sense for the entire system.'",
        "'speaker_0': 'So I just want to say wholehearted support. I look forward to seeing how this shapes up and I hope that the Council is in full support in so much.'",
        "'speaker_2': 'Like councilmember customers and they have.'",
        "'speaker_0': 'Thank you, Mayor. I just wanted to say, again, echoing the comments of my colleagues, that I'm really excited to see this conversation coming up. I think that, you know, even before this pandemic, there was a lot of insecurity when it comes to income.'",
        "'speaker_0': 'So I'm really excited to see what is going to come from this. And I really applaud you for taking the step forward and thinking, you know, in the future what our citizens and residents hear from from the city of Long Beach could possibly.'",
        "'speaker_0': 'Could possibly get from that and from this such a program. So I'm really, really excited and very supportive of this. Thank you for bringing it up.'",
        "'speaker_2': 'Thank you, Councilman Price.'",
        "'speaker_0': 'You, Mr. Mayor. So I this this is an item that I don't personally have a lot of background or education on. I am completely mindful that our mayor is involved in discussions with mayors around the country and paying very close attention to urban planning and urban economic trends and things that our city should and will take advantage'",
        "'speaker_0': 'of in terms of at least exploring ideas. And I'm very grateful to our Mayor for for doing that and being engaged and active in those conversations with other mayors, because I think we've had a lot of great ideas come to the forefront that those of us who are really dedicated locally to our districts may not be aware'",
        "'speaker_0': 'of or may not be following the trends on. So this is one of those items. So I'm looking forward to studying it and looking at the data. Our office did receive a number of emails, really expressing concern, perhaps a lot of confusion, just not really understanding the topic.'",
        "'speaker_0': 'So I'm hopeful that when this item does come back, there's a lot more depth in terms of what the possibilities are, how the data will be tracked, and how we can all learn to engage thoughtfully on this topic.'",
        "'speaker_0': 'Because I think for me, at least, I'll speak for myself. I don't have a background on this topic and it's really going to be an educational opportunity for me. So I'm happy to support this item. I just want to confirm, I guess I don't know if it would be with the mayor or with the staff.'",
        "'speaker_0': 'That really no public dollars are being sought at this time to study this and explore the feasibility that this is something that we're going to be really working to identify private dollars, to study and collect data that will hopefully shape future policy.'",
        "'speaker_2': 'Yeah. This is a mayor. That's that's absolutely right. I mean, the only, you know, public dollars that would that would be currently spent would be staff, you know, staff time interacting with the foundations or the grants. But we already have interest from from these private foundations and grants.'",
        "'speaker_2': 'So it would not be city dollars that would be spent in the pilot. As far as the the income piece of what we what would be given out to folks as part of the pilot? That's right.'",
        "'speaker_0': 'That's great. And that's a good clarification that I committed to the people who reach out to my office that I would make this evening. The other request that I would have is once we get a little bit further along on this, I think it would be worthwhile to do some citywide community discussions, to have the experts in'",
        "'speaker_0': 'this area educate the residents. Because if if we're really going down a path of this is a policy that the city wants to support, then I definitely want to make sure that residents are engaged and educated on the topic.'",
        "'speaker_0': 'So I'm hopeful that we can weave into this some sort of community dialog that will allow for this and education on what the pros and the cons are and what the data shows. So with that, thank you.'",
        "'speaker_2': 'Executive Vice Mayor Andrew Lunch man. Thank you. There was a time, but this form of leadership is now because I am supportive of this idea, because right now low income communities like mine are struggling in ways and levels we have never, ever seen before.'",
        "'speaker_2': 'You know, and people are hurting for rent, dollars, food, diapers, you know, an income as well as a home. And we able to come up with a system to help with this rental assistance. So we have a will.'",
        "'speaker_2': 'There will be a way. And I think this is an excellent one of leadership on your part. I want to thank you very much, and I'm totally supportive of this item. Thank you very much. Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you. I was trying to do some research online in response to some of the questions that I had and then some of the questions that have come into our office. I know that each city that has gotten chosen has had different models for how individuals are selected to participate in the program.'",
        "'speaker_0': 'I was wondering about your vision, Mayor, on if there were any other cities that you thought we would be modeling after or if Long Beach would stand on its own and maybe do a hybrid model, or what your thoughts were on how that looks and what our target is in terms of length of program number of participants'",
        "'speaker_2': '. Yeah. I think those are good questions. I think that, you know, I really don't have a set, um, you know, kind of idea of what it should be. I really want to kind of it's scored through staff and some, and some conversations.'",
        "'speaker_2': 'What, what the best model would be for us. I think it'd be great. I think the idea of the pilots are that they all be different and so that folks can can model different pilots that could be tailor made to certain communities.'",
        "'speaker_2': 'And so I'm actually very open and not married to any. And any type of program. I think I'd want staff to hear from all of you and from the community and and come up with something that could really, really work.'",
        "'speaker_2': 'Obviously, I think over the course of the next six months or so, there's going to be a lot of foundation interests and we'll be going out and raising some capital. So we have time. There's going to be some some time to actually put these things together.'",
        "'speaker_2': 'We want to put something that's fair and that's innovative and then see how they work. And I think that's the that's the idea. They're not all going to you know, some will work better than others and we'll learn from them.'",
        "'speaker_2': 'So I'm very open to, however put point to it.'",
        "'speaker_0': 'Well, I would just recommend that we have a lot of data related to our our AI team and the work that they did related to certain individuals that are multi issue callers related to our health care system in terms of our fire.'",
        "'speaker_0': '911 services and our social work services and other things. And I would look for us to use some of the data that we have that other cities have not had access to in that. I mean, then I guess my my question next for city manager is you talked about staff time.'",
        "'speaker_0': 'What kind of staff time commitment are we looking at to commit to bringing back some information to the council and in searching for these grants?'",
        "'speaker_3': 'This is Tom. So we do think this will require some work. One of the things that the mayor has in his recommendations is $100,000 to help fund consultant time or temporary staff to both look at this and public banking, which would give us some dedicated resources to do that.'",
        "'speaker_3': 'So I think we're at the kind of concept phase of this, and we would be coming back with how much dedicated we would need. And then we would, of course, be looking for the administration to, when we go to the grants and the others on how to have a dedicated person if we do are successful getting money'",
        "'speaker_3': ', how do we fund that position so that there wouldn't be a city cost to that?'",
        "'speaker_0': 'Excellent. I was then, you know, I was really supportive of the public banking idea when I brought forward the one card item. I'm supportive of linking these two together. I think there's a lot of synergy in that. A lot of the initiatives that we did as a chair of economic development have kind of been souped up into'",
        "'speaker_0': 'some of the other citywide plans and acronyms that we have. And I see how it can all fit together, and I look forward to seeing that reported back on what the total cost would be. And then you didn't mention staff time of our staff to potentially work with a consultant and or apply for grants.'",
        "'speaker_0': 'Are you thinking in the dozens of hours or in the dozens of dozens of hours?'",
        "'speaker_3': 'I think it all depends on how successful we are. We need to first kind of research the concept and make sure we really understand it. And then a lot of this is going to be going out and talking to the various foundations.'",
        "'speaker_3': 'I think we've got some good support already. The mayor and his working group already has made a lot of connections, and now it's more estimated that. So to give you a number, it's, it's, yeah, it's not going to be insignificant.'",
        "'speaker_3': 'I'd probably be in the moderate staff time area.'",
        "'speaker_0': 'Great. Well, I appreciate your information on that. I, like some of my colleagues, would like to explore a pilot, but being cognizant that we are using taxpayer funds at a time when we are working on so many things.'",
        "'speaker_0': 'So I appreciate bringing back a plan for getting those grant dollars, and I think that that could be very valuable. Thank you.'",
        "'speaker_2': 'If it comes, a woman doesn't ask him. I thank you, Mr. Mayor. And I'd like to also lend my support. Offer my support. You know, when this concept was first talked about a few years ago, two, three years ago, it sounded very far fetched and difficult to imagine.'",
        "'speaker_2': 'And then 2020 hit. And now it makes a lot of sense. I want to thank Mr. Mayor Garcia for mentioning the our commitment already to the Long Beach Cares program that actually provides thousand dollars per month for three months rental assistance for families in Long Beach.'",
        "'speaker_2': 'And that's that was a real commitment from our city that I, like I said, a year ago, would have been far fetched to imagine. But tough times come and in these these very unique times call for innovative solutions.'",
        "'speaker_2': 'And so we've already stepped up and done that. I do appreciate that this is a pilot program. I expect that the $100,000 that we are committing will be a one time expenditure right now. And staff can can, I think, clarify that already, Tom.'",
        "'speaker_2': 'And if I'm wrong, please let me know. But I expect it to be a one time. And it's really a minimal commitment at this time to study something that could be a great benefit to many residents in our in our city, particularly if we are able to find the private philanthropy.'",
        "'speaker_2': 'I don't obviously the condition of our budget today, public resources are going to be a stretch today to look at that. But but I'm sure it's something that we can build in in the future. But I like the idea of private philanthropy.'",
        "'speaker_2': 'I like the idea of us studying innovative ways to support our residents. And so I'll be supporting the item. Thank you. Thank you. Thank you. I want to follow up on the point that Councilman Price made about community outreach.'",
        "'speaker_2': 'Our office has received the same type of questions. So I would be hopeful that staff could maybe put together some type of overview or a supplement to the agenda item that explains a little bit about what the process is and where we're going with this.'",
        "'speaker_2': 'Prior to that community outreach, that would be very helpful upfront. Thanks. Because I remember Councilmember Pearce.'",
        "'speaker_0': 'Oh, sorry about that. Yeah, I'll just say briefly, I think that the new state law that just passed also on some of the tenant issues identified some additional funds that could be used to pay for background that's similar to universal basic income.'",
        "'speaker_0': 'So I think there's lots of things not only at the local level but at the state level moving in this direction that again, not only benefit tenants but also property owners. And so I do look forward to seeing some of that data come back.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_2': 'Thank you. And with that, we will go ahead and do a roll call vote. I don't have any public comment.'",
        "'speaker_1': 'No public comment. District one.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'I am.'",
        "'speaker_1': 'District.'",
        "'speaker_0': 'Three I.'",
        "'speaker_1': 'District for.'",
        "'speaker_2': 'My.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District six. District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight by district nine I. Motion carries.'",
        "'speaker_2': 'Thank you. And now to general public comment.'",
        "'speaker_1': 'Removing the public comment colors over. Just one moment, please, Mayor.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and all necessary documents and any subsequent amendments, including any amendments to extend the contract terms and the contract amount, with the Los Angeles Homeless Services Authority (LAHSA), to accept and expend Measure H funding in an amount up to $3,137,917, for the period of July 1, 2020 through October 31, 2020, to implement Homeless Initiative strategies adopted by the County Board of Commissioners to combat homelessness in Los Angeles County; and   Authorize City Manager, or designee, to execute any necessary agreements, and any subsequent amendments, with subcontractors, to provide homeless prevention and rapid rehousing services, in an aggregate total amount of $1,567,659, for the approximate period of  July 1, 2020 through October 31, 2020, with the option to renew subcontracts to ensure the expenditure of Measure H funding from the LAHSA.  (Citywide)": [
        "'speaker_2': 'Okay. There was one more. All right, then let's move on to item 20, please. Actually, item 20, I've drawn item 21.'",
        "'speaker_1': 'Report from Health and Human Services recommendation to execute an agreement with the Los Angeles Homeless Services Authority to accept and expand Measure H funding and an amount up to 3,137,917 to implement Homeless Initiative Strategies adopted adopted by the County Board of Commissioners Citywide.'",
        "'speaker_2': 'There's the motion. Can I get a second? And the second most of my concern for Austin. Are you in second place? Andrew Okay, please go to the Q system based on your answers in the second roll call vote.'",
        "'speaker_3': 'So one mayor, we have a public comment for this item.'",
        "'speaker_2': 'Um. Okay. It's not on my list, but go ahead.'",
        "'speaker_3': 'Jordan wins. Your time starts now.'",
        "'speaker_2': 'Hello there. This is Jordan, when you hear me.'",
        "'speaker_1': 'Yes. We can hear you.'",
        "'speaker_2': 'Great. Thank you very much. There's been some difficulties with Zoom today, so I just wanted to make sure I'm just calling in support of this item. I am looking forward to seeing what the new homeless service officer, Paul Duncan, will be accomplishing with the city.'",
        "'speaker_2': 'I'm excited to hear about the number of sites that will be coming online to help get our unsheltered population, which is 78% of everyone experiencing homelessness into new homes. I just want to remind council that basically what we're looking at right now is the precipice for many people who are without jobs and waiting to try and get'",
        "'speaker_2': 'rent back and trying to pay for their unit. Once eviction moratoriums and there will be a population of people who desperately need help getting out of those situations. And the last thing we want to do is see those people end up on the streets.'",
        "'speaker_2': 'So I want to remind council to continue to make these really valuable investments for both the short and the long term. This is about getting people out of homelessness as much as it's about keeping people out of homelessness.'",
        "'speaker_2': 'So I look forward to seeing how these measures are going to be applied into the future. Thank you very much.'",
        "'speaker_3': 'Thank you. That concludes public comment for the final.'",
        "'speaker_2': 'Roll call vote, please.'",
        "'speaker_1': 'District one. My district, too, was an AI District three. AI District four. AI District five. I. District six.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight. District nine. My motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute contract amendments with Anthem Blue Cross, the Citys third-party administrator for the Preferred Provider Organization (PPO) and the Health Maintenance Organization (HMO) group health plans, and Medicare Supplement plan; UnitedHealthcare Medicare Advantage PPO Plan; Scan Health Plan for the Medicare Advantage Plan; and Vision Service Plan (VSP) for the vision plan; CVS Caremark as the Prescription Benefit Manager (PBM) for the Prescription Drug Plan for the PPO and HMO plans; Delta Dental for the fee-for-service dental plan (DPPO) and Delta Dental USA (HMO plan); The Standard Insurance Company for employer-paid life insurance, voluntary life insurance, and short- and long-term disability insurance; Union Mutual Life Insurance Company (UNUM), through Larry Lambert & Associates Insurance Services, for long-term care insurance; and, any subsequent amendments necessary to maintain current benefit levels and remain in compliance with state and federal laws on all plans, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'Thank you. Item 22 Please.'",
        "'speaker_1': 'Report from Human Resources Recommendation to execute a contract to execute contract amendments for health, vision, prescription dental life and disability insurance to maintain current benefit levels and remain in compliance with state and federal laws on all plans citywide.'",
        "'speaker_2': 'Okay. I have a motion by Vice Mayor Andrews. And a second by customary ringa. No public comment. Roll call vote, please.'",
        "'speaker_1': 'District one.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'I. District three. I want district.'",
        "'speaker_1': 'Four.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'All right, district seven. I.'",
        "'speaker_1': 'District eight. District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Chapter 10.81 establishing a 34-ton weight and load limit on the Ravenna Bridge over Rivo Alto Canal, read and adopted as read.  (District 3)": [
        "'speaker_2': 'Great. 24, please. Or actually 23, please.'",
        "'speaker_1': 'Communication from City Attorney Recommendation to Declare Ordinance. Amending the Long Beach Municipal Code by adding Chapter 10.81. Establishing a 34 ton weight and load limit on the Ravina bridge over the Revo Alto Canal. Read the first time and later at the next regular meeting of the City Council for Final Reading District three.'",
        "'speaker_2': 'Have a motion. Can I get a second, please? Councilmember Price and Councilmember Ringa I if I can. No public comment. Let's go ahead and do a roll call. And less and less of anyone not to speak to our price or we go with the local.'",
        "'speaker_4': 'The roll call. Thank you.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'District one. District two. District three.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District seven. District eight. District nine. I motion carries.'"
    ],
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by adding Section 16.52.2350 relating to the designation of the property located at 1005 Locust Avenue as a historic landmark, read and adopted as read.": [
        "'speaker_2': 'Great. Next up. Next item, please.'",
        "'speaker_1': 'Item 24 A Communication from City Attorney Recommendation to declare ordinance designating the property located at 1005 Locust Avenue as a historic landmark. Read the first time and later for the next regular meeting of the City Council for Final Reading.'",
        "'speaker_1': 'Adopt a resolution establishing a historic resource designation for the property declared ordinance. Designating the property located at 141 and 143 East 10th Street as a historic landmark. Read the first time and lead over to the next regular meeting of the City Council Final Reading and adopt a resolution establishing a historic resources designation for the property.'",
        "'speaker_2': 'Can I get a motion, please? Most of my customers in their house and I get a second. Speaking about customary rang up roll call vote.'",
        "'speaker_1': 'Strict one.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'I'm.'",
        "'speaker_1': 'District three.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District four.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District five. My District six. My District seven.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'District eight. High District nine.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary for the First Amendment to Project Labor Agreement (PLA) No. 33859 between the City of Long Beach and the Los Angeles/Orange Counties Building and Construction Trades Council, and the signatory Craft Councils and Local Unions, to extend the terms of the PLA from its expiration date of May 22, 2020 to December 31, 2020 or the effective date of a new Project Labor Agreement, whichever occurs first.  (Citywide)": [
        "'speaker_2': 'Thank you. And I'm 26. Please.'",
        "'speaker_1': 'Report from Economic Development and Public Works. Recommendation to execute the First Amendment to project labor agreement to extend the terms of the play to December 31st, 2020, or the effective date of a new project labor agreement citywide.'",
        "'speaker_2': 'Take out some members, and they also got a motion seconded Councilmember Mungo. I see no public comments. Critical vote, please.'",
        "'speaker_1': 'District one.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'District two.'",
        "'speaker_0': 'District three. I.'",
        "'speaker_1': 'District four. My District five.'",
        "'speaker_0': 'And my.'",
        "'speaker_1': 'District six. I'm District seven. I District eight.'",
        "'speaker_2': 'II.'",
        "'speaker_1': 'District nine. I motion carries.'",
        "'speaker_2': 'Great. Thank you. That concludes all the agenda item. I believe that I miss any Madam Clerk.'",
        "'speaker_1': 'But you're hearing 15.'",
        "'speaker_2': 'Oh, no, no. Besides that, all the other agenda items are done, correct?'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Okay, great. So then let's transition into the budget hearing and we're just going to give staff just the 30 seconds to a minute to just get ready and put up the presentation and do have a short presentation for this budget hearing.'",
        "'speaker_2': 'And then we'll go from there. So everyone can just hold that while we get we'll get the setup from staff. And Mr. Monica, let me know when you're ready.'",
        "'speaker_3': 'Will do. Thank you.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and take the actions necessary to adopt the Fiscal Year 2021 budget as listed in Attachment A.  (Citywide)": [
        "'speaker_2': 'Mr. Monica, you say you were ready.'",
        "'speaker_3': 'I said we were working on getting the presentation loaded.'",
        "'speaker_2': 'Okay, we'll wait it.'",
        "'speaker_3': 'Okay. Mr. Mayor, members of the City Council, we are ready. We have the presentation up on the screen. So I will turn this over to Grace Yoon and the budget team to go through a presentation on our Budget Priorities survey.'",
        "'speaker_3': 'This is something we've done every year for the last several years and provide some good input in a way for our community to engage. We saw a huge increase in budget engagement this year, which we always like to see.'",
        "'speaker_3': 'So we'll go through the presentation for you now, Grace.'",
        "'speaker_0': 'Great. Thank you, Tom. Good evening, Mayor, and members of the city council. We have Joe Greer here, a budget analyst on our team who will be providing the presentation and staff report.'",
        "'speaker_5': 'It evening, mayor and members of City Council. This presentation will be providing a high level summary of the responses from the Budget Priorities Survey or the BOCES request to provide this presentation. The full City Council ETF, summarizing the responses of the Budget Priority Survey, was issued on August 25th and provides additional detailed information.'",
        "'speaker_5': 'The budget survey is just one of our many efforts to receive community input and provide resources to the public on the budget and the budget process. These other outreach efforts and resources include the following budget hearings that took place throughout the month of August, where departments were able to present their budget proposal, proposed budgets, and the City'",
        "'speaker_5': 'Council, as well as the community, had the opportunity to provide comments and discuss the departments that presented this year where police, fire, public works, including city health and library services. The proposed budget and budget presentations are available on the city's website.'",
        "'speaker_5': 'This week, there were also weekly budget oversight committee meetings that started in late July this year and didn't do that due to the pandemic. We held four city wide community budget meetings through Zoom. Spanish was available for two of the meetings in committee and Tagalog.'",
        "'speaker_5': 'Translations were available for one meeting each. The community was was able to attend and hear an overview of the budget and had the opportunity to ask questions with representatives from nearly every department at each meeting. This year we also had a budget simulator available online for residents to try to balance the budget and solve a $30 million'",
        "'speaker_5': 'shortfall with a menu of options where they could either add or cut various services and also get a glimpse of the challenging decisions and limited options available when trying to solve a significant shortfall. It is important it is important to note for this year this was not designed not designed as a survey or to solicit solicit specific'",
        "'speaker_5': 'items that would require much more work in terms of developing the options, the types of options included and descriptions and service impacts. Given the limited capacity we face, the staff. The tool was designed to purely to provide an educational resource for residents.'",
        "'speaker_5': 'We hope this is something we can continue to develop and expand and improve upon in the future. Based on feedback from this year, 970 committee members completed the budget simulator as of today. We also have our budget one, two, one video that was created last year and updated slightly for this year.'",
        "'speaker_5': 'That gives an overview of the budget basics such as our city's funds and funding sources. We also created this year new short video clips that provide a specific overview of the proposed FY 21 budget made available in English, Spanish, Tagalog and combined.'",
        "'speaker_5': 'Lastly, there was a robust social media outreach effort to inform the community of all of all of the ways to engage in the budget process. I want to highlight that between the streamed press conference, community budget meetings and the FY 21 highlight videos, we had over 25,000 views on content specific to the FY 21 budget.'",
        "'speaker_5': 'Also, 3200 of those views were from individuals viewing in combined Tagalog or Spanish. Turning now to the budget survey. This survey has been conducted each year beginning in 2015 and the results have been shared with council each year.'",
        "'speaker_5': 'The survey was made available in online, in English, Spanish combined to call it. Also this year the survey went live earlier than previous years, going live on June 16th. The survey was promoted on our city website, during our online community meetings and on various social media websites.'",
        "'speaker_5': 'We had 404,710 responses this year, more than 12 times the responses last year. The data provided in this presentation is summarizing the data from surveys submitted as of August 28. Survey participants were asked to rate 36 services as being very important.'",
        "'speaker_5': 'Somewhat important, not very important or not at all important. Before I go over the survey results, it is important to know that the budget survey is not a formal or professional survey. This is not a scientific survey and the results should not be considered representative of the public at large.'",
        "'speaker_5': 'Also, there are no controls that prevent multiple responses from a single individual. However, the survey does provide considerable feedback from participants and comments that share their concerns and interest. This lab gives a snapshot of the demographics of the survey respondents.'",
        "'speaker_5': 'There was participation from all Council District Watts Council districts three and five, having the largest number of responses. 17% or 726 respondents noted that they did not know what district they lived in. 1% or 68 respondents indicated that they were nonresidents, and 475 respondents skipped this question altogether.'",
        "'speaker_5': 'In terms of age, the age bracket with the most respondents was 30 to 39 years old, with 22% of the responses. But in general, there are a good number of responses for each age bracket. There was also an overall shift in age of respondents this year.'",
        "'speaker_5': 'In prior years, 60% of the respondents were 50 years or older. This year, 60% of the respondents were under 50 years of age. There was also a shift in household size this year. In prior years, 60% of the respondents were in households with one or two persons.'",
        "'speaker_5': 'This year, that dropped to 50%. The largest group of respondents were households of four people, with 882 responses, or 20% of the respondents. To allow us to have an easier way to compare the results. Each response to each service was assigned a weights very important was given three points.'",
        "'speaker_5': 'Someone important was given two points. Not very important was given one point and not at all important was given zero points. At total points, each service was divided by the number of responses received for each service. This allowed us to obtain a weighted average.'",
        "'speaker_5': 'This slide and the next slide lists the services that we asked respondents to rate, and they are listed in ranked weighted order. With the first item on this list being the highest scoring service. This slide shows the highest rated services.'",
        "'speaker_5': 'With the items above the line signifying the top ten. I'll talk about them more in a moment. This slide is a continuation of the list of services from the previous slide. All of the services under the line on this slide received a weighted average below two, which means respondents generally ranked the service as being not very important'",
        "'speaker_5': 'or not important at all. What is notable is that this year, 15 of the 36 services had an average rated score under two. Last year, only six services were or scored under two. It appears that the survey respondents prioritized and made distinctions among the services more than in years past.'",
        "'speaker_5': 'Essentially what this means is that a lot more is that this year more people labeled more services as being not important compared to last year. In this slide, you can see the top ten ranked services from this year and last year.'",
        "'speaker_5': 'New to the top ten this year are reducing ocean pollution by improving storm drains at five and providing free or low cost recreational programs for youth up ten. Dropping out of the top ten are providing nuisance abatement programs downtown and enforcing traffic laws down.'",
        "'speaker_5': 'Five Other observations to now regarding the top ten is that, I mean, maintaining a low crime rate dropped from number one to number four and preparing the community for emergencies and disasters has jumped up from number eight to number three.'",
        "'speaker_5': 'Also this year, top four are all public safety related. The surveys. This survey also provides an opportunity for respondents to leave written comments. We have received approximately 2300 written comments and they are listed by district in a Tier 12 that was issued on August 25th.'",
        "'speaker_5': 'The comments cover a wide variety of issues. Some of the major themes include defund, reducing police budget support for the police and public safety. Homelessness, mental health. COVID 19. Recovery. And a variety of community services. That concludes my presentation and I'm available for questions.'",
        "'speaker_2': 'Thank you, Mr. Murdoch. I think that's the only part of the presentation that we're doing today. Correct.'",
        "'speaker_3': 'That is so this is the first night that the council can consider the adoption of the budget. So we have this set for today, for next Tuesday and then the 15th. Those are the three dates. Typically when the Budget Oversight Committee is done with its recommendations, they forward it all on and that becomes the complete package.'",
        "'speaker_3': 'So that work is underway and we're available to answer questions or we can push this forward until the eighth and continue our discussion then.'",
        "'speaker_2': 'Great. Thank you. So I'm going to start with our BRC chair, come from Austin. Thank you, Mr. Mayor. I'd just like to make a motion to continue this item into September 8th. Number one. And then I have a question in terms of process for the city attorney or city manager, in terms of our charter and its as'",
        "'speaker_2': 'it relates to the budget. Can you explain to us if we as a city council are not able to come to agreement on a budget by a certain date? What happens and I know September 15th is the date.'",
        "'speaker_3': 'You're correct. Councilmember The date is September 15th if the Council does not adopt a budget by that date. The city manager budget goes into effect pursuant to the charter.'",
        "'speaker_2': 'Okay. And does that include the mayor's recommendations as well? It does not. Okay. Thank you. And so I guess as BMC Chair, look forward to working with my colleagues to hopefully get the budget adopted. I know we are working very diligently on the Budget Oversight Committee with staff and I know each and every council member is weighing'",
        "'speaker_2': 'in with their respective constituencies and communities. And I think the process and if I can just speak to the process thus far, I think it has been a robust process. This budget survey has given us a lot of good information.'",
        "'speaker_2': 'We have to also recognize some of the organized advocacy out there, namely the People's Budget and our Budget Oversight Committee. We we actually addressed that last week. And I think at the end of the day, we are looking to pass a budget that meets the needs of our city today in 2020, but also reflects the values of'",
        "'speaker_2': 'our very diverse constituents. So those are my comments from now. My motion says thank you. Thank you. Customer price.'",
        "'speaker_0': 'Thank you, Mr. Mayor. I want to thank staff for that presentation. I am blown away by the huge level of participation that we got this year. I think that's fantastic. I'm sure there's a number of factors that contributed to us having almost 5000 participants in this budget budget survey, and I'm really thankful to my residents.'",
        "'speaker_0': 'The third district represented 25% of the total respondents, so I want to thank them for continuing to be engaged. I know that our team really advertises and promotes the budget a lot in our in our emails to the community and in our newsletter.'",
        "'speaker_0': 'We've been promoting it pretty consistently, so I'm grateful that that folks took the time to fill it out. I am not surprised based on the hundreds of emails my team and I get every day, that the four top priorities were public safety related.'",
        "'speaker_0': 'That certainly seems to be consistent even from those who are interested in seeing some reforms from the police department. We've received heavy support for maintaining patrols and ensuring acceptable response times when people do call for emergency services, which is understandable.'",
        "'speaker_0': 'And so the budget survey results really does mirror very much that email correspondence that I'm engaged in every day. And and it was interesting to see the responses and the response levels throughout the city as well. So thank you very much for bringing this forward.'",
        "'speaker_0': 'And I'm really glad that we do a budget survey, especially when the results include as many participants as we have this year. So thank you very much.'",
        "'speaker_2': 'Thank you, Councilmember Pearce.'",
        "'speaker_0': 'Thank you and staff for this work and thank you. Council Member Austin Chair Austin for postponing this vote today. As far as the survey goes, I agree. I'm really impressed with the numbers. I think it's typical for the third district to stay super engaged on the budget.'",
        "'speaker_0': 'I'm glad to see a lot more people in different areas. I think Second District has around 400 something and and I know that it's difficult, but I do love the fact that people were able to do this online, that we were able to have the budget meetings online.'",
        "'speaker_0': 'I definitely missed having the opportunity to meet with my neighborhood associations and some of my community members. Specific to the second district, outside of the people's budget and everybody else. So this week will be having another community meeting around that.'",
        "'speaker_0': 'But I did think that it was really enlightening to be able to see that the top four was medical fire, preparing for emergencies and maintaining low crime rate. And I say that because I, I was curious what this survey would come out with.'",
        "'speaker_0': 'And I think having that as a city, as a whole thing, that those are our four goals. We have to really look at what it means to provide public safety, and I think that that's in alignment with the conversations that people are having.'",
        "'speaker_0': 'We know that communities are safer whenever they have roofs over their heads, when they've got good jobs, when they've got access to education and the resources that people need. But I also just really feel like this is giving us that moment to reflect a little bit longer on what that means for us in the city of Long'",
        "'speaker_0': 'Beach, outside of maybe some of the reforms that are already present there. So I look forward to having deeper conversations in the next week. I hope to meet with some more of the BMC members and be able to kind of flesh this out on what it means to really provide public safety while maintaining the core services of'",
        "'speaker_0': 'each department in the city. And so I think that that's where we can have some really robust conversations and understanding how our departments really work together and not in silos to deliver on these public safety services. So thank you.'",
        "'speaker_2': 'Thank you. Council members. And they are.'",
        "'speaker_0': 'You, Mayor, and thank you very much, staff, for this presentation. I'm very lucky looking at the the survey results. You know, I'm very pleased that the community has responded in this way. I think it's very, very important to have community input.'",
        "'speaker_0': 'This also brings to my attention that we need there's still a lot more work to to be done in the in the area of putting our budget out there and getting people to actually respond, especially in my district.'",
        "'speaker_0': 'I see I see it as one of the districts that has responded in the lower category. And so I I'm I know that it's been a very difficult time right now with COVID. And so I know that is it's you know, it has something to do with that.'",
        "'speaker_0': 'But, you know, I look forward to to making sure that we raise that number in the in the future to have better numbers and make sure that all our residents, especially in my district, can have the opportunity to voice their opinions in this survey.'",
        "'speaker_0': 'But very good survey, very interested, I mean, and very interesting also. I really like that. I see I see quite a percentage of young adults that that have been involved, 20% being from 19 to 29 and gives me a lot of hope.'",
        "'speaker_0': 'I think that it's very important that our youth really take, you know, take initiative and be active in in surveys as these that are so, so very important. And, you know, we really need their voice to be heard.'",
        "'speaker_0': 'So I'm very impressed with with that, you know, and the next level up is, you know, our age is 30 to 39 and, you know, that's a 22%. So I hope that we keep that up and that hopefully we can get more and more people involved in surveys like this, especially with something so important as the budget'",
        "'speaker_0': '. So thank you very much.'",
        "'speaker_2': 'Thank you. Next up is Country Supernova. Thank you. Thanks to the staff for that presentation and thanks to all the residents who participated in the survey. I think if I could ask staff, I mean, we talk about the top ten items, whatnot.'",
        "'speaker_2': 'Would staff be able to read aloud numbers one and two? That is the top four priority and the priority and the number two position.'",
        "'speaker_5': 'Thank you for that, Councilmember. Number one was providing emergency medical services. And number two, it's providing fire protection services.'",
        "'speaker_2': 'Okay. Thank you for that. I know the greatest number of respondents came from districts two, three, four and five and in the highest numbers from from three and five. I would just like to mention that while I made the case that Internet 17 helps our entire system, my fire response system, city wide and and indirectly has a'",
        "'speaker_2': 'lot of influence on District six. Districts three and five are served directly by Engine 17, and that's a paramedic assessment engine company. In three, it calls on the Park Estates area and in District five, the Stratford Square neighborhood.'",
        "'speaker_2': 'And I think it's just abundantly clear what the residents want or what they prioritize in their services. So I just wanted to make that point. Thank you. Thank you, Councilmember Richardson. Thanks, Mr. Mayor. Just a few thoughts. So it's great that the DLC has been been so productive and getting us to this point, I think.'",
        "'speaker_2': 'I support the motion of continuing the next week particularly so we can have a bit more time, do an outreach. I see that from the survey. First of all, congratulations on getting so many responses. I want to I want to I want to highlight where we need to do a bit better.'",
        "'speaker_2': 'If you look at the survey, you see that districts one six. Let's see. One six, seven, nine. The respondents on within those districts, the sum total of those four districts is less than the responses in the third district.'",
        "'speaker_2': 'And it's great that the third district in the fifth District has a lot of response, but we need to make sure, particularly given all the changes and all the dynamics that people are dealing with, that we really put it in the right context and we we take additional steps to do more outreach.'",
        "'speaker_2': 'Traditionally, you know, I'm an in-person person and I, you know, I have a difficult time just keeping up with things online and, you know, just, you know, just having kids and all that stuff. And those are just no working families.'",
        "'speaker_2': 'That's just what it is. We typically look forward to an in-person budget meeting and we typically pack out the room and city staff know that we have a good time. It's it's the time of the year to really check in with a lot of departments, but we can't do that.'",
        "'speaker_2': 'And then we, we, we did sort of joint meetings and, you know, the participation wasn't very present there as well. So so I say all that to say I think we need to I think we need to like we've we knew this was an accelerated sort of process within this budget and there were multiple processes taking place'",
        "'speaker_2': 'at the same time, the reconciliation process, a lot of unrest in the community. And so I want to make sure that we we sort of think about that moving forward. We don't know how long it will be in the situation, but we're going to have to do a better job doing outreach.'",
        "'speaker_2': 'And and I'm I'm willing to be a part of that. I think given where the dynamics are, where the surveys didn't come from, we're going to have to have staff work, you know, just work a little bit harder in central Long Beach and in North Long Beach and on the west side to make sure people participate in'",
        "'speaker_2': 'this process. We also know that digital divide could play a role in this. We really need to think about what these barriers are so people can participate moving forward. I think there's, you know, a little I think the budget for the most part is I like the things that I see in the budget and the things that'",
        "'speaker_2': 'I'm seeing in the in the city managers budget. I mean, in the in the mayor's budget, there's some fine tuning to do. I have a I have a question about one particular issue, and I'm going to hold this to the make the chair, the B or C in the in the recommendations within the reconciliation framework, we talked'",
        "'speaker_2': 'about a Measure B funding arts. And as a matter of fact, I think I'm going to process the staff. And then I'd like to hear from you from Councilman Austin. But as it relates to Measure B, are those are those final filters down?'",
        "'speaker_2': 'So are those are we making the allocations on Measure B this year? And are we doing that? And if not, when do we anticipate bringing that up?'",
        "'speaker_3': 'So yes, we have a general dollar amount allocated in the city manager's budget and then the Mayor further puts detail on that as part of his recommendations. Measure B was something that the mayor's office really worked with the arts groups on.'",
        "'speaker_3': 'In fact, today his office put out a allocation, a proposed framework to the council that you can consider as part of the budget.'",
        "'speaker_2': 'Okay. So I'll I'll talk with the mayor and I'll talk with A, B or C chair. Thanks a lot. But I look forward to I know there's some more community meetings and presentations and I'll look forward to adopting the budget unanimously next next week.'",
        "'speaker_2': 'And if I could just just also weigh in here on that question. We did go through the mayor's recommendation for allocation Measure B during the Budget Oversight Committee. We heard a report and Budget Oversight Committee will be making our recommendations as well.'",
        "'speaker_2': 'And I would leave it open to the mayor to comment as well. Thank you. Let me let me just weigh in also just real briefly and then we have a couple more council comments since I think I think it's good.'",
        "'speaker_2': 'Yeah, we sent out. So just you should have or your staff should have some follow up documentation on the Measure B proposal. Just as a as a note, because I've had a couple of questions, so I'll just answer them publicly.'",
        "'speaker_2': 'One is, the proposal you have in front of you was the agreed upon proposal as we presented it when Measure B first came forward. And what then what the arts groups and the convention center came together on. It's also the one, of course, that I discussed with with with all of you during the process of us getting'",
        "'speaker_2': 'it on the ballot. And so that's the proposal you have in front of you. There was a question about the Arts Council. I want to make sure I clarify that as well. So one of the benefits of Measure B is it's going to be a huge benefit to the Arts Council directly because the arts groups, particularly the'",
        "'speaker_2': 'large ones that received significant grants from the Arts Council, the way we're going to ensure that they are able to give more grants to other organizations are their artists, is the the operating grants that they give, they're going to dial back on those for those organizations.'",
        "'speaker_2': 'So let's say you are in a musical theater west and you receive $10,000 a year from the Arts Council instead of that going to musical theater west because Measure B is significantly enhancing, then the Arts Council will keep those resources and be able to use them for their operating needs and or to grant out to other smaller'",
        "'speaker_2': 'artists. And so at the end of this process, not only are the arts organizations winning, but the Arts Council will significantly gain additional resources by not having to give out those operating grants to these organizations that are benefiting from Measure B.'",
        "'speaker_2': 'So I just wanted to also just answer that because I did answer that one other councilmember again, this was all part of the kind of agreed upon framework that the arts organizations have kind of put forward as as they develop Measure B.'",
        "'speaker_2': 'And in addition to that, I want to I want to mention something and this is Councilmember Austin has been championing. So we are in discussions and and Councilman Austin and I hope to have more of a concrete proposal by next week.'",
        "'speaker_2': 'But we are in discussion. We know that the African American Cultural Center and Museum is at a is at a point now where they have been receiving funding from the council for a few years. There's an active board.'",
        "'speaker_2': 'They have a collection that's growing, they're looking for space. And so we do believe that they are an organization that deserves some stable funding. And so we hope that by next week we will have, in talking to our other arts partners and within Measure B, some opportunity to support them on an ongoing basis.'",
        "'speaker_2': 'We just want to make sure that we meet our commitment so we are we're certain we're going to be able to make that happen. I know it's very important to Councilman Austin, but also other members of the city council as well.'",
        "'speaker_2': 'And so that's something that will have for you in the next few days. That clarifies my question, Mr. Mayor. Thanks a lot. In the reconciliation process, we specifically called out the fact that African-American arts organizations weren't included in that funding.'",
        "'speaker_2': 'So I'm glad to hear that you and Councilman Austin are working together to resolve the issue. Thank you. Next with customary Ringo. Thank you, Mayor. And I, too, want to congratulate Stefan on great analysis of the surely great turnout by the community was really encouraging to know that people are paying attention and care about Long Beach and'",
        "'speaker_2': 'carrying out the survey and to put in their comments. I really want to send out a big shout out to the community for their participation. I want to also just again by my kudos to Chairman Austin. We ran some real good like Universal Committee meetings.'",
        "'speaker_2': 'We had the discussions and the motion to make to adopt next week to get a more robust discussion and possibly adopted next week. It is wonderful and I think that it provides an opportunity for us to see much more closely with with a finer tooth comb, to make some final recommendations and or other suggestions as well.'",
        "'speaker_2': 'And that were the things that did come up. Was the Arts Council on that? I also brought up earlier today some other issues that will be coming forward later as we move forward. So thank you, Councilmember Austin, for your leadership on the ability.'",
        "'speaker_2': 'Thank you, Councilman Mongo.'",
        "'speaker_0': 'Thank you. I've had the great pleasure of listening in on all the Budget Oversight Committee meetings, and I think Councilmember Austin's doing an excellent job. I really appreciate the survey. I know in my office we were promoting the survey constantly.'",
        "'speaker_0': 'I know our calls for service are very high in our office and we would share with all of our constituents when they called an opportunity to share their opinion. And I think that the council offices can really be a big part of promoting the survey, and I really appreciate that opportunity.'",
        "'speaker_0': 'I'd also like to remind staff that we have a communication strategy that has an equity lens built in and that as long as we're following what we believe will get responses, then I think we're we're moving in the right direction.'",
        "'speaker_0': 'If we need to make adjustments to that strategy, then we as a council probably need to see what that looks like and make sure that we as a council agree to what we're talking about. So I'm always open to revisiting that.'",
        "'speaker_0': 'I think it's really important. Furthermore, I think that the survey demonstrates the need to address and what we all know to be true, which is a large percentage of our reliance on the nine one. One system is for two things a medical calls and a paramedic assessment.'",
        "'speaker_0': 'And that's really important and valuable. And then also crime prevention over the last year and a half. Long Beach has experienced several instances where sexual predators are in their cars watching and being inappropriate in their cars near schools.'",
        "'speaker_0': 'And my concerns are really with schools being virtual and kids being at home and less eyes being out on the street, seeing these individual children and giving them a little bit more freedom that we need to double down on our sex offender compliance.'",
        "'speaker_0': 'I see that there is a great opportunity to perhaps pull together some efficiencies that make sure that we aren't leaving our children at risk. So I'd encourage the merging of the. Violent Sex Offender Compliance Unit and our previously sought out warrant detail to make sure to protect our children from non-compliant sex registrants.'",
        "'speaker_0': 'And September is a really important time to think about this. Sex offenders are not allowed to decorate their houses for Halloween and give away candy for obvious reasons. But those compliance checks are really in the hands of our our officers.'",
        "'speaker_0': 'And those compliance checks cannot be done by admin analysts. And so when we're talking about really investing in our community and investing in youth, it's also about setting up good boundaries on what we're willing to eliminate in the budget.'",
        "'speaker_0': 'Those compliance checks with violent offenders and sexual predators are going to be more important than ever with children spending more time at home and in small groups out in the neighborhood. So I just really encourage us to look at I know I've already brought to light that the K-9 unit and the the costs that have gone into'",
        "'speaker_0': 'that. And I know that that's been a priority. I've gotten a lot of calls from the animal community about it, but then also really merging those units together, coming up with a new unit that really can put those things together in some meaningful way, potentially some kind of.'",
        "'speaker_0': 'Predator compliance unit that pulls it all together to make sure that this is a very different time. And as kids are going to be moving into our afterschool programs and at the parks, which I want to give a round of applause to our city manager and our Parks and Rec department on the reimagining of our our school'",
        "'speaker_0': 'programs. These kids are going to be walking from their homes, these parks. Back when we had school in session. They would be able to walk in groups to those parks together. They won't have that as much anymore. So we really need to make sure that we are setting up some good boundaries.'",
        "'speaker_0': 'I know that fifth District residents have some serious concerns because these particular individuals that have circulated our schools just keep rotating and and their addiction to our young girls is just sickening. And we need to be sure to protect them.'",
        "'speaker_0': 'So I'm I'll just reiterate that. And then I also see in the top five is infrastructure. And then we talk a lot about walkable communities and its direct correlation with health. And I think that if there is a place that we could pull funding from to make an investment in infrastructure, even in this very strenuous financial time'",
        "'speaker_0': ', it's really an investment in more than just the streets and the sidewalks. It's also an investment in construction jobs around our city. I pushed really hard with our economic development department to have the play on tonight's agenda, and those jobs associated with that work are really, really important for our community as well.'",
        "'speaker_0': 'So I would encourage the finance division to work with the BMC to explore opportunities to dip into our Fleet Fund. The Fleet Fund has a direct correlation with street repair. If the streets that our city study vehicles are driving on are not in good repair, it does have a direct correlation with maintenance costs of those vehicles and'",
        "'speaker_0': 'quite frankly, the maintenance of the vehicles that we.'",
        "'speaker_2': 'Recommend for at five minute council events. We can just wrap up, please.'",
        "'speaker_0': 'That was the end. That was my last comment. So I'd love to see us pull 5 to $10 million from the Fleet Fund and invest it in streets in this next year and those construction jobs. Thank you.'",
        "'speaker_2': 'Thank you both, Mayor. Thank you, ma'am. Mr. President, first of all, I want to thank you for making the motion to delay this for next week, because I know what Black Lives Matter reached out to me on behalf of people's budget about delaying this vote and had some concerns about the proposed tax increase.'",
        "'speaker_2': 'You know, and I hope we can continue discussion next week with the b c members. And thank you very much. Thank you. That concludes council comment. So we'll conclude the call for comment, but we do have public comments.'",
        "'speaker_2': 'So I'll turn it over to the clerk and we'll begin this press conference.'",
        "'speaker_3': 'Our first speaker is Alyssa Gutierrez. Alyssa Gutierrez.'",
        "'speaker_4': 'Good afternoon. Yes. Hi. Can you hear me?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Three. Good afternoon, Mayor and City Council. My name is Melissa Gutierrez and I'm a second district resident and I'm speaking to you tonight as the chair of the Human Relations Commission. The purpose and function of the Human Relations Commission is to inspire and support social justice and equity in the city of Miami and foster mutual understanding and'",
        "'speaker_4': 'respect for all. We work toward a vision of Long Beach as a just and equitable community, free of discrimination and violence for all people are valued and have the resources to reach their full potential. As you finalize your budget in the context of a public health crisis, recession and uprising, we call on you to meet this moment'",
        "'speaker_4': 'by investing in the programs and policies that foster faith and healthy communities and divest from the practices and policies that perpetuate inequality and racial disparities. Investing in racial equity is more than a moral desire. It's an economic imperative and will be the key to a successful post-COVID economic recovery.'",
        "'speaker_4': 'This understanding we would like to eliminate the following items institutionalize racial equity by developing the Office of Equity Staff and Fiscal Capacity to implement racial equity efforts. Fully fund and implement citywide anti-racism trainings and LGBTQ inclusivity trainings with a special focus on the transgender community.'",
        "'speaker_4': 'Elevate the role and function of the Human Relations Commission as an important advisory oversight body of the Framework for reconciliation by allocating one full time staff to support the work of the Commission. Our Vice Chair will follow with the breadth of the recommendations.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'Think your next speaker is Amy Erickson.'",
        "'speaker_4': 'Good evening. This is Amy Ericson. I'm the vice chair of the Human Relations Commission. And thank you to the council for taking the time to talk about this tonight. I will follow up the rest of the recommendation letter from the HRC.'",
        "'speaker_4': 'We want you to also fully fund the implementation of the language access policy. Less than 1% from the budget would fully implement the language access policies. We want you to also establish a citywide rental housing division and tenants right to council programing.'",
        "'speaker_4': 'Establishing a rental housing division within the Development Services Department to communicate with both tenants and landlords, issue legal bulletins and update enforce renter protection laws, centralizing for information form and administer a citywide right to counsel program for renters that will provide legal resources and representation to renters.'",
        "'speaker_4': 'We would also like to see funds to fund citizens, Police Complaints Commission reforms, to engage in a formal outside expert study through a non-police community selection process, and to conduct further community outreach to ensure reforms and or new oversight bodies meet community needs.'",
        "'speaker_4': 'The last recommendation is to develop an annual budget using an equity lens to use a zero based budgeting approach, beginning with the fiscal year 2122 budget to fund staffing this year for community outreach and feedback regarding the budget to fund the implementation of a public budgeting process with an equity led to determine how to allocate any additional'",
        "'speaker_4': 'federal funding sources.'",
        "'speaker_3': 'Thank you. Our next speaker is Don Martins.'",
        "'speaker_4': 'Hello.'",
        "'speaker_3': 'Yes. We can hear you.'",
        "'speaker_4': 'Can you answer? Hi. My name is when I got to know them. Actually, it is about your sister. My brother was murdered August 20, 29, so 2017 by Martin Ron from Long Beach PD. So I'm here because, you know, I think I believe that the defunding should you guys should defund the police and you guys should the'",
        "'speaker_4': 'rest of the funds should be used for the community and for the children and family members that are traumatized due to this killer cops that they have done what they have done, you know, to the families then for, you know, the community library, schools, etc..'",
        "'speaker_4': 'You guys council, the city council, you guys are you guys should do your job correctly, hold them accountable for what they did. Murder one is still running these streets. He still he has he has blood on his hands, just like the Chief Luna that has commented on my brother's case.'",
        "'speaker_4': 'And he has said that it was my brother's fault for not being able to pay a dollar 75. And that's what he should have had happen to him, which I totally disagree, because they should have just given him a ticket.'",
        "'speaker_4': 'That was all they could. They should have done that. Very funny. The I'll be PD is responding to non-emergency cases and are escalating instead of the escalating and just doing, for example, a simple table you got, you know, taxpayers are paying for these killers mistakes.'",
        "'speaker_4': 'I think it's time for you.'",
        "'speaker_3': 'Thank you. Our next speaker is Jennifer Hing.'",
        "'speaker_4': 'Hello? Can you hear me? Yes, you hear me? Hi, Jen. With a invest in youth and people's budget. We demand that you defund the police by 20%, not a mere 5%. On January 15, 2017, a 37 year old Cambodian mother who suffered with a mental health condition was shot and killed within 46 seconds of getting out of'",
        "'speaker_4': 'their car. Her daughter, Jonathan Lee, was a former youth leader of Girls in Action who advocated for support services for her community. I'll be PETERS Negligence, malice and oppression cost taxpayers a $9 million settlement, one of the largest settlement payouts in history.'",
        "'speaker_4': 'The proposed 5% cut is nothing compared to this one settlement and may long be. City attorney Charles Parkin reported that the city has spent more than $31 million since 2014 to settle 61 excessive force and wrongful death lawsuit for youth.'",
        "'speaker_4': 'Public dollars show that only $204 is spent on positive development programs per youth. But overwhelming $10,500 is spent on suppression for issues, arrests, police suppression and violence as a public health issue. Black youth and young people of color in these communities not only face police brutality, but witnessing police violence stops done by police and living in a'",
        "'speaker_4': 'heavily police community all harm health. Police violence compounds are growing rate of anxiety, depression and PTSD and disrupt young people's learning and growth. So to speak to your August 27th Facebook post, mayor. Our young people need to know and see that these deep and serious challenges can be addressed this year, in this presidential election, in this school'",
        "'speaker_4': 'year, and definitely in this budget cycle.'",
        "'speaker_3': 'Thank you. Our next speaker is Jordan during.'",
        "'speaker_2': 'Can you hear me?'",
        "'speaker_3': 'Yes, we can hear you.'",
        "'speaker_2': 'Hello. City Council Mayor. My name is Jordan. I'm going to start here with a quote from the mayor as.'",
        "'speaker_0': 'We move forward.'",
        "'speaker_2': 'Whether we're talking about issues around the budget or legislation that will happen later this year, in the summer, that's what we do. Now, I think what I just said is that it's way more important that we're uplifting the black voices.'",
        "'speaker_2': 'Our communities are directly from the community and that they're involved in all the decision making processes and that there is actually a voice, instead of just presenting the budget and the council meeting among themselves and having a conversation that is inclusive of the community where the youth development or workforce programs and that money is.'",
        "'speaker_4': 'Invested in ways.'",
        "'speaker_2': 'That are dealing with the changes. Mayor Garcia, you made the statement in June that you would take into account the black community and the community in general wishes when it came to the budget. That has not been the case.'",
        "'speaker_2': 'This budget does not reflect the wishes of the community at all. Does not defund Vpd, which is a major priority of BLM and what the major priority of all respondents in the reconciliation process. So I must ask Mayor Garcia, will you keep your word to the community or you betray them?'",
        "'speaker_2': 'You said yesterday privately that you would support further cuts to LBP. Will you say today publicly or hide?'",
        "'speaker_3': 'Thank you. Our next speaker is Jordan Wynn. Jordan when? Our next speaker is Max Nurse.'",
        "'speaker_2': 'Good afternoon. Good afternoon. Good evening. Rex and Jeanine and you folks are bought and paid for by the Long Beach Police Officers Association. 2020 is not a normal year and on this I think we can agree, but all discuss this as if it is any other budget.'",
        "'speaker_2': 'But there's a clear outlier here in front of us in giant, bold letters that haven't been anywhere near the top ten ever before, and that is to defund the Long Beach Police Department and their killer cops. I think we can agree that killer cops are bad, so start there and fire them all.'",
        "'speaker_2': 'If you need a list, Google me. Drop me a line. Over this weekend, we had the third angel burglary of Cesar Rodriguez PD murdered and the cop who murdered him, Martin Ron got promoted. No more platitudes. Deep cuts, 20%, 25%.'",
        "'speaker_2': 'Maybe we could get some more empathy for Daryl and the district. Maybe we can do all the other things that had to get scrapped this year if we just make them deep cut. And we need to start with a violent, asinine white supremacist culture that is displayed by Robert Luna and the Long Beach Police Department, and especially'",
        "'speaker_2': 'the Long Beach Police Officers Association. Google the challenge coins. Understand this stuff. These guys are not good.'",
        "'speaker_3': 'Thank you. Our next speaker is Melissa morgan.'",
        "'speaker_4': 'Mayor Garcia used your platform to get things done. You're getting national spotlight, spotlight our city. If you really care about black people, if you really wanted to champion a healthier, more inclusive Long Beach, if you really wanted to defund the police, you could help council see the light and make it happen.'",
        "'speaker_4': 'Your wee little defund the police gesture is not yet significant. Defund the police by 20%. Make a bold stand against police violence. You hear our stories tonight. I'm Tyler Woods. I'm 19 years old. On November 19th, 2013, I was at the store with my aunt, my mother, sister, as we walked out of the store.'",
        "'speaker_4': 'Long Beach Police Department officers were standing there staring at us. We wondered why we live in a continual state of fear of police and felt incredibly uncomfortable. The more they stared, the more uneasy I grew, beginning to fear for my life.'",
        "'speaker_4': 'They came towards us and out of fear and a lifetime of traumatization by police. I ran. They chased me down fourth Street. I ran into a building to try to get away from them. There were people around. As the officer got closer to me, I heard him call me a nigger several times.'",
        "'speaker_4': 'An older Latina woman who was looking on heard the words as well. The officer began shooting me in my back. One, two, three, four, five, six, seven, eight, nine, ten, 11, 12, 13, 14, 15, 16, 17, 18, 19 times.'",
        "'speaker_4': 'Someone please help me and my black body in court. The lady witness told the judge. The court said that nigger shouldn't have run mayor and council. Defund the police. Be bold. Divest.'",
        "'speaker_3': 'Thank you. Our next speaker is Jordan Wynn.'",
        "'speaker_2': 'Can you hear me?'",
        "'speaker_3': 'Yes, we can hear you.'",
        "'speaker_2': 'Thank you. Glad you can this time. Lobby City Council. I'm Jordan Wynn. And we're tired. We're tired of talking about black lives, politics instead of ones that matter and who are suffering because of police violence. I hope you were listening to the last public comment carefully.'",
        "'speaker_2': 'We are tired of police firing violence across our country and here in Long Beach. One unjust death is too many. Yet they continue to happen every day. Donte Jordan say his name Feroz Mourad. Say his name. Lionel Gibson.'",
        "'speaker_2': 'Say his name is Rodriguez. Say his name. Taylor would say his name. Catherine Gomes. Say her name. Frederick Papp. Say his name. We are tired of city politicians skirting around this issue. The platitudes and the public input sessions aren't helping.'",
        "'speaker_2': 'When you don't listen to the people, what did the people want to focus on in every reconciliation public session? Alternatives to incarceration. There are decades of research on how to do this, and the people are asking for it.'",
        "'speaker_2': 'It's time to defund the police. There is no reason city council members should speed up the process and approve the budget today or next week without listening to your constituents who have prepared the people's budget. The proposed 5% cut to the LAPD are grossly inadequate.'",
        "'speaker_2': 'Imagine if we cut police budget by 20%. That's $50 million. We could fill the city's entire shortfall and fund the entire people's budget and boost essential services like libraries and parks. This moment will go down in history. Will the City Council align with the violent and corrupt police department or with the families and neighbors fighting for justice'",
        "'speaker_2': 'and healing? Thank you very much. It's up to you to decide.'",
        "'speaker_3': 'Thank you. Our next speaker is Rick Chambers.'",
        "'speaker_2': 'Good evening, Mayor. City Council members. I'm Rich Chambers. I'm president of the Long Beach Police Officers Association. We understand the city is facing serious financial challenges. Early on, we were told the department would be cut up to 8.7 million, representing a three and a half percent cut.'",
        "'speaker_2': 'That represented the balanced outcome approach where police services were prioritized. Then we see the proposed budget and we see those cuts increase to 10.3 million 5%. My concerns center around that additional $1.6 million. There has been no proper analysis, no formal discussions about the impacts of or the reasons for those additional cuts.'",
        "'speaker_2': 'As you look at these cuts, we ask that you consider what impact would this have on our communities? What effect will this have on our response times? How will these cuts affect our ability to keep the public safe?'",
        "'speaker_2': 'We want to be part of the solution, and we've asked to be part of the discussions. The proposed budget eliminates 54 sworn positions, and we're asking for only reasonable restorations. There are critical, specialized positions that need to be restored.'",
        "'speaker_2': 'We can talk about each of these positions and why they're important. As tonight's discussion has emphasized, the people have spoken. Your budget survey showed that maintaining a low crime rate is still a top five priority for the community.'",
        "'speaker_2': 'And a recent scientific citywide poll showed that 66% of Long Beach residents believe department funding should be increased or kept the same. We ask respectfully that you look at the data, the impacts that you listened to, the community's concerns, and consider our request for these critical, specialized units.'",
        "'speaker_3': 'Thank you. Our next speaker is Tanya Jimenez.'",
        "'speaker_4': 'Huh? Can you hear me?'",
        "'speaker_3': 'Yes, we can hear you.'",
        "'speaker_4': 'Good evening, everyone. Just like Jordan winner Melissa morgan, I'm tired and angry. This budget process has been extremely frustrating, largely in part by our collective refusal to listen to the public's demands. On one side, there are people that have been pleading for your assistance in ending police violence and ensuring that people's basic needs like access to housing'",
        "'speaker_4': ', food, well-paying jobs, and even the ability to understand what their leaders are doing in their in their own language. On the other side, there are lovely people that are concerned about police response time who are seemingly unbothered by the current state of affairs, where the LAPD brutalizes and murders black and brown communities, and you all let them'",
        "'speaker_4': 'get away with it, even praising their actions and calling them heroes that go through there while condemning police violence elsewhere. I understand the multiple and conflicting obligations that you all face, but your primary obligation and duty should always be to the public.'",
        "'speaker_4': 'I also understand that the public interest is a vague concept, but in all that public servants do, they must act in accordance with the demands of their most disadvantaged constituents. That means prioritizing the people that are demanding that you build your influence to end violence at the hands of the LAPD, that you de-fund LAPD.'",
        "'speaker_4': 'Not a 1.6% cut from last year's adopted number from the general fund, and that you divest from LAPD with the goal to reinvest in black and brown communities. We are not calling for the reforms that you are proposing.'",
        "'speaker_4': 'First and foremost, we are calling that you are deep LAPD by reducing your budget size and power meaningfully. Now, are you misusing if you're still confused about what, defunding? May I be one that has been murdered by the LAPD since the department was established?'",
        "'speaker_4': 'Rest in power.'",
        "'speaker_3': 'Thank you. And now give us a moment. Well, we transition to the Spanish portion of our. Public comment. Our first speaker is Elizabeth Gonzalez.'",
        "'speaker_2': 'The preeminent person maker of letters, Elizabeth Cohen tells. Say hello.'",
        "'speaker_4': 'To.'",
        "'speaker_2': 'See.'",
        "'speaker_4': 'Sydney suburb Gonzalez Como. These are the last few that they loan this deportivo la quality that the of their immigrants. That means there will be no question in the last year that. Yes. Only that necessity central disagreement. The necessity program of the rehabilitation.'",
        "'speaker_4': 'But alas, Persona's problem is that all of us get to this point the metaphor that gets stolen as media. Chewing gum access. I usually set up.'",
        "'speaker_2': 'My name is.'",
        "'speaker_4': 'Programmer.'",
        "'speaker_2': 'Better than the better than me not to continue my.'",
        "'speaker_4': 'Four.'",
        "'speaker_2': 'No, it's a scratch on the ticket. It's better. They hit that Acela. My name is. Elizabeth Gonzalez. And as a mayor and also as a counselor of the coalition of Immigrants, I wanted to talk to you because wanted to speak out about that.'",
        "'speaker_2': 'The but the city budget. I wanted to make sure that there is money so that we can have health centers and also we can have rehabilitation centers. So for people who are dealing with drugs, also for not only for them, but also for their families and all residents of Long Beach, especially if the family needs therapy.'",
        "'speaker_2': 'This is going to continue in Spanish now.'",
        "'speaker_4': 'Good enough for me to get close enough. I mean, getting access or DARPA. Program as a whole in this comparatively. Second, on a personal necessity, I do not think I declaration my moral service or the idea of I'm in that either.'",
        "'speaker_4': 'Like this is super.'",
        "'speaker_2': 'And all the services should be available for all family members. The programs should be available for young ones and including their parents. Instead of calling 911 or calling the L.B. Long Beach Police Department, they should have a number where they can call the mental health services or mental health centers so that they can help them out and'",
        "'speaker_2': 'with the situation that needs to be de-escalated. Did we.'",
        "'speaker_4': 'Know? You know, you precious. Yeah. Yeah, well, not alternativa.'",
        "'speaker_2': 'Is happiness a competitor?'",
        "'speaker_4': 'And first of all. De La Ciudad where they do that? Yes. David, there's a simple foreign policy opponent. Bankruptcy until.'",
        "'speaker_2': 'Ten my common. I will like for the city budget to show. Money to be granted over to these mental health centers so that they can help these people, especially with therapy. And also, instead of calling the police, like I had mentioned earlier, they should be able to call them and get help.'",
        "'speaker_2': 'They should defund the police department 20%. This is the end of my comment. Gracias.'",
        "'speaker_3': 'Thank you. Your next speaker is clemency, Crespo.'",
        "'speaker_4': 'Allow them instead of. Of course, you.'",
        "'speaker_2': 'See them as this creature to get it is the goal. And that's what this Belarus Yellow Laboratory and Nicholas.'",
        "'speaker_4': 'Follow me on Twitter.'",
        "'speaker_2': 'Hi. My name is Clements Crespo, and I'm from District nine.'",
        "'speaker_4': 'That's why I keep for capital access alive for my family to bring this up money that.'",
        "'speaker_2': 'And I'm here because I. I support the information, the vital information for all our communities.'",
        "'speaker_4': 'Obama said both Army units are Keeping Them Honest, but that a piecemeal farcical.'",
        "'speaker_2': 'And I implore the city to put $2 million so that we can have this service of of equal support, equal access to all languages.'",
        "'speaker_4': 'At the homes of my son. You must have a better fear of Obama as a younger man.'",
        "'speaker_2': 'These meetings have shown us that we do need this translation and we do need this service.'",
        "'speaker_4': 'Not to bother Devon, the fed up each other, not their leader on that of in Kuala Interpret.'",
        "'speaker_2': 'I think our voices need to be heard and we also need adequate translation.'",
        "'speaker_4': 'But I thought it was a simple 5% policy to name a former programmer for less than $0.50.'",
        "'speaker_2': 'That is why I'm asking for defunding of the police department so that we can allocate this money to actual programs that the city needs.'",
        "'speaker_4': 'For your monthly phone bill. They can see you.'",
        "'speaker_2': 'For example, accessing languages and also for the justice system.'",
        "'speaker_4': 'Mental illness. I think almost all of us.'",
        "'speaker_2': 'Because we all need this, especially we need the councilmen and also the mayor to hear us.'",
        "'speaker_4': 'I'm a portrait of a Savoy Mori on the menu for the North. Taking up a setting for my parola policier.'",
        "'speaker_2': 'I got stopped by the police, and now I have to go to court. And I'm very scared. I do not know what's going to happen once they get to the courthouse.'",
        "'speaker_4': 'Criminal criminality can make it that only Carol. But Carol, it's always fun to play for families and families and then for you to.'",
        "'speaker_2': 'This is the first time I get I get stopped by the Long Beach Police Department. They took my car. I just need somebody to hear me out. I need this to be stopped.'",
        "'speaker_4': 'Watch out for my commentary. I'm one of you.'",
        "'speaker_2': 'Thank you very much. This ends my commentary. Have a good day.'",
        "'speaker_3': 'Thank you. Our next speaker is Magnolia Rodriguez.'",
        "'speaker_4': 'When a notion watching it, which is an economical hit of land sovereignty in the end here that I would say to you that the entire.'",
        "'speaker_2': 'Hi. My name is Magnolia Rodriguez, and I want to address the mayor and also the councilman about the experience I had in the last meeting.'",
        "'speaker_4': 'Lost brother, Boris Peck, on the other hand is 70. So it can be a minor thing that most experiences when the. If they really keep getting most of the people per mundane thing, it doesn't seem.'",
        "'speaker_2': 'In the last meetings we had, we had different interpreters. We have not had the same interpreter, so it has not been a pleasant experience. We want to have a team that's going to be able to interpret all our meetings.'",
        "'speaker_4': 'But I've been there roaming for my own for exactly three.'",
        "'speaker_2': 'So that the information that they're interpreting is accurate and correct.'",
        "'speaker_4': 'Zambian kettle black EPA, the utility's. Okay, your circular policy is important. That Zambian company does better than the employees over that filtration area. Necesitan. I use the como departamento de salud. Let me look at the fundamentals. But for their affinity, yes, they must ponder the of Beyonc's the removal of policy on the policy.'",
        "'speaker_2': 'I know that the police department is important, but I also see the need for the health department and also mental health and other departments that are more crucial to the city. So that is why I am asking for a 20% defund of the police department.'",
        "'speaker_4': 'Muchas gracias. Thanks.'",
        "'speaker_2': 'Thank you very much for your attention and my column.'",
        "'speaker_3': 'Thank you. That concludes public comment.'",
        "'speaker_2': 'Okay. Mr.. Mr.. Quirk, that concludes public comment and the council meeting is adjourned. That was the last item and we will have next one moving on to the next week. And then, of course, I hope everyone enjoys their Labor Day, especially all the hard working folks that we celebrate that day for and for them.'",
        "'speaker_2': 'Thank them for their labors. Have a great, great weekend and we'll see everyone next week. Thank you.'",
        "'speaker_1': 'Mayor. In order to layer over the item, we need a vote.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'I'll move. Three, five.'",
        "'speaker_2': 'Nine. Well, roll call vote.'",
        "'speaker_1': 'District one. District two. District three. District, for.'",
        "'speaker_2': 'Instance.'",
        "'speaker_1': 'District five.'",
        "'speaker_0': 'By.'",
        "'speaker_1': 'District six.'",
        "'speaker_2': 'By.'",
        "'speaker_1': 'District seven.'",
        "'speaker_0': 'Yeah. District eight. Just try.'",
        "'speaker_1': 'District nine.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'One more. Try to win one more person, one more council member.'",
        "'speaker_2': 'And our taking these other.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Oh, no. Yeah.'",
        "'speaker_0': 'Sorry, Mr.. May I?'",
        "'speaker_1': 'Excellent. District three. Motion carries.'",
        "'speaker_2': 'Perfect.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Cosmo Ranga has been a meeting. Then I. Council member. The motion passed.'",
        "'speaker_1': 'Five five.'",
        "'speaker_0': 'We got five eye votes. And at number four, your father.'",
        "'speaker_1': 'And I and the House are.'",
        "'speaker_0': 'Yes, I.'",
        "'speaker_1': 'I wanted to also. And I.'",
        "'speaker_2': 'Thank you very much. Always emotionally.'",
        "'speaker_1': 'The motion was to lay the item over to the next meeting.'",
        "'speaker_2': 'At what budget?'",
        "'speaker_1': '15. The budget hearing.'",
        "'speaker_2': 'Yeah. Okay. Yeah, I.'",
        "'speaker_1': 'You're an I as well. Thank you. Motion carriers will adjourn the meeting. Thank you. Yeah.'"
    ]
}