{
    "Recommendation to declare ordinance amending the Long Beach Municipal Code by amending Table 31-2A, residential development standards, and by adding Section 21.31.255.F, relating to development and design standards applicable to properties in the R-1-L zoning district, read and adopted as read.  (District 8)": [
        "'speaker_0': 'So that concludes our presentations. We'll get right into the city council meeting. We have one hearing this evening. Madam Clerk, would you mind reading this item?'",
        "'speaker_1': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and accept categorical exemption number. See 16340 and declare ordinance amending table 31 dash to a residential development standards in Section 21.31.255 of Title 21 of the Long Beach Municipal Code relating to development and design standards applicable to properties in the R-1 Zoning'",
        "'speaker_1': 'District. Read for the first time and laid over to the next regular meeting of the City Council for Final Reading District eight.'",
        "'speaker_0': 'Thank you, Mr. West.'",
        "'speaker_2': 'Thank you. Members of the City Council. The staff report was given by Linda Tatum.'",
        "'speaker_8': 'Good evening. Vice Mayor Richardson and members of the city council staff is here this afternoon to present a zoning code amendment that is was requested by city council. And I'd like to provide a brief recommendation and staff presentation and some of the recommendations that came out of this effort.'",
        "'speaker_8': 'This area is for the area of the city that is zoned r one. L This is generally known as the Virginia Country Club area of the city, or Los Cerritos, depending on who you talk to. This area is very unique in the city in that it is the only area in the city that is zoned r one'",
        "'speaker_8': 'IL and there are 6647 properties in this area. And the area is generally bound by country club, country club drive on the north and on the west, and there are a couple of discontinuous parcels in that neighborhood. The first one is the area that I'm pointing to here.'",
        "'speaker_8': 'If you could see the red dot, that area is just directly north of the Virginia. I'm sorry, the lower cerritos. The lower cerritos. The loss of real property. That area is discontinuous from the rest of the property and then on the north and east of the property, it's called Country Club Lane.'",
        "'speaker_8': 'If you could see that area there, that area is off of Long Beach Boulevard. So included in that 647 properties are all of these properties. And this area is very unique, as I mentioned earlier, as it's the only area in the city that zoned r one ill.'",
        "'speaker_8': 'And this area was very specifically designated as a unique area for the purpose, because it it does have the very the most largest lots in the city. And it's also designated in the zoning code specifically for large lot and large estate homes.'",
        "'speaker_8': 'It was designated that way in the city's general plan. And that's clearly the intent of this area to have the very expansive an estate type homes. Just to give you a few facts and figures about this area, the area the approximate lot size in this area or the average lot size of those 647 is approximately one 1100'",
        "'speaker_8': 'square feet I'm sorry, 11,000 square feet. That's the average lot size in the area. However, within that area, the the lot size is very everything from as small as 8000 all the way up to more than 30,000 square feet.'",
        "'speaker_8': 'So you can see it's quite a range of lot sizes that are encompassed within the neighborhood. And likewise there's a large variety of home sizes in the neighborhood and that varies. Everything from less than 2000 square feet all the way up to the largest home in the neighborhood is approximately it's just over 8000 square feet.'",
        "'speaker_8': 'So we talked a little bit about the unique character of the neighborhood and how it's designated in the zoning code specifically for large lot in a state properties. Just to give you a little bit of history on this, back in September of 2015, the city council adopted a moratorium for this area, and that moratorium was in response'",
        "'speaker_8': 'to a a request by the neighborhood to have the city staff look at the zoning and development standards for the area, specifically as they relate it to neighborhood character. And that included issues or concerns regarding the sizes of the homes, the setbacks and other development standards that are currently in the city's zoning code.'",
        "'speaker_8': 'That moratorium limited development in the neighborhood to no more than 1500 square feet until such time as the City Council could act on recommendations for potential changes to the zoning development standards from the city staff and the City Planning Commission.'",
        "'speaker_8': 'In August of 2016, the City Council extended that moratorium in order to allow staff additional time to work with the community residents. So I'd just like to briefly go over this timeline. During that period, the staff was engaged in extensive outreach with the neighborhood.'",
        "'speaker_8': 'That outreach included a number of meetings with the Low Cerritos Preservation Committee in the neighborhood, and we also had a series of public meetings. And during those public meetings, we had the first of those public meetings was in September of 2016, when staff essentially had a listening session to hear for the first time in a broad community'",
        "'speaker_8': 'settings, some of the concerns from the neighbors. And the second meeting that we had was in November of 2016. And the purpose of that meeting was to provide preliminary recommendations about the zoning code standards that staff recommended would be changed.'",
        "'speaker_8': 'We followed that up again in December with a study session with the city's planning commission. The initial proposed amendments were presented to the Planning Commission in a study session, and we followed that up with a public hearing before the Planning Commission in February of 2017.'",
        "'speaker_8': 'And there was a second planning commission public hearing in February of 2016. I'd just like to point out that during this entire period of time, staff did extensive research. We looked at other cities and development standards and other single family neighborhoods and other cities around the state and within the Los Angeles region.'",
        "'speaker_8': 'And we also communicated directly with members of the neighborhood and took feedback from the neighborhood. And those recommendations, based upon that extensive research in the regarding what's the existing conditions in the neighborhood, the homes sizes, the lot sizes, the potential impacts.'",
        "'speaker_8': 'We also brought in a an architect to to consult with us, to assist us in developing those standards. And the result of that is a series of recommendations that I'd like to walk through. Before I do that, though, I'd like to acknowledge that staff worked really hard, hard on this effort for the last year.'",
        "'speaker_8': 'And that team of staff was myself, including Mark Hungerford, who was the lead planner on this effort, and our current planning officer, who was Carrie Tai. And with that, I'd like to walk you through the recommendations that staff came up with.'",
        "'speaker_8': 'The first of those recommendations is a proposal to modify this, the front yard setback. And this graphic here shows you the orange, if you can. I don't know if you can see it clearly, but there's a difference. You can see in the existing front yard, setback has 20 feet, meaning the house has to be set back from'",
        "'speaker_8': 'the public, right where the sidewalk at least 20 feet staff's recommendation was that a 25 feet was to modify that to increase the setback by five feet. And this recommendation was strongly supported by the neighborhood. We did get some other opinions from the neighborhood, but this is the recommendation we settled on.'",
        "'speaker_8': 'And I just tell you, one of the other unique things about the low Cerritos neighborhood is the fact that this neighborhood uniquely has what we call special setbacks. So when we're saying modify the setback from 20 to 25 feet, that acknowledges that in some areas and on some streets in that particular neighborhood, they have a special setback'",
        "'speaker_8': 'that could be as large as a minimum of 20 and it can go all the way to 50 feet. So in this case, we're recommending that there be a minimum setback of 20, 25 feet for the front yard.'",
        "'speaker_8': 'The second recommendation that came out of our effort was a proposed side yard setback, and that side yard setback is currently at six feet. So that means on either side of your building, on the side property line, the minimum requirement is six feet.'",
        "'speaker_8': 'Staff's recommendation was bifurcated or broken into two parts four lots that were less than 60 feet. The recommendation was to maintain that that 60 feet. However, for lots that were greater than that had a larger street frontage than 60 feet, that that side yard set back be a minimum of ten feet or 15% of the lot with'",
        "'speaker_8': 'and that the idea there was to give greater privacy between between lots that had a a lot directly adjacent to them. So that is staff's proposal for the side yard setback. One other component of the side yard setback is we realize that on corner lots were lots that faced or street there was a need or there was'",
        "'speaker_8': 'a strong recommendation from the community that that on the street corners that there be a greater setback. And after looking at this again in some detail, the recommendation from staff was that on the corner setbacks, that that setback be increased to ten feet.'",
        "'speaker_8': 'And that's what you're seeing here in this slide. The orange, again, represents the increased setback and you can see it in a corner configuration here on the top, oops. On the top is a corner lot configuration. And on the bottom you can see when you have a front yard setback on a diagonal street such as San Antonio'",
        "'speaker_8': 'in the lower Cerritos community. Lastly, a lot of discussion was provided regarding the topic of floor area ratio. The floor area ratio is the mathematical relationship between the area of the dwelling and the size of the lot. Essentially what that does is is govern or to assure that there is some proportionality between the size of the unit'",
        "'speaker_8': 'and the size of the lot. The current floor area ratio in the city's standard across the entirety of the r1l zoning district is 8.6, which essentially means that you multiply by 0.6 the size of the lot. For example, if you had a 10,000 square foot lot at a point six FSR, you could build a 6000 square foot'",
        "'speaker_8': 'unit. So the current FFR recommended or the current FFR in the zoning code is point six. And staff's recommendation is that the are increase or decrease to be smaller to allow a smaller unit into that that go down to a point five.'",
        "'speaker_8': 'And again we bifurcated that so that four lots that were less than 15,000 square foot, they would have a 0.5 ratio. Again, to use the example, if your lot is a 10,000 square foot lot, the point five would reduce the size, the maximum size of the home to 8.5, which is a 5000 square foot home size.'",
        "'speaker_8': 'And what you can see here is generally within the neighborhood, we've calculated that the current average affair in the neighborhood is a point three for lot sizes, 0 to 15000. And the highest that exists out there today is a point seven within this lot size range.'",
        "'speaker_8': 'The second part of the FBR recommendation is for lots that are greater than 15,000 square feet. And in the neighborhood, there are 94 properties that are greater than 15,000 square feet. And that current air I talked about earlier is a point six.'",
        "'speaker_8': 'And the recommendation here is that the FAA, RB decreased to a point four. And again, just some facts and figures related to what's currently existing on the ground. The current FAA are in the neighborhood as a point to two.'",
        "'speaker_8': 'And the highest, if they are in the neighborhood, is a .43. That just gives you an idea of what's currently on the ground in the neighborhood. The last recommendation from staff was regarding the lot size. There was a lot of concern in the neighborhood that because a lot sizes are quite large related to other lots in the'",
        "'speaker_8': 'in the city. But not more importantly that if two large lots were merged, you could conceivably have a lot in the middle of the block that was completely out of scale and out of character with the rest of the block and conceivably with the rest of the neighborhood.'",
        "'speaker_8': 'In order to address this. Staff looked at the current minimum lot size standard, which is 12,000 square feet. And right now there is no maximum lot size standard, but there is a lot size minimum. So the proposal that staff is recommending is that there be a merger of no more than two lots in the neighborhood and that'",
        "'speaker_8': 'the merged lot site can. The merged lot size cannot exceed 20,000 square feet. And again, what you see in the detail here is just a breakdown of some of the things, the number of various lot sizes within the 0 to 15 category there.'",
        "'speaker_8': 'You can see that this is the size of most of the lots in the neighborhood. There are 553 lots within the 0 to 15 size standard and then there are 50 lots that are between 15 and 20,000 and there are 44 lots that are 20,000 square feet or greater.'",
        "'speaker_8': 'Lastly, in the what I've just reviewed for you were some of the development standards that relates the size and the the amount of lot or the amount of structure that could be built on the property. What I'd like to cover now really briefly are some of the design standards, and these relate to the look how the lot'",
        "'speaker_8': 'looks and how it relates to the surrounding properties. These are design standards and they are essentially pretty basic in terms of how when staff reviews a property, the kinds of things we look for. But these are not currently in the code and staffers recommending that these design standards be added.'",
        "'speaker_8': 'However, they're not added to every single new home that we consider reviewing, but they are only for the very largest lots. So this would apply if a home was proposed to be 5000 square feet in size or if it's within ten feet of its maximum FSR.'",
        "'speaker_8': 'And I'll briefly go through these. They are just that we would be looking to make sure that there is four sided architecture on the design that assures that someone, if they have a large home like this, that the that the architectural attention would go to all sides of the building and not just to the front.'",
        "'speaker_8': 'To maintain the integrity of the architectural style. The other one is related to making sure that there are not large expanses of blank walls without any articulation or any design features. So the second standard is to make sure or to make sure that no expanse of any wall greater than 25 feet occurs without some articulation or some'",
        "'speaker_8': 'design feature. That's the second standard. The third is that the primary facade or the primary interest to the building should be oriented to the street. And this precludes a property from having a front door on the side of the house.'",
        "'speaker_8': 'And again, it speaks to, again, best practices in terms of architectural design and neighborhood character, in terms of how the house is oriented to the street. And the other part of that relates to the height of the porches and the entryways to the home, that those not exceed 15 feet again, so that the front door has some'",
        "'speaker_8': 'relationship to the rest of the architecture of the building. And lastly, the the final design standard that staff thought was appropriate. Again, all of these are based upon feedback from the neighbors is the issue of privacy. So what we're asking is that for the second story, windows that the bedroom windows of the the proposed new structure not'",
        "'speaker_8': 'line up directly with the existing bedroom windows of the adjacent property. Again, this addresses the issue of privacy. So that concludes the standards that staff is recommending. I would just like to confirm or at least make sure that the that you're aware that these standards, if they are adopted by the city council, they, of course, would not'",
        "'speaker_8': 'be retroactive. They would not apply to any of the existing units or the design of any existing homes. However, they would apply if a property owner came in to build a new unit or an expansion of an existing unit.'",
        "'speaker_8': 'And again, these standards would only apply to the extent that the expansion or the new unit triggered any one of those particular standards that staff has recommended. With that, I'd like to conclude the staff's presentation and recommend that the City Council affirm the recommendation of the Planning Commission and accept categorical exemption number c e 16 340 and'",
        "'speaker_8': 'also that they approve this recommended zoning ordinance amendment to modify the five development standards that I just walked through, as well as the four design standards that were recommended. And that concludes staff's presentation. And Mark and myself are here to respond to any questions you might have.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you, Miss Tatum, for those comments. So now we will go to public comment. Is there any public comment on the proposal on this hearing?'",
        "'speaker_4': 'Good evening, Vice Mayor and members of the Council.'",
        "'speaker_7': 'My name is Karen Miller.'",
        "'speaker_4': 'I've lived in the Los Cerritos neighborhood for 20 years and I also sell real estate in.'",
        "'speaker_8': 'That little Cerritos.'",
        "'speaker_7': 'Neighborhood. I am here tonight to urge you to please support the recommendations by the planning staff. City planners have worked with preserve lists of widows for over two years, diligently to come up with compromises to help preserve the quality of our neighborhood, the green spaces.'",
        "'speaker_4': 'And also without infringing on any homeowners rights.'",
        "'speaker_7': 'I think we've got a pretty good plan.'",
        "'speaker_4': 'But you'll hear from people.'",
        "'speaker_8': 'Tonight that oppose it.'",
        "'speaker_4': 'And the reason I know this is I received this flier on Sunday.'",
        "'speaker_7': 'It says it all caps.'",
        "'speaker_4': 'Attention, homeowners.'",
        "'speaker_7': 'City Hall is trying to take your property. Well, that's.'",
        "'speaker_4': 'Just not true.'",
        "'speaker_7': 'I think what we've come up with is a.'",
        "'speaker_8': 'Very good plan. And I urge you to please support it.'",
        "'speaker_0': 'Thank you. Any further public comment? If anyone would like to speak on this matter, could you come forth now so that we have an understanding of how many people are expect to speak? All right, ma'am, I'll give you your name and go ahead and proceed.'",
        "'speaker_5': 'Hi. My name is Renee Hunt, and I live in the area that we're talking about. And first of all, thank you for the introduction for the Councilwoman Price for the New Year and Happy New Year. And in that uniqueness that we celebrated tonight, our neighborhood is a unique neighborhood and 85 plus years, I know my home is'",
        "'speaker_5': 'that old or near there. And I think the zoning that we have is really served us well, although I do appreciate the time and effort put in by the employees of the city and they have been very responsive and kind in their meetings and I appreciate that and very professional.'",
        "'speaker_5': 'I don't believe in limiting the use of the land, as we saw in the slides with the FAA, are reducing the fear that a property owner can use. Now, I don't think that's needed. And also as an interior designer, I have difficulty accepting the design treatment and finish restrictions.'",
        "'speaker_5': 'And I know some of my colleagues in like San Marino area and Pasadena have come across some of these issues for zoning that's happened there. And a lot of their clients have bought specifically for that neighborhood. But then when coming against these hurdles have decided to move out.'",
        "'speaker_5': 'It was just too much to follow through with the plans that they had. So I think that. It wouldn't be fair. Our neighborhood. Well, I think we've done great so far. It's a desired neighborhood and I think the zoning has done as well so far.'",
        "'speaker_5': 'So I hope you would consider that in your votes. And I appreciate your time.'",
        "'speaker_0': 'Thank you. Next speaker, please. And if everyone could come a little bit closer. So we have an understanding on how many people are lined up to speak.'",
        "'speaker_7': 'Hi, I'm Polly Thomas. I've lived in Long Beach for 32 years. This is the third time in all that that I've spoken at a city council meeting. So it's a rare occurrence and it's also very nerve wracking. It takes a lot to come down here to speak.'",
        "'speaker_7': 'I am concerned about this proposal. And the first part, I do consider it a taking of the property because the homeowners will not be able to use it as they were able to use it. 10 minutes before your vote.'",
        "'speaker_7': 'So that's one thing. The second thing is that I am surprised that this is not being handled as a zone code, which usually requires, if I understand correctly, the signature of every homeowner. But it's been explained to me by the Planning Department who I will say have all been very professional, polite and friendly and a pleasure to'",
        "'speaker_7': 'do, to work with. But it was explained to me that they got around that requirement by calling it a zone code amendment, and for that reason, it doesn't require every homeowner's signature. So I am perplexed as to why you would even want to do that when we are limiting what homeowners can do on their property that they'",
        "'speaker_7': 'own the. The second thing is that I just want to thank you for your time and consideration. And I do think that someone said here that they had been working on this for two years. And the first inkling I received of this was in August of 2015 and did reach out to the planning department, but there was'",
        "'speaker_7': 'a changeover and who was handling the project. So no one was involved in an opposition to this matter until really October of 2016. And I think that that is remiss and something that we should take into consideration before making such sweeping changes for this district.'",
        "'speaker_7': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Jeanie Williamson I've been a resident of the Virginia Country Club area for 35 years, and this has been interesting for me to to be in the committee. I have a couple of hats here tonight. I'm on the board of the ALCINA, which is the Little Cerritos Neighborhood Association, in which you'll hear from later, because we do support'",
        "'speaker_7': 'this, you know, and we have we are a neighborhood association of the whole r1l not just portion of it all the whole part, but also is being on the committee. And I got to tell you, a couple of years ago, okay, 30 figure 35 years of the neighborhood and this I one as held up well until about'",
        "'speaker_7': 'five years ago then we started seeing homes built on the whole lot, you know, and especially on a main street where as a corner house itself, there was only supposed to be a four foot leeway with that's hardly room from the sidewalk with you're not hitting a wall then and taking up the whole area now envision the'",
        "'speaker_7': 'peninsula, okay, in Long Beach where they've taken the single story homes and they put the home on that whole lot up there. That's what we're starting to see. And I'm. Are you going to see like two homes like that that totally takes away from the character of our neighborhood and the front yard and the spaciousness and that'",
        "'speaker_7': 'country club kind of feeling that we all buy into. It's one of your last remaining areas of Long Beach that is like that. And what makes me sad is to see neighbors now who have said that they haven't been informed.'",
        "'speaker_7': 'But this has been an excellent process the whole time we've been talking in the concerts in the park. We've gotten our 300 signatures last summer, 200 more signatures. When you talk one on one, they understand. Like when I first started this process, I didn't know what an FA was, you know, but now, now I understand it and'",
        "'speaker_7': 'now I can see it. And it is to maintain that because what I wanted to try to express to you is up until now, the r1l has worked, but you have developers, you have speculators moving in like you see, they find a small home, they'll build up the two stories, you know, and it will become like the'",
        "'speaker_7': 'peninsula. And like many, many areas of Los Angeles, like you see along the beach areas and I'm sat with my neighbors the misconceptions that they may have. And I like to encourage you if there's something that you don't understand and I know you do this anyway, but if there's something specific that you hear that you don't understand'",
        "'speaker_7': ', please ask Linda or Mark, you know, and they will really clear it up for you. I like for you to understand it. Thank you for your time. And oh, I want to add one less thing about design. You know, if you look at these designs that the Planning Department has added into that, you know, we were basically'",
        "'speaker_7': 'are setbacks and front setbacks and all that really. You know, it's what designers are going to have a problem with your window looking into your neighbors window. I think these are very simple, cated, simple designs, not specifically going to hurt any particular type of architecture.'",
        "'speaker_7': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening.'",
        "'speaker_8': 'Honorable council members and vice.'",
        "'speaker_7': 'Mayor. My name is Barbara showing 4120 Locust Avenue. We've lived in our home since 1972 in Virginia Country Club and we love the neighborhood.'",
        "'speaker_4': 'When we came for you about a year and a half ago to.'",
        "'speaker_8': 'Ask for the moratorium, as I recall, several of you actually.'",
        "'speaker_4': 'Mentioned you were particularly.'",
        "'speaker_8': 'Interested in this issue because mansion ization.'",
        "'speaker_7': 'Has become an issue not just in Los Cerritos, but in parts other parts of Long Beach. I was talking to a friend who lives in Castle Heights. She said, I don't want mansions.'",
        "'speaker_4': 'In my neighborhood.'",
        "'speaker_8': 'I see the and they have a historic district. So there.'",
        "'speaker_4': 'But in in Belmont Heights and Park Estates and there are other.'",
        "'speaker_8': 'Areas of the.'",
        "'speaker_4': 'City where I know that this.'",
        "'speaker_8': 'Is also an issue. So what we do in Los Cerritos may be an example, but it's not just here. It's all over Los Angeles County.'",
        "'speaker_4': 'If you read The Times, you see it all the time where communities are concerned about this.'",
        "'speaker_8': 'As was mentioned.'",
        "'speaker_4': 'Before, we were concerned.'",
        "'speaker_1': 'About flippers.'",
        "'speaker_7': 'Coming in, buying a little house, building a big one, making lots of money and leaving. And that's not in the.'",
        "'speaker_1': 'Best interest of the.'",
        "'speaker_7': 'Neighborhood. I wanted to also thank the staff. Mark and Linda and Carrie have been phenomenal. They've come out, they've walked around. They've seen our.'",
        "'speaker_8': 'Concern. They've worked with us very carefully.'",
        "'speaker_4': 'We get everything we want it know. Do they know? We work together and negotiated to. We came up with.'",
        "'speaker_7': 'What we think all.'",
        "'speaker_8': 'Think are very.'",
        "'speaker_4': 'Reasonable standards.'",
        "'speaker_8': 'And so we feel that with the staff we've come up with modest.'",
        "'speaker_4': 'Yet reasonable modifications to prevent inappropriately oversize.'",
        "'speaker_5': 'Homes.'",
        "'speaker_4': 'And I want to make clear one other thing, because there seems to.'",
        "'speaker_6': 'Be some misunderstanding.'",
        "'speaker_7': 'And that is.'",
        "'speaker_4': 'That only if you're in a historic.'",
        "'speaker_8': 'District or you will have a formal homeowners association.'",
        "'speaker_4': 'Like Park Estates do.'",
        "'speaker_7': 'Can the city have any control over the type of architectural design features? We have a neighborhood association, as was mentioned, but we can't control what kind of roof, what kind of siding, what kind of windows?'",
        "'speaker_8': 'Nothing like that.'",
        "'speaker_7': 'Only historic districts and homeowners associations can do that. So with that.'",
        "'speaker_8': 'I'll just thank you for.'",
        "'speaker_7': 'Their time and urge you to adopt the recommendations. And I want to.'",
        "'speaker_4': 'Particularly thank our.'",
        "'speaker_1': 'Wasden, because you've been wonderful.'",
        "'speaker_8': 'Listening to us, I think listening to everybody.'",
        "'speaker_4': 'And hearing all of our concerns.'",
        "'speaker_7': 'And so l thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'Esteemed Council persons and Vice Mayor Richardson. My name is Stacy McDaniel.'",
        "'speaker_4': 'I reside at 4110 Cedar Avenue.'",
        "'speaker_5': 'I'm also a member of the Preserve Lost three.'",
        "'speaker_4': 'This committee formed when over 200 of our.'",
        "'speaker_5': 'Neighbors voiced opposition.'",
        "'speaker_4': 'To some of the new construction being built in the.'",
        "'speaker_5': 'Neighborhood. I support.'",
        "'speaker_4': 'The changes to the R-1 L zoning.'",
        "'speaker_5': 'Standards and commend.'",
        "'speaker_8': 'The Planning Department for their professionalism.'",
        "'speaker_5': 'And extensive outreach to the.'",
        "'speaker_4': 'Community. Would all those in the audience who.'",
        "'speaker_5': 'Also support these changes briefly stand? Thank you.'",
        "'speaker_4': 'The proposed changes are all about controlling out of scale development and have nothing to do with imposing design standards on the neighborhood.'",
        "'speaker_5': 'This is what I look at every day. After the.'",
        "'speaker_4': 'Prior owners of my the next door house who bought an existing.'",
        "'speaker_8': 'One story home.'",
        "'speaker_4': 'Built it.'",
        "'speaker_5': 'To the maximum degree.'",
        "'speaker_4': 'Permitted under the current.'",
        "'speaker_5': 'Standards and flip it. Our property is a third in the shadow about half of the year caused by this plaster chunk.'",
        "'speaker_8': 'These are some examples of what our.'",
        "'speaker_4': 'Neighbors are concerned about. Basically homes that do not fit the scale of the neighborhood. Even this one, which tends to be the lightning.'",
        "'speaker_5': 'Rod for controversy, might be okay if it was up by.'",
        "'speaker_4': 'The country club. But the fact of the matter is that it was built in the middle of a.'",
        "'speaker_5': 'Block on three aggregated lots, and it's grossly out of.'",
        "'speaker_4': 'Scale to its neighbors.'",
        "'speaker_5': 'It is, in fact, almost.'",
        "'speaker_4': 'Four times larger than the adjacent neighbors. There's nothing personal against that owner or any owner or opposition.'",
        "'speaker_5': 'As to the impact to the neighborhood. Our opponents speculate that property.'",
        "'speaker_4': 'Values will go down by enacting the proposed changes, but the documents we've already provided you.'",
        "'speaker_5': 'Disprove that assumption. Our opponents.'",
        "'speaker_4': 'Also claim that we are a small band of.'",
        "'speaker_5': 'Dissatisfied retirees with an ax to grind against certain architectural standards.'",
        "'speaker_4': 'Had they participated in the numerous public meetings and public discussions of this issue, or.'",
        "'speaker_5': 'Even if they were active in.'",
        "'speaker_4': 'Community life here in the neighborhood, they would know that the vast majority.'",
        "'speaker_5': 'Of the residents of low spirited support these changes.'",
        "'speaker_4': 'This is just a partial list of over the 400 people that signed petitions in favor of these types of curbs on mansion ization. The proposed changes are consistent with and not in opposition to the general plan. In fact, the r1l zoning area was created in 1980 in recognition of the unique character of the Low Streets area with'",
        "'speaker_4': 'its.'",
        "'speaker_8': 'Quote, open, uncrowded living environment.'",
        "'speaker_4': 'Indeed, the.'",
        "'speaker_8': 'Last time this.'",
        "'speaker_4': 'Council considered the mansion ization issue in 2007, when Belmont Shore and Belmont Heights.'",
        "'speaker_8': 'Were the poster.'",
        "'speaker_4': 'Child for Mansion Association, your standing directive to the Planning Department was to come up with additional rules to prevent mansion exemption as needed.'",
        "'speaker_0': 'Thank you. Thank you for your time.'",
        "'speaker_4': '3 minutes. The proposed changes do an admirable job of this and we support them. Please vote yes.'",
        "'speaker_0': 'Thank you so much. And just an employee. When we when the clapping happens, it actually cuts into the next speaker's comments. Next speaker, please.'",
        "'speaker_2': 'Members of the city council. My name is Richard Ivey. I represent the Las Vegas Neighborhood Association, which supports this effort by the city planning staff and the planning commissioners. That will most certainly help preserve the character and home values in this neighborhood.'",
        "'speaker_2': 'The Las Vegas Neighborhood Association represents. We request that the city council approve the r1l standards changes as proposed by the city planning staff and as approved by the Planning Commission. The proposed changes are the culmination of a two year effort that was begun by City Council action and enacted by the planning staff.'",
        "'speaker_2': 'The proposed changes are not the result of a knee jerk reaction, but a measured response to professionals who have addressed the issues. The planning staff took charge, investigated the standards, toured the neighborhood, held community outreach meetings, and independently formulated these standards that will help preserve.'",
        "'speaker_2': 'The character of our wonderful neighborhood. We appreciate the planning, staff's dedication, professionalism in bringing these recommendations before you. The any hopes that you will vote to enact these standards as proposed. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Hi. My name is Kevin Case. I live on Locust. I had a lot more to say, but I think it's mostly been said. But one thing that is interesting for me is, yes, I've lived in the neighborhood a long time, over 27 years.'",
        "'speaker_2': 'But four years ago I moved and when I did that, I didn't choose to go somewhere else like that. I'm not sure Naples or even Manhattan Beach stayed in the same neighborhood, moved three blocks away. And that was only because of the charm, the character of the neighbors.'",
        "'speaker_2': 'It's wide streets, old trees and open views. It's a wonderful.'",
        "'speaker_11': 'Place and we'd like to see it stay similar.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Thank you next week. And please.'",
        "'speaker_2': 'Good evening, Mayor and Council. My name is Larry Tidwell. I'm an architect and I've lived in this neighborhood for over 25 years. As other people have said, it's the character of the neighborhood we're trying to preserve here, that the wide open spaces, the large setbacks, the architectural character of many different styles of homes in the neighborhood that'",
        "'speaker_2': 'were built not by one developer, but by individual owners and architects over a span of many decades. So we have a great variety of eclectic style of homes, but they all they're all respective of each other and they're neighbors.'",
        "'speaker_2': 'So nobody's house looms over another house. And these changes to the zoning code clarify the character of the neighborhood better than the current zoning requirements do by reducing the floor area ratio and increasing the setbacks it makes. The written language of the code match the reality of almost all the homes in the neighborhood today.'",
        "'speaker_2': 'So by adopting these changes, we preserve what's there. We don't limit the character and the design and the architecture of homes, but just make sure that everybody can be respectful of each species, their neighbors and the whole community in which we all live.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next picture, please.'",
        "'speaker_9': 'Vice Mayor Richardson and Honorable City Councilmembers. My name is Jim McDaniel. I live on Cedar Avenue. I'd like to thank the staff of Councilman Al Austin and Councilman Austin himself, the planning commission, the the staff of the Planning Department and the residents of those three for all the work that has been put into this effort.'",
        "'speaker_9': 'I'm speaking tonight in support of the staff recommendation for changes to the R-1 L Zone Development and Design Standards. The proposed standards are designed to allow for a great variety of architectural styles that make our neighborhoods so special.'",
        "'speaker_9': 'They do not impose any sort of specific architectural style requirement on our neighborhood. This is not an attempt to Irvine ize our neighborhood. In fact, it will probably just do the opposite by restricting large slab sited structures that pervade much of Orange County in the San Gabriel Valley and encourage thoughtfully designed homes in scale with their neighbors'",
        "'speaker_9': '. The proposed standards protect setbacks and traditional house massing to better preserve the character of the neighborhood. When large two storey walls are built with minimal setbacks, light and air are restricted from neighboring homes. These standards will help keep structures from impinging on the light and air space from of adjacent properties.'",
        "'speaker_9': 'The proposed standards will still allow houses of significant size as long as they are in scale with the lots in which they're being built. The planning staff has told us that the average house size and low cerritos is 2850 square feet, more or less, and that the largest home in the neighborhood is around 8400 square feet.'",
        "'speaker_9': 'Under the proposed standards, homes on our largest lots could be as large as 16,000 square feet, which is much larger than anything now existing and on a more typical large lot. You could still build homes of 6000 square feet, which is large compared to the neighborhood.'",
        "'speaker_9': 'The proposed standards will protect and improve our property values. Cities such as Arcadia, where marginalization was not addressed, have seen a drop in property values compared to neighboring communities such as Sierra madre, where sensible standards were implemented. This update to the development standards is urgently required now due to market forces.'",
        "'speaker_9': 'As property values across Southern California continue to rise. Speculators are looking at neighborhoods like ours to tear down older, smaller houses and build structures that maximize house size. Minimum costs, oftentimes on small lots. This is already happening in our neighborhood, and it's not adding to home values.'",
        "'speaker_9': 'In closing, I would like to commend the professionalism of the Planning Department staff. This has been a long effort and much patience has been required from all involved. We believe that the proposal that is before you this evening is a result of a compromise in the best tradition of that word that addresses all the interests that were'",
        "'speaker_9': 'brought forward. Some of the neighbors may not have gotten all they wanted. Others may feel this goes too far. But this is a solid proposal that was carefully crafted and considered by the staff and large numbers of neighbors dedicated over the last 24 months.'",
        "'speaker_9': 'And it deserves your support. Thank you.'",
        "'speaker_0': 'Thank you so much for your time. So seeing no further public comment, we're going to close the hearing and take it back behind the rail. Councilman Austin.'",
        "'speaker_11': 'Thank you. And I want to thank all of the residents who took time out to come out and give testimony this evening on this hearing, as well as those of you who have met with me in my office and the coffee over coffee and throughout the neighborhood.'",
        "'speaker_11': 'I've received a number of input from residents over the past several months. In the spring of 2015, I was approached by a group of residents from the Lower Cerritos neighborhood who had concerns about some of the new homes that were being built.'",
        "'speaker_11': 'And they wanted to revise the development standards for their neighborhood. They had done some research and collect the signatures from many neighbors. Rosarito, north of Bixby Road, is the only neighborhood in the city that has our one el zone designated for large lots.'",
        "'speaker_11': 'I was willing to entertain the discussion and in July of 2015, the City Council approved a motion to start the process to put a moratorium in place. The request, the planning staff and the Planning Commission to review the issue, meet with the community and make recommendations to the City Council.'",
        "'speaker_11': 'More than a year and a half later, we're here tonight. I must say upfront that the planning staff has done an excellent job on this and has put far more time than I originally expected it would take. I would especially like to thank Linda Tatum, Karie Tai and Mark Underwood for their Hungerford, for their efforts.'",
        "'speaker_11': 'They had several meetings with the groups of registered residents, both for and against the changes. They held two community meetings where all 647 homeowners were invited. They brought in a consultant to help facilitate the Community Meetings. Plan Commission conducted a public study session on the issue last December and held hearings last month to vote on.'",
        "'speaker_11': 'Commendations. And so more after more than a year and a half with plenty of public input input as staff work on this issue. We're here tonight. However, I still believe that there are two outstanding issues. And number one.'",
        "'speaker_11': 'Is there consensus among the homeowners in the neighborhood for these changes? The number two, is there a need for these changes? On the first question, it appears that there is not. Obviously, from the public comment here, there are people on both sides of this.'",
        "'speaker_11': 'I received a number of email correspondences and they are both for and against. And so I don't think there's consensus on this issue. As the process has moved along, I've spoken with more residents who have concerns about what is being proposed.'",
        "'speaker_11': 'Some who said that they've signed a position, they signed a petition at the beginning and now they don't agree with what's being proposed. I personally am uncomfortable with fully embracing the changes to neighborhood zones requirements that is not fully embraced by the neighborhood itself.'",
        "'speaker_11': 'On the second question, is there a real need for changes? I'm not yet convinced of this either. According to planning staff of the 25 largest homes in a neighborhood, a lots of up to 15,000 square feet. Only one was built since 1990.'",
        "'speaker_11': 'Of the 25 largest homes, a loss of more than 15,000 square feet. Only two were built since the year 2000, and there have been only three permits issued in the past ten years for the construction of new homes, and only 12 have been issued permits for additions of more than 1000 square feet in the last ten years'",
        "'speaker_11': '. We are not seeing a major transformation of the neighborhood that is being experienced in some cities that have adopted mass immunization ordinances. I know that there's one home in the neighborhood that's been a focus of much of the drive against marginalization.'",
        "'speaker_11': 'There's some incremental and I believe that there are some incremental steps that we can take to not have similar homes built in the little Cerritos neighborhood. From the beginning, I've heard far more consensus against a lot mergers, and I support the Planning Commission's recommendations proposing a restriction to no lot more mergers of more than two lots or'",
        "'speaker_11': 'exceeding a total of 20,000 square feet. I also believe that increasing the front yard set back from 20 feet to 25 feet is consistent with what is already exist in the neighborhood. And so I don't have a problem with that.'",
        "'speaker_11': 'Finally, the Planning Commission recommended some additional design standards for new proposed large homes, which I believe there's a general support for. The other proposed new restrictions on saleyards, set backs and reducing floor area ratios or if they are, would make some current homes in a neighborhood that many consider to be quality homes out of compliance with the'",
        "'speaker_11': 'new standards. There are approximately 18 homes that currently exist, all of which were built prior to 1985. That would become non-conforming by just reducing the FHA from 6.602.50. And there are many more long standing homes that will become non-conforming because of the proposed site setbacks.'",
        "'speaker_11': 'Under the proposed standards. I know many of the homeowners have concerns about the proposed changes, and I believe that the incremental approach is the most prudent approach at this time, and it may not completely satisfy everyone. But again, I don't see a neighborhood.'",
        "'speaker_11': 'I don't like to see a neighborhood divided against itself, which this discussion has done, unfortunately. The city is currently going through an update of our land use element and after that we'll be revising our entire zoning ordinance. And if we find a problem that arises in the next few years, I don't currently see which I don't currently'",
        "'speaker_11': 'see, there will be another opportunity to address the zoning standards at that time and much of the legwork. Fortunately has already been done. I do appreciate the input of the many residents and the work of the Planning Commission staff and the Planning Commission itself during this process.'",
        "'speaker_11': 'Therefore, I'd like to make a motion. To receive the supporting documentation into the record, conclude the public hearing and accept category categorical exemption number. See $16 340. Hold on. And to clear the ordinance amending Table three 31.2 A of the Long Beach Municipal Code Residential Development Standards amended to establish a 25 foot minimum front yard setback and'",
        "'speaker_11': 'amend Table 31 to a in the notes section of the table to indicate that lots created three land subdivision or lot merger shall not exceed 20,000 square feet and the lot merger shall not be comprised of more than two lots and omitted that amend section 21.30 1.255 of the Municipal Cook Code Municipal Code relating to the design'",
        "'speaker_11': 'treatment and finish to add subsections f one through four as set forth in the draft ordinance submitted to the Council for its consideration tonight, read for the first time and laid over to the next regular meeting of the City Council for Final Reading.'",
        "'speaker_11': 'And that is my motion.'",
        "'speaker_0': 'Thank you. Councilman Austin, city attorney. Did you get that, Mr. Mays? You get that. Okay, Councilman, you ringa.'",
        "'speaker_3': 'Thank you, Vice Mayor. I just want to commend everybody involved, staff council member Austin and people in the public for their engagement in this in this effort. It's been a long time coming. And I think that the plan, as it is currently adopted or proposed to be adopted is a is the end of all the discussions that'",
        "'speaker_3': 'have been taking place. And I'm glad to see that there has been some agreement, mostly agreement on the on the proposed plans, I think, in this.'",
        "'speaker_0': 'Thank you. Councilman. Councilman. Mongo.'",
        "'speaker_4': 'So I at the very end, I know there was a little bit of a change of what I had read before. So you're taking out two items. The Lots. No, we tell that little end part, but it was really long in the very.'",
        "'speaker_11': 'Way I am proposing or my motion is to accept everything proposed or recommended by the Planning Commission except the side lot. So back setbacks as well as the floor area ratio recommendations, but everything else.'",
        "'speaker_4': 'So then the status quo on those two items would remain in effect, right? Okay. So the fifth District has had a lot of discussion around double lots and things like that as well. And so I just wanted to offer a point of clarification to the city manager.'",
        "'speaker_4': 'It sounds as though that the decision being made tonight is only on. Well, first, I should start with how many districts in the city fall under this zone? How many groups besides these 400 homes?'",
        "'speaker_8': 'There are no other districts in the city that have the same standards that are in this particular neighborhood, the r1l zone. This area, geographically, is the only location in the city that has this particular zoning.'",
        "'speaker_4': 'And are there any plans for any other areas to have this kind of zoning? No, I think this goes to a bit about what some of our residents were saying tonight about the misinformation that's out in the community.'",
        "'speaker_4': 'In the fifth district, we have double lots, but they are not r1l zones. And so the the comments and dialogs that I had actually when I bumped into someone at the grocery store today and the coffee shop and the UPS store were a little bit confused because I think that people believe that anything that happens in one'",
        "'speaker_4': 'part of the city is for the whole city. And I think that it's really important for people to know that each part of our city is very different. The city of Long Beach is as big as I mean, some cities in L.A. County are one 1/40 of the size of the city of Long Beach.'",
        "'speaker_4': 'So this is not a process for anything other than the 400 homes in this particular area. And then I just wanted to ask one additional follow up question. Should there be a time where a resident wants an exception to what we passed tonight?'",
        "'speaker_4': 'What would that process look like?'",
        "'speaker_8': 'There is a process in the zoning code called a variance procedure. However, it is very limited to a very unique situation, such as an irregular lot size or a lot size that has or a lot that has an unusual slope.'",
        "'speaker_8': 'Some other shape issue or geographical issue, but not just convenience. It's intended to be very unique and limited in its application.'",
        "'speaker_4': 'So if someone wanted an exception that lived in that area and they thought that it was worthy of consideration, would they be able to bring it to or would their council member or another councilmember be able to bring it to this board and get five votes and change that?'",
        "'speaker_4': 'Or would they need to change it.'",
        "'speaker_8': 'For the whole area? I would have to say it would really depend upon the circumstance in the situation because for one unique lot, it likely may not warrant a change to the code, but that is the kind of thing that staff would look at and examine.'",
        "'speaker_8': 'And if we felt that a change to the code was warranted, it would likely go forward as a recommended code change rather than just an action on an individual property.'",
        "'speaker_4': 'And that is very unique. And to your knowledge, we have not been doing that here in the city of Long Beach.'",
        "'speaker_8': 'That is correct.'",
        "'speaker_4': 'Wonderful. And that's all my questions. And I'll be supporting the motion. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Austin.'",
        "'speaker_11': 'Thank you. I just like to, before we vote, just state how a little Cerritos Virginia Country Club neighborhood is one of the, I think, best in the city whether or not we approve this tonight. It is still one of the more desirable areas in the city to live in.'",
        "'speaker_11': 'It is an awesome community. My, my, my emotion was the spirit of the motion was to seek to get consensus and an a strike, a medium medium with the the community and the residents, because there is a lot of division on this issue in terms of property rights and existing homes that are there, amazing homes that, again'",
        "'speaker_11': ', if they were built today, would not fall into what is being proposed. What was proposed by the Planning Commission. And so understand whether or not you agree with the decision or not or the motion or not. Please understand that we put a lot of thought into this and we really looking to find a balance and something that'",
        "'speaker_11': 'that does preserve the quality and integrity and character of the Los Cerritos neighborhood. Members.'",
        "'speaker_0': 'Thank you, Councilman Austin. So and I'll just share that. This is a really beautiful neighborhood. This is a really nice neighborhood. I see why it's got so much interest in it. I think Councilman Alston has done a good job, will do with paid attention to the way folks have been engaged.'",
        "'speaker_0': 'Staff has done a great job on this. Sometimes, you know, when these things happen, you have you know, when issues come up, you try your best to build as much consensus as possible. And I like the approach of, you know, the things that have consensus and moving forward.'",
        "'speaker_0': 'It makes it a lot easier for me to support Councilman Alston with his motion. So I urge and I vote.'",
        "'speaker_10': 'Councilman Andrews Yes, and I also want to commend Councilman awesomeness motion here because the fact that I think when I retire I'm just thinking about moving that way. So.'",
        "'speaker_0': 'Thank you. No further comment. Members, please cast your vote.'",
        "'speaker_2': 'That's.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any subsequent amendments, with the March of Dimes California Chapter, to continue the Destined for Greatness Program and accept grant funding in an amount not to exceed $26,492, for the period of March 1, 2017 through February 28, 2018.  (Citywide)": [
        "'speaker_1': 'Motion carries eight zero.'",
        "'speaker_0': 'Thank you. Now we'll move on to item number ten with the clerk. Please read.'",
        "'speaker_1': 'Recommendation to authorize a city manager or designee to execute an agreement and any subsequent amendments with the March of Dimes California chapter to continue the. Destined for Greatness program and accept grant funding in the amount not to exceed 26,492 for the period of March 1st, 2017 through February 28th, 2018, citywide.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I think it's great that we are accepting grant funds. Just a point of clarification. Do we typically have every single grant come before this council or do we have an acceptance policy of amounts under a certain amount? I know that sometimes accepting grants or providing the letter of acceptance can be a barrier.'",
        "'speaker_4': 'And I want to make sure that we don't ever miss out.'",
        "'speaker_5': 'On money because of it.'",
        "'speaker_2': 'Thank you, Councilmember. That's a good question. We do have policies in place to allow city staff in many cases to apply for those grants and be very responsive and quick. However, the council does have the responsibility to accept any grant award and also to authorize.'",
        "'speaker_2': 'So you always see every grant when it's time to accept the awards and to authorize the city manager to sign the documents.'",
        "'speaker_4': 'Okay. We might want to explore providing department had the discretion up to a certain amount to accept funds so that we can make sure to be able to do that in the future. But at this time, I hope that everyone will be supportive of this opportunity to take the.'",
        "'speaker_8': '$26,000.'",
        "'speaker_4': 'And use our much needed programs.'",
        "'speaker_0': 'Thank you. Councilman Mungo's, any public comment on item number ten saying none.'",
        "'speaker_2': 'And Vice Mayor, if I may, we have to make a quick adjustment to the recommendation. Kelly Colletti.'",
        "'speaker_12': 'Yeah. So the reason this was pulled from consent is that the that the time frame of the contract was changed. And so with the original term of the agreement was to run from March 1st, 2017 through February 28, 2018.'",
        "'speaker_12': 'However, we recently notified that the term had been shortened by two months. So it's the same amount of money, the same services. But the term now for the grant will be from March 1st, 2017 through December 31, 2017.'",
        "'speaker_0': 'Perfect. Is that amended motion accepted? Sure. And I'll second it. Members, please cast your vote.'",
        "'speaker_1': 'Motion carries seven zero.'"
    ],
    "Recommendation to approve the use of the Sixth Council District's one-time infrastructure funds transferred from the Capital Projects Fund (CP) in the Public Works Department (PW) into the Legislative Department (LD) operating budget in the amount of $150,000 to support a partnership being entered into with Killing Fields Memorial Center, Inc., in order to develop the Killing Fields Memorial located at 1501 East Anaheim Street; and  Increase appropriation in the General Fund (GF) in the Legislative Department (LD) by $150,000.": [
        "'speaker_0': 'So we'll move right along. Next, we're going to be taking up item number 30. Clerk Please read.'",
        "'speaker_10': 'It. I will have to because I'm going to do an amendment on this. So I will be reading it.'",
        "'speaker_0': 'Oh, the clerk let the clerk read the item first, then you make the motion.'",
        "'speaker_10': 'No, no. Because I'm going to do an amendment on it. Oh, okay. Yes. Great. Fine. Thank you. Vice Mayor.'",
        "'speaker_2': 'No, I don't think it's fine. Go ahead.'",
        "'speaker_0': 'Tells me.'",
        "'speaker_2': 'Yes. Yes.'",
        "'speaker_0': 'Typically that typically the clerk opens up the item, then you make your your motion. Okay. Even if you want to change it, you can just. Okay. Madam Clerk, go for it.'",
        "'speaker_1': 'Communication from Councilman Andrew's recommendation to approve the use of the six council districts one time infrastructure funds in the amount of 150,000 to support a partnership being entered into with Killing Fields Memorial Center.'",
        "'speaker_0': 'Thank you, Councilman Andrews.'",
        "'speaker_10': 'Thank you, Vice Mayor. And I'd like to make an amendment to that, and hopefully I will get a second from this because I'll need it, because the fact that this is something that we have been trying to work on for the last five or seven years now will be coming to fruition.'",
        "'speaker_10': 'The recommendation to approve the use of the Six Council District one time Infrastructure Fund transferred from the Capital Project Fund, CPW, which is public works department into the entire economic project. Poverty and Economic and Poverty Development. Operating budget in the amount of 150,000 to support the partnership and enter into a Killing Fields Memorial Center in order to'",
        "'speaker_10': 'redevelop the Killing Fields Memorial location at 1501 East Anaheim Street, Ottawa authorize the city manager to execute the necessary documents with the Killing Field Memorial Center, a nonprofit organization, in order to develop the Killing Fields Memorial Location at 1501 East Anaheim Street.'",
        "'speaker_10': 'Increase appropriation in the general funds in the economic and property development budget by 150,000. You're not likely to get a second, if I could, on that.'",
        "'speaker_0': 'Thank you. 1/2. By Councilwoman Pierce. Councilman Pierce.'",
        "'speaker_4': 'Yes. I just wanted to say how much I appreciate your forward thinking and trying to partner with such an important organization that raises a lot of awareness, but also provides an opportunity for people to reflect on their history and learn from that.'",
        "'speaker_4': 'And so I think this is very noble of you.'",
        "'speaker_0': 'Great. Thank you. Councilman Austin.'",
        "'speaker_11': 'Thank you. And I'd like to just support Councilmember Andrews motion. Obviously, this is a. Something, an endeavor that will will certainly embolden and recognize the rich culture of the Cambodian community here in Long Beach. But I think it's also an appropriate use of infrastructure dollars as it will go into building infrastructure in the community.'",
        "'speaker_11': 'So I congratulate you and were happy to support this motion.'",
        "'speaker_0': 'Thank you. And we'll come back to Councilman Andrews.'",
        "'speaker_10': 'Thank you very much, Vice Mayor. Okay. With this item, the Cambodian, you know, celebration community, there are brothers and sisters that escape the killing. We called the cameras and came to America and to settle here in Long Beach, where they have built up the American dream.'",
        "'speaker_10': 'Long Beach has had a long and large population of Cambodians outside Nam PIN. And I know that in my district especially in Cambodia town, many of the residents survivor and the. And they are. Genocide and will never, ever make the trip back to Cambodia.'",
        "'speaker_10': 'This money will go towards completing the dream of the Killing Fields Memorial, first of its kind, outside of Cambodia, and to provide some healing. And this is why we think this is so important. And I want to thank everyone for coming out here tonight.'",
        "'speaker_10': 'And I know we have a few speakers who will come up here to talk with you right now.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Thank you, Councilman Andrews, or any public comment on this item, please come forward. I know there's a number of speakers that will be the time. Okay. So I see that there's a request for some speakers before we go to public comment.'",
        "'speaker_0': 'Who are who raise your hand if you're here to speak on this item. Okay. Let's just do this and public comment all together. So please come forward. You have 3 minutes. Thank you.'",
        "'speaker_2': 'Yeah. Good evening, Mr. Mayor and Member City Council. My net metering and. I think my republic veteran, an acrylic survivor and a president, not the caliph where member of center. I see. On behalf of the board. The member or Cambodian American in Long Beach.'",
        "'speaker_2': 'And Cambodian all over the world. I would like to. Express our deep gratitude. To City Council Bay and to. And the city council. On your vision and relationship. To help. Rely on our team soon. The clearly frail Memories Garden, the first of the kind outside Cambodian and inside the most diverse city in nation.'",
        "'speaker_2': 'With the hope. The hope. From important stake holder and partner. So. Yes, the theosophy line we. And the Cambodian Train Association. We hope to read. Our construction. Google within the list time timeframe. Thank you so much. God bless you and God bless America.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Two groups who are. Good evening, Mr. Vice Mayor. Members of the City Council. Thank you so much, Ms.. Pearce. Mrs. Price. Happy Persian Holiday, New Year. We actually we do have a great man at the courthouse, a great public defender named Nima Farhadi, a champion of human rights.'",
        "'speaker_2': 'Ladies and gentlemen. Compared to the size of. The Holocaust Museum or the Armenian Genocide Museum. The Killing Fields Memorial Garden is a very, very small place. It's a miniature size of those two. But to the Cambodians in Long Beach, it is a giant a giant step for them.'",
        "'speaker_2': 'Two word closure and hearings. Healing the wounds and. Broken dreams and. Not. Probably no prize can ever be. Redeemed. Actually. This one here is a home to many, many Cambodians and the hope of many elderly survivors of the killing fields that they hope in their lifetime to come, to reflect and to remember their loved ones who perished'",
        "'speaker_2': 'tragically in the killing fields for four years, 42 years ago. We believe that the the killing feels like other genocides before and after it. Just as a part of the history of the humanities, where a people of a nation being subject to atrocity in human suffering, mass killings and the rest the remain of that destruction, the ash'",
        "'speaker_2': 'of that destruction got nurtured, brought to life back by another group of nation such as the city of Long Beach. And we're very grateful for that. Long Beach has been very, very good to the Cambodians, verse 13, to Hebrew.'",
        "'speaker_2': 'Don't forget to show hospitality to strangers for some who have done it. How pain angels without knowing it. And the city of Long Beach has done even more. In 2005, the city of Long Beach. Proclaim 17 April as the official city Monday council your anger it was your wife.'",
        "'speaker_2': 'My starting out your anger. Who co-wrote that one? And in 2012, Councilor Mandy Andrews. BRADY You did you wrote that one wit along with our group for the Genocide Awareness Month. And that was great because we embrace everything about genocide.'",
        "'speaker_2': 'We observe the Armenian genocide, the Jewish Holocaust, and also the Rwandan massacres. So the city of Long Beach has done a lot and. Recently, Mr. Parkin and Mr. Patrick West already signed a lease. Thank you, sir. We got the lease right now.'",
        "'speaker_2': 'And finally, we thank you again, Councilman Lee Andrews, for being the champion of the killing fields costs for the survivors and. With that, we will be very humble and honored and grateful for your consideration. Thank you so much.'",
        "'speaker_0': 'Thank you. I believe we have one more speaker in the group.'",
        "'speaker_2': 'Honorable Vice Mayor Richardson. Members of the Council. City Manager and City Attorney. City clerk. And your staffs. My name is Ernest McBride Junior. I've been a resident of Long Beach since 1938. You know, I've lived in the city.'",
        "'speaker_2': 'But I'm here to support my friend Paling Salve, who I met when Councilman Andrews first. You know, I ran for the council district and through him I was able to meet a lot of these people and they're really great and wonderful people.'",
        "'speaker_2': 'And I'm here to kind of support the efforts to get this killing memorial made. And I first became aware of this. There was a film that came out in 1983 called The Killing Fields, and it portrayed two journalists.'",
        "'speaker_2': 'One was for the New York Times. He was a Cambodian gentleman named Pran Death Praying. And then it was an American journalist, and his name was Sidney Cronenberg. And they had got a the plot of the movie was they had to go to a city in Newark, Lou Luang in Cambodia, because they heard that an American B-52'",
        "'speaker_2': 'bomber, it bombed the city. And when they got there, they found out that that was a true fact. And so while they were there, they were they witnessed the execution of the Khmer Rouge operatives, and they tried to take photographs and they were arrested.'",
        "'speaker_2': 'Well, they managed to get out of there, you know, to get released. And then two years later, they went, you know, to the Pan-Am pan, to the French embassy. And then while they were there, the Khmer Rouge marched in the print arm pen to take over the city and doing a parade.'",
        "'speaker_2': 'And the these gentlemen were arrested. And then the Cambodian pran he because he was a Cambodian, he was on an arm. He negotiated the release of his friends. And then so they were able to escape to Thailand. And then several months later, Schanberg was in New York City, so he wanted to go look his friend up.'",
        "'speaker_2': 'And so what happened? His friend Pran was enslaved in. And, you know, he was in slave and he escaped one night. And he he ended up in a muddy cesspool filled with rotting human corpses because he happened to stumble upon the killing fields itself.'",
        "'speaker_2': 'And then we kind of heard about there were over 2 million Cambodian citizens were murdered by the Pol Pot's regime. And I think memorials are a great reminder to help us remember atrocities that communities face in our young people need to know be aware of this because this is like the Jewish Holocaust, right?'",
        "'speaker_10': 'Yes, please. Your time is all right. Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. So, as I understand, at the end of the presentation, we're going to open up to public comment if anyone else would like to speak. You have 3 minutes to speak.'",
        "'speaker_2': 'Dennis Dunne, $150,000. Do you know how much that would help the homeless hungry? Those who can't find homes? Better yet. How would it help the Cambodians to have a gravestone? Glorified in the United States when good causes for Cambodians could be spent on education, jobs, and particularly language development.'",
        "'speaker_2': 'Not on a graveyard, not on a tombstone. They could even make it even have The Killing Fields movie screened at schools to see how atrocious the actions really were. Cameras. That would be far more descriptive, entertaining, informative and educational than a museum.'",
        "'speaker_2': 'What are they going to have with the museum? Who will go?'",
        "'speaker_0': 'Thank you. Any further public comment?'",
        "'speaker_2': 'William Shibley I've been involved with the Cambodian community for many years and. It's an honor that I feel that I have earned because of my upbringing in Long Beach. I hear people talking about being in Long Beach 35 years.'",
        "'speaker_2': 'My grandparents came to Long Beach in 1921, 96 years ago, and my father, uncle, brother and I all graduated from Long Beach, probably my son graduated from Long Beach in turn for Senator Feinstein and is now doing a pre-med program on the East Coast.'",
        "'speaker_2': 'But one thing that I learned from my father is that none are better than the least of us and that we support everybody. In fact, in the forties, Mr. McBride and my father helped organize the local chapter of the NAACP.'",
        "'speaker_2': 'There was a murder case called the Sleepy Lagoon Murder case that they made a movie called Zoot Suit Out Of. I would not be here. But for that murder case, because in the middle of the trial, my mother, who'd been married to another Long Beach alum, guy named Van Heflin, had gotten divorced in the late thirties, come'",
        "'speaker_2': 'to California. And in 1941, friends said, you've got to go to this trial. Six days later, they they eloped. But I have always grown up and my family always believes that we must support our newcomers. Those in need, those under risk.'",
        "'speaker_2': 'And the Cambodians have suffered more than most of us. I mean, I congratulate Councilwoman Pryce on the Persian the Iranian New Year. And my family is Lebanese-American. We came to the States 1899 also to flee the Turks, because the Turks were massacring not only the Armenians, but the Greeks, the Syrians, the Lebanese and anyone else they could'",
        "'speaker_2': 'get their hands on. But we need to support the Cambodian community, and building a memorial for the Cambodian community will help heal their wound and help us understand. The importance of the humanity that we must treat each other with.'",
        "'speaker_2': 'And I thank you very much.'",
        "'speaker_0': 'Thank you. Any further further comment on this item? Please step forward.'",
        "'speaker_2': 'For. Very good. Just briefly, I want to commend Councilman Andrews. This is a type you know, he's doing this not for making political hay. He's been around long enough. He doesn't need that. And and he ought to be commended for that.'",
        "'speaker_2': 'This is certainly one of the greatest strategy tragedies that the world has ever seen. Thank you for bringing us forward.'",
        "'speaker_0': 'Thank you. Any further public comment?'",
        "'speaker_2': 'My name is Michael Ferrara and. I would like to just say a few words on this. It's not just for the Cambodians. In fact, vice mayor, members of the board and or council and also public. This is probably the best spending of public funds that I've seen in a long time.'",
        "'speaker_2': 'And I'm going to tell you why. Because it's not just for one community group. This is for everybody that lives in Long Beach. All right. This is a teachable moment. This is building a space, investing in a space where it's not just where you go to relax or meditate or even just to think about what is genocide'",
        "'speaker_2': 'about. And it's not just about Cambodian genocide, from what I've read about it. They are making this a genocide awareness place. And it's a it's a place where you can actually have what they call an experience. All right.'",
        "'speaker_2': 'It's an experience. There will be some of the people from our Cambodian community who have gone through the horrors of the killing field. And our younger generations will be able to sit there and and make a touch. I mean, if you look at it's a touching point.'",
        "'speaker_2': 'It's a teachable moment. If you look in any of our history books and you look at The Killing Fields and what they teach them in high school or middle school, it's a paragraph about this large. And they say, yeah, that's genocide.'",
        "'speaker_2': 'This is a look. We do a lot of things in Long Beach. I remember by my house, they made a park called Rosie the Riveter Park. Why? Why did we do that? Just to have a cute name and a cute symbol from World War Two.'",
        "'speaker_2': 'No, because we were sitting there and saying women are valuable in the workplace and deserving of recognition, and we put a park to that. So parks are spaces where we express something about our community, where the community comes to meet in a teachable moment or for recreation.'",
        "'speaker_2': 'But this is very specific. This is something you guys are doing. One of the best things I've ever seen. Making an investment. An investment in the entire city for all people, not just the Cambodians, so that we can have a space where the conversation about genocide can be a real conversation, where it's a meaningful place to have'",
        "'speaker_2': 'a conversation about genocide. And I think we look at the world right now. The place is rife with it, boiling with it, and our history, recent and far back, is boiling with it. Let's make this a public space to start that conversation and hopefully into the future.'",
        "'speaker_2': 'Genocide will just be a bad dream or bad memory. Thank you for your time.'",
        "'speaker_0': 'Thank you. Any further public comment?'",
        "'speaker_2': 'The Honorable Vice Mayor Rich and Honorable City Councils, all members of City Council. My name is. But which. I come here to say thank you. Want to say thank you to Phelps and Academy. Thank you to Dartmouth College.'",
        "'speaker_2': 'Thank you to P.S. you law school. And I would like to say thank you to everyone here. I am here not for myself, but for my baby sister. I am a martial artist. I'm a teacher. Every time we talk about it feels that I got to hold myself so well.'",
        "'speaker_2': 'No idea what kind of hell it was. Thank you. I would like to let you know. As a martial art teacher. We do fight back. We we sue you. As you remember, Saturday, April 9th, when this son of a dictator came to Long Beach.'",
        "'speaker_2': 'What happened? He. He knocked a process over Paul Hayes unconscious in front of La Lune restaurant. We sued a dictator. We fought back. That memorial is very crucial just to let the elders here, who are a lot of them, are survivors, to have three instance stars to burn to to be peace.'",
        "'speaker_2': 'So I would like to let you know, we are not weak people. We are very we would like to thank you, all of you, just to let us have some peace. Thank you. That's all I have.'",
        "'speaker_0': 'Thank you to all of our speakers. So we will take it back behind the real Councilwoman Pearce. You seconded the motion?'",
        "'speaker_4': 'I already spoke on that part. I just wanted to just say how inspire it's been to hear you share your stories and that you are a community that is resilient, that's courageous. And again, just thank you for creating that space.'",
        "'speaker_4': 'And my staff and I will be out there in the next month for a staff retreat so that we can learn from you all and be a part of your community. So thank you.'",
        "'speaker_0': 'Thank you. Councilmember Durango.'",
        "'speaker_3': 'Thank you. Mayor, back around 1980, 81. I was part of a ceremony where the Cambodian community had just. Become a major population group in the sixth District right off of Anaheim. It was a part of the city that was highly Latino at one time, and there was a community center there called Centro de la Raza.'",
        "'speaker_3': 'Which the United Cambodian community bought and did a groundbreaking to change the building into a Cambodian community center. I was part of that ceremony to make that transition symbolically, make that transition from an area mostly populated by Latinos to now a the idea of the upcoming of a Cambodian population in that area.'",
        "'speaker_3': 'And it was our way. My way. The Latino of of Long Beach, in a way of welcoming the Cambodian community into Long Beach and providing them with a place of sanctuary, a place where they can come and receive services such as taxi services, tutoring.'",
        "'speaker_3': 'There was a bit of a little library in that in that center. So this opportunity now to recognize a dark period in the in Cambodia's history is something that we need. We need to, again, commemorate and welcome because it is part of history and we can't forget history.'",
        "'speaker_3': 'We always have to remember where we came from and the struggles and the challenges and the travails that we all face as immigrants and community groups here in not only Long Beach but across this country, and have that history be part of our community.'",
        "'speaker_3': 'And so I look forward to the day when I'm able to join you. When you had a groundbreaking when you had a ribbon cutting for that memorial. Because I will be not only celebrating with you, but I will also be sharing your memories with you, because it's something that we all share together.'",
        "'speaker_3': 'And we are all of one community. We are all one long beach. Thank you very much.'",
        "'speaker_0': 'Thank you, Councilwoman Price.'",
        "'speaker_6': 'Thank you. I want to thank Councilman Andrews. He is a true champion for the Cambodian community. And ever since I have known him and I've had the opportunity to serve with him. He's always advocating for the needs of that community and fighting hard to make sure that the history, legacy and opportunities for the Cambodian community are at'",
        "'speaker_6': 'the forefront of our policymaking. And I just want to thank him for that. And, of course, I support this this motion wholeheartedly.'",
        "'speaker_0': 'Thank you, Councilmember. Super or not.'",
        "'speaker_9': 'Thank you. I'd like to thank all the speakers here tonight and also thanks to Councilman Andrews. For this motion. And this memorial will be in the 1500 block of Anaheim. And the fourth Council district that I represent starts at the 1900 block of Anaheim.'",
        "'speaker_9': 'So a large portion of Cambodian communities is in the fourth Council District, and it will certainly be shared by my constituents.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Andrews.'",
        "'speaker_10': 'Yes. I'd just like to thank everyone for coming down. And as we say, Leah Ackerman.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'All right. Now I'll just add, you know, congratulations to Councilman Andrews and his staff and working really hard. Congratulations to the elders and the community for for staying in front of the city council, making sure that we're aware of your culture, your community, and the needs of how we can serve it.'",
        "'speaker_0': 'And I just want to say, you know, I completely support memorials when I travel to different cities. Personally, I like to go see the landmarks, the memorials. It really says something about the richness of that community. And I make it a point to go into those things.'",
        "'speaker_0': 'So I will be there in 18 months when the project is finished. I think this is going to be something amazing and we're all going to be able to go look at this. In addition to all our other memorials like the Vietnam veteran, the Lonesome Saint, Lone Sailor Memorial, and all the others will be able to go'",
        "'speaker_0': 'and see that. So congratulations to all of you members. Please cast your vote.'"
    ],
    "Recommendation to request City Manager to work with City Attorney to review the regulation of short term rentals in other municipalities and report back to the City Council with a review of next steps required to create an ordinance, along with zoning code changes, and a timeline for these next steps in 30-60 days.   The findings in the report would explore options for an ordinance that would include, but are not limited to:   \tEstimated total number of STR's and Transient Occupancy  \tTax revenue potential.    \tThe requirements set forth in LBMC 21.51.270, including  \tthe requirement that the owner must live in the unit, and  \texplore other types of residencies such as back yard  \thomes.    \tThe entire unit/home may be rented for a total of  \t90 nonconsecutive days per year.    \tA cost-recovery fee structure for an annual inspection  \tof the rental unit and the administration of the regulation  \tprogram.    \tTransient Occupancy Tax collection on all room rentals  \tunder 30 days.    \tReport on how cities have allocated tax revenue from  \tshort-term residen": [
        "'speaker_1': 'Motion carries a zero.'",
        "'speaker_0': 'Thank you. So I believe we're at item number 21. Clerk Please read.'",
        "'speaker_1': 'Communication from Councilmember Pierce, Councilwoman Gonzalez, Councilman Andrews and Vice Mayor Richardson. Recommendation to request the city manager to work with the city attorney to review the regulation of short term rentals and other municipalities and report back to the City Council in 30 to 60 days.'",
        "'speaker_0': 'Thank you, Councilmember Pearce.'",
        "'speaker_4': 'Thank you. Can you guys hear me okay? Yeah. Okay. This item has come to our attention over the last several years, and it's an item that a lot of cities have started their research on. A lot of cities have passed ordinances.'",
        "'speaker_4': 'Yeah, I can wait.'",
        "'speaker_0': 'You know, we're going to just hold off for a moment before we start the next item so everyone can exit. We'll just pause for 30 seconds.'",
        "'speaker_4': 'I wasn't looking over the. Don't drop on the fish. Where did the fish going? I don't. You know, I have a zoo in the back I could take your fish to. Okay. I know. I can't see across his flowers.'",
        "'speaker_4': 'Please keep them.'",
        "'speaker_0': 'Okay. So we're going to proceed. And before we do, I'm going to ask that everyone keep the conversation at a minimum and please respect the meeting. So please keep the conversation a minimum as you exit. You want to go ahead and proceed?'",
        "'speaker_4': 'Councilmember Yeah, I'll go ahead and proceed. I put together a PowerPoint, which is, you know, going after some other great people. So bear with me for a moment. This is a really important issue. It's really complex. And so I wanted to make sure that we really took took the time to lay it out.'",
        "'speaker_4': 'All right. So. My photo is not going to come up. Okay. There's a photo of sharing guinea pigs up there. Yeah. All right. Okay. The sharing economy, the practice of sharing homes is not a new idea. But in the past, whether through newspaper ads, fliers and on billboards, it's represented a genuine peer to peer marketplace.'",
        "'speaker_4': 'Home sharing has many benefits for guests and for many cities, expands the choice of accommodations for many travelers and can be an efficient use of vacant rooms can also be a great source of revenue for cities. Currently our code essentially does not allow short term rentals with does not call out short term rentals and entire units and'",
        "'speaker_4': 'homes of non primary residents are prohibited according to our municipal code. So this just lays out a little bit of what is currently allowed under 30 days. How many stars are in Long Beach. So to be clear, when we're talking about short term rentals, we're talking not just about Airbnb but many other platforms as well.'",
        "'speaker_4': 'Currently, we have over 728 units listed on Airbnb, which typically accounts for about 65% of short term rental listings. At a first glance, that would give us about a total of 1100 units in Long Beach. And this is, I believe, on the low end after talking to staff.'",
        "'speaker_4': 'I believe this number is going to be a lot higher. Oh. It's a big question. I'm sorry. They can't see all the details on here. Oh, it's host household versus and a single unit that is just on the market by itself.'",
        "'speaker_4': 'But what you see on this map is that the majority of the units are in downtown. They're in my colleague's district in Belmont Shores. And there typically are areas that are higher income. It's probably my favorite slide and this is the aha slide that when you're sitting here thinking Do we how many people are really using short'",
        "'speaker_4': 'term rentals? How many places are actually on the market? And so I'm going to just read these out loud for you guys. Right now, about 58% of the entire apartment units are the entire ones in our district. In our city are apartment units.'",
        "'speaker_4': '38% are private rooms and 2.7 are shared rooms. So we think about the snapshot of short term rentals in our city and the idea of a shared economy. The beginning of that concept was around I have a home and I want to share a room in my home, not I'm going to purchase a whole building and use'",
        "'speaker_4': 'that only for short term rentals and not put that out on the rental market. 71% are available to rent on average of 291 days. 291 days. 71% of these are available to rent. 38% were booked on average for 200 nights a year.'",
        "'speaker_4': 'Again, when we look at these numbers, we have to think about the realities in our district, in our city and how tight our housing market is right now. Units that are one of multiple listings within a city means that the host of that listing has multiple other units listed as an STR within the same city.'",
        "'speaker_4': 'We found a single host and Long Beach have anywhere between two and 19 listings in the city limits two and 19. Being a single person or a company that owns 19 units and is renting those out. That's the reality of our short term rental market in Long Beach.'",
        "'speaker_4': 'Host with multiple businesses, with multiple listings, are likely to be running a business and not sharing a room as we would hope that they would be doing. Currently, short term rentals are not allowed in the city. The standard practice in our city, from my understanding, is that we have to have two people go out and verify that'",
        "'speaker_4': 'this is in fact happening. We then send code enforcement out, then we will issue a cease and desist letter. Only once, according to the city attorney, if I remember correctly from our conversation, have we gone all the way to court on one of these issues.'",
        "'speaker_4': 'And so right now, we really lack the resources to enforce what we currently have on the books. And that's really important for us to remember. The Case for Star Oversight. Right now, it takes valuable rental units off the market, can drive up rent and worsen our housing crisis.'",
        "'speaker_4': 'It creates a safety and quality of life concerns for many Long Beach residents. Everything from parking to nuisance behavior to high gas turnover and really drawing a difference in between commercial zones and residential zones. And of course, as many of us are looking for new revenue sources, we're also losing out on rightfully owned transit occupancy tax revenue'",
        "'speaker_4': ', which currently our hotels do contribute to our city. We currently have a 2 to 3% vacancy rate in Long Beach, 2 to 3%. That is not a healthy vacancy rate. And so when we are taking 1000 units or 2000 units off the market, that's going to have a direct impact on our affordable housing stock.'",
        "'speaker_4': 'We would also like to discuss the fact that the transit occupancy tax could be used to offset or to go into creating new affordable housing. And really thinking about this conversation today as a second step to the mayor's study session and the fact that we talked about generating new housing stock.'",
        "'speaker_4': 'We're not going to be able to build our way out of our housing crisis. So we need to make sure that we're not only looking at building opportunities, but we're looking at opening up some additional housing units. Right.'",
        "'speaker_4': 'Again prevent the loss of rental stock systematic. Oh, so sorry. When we look at what makes them successful as our policy and we are fortunate in the sense that we're kind of behind the game on doing this because we've had other cities that have had to go back and rewrite their ACR policy three, five different times.'",
        "'speaker_4': 'So we really have the opportunity to have our staff study what are some best practices out there and to be able to come up with a policy that fits. Long Beach So we want to make sure we're preventing the loss of rental housing stock, that there's a systematic registration process to ensure accountability and transparency that we're capturing'",
        "'speaker_4': 'Scottie and that the platform is doing its part to help us enforce. I kind of went over a little bit of this already. The point I want to highlight here is just that we need to add over 7000 units by 2021 to keep up with the demand and population growth in our city.'",
        "'speaker_4': '7000 units. Right now with our current housing stock. So this is one avenue that we're going to be able to, again, free up some of that. We want to make sure that we have the opportunity to require host registration.'",
        "'speaker_4': 'And I want to make sure that staff is looking at all the options that other cities have done, whether it's a business license or registration fee. What are the best practices throughout the country? We also want to make sure that we're capturing those tots and that we also have some best practices for how we can divert that'",
        "'speaker_4': 'fund, not just to the general fund, but diverting that specifically for housing. We want to make sure that the SDR platforms are doing its part of enforcement. And I want to really stress here that this is probably one of the most important parts that cities have learned their lesson in where we've passed policies and ordinances in other'",
        "'speaker_4': 'cities, but we haven't done our part to make sure that that the ACR platforms are providing us the information so that we know what we should be getting. When we look at some cities that have had to rewrite their ordinances several times, we look at San Francisco, Portland, Hollywood, North Hollywood, sorry, West Hollywood, New York City.'",
        "'speaker_4': 'After a year in San Francisco passed its regulations, only 130 out of the 5000 host had set appointments with the planning department. In Portland, 93% of its hosts were not in compliance. And so no matter what we put on the books, we really need to make sure that this part is something that city staff is able to'",
        "'speaker_4': 'spend some time digging into. When there's no enforcement, there's no reason for hosts to comply with the city. We know that platforms such as Airbnb have technical capacity and are able to assist in enforcement. So let's do it right the first time.'",
        "'speaker_4': 'So this is next steps. I want to make one clarifying thing. We want to have staff come back with a report on some of these. So that would actually be number three. From number three, we would then draft an ordinance.'",
        "'speaker_4': 'We in Long Beach have a unique opportunity to again look at what other cities have done. Best practices. We are a great city that people want to come to. They want to our visitors are going up every single year.'",
        "'speaker_4': 'We want to continue to make sure that we have a enforceable store policy where we're partnering with some of the CCR companies, but that we're doing that in a responsible way that doesn't have a negative effect on our neighborhoods and our residents.'",
        "'speaker_4': 'So I want to really think all my colleagues that have signed on to this, for those that have asked questions for everybody that put in calls to my office and sent emails, and we know that this is a complex issue.'",
        "'speaker_4': 'And so we really want to make sure that we're taking the time to do it right. So thank you.'",
        "'speaker_0': 'Thank you, Councilmember. And I'd like to speak to my second here. So first, I want to thank you for your approach in taking a look at studying this first and and giving some very clear directions and timeline on how we proceed.'",
        "'speaker_0': 'When I travel, I enjoy using, you know, HomeAway short term rentals. I enjoy it. And I, you know, sometimes you have a little bit more flexibility in terms of how many rooms you're looking forward to fit different families, different needs for the kids, barbecue grill, stuff like that.'",
        "'speaker_0': 'And it's, you know, it's a it's a good tool. But at the same time, I do expect a certain level of health and safety standards when I do utilize these services. So I think we want to embrace the sharing economy.'",
        "'speaker_0': 'We want to make sure we uphold the public trust through, you know, some level of oversight. From a public health standpoint. We want to make sure that the process does capture what resources are needed in order to fund, you know, a responsible, modest oversight process.'",
        "'speaker_0': 'So I think that has that should be, you know, an element to this. And and, you know, we don't want to and through this process, we have been mindful not to stifle the shared economy. So, you know, we should keep all those things in mind.'",
        "'speaker_0': 'And I think we can achieve some of the public policy outcomes that Councilmember Price outlined. So so I'll be happy to second this motion and happy to to move forward and support this. Next is Councilwoman Price.'",
        "'speaker_6': 'Thank you. And just as a quick correction, it was Councilwoman Pearce who made the recommendations, but it.'",
        "'speaker_2': 'Appears that Price.'",
        "'speaker_6': 'Got our name. That's okay. I didn't want to take her credit. I want to thank Councilmember Pearce for bringing this item forward and my colleagues who signed on. This is, in fact, a very significant issue in the third district.'",
        "'speaker_6': 'If you go on to any and I know I have at least one resident here, but if you go into any website, online website for these rental homes and you type in Belmont Shore or the Peninsula, you're going to get a ton of of homes.'",
        "'speaker_6': 'And it's a problem for the residents in the third district, mostly because of quality of life and public safety issues. And there's you know, it's great that Long Beach is and continues to be an attractive place for tourism.'",
        "'speaker_6': 'We have a vibrant community, great music and beaches and amazing people. But we don't want these positives that we have to create problems for our residents as a result of the short term home rentals. Currently, as Councilmember Pearce stated, the ban is difficult for the city to enforce.'",
        "'speaker_6': 'Problems with loud late night party noises in residential neighborhoods, adding groups of visitors into parking impacted neighborhoods. These are difficult to enforce, and neighbors often don't have a contact for the owners. And code enforcement is not properly staffed to have the oversight needed to address these issues.'",
        "'speaker_6': 'The rentals aren't currently permitted by the city, so we're unaware of where they are and when they're operating, which makes it even further difficult for us to enforce. Proving the locations are operating illegally is also often difficult and time consuming for city staff and a huge burden on our residents.'",
        "'speaker_6': 'I know I've met with numerous residents in the third district and they're almost, you know, acting as investigators out there, trying to gather enough information to provide for the city. And it really places them in an uncomfortable position.'",
        "'speaker_6': 'They're out there taking pictures, they're, you know, trying to contact the owner. And it really isn't fair to the residents who live in those neighborhoods that their quality of life is impacted and they don't have anyone to contact in order to make sure that they they get some semblance of regularity back in their lives.'",
        "'speaker_6': 'We see rental vacancies at historic lows in the city of Long Beach, making it even harder and harder for people to find a place to live in the city. And eliminating housing stock by using these properties for short term rental only increases and enhances this problem.'",
        "'speaker_6': 'I think it's important for the city to be able to have information also on who is renting out their properties and that the companies share information with the city of who's operating the rentals and where, so that we can ensure they're in compliance with any regulations that we might adopt.'",
        "'speaker_6': 'So in light of this report and I agree with all the things that Councilmember Pearce has requested, but in addition, there are a few items that I would like to be included in the report and perhaps I can offer those as a friendly.'",
        "'speaker_6': 'I'll I'll list them and see what Councilmember Pearce thinks about them. Specifically, I'd like the report to include an assessment of whether what maintaining the ban on short term rentals would do and what we would need to more effectively enforce the ban, like implementing measures for cost recovery to fund additional code enforcement and possibly city prosecutors from'",
        "'speaker_6': 'the are the attorneys city attorney's office. I'd also like to know about the possibility of shutting off utilities as a penalty or punitive sanction to encourage hosts back into compliance when there are quality of life or public safety issues that are coming up.'",
        "'speaker_6': 'This has been done by by some cities. It's really only done in particularly severe cases where there's neglectful behavior by the property owner and it's causing a nuisance for the neighborhood and regards to quality of life and public safety.'",
        "'speaker_6': 'I'd like the report to include what some other cities have done to regulate these areas. For example, some cities have required that property owners provide all neighbors with a 24 hour contact number to report problems or issues directly.'",
        "'speaker_4': 'Or or of.'",
        "'speaker_6': 'Funding an overnight code enforcement officer to respond to issues raised by short term rentals or possibly including the requiring host to either have a parking space at the property or make arrangements for the tenants to be using parking spots in impacted areas.'",
        "'speaker_6': 'Now, again, this is what some cities have done, but a lot of our rentals are in parking impacted areas. So requiring additional parking may be difficult because the residents that live in that area may not have proper parking sufficient for the homes that are located in that area to begin with.'",
        "'speaker_6': 'But again, it's something I'd like to be included in the report in terms of options. Enforce violations on guests and hosts so that the the host or the owner of the property has some liability financially or administratively if there are violations.'",
        "'speaker_6': 'Possible host screening process that would include a background check or good neighbor training for property owners who are going to rent out their homes and a cap or limitations on the number of rentals or the days of the rentals throughout the city, either by neighborhood or council district.'",
        "'speaker_6': 'I think for our and these are all just these. I'm not advocating any of these things. I'm asking that the report include information on them so that we can educate ourselves on them and their based. These recommendations are based on what other cities have done.'",
        "'speaker_6': 'So not having educated myself on what these particular policies look like and how they're able to be enforced, it's it's really too soon to weigh in on what would work or would not work. But I can say that the residents that I've talked with for the most part have found a lot of problems with short term rentals'",
        "'speaker_6': 'in their community. And it has been very difficult for us as a city to be able to enforce any of our ordinances in regards to the hosts. So I think this is a very timely item and I think requesting information will be beneficial to all of us, especially those with a large number of short term rentals in'",
        "'speaker_6': 'our districts. So thank you very much for bringing it. And those were all offered as a friendly thank you.'",
        "'speaker_0': 'How do you want to handle the friendly?'",
        "'speaker_4': 'Yeah, I'll accept the friendlies as information gathering, I think. Sure. There are definitely some questions about background checks and some other things, but I do think that they're good research for us to have as we move forward.'",
        "'speaker_0': 'Great. So that friendly is accepted, Councilwoman Mongeau?'",
        "'speaker_4': 'Yes. I want to echo the comments that this is a great opportunity to gather some information. I think that it's important to note that all inventory is good inventory in helping with the housing crisis. But realistically, in my little bit of research, when I started piling through some of this information about what is available to rent, a'",
        "'speaker_4': 'lot of these are multimillion dollar homes on ocean or on the bigger areas of town that I would not be supportive of the low income community. Some of these have significant financial deposits and significant cost per night. And so I think that there'd be also some value in figuring out what price range are the units that we're'",
        "'speaker_4': 'talking about, because if we are able to find some that would help in this way, I think that it would be good to know. But also to the point I made last week, all housing in the market added into the vacancy changes the market slightly for everyone.'",
        "'speaker_4': 'And so that's a definite positive. I don't know exactly how to phrase it, except that I guess off the cuff kind of saying. An assessment of the current Airbnb type properties. Stars of the acronym The Stars. What percentage fall in what categories if they were an annual list unit?'",
        "'speaker_4': 'What would we be talking about? I mean, are these 1200 dollar a month units or are we talking about $4,000 a month units? Because at least some of the ones that I was looking at on Ocean. Their monthly rental far exceeds the mortgage of my home and most other people's homes.'",
        "'speaker_4': 'And so I'm just talking through what that looks like. And then also. Kind of comparing and contrasting. How many days a year are of hotels at capacity? I know that about five, six years ago there were some conferences that used to come to Long Beach that no longer could come here because they did not have enough hotel'",
        "'speaker_4': 'nights available in the city. And there was some dialog and discussion in some of the associations on whether or not that's TR market in the community would supplement for the convention business. And perhaps we wouldn't lose some of that convention business if there were enough staffers to supplement it.'",
        "'speaker_4': 'And then specifically that those staffers, depending on the convention, would need to be either if the convention was being hosted at the Grand. I know we have a couple of smaller ones that there are some staffers that supplement the Marriott Marriott Hotel, Holiday Inn community, but then in the downtown community to supplement the downtown model and then'",
        "'speaker_4': 'what that looks like and how can we tie that back into a bigger, broader ability to market ourselves as a city, both to visitors and to our convention. So if you're open to adding a little bit of information on of the anticipated 1200 that are on the initial thought process, where do they lie and how do we'",
        "'speaker_4': ', through public outreach, talk to those landlords about the opportunities in putting themselves back into that market? I'm also interested in for the noncompliance. I think a lot of the comments made by Councilman Price related to the other cities in the creative ways that they've put people back into compliance is also very valuable for the discussion because I'",
        "'speaker_4': 'think that not acknowledging that it's here is a is a big challenge.'",
        "'speaker_0': 'Thank you. Councilmember not. Thank you.'",
        "'speaker_9': 'I'd just like to ask for one more friendly. Just kind of piggybacking on the items that Councilman Price was mentioning. If we could do some type of assessment for calls, for service for police on existing units or what?'",
        "'speaker_9': 'Again, best practices from other cities. Thank you.'",
        "'speaker_0': 'Thank you. Sounds like that was accepted. Is there any public comment on this item? Please come forward. Please state your name. You have 3.'",
        "'speaker_2': 'Minutes. Hi, this is Dr. Jason Cantor from Park Avenue near Ocean. Before I start, I just want to thank Susie Price for meeting with myself and another concern neighbor a couple of weekends ago. Suzy is extremely informed on this and I really can't add much to what she's already said and suggested.'",
        "'speaker_2': 'But a few weeks ago I came here and I listened to a lot of people telling us what it was like to live under the airport with all the planes flying in and out. And so perhaps you'd like to know what it's like to live next to an Airbnb or perhaps may maybe I should say have an'",
        "'speaker_2': 'Airbnb living next to you. I've lived here. I lived in my house for now 30 years. I purchased it in 1986. In that time, four different families have lived there. They've had. I've had families with children. Couples without children.'",
        "'speaker_2': 'The house has always had peaceful renters and owners. The neighborhood has a good mix of rental housing, homeowners. We have a very peaceful neighborhood, very low crime. We don't call the police very often. It's very peaceful. But in late last spring, in a very sneaky way, my neighbor sold the house to some people whose intentions were obviously'",
        "'speaker_2': 'to open it up as an Airbnb. Since then, it's been hellacious. The entire summer was basically coming home after work and having a revolving fraternity house living next door to me. Most often we'd have groups of eight or ten people, eight or 12 people coming in, renting it for a weekend or several days, taking up four or'",
        "'speaker_2': 'five, six parking spaces on the street, interfering with driveway access. We had some instances of some of the renters urinating on the property. One of my neighbors actually had a cell phone picture of it. We've had instances of trash being dumped in the alley.'",
        "'speaker_2': 'And basically, I just want to say the houses are very close in Belmont. Sure. I have three feet separation from this house. And when the windows are open, the back patio is open. There's an open deck on the top.'",
        "'speaker_2': 'It doesn't they don't have to make noise after 11:00 at night. They make noise all, all day long. All weekend long. Morning. Afternoon. They drink it. I'm not saying their alcohol is alcohol is probably being drank and the behavior is very rowdy.'",
        "'speaker_2': 'And in summary, I just want to say, I don't think regulating it is the key. I think banning these short term rentals is the key. We need to do what the city of Anaheim did. They banned them. Why?'",
        "'speaker_2': 'Why interact? This is a very critical neighborhood problem, quality of life problem. And I think banning it and as Suzie said, she didn't advocate this. But one option has the city of Anaheim is doing shut off the gas.'",
        "'speaker_2': 'Shut off the water. That's it. That's the end of the problem. Sorry. Thank you for your time.'",
        "'speaker_0': 'Thank you for your time. Next speaker police.'",
        "'speaker_2': 'Hi. My name is Steven. Fine, thank you.'",
        "'speaker_9': 'Council and Vice Mayor for listening to me.'",
        "'speaker_2': 'I live on the 11th floor of 100 Atlantic.'",
        "'speaker_9': 'We have a rooftop. Recently, the unit across the hall from me got bought by a lady who doesn't even live in Long Beach. She lives in Las Vegas. She fixed it up and they started having renters in the.'",
        "'speaker_2': 'Unit on a daily basis. Our our buildings cars do not allow daily rentals, and.'",
        "'speaker_9': 'Monthly rentals are only by need. There must be an emergency in your family where you have to leave town for.'",
        "'speaker_2': 'Long enough to make that worthwhile. A couple of weeks ago, there was a party going on in the unit. It was loud, boisterous.'",
        "'speaker_9': 'I tried everything to stop that I had no.'",
        "'speaker_2': 'One to go to.'",
        "'speaker_9': 'I called the city. I found that I could make a complaint because they're illegal, but nothing can really be done. I called our security company. They couldn't get them to stop. They were making noise into the midnight and past.'",
        "'speaker_9': 'Some of the people were down in our pool making noise. They were on the roof pool and the roof are off limits after 10:00.'",
        "'speaker_2': 'But they don't seem to care. And I really want to see something done about it that that's about all I have to say.'",
        "'speaker_0': 'Thank you for your time. Next speaker, please.'",
        "'speaker_9': 'You being vice mayor? Members of the council. My name is Ren Castro. I am the director for community engagement at Century Village. Is that Cabrillo? We applaud the Council's efforts and thank Councilwoman Pierce and Richardson and Andrews and Gonzales for bringing this forward.'",
        "'speaker_9': 'We think this is a really important issue that deserves concerted attention and really appreciate your intentionality and the PowerPoint. I think there's not much more I can add to that, but just share that. Obviously, a century we house 1300 and we're very pleased to be Roberto Ringer's district, 1300 formerly homeless veterans and families.'",
        "'speaker_9': 'And due to the extremely low vacancy rate across the city, we're definitely seeing historic highs in our occupancy rates of 97% across the campus, which is really high for us. So we applaud your efforts to look at this issue seriously and also any efforts to divert funding on transit occupancy tax to the mayor's affordable housing fund.'",
        "'speaker_9': 'So thank you so much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Vice Mayor Richardson, city council members want to give a little bit of a different take on this. My name is Paul Barry, and I've been a director of a program that helps folks who are experiencing homelessness get homelessness, get back on their feet.'",
        "'speaker_2': 'There's one issues that probably is a top concern for most of you. You probably hear from constituencies that the challenge of homelessness seems to be on everyone's mind. There are different ideas about how to do it, and there's different ideas about where to do it.'",
        "'speaker_2': 'But generally, there's no debating that people want Long Beach to solve this problem. Now, Long Beach has a number of excellent programs and excellent services from the Multi-Service Center to the Quality of Life Team the police runs to Mental Health America, to the downtown Long Beach Alliance and others.'",
        "'speaker_2': 'And staff work extremely hard to figure out how to solve this problem. Just let me take 20 seconds just to give you an idea that that process of getting to people who are homeless includes building a relationship offer, offering some sort of immediate assistance to build trust, to help give a person a vision that homelessness is not'",
        "'speaker_2': 'the only option, and to figure out how to get funding so they can pay for housing. It's usually SSI, it's section eight. In the end, though, if there are no homes to get, no apartments available, no place that will take what SSI.'",
        "'speaker_2': 'And Section eight offers all the efforts and all the resources of all these people, and the money spent by the city will have been spent for nothing. The short term residential rentals drive supply down and prices up. If managing the stars will ultimately increase vacancy rates by making low income apartments more available to residents, we have to'",
        "'speaker_2': 'do this. Otherwise, in our fight to end homelessness, we're at best treading water and probably more realistically sinking.'",
        "'speaker_0': 'Thank you for your time. Next speaker, please.'",
        "'speaker_9': 'Hi. Good evening, Vice Mayor and City Council. My name is Walker Rivera, program director of Leave Rail Long Beach Residents Empowered. And it gives me great pleasure to be up here and to support the Councilwoman motion to investigate for this further for an ordinance so that we can be able to regulate, monitor and enforce these short term'",
        "'speaker_9': 'rentals. About a month ago at the affordable housing study session, we learned a lot about sort of like the current housing crisis in Long Beach. We learned that the rental market, as councilwoman pointed out, is about a 2% vacancy rate.'",
        "'speaker_9': 'We learned that about 60% of our population are renters. And we also learned that we have fallen far behind the recommended production of affordable housing for low income families. And although not official yet, we are seeing a lot of increasing concerns around our population that are living on the streets without homes.'",
        "'speaker_9': 'With over about 30,000 applications for Section eight in just a short two week period of time. I think I think we see a great need for for the community, for the city, for housing, for residents. And as much as I appreciate that we are a to a tourist economy and that we should definitely try to find some'",
        "'speaker_9': 'ways to work with our folks that are coming in to conferences and things like that. I think our priority should definitely be on our residents and with our current housing crisis, taking out additional units from the rental market is just exacerbating the issue.'",
        "'speaker_9': 'So I think it's really important for us to regulate and find ways to be able to to solve this multi pronged, complex issue of housing crisis. And I think this is one great way of doing so. We need as many available units on the market as possible.'",
        "'speaker_9': 'And if rental units are being taken off the market while people are struggling to find rental housing, it just seems wrong on so many different levels that we support this. A We we should really put a hold on it.'",
        "'speaker_9': 'There's a lot of cities, as Councilwoman Pearce have mentioned, that have already investigated this. And we should learn from what what they've already implemented, what what's worked and what hasn't worked. And we can really take the time to implement a strong ordinance that regulates these short term rentals and actually makes more homes available for the people that'",
        "'speaker_9': 'really need it. And and just stop adding to the exacerbation of the current housing crisis. Let's let's take it take a take an approach and and get some solutions where we can. And this seems like a really reasonable one and something that we can do within our means.'",
        "'speaker_9': 'So again, I thank Councilwoman Pearce and everybody else that authored this this motion. And we we fully support it. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Yes. My name is Hala Stewart. I live in what's called the Walker Building, a building of rather nice loft and things like that down at Fourth and pine. And I support the idea of this study because right now, if you live in a building controlled by an HRA like ours with lofts and somebody researchers, someone decides to'",
        "'speaker_2': 'start renting their place out instead of living in it. If short term, you find a problem. There's charged always. There's sometimes worse than that. People don't respect the fact that most of us living there are live there all the time.'",
        "'speaker_2': 'Quite often some of the people come. I don't know how to characterize their. Their activities, but it's bad. They've tried to get me and yanked the door open when they tried to get in and either forgot their fob or their.'",
        "'speaker_2': 'There are code number and they tried to get me to make them come in and I've had to tell them no because you know, we've been invaded by people before and we don't know who is supposed to be there.'",
        "'speaker_2': 'When something changed almost a day to day basis in a building like ours, this is not good. So I think all the health and safety things and also the thing that there needs to be responsibility so that we can contact somebody with a police department or someone else from the city to say, come on out here in'",
        "'speaker_2': 'that particular unit, we've got a problem. Because right now, you see, we're left training with an agency, trying to figure out how to deal with these things. And it's hard to do because it's hard to watch it every day to see if it's the same people coming in and out of a unit.'",
        "'speaker_2': 'So I really believe that this is a good step to look into this, and I think it really is a very good idea to look at how we can stabilize our market. I'm not against business, but I do believe that there has to be a respect for the quality of life of the people who live here.'",
        "'speaker_2': 'You're around in Long Beach. I don't like going outside my building now and finding where. After Saturday night or Friday night. There's things I don't want to step in out there and I don't like to live that way.'",
        "'speaker_2': 'And so please get this study done. Try and give up some ways to make some improvements to our rules on short term rentals or get some rules, as has been said by a couple of the council members. It's hard to know what's going on because the people who are renting out don't register with them in any way'",
        "'speaker_2': 'at all. So therefore, you don't know what is going on. And like I said, living in a loft, I don't like to challenge people at the door, especially when I'm 77 years old and they're like in their twenties, late twenties and thirties.'",
        "'speaker_2': 'I don't like to be the person to challenge them because I know I know that that could be dangerous to me. So thank you. Good. Good job, Ines. We'll be watching and we'll try to be helpful in any way we can.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_7': 'Hi. My name is Evangel. Never Meet is. I have been living in this city for the last 24 years. I live at the sixth district. And as a mom of two children. I had been looking for an apartment for the last three months and I still don't want any.'",
        "'speaker_7': 'My best friend, Concepcion Garcia. She was then. I'll stick with cancer on December. She moved to live with her sister. His sister is living in a single apartment. In that single apartment they're leaving three persons in is because they cannot find.'",
        "'speaker_7': 'And apparently they are looking everywhere like me. We are applying and applying and applying. It's not been there for us in. I'm supporting this recommendation because I feel like it's an insult to me to hear that they are empty units while people like me and like my friend are having trouble to find a home and on a'",
        "'speaker_7': 'beach. I love Long Beach. I have been living in this city for the last 24 years. I have two kids that are on the University College Day, Long Beach. Another one. Another thing. It's really, really hard to see.'",
        "'speaker_7': 'Many of my friends that they are moving from Long Beach in is hard to see how many. People is leaving homeless. A friend of mine is sleeping in her car inside the church. They should. There is a nine on Atlanta because they are giving the parking space to the park in the car.'",
        "'speaker_7': 'They are sleeping there. So what happened with this city was. I don't know. Something is wrong here. But I believe in that thing. That's impossible. If you do what you have to do. And that's why I'm here supporting this recommendation.'",
        "'speaker_7': 'And I hope you do something to change this city, because I love I love Beach. And I know many people love Long Beach, too. And I know we don't want to from here, we won't continue living here, but.'",
        "'speaker_7': 'And that way I don't know what is going to happen. Thank you.'",
        "'speaker_2': 'Good evening, Vice Mayor. City Council people. My name is Brenton Dooley. My family owns a duplex down in the Belmont Shore area. My parents purchased the home in the late 1970s after we actually rented a short term rental in the 1970s, pre-internet, pre Airbnb.'",
        "'speaker_2': 'It was still available back then. Our family fell in love with the Belmont Shore area at that time. We since purchased this home among other homes in the Belmont Shore area. My parents, my father here tonight has been in love with the Belmont Shore area.'",
        "'speaker_2': 'Recently, though, my mother came down with dementia. And when I had to take control of our parents duplex, which is the only home we owned down here, now, the downstairs was empty. That's a long term rental. Had left the area.'",
        "'speaker_2': 'The upstairs is still a long term rental. My dad. Informed me that he enjoyed taking my mother down there to visit the home that they used to live in. And I said, Well, to be able to have her still go down there and visit the home, I can also rent it out and make some income and help'",
        "'speaker_2': 'my parents afford her dementia care. So I understand some of the other aspects that people are bringing forth. But I also want to have you see our point of view. It is helping our family pay for my mother's dementia care.'",
        "'speaker_2': 'It's helping my family to visit the Long Beach area, to stay in our vacation home for free when we want to stay down there. This short term rental that we offer is only the downstairs. The upstairs. We still have a fantastic long term renter.'",
        "'speaker_2': 'I have contacted all of our neighbors. They all have my phone number. Every rental that we have has to sign a complete rental agreement. They have to email it back to me. I have complete smoke detectors in there.'",
        "'speaker_2': 'I have everything in there. I get five star ratings every time that I have a person come down there to rent. When we first started to open this rental up, we actually went down to the city, to the business office.'",
        "'speaker_2': 'We were told we needed a business license. My wife and I came to the city, Long Beach, to acquire this business license so the city could collect the tax. We were both astonished when we were told by the city employee that a license is not required for anything less than four units.'",
        "'speaker_2': 'Here we were trying to do our effort what we thought we had to do, and the city didn't know what we had to do in return. We still wanted to do our short term rental correctly. So we hired a property manager who works on Second Street and Belmont Shore.'",
        "'speaker_2': 'He's there 24 seven in case anybody needs anything. We also hired a local Long Beach resident to help clean our short term rental. He earns much needed income for him and his family. My wife and I also invested over $14,000 in new furniture and an ongoing upkeep to our duplex.'",
        "'speaker_2': 'Our short term rental takes pride in our home, and this pride assures a respectable neighbor. In closing, I urge the City Council to continue and allow short term rentals to all respectable homeowners. I also offer my service. If you guys need me, please contact me.'",
        "'speaker_2': 'I'd love to open. Keep an open end communication with you and see what we can come to do together. All right. Thank you. Hi.'",
        "'speaker_3': 'Good evening, Vice Mayor and Honorable City Council.'",
        "'speaker_2': 'My name is Alex Montano. Yes, I'm with the Filipino Migrants Center. I live in the sixth district, but I work in the seventh district. So all I just wanted to say is I just want to thank Councilwoman Pierce and everybody who's putting together this.'",
        "'speaker_2': 'I think it's really important that.'",
        "'speaker_3': 'There's oversight on short term rentals. For me, working in the Filipino community, mostly out of.'",
        "'speaker_2': 'The seventh District, two of the top concerns I've been hearing from residents and families and youth who we work with are housing, as well as the homeless issue that has continued.'",
        "'speaker_3': 'To grow over the last six years.'",
        "'speaker_2': 'I've been with the Filipino Migrant Center, so it is really important that we regulate this. It is really important that we have oversight over this because there are a lot of families.'",
        "'speaker_3': 'Who are looking for places.'",
        "'speaker_2': 'To live and also in the Filipino community. And please make sure that there is a transient occupancy tax where that revenue can.'",
        "'speaker_3': 'Be actually put towards finding more affordable housing for our communities. We really want to make sure.'",
        "'speaker_2': 'That Long Beach is a city where the families who live and work and contribute to this great city actually have a place to live. So thank you. We completely support what you're doing.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Suzanne Brown. I'm a senior attorney with the Legal Aid Foundation of Los Angeles here in the Long Beach office. We are also happy to see this item introduced. Housing advocates have been seeking for a dedicated local source of revenue for affordable housing since over a decade ago, when we fought for the Housing'",
        "'speaker_4': 'Trust Fund. And at that time, we were looking at top money as a potential local dedicated source. So we're happy to see that this item could lead to that happening. Finally. Lastly, I just want to say that a successful short term rental ordinance can't happen without the platform doing its fair share of enforcement through monitoring and removal'",
        "'speaker_4': 'of illegal listings and providing booking data to the city. So with all ordinances and policies, the devil's in the details and monitoring and enforcement is key. So we hope that we learn from our brother and sister cities who have gone before us, who didn't have monitoring enforcement and had to go back and amend it.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_7': 'Well, my name is Nader Tushnet, and I live in the third district. And I'm going to speak about more about the monitoring and enforcement than anything else. Before my retirement, I was a researcher and I researched policy implementation.'",
        "'speaker_7': 'So without.'",
        "'speaker_8': 'Enforcement and monitoring.'",
        "'speaker_7': 'And the buy in of the people who are engaged in the activity. A policy is just a piece of paper. There's some great books. Whatever happened to great ideas in Washington when they got to Oakland and whatever happened to great ideas that happened on in city council when they get to the community?'",
        "'speaker_7': 'And so what we need for this policy to succeed is a way to put into effect enforcement that involves both the people on that who control the platform and the people who are the renters as well as the people who are renting.'",
        "'speaker_7': 'And that and collecting money is a good way to get there. So thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_9': 'Good evening. Josh Butler, Executive Director Housing. Long Beach Housing. Long Beach has been sounding the alarms of the rental housing crisis for many years now. We've known for over a year that our vacancy rates have dipped under 3% and may very well be near to 2% or below in many of our neighborhoods.'",
        "'speaker_9': 'At the same time, the residential commercial real estate market is red hot. A year end report by real estate industry group Costar shows that the fourth quarter of 2016 was, quote, scorching hot for Los Angeles County. $10 billion was spread evenly throughout the county, including the Beach City, San Gabriel Valley, southeast Los Angeles and downtown Los Angeles'",
        "'speaker_9': '. Long Beach recorded an individual sale of greater than $30 million alone. And mind you, this is a city where nearly one quarter of our neighbors live in poverty, the city where a quarter of our residents are spending more than half of their income on rent and the conversion of apartments that could otherwise serve as homes for a'",
        "'speaker_9': 'senior, a person with a disability, people of color. Makes this problem even worse. As rents continue to spike, our communities across the city are being displaced. Long Beach is a renters city. The renters we work with care about this city.'",
        "'speaker_9': 'They volunteer their time, participate in neighborhood associations, attend community watches, and volunteer to give food to our ever growing homeless population. These are things that are invaluable to a community and things that a vacationer in a short term rental will not contribute.'",
        "'speaker_9': '60% of our residents are renters, while Long Beach is also the largest population of renters up and down the West Coast with no renter protections, which has made us targets for real estate speculators seeking to profit from our most vulnerable, many of whom end up couch surfing, sleeping in cars or sadly, sleeping on the sidewalks.'",
        "'speaker_9': 'Many of those who end up on the streets or living in their cars do so because they have been displaced or threatened with eviction. Matthew Desmond, the author of Evicted, has a study that shows 50% of Milwaukee's homeless population cite eviction or other rental housing problems as a cause for their homelessness.'",
        "'speaker_9': 'We have an opportunity to learn the lessons of many cities who have dealt with short term rentals before us and work to protect our existing supply of housing as our primary goal. Short term rentals, if they are to be permitted, should be paying a fee that goes to the housing trust fund, which still remains a decade on'",
        "'speaker_9': '. With no permanent source of funding. We could also move forward with a policy here that was close to what Santa monica does, which requires people to be on site for that rental, which greatly, greatly restricts people using Airbnb as a model.'",
        "'speaker_9': 'Cities such as San Francisco, Portland, West Hollywood, New York have all established regulations and have faced varying challenges. Long Beach needs to learn from that. However, I would be remiss if I didn't say that those four cities, along with others who have regulations in place, also have basic renter protections such as just cause for eviction, rent stabilization'",
        "'speaker_9': 'or both. Regulating short term rentals isn't only about our existing stock, but it's about our existing community. And I encourage the Council to take measures tonight and beyond to protect our low income communities.'",
        "'speaker_0': 'Thank you for your time. Next speaker, please.'",
        "'speaker_7': 'Hello. I'm Sylvia Contreras. I'm from District eight and.'",
        "'speaker_8': 'I'd like to address Ms.. Mongeau.'",
        "'speaker_7': 'I liked your comments very much. I'm pretty much a person.'",
        "'speaker_8': 'Who works with stats, so one of the things that was discussed was.'",
        "'speaker_7': 'Parking Impact Park. And on the.'",
        "'speaker_8': 'Flip side is this where I live, we have parking impact. And what I've noticed is when one of the apartment units was empty, wonderful parking, when two apartment units were empty, these are like four units, six units, apartments.'",
        "'speaker_8': 'The whole street was practically empty and then it was okay. But then what I think what I'm thinking is causing the impact. It's not we don't have R&B in being our area, but it's not the Airbnb problem. What I see is a lot of families are doubling up and tripling up in apartments in the city, doesn't know'",
        "'speaker_8': 'it or the owners don't know it. So I'm not sure that the parking impact is the real big issue with Airbnb because those are transient people. They come and go. I don't think they rent two cars for the weekend.'",
        "'speaker_7': 'I doubt it. I don't know. The other thing too is if you.'",
        "'speaker_8': 'Want to have stats. The fact that this is illegal to have Airbnb or all these other short term rentals is if you want to get stats of those people that are hosts, what if they don't want to come out because they're afraid of what they're finding out that it's illegal?'",
        "'speaker_8': 'So how are you going to compare stats that you don't have any from? You're just going to assume that it's being rented for 290 days out of the available, you know, 290 days that are being available for rent.'",
        "'speaker_8': 'But we don't do.'",
        "'speaker_7': 'We know how many.'",
        "'speaker_8': 'Days each host actually is.'",
        "'speaker_7': 'Renting throughout the year out of the 1700 or whatever that big number was? I was curious about that to address a.'",
        "'speaker_8': 'Gentleman here that has had issues with. Airbnb, people coming in, loud noises, partying. I get that because I get that from regular neighbors. But maybe if we have complaints from those people that know that it's Airbnb or short term rentals, if they call the police and say, You know what, I'd like to report a party, I forgot'",
        "'speaker_8': 'to call it a party, something or other, that if they address that, then the owner can say, okay, you know, go back to the owner, we're going to shut off your water. And that'll probably take care of that.'",
        "'speaker_8': 'I'm really sorry about the homeless people here.'",
        "'speaker_5': 'I.'",
        "'speaker_8': 'I, but then as well as me, I don't know how many landlords can rent to a homeless who doesn't have income. So how do you address landlords? Help the homeless who don't have an income to pay the rent.'",
        "'speaker_8': 'And so transit occupancy, I think that would be a good idea. Thank you very much.'",
        "'speaker_0': 'Thank you for your time. Next speaker, please.'",
        "'speaker_2': 'I agree. Being Vice Mayor Richardson and city council members. I'm Donald Segarra and I'm a property owner in in Long Beach. I just want to point out a couple of things that are related to this topic. A letter dated December six, 2016 to Community Development Directors.'",
        "'speaker_2': 'The chair of the California Coastal Commission reminded cities that vacation rentals are to be allowed and encouraged in the coastal zones as an affordable option for accessing the beach and doing otherwise unduly limit public recreational access opportunities inconsistent with the Coastal Act.'",
        "'speaker_2': 'In fact, they cite that the vacation rental regulation in the coastal zone must occur within the context of your local coastal program or be authorized pertinent to a coastal development permit. I share this information with you so you have more facts in order to make a complete discussion of the issue.'",
        "'speaker_2': 'According to the Long Beach Convention and an event bureau, tourism and meetings in Long Beach bring in over $300 million annually to local economy, most of each of which is located on or near the beaches. Being able to rent a furnished home for any number of nights in these areas is a natural, fit and boost to the'",
        "'speaker_2': 'local economy. Including their added contribution to spending at local restaurants, retail events and markets, especially along Sacco Street and Belmont Shore. Homeowners are very proud of their homes and have high incentive to scrutinize potential guest as well as keeping homes at the highest possible level for the next guest.'",
        "'speaker_2': 'With screening, the vast majority of vacation rental guests are respectful and responsible. Of the homes in the neighborhoods in which they stay. Instead of looking at cities that severely limit vacation rentals as examples, please look at cities that have permitted vacation rentals and look at their best practices as well as the data in regards to the benefits'",
        "'speaker_2': 'to the city and enforcement. Let's let the facts drive the conversation, not fear or misinformation. In conclusion, I agree with the proposal to legalize all types of short term rentals, create regulations that encourage registration and tax compliance, allow for stays of any length, not to limit it to primary residences, and ultimately provide for immediate consequences when rules'",
        "'speaker_2': 'are broken. Thank you.'",
        "'speaker_0': 'Thank you. Next. Next speaker, please.'",
        "'speaker_2': 'Good evening, Vice Mayor. Council Staff Jeremy Harris, senior vice president of Orbital Area Chamber of Commerce Winter Stand. This issue is a complex one, but we are.'",
        "'speaker_9': 'Excited to see this particular issue come up with a broad understanding that it is complex and many different items need to be discussed when looking at.'",
        "'speaker_2': 'Short term rentals, particularly with our hospitality and hotels here in Long Beach. So we welcome that further discussion to top how that is being impacted or lack thereof with stores.'",
        "'speaker_9': 'In place here in.'",
        "'speaker_2': 'Long Beach. So we appreciate that. Thank you.'",
        "'speaker_0': 'Thank you. So we'll take it back behind the rail.'",
        "'speaker_4': 'Councilmember Pearce Yeah, I just wanted to say one last time. Thank you for everybody that came out tonight to begin this conversation. Obviously it's complex. We know that there are a lot of cities that have regulated this and it being currently illegal, making regulating it and finding a way that we can regulate it that is in partnership'",
        "'speaker_4': 'with some of our hotel leaders as well as our housing leaders, I think is really important in finding that middle ground. So I just wanted to ask everybody for your support today. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I want to thank everyone who came to speak today. It's a very complex issue and a lot of different perspectives that I think are really important to be considered. And while I also, through listening to your comments, reflected on a particular unit that's on my street and has been available for rent for two years and is vacant'",
        "'speaker_4': '. And so there's also challenges that come with someone who doesn't rent that property at all because of their unrealistic expectations. And I actually would probably prefer in that case, if a few days a year someone was there because it just gets so rundown.'",
        "'speaker_4': 'So there's other considerations as well. So from the code enforcement standpoint on both sides of the issue, I think that there's a lot to hear. So thank you all for your comments. And I really bring in about some some thoughts among all of us.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. And see no further comments. Members, please cast your vote.'"
    ],
    "Recommendation to authorize City Manager to create and implement a Partnerships to Enhance Parks, Programs and Services Program for the Parks, Recreation and Marine Department.  (Citywide)": [
        "'speaker_0': 'Thank you. Let's have item number 2025. Thought we took 24. Well 25 lots have. I'm number 25, please.'",
        "'speaker_1': 'Report from Parks, Recreation and Marine. Recommendation to authorize the City Manager to create and implement a partnership to enhance parks, programs and services program for the Parks and Recreation and Marine Departments Citywide.'",
        "'speaker_0': 'Thank you, Mr. West.'",
        "'speaker_2': 'We have a quick report from our Parks Recreation. Marine Director. Marine Knight, supported by Assistant Director Steven Scott.'",
        "'speaker_4': 'Good evening, Vice Mayor. Members of the council. This evening we're bringing to you a proposed program to enhance partnerships in our parks, programs and services. In 1996, there was a city wide policy on sponsorships developed for city wide agreements.'",
        "'speaker_4': 'In 2012, that policy was updated to allow for more competitive proposals, donations, programs and service sponsorships. In 2016, the Council requested the development of a new program to include public private partnerships benefiting programs, facilities and services. The program that we are bringing to you tonight was researched and informed by best practices and modeled after successful programs throughout'",
        "'speaker_4': 'the nation, including the cities of San Francisco, Minneapolis, Seattle, Kansas City, Sacramento and New York. The program that we're bringing to you tonight has a few things that we've done. We've taken all of our city wide policies on sponsorships, and we've put them into one program and one policy.'",
        "'speaker_4': 'It also includes our public or prime fee waiver policy, our right of entry permits and existing agreements for uses of facilities and provisions of services and programs. Currently, we have over 100 existing partnerships and they range from anything to some of our garden clubs, groups and organizations that support animal care services organizations and nonprofits that is existing'",
        "'speaker_4': 'currently use our city facilities and some of our businesses in town that support our programs and services. The staff looked at our current needs where we would enhance programs and services or need to fill some gaps or expand our programs and services.'",
        "'speaker_4': 'And those needs fall into three categories of needs for our parks and facilities, needs for additional and expanded programing, and needs for additional new and expanded services. So I proposed new program partnerships to enhance parks, programs and services incorporate incorporates our existing policies.'",
        "'speaker_4': 'It includes current partnerships and allows for expanded partner opportunities and provides a more consistent framework. It is intended not to supplant existing programs or services, but to either enhance services and programs or bring new services and programs or revenues.'",
        "'speaker_4': 'Fill gaps or bring more programs than we are able to do with our existing resources. This new policy includes several partnership opportunities, includes donations, sponsorships and programmers, service delivery partnerships, revenue sharing, volunteer support, park or beach maintenance and stewardship facility amenity naming opportunities through sponsorship, user fee waivers and appropriate commercial concessions.'",
        "'speaker_4': 'There are several guiding principles that any new partnership under this policy should bring. There should be new revenues, resources, ideas, technologies, programs, or services that meet a community need. Partnerships should have a positive social, financial, cultural, environmental impact.'",
        "'speaker_4': 'The partnership should protect and enhance the city brand and image, meaning the organizations and businesses that we partner with should be in good standing with the city and they should have a proven track record of success. They should also demonstrate the financial capacity to take on the partnership that they are endeavoring.'",
        "'speaker_4': 'The partnership should be self-sustaining and not needing additional resources from the city. It should be inclusive and free of participation barriers, not conflict with existing policies and practices, and follow all current laws. A process for a business or an organization would be to submit a letter of intent.'",
        "'speaker_4': 'It would go through our review process so that we can make sure it meets the guiding principles outlined in the policy. And if so, then it's moved on to the existing approval processes that we have in place. There are a few recent examples that we are working on that would meet this new policy.'",
        "'speaker_4': 'The first is a dog play yard ax has identified that one of the things that will help us socialization and adoption of our dogs and the health of the animals that we have at the shelter would be to have an expanded playard.'",
        "'speaker_4': 'But as you know, we are very constrained with our footprint at the current facility. So we are looking at moving into part of our corporation yard for our maintenance facility and expanding that into a dog playard. Resources are needed to do that and the friends of the Long Beach Animals has come forward willing to fund the construction'",
        "'speaker_4': 'of that playard. We have another great partnership right now with an organization called Heart of IDA. Part of it provides a lot of free senior services, mobility classes and information for our seniors. And they came to us a little while ago and needed some extra space to operate.'",
        "'speaker_4': 'So in exchange for some space at the Fourth Street Senior Center, they are providing free services to our seniors and our older adults in our community. And finally, we're working with our Conservation Corp partners on a partnership that would help us move forward community enhancement projects.'",
        "'speaker_4': 'We often have members of the community coming to us wanting to do enhancement projects in our parks. However, we don't have the current resources to sit down with those organizations, plot out their plans and programs and move those forward.'",
        "'speaker_4': 'So the Conservation Corps is going to be our subcontractor, so to speak, in this endeavor, and they will work with the community organizations and move that forward. That will also give them the opportunity, as is one of their core service models, is to provide job training as they do that.'",
        "'speaker_4': 'So the next steps would be approval of the policy this evening. And we will market this new policy and program once it's approved, and we will be seeking letters of intent from interested parties. And that concludes my report, and I'm available for questions.'",
        "'speaker_0': 'Thank you. And we'll go to counseling in the Mongo.'",
        "'speaker_4': 'Thank you. I want to thank Parks Recreation Marine, along with the city manager for their work on this. I know that when we started getting questions from different community groups about the deals that had been made or not been made and the the terms of who between the City Council and the Parks and Rec Commission had jurisdiction'",
        "'speaker_4': 'over different kinds of partnerships, the types of partnerships that were available. People would ask questions like, Why does this business have a poster on a fence in the baseball diamond? But the soccer fields don't have the same kinds of opportunities.'",
        "'speaker_4': 'And I think that putting everything in one place where we can all start to know and understand the rules by which things are made would be a huge help to all of our nonprofit groups. I think that there are a ton of people out there with great intentions who are out in the community wanting to better the'",
        "'speaker_4': 'city and to donate that money and or time to the city. But it has to be done in a meaningful way and an efficient way because you and your time is also very limited and you have a lot of acreage to cover.'",
        "'speaker_4': 'And every park is a priority and every program is a priority. And so putting it all together in one place is an amazing opportunity. I received some emails. Specifically asking, can volunteers clean up the park? Can the start of the other happen?'",
        "'speaker_4': 'And I think that through discussions with you about your projects and timelines that you have in mind with working with the Conservation Corps and other things, our parks will be cleaner. Our youth will be better trained. The partnership programs available will be.'",
        "'speaker_8': 'More.'",
        "'speaker_4': 'And we'll be able to fill those gaps areas at some of our parks that have really struggled. I know that Councilman Andrews and I spoke at length a year ago when this started and then most recently a few hours before this meeting about some of the partnerships that he's desired to have at MLK Park, but that they're'",
        "'speaker_4': 'the process by which a nonprofit comes to the table and fills out what to whom, by when and what is. That need was not really clearly defined. And so now I'm in the pocket. It has a sample sheet that the Parks and Rec Department has, so you can fill out your request.'",
        "'speaker_4': 'There will be a record and a file. And when I started in this office, there were lots of questions about what had and had not been approved because almost everything was required to come through the city council and no one really knew what had and had not been approved.'",
        "'speaker_4': 'And so for that, I really appreciate the work and diligence of this because I feel that it'll be a much more transparent process with open lines of communication that will benefit everyone. So I look forward to hearing the feedback and I hope that we get a lot of applications over the next 12 months to fill in those'",
        "'speaker_4': 'gaps in the areas that I know you've identified and taken a lot of time to identify. So thank you for your hard work.'",
        "'speaker_0': 'Thank you. And I'll speak to my second now. So this my thoughts here are, you know, there's certainly need to count on the private sector for certain things. You know, I can say it's not clear right now how to say raise money to support the building of a facility.'",
        "'speaker_0': 'We we just finished the the construction of the Michelle Obama Neighborhood Library. And concurrent with that was the endowment to help support library programing, you know, and maintenance of the building and things like that. And and we it was very clear we were able to work with the Library Foundation.'",
        "'speaker_0': 'We've raised over $1,000,000. We're really proud of that. At the same time, we have a convention center out in park as an example, and we don't know the process to go solicit private dollars. And this helps for us to streamline that process, to find private dollars should we need it in the expansion or the improvement of how'",
        "'speaker_0': 'in part there's been interest in, you know, doing things like, you know, using creating kiosks and things like that to make, you know, help those areas where the park transitions into a business corridor. And it wasn't even clear on how we engage in those discussions with the business improvement district or businesses who may want to have a'",
        "'speaker_0': 'footprint there. I think with respect to our monuments and memorials that are in our parks, we have to have a clear understanding on like facility and amenity naming processes because that could be a part of how we establish endowments and structures to pay for the ongoing maintenance of these facilities in the long term.'",
        "'speaker_0': 'And that should be clear. I do want to you know, I see the point that it says we are, you know, just the pivot for a minute, that we're filing all laws and and things like that. And I just want to go to staff with with a question when, you know, I do see program and service delivery'",
        "'speaker_0': 'here. I want to be crystal clear that we you know, whether this requires and have we followed any labor requirements in terms of meeting confer I mean, consult additional? Will this trigger any requirement for us to have any negotiation as it relates to services that currently are delivered by the rank and file or services that may be'",
        "'speaker_0': 'become delivered by the rank and file? So can you speak to that just for a moment?'",
        "'speaker_4': 'Absolutely. So on page three of attachment C, which is the actual policy under program and service delivery, about halfway into that paragraph, it says these programs or services should either be new to the community or something that enhances existing programs or services.'",
        "'speaker_4': 'Proposals will not be considered that seek to assume the delivery of an existing program or service whereby that action would create a violation of Proposition L.'",
        "'speaker_0': 'Great. I think it was important that we draw that part out, that what we're talking about is, you know, and what what we initially that's consistent with what we originally requested with this study. And I'm glad to see that that's the intent as we move forward.'",
        "'speaker_0': 'So I want to say, I'm look, you know, we are going to embrace this opportunity and look for new partnerships to improve our parks and our facilities. And I and I want to thank Councilwoman Mongo, all the council members who've been involved in this, and particularly Marie and her staff for really helping clarify this.'",
        "'speaker_0': 'This is really solid work. Thank you. So next is Councilman Austin.'",
        "'speaker_11': 'Thank you. And I think some of my questions were actually addressed. I briefed earlier with the director of memory for Parks and Recreation Marines and expressed some of my concerns regarding what's not written here. And that is and that would be the the unintended consequences.'",
        "'speaker_11': 'I want to be clear as well, and I'll be a little bit more clear that I am not interested in contracting out any existing work as a result of public private partnerships with the Parks and Recreation and Marine.'",
        "'speaker_11': 'I'm not interested in violating any existing collective bargaining agreements or prop properly in any way. And I would just hope that that we we move forward with this, that we don't. We don't get into those issues. We can.'",
        "'speaker_11': 'We seek to avoid them. Now, what has been also stated is that you said that existing services would not be impacted. But if we're creating new opportunities, it's not going to preclude our city employees from being involved in those.'",
        "'speaker_4': 'I don't think it would preclude our city employees from being involved in those. I think each partnership opportunity and we we have sort of a catchall category here for innovation because there are things that we probably haven't even contemplated yet that businesses or organizations could bring forward, that there may be an opportunity for the city to partner'",
        "'speaker_4': 'with someone in the provision of a service where maybe they underwrite our staff providing the service. So I think that there are those opportunities there. But I would clarify again and reassure you that, you know, as throughout here, we talk about new and enhanced programs and services and new and enhanced revenues.'",
        "'speaker_4': 'So the intention is not to take away from our employees or the services that they're provided, but really look to fill the gaps. And there are large gaps in our service provision here and the needs in the community.'",
        "'speaker_4': 'So this really will hopefully help us move forward and fill those gaps versus supplant what we're already doing.'",
        "'speaker_11': 'Okay. Well, I think that this is a policy that is going to work. I mean, obviously, I'm going to support the what's on the proposed to do tonight with with those that that clarification and when those provisions that I.'",
        "'speaker_11': 'I set forth. I think the language in here is pretty good. I just you know, there's a. Under the guiding principles. The the last bullet point states that partnerships must not conflict in any with any existing city policy practice initiative or procedure and partners would be required to follow all city, county and state and federal laws.'",
        "'speaker_11': 'I would just like to to add any existing labor agreements to to that if as a friendly amendment or to. To the guiding principles.'",
        "'speaker_4': 'We could add that under that section and we could also add it on page three at the end of program and service delivery. Just to reiterate that point, if that works for you as well.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Price.'",
        "'speaker_6': 'Thank you very much. I too want to thank staff for their work on this. I just wanted to ask a few questions about this. Is this going to be a pilot program?'",
        "'speaker_4': 'It's not intended to be a pilot program. It's intended to be a program that we once approved by the council will be able to immediately implement. There will be, I guess, a pilot piece of this as things come to us that, again, we haven't contemplated or done before.'",
        "'speaker_4': 'But we want we intend to be able to move forward immediately with some of the requests that we've received. We have a few things on hold, as well as seeking out what we feel are some of the service needs.'",
        "'speaker_4': 'So we'd like to move forward with it. There may be some things that come forward and we discuss at a staff level and bring that up through the council that maybe it's not something, a direction that we want to go in.'",
        "'speaker_4': 'Some of the what's contained in this policy already exists, as I mentioned. So we've pulled and cobbled together a few existing policies and then there's some new things in here that we're going to be trying. So I guess in that sense it's a pilot in that we're going to be trying something new.'",
        "'speaker_4': 'Our hope is that it moves forward. We may come back to some point in time down the road to tweak it a little bit or add to it. If we find that there are things that we didn't think about and we want to be able to add to this, that makes sense for the community and services.'",
        "'speaker_4': 'Okay.'",
        "'speaker_6': 'Are we going to have any sort of an outreach campaign to inform people of these partnerships or partnership opportunities?'",
        "'speaker_4': 'We'll do our standard marketing, so we'll use our social media sites and our website, and we'll reach out to some of our current nonprofit organizations or those that have reached out to us in the past. Some of our other user groups or people that we have had, some of the previous types of agreements that now we're going'",
        "'speaker_4': 'to fold into this. So we'll be doing a little bit of outreach on all ends.'",
        "'speaker_6': 'Okay. Now, is this I know that throughout.'",
        "'speaker_8': 'The report, though, the.'",
        "'speaker_6': 'Term park is referenced, but does that include medians, parkways and roundabouts?'",
        "'speaker_4': 'It would include anything that comes under the purview of Parks, Recreation and Marine.'",
        "'speaker_6': 'And I ask that because, as Ms.. Knight knows, and I'm very proud at some point we're going to do a presentation at council. One of our staff members is a member of this year's Leadership Long Beach team and one of her.'",
        "'speaker_6': 'Her idea of adopting a media and a kind of a a program that we could implement citywide for community groups that might be interested actually was one of the projects that was selected. And so it's Antonella Schaub who's here.'",
        "'speaker_6': 'So we're going to be working on a partnership and with leadership Long Beach to make that project a reality. And of course, that involves the media. So I wanted to make sure that this this this policy that we're contemplating would encompass those areas as well in regards to community groups.'",
        "'speaker_6': 'Can they, if they wanted to partner.'",
        "'speaker_4': 'Would.'",
        "'speaker_6': 'PRM be providing them a list of partners that they could connect with to do community service?'",
        "'speaker_4': 'I'm sorry. Can you say that again?'",
        "'speaker_8': 'Sure.'",
        "'speaker_6': 'As far as like community groups who may want to do an enhancement project would PRN be providing them with a list of community partners that they could work with?'",
        "'speaker_4': 'I guess I'm not quite sure what you're asking for as far as community partners. Would we be part? Would we be matching them with other groups that want to do projects that have come to us? Is that what you're asking or.'",
        "'speaker_6': 'Well, I guess I'm kind of going off of your PowerPoint presentation. And in terms of your partnership with Friends of Long Beach Animals. Your partnership with Heart of Ida.'",
        "'speaker_4': 'So some of our existing.'",
        "'speaker_6': 'Partnerships or existing or future partnerships. So how would a community group know about that, those partnerships?'",
        "'speaker_4': 'How would they know? Well, that's a great question. That could be something that we could add to our website. The existing partnerships that we have so folks could get an idea of what we're already doing. We would also not want to take away from if we have a very successful partnership right now with one of those organizations'",
        "'speaker_4': ', have someone else come in and, you know, try and take over that partnership as well. I think there's plenty of needs to go around, so I'm not so concerned about that. But we could certainly list those on our website.'",
        "'speaker_6': 'Just just to give community groups a little bit of assistance. If they wanted to get involved in a particular enhancement project, like how would they go about, you know, what, what would be the partners that the city has already worked with, like Conservation Corps, which is the medium project that we're doing or other groups that they could'",
        "'speaker_6': 'work with.'",
        "'speaker_4': 'Right. So we have several that do enhancement and cleanup projects. For example, the Friends of Bixby Park. They do regular monthly cleanup projects in the park. They do some other programs and service projects for us. So we have neighborhood groups throughout the city.'",
        "'speaker_4': 'So when when we do get phone calls from people and they're interested in participating, we often do hook them up with the key members of those organizations so they can reach out to them.'",
        "'speaker_6': 'And that similar partner would be maybe the like the stewardship program that we have with Lenny, Arkansas. Yes, I know he works with community partners and organizations all the time.'",
        "'speaker_4': 'We have often sent people towards Lenny's way that he could use all the volunteers he can get.'",
        "'speaker_6': 'That's perfect. That's great. Would a community group be able to submit a one time intent to partner on a particular community project, or would it have to be like an ongoing thing?'",
        "'speaker_4': 'Yes, they can do a one time, for example, of a one time park enhancement or park cleanup or park project. Or it could be a partnership over the next five years. It could be that they submit it for a long term.'",
        "'speaker_4': 'Depending on if they are able to show that they have a proven track record of success for a long term agreement, we may start out with maybe a one year or shorter agreement that's renewable, depending on how they do after their first year.'",
        "'speaker_4': 'But absolutely, there's latitude to do short term one time or long term.'",
        "'speaker_6': 'Okay, that's great. Well, I think it's great that we are looking at opportunities like this because I know resources are limited in terms of financial resources, but in terms of volunteer resources and and a heart for the community and a willingness to do things in the community, we're certainly not limited in that area.'",
        "'speaker_6': 'So to the extent that we can kind of use that that desire to fuel some projects, that would be great. I do want to ask that because outreach and communication and encouraging these partnerships is so important. I want to encourage PRM to continue to work with community groups or interest groups who might be interested in getting the'",
        "'speaker_6': 'word out and providing information to community partners of how this could happen and how we could effectuate these policies at the, you know, at the very local level in neighborhoods and to kind of use use other agencies, as, you know, ambassadors to help us get the word out about these opportunities.'",
        "'speaker_6': 'I think that would be really great.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_0': 'Thank you. Councilmember Pierce.'",
        "'speaker_4': 'Thank you so much. I also want to say just great job to Councilmember Mungo, who I know began this conversation. Anne Marie Knight, for your hard work on this, partnerships obviously is something that is really important to me and my district.'",
        "'speaker_4': 'And we have unique opportunities in our district like Arts Park, like Bixby Park, that really are going to require partnerships to help us create an above and beyond experience for folks. And so I just wanted to ask a couple of questions.'",
        "'speaker_4': 'One is, if an organization that's a listed in the sheet is fundraising for, you know, like the friends of Groups, if they're fundraising for a park, what is the process that they go through before they can spend those funds or fundraise in the first place?'",
        "'speaker_4': 'Is there an agreement where that fall into this category where they would have a form that they could work on? It would fall under this policy, and there has not been a consistent policy in the past. So that's one of the benefits of this, is that we would be able to have a, you know, a running total'",
        "'speaker_4': 'of who's doing what. It's been approved. So we know that their fundraising, we know what they're fundraising for. And if it is for something in the park, then we've approved that because we have we have a lot of great groups out there.'",
        "'speaker_4': 'They're very well-meaning groups. But we get calls all the time about someone being approached by someone who's fundraising for something that we're not even aware of. So this process will help us solidify that. Absolutely. Great. Thank you for that.'",
        "'speaker_4': 'And then I wanted to ask a question around the revenue sharing. I know it doesn't exactly say that every project would share X amounts. Can you talk about when we do revenue sharing, say with like an arts park, we are going to do a partnership with the Arts Council and the Dolby and hopefully have some concessions there'",
        "'speaker_4': '. What would happen with the revenue sharing percentage that the city would get from that? So each contractor agreement is going to have to be negotiated separately because there's going to be there are so many opportunities that it could be such a broad spectrum of what they're raising money for, what they're charging for.'",
        "'speaker_4': 'It is a is it a concession versus is it fundraising? So each contract, as they propose to do some type of concession in the park, we would then look at and negotiate separately with each one about the revenue sharing that would come back.'",
        "'speaker_4': 'Some may be doing that concession or raising funds, and none of those funds would directly be related to that park. But we would be asking for some of that to come back to take care of maintenance and needs in the park that they're using to fundraise for or to sell their concessions in.'",
        "'speaker_4': 'If it's a straight concession agreement, then we would negotiate that as we have some of our other concession agreements, for example, down at Rainbow Harbor or in the Marina. So each one is going to be different. Great. Thank you so much for your time and effort on this.'",
        "'speaker_4': 'And I hope that we can really look at the form and make sure that as we move forward, if the form is getting to our needs, that there might be an opportunity to adjust it just to make sure that we're doing checks and balances with some of those agreements.'",
        "'speaker_4': 'So thank you. Absolutely.'",
        "'speaker_0': 'Thank you, Councilmember Durango.'",
        "'speaker_3': 'Thank you, Mayor. This is more like a general big picture type of thing. I guess what we're trying to do here, you're getting principles, new revenue sources, ideas, technologies, programs, services, positive social, financial culture, environmental impact, protect and enhance the city brand and image.'",
        "'speaker_3': 'And of course, somebody must have a proven track record of success. In your guiding principles, you have in there to protect and enhance the city brand and image. What is it?'",
        "'speaker_4': 'So that means that we would want to partner with we want to make sure that the individual businesses, organizations that we partner with have the same mission as the city, has the same service, excellence of service that we have as a city.'",
        "'speaker_4': 'And so that when we partner with them, they are at the same level we are as far as what our city brand is. So we just want to be protective of who we are because oftentimes when these groups are out in the community and doing what they're doing, the average citizen does not know that they are not'",
        "'speaker_4': 'part of the city. And everyone looks at that as a city program or a city project. So we want to make sure that the customer services at the level that that we would require as a city and our standards as well as the end product.'",
        "'speaker_3': 'In the other sense, it also is that, you know, many I have been approached by. Community groups wanting to. How about as my assistance in sponsoring an event that they want to put through in a in a community room or a corner of the park?'",
        "'speaker_3': 'And one of the considerations here that we always are confronted with is that they may not be a federal agency. Whatever I want to see free or nonprofit, and they ask for that kind of assistance in order to get whatever they want to put in there.'",
        "'speaker_3': 'They want to do it for a benefit, for some for a cause of, let's say. Asthma. I had asthma. But they don't have. If I want to see how we're going to handle that with the in terms of the application process, are we going to require that they be a nonprofit and eventually a nonprofit, or are we'",
        "'speaker_3': 'going to host them in one way or another? Well, we're going to waive the fees for them in order to be able to do the.'",
        "'speaker_4': 'So that's a great question. So this policy encompasses, as I mentioned earlier, several of our existing, one of which is our our fee waiver policy. So the Council has given our Parks and Recreation Commission the authority to entertain those types of requests and grant fee waiver approvals.'",
        "'speaker_4': 'So if someone wanted to use one of our city facilities or parks, they would have to go through that application process. And it is actually heard at the Parks and Recreation Commission. They are not required to be a501 C3.'",
        "'speaker_4': 'What they have to demonstrate, though, is how their activity that they want to have the fees waived for. How does it serve our community? How does it benefit the community? So we have several a month that come to the commission.'",
        "'speaker_4': 'So that's the current process that would be covered under this and it would still remain that way.'",
        "'speaker_3': 'What about insurance?'",
        "'speaker_4': 'For some types of activities, they may have to provide insurance, others they don't. So it really depends on the activity and what they're doing. But that process is included and covered under here. So they would go through that process, and that's been in existence for quite some time.'",
        "'speaker_3': 'Well, in principle, yeah, I agree with the effort here because I think that we've been remiss in a lot of opportunities to have major projects here that would be self-funded or funded in other ways that would help a brand in that way.'",
        "'speaker_3': 'And I think that this would be very helpful in getting more out, more participation from major sponsors to come in and hold events here. I see I see the potential for this. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_4': 'I want to appreciate the comments of my colleagues because a lot of what they spoke to was the original intent of this. And early on when I was elected, the transparency factor was the key concern for me because I was being told one thing by a community group, one thing by the attorney, one thing by a department'",
        "'speaker_4': 'head. And I really just didn't know what was the truth. So I would like to ask and I won't add it to the motion, but for you to find a way to work with data, L.B., that every application that you approve gets scanned and posted on the city website somewhere, because then we will all know who has'",
        "'speaker_4': 'been approved and perhaps if it's going to be rejected that it's a discussion on Here's why this is not a good time for us. We already have enough programing at that park. We already have what? And the other.'",
        "'speaker_4': 'But all approved city related organizations, whether they're using, let's say the Conservation Corps, is a legitimate partnership and they wear their t shirts and they're cleaning up the park. They are certified to be there versus someone who wants to just clean up the park on their own.'",
        "'speaker_4': 'That's fine to do, but we need to know who's verified and who's not verified. Would that be something that you can work towards? Absolutely. Thank you. I really appreciate that.'",
        "'speaker_0': 'Thank you, Councilwoman Pier.'",
        "'speaker_4': 'Yeah. I just wanted to ask that Marie Knight, if you guys could, outreach to nonprofit partnership as a way to get the word out. That that would be helpful. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_6': 'Just to echo what Councilwoman Mongeau just said, I think it's a really good idea to have that information and make it easily accessible. And one of the things Miss Knight's been working on with Antonella Schaub from my office is what leadership Long Beach wanted to do with this project is come up with an actual like brochure or'",
        "'speaker_6': 'kind of educational piece of what people would have to do in order to be able to do a partnership like this, like with a Conservation Corps or another group, and so that they can help the city. Because, again, our resources are are somewhat limited in terms of staff resources.'",
        "'speaker_6': 'But that's another way to get a community leadership organization to educate the neighborhood organizations about what the what steps they need to go through if they wanted to do an improvement project. Because like Council member Mungo just said, we get requested requests all the time from community groups who want to do things.'",
        "'speaker_6': 'And just through this process I've learned that there are different steps that they have to go through. And Councilmember Yanga is absolutely right. I mean, we need to we need to know exactly what they have to do, make sure that we comply with everything, educate people, things like insurance of the legal issues.'",
        "'speaker_6': 'Those are all very important. So I think having, you know, some consistency in place and taking advantage of partners who want to work with us to get the word out and educate the community and make it easier for those partnerships to happen.'",
        "'speaker_6': 'I think we should be embracing those at every opportunity and encouraging that kind of partnership from our local interested organizations and allied partners. So thank you.'",
        "'speaker_0': 'Thank you. And before we cast our vote, I just want to say that, oh, we have to get a couple of comments, so I'm gonna make a comment here. So, Parks people really care about their parks. I mean, parks are really important.'",
        "'speaker_0': 'I get it. And so I would say that it you know, these policies have been looked at in a long time. And we should not ignore the fact that this is probably a really heavy undertaking on behalf of staff.'",
        "'speaker_0': 'And so, you know, staff, thank you for taking this on. I hope that this is successful. I hope you continue to defend it like you did tonight. And and let's and let's see what comes out of this. Sometimes you have to take a risk and try something new to, you know, to shift an outcome.'",
        "'speaker_0': 'And so I'm hoping that that happens. Is there any public comment on this item tonight?'",
        "'speaker_5': 'Karen retired, and I'm a resident of the First District, and I also represent a number of community groups, and I also am a part time worker with partners of Parks. And I can assure you this is going to be a great opportunity for community groups and for partners of Parks, too.'",
        "'speaker_5': 'And as your question, Councilmember Turanga Partners of Parks does do fiscal sponsorships for organizations that don't have a5013501c3 and for all of the council members. And we do that for any organization that is going to be doing events in parks, we charge a 10% administrative fee, which is very, very low if you look at other organizations.'",
        "'speaker_5': 'And we also are able to provide insurance certificates at no cost to people that affiliate with us. So those are part of the services that Partners of Parks offers. And I think this will be a wonderful opportunity. Speaking for Gray Panthers, we have a great partnership with the senior center and with parks, been there a number of'",
        "'speaker_5': 'years. We loved the park scene being at the senior center. So thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_5': 'When I was not. Yes. My name is Priscilla Suarez. I'm the executive director of the Arts Council for Long Beach. And first of all, I really want to thank the Department of Parks, Recreation and Marine for updating and clarifying their parks sponsorship policies.'",
        "'speaker_5': 'Thank you so much. Community partnerships between local organizations and our city's parks help fill the gap in many ways for our resources and in some cases, activate underused space and bring residents together. As the Arts Council, I know the value of as head of the Arts Council, I know the value of community groups.'",
        "'speaker_5': 'And many times we get artists and creative organizations wanting to use the parks as a place to bring everyone together to do creative work. And so this would help greatly. A lot of those organizations are willing to create sustainable partnerships and bring together a shared vision.'",
        "'speaker_5': 'We are currently working as an Arts Council where Councilmember Janine Pearce, the downtown Long Beach Alliance, the East Village Association and local businesses to activate East Village Arts Park, which has been closed for three years. And so even in in in asking the question, there were other questions to me and I was like, I don't know.'",
        "'speaker_5': 'So thank you so much. Again, this is really, really opens up many avenues. So our collaboration with East Village Arts Park is the perfect example of how business and community groups can come together to activate public spaces. I look forward to being part of the process.'",
        "'speaker_5': 'As an arts council. We can educate our creative organizations. We can educate our artist. Our musicians are performers on how to go about this. So count on our support on that and we look forward to leveraging some more resources for our parks and our communities.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_4': 'My name is Mary Martinson I with friends of El Dorado Dog Park. And I'm the president of a nonprofit.'",
        "'speaker_7': '501c3 And we've been here since 2010 and I feel hardly support this. It's just been.'",
        "'speaker_5': 'Type of.'",
        "'speaker_4': 'Where you don't really know what's going to be approved. What is it? We've fundraised first. We were supposed to fundraise for the dog park.'",
        "'speaker_7': 'And an.'",
        "'speaker_8': 'Infrastructure. Gerry ships.'",
        "'speaker_4': 'Keep it the infrastructure.'",
        "'speaker_8': 'Through.'",
        "'speaker_7': 'And we were really happy about it and was a one time.'",
        "'speaker_4': 'Infrastructure.'",
        "'speaker_7': 'We've spent close to $8,000, which is not a lot. But the problem was we wanted to go after corporate.'",
        "'speaker_8': 'Sponsorship and we.'",
        "'speaker_7': 'Didn't have any guidelines.'",
        "'speaker_4': 'For it. And it would really.'",
        "'speaker_5': 'Help our.'",
        "'speaker_4': 'Group and our nonprofit to.'",
        "'speaker_8': 'Have some type of guidelines.'",
        "'speaker_4': 'To work through this. So we.'",
        "'speaker_7': 'Appreciate this. I thanks Stacy Mongo for bringing it forward. I thank the Parks and Recreation.'",
        "'speaker_5': 'And I am so.'",
        "'speaker_8': 'Happy that this is going to.'",
        "'speaker_4': 'Finally.'",
        "'speaker_8': 'Be something that we.'",
        "'speaker_7': 'Can look at and say.'",
        "'speaker_8': 'Yeah, this is going to work. This is really.'",
        "'speaker_4': 'What we.'",
        "'speaker_7': 'Need. So thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Larry. Good. I haven't had a chance to go over the details with this night. I did. With the predecessor and so forth. But a. A program, a paradigm that will be set, ready to go is will be centered around what used to be Marine Stadium three s, which was raised as a result of a criminal ruse.'",
        "'speaker_2': 'What's going to happen with that? And this will probably take place later this fall, before the end of this year. It will be rebuilt in the same footprint, no larger than the old footprint. And we'll get somebody like Schooner or later that will operate what will be open for breakfast and lunch only period.'",
        "'speaker_2': 'Half of a probably 80% of the seating will be portable chairs and tables that they will bring out in that location. It will do a land office business, and a percentage of the profits will go to offset the fees that are being charged for to the nonprofit.'",
        "'speaker_2': 'Cal State and Long Beach Junior Crew. A percentage of the profits from sooner or later will go there. We've already got a name for it. It's going to be called the brig and it will do an absolute fantastic business for breakfast and lunch.'",
        "'speaker_2': 'It will not it will not be open for dinner. But that's something we we're coming up with in three or four months that will come forward. I'll give you all the same, all the details. And you don't I haven't given you all the details of the background of that.'",
        "'speaker_2': 'I'll give you the same the information that James Comey has. And you'll see you'll understand the full history of that. Thanks.'",
        "'speaker_0': 'Thank you. So seeing no further public comment members, please cast your vote.'"
    ],
    "Recommendation to adopt Specifications No. R-7084 and award a contract to All American Asphalt, of Corona, CA, for street improvements, in an annual amount not to exceed $40,000,000, for a period of one year, with the option to renew for two additional one-year periods, at the discretion of the City Manager; and, authorize City Manager, or designee, to execute all documents necessary to enter into a contract, including any necessary amendments.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Zero. Thank you. Item number 26, please.'",
        "'speaker_1': 'Report from Public Works recommendation to award a contract to all American asphalt for street improvements in an annual amount not to exceed 40 million citywide.'",
        "'speaker_0': 'I can't remember your anger. Okay. Staff report, please.'",
        "'speaker_2': 'Craig Becker, Public Works Director. Yes. Good evening, Vice Mayor, members of the City Council. What you have before you is one of our on call contracts. That's a request to allow us to spend up to $40 million to do street work.'",
        "'speaker_2': 'All American is our contractor that won the bid. They are a union contractor that we've worked with in town. They they've done some really good work addressing streets in numerous neighborhoods. And we're looking forward to working with them moving forward.'",
        "'speaker_2': 'This is primarily funded out of our street dollars and we don't have a $40 million budget this year. But with some of the recent passage of Measure M and if there is any federal infrastructure money, we wanted to ask for additional capacity should that come through?'",
        "'speaker_2': 'That concludes staff report and I'm available for questions.'",
        "'speaker_0': 'Thank you, Councilman Miranda.'",
        "'speaker_3': 'More of a comment than anything else. I want to thank American Asphalt for accommodating the mayor and myself and Councilmember Austin during the the breakthrough Street fixture fixing that we did out in the eighth District. They've done great work.'",
        "'speaker_3': 'They did a lot of great work in my district, in Santa Fe. So I'm very pleased to support this country. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Price.'",
        "'speaker_6': 'I have nothing to say.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Is there any public comment on this item saying no members, please cast your vote.'"
    ],
    "Recommendation to request a resolution in support of Long Beach joining cities across the country in proclaiming March 21, 2017 Cities Immigration Day of Action.": [
        "'speaker_1': 'Motion passes seven zero.'",
        "'speaker_0': 'Thank you. And then I believe we have item number 30.'",
        "'speaker_1': '31.'",
        "'speaker_0': '31. All right.'",
        "'speaker_2': '31.'",
        "'speaker_1': 'Communication from Councilmember Pierce, Councilwoman Gonzalez, Councilmember Urunga, Vice Mayor Richardson, recommendation to request a resolution in support of Long Beach, joining cities across the country and proclaiming March 21st, 2017 cities. Immigration Day of action.'",
        "'speaker_0': 'Councilwoman Pierce.'",
        "'speaker_4': 'Thank you. I'm excited about the opportunity to stand in unity with the cities across California and across the country, to declare this day, a day, one day of immigration, day of action. Our community is enriched by the diversity of our residents.'",
        "'speaker_4': 'And I think, if anything, our council agenda tonight really demonstrates that having our Cambodian community, Persian community, as well as many Latinos in the community coming together to contribute to make our city a better place. We want to make sure that we recognize that the valuable immigrant contributions to our community as city leaders.'",
        "'speaker_4': 'We know that declaring a day, immigration day of action is not a final step, but an important one towards protecting our diverse communities. I'd like to take the opportunity to highlight the incredible work and actions of our community based organizations that are already doing hard work to advocate for immigrant rights and support our immigrant communities during these'",
        "'speaker_4': 'uncertain times. Tonight, many of these advocates are not here because they are, in fact, participating in a day of action where they are learning and growing together and making plans and stepping forward to ensure that Long Beach particularly continues to protect our immigrant communities.'",
        "'speaker_4': 'We've already taken action as a city to support Kevin de Leon's California Values Act, which will restrict us from using local resources to do the job of the federal government. Tonight, I ask my colleagues to join me in supporting this item and stand in solidarity with Long Beach's immigrant communities.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Gringo.'",
        "'speaker_3': 'Thank you, Mr. Mayor. And I want to thank Jeanine for Councilmember Pearce excuse me, respect for presenting this item here. This is March 30th. This is a Cesar Chavez birthday. And there's going to be a number of activities taking place over the next couple of days, next week in recognition of a day of service.'",
        "'speaker_3': 'So this is one way of being able to provide that. I want to thank the Council of Mayors for also agreeing in the cities that that have agreed to participate in this as well. Obviously, today was was one of those days where we recognized our diversity.'",
        "'speaker_3': 'And I mentioned that during my moment of reflection. That is also a moment of silence, because I think that if anything, we we we live in the greatest country in the world, and we have to celebrate that every day.'",
        "'speaker_3': 'So I want to thank you for bringing this forward.'",
        "'speaker_0': 'Thank you. Is there any public comment on this item? Saying Num members, please cast your vote.'"
    ],
    "Recommendation to respectfully request City Council approval of the 2017 State Legislative Agenda as recommended by the State Legislation Committee.": [
        "'speaker_1': 'Motion passes six zero.'",
        "'speaker_0': 'Next, there's requests to continue item number 32. My understanding it does require a motion. Councilman Austin.'",
        "'speaker_11': 'So move.'",
        "'speaker_0': 'Okay. It's been seconded by councilman. I'm sorry.'",
        "'speaker_2': 'Do we continue to a date certain? April for April. Thank you.'",
        "'speaker_0': 'Okay. Motion will continue to April 4th. Is any public comment on the motion? Seeing the members, please cast your vote.'",
        "'speaker_1': 'Motion carry six zero.'",
        "'speaker_0': 'Thank you. And that concludes our agenda. So now we move on to our second public comment. Please come forward. If you wish to comment on an agenda item, speakers have 3 minutes.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you. Please give us your name. You have 3 minutes to provide your comments.'"
    ]
}