{
    "Recommendation to request City Manager to report back to City Council in 90 days on the feasibility of establishing a percent for arts policy as an ongoing funding source for public art in the City; and report back on similar models cities across the nation use to fund public art programs.": [
        "'speaker_3': 'So thank you, guys. If I can have the curve, please read the first item.'",
        "'speaker_4': 'Communication from Councilwoman Price. Councilwoman Gonzalez. Vice Mayor Lowenthal. Councilwoman Andrews. Recommendation to request the city manager to report back in 90 days on the feasibility of establishing a percent for arts policy as an ongoing funding source for public art in the city.'",
        "'speaker_3': 'Thank you. I'm going to turn this over to Councilwoman Price.'",
        "'speaker_6': 'Thank you. This agenda item actually was initiated by you, Mr. Mayor, during your comments at the state of the city. So I want to thank you for initiating this item in this conversation and getting it started. And as you said, at the state of the city and as I wholeheartedly agree, a city cannot thrive and be a'",
        "'speaker_6': 'place where people visit and live and offer exposure to the youth without a strong arts programing, without strong commitment to the arts, and without a wide variety of options in terms of different types of arts that people can enjoy and participate in in the community.'",
        "'speaker_6': 'So the purpose of this item is really to get the conversation started and to ask our city staff, led by our city manager, to look at all the different models that are adopted around the nation to support arts programing in various cities.'",
        "'speaker_6': 'And my intent with this particular item is to really focus not on a particular organization or a particular type of art, but really talk about how we can bring about more support for the arts in their totality. Visual arts, theater, arts, music, everything that we would put under the umbrella of arts, we as a city should be'",
        "'speaker_6': 'supporting, regardless of the organization or the entity or the the person that's pushing it. We really should be focused on how we provide arts programing and arts opportunities for our residents and our communities. So this is obviously something that is very important to me and my council colleagues.'",
        "'speaker_6': 'On a personal note, my family and I partake in just about every arts opportunity that we have, the opportunity and the and the time to participate in our kids. It's there growing up with arts in their life and they are very lucky to live in a city like Long Beach that has so many great programs already and'",
        "'speaker_6': 'so much potential for additional growth and outreach in terms of the great work that we already do and that we have the potential to do. So I hope that my colleagues will support this particular item, which really just asks us to be educated further and gives us some options on how we can go about getting funding for'",
        "'speaker_6': 'the arts. So thank you.'",
        "'speaker_3': 'Thank you, Councilwoman. I know you made that. You made the motion, Councilwoman Gonzalez, to me the second.'",
        "'speaker_6': 'I also want to thank the mayor for this. I think during State of the City, I counted all of the different responsibilities he gave us as a city council. But this is one that I'm most excited about, and I'm glad that Councilwoman Price brought this forward, and we had the support of our other council colleagues in bringing'",
        "'speaker_6': 'this forward. I, too personally share the passion of arts and theater. I serve on the board of the ICI tea. I absolutely love discussing art and music with a lot of our downtown residents. I just did my first my holiday pictures with my family in front of the Powell mural, because I just absolutely love the fact that'",
        "'speaker_6': 'we have these places here in in the city. I'm going to have a first birthday I made in Long Beach. So that's also very exciting. And I think all of you here collectively have given so much to the arts and have made our local community so much more vibrant than it than it can be.'",
        "'speaker_6': 'And I see so much more potential with that. So I am wholeheartedly as well, like Councilwoman Pryce supporting this item. I think it's an opportunity and an avenue for us to get more information back to see what is possible.'",
        "'speaker_6': 'I know with our former blue ribbon committee there have been discussions. Our Arts Council, our local grassroots community associations like Kalb. I see a friend here and so many of you have also participated in our local events. So this may be an opportunity as well to see how we can support continuing local events like Day of the'",
        "'speaker_6': 'Dead and like other events that have happened so very often in our city. So I look forward to this. I look forward to seeing the information come back from our city management staff. And I thank you all for being here.'",
        "'speaker_3': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_9': 'Thank you, Mr. Mayor. And I wanted to thank Councilwoman Price for including me. In this motion, many of you in the audience have been working on having the city. Adopt and include an envelop more of the arts in the various projects that we're able to do.'",
        "'speaker_9': 'And as many of you know, we had an opportunity to do that when we had redevelopment and when we were doing far more projects. And you have, in the absence of that, found ways to continue to show a vibrancy in our community through the arts.'",
        "'speaker_9': 'We can feel that in the texture of the different projects are working on. So I'm looking forward to finding a way for us to include this as part of just the way we operate. It needs to be a part of the way we operate.'",
        "'speaker_9': 'And I know that it's the present for the arts program is active in at least 27 states around this country. There's no reason why the city of Long Beach can't do it. And I look forward to hearing back the different options on how we can bring this back because we won't have redevelopment back.'",
        "'speaker_9': 'And so we'll have to look to ourselves to be able to find this beauty and enrichment and culture in all of our public facing efforts. And and for that, I thank you thank you for your patience and your guidance on this issue.'",
        "'speaker_9': 'Thanks.'",
        "'speaker_3': 'Thank you, Vice Mayor. Next up is Councilmember Yaw Ringo.'",
        "'speaker_7': 'Thank you, Mayor. Ah, gracious. Right. Art, for art's sake, MGM, the lion. I want to thank the mayor and council members Priceless Northern Solace and Andrews for bringing this forward. The art is huge in terms of not only Long Beach, but for our communities as a whole.'",
        "'speaker_7': 'Having been a former community college trustee. I also see the importance of programs in our schools, in our in our K-12, as well as in our community college and in our university. Because that's how we learn and that's how we keep students busy.'",
        "'speaker_7': 'I don't think I need to harp on the fact that when we keep young people busy with either playing music or acting in theater or painting or doing any of the numerous parts of arts and crafts and and other things that are that are important in the arts world, that we lower crime, we we divert their their'",
        "'speaker_7': 'attention from hanging out and being not laden with gangs and making them do something creative or helping them do something creative. So I would want to.'",
        "'speaker_2': 'Include.'",
        "'speaker_7': 'In this study that as we move forward, if we can connect with with the schools, with the K-12 and the community college and university to help them with their programs. We hear every year that when there are budget cuts in education, one of the first programs to go always in the schools are arts programs.'",
        "'speaker_7': 'And so we need to find a way to support them as well in regards to being able to sustain their programs and keep them going and not have those programs be the first to go with it because it's a low lying fruit.'",
        "'speaker_7': 'We need to keep arts is important. It's important to our community and it's important to public safety as well as all aspects of our community life. So. Just want to throw that out there in terms of when we continue with the study city manager, if we can also be inclusionary of our educational entities as well.'",
        "'speaker_3': 'Thank you, Councilman Andrews.'",
        "'speaker_2': 'Yes. Thank you, Mia. You know, first of all, I want to thank Councilwoman Price for asking me to sign on to this item. You have a number of great artists living in Essex this week, and I know that they would agree with me in saying that public art is very much needed in our city.'",
        "'speaker_2': 'It creates an attachment to one community and inspires others. It also reflects the unique diversity that Long Beach is made up of. With that said, I'm looking forward to hear a report back from our city manager. Thank you very much.'",
        "'speaker_3': 'Thank you, Councilmember Richards.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I want to thank Mayor Garcia for introducing this idea. I want to thank our council colleagues for bringing this forward. All of the very familiar faces we see in the audience who are engaged in one thing or the other related to art.'",
        "'speaker_5': 'I personally believe that art is a core and critical element to any urban revitalization, urban renewal effort, and we throw this term around all the time. Uptown Renaissance art is core to this, is key to this. I unequivocally support this.'",
        "'speaker_5': 'I think public art also sends a message to the public that, you know, you know, we are alive, we're vibrant, we are engaging, we are communicating. I'm looking forward to seeing the results of this feasibility. But what I'm really looking forward to is figuring out creative ways to utilize art and specifically public art as a tool to'",
        "'speaker_5': 'help revitalize some of our neighborhoods, like I've seen in Philadelphia has a mural arts project, which is really cool, where it's like areas of town that had a bunch of vacant space and blight. And they began painting murals.'",
        "'speaker_5': 'And now they have one of the best mural programs in the nation where you can literally go and see 4050 murals is a month backlog just to go to these neighborhoods no one would ever enter in just to see, you know, 70 foot mural of Wilt Chamberlain or whatever.'",
        "'speaker_5': 'Right. Really cool art. So this is this is what I see as a as an effort for us to get serious about art the way Philadelphia has. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Mongo.'",
        "'speaker_4': 'I know I've met with some of you and talked with others of you at community events. And I think that one thing that is constantly forgotten, but not in my mind, is the impact and role that arts play in our economy.'",
        "'speaker_4': 'Arts are linked to jobs. Arts are linked to thriving business corridors. Arts are linked. And I don't just mean arts in the typical way that some people believe a mural or a sculpture. Though I would have appreciated an ice sculpture in the median at Wardlow instead of bike racks which were controversial.'",
        "'speaker_4': 'I mean, it would have been great to have had a fun to pull from at that time. It's also important the arts that we talk about that are linked to our job readiness programs and the arts that are linked to our we go to programs and many of you have been partners in a lot of that.'",
        "'speaker_4': 'And so I first want to thank you for all you've already done. Many of you know that there's hard budget times ahead and we have to look at what we get a return on investment with. And many of you know that I've written some some things on the impact that the arts have on the economy and jobs'",
        "'speaker_4': '. And so I believe arts are an area similar to infrastructure where you get that return on investment more quickly because it really impacts the neighborhoods more quickly with those things. So thank you to each and every one of you if you haven't already read the L.A. Aces report on how arts drive the economy and museums drive the'",
        "'speaker_4': 'economy and tourism. Please do. It's remarkable, and I hope that it's all in our minds and ready to go when we have to make these tough decisions.'",
        "'speaker_3': 'Thank you. And Councilmember Austin.'",
        "'speaker_1': 'Thankfully and I think I'm last, but I wanted to also weigh in and thank the mayor and my council colleagues for bringing this item forward. Creativity drives everything in our city, particularly today. But I think arts also help us maintain a balance here in the city of Long Beach.'",
        "'speaker_1': 'And, you know, it's so part so much part of our identity and our DNA as a city to have creative residents, but to also to to honor and and support creative efforts of artists of all types in our city.'",
        "'speaker_1': 'In Eighth District, we also obviously have the Expo Arts Center, where we we profile art and we try to push a lot of events to to bring the community into who can benefit from such arts. We have Long Beach Arts and I mean, obviously we're extremely supportive of our Arts Council City wide.'",
        "'speaker_1': 'I'd just like to just echo all of the comments that have been made here and and ask the staff in their, their efforts to provide us a report back on options that you be artistic and creative because we understand that this may not be something that is a line item in our general fund, but there are, I'",
        "'speaker_1': 'think, options out there that will will meet that that need as well. And so I would just ask that you do that and you know, thank you for the arts community for coming out and being supportive of this.'",
        "'speaker_1': 'If it's 1%, we'll figure it out. Thank you very much.'",
        "'speaker_3': 'Thank you. So I'm going to make a few comments before we go to public comment, which we'll do here in in a minute. But let me just first start off by thanking Councilwoman Pryce, as well as Vice Mayor Lowenthal and Councilwoman Gonzales and Councilman Andrews for authoring this item.'",
        "'speaker_3': 'I think that for a lot of you out there and I know most of most of you that are out there, this is something we've been talking about now for probably a good year, a little over a year.'",
        "'speaker_3': 'And it was a commitment I think I made to all of you early on that we would get here and that this was important not just for me personally, but really for the city and every great. City in America has a thriving art scene.'",
        "'speaker_3': 'That's just a fact. And you can't have a successful city without artists being a important part of that and and the culture that comes with with artists. I want to just begin by saying thank you, because I know that we're passing an agenda item tonight, but it's also a culmination of a lot of work.'",
        "'speaker_3': 'And I don't want to, you know, pass on the night without recognizing some of the efforts that actually got to this point because this didn't happen. You know, just because I woke up one morning and wrote it into a speech, it happened because a lot of people worked really hard for many years to advocate for this, and'",
        "'speaker_3': 'sometimes with not a lot of support and other times with community grassroots support. And I remember the blue ribbon commission that was started years ago, maybe five or six years ago, that made a recommendation in this direction. I think about the recent Arts Council conversation around 1% and the information and report that came out of that study'",
        "'speaker_3': 'as well. And I would hope also, Mr. West, that as we do the study and you kind of look at best practices, that we look at those two recent contributions to the debate as starting points as far as ideas as well.'",
        "'speaker_3': 'And so I think what the we'll make sure that that's something that that's included. And I also want to just thank you for, you know, keeping the the hopes alive. It's been a I think, both exciting but also very difficult few years for the arts.'",
        "'speaker_3': 'And there's a lot of transition happening. I mean, the economy is better. We're starting to see some good news coming out of of people reinvesting. But there's still a lot of support. And 1% for the arts program, by the way, is very common in most large cities in the United States.'",
        "'speaker_3': 'This is not a unique phenomenon. This is this is excelled in most big cities. And we had tight hours in the past directly to our redevelopment agency fund. Most cities weren't doing that. And so we did that for us.'",
        "'speaker_3': 'And it worked for us for a time. You know, it could have worked better in many ways, but it was what it did, its job in some respects. And now we don't have any sort of percent for the arts now.'",
        "'speaker_3': 'That's not to say that the city doesn't commit itself every year to putting money towards the arts. And it does. And in fact, in the last two budgets I've proposed and this Council has been affirmatively increased modestly, but increased funding for the arts, which I want to thank the Council for doing for the last two years as'",
        "'speaker_3': 'well. And so what we're really hoping is that and I think what Councilman Price mentioned is we're going to take a broad look at what a 1% for the arts policy to get, kind of what the best what the best ones out there are.'",
        "'speaker_3': 'So we can maximize this into something that really works for us. The more that we can do, the more inclusive it is. I think we all agree is better and we want it. We want to have the model 1% for the arts program in the country.'",
        "'speaker_3': 'We want this to be the model for for the country. And just to. And just to close, I think that what's exciting to me is that this program should really be about all of the arts. And it's it's not just, you know, it's not just the symphony and the Long Beach Museum and I city and the opera'",
        "'speaker_3': ', but it's also Cal State, Long Beach and the University Art Museum over there and the work they're doing. And it's also. KALB And the individual artists that are kind of working. Some of the guerrilla artists that are out there and doing other work, you know, in the neighborhood.'",
        "'speaker_3': 'So I think it's really for for everyone. And I think a good 1% for the arts program really supports all and whatever we all end up deciding is the funding mechanism and the process will get there. That's not that decision is not done today.'",
        "'speaker_3': 'That will be done months from now with plenty of opportunity for conversations from there. So just thank you all again. And I'm going to open this up now for for public comment. So please come forward. Just say your name, please.'",
        "'speaker_3': 'For the record.'",
        "'speaker_9': 'I'm Victoria O'Brien, the executive executive director for the Arts.'",
        "'speaker_4': 'Council for Long Beach. I have the pleasure to work in District one.'",
        "'speaker_9': 'And live in District two. And I'm here just to say such a huge.'",
        "'speaker_4': 'And heartfelt thank you. Mayor Garcia, Vice Mayor.'",
        "'speaker_9': 'Lowenthal, council members, city manager West and.'",
        "'speaker_4': 'Esteemed other staff and leaders here tonight. I could not be more thrilled. We are so appreciative.'",
        "'speaker_9': 'Of your leadership.'",
        "'speaker_4': 'In bringing this item forward.'",
        "'speaker_0': 'And by we, I mean.'",
        "'speaker_4': 'Everybody. Would you all.'",
        "'speaker_0': 'Stand?'",
        "'speaker_9': 'Everybody who is here for the arts tonight.'",
        "'speaker_4': 'Stand. But this is just to show you a small representation of what we believe the feeling.'",
        "'speaker_9': 'Is out there tonight on behalf of the arts and cultural community.'",
        "'speaker_4': 'In Long Beach. Thank you so much.'",
        "'speaker_9': 'This subject has floated ever since.'",
        "'speaker_4': 'The last 1% for the arts went away with the redevelopment agency. As you've.'",
        "'speaker_9': 'Mentioned, it's come up time and time.'",
        "'speaker_4': 'Again in studies and.'",
        "'speaker_9': 'Surveys in research. And so we're just here to say that we will do whatever we can.'",
        "'speaker_4': 'To support, facilitate help in any way that we can to add to the research, to facilitate discussions. We just want to.'",
        "'speaker_9': 'Continue to work with.'",
        "'speaker_4': 'You and to express our appreciation for this great step tonight.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_3': 'Thank you very much. Next speaker.'",
        "'speaker_2': 'Please. Excuse me. Good evening, Mayor. City council members and city staff. My name is Antonio Ruiz, publisher of Plaza magazine. Com. I want to thank all of you for considering this motion to explore percent for the arts as a funding stream.'",
        "'speaker_2': 'I was a member of that Blue Ribbon.'",
        "'speaker_7': 'Task Force where.'",
        "'speaker_2': 'This very issue was discussed, and I'm glad to hear that even though it says in the motion public art, which is traditionally meant a lot of a lot of things to a lot of different people, I'm glad to hear that you're talking about really a very broad definition of it.'",
        "'speaker_2': 'We did discuss in that task force and in other meetings the the importance of including in that discussion funding to arts for arts, education for artists, community arts organizations, arts support resources, performance and exhibition venues, and a very long list of other needs that we've identified over over time.'",
        "'speaker_2': 'In addition, the task force recommended that an arts and Culture Trust fund be formed to receive the money and dispersant. And there are numerous models around the country that can be studied. I'm hoping that you'll take a look at those models.'",
        "'speaker_2': 'Craig Watson, who's the executive director of the California Arts Council and a former executive director of the Arts Council for Long Beach, has indicated that he would be happy to send us more information on trust funds because he, in fact, was the person who brought it to our brought it to the task force.'",
        "'speaker_2': 'Therefore, I want to thank you again for the motion and thank you for supporting the arts.'",
        "'speaker_3': 'Thank you. Next speaker.'",
        "'speaker_2': 'Please. My name is Mark Zeder. I own a gallery here. A lot of honorable council members. Mr. Mayor and Mr. City Manager. For me and many artists, this is the beginning of a very important conversation. Setting aside percent for art in Long Beach would be a great start.'",
        "'speaker_2': 'I know that spending money for art is a huge challenge and at the same time it's a great opportunity to make smart choice dialog between art community and the city government is crucial. Art is a nature given people's ability to self express themselves.'",
        "'speaker_2': 'We know it as visual arts, performing arts, literary arts. No matter how we defined a monetary need for self-expression, it has to do with helping people and people's ability to be engaged in creating art. Kids, youth. Adults and older generations.'",
        "'speaker_2': 'Hands on creating art. In the past, money for the art.'",
        "'speaker_7': 'Was often.'",
        "'speaker_2': 'Spent on things like public entertainment. Strange looking objects in the middle of our streets or on abstract decorations, questionable space enhancements, and many other things which in result did not help to activate the community in creating art at all.'",
        "'speaker_2': 'All good inventors, all good intentions were present. However, facilitating the development and maintenance of environments where art processes can be practiced is rarely addressed. Yes, I believe facilitating environment for art is the most important cultural need in Long Beach.'",
        "'speaker_2': 'Just to make things even more worth of study, one more element a basic requirement to engage in art are love for self-expression, money and space. All in once, please think about the answer to the question How many residents can engage in art right now?'",
        "'speaker_2': 'Who has that ability to afford space supplies and exhibition location at once? My answer is not enough. Therefore, the role of government support is imperative. Percentage for the art idea is a fantastic start. Myself and many of my artist friends would like to make ourselves.'",
        "'speaker_7': 'Available to all of you.'",
        "'speaker_2': 'For dialog. Let's sit down and work together as a language community.'",
        "'speaker_7': 'That cares about our cultural.'",
        "'speaker_2': 'Reality as a token of an effort to educate and inform. For over a year, every Sunday at a lot of gallery, we host the lecture at 3 p.m. and discussion called What Is Art? It is offered free of charge to anyone interested in the subject.'",
        "'speaker_2': 'And with you I think you have on your desk introductory page of that class. And of course, you're invited to join. Now lastly, I think society expects people to be creative, competitive and full of passion to work outside the box.'",
        "'speaker_2': 'Yet the very source of those abilities, the process of creating art, has been neglected. Let's change that forever and for better.'",
        "'speaker_3': 'Thank you. Thank you very much. Next speaker, please.'",
        "'speaker_0': 'Mr. Moon and the council. Excuse me. I'm Renee Simon, a resident of the third district. I'm here to speak in support of the proposal to establish permanent, consistent funding for the broad range of arts offering in Long Beach.'",
        "'speaker_0': 'Written Art, performing art, painting, sculpting, dance, design, art. I've got a terrible cold and probably others I can't even put a name to today. As a member of the former redevelopment agency. During the nineties, we created the program of 1% for the arts.'",
        "'speaker_0': 'As it applied to the downtown area, developers were asked to set aside 1% of their total development costs to provide some kind of public art generally associated. Oh, thank you. Generally associated with their development project, we enlisted the Arts Council of Long Beach as our partner in helping to select and recommend projects.'",
        "'speaker_0': 'You can see some examples of the result in, for example, the lobby murals in the landmark Square Office Building, which was, I think the first such project, as well as various sculptures along Ocean Boulevard. That program established what can indeed be adapted as a workable model for another funding strategy.'",
        "'speaker_0': 'To my knowledge, we had no significant resistance from developers. The reason, I believe, was that as investors. In the city, they could see the value of this public art in increasing the value of their properties. Today's issue is somewhat different in seeking a funding strategy for arts programs in general, but I believe the concept is perfectly adaptable'",
        "'speaker_0': '. By encouraging the expansion of our strong, diverse arts culture in Long Beach. You'd be increasing the value of investing here, increasing the city's attraction as an arts destination, and increasing the quality of life for all our residents as our city continues to welcome new development.'",
        "'speaker_0': 'Attaching a percent of that growth for art assures a steady stream of public funding and a strong message that Long Beach finds value in the cultural growth of our city. I would hope that you would consider carefully the two most important elements of such a funding strategy.'",
        "'speaker_3': 'And we're running out of time. So I'm going to let you finish with one more.'",
        "'speaker_2': 'Absolutely. Go ahead.'",
        "'speaker_0': 'One that it will provide consistent, dependable funds for our present and future arts programing. And second, that it reflects the Mayor and City Council's strong policy support of the arts in Long Beach. Thank you.'",
        "'speaker_3': 'Thank you so much, Renee. Next speaker.'",
        "'speaker_2': 'Good evening, council members. My name is Daniel Calzado with Coldwell Banker, Coastal Alliance. I live in Belmont Shore. I want to thank you for the forward thinking of Long Beach and how. The Downtown Association of Long Beach has done a phenomenal job building the downtown area to capitalize on what we're talking about for the arts and give'",
        "'speaker_2': 'young kids a chance to show their art and create a career doing so, helping their lives for their entire life. I could totally see shutting down Pine Street for one month a night, having downtown Long Beach, Artwalk. It'll help the local economy.'",
        "'speaker_2': 'All the bars and restaurants. And it'll also be a family affair so local artists can sell their art and have bands playing stuff. I could also see a public gallery where local artists can exhibit their art publicly and also have the chance to sell their art.'",
        "'speaker_2': 'And if done properly, these two ideas could be cash positive. Everything I'm saying is all to attract vibrant, young, entrepreneurial millennials into this city, which will bring companies and people who want to live here for the rest of their lives.'",
        "'speaker_2': 'So that's all I wanted to say. Thank you very much.'",
        "'speaker_3': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Good evening. My name is Kelly Torello. I'm the executive director of the Long Beach Symphony. I'm also the volunteer president of the board of directors of the Association of California's Symphony Orchestras Helping California's Orchestras Thrive. I've been a proud homeowner in District five for 18 years, and I've lived in districts three and four for a decade before'",
        "'speaker_4': 'that. But I work in District two. And as you know, the Long Beach Symphony is a world.'",
        "'speaker_0': 'Class.'",
        "'speaker_4': 'Ensemble, the only symphonic orchestra in the region and the seventh largest in the state of California. You may not know that we.'",
        "'speaker_9': 'Serve 50,000 residents of Long Beach every year, 10% of our population.'",
        "'speaker_4': 'From every single one.'",
        "'speaker_9': 'Of your districts that totals tens of millions of.'",
        "'speaker_4': 'Residents over our 80 year lifespan. And we're not going around. We're not going anywhere. We're going to be here a very long time. We are proud to be a major force in this city, in the.'",
        "'speaker_0': 'In the.'",
        "'speaker_4': 'City's arts and cultural offerings. We look forward to expanding and being part of your renaissance to meet greater meet the needs of more Long Beach citizens. And I wanted to thank you so much on.'",
        "'speaker_9': 'Behalf of the board of directors, our musicians.'",
        "'speaker_4': 'And the tens of millions of residents we will serve. Thank you for making this a priority. I personally am offering my services to make sure that our mutual dream comes to fruition. Thank you.'",
        "'speaker_3': 'Thank you so much. Next speaker, please.'",
        "'speaker_2': 'Very good. You are fully supportive of this measure. With the exception of a couple of things. First of all, I wouldn't do a 1%. I'd go at 2%. Number two, for immediate funding, easy source will cut the mayor's travel budget by 50% and the council budget by 35%.'",
        "'speaker_3': 'Which is very much.'",
        "'speaker_2': 'I want to make sure that the arts organization and I saw some articles in the paper without engender doing this, that the arts organization comply fully with the California Public Records Act, as well as the Brown Act and keeping any records that may contribute to that.'",
        "'speaker_2': 'I'm a big fan of opera. And I really think we should push that. And a lot of people mistakenly mistakenly avoid opera because oftentimes it's in a foreign language. You can't understand it. Pavarotti. I think it was about five years before his death demonstrated that you didn't need to understand that language.'",
        "'speaker_2': 'After he finished, I believe it was don't quote me, I think it turned out and at the Met, he got a tremendous standing ovation, as always. And then he as an encore, segway into and without telling anybody, saying 11 and a half pages at the Hartford New Haven Railroad Times schedule, timetable, and no one knew the difference'",
        "'speaker_2': '. As a matter of fact, it was the first time in the recorded history that a two and a half minute standing ovation over the fact that the 605 at a Stanford would be arriving 20 minutes late period. So it makes no difference what the language is.'",
        "'speaker_2': 'But I think we really should push for opera. Thank you.'",
        "'speaker_3': 'Thank you. We have a great idea if you guys saw the front page of the calendar section of the L.A. Times today. But Lobby Chopper was on the front page of the calendar section of the L.A. Times today.'",
        "'speaker_3': 'So. But fantastic. Their show right now is amazing. Next speaker.'",
        "'speaker_4': 'Good evening, everybody. Thank you, Mayor Garcia and the city council. My name is Jan Hauer and I'm the president of the board of directors for Long Beach Camerata Singers. We are your choral organization and I have both board members and singers here tonight supporting your measure.'",
        "'speaker_4': 'We're very grateful that this is being considered, and I think you'll find both economic return on investment when you do your study, as well as return on investment in terms of the city's reputation. So in closing, I would like to say we sing your praises for this measure.'",
        "'speaker_3': 'Thank you, guys, next week.'",
        "'speaker_4': 'Good evening, Mayor. City council members. My name is Tasha Hunter and I am currently on the board of Directors for the Arts Council of Long Beach. I'm proud to be on the board of directors and I want to first say thank you for making this a priority.'",
        "'speaker_4': 'The 1%, yes, of.'",
        "'speaker_9': 'Course, we would love more.'",
        "'speaker_4': 'But thank you. That is a tremendous effort. I also have the honor of currently working with Long Beach Community College, where I see so many students every day who are artists and to know that they potentially have a job in the arts because we're raising community youth that are so creative right now.'",
        "'speaker_4': 'I have one right here that is a young artist and I can say without the arts, there's a lot of energy that could be spent in a bunch of different ways that could not be could be in effective ways.'",
        "'speaker_4': 'But the arts help strengthen young people, all people. And bringing in Long Beach is so beautiful all the way around and seeing the joys in the arts that we have here, it will not only bring people from other parts of the community, other parts of the city, state, country.'",
        "'speaker_4': 'If we continue this, it will definitely be a premier destination place like some other cities that we have. So I want to say thank you and I want to let you know that Long Beach and art matters.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_10': 'Hello. Mayor Garcia and council members. My name is Sayan Supersu. I'm a member of the Arts Council here, the Language Arts. I also work with the Cambodian community and partnering with the Arts Exchange. So I want to give you a personal story about how art saved my life when I was growing up here in the nineties.'",
        "'speaker_10': 'If you've been around a long beach that long, you know what took place at that time. So I'm not going to go into detail about it. But for me, being involved with the art literally saved my life because it inspired me to stay focused in something creative.'",
        "'speaker_10': 'And now I'm back in the community to actually teaching high school kids salaries here with the art and partnering with the arts exchange to teach them how to be an artist and what careers they could have by bringing other artists in to present and do a workshop.'",
        "'speaker_10': 'So I'm here to push for the 1%. And, and and thank you for your time.'",
        "'speaker_3': 'Thank you very much. Next speaker, please.'",
        "'speaker_4': 'Yes. Hi. I have some correspondence copies that I would like to submit for each of. It just reinforces what I have to say tonight. And my name is Paula McComb. I'm a resident here of Long Beach. I've been here many, many years.'",
        "'speaker_4': 'Grew up here. And of course, I am an artist. I paint abstract, representational art. And I happen to be a member of. Of the Cultural Alliance for Long Beach. I just want to say, dear Long Beach council members, please give some conscious consideration of voting for the arts proposal that's placed on tonight's agenda.'",
        "'speaker_4': 'Though our great city, Long Beach, has undergone many cuts in programs in the recent past due to California's economic challenges. I believe that it is now an optimal time to seek new ways of providing. A new portion of the city's budget back to the arts.'",
        "'speaker_4': 'Several artists in our community, including myself, have collaborated in groups through nonprofit arts organizations. Such as kelp. And we did this to promote many of our artworks over the last several years. The proposed additional funding to the arts from the city government will assist artists more readily in the creation and recognition of their art forms and that'",
        "'speaker_4': 'support spaces of audiences of Long Beach to. To appreciate. An experience. I'd lastly like to speak of my daughters. I had two daughters that have attended Long Beach School System and who are now young women. And they have gone onward to pursue careers in the art field.'",
        "'speaker_4': 'So there's no doubt. That our younger generation of artists will benefit from the establishment of a percentage to the arts policy as an ongoing funding source for the public. Thank you for your consideration.'",
        "'speaker_3': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Good evening, Mr. Mayor. And City Council members. My name is Kenny Allen and I'm the managing director of Evolve Theater. I'm here just to say thank you so much for your support for the arts. And and I have a short statement to read on behalf of the art exchange.'",
        "'speaker_2': 'And the 1% for the Arts Fund has historically had a huge impact on the amount of art produced in Long Beach and consequently improve the quality of life for its residents for decades. This new legislation will again guarantee that art be stitched into the very fabric of our city.'",
        "'speaker_2': 'One development at a time. The many enduring, successful projects and programs previously created around town with this fund are a testament to the importance of these dollars. And I am very grateful to the mayor and members of our City Council for their support of this endeavor.'",
        "'speaker_2': 'And that was from Nico Galvez from the Art Exchange. Thank you very much.'",
        "'speaker_3': 'Thank you very much. Next speaker.'",
        "'speaker_4': 'Hello. My name's Rene Tanner. I'm an artist and a resident here in downtown Long Beach and my professional life. Previously, before I moved to Long Beach, I was a public art project manager in King County, Washington State. I worked for an agency called For Culture, and I'm here to say it's one of the oldest and most established'",
        "'speaker_4': 'public art agencies in the in the country. And there's not a project that goes down that the first thing people say, whether it's a dump or a road or a jail, is where's our public art? And that's a little bit what we need here in Long Beach.'",
        "'speaker_4': 'I was shocked when I moved here that percent for art went away. And I'm so proud, Mr. Mayor, that you've reinitiated this concern and that it's on its way. It's going to happen. I'm one of the people that's like, if you really want to model, let's go for 2%.'",
        "'speaker_4': 'I tried to change my sign, but I didn't have an aggressive let's go for 2%. If you want to model and let's be realistic about what public art funding is about. It's 1% for the 99%. It's 1% for it brings the thinking of artists into every public endeavor, every construction dollar spent, whether it's a park, whether it's'",
        "'speaker_4': 'this or that. Artists are at the table and artists are engaged and they're bringing community identity to the forefront. This is how you do it. This is what a great city does, and I'm so happy that this is on the agenda.'",
        "'speaker_4': 'It's my mantra and I'm a believer and I'm back in you 100%. What do we got to do to make this happen? Final word. We got to have it in the civic center and it's not too late. We cannot build this civic center without a percent for art.'",
        "'speaker_4': 'And we can we can make it happen. Whatever you got to do, make that be the catalyst for this program. Bring it into play before we start construction on those projects. Thank you.'",
        "'speaker_3': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Good evening. Mayor and city council members. And fellow Long Beach residents and creative community American Luna, Long Beach artist and volunteer member of the Cultural Alliance of Long Beach. I want to thank you for your support for this 1% for the arts.'",
        "'speaker_2': 'And from sitting here and here and everything sounds like we're all on the same page. And this is great news. I know it's early in the process, but you know that I would like that we consider all areas of art and that's been mentioned before.'",
        "'speaker_2': 'That it supports all the creative community, creative organizations. Also that it supports our youth. Our youth and our education is very important. I myself am a product of the Long Beach. Educational system and arts was fundamental for me.'",
        "'speaker_2': 'And having been away from from negative things in my environment growing up. So I'm here and this is for me, this is very personal. I would like to thank.'",
        "'speaker_1': 'The community.'",
        "'speaker_2': 'For their support and everyone that's here and that we continue this dialog that 1% is a start and that it's a necessity so that when the economy goes bad that it doesn't go. Hopefully the economy doesn't go bad, but that this doesn't go away.'",
        "'speaker_2': 'Instill this in our youth. Thank you very much.'",
        "'speaker_3': 'Thank you. Next speaker.'",
        "'speaker_10': 'Good evening. My name is Brian Trimble and I am the interim director of the University Art Museum at Cal State Long Beach, which is in the third district. And, you know, I just wanted to say, since I'm representing Cal State Long Beach, that we have a university here in town that boasts one of the largest schools of'",
        "'speaker_10': 'art in any public institution in the nation. And as a university, we train artist. And, you know, the arts are an economic juggernaut and especially in Los Angeles in the southern southern California region. It is a multibillion dollar industry.'",
        "'speaker_10': 'And so what we do with this 1% is we're actually modeling for these kids and these students that are growing up here in our city, that they can work in their fields, that they can become artists, that they can be able to live their lives as creative people and make a living and contribute to their communities.'",
        "'speaker_10': 'So. And Long Beach State is a great partner in the arts to this city. And I really encourage you that when you approach this project, that you do tap into the expertize that is in this room, that is in our community, because we do have it here.'",
        "'speaker_10': 'And hopefully they will help you find your way in this. And I'm going to I'm not going to say if we do the 1%. I'm going to say when we do the 1%. Okay. And lastly, I just want to say, I really agree that we take this broad based approach to looking at 1% of the arts and'",
        "'speaker_10': 'that we don't just focus on something like public art, that we do bring in other elements, that we look at education, how we connect to the school districts. And I really want to make sure that when we do this, that we focus on bringing public art to every district in our city and that we don't just focus'",
        "'speaker_10': 'on the downtown area. Okay. So thank you very much for your time.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_6': 'Good evening. My name is Maha AFRA. I didn't prepare a speech. I'm talking.'",
        "'speaker_9': 'From my.'",
        "'speaker_6': 'Heart. I'm the director of the resident dance company at Camp, the Cultural Alliance of Long Beach. And I'm the chair of the dance department at Cypress College, and our students go to Cal State, Long Beach. Okay. It's amazing school.'",
        "'speaker_6': 'I'm here to advocate for this education because I feel that is.'",
        "'speaker_4': 'Like the poorest member.'",
        "'speaker_6': 'Of the arts. We've been operating at SCAD as a dance company, not only dancing, but also offering classes to senior citizens, to children and to youth. Out of the grace of Mike Wiley, the owner and the volunteers of Camp.'",
        "'speaker_6': 'Please, please help so we can expand our classes and our community outreach, not only at Cal, but other districts. That's not only art, but also dance makes a big difference in people's life. Thank you. Thank you.'",
        "'speaker_3': 'Thank you so much. Next speaker, please.'",
        "'speaker_0': 'Honorable mayor and.'",
        "'speaker_6': 'Honorable council members. I Karen Dhesi, artistic director, producer of International City Theater. And I want to thank you for your support of this idea and your shared understanding of the arts and from what you've expressed and how much you also value what we all do.'",
        "'speaker_6': 'And I hope it's not just.'",
        "'speaker_4': 'Public art but fine arts and performing arts as well, because we all make a difference. I produced Produce.'",
        "'speaker_6': 'Five main stage productions and six education.'",
        "'speaker_4': 'Programs that serve.'",
        "'speaker_0': 'Every district.'",
        "'speaker_6': 'And every demographic from 4 to 104 in our great community. And I think Shakespeare might say.'",
        "'speaker_4': 'The arts.'",
        "'speaker_0': 'To think.'",
        "'speaker_4': 'Perchance to dream. Thank you so much.'",
        "'speaker_2': 'Thank you. Next, bigger piece.'",
        "'speaker_4': 'My name is Cheryl Lake and I am a resident of Long Beach.'",
        "'speaker_0': 'I'd like to thank Councilman.'",
        "'speaker_4': 'Eric Garner.'",
        "'speaker_0': 'For speaking up in behalf of children. I have been involved in arts all.'",
        "'speaker_4': 'My life and in very much everything but painting. I'm not talented in painting.'",
        "'speaker_0': 'But I do understand that each person, each child has this inner ability to express themselves in art. They need that opportunity. I pledge my self as a volunteer to help in any.'",
        "'speaker_4': 'Way I can, and I do.'",
        "'speaker_0': 'Appreciate children and their their impotent help, their potent talents that are inside themselves that they would desire to express. Thank you.'",
        "'speaker_4': 'For the 1%.'",
        "'speaker_0': 'And please do not forget their children.'",
        "'speaker_3': 'Thank you so much.'",
        "'speaker_4': 'Good evening. My name is Liza mitchell. Many of you know me, the founder of Artists Art Program and the curator for the Hotel Maya currently. I'm thanking you as well because it's economically something you guys are going to be able to translate from the arts to how it can be reality by this 1%.'",
        "'speaker_4': 'I look back on these six years. I've lived in Long Beach right.'",
        "'speaker_2': 'Before the.'",
        "'speaker_0': 'Crash. I moved here.'",
        "'speaker_2': 'And I was able.'",
        "'speaker_4': 'To do what I did. I just closed my 38th gallery and empty buildings.'",
        "'speaker_2': 'About two months.'",
        "'speaker_4': 'Ago because a vibrant artist was able to earn enough money to rent it and and live there and make it a studio. I did that with a small stipend of $250.'",
        "'speaker_2': 'A month from the.'",
        "'speaker_4': 'Dolby. And because I sold a painting, I bought a Warhol when I was in college for $900.'",
        "'speaker_2': 'And I sold.'",
        "'speaker_4': 'It for $55,000 when I got laid off as.'",
        "'speaker_2': 'The GM of a media.'",
        "'speaker_4': 'Company during the crash.'",
        "'speaker_2': 'So I would say something I want you all to.'",
        "'speaker_4': 'Think about as well, that you're not only investing in the intangible of your children's futures in the art, but I believe.'",
        "'speaker_2': 'Detroit got out of.'",
        "'speaker_4': 'Trouble by selling four paintings. It is something that if perhaps you had a commissioner that oversaw all of your assets.'",
        "'speaker_0': 'That you're going to be creating with this.'",
        "'speaker_2': '1%. It's something I.'",
        "'speaker_4': 'Really, really. Thank you, Mayor. You've been such incredible supporter, Suja and Linas as well especially. And thank you for bringing this up and following through.'",
        "'speaker_2': 'On your thoughts and your your beliefs in the years.'",
        "'speaker_4': 'That I've known you. I really appreciate.'",
        "'speaker_2': 'It. Thank you. Thank you.'",
        "'speaker_3': 'Thank you, Sylvia. This is our last public speaker. And we'll go to the vote.'",
        "'speaker_1': 'By Tom Stout live in the Wrigley Information File. Art is important. I was a shop teacher. My major was industrial art. Sort of a stretch, but it still was. There's a lot of mechanical arts that are pretty amazing art.'",
        "'speaker_1': 'Elementary, middle high school are like most art programs are suffering. Same as industrial arts programs. Money gets tight and music art are some of the first programs that disappear. And they're not the ones that come back very quickly.'",
        "'speaker_1': 'You know, so, you know, there's public art, private art. I mean, I like a friend of mine's a sculpture. He has three sculptures at Long Beach State. His name is James Russell. He's got sculptures in Cerritos. He's got sculptures in a city of industry.'",
        "'speaker_1': 'Matter of fact, he has them all over the world. Are polished stainless steel. They're beautiful. I traded them a car for one of them. He got divorced and he didn't have his wife got the car, so I built him a Volkswagen.'",
        "'speaker_1': 'So I you know, I'm not wishing them ill health, but. It's, you know, art's important. I mean, industrial arts is just important to me. I mean, there are if any of us ever have an option, go to the SEMA Auto Show in Las Vegas if you want to see rolling art.'",
        "'speaker_1': 'They are there. I mean, there was a stainless steel sculpture that you actually drove. It was polished stainless steel. It was amazing. How in the hell the guy had enough time to do it? I have no no idea.'",
        "'speaker_1': 'I mean, every piece had to be polished, then welded in place, and this thing was made up of a thousand different pieces. And I just wish vocational arts had as much support as the arts do. You know, Lombard City College, thanks to Miss Turanga.'",
        "'speaker_1': 'Cut out 13 vocational arts programs. I think automotive, when you figure you watch Barrett-Jackson, you have cars that sell for hundreds of thousands of dollars or millions of dollars. They're rolling pieces of sculpture. People value them. I value people that are craftspeople that can build and rebuild cars.'",
        "'speaker_1': 'I mean, they are truly artist. A friend just displayed a car at CMA GTO. The owner spent $400,000 on it. Why? Beyond me. But it was a good payday for him. So. Arts are important. Support them. You know, it's one of the first things to go.'",
        "'speaker_1': 'And it's one of the more important things. I mean, anything you can learn to do with your hands has meaning, whether it's woodworking. Auto body programs, whatever. So, you know, we'll this thing, you know, I hope it survives.'",
        "'speaker_1': 'You know, and there's a lot more people, you know, on the high end of this district that really support it. So do what you can.'",
        "'speaker_3': 'Thanks, Tom. Well, thank you. Thank you for that. We're not going to go out and go to go to a vote. Members, please go and cast your votes on the motion.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to receive and file the memorandum to the members of the City Council from the Department of Financial Management dated January 13, 2016 entitled, Responses to Questions from the December 22, 2015 Study Session on the Citys Infrastructure Needs, along with the Revenue Measure Options presentation; or  Direct City Manager to provide additional information relative to the implementation of revenue measure options for the City; or  Direct City Attorney to prepare any and all documents necessary for a possible revenue measure in the City, to be returned to the City Council for a vote to place the measure on a ballot.  (Citywide)": [
        "'speaker_3': 'Great. Well, congratulations, everybody. Again. Thank you. Thank you all for coming out. I know you have been working on this for a long time, so thank you all. We'll all be in touch soon. Thank you. We're going to transition into our next our next item, which is item three.'",
        "'speaker_3': 'We're going to just we're just going to hold for about maybe 30 seconds or so and let some folks exit before we start. Thank you. We're going to go ahead and transition to our next item, Madam Clerk.'",
        "'speaker_4': 'Report from Financial Management Recommendation to Receive and File Memorandum from Financial Management entitled Responses to Questions from the December 22nd, 2015 study session on the city's infrastructure needs, along with the revenue measure, options, presentation or direct the city managed manager to provide additional information relative to the implementation of revenue measure options or direct the city attorney to'",
        "'speaker_4': 'prepare all documents necessary for a possible revenue measure in the city citywide.'",
        "'speaker_3': 'Thank you. We're going to turn this over to staff. I know they've got a pretty extensive presentation. A lot of it, I think, is answering some of the questions that were asked at the the study session. And so I'm going to turn this over to Mr. West, and we'll just go from there.'",
        "'speaker_2': 'Thank you, Mayor. Council members. As a follow up to our December 22nd presentation on infrastructure needs, city staff was asked to work with the city attorney and the city clerk to bring back revenue options for the City Council to consider.'",
        "'speaker_2': 'This topic has been brought up many times over the past several years. A version of the presentation we were about to give was put together in 2012, about four years ago at the request of the City Council at the time.'",
        "'speaker_2': 'Revenue options were also brought up last year at the City Council retreat and this year during the budget process, our assistant finance director, Lia Erickson will present the revenue options present and will be available to answer any questions you have and receive any direction you may put forth.'",
        "'speaker_2': 'And she'll be assisted by the finance director, John GROSS. Lia.'",
        "'speaker_11': 'Good evening, Mayor, and members of City Council. First, I will talk about the current tax rates in the city of Long Beach. Then I'll cover the different types of tax measures, general versus special taxes. I'll then talk about the various tax measure options and then some considerations related to the tax measure options.'",
        "'speaker_11': 'And then finally, some next steps. First I'll go over the current tax rates on for property tax. The city receives approximately $0.22 of every property tax dollar, which equates to about $735 for a 3300 $50,000 assessed home. For u u t, the rate is 5%.'",
        "'speaker_11': 'For example, a combined utility bill of $150 per month would equate to or generate $90 per year in tax for u. U. T. On the sales tax. The city receives $0.01 for every dollar spent in Long Beach, which equates to $68 based on average taxable sales per resident of $6,800 a year.'",
        "'speaker_11': 'For transit occupancy tax, the rate is 12%. That equates to $18 for $150 for a night. Our real property transfer tax is currently at $0.55 per $1,000 in sales price, and that equates to $192.50 for that same 300,000 $300,000 assessed home.'",
        "'speaker_11': 'And then the business license tax varies. But for a retail store with five employees, the cost is $385.40. There are two basic types of taxes. There's a general tax that can be used for general purposes that would go into the general fund.'",
        "'speaker_11': 'And then there's also a special tax for a specified purpose that would be detailed in the ballot measure. These different types of taxes have different requirements for votes, voting both on the city council side and also on the electorate voting side.'",
        "'speaker_11': 'The citizens are also the type of voting requirements differ, whether it's a general election for the city, which would be the April primary or the city June runoff, or if it's a special election, which would be any other election, including state and federal November elections.'",
        "'speaker_11': 'There are some exceptions to the requirements that are listed in this chart. So for instance, a transaction in use tax always requires two thirds of a vote of council, even if it's for general general purposes. And the parcel tax is always considered a special tax for and requires a vote of two thirds of the people, even if'",
        "'speaker_11': 'it's for general purposes. So any specific ballot measures and timing and voting requirements would need to be consulting with the city attorney's office. So this chart, this slide lists the different tax measure options that I'll be covering today.'",
        "'speaker_11': 'First the parcel tax. This is based on a fee per parcel, not the valuation of property. The parcel fee may vary by types of parcel, so a single family could have one type and a commercial could have a different rate.'",
        "'speaker_11': 'It may be designed designed to exempt certain classes or types of property, and it can include a sunset provision and or an annual CPI adjustment as it's a tax levied on property other than a property tax is considered a special tax, so it will always require a two thirds majority vote of the electorate.'",
        "'speaker_11': 'For illustrative purposes, the chart shows what a $50 residential parcel fee a year and an annual parcel fee for commercial .0366 square feet and that would be 13.8 million. And then the chart shows different varying amounts that can go up to $33.1 million a year.'",
        "'speaker_11': 'Next, the existing utility users tax, which is imposed on the consumption of utility services. Currently r u. U t is at 5% and covers electric, telephone, gas and water utility services. It generates $38.6 million from in taxes and 15.'",
        "'speaker_11': 'In 2000, Long Beach voters passed Measure J, which decreased u u t rates by 5%, phased in over five years. This reduction eliminated 15 50% of the city's T revenue, which would have resulted in an additional 38.6 million in 15.'",
        "'speaker_11': 'The next slide shows what a 1% increase in the U. U t would would generate, which is about $7.7 million for each 1%. Also, this can be a general or special tax. And you can see in the chart the Long Beach rate at 5% compared to some benchmark cities.'",
        "'speaker_11': 'In addition to expanding the existing utility users tax, we also have the option of Irene of expanding to additional utility services so we could impose the utility users tax on sanitary sewer, refuse collection and cable television services. If we use that current 5% UUT rate, we could generate 800,000 for sewers tax 2.1 million for refuse and recycling'",
        "'speaker_11': 'collection, which excludes private haulers which already have a franchise fee. And we could also generate $5 million for cable television. Next I'll cover the local sales and use tax, which is levied on sale, storage use or consumption of tangible personal property.'",
        "'speaker_11': 'The current sales tax rate in Long Beach is 9%, which is split with the state at 6.5, L.A. County MTA at 1.5, and Long Beach receives 1%. In FY 15, Long Beach received $59.4 million in revenue from this tax per state law.'",
        "'speaker_11': 'The city could add on a transaction and use tax also sometimes called a district tax of up to 1%. This works generally the same as the sales and use tax. However, there are differences into how and where this tax is applied, so the figures below are rough approximations.'",
        "'speaker_11': 'So for illustrative purposes. Point 25 tax increase could generate 12 million up to a 1% tax, which could generate $48 million per year. This also could be a general or a special tax if it's dedicated for specific use.'",
        "'speaker_11': 'However, in either case, it does require a two thirds vote of the council to put on the ballot. This next chart shows the the combined sales and use tax rates for benchmark city's other local communities and those cities in L.A. County that also have increased sales and use tax through the transaction and use tax increase.'",
        "'speaker_11': 'You can see that La mirada, Pico Rivera and Southgate already have an increase of 1% of the transaction and use tax in addition to the normal 9% rate. Next, the business license tax. We currently charge a business license tax that varies by the type of business and does include an annual CPI adjustment.'",
        "'speaker_11': 'Other cities charged license taxes on a wide variety of basis and increments, making some comparisons difficult for 15, the business license checks generated $12.7 million. An increase of $50 per current business license account could generate approximately 1.5 million annually.'",
        "'speaker_11': 'This could also be general or special tax. Next is the oil barrel tax. The city currently taxed its oil production by volume, which is called a barrel tax for two two purposes. One is $0.15 per barrel for general purposes, and the other is $0.28 per barrel.'",
        "'speaker_11': 'And that's the rate as of June 14 for public safety purposes. This is called Prop H and that does include a CPI index. Citywide, we we did produce 13.3 million barrels in 15, which generated 5.7 million for both general fun and prop age.'",
        "'speaker_11': 'Other cities use different indices to calculate their barrel taxes based on last year's numbers. Every 10% saw a ten cent increase in the city's current tax rate, which generate approximately 1.3 million. However, production and is lower this year as anticipated, were lower, so the amount would probably be lower.'",
        "'speaker_11': 'The oil severance tax is a value based oil tax and is based on the percentage of actual sale price of oil or on a rate from published price index. To achieve an equivalent $5 million from this tax, we would need to institute a tax of 0.65%, which was based on the 15 average sale price of $57.96 a'",
        "'speaker_11': 'barrel. You can see on the table the various rates that would need to be charged based on last year's numbers. I once again priced in production are being impacted, so these amounts are probably conservatively too high. Culver City is the only city known to be assessing the severance tax.'",
        "'speaker_11': 'Next is a transient occupancy tax, also known as Totti, which is a hotel bed tax paid for the occupancy of a room. The current rate is 12%. For downtown area, there is a self-imposed business license surcharge, which gives us an effective rate of 15%.'",
        "'speaker_11': 'The total generated $23.9 million in revenue in 15, with 17.2 million of that going to the general fund. So every 1% increase in the rate would generate 1.4 million to the general fund. The table below shows the total rates to compare to benchmark cities.'",
        "'speaker_11': 'And once again, this can be general or a special tax. Next is the parking tax, which can be levied on public and private lights located in the city. And it could be based on a percentage of total parking revenues or a number of spaces this would not include on street metered parking.'",
        "'speaker_11': 'We currently do not have a parking tax and parking lot operators would be required to collect the tax and remit the collections to the city. We have an estimate of about $1.7 million from a 10% tax on the city owned parking lots.'",
        "'speaker_11': 'And we have a we don't have a solid estimate for private lots, but it's anticipated that that could be up to another $1.7 million. It could also be general or special tax. This next chart shows the city's benchmark cities and their parking tax rates.'",
        "'speaker_11': 'A total of 25 cities in California do levy a parking lot tax, including San Francisco, L.A. and Oakland. Real property transfer taxes next. And this would be a charge that is a charge that is applied to the transfer of ownership of real property.'",
        "'speaker_11': 'Our current transfer tax is a dollar $0.10 per $1,000 sales price. The county retains half a $0.55 along beach retains $0.55. We currently receive about 1.7 million per year and the state law sets this rate. But as a charter city, Long Beach can, with the citizens vote, approve its transfer tax at a higher rate.'",
        "'speaker_11': 'However, if this fee is increased, the county retains the original dollar ten and the city will receive the rest. So to double the current annual revenue amount of 1.7 million to 3.4, the current the city tax would actually need to be $2.20 per thousand dollar.'",
        "'speaker_11': 'This could also be general or special tax. And this next chart shows the transfer tax rates of our benchmark cities. The emissions tax can be levied as a gross receipts tax charge for entry to specific entertainment, sporting, recreation and or amusement activities.'",
        "'speaker_11': 'Or can be imposed on a consumer on a per ticket basis. It can also be extended to include gym memberships and spas. The cities that often find do emissions tax are the ones with major sporting venues or amusement areas like San Francisco, Pasadena, Pomona and the cities you can see here listed in the table.'",
        "'speaker_11': 'This could also be a general or a special tax if dedicated for specific use. Next, I'll briefly discuss some funding mechanisms for infrastructure. The city does have the ability, with the vote of both city council and the public, to do general obligation bonds.'",
        "'speaker_11': 'This is an ad valorem tax or property tax that applies to the assessed value of taxable property. Bonds can only be used to finance acquisition or improvement of real property. So capital improvements versus operations like public safety, a strong credit rating by the city does mean lower bond cost for the city, and this requires a two thirds'",
        "'speaker_11': 'vote of both the city council and the electorate to do. Other financing sources include a community facility district. However, this must tie to a new development and assessment district in which must tie to the benefit of the real property that's that's been benefiting from the improvement or service that's going to be funded.'",
        "'speaker_11': 'And then also lease revenue bonds, which are currently used right now on a case by case basis for financing of infrastructure and equipment. Now I'm going to go over some of the considerations for these tax measures. The parcel tax, which would be a new tax, is predictable and reliable that is usually viewed as another form of property'",
        "'speaker_11': 'tax. A utility user tax could be either an increase or new expansion, and this does have a relatively large tax base, but it's based on commodities, some of which are in decline like telephone. The local transaction and use tax would be an increase to our sales and use tax.'",
        "'speaker_11': 'Potentially could affect consumer shopping habits. However, our consultants have not noticed a difference in other cities that have implemented this tax. This is also sensitive to economic conditions and would grow in a strong economy in decline in a recession.'",
        "'speaker_11': 'The business license tax would be an increase. However, this is a revenue increase, relatively small compared to other options. Oil taxes would be an increase in perceived or new and perceived impact very few taxpayers directly. And it potentially could result in decreasing oil production in Long Beach.'",
        "'speaker_11': 'The transit occupancy tax would be an increase, which potentially could be detrimental to convention bookings and tourism and relatively small revenue compared to other options. The parking tax would be new and that would impact few private parking lots and have revenue relatively small for those lots and high cost for the city to minister and also the high'",
        "'speaker_11': 'costs for the city's parking garages. The real property transfer tax would be an increase, which actually the implementation benefits the county at the cost of the property owner first and then the revenue increase is relatively small compared to other options.'",
        "'speaker_11': 'Emissions tax is new and this could be detrimental to special events, booking and participation in life. And also the revenue increase is relatively small and then the funding mechanism for infrastructure is limited to real property acquisition improvements and so cannot be used to fund operations like police or fire.'",
        "'speaker_11': 'So here are some next steps. Should the city council wish to proceed with a ballot measure? City Council would need to decide on a measure type and tax amount, develop a ballot measure language and determine timing of the ballot measure.'",
        "'speaker_11': 'The next general election for the city is the April 12th, 2016 primary. However, that filing deadline is passed. The following general election is June seven, 2016. The runoff election. And for that to meet that date, City Council would need to adopt a resolution in February to meet the March 11, 2016, filing date.'",
        "'speaker_11': 'And depending on the measure, it would either require a simple majority vote or in the case of a transaction and use tax or general obligation bonds. A two thirds vote of the city council. The November 8th, 2016 election will be considered a special election for this city.'",
        "'speaker_11': 'And in order to meet that date, a resolution would need to be adopted in July to meet August 12th filing date. And depending on the measure, it would either require a simple majority vote of the Council for a special tax, a two thirds vote for a transaction and use tax.'",
        "'speaker_11': 'Who are unanimous vote of council on a declaration of fiscal emergency for a general tax. The cost of the election will depend on the timing. Other issues on the ballot. And if city or the county conducts the election.'",
        "'speaker_11': 'If the city conducts the election, there would be no additional cost for a general election with citywide candidates on the ballot. However, this is not the case in six. The next citywide election is 2018. It would cost 1.6 million for the city to conduct a special election, if only the city.'",
        "'speaker_11': 'Every city measure was on the ballot. And for the June election to expand from the even districts to all nine districts, it would be an incremental cost of 900,000. If the city conducts the election and it's during one of the regularly scheduled elections for June or November, it would be 560.'",
        "'speaker_3': 'I'm sorry. I think you mean the county, right? I think you said the city. What? I think you mean the county.'",
        "'speaker_11': 'Oh, I'm sorry. Of the county. Thank you. It would be 565,000 for the June election and 433,000 for the county to conduct the election on behalf of the city for the November. We did not ask the county to cast out a special election just for the city only measure.'",
        "'speaker_11': 'This concludes my presentation and I stand ready to answer any questions you may have.'",
        "'speaker_3': 'Thank you. I'm going to thank you for that. I'm going to make a few a few comments and then I'm going to turn this over. There's a I think everyone's plugged in to say a few words. And I know this to be a lot of questions tonight, which I think are really important.'",
        "'speaker_3': 'I just want to just start by just kind of taking this back a little bit. I think that it's important to note that this this is a conversation I know that this council but other councils have had, I think, for for many years.'",
        "'speaker_3': 'I think that the largest challenge in front of us as a city and I mentioned this at the state of the city, is our $2.8 billion need when it comes to infrastructure and capital infrastructure. We're talking about our sidewalks, our streets or alleys that are in in terrible condition are public buildings.'",
        "'speaker_3': 'But most importantly, those streets that connect our neighborhoods and the systems that connect our neighborhoods. And it's not just the streets, but an incredibly important part of our deteriorating infrastructure. As many of you also know is our water systems, our water conservation systems or storm drain systems.'",
        "'speaker_3': 'The systems that protect our neighborhoods and improve our water. Our water quality are all crumbling. And while we have and the city continues to invest significant dollars every year, there is no question that no matter how much we invest, our our systems and our infrastructure continue to get worse because we just don't invest enough.'",
        "'speaker_3': 'We'd have to substantially increase that investment. And obviously the city currently can't afford to do that. And so we are in a in a difficult position when it comes to infrastructure. And I mentioned that my state of the city and I think most most folks understand that there is a need and that if we are going to'",
        "'speaker_3': ', as a community, have to have a conversation about how we pay for a world class city and how we move forward and ensure that our community is strong and prepared for this next century. In addition to the incredible infrastructure needs, we also have other needs now.'",
        "'speaker_3': 'These are different needs. But while this is, I think, focus on infrastructure, I don't want to leave out the fact that this city continues to have challenges when it comes to ensuring we have enough police officers on our street and that we have enough paramedic response times and firefighters to patrol our communities.'",
        "'speaker_3': 'And so we have a lot of needs. And certainly I think infrastructure is the largest, but those are our public safety needs and our infrastructure needs are critical for the success of our future. An interesting fact is that I think if you look back at the history of Long Beach, it was it's been 25 years since Long'",
        "'speaker_3': 'Beach voters actually increased any sort of revenue. So I think it was 1991 was was the last time. But as far as any general obligation bonds and that's been I think it's been the 1960s since any of that has has has happened.'",
        "'speaker_3': 'And so while others around us including other cities in the county, certainly Long Beach City College and and and Miami Unified, which we have supported, the city of Long Beach's has not. Increased revenue significantly. What we have done is decreased in many ways government.'",
        "'speaker_3': 'We've eliminated more than 700 positions in the last ten years. We've leaned government believe we've made it more efficient and we've also partnered with our employee unions, particularly our city employees, our firefighters and our police officers to enact pension reform.'",
        "'speaker_3': 'And that pension reform, as we all know, saved the city and is saving the city over $250 million over the next ten years. So pension reform has been in place. We've eliminated 700 positions, including, by the way, police officers and firefighters.'",
        "'speaker_3': 'And we have tried to be as efficient as possible with the resources that we have. And so as we move this conversation forward tonight, I know there's going to be a lot of questions which which is which is really important.'",
        "'speaker_3': 'I want to just mention a few things. The first is and these I think are important as we move forward. One thing is and I think there's you know, I think there's beginning to be reports about about this issue in the media and conversations.'",
        "'speaker_3': 'As a reminder, this city council can't raise tax revenue or investments. This body can't do that by a vote of the body. The only people that can actually bring in this type of revenue are the voters of Long Beach.'",
        "'speaker_3': 'And so the council cannot, on its own, raise the taxes that were being discussed in this conversation. I think that's an important distinction that sometimes gets lost in headlines or in articles I read. It's this body can't do that.'",
        "'speaker_3': 'Only the people can do that. In addition, I just want to leave us with two thoughts as we as we as we move forward. The first is as we consider possible investments and possible revenue measures, I think there's two things that should they're important to guide our conversation.'",
        "'speaker_3': 'The first is that I personally don't support any new tax investments unless they sunset and unless they end. I think that good tax policy should always sunset and end. And I personally don't believe in ongoing types of revenue sources.'",
        "'speaker_3': 'And so I think smart revenue measures come in when there's a need, there's an investment made by the public, and then they sunset out. And so it's a more responsible way, I believe, of doing any type of revenue measure.'",
        "'speaker_3': 'I think those are always the best types. The second thing I'll say is one of the things that's really necessary in the city is to strengthen our reserves. Now we have actually already a strong emergency reserve. We have a strong or growing rainy day, rainy day fund, which has actually grown a few million dollars over the last'",
        "'speaker_3': 'year, thanks in large part to this council and the one before for adding to it. But I'm hopeful that any conversation about revenue begins also with this idea that we need to, first and foremost, also strengthen reserves. And so if this council and if we decide as a community to move forward and voters have a chance to'",
        "'speaker_3': 'weigh in, my hope would be that any new measure would include a significant increase to our reserves to ensure that future years are stable for this community in the long run, and that we don't go back into difficult deficit years in the future.'",
        "'speaker_3': 'And so those are important things. And as we all know, reserves also help with future credit ratings. We already have pretty decent ratings, pretty good ones. It'd be great to have to have the best. And so those are our two things that I think are important as we move this conversation forward.'",
        "'speaker_3': 'And I also just want to want to mention as well that over the course of the next couple of weeks, I know I plan to and I know I'm sure other council members do as well. We plan to have conversations with folks in the community.'",
        "'speaker_3': 'I certainly a meeting with community some community leaders and business leaders next week as well as a variety of other folks. So it's important that we kind of hear and what they have to say as well as talk about the the incredible need that we have and challenge that we have in front of us.'",
        "'speaker_3': 'And so with that, I'm going to turn this over to to the council, starting with Councilwoman Gonzales.'",
        "'speaker_6': 'Yes. I want to first thank our city staff, our financial management department. This was a very great presentation, very thorough. I think what I gathered from it was that we have a lot in front of us. We have a lot to certainly consider.'",
        "'speaker_6': 'And I agree with what the mayor states is that, you know, almost $3 billion in infrastructure needs is is definitely an undertaking that we have to not turn a blind eye to. We actually have to face it head on and look to see what other alternatives there are in our city in terms of opening up new revenue'",
        "'speaker_6': 'streams. And so at this point, you know, I certainly believe that, you know, we have the opportunity to present this and look at what we can offer our residents and see if it is something that they want to do in terms of infrastructure.'",
        "'speaker_6': 'I also think as well, just, you know, along side our streets and sidewalks and alleys, you know, we had a great infrastructure report from our mayor. Before that I had brought forth Safe Alleyways Project that looked at some of the dirt alleys that we still have in our city.'",
        "'speaker_6': 'And I'm still in awe that we have alleys in some places that also do not have sufficient lighting that adds to our issues within public safety. And so I think that getting those reports and then having this plan in place would be, you know, kind of good timing for us to look at all this.'",
        "'speaker_6': 'In addition, I think as well which compounds the issue is unfortunate the are one time funds many time rely on our oil revenue and we know right now that we're below $30, which is pretty bad. The economy right now is, you know, in that sense, isn't doing well.'",
        "'speaker_6': 'And so I think that we do have to look at other opportunities. I do have a question, though, a couple of questions that may have been answered. I just wanted to ask them first, when was the last time we had a ballot measure of this sort in our city?'",
        "'speaker_2': 'Mr. MODICA So I think the Mayor pointed out the last time that we had a significant revenue measure that was, you know, for general purposes, it really provided a tremendous amount was back in the 1990s when the suit was raised in 1991, 92 in that area.'",
        "'speaker_2': 'We have had some smaller measures. It was Prop H that was very specific and the medical marijuana. But neither one of those are considered general tax measures that support, you know, the, you know, city government. You know, those are very limited in specific taxes.'",
        "'speaker_6': 'Okay. Thank you. And then are you t. Currently it's 4%, eight percentage points lower than los angeles. And when was the last time that was in the report? But. When was the last time that we did anything with our user utility tax?'",
        "'speaker_2': 'So the you t was actually changed in 2000, 2000 and it actually went down. So it went down from 10% down to 5%. So it stepped down 1% each year. After that, the city has taken an action to clarify the u u t.'",
        "'speaker_2': 'But the voters may remember that they voted on a u t that didn't generate any additional revenue that was just to comport to some changes in federal tax law. So but we've actually gone the other way on the U.'",
        "'speaker_2': 'T not an increase.'",
        "'speaker_6': 'And should we I know currently we're going to receive and file this, but if we should move forward with bringing this moving this along, we would be able to clarify language or look at language that we can put forth on the ballot.'",
        "'speaker_2': 'Yes. The city attorney can talk to you a little bit about what that process would look like. But we've outlined there are two options. There's June and there's November. June would require some decisions in the next couple of weeks.'",
        "'speaker_2': 'And April is really not an option at this point anymore.'",
        "'speaker_6': 'Okay. And this wouldn't have to go through any other committee like elections oversight. This can just be done here. Just to clarify that.'",
        "'speaker_2': 'That is correct.'",
        "'speaker_6': 'Okay, great. Thank you very much.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilmember, your.'",
        "'speaker_7': 'Thank you, Mayor. You very much outlined the challenges that we have with not only our infrastructure, but also with our public safety. Also included in there. We're looking at closing of libraries, parks, recreation programs, and also we're looking at the increase and the spikes that we have in crime and of course, the needs that we have with'",
        "'speaker_7': 'our fire services. So I think that when it comes down to the issue as a whole, I'm glad this is being brought forward because we are being challenged and we do have issues that we need to look at.'",
        "'speaker_7': 'We're looking at every year we're deferring maintenance to another year and as as we defer those costs increase. So we do. I'm not saying it's urgent, but it is pretty pretty much there in terms of what we need to do in reviewing this this issue here.'",
        "'speaker_7': 'I was very much concerned back in 2000 when we looked at the utility users tax and the effect it was going to have going from 10% to 5%. And the the impact of that was immediate. And we haven't been able to recover since it was an immediate $80 million hit because it was half of our half of'",
        "'speaker_7': 'our budget that we would get from the utility. And we've been struggling ever since. As a former city employee, I was I was very much aware of the impact that the utility had on our budgets and on our need to lay off a number of of of individuals from their jobs and also the elimination of a number'",
        "'speaker_7': 'of programs that had that had to go away. And we're talking about even now, as as we talk about the increase in crime, you know, our gang unit had to go away. So we have to look at ways that we can bring back some of those programs.'",
        "'speaker_7': 'And I'm looking at at the possibility of what's taking place here would be the the seriousness of looking at the at a at a new building, a new revenue stream for for us to look at the the concern I would have, obviously, because there's a lot of different machinations that need to take place, whether we go for'",
        "'speaker_7': 'a general or a special, whether what the threshold is with the electorate and what the threshold is here on the on the city council, whether it's a simple majority or two thirds. So we we have to look at this seriously.'",
        "'speaker_7': 'Obviously, we're going to receive and file this document today. We're going to have more discussion on this later. I'm sure that there's going to be some other additional questions that each one of us will have as we move forward with this.'",
        "'speaker_7': 'In terms of what the timeline we're going to we're going to choose whether it's June or whether it's in November. But we do have to look at it very carefully because we want to make sure that we get enough of of information out there for the electorate, for for the residents to evaluate and was looking at this'",
        "'speaker_7': 'to give them the time that they need to determine what they can or cannot support. So I'm glad that we got this this report very thorough. Some of the questions that I had coming in were answered in regards to a general or a specific election, the November versus June versus the November election.'",
        "'speaker_7': 'Those questions were answered for me as well as Councilmember Gonzalez clarified right now in terms of the whether it's a committee of the whole city council or an elections committee. So he's not going to be coming to the elections committee.'",
        "'speaker_7': 'It's going to be the committee of the whole. But I think that that's what we need to keep in mind, is that there's going to need we're going to need some time. We're going to need some time to take this out into the community, get their feedback and get get some guidance as far as what we can'",
        "'speaker_7': 'and cannot do personally. As I mentioned before, the U.S. tax went from 10 to 5. And I think if we were to look at the you that you you the uut opportunity, it would be it would not be an increased tax.'",
        "'speaker_7': 'It would be a recovery as far as I'm concerned. You know, it sounds like semantics and it probably is, but it's not. When it comes down to the big hit that we took in 2000 and trying to recover some of that money now where we're at, you know, for the future in looking at that tax here.'",
        "'speaker_7': 'So looking forward to the continuing conversation.'",
        "'speaker_3': 'Thank you, Councilman Richardson.'",
        "'speaker_5': 'Thank you, Mr. Mayor. I want to thank staff for this presentation. I remember the president the similar presentation back in 2012. I want to thank the residents who have already sort of reached out to me about this issue.'",
        "'speaker_5': 'You know, I see some of your comments from from Ardoyne, the Hamilton neighborhood. I see. I hear you. I, I. I do plan to. You know, I don't know what the answer is at this point. I know that there are a lot of questions and that we have to grapple with those questions.'",
        "'speaker_5': 'But I do plan to go out to the community and talk with our North Long Beach leaders and have an honest discussion about the circumstances in the state of our our you know, our infrastructure and our services. My thoughts?'",
        "'speaker_5': 'I have a number of thoughts and a number of questions related to this. You know, it's no question that our streets and sidewalks are failing and that the longer we delay maintenance, it becomes more and more expensive. I know that we have a number of dirt alleys in Long Beach.'",
        "'speaker_5': 'I know that certain neighborhoods north of Artesia and north of 91 Freeway still do not have sidewalks. And the fact is, our district annual allocation for sidewalks, just it it just won't cover it. It's not enough for us to really keep up.'",
        "'speaker_5': 'I was interviewed last year some time by Univision and had to actually explain why we as a 21st century still do not have sidewalks in all of our communities. And then in terms of our facilities is no question.'",
        "'speaker_5': 'I'm a proponent of of of making sure that we have a Highland Park community in the future. But the truth is, demand is growing. Our facilities facilities are failing. The Highland Park Community Center is literally 90 years old, and we're still utilizing that building today.'",
        "'speaker_5': '90 years old. There are issues with asbestos. There are seismic issues. The community has grown over the last 90 years. That is a community center we designed a long time ago. Will not meet the community center today. Literally, it serves 20% of Long Beach, its population, the 1985 zip code.'",
        "'speaker_5': 'We can't continue to ignore that. We can't continue to ignore North Long Beach. And this isn't simply any park. This is one of five regional centers. And I want to just ask it's Parks and Recreation here. I want to simply ask the question, what is the distinct difference?'",
        "'speaker_5': 'How many how many regional centers do we have? And what is the distinct difference between a community center and regional center or a park in a regional park?'",
        "'speaker_2': 'Honorable Mayor, members of the City Council. Councilmember Richardson We have 26 community centers throughout Long Beach that serve primarily our youth, age 5 to 12 afterschool programing. Of that, we have five regional centers, including Halton, Silverado, Eldorado, McBryde and Chavez, that offer a more robust offering of programs and services, which include our teen population in addition to'",
        "'speaker_2': 'senior programing. So that's really the distinction there, the teen programing and the senior programing at those five locations.'",
        "'speaker_5': 'So these five locations. And thank you. Thank you, Mr. Scott. So these five locations across town are typically situated next to high schools, are typically spread out from one another and typically larger. And they have additional they have additional functions that they have to provide.'",
        "'speaker_5': 'It's one of five areas that provides senior senior services and teen services. And that's critically important given our very young, our aging community and our very young community that's developing. And it has a lot to do with public safety and crime.'",
        "'speaker_5': 'We've done well. But to demand and request that our police officers, our public safety personnel continue to do more with less. When we see the national trends increasing, that's a recipe for disaster. The truth is, we you know that our we're at historically low levels in our police department.'",
        "'speaker_5': 'And and, you know, I don't I can't quote how many decades it's been. I won't get into that. But it's time that, you know, we've seen the reports. It's time to double down on public safety, stumbled out, time to double down on violence prevention.'",
        "'speaker_5': 'Now, in terms of response services, I think it's no secret we had a big conversation last year about the loss of Ramadi and what that means for our our paramedic response times in our services. And a few months ago, we had a conversation about and we really dissect it.'",
        "'speaker_5': 'What does it mean when we go from nine paramedic rescues to eight? What is the impact on those services? And I think the fact that we had that conversation then is really relevant today because there is a real difference and a real strain on our system.'",
        "'speaker_5': 'As a matter of fact, is the fire chief around? Can Chief Terry, can you just elaborate? Is there a distinct difference between when we go from a certain level of paramedics and our system to and we take out just one paramedic.'",
        "'speaker_5': 'So if we go from nine paramedics to eight, what does that materialize and actually look like on our paramedic system?'",
        "'speaker_2': 'Mr. Mayor, Councilmembers Councilmember Richardson, as I have discussed here before, our system is comprised of all the parts and they work in concert with each other. So in the event you reduce our resource capability by taking a resource out of service, what ends up happening is the remaining resources will need to pick that up.'",
        "'speaker_2': 'So by removing one resource, it does have a tremendous impact citywide on our system.'",
        "'speaker_5': 'And you know, and thank you so much. I think that is something that is a tremendous context for this conversation that we've actually seen the difference in what happens when you have a big hole in our system. And so this is you know, I personally believe it is a responsibility of our city to provide public safety, to'",
        "'speaker_5': 'make sure that we can respond to emergencies and actually in a timely manner. And, you know, the fact is, the numbers, the number of of, you know, incidents that we have is staggering. It's continue to grow the number of emergency calls that we have.'",
        "'speaker_5': 'But we are at modern. We have the lowest levels of paramedic response to respond first responders than we've had in modern history. So the truth is, I mean, this is a tough conversation we're going to have to have.'",
        "'speaker_5': 'I was watching earlier this week, I saw that the Gazette's editorial board released a piece that I thought was was very reasonable and hit the nail on the head I shared with my social media. And in plain talk it made a good case.'",
        "'speaker_5': 'It essentially said that we've been fiscally prudent. We've made, you know, significant reductions in our budget. We've, you know, I'm paraphrasing, but we've cut our staff. We've cut our staff to the bone. We've been more efficient. We've partnered with our rank and file to reform pensions.'",
        "'speaker_5': 'The belt has been tightened. That's the truth that, you know, there is no more fat on the bone to cut. And so. That said, you know. Deserve a voice. They deserve to weigh in and say how they you know, what they believe our city should be today and in ten years.'",
        "'speaker_5': 'Do they want to balance the budget at the risk of, you know, slow response times? Hundred year old community centers, asbestos crumbling? But before we commit to that, there are there are, you know, some conversation need to happen in our city.'",
        "'speaker_5': 'We need to make sure that we're aware whether or not we're going to continue to build a second tier city. I think that this the presentation also, I think it was interesting and I want to throw this into the air that there was a $700,000 difference between a June election and a November election.'",
        "'speaker_5': 'So that makes a lot of sense to me to go with the cheaper election, which it's looked like was June. Am I correct? Mr.. City Manager That June was, it was like $700,000 cheaper.'",
        "'speaker_11': 'Councilman Richardson, the June election is conducted by the state. His 560 are sorry. I keep on saying the wrong thing. The county is $565,000. The November election is 433,000 and is the estimate. The November election, though, would be considered a special election by the city and would require a two thirds vote of the public for a special'",
        "'speaker_11': 'a special ballot measure unless a unanimous vote of city council declaring a general emergency was declared for a general election. General tax measure on that that item.'",
        "'speaker_5': 'Yeah. I didn't hear that. I was I was looking for the slide, but it was at the $700,000 difference and I catch that.'",
        "'speaker_11': 'I think what you're looking at is if the city conducts the election and it was just a special election that the city did in November, that would be 1.6 million. And then if it was in June in the city conducted it, it would be 900,000.'",
        "'speaker_11': 'So that is a $700,000 cheaper if the city conducted. But even more even less expensive. Expensive would be if the county conducted the election.'",
        "'speaker_5': 'Okay. So so that said, I mean, it makes a lot of sense to me to do a June a June election. What the what the measure looks like, not quite sure. But I'm going to go out I'm going to talk to I'm going to talk to my residents about this issue and have a really, really tough conversation'",
        "'speaker_5': '. So thank you so much for your time and I look forward to what this turns into.'",
        "'speaker_3': 'Thank you. Council Member Austin Thank you.'",
        "'speaker_1': 'And I will try to be brief. I know that we're going to have a lot of comment from the council here. I want to thank financial management and staff for this report and putting it together so, so quickly, expeditiously.'",
        "'speaker_1': 'We asked for this just a few weeks ago. And this just shows again. I think the quality of our staff to give us this information is such a timely manner. This is unfortunate in some respects because I think it falls short of the $2.8 billion addressing that need.'",
        "'speaker_1': 'But it does give us some options to enter in an avenue to make significant improvements in our infrastructure. And I know there's been conversation here about public safety as well, which we do need to address. I'll speak on that as well.'",
        "'speaker_1': 'I think when I talk to my residents, the infrastructure and public safety are among the top concerns. These issues are universal. No matter how much of our residents home values are or what neighborhood they live in. If you go into some of the nicer neighborhoods in the eighth District and little Cerritos, you'll find that our our curbs'",
        "'speaker_1': 'are falling apart. Our sidewalks need to be repaired. Alleys and Bixby nodes are dirt and pothole laden. And in the north Long Beach, we have crumbling streets. This issue infrastructure resonates with our residents and they live it and see it every single day.'",
        "'speaker_1': 'And they look to this council. They're looking to the city to fix it with limited resources. And it's very difficult. And I said this before, it's very difficult as a as a city leader, as a elected leader in the city to not be able to address those critical needs.'",
        "'speaker_1': 'When residents when it rains, you know, there are puddles in front of people's homes for days on end. And they want it fixed. They want it fixed now, and they really don't want to hear the excuses. So having these options in front of us give us gives us the ability to at least say, hey, we can have'",
        "'speaker_1': 'a conversation with our voters citywide and put the question to to them, to our residents, whether or not and how. They'd like to see the infrastructure needs fixed. As many as I've spoken before, many of us I've been involved with the state led committee and over the last year particularly have been advocating for state funding for for'",
        "'speaker_1': 'infrastructure needs on the local level. I'm encouraged that something may happen, but I don't think we can depend on Sacramento to fix the vast needs that we have here in the city of Long Beach. I don't think any local government is smart to depend on a revenue source from the state to do that.'",
        "'speaker_1': 'We have to control our own destiny. And I think Long Beach is really at a crossroads. We need to decide whether or not we want to be a world class city or we want to be a third world city.'",
        "'speaker_1': 'I mean, and it's just that simple. We are if we don't address our revenue today, if we don't address it very soon, we run that risk. And I don't think any of us want to see that. And again, this is this is a conversation that needs to be had with our residents.'",
        "'speaker_1': 'I think on the public safety front, maybe one or nine and one is 47 I'm sorry, 47 has had an impact on rising crime numbers. And the city was not necessarily we didn't have a five year plan or a three year plan to adjust for that.'",
        "'speaker_1': 'But we know now that that we need to make adjustments to our public safety needs, and I'm prepared to do that myself. Personally, I'm curious to know how much revenue was lost. And this is a question for financial management.'",
        "'speaker_1': 'How much revenue was lost with the decrease in the utility users tax? Over the period of time that it was. It was has been been a revenue source left.'",
        "'speaker_11': 'Yeah. Councilman Austin, if we had it at the 10% rate, we would be collecting $38.6 million more per year. And so that's the amount. I mean, if you wanted to run it over the ten years.'",
        "'speaker_1': 'And I'd be just just off the top of your head and I know I'm asking a lot of you right now, but how many, for example, public safety officers would that fund?'",
        "'speaker_3': 'So it's a guess over 25 years, whatever the number would be approximately.'",
        "'speaker_2': 'Right. Over how many years?'",
        "'speaker_3': 'Well, it's been 25, I think, since well, 1991 is when it was raised. And then what year was it?'",
        "'speaker_2': 'It was.'",
        "'speaker_3': '2000.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_11': 'Right. So, well, the last ten years it's been down to four or 5%, you know, and then the five years before that, it went down incrementally, 1% a year, but at an average cost of about 140,000 a per officer, it would be about 275 police officers.'",
        "'speaker_1': 'So that that's pretty consistent with the the the downturn in terms of the loss of officers over that period of time here. We're down over 200 officers today. And I think that's an important point. I'm not going to go back and Monday morning quarterback or or go back and say, you know, what should have been done.'",
        "'speaker_1': 'I know personally, I didn't think it was a wise move to do that then. But but that that was a pivotal point in this the city's makeup to to to to really impacted our ability to to deliver services.'",
        "'speaker_1': 'And so I just wanted to go back and make sure that that that point is clear. Also, I there were a couple of taxes or options that you you you laid out regarding the number one was a parking tax.'",
        "'speaker_1': 'And I'm not sure what that would generate. I imagine it was rather low. But did you have a number? On that.'",
        "'speaker_11': 'Councilman Austin, we looked at a 10% tax being being able to generate about 1.7 million on the city owned parking lots. And we don't have a good estimate for private lots because there there aren't as many of those and we don't have the knowledge of them.'",
        "'speaker_11': 'But that could potentially be another up to 1.7 million for a total of about 3 to 3 and a half million dollars for a 10% rate.'",
        "'speaker_1': 'And the real property transfer, do we currently have that? Correct.'",
        "'speaker_11': 'Now we do we have a $0.55 goes to the city and we that generates $1.7 million per year. If we were going to increase it, we could we would have to a minimum double it to get the 3.4 million instead of 1.7 million.'",
        "'speaker_11': 'And the rate would actually be $2.20 per $1,000. You can see on Slide 19 that some cities have doubled it and some cities have gone even higher. One thing that's not on Slide 19 is there are four cities in L.A. County that have increased it Culver City, Pomona, Redondo and Santa monica.'",
        "'speaker_1': 'Thank you. I'd like to just also just lend my support from the mayor's comments. I think it's a very responsible and fiscally prudent for us if we were to move forward with this, to create a reserve fund. I think that is unnecessary.'",
        "'speaker_1': 'And shows, like I said, prudence and good faith to to our residents. And and I think a sunset clause is is is necessary as well. I think that's responsible. If we were to move forward with something, I don't know what that looks like.'",
        "'speaker_1': 'I want to. I want to. Have a conversation with my residents as well and in some time to be able to do that. I'm pretty certain that that most people will recognize the need to improve infrastructure, to improve public safety, because these are common themes that that I have heard from my constituents during my time in office'",
        "'speaker_1': '. And it's one of our biggest challenges, I think, facing the city. And I'm glad we are having this conversation finally, because I think it shows a. It's a tough conversation. It's going to be a tough conversation to have with our residents, but it's a necessary conversation.'",
        "'speaker_1': 'And so thank you all for bringing this forward and thank staff for the report.'",
        "'speaker_3': 'Thank you. Next up, we have councilman manga.'",
        "'speaker_4': 'Thank you. In the past several weeks, we've seen the presentation of the $2.8 billion. And I've had lots of discussions with residents and sometimes calls into our offices asking, are we as a city really suffering in terms of within the budgets of each individual department?'",
        "'speaker_4': 'What they see out in the community is the streets and sidewalks. And I'll tell you that I've reviewed many of the departmental budgets, many of the department heads of said in very long meetings with me and my staff going through the details.'",
        "'speaker_4': 'And in any organization that's constantly changing, things are going to come up and things are going to change. And I think that an item I have coming before council in a few weeks will help us focus on those things that can be changed to ensure that we are regularly reviewing both our budgets, our structure and other things'",
        "'speaker_4': 'that have been brought to our attention and or things we think we should look into. A lot of great work is done by our city auditor, Laura Down, and in that we have seen that some departments have fared a lot better than others.'",
        "'speaker_4': 'Some are struggling a lot more than others. And there is no way through traditional measures we would ever be able to overcome the surmountable costs that we have inherited from our predecessors who treat streets and sidewalks as a one time cost.'",
        "'speaker_4': 'Streets and sidewalks are not a one time costs. Streets have a certain lifespan to them. And I think that we'll get to that in a quick second. But I want to first start with appreciating my colleagues who supported my efforts with increasing sales tax revenue through recapturing the leakage we'd been losing to our neighboring cities.'",
        "'speaker_4': 'I think the messaging has been working. I think that more people come up to me now and say. I drove to Ralphs instead of shopping at Albertsons in Lakewood. And I know that not every district has the same opportunities to leave the city.'",
        "'speaker_4': 'As Councilmember Richardson and I have, and that we border so many other cities where people have choices to spend their money. And I think that as people recognize that the town center is one of our biggest sales tax revenue generators, they come to the town center instead of the Lakewood Mall.'",
        "'speaker_4': 'And those are important decisions that they continue to make. And as we've been watching sales tax revenue, we've been able to see some healthy changes. But I would like to take a quick second to ask Miss Erickson or Mr. GROSS a question.'",
        "'speaker_4': 'I'm sure you know, I know the answer to, but I think it's really important for you to explain which is our annual sales tax revenues. They do fluctuate. What percentage of those, though, are considered ongoing revenues that we count on despite the fluctuation?'",
        "'speaker_11': 'Council cuts women mango. We what we do is we work with an outside consultant to to determine a revenue estimate. And they do have a high medium and an a low revenue estimate. And we tend to do on the more conservative side and an estimate on the low side in part to have a more conservative base for'",
        "'speaker_11': 'our actual sales tax that we need for operations. And they do look at past sales tax performance and things that we know like for instance a Walmart closing in factor that into those projections and we meet with them quarterly.'",
        "'speaker_4': 'And I appreciate the renewal of that contract. I think we're doing a great job with that organization. I appreciate the significant number of updates they've made to the reporting that I think makes it a lot easier for us as a council to to look at and monitor where we are and what we can do and what messaging'",
        "'speaker_4': 'we can do to help certain business corridors that have been very successful and other business corridors who have been struggling. But I drive the community and experience the streets in our neighborhoods. And when I walk the city, I, like many of you, am frustrated.'",
        "'speaker_4': 'I came out strong in supporting every effort to increase what we can do in terms of what can we do to bundle some of our streets and sidewalks so that we get more for our money in my district alone?'",
        "'speaker_4': 'Well, I guess I should say. Well, when I talk to neighbors and neighborhood leaders, I'm very open with them about the grading of our residential streets. I think it was an amazing investment that this council chose to invest in to get an actual street grade for every street in our district.'",
        "'speaker_4': 'Because when people call and they tell me what we know, which is my street is terrible, my street needs a complete overhaul. I'm able to say, yes, your street is terrible. It is below the rating, which is acceptable.'",
        "'speaker_4': 'It is a 55 and we have a dozen streets that are below a 50 that are prioritized above you because at least in the prioritization of the fifth District, one of the things that we've really embraced is that we try to pave and invest in the worst streets that are most closely clustered to get the most for'",
        "'speaker_4': 'our money. It has nothing to do with who calls the most. It has nothing to do with who has the most voters. It's based on where is that need and how can we stretch that dollar as far as we can?'",
        "'speaker_4': 'In my district, streets alone make up more than a $40 million need. We as a city budget 38 point something annually citywide among nine districts. And so that doesn't even include the need for park bathrooms to be repaired that are in despicable quality for our youth, the water fountains that are inoperable that need to be revised and'",
        "'speaker_4': 'repaired. ADA Ramps Restoration of some of our most important task forces, I think it was mentioned earlier, are getting task force is really important and if we move forward with this marijuana ordinance, we're going to really need to talk about what it's like to talk about a high impact drug team because federal agencies are less likely to'",
        "'speaker_4': 'do supportive enforcement, at least as Chief McDonald had previously said under his administration. Once we enact our own and so we really need to take on some of that responsibility because we need to protect our neighbors. And so.'",
        "'speaker_4': 'I would, of course, want to hear from my neighbors and the neighborhood leaders before making any big decision on this. So I encourage people to reach out and call our office and see me. We have several community meetings planned over the next several weeks in the South Dakota neighborhoods and several others that have reached out.'",
        "'speaker_4': 'And I definitely support reserves because if we had been properly budgeting or reserving, we wouldn't potentially be in this situation. Mr. Crombie What's the average life of a main corridor in our community for a street? Or another member of the community that knows.'",
        "'speaker_3': 'Mr. Beck.'",
        "'speaker_2': 'Councilmember Mongo It depends really on the corridor and how frequently and heavily utilize it is. I think 20 years is average for a main corridor and it's extended beyond that for residential streets.'",
        "'speaker_4': 'How many and beyond for residential?'",
        "'speaker_2': 'Closer to 40, depending on again the frequency of its use.'",
        "'speaker_4': 'So when I take a street in the fifth District and public works comes back to me and says, for you to repair that district, that street, it's $350,000. I believe that after we repair that street, we need to take a 40th of that and put it into a fund.'",
        "'speaker_4': 'So in 40 years, when it's time for that street to be repaired or maybe 38 or maybe 42, we have the money ready and willing to go because it pains my heart to say not only do I not have the money to pay the street, I don't know when I will have the money to pay for your'",
        "'speaker_4': 'street because the amount is so insurmountable and the backlog is so great, and the amount of additional degradation annually by not making the repairs when we should have has been difficult. So while I support the mayor's idea of reserves, I support dedicating dedicating a percentage to infrastructure that is measurable in terms of what it costs to repair'",
        "'speaker_4': 'things on a schedule. If you have an air conditioning system and it costs $10,000 to install and it needs to be replaced every ten years, you should put $1,000 away every year. And I know that's an oversimplified version of that, but I really feel that for us to be a first class city, in a city that has'",
        "'speaker_4': 'neighbors who as we are in the baby boomer generation and some of them than baby boomers are selling their homes and downsizing. Our streets need to be just as great as Lakewood, who paves every single one of their streets at the same time.'",
        "'speaker_4': 'Because when people are making a decision on where to buy a home, those streets make a difference, those sidewalk repairs make a difference. And the values of our homes are one of our top priorities to our neighbors. It is the lifeblood and the nest egg that they've really invested in.'",
        "'speaker_4': 'And I feel that it is crucial that we as a council deliver to the taxpayers what we have promised them, which is a safe community. And that does not only include public safety, which is very important, but part of a safe community is the quality of our streets and sidewalks because we want a walkable and bikeable and'",
        "'speaker_4': 'drivable community. So thank you. I look forward to hearing what our options are. And I, I know there's some other details that we can go over later related to the Brady Burns bill and a few others that would impact different types of taxes that we can talk about offline or maybe in a two from four to the'",
        "'speaker_4': 'council. Because I know that while the consultants have said that sales tax would not be reduced, there are concerns from certain sales groups, including car dealers, about what that means to them and how that impacts them. And I think you've answered some of those detailed questions through some some communications we've had.'",
        "'speaker_4': 'But if that's an area that we decide to explore, I'd like to really work through everyone on the council fully understanding what our options are to ensure that people don't start purchasing their cars in other cities with a reduction in our sales tax revenue, because I think we've worked really hard with the Association of Car Dealers to'",
        "'speaker_4': 'ensure that people are getting the message that buying your car in Long Beach makes a big difference. So thank you for everything so far, and I look forward to hearing more from my colleagues in the community.'",
        "'speaker_3': 'Thank you, Councilwoman Price.'",
        "'speaker_6': 'Thank you. I wanted to thank staff for the report that was very, very informative. Just had a couple of questions and then a few comments. What is the difference in terms of practical application between the city administering the election and the county administering the election other than the lower price tag with the county administration?'",
        "'speaker_2': 'I think actually the clerk would probably be the best position to answer that question.'",
        "'speaker_6': 'I'm not used to turning my head this way for staff questions. This is.'",
        "'speaker_4': 'Weird. But yes, Councilwoman Pryce. So the difference between the city clerk conducting the election versus the county conducting the election for the June runoff, is that. Well, the the county is going to be conducting or coordinating with us for the June election.'",
        "'speaker_4': 'So essentially, if we turn around and then conduct our ballot citywide ballot measure, then we would then again run into the issue of doing a. A concurrent election, so duplicating efforts and such.'",
        "'speaker_6': 'So it makes more sense to have the county administer it if we were going to administer it and it's actually cheaper.'",
        "'speaker_4': 'That's correct.'",
        "'speaker_6': 'Okay. So there's no there's no advantage to us doing our own election. Okay. Okay. So in regards to the presentation and just to clarify, any action by the City Council would ultimately. Lead to the voters deciding whether to impose a new tax.'",
        "'speaker_6': 'That wouldn't be something that council is doing. Is that right?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_6': 'Okay. So just a few comments and I echo a lot of what my colleagues have said tonight, and I look forward to talking with my constituents about this, too. And ultimately, regardless of what we decide to do, this is an issue that really needs to be decided by the voters.'",
        "'speaker_6': 'When I started running for office, which was in December of 2013, and I started to go to community events and talk, I remember, you know, probably because of my background and kind of seeing where the trend in crime was going.'",
        "'speaker_6': 'I felt that public safety was the number one issue that we needed to focus on in the city. And I remember it being at a community meeting in the third district, and I remember a resident standing up and after I had said with the two or three top priorities for me would be and listing public safety as'",
        "'speaker_6': 'the first, she said, You know what? Your priorities for the district are all wrong. Public safety is not an issue. And the third for us, the bigger issue is, you know, and she listed some of the issues that that she believed were the main issues.'",
        "'speaker_6': 'And granted, this was a kind of a special group that was focused on a particular area. But. And what I said at that time was. You know, people don't start off committing violent crimes. They start off committing small theft related crimes that, you know, a lot of times get brushed off as not serious.'",
        "'speaker_6': 'And in that kind of an environment, and when we have the addition of some of the things that we've seen in terms of statewide initiatives that take away the incentives for mandatory treatment and such, there's there's no question whatsoever that crime is going to rise.'",
        "'speaker_6': 'And that's something that I saw after AB 109 passed. And it's definitely something that I have seen proven to be true in the criminal justice system over the last year. Now, when I go to a community meeting and the third public safety is for sure, absolutely, without a doubt the number one priority for my district.'",
        "'speaker_6': 'You know, a lot of times we sit up here and sometimes I have to, you know, bite my tongue because we're all trying to do our best for the city. But we're also all very protective of our districts.'",
        "'speaker_6': 'And our public safety structure is not designed to be broken up by districts. It's a citywide approach. And sometimes I'll have my colleagues say, well, you know, Councilwoman Price has all these fire stations in her, you know, district, or they have all of this and all of that.'",
        "'speaker_6': 'You know, I have the slowest response time in terms of nine one. One paramedics is in the third district and it's an island village. And we have communities in the third district that are hard to get to that have response times that are over 10 minutes long.'",
        "'speaker_6': 'I had 911 respond to my house last week around this time while I was here with all of you. And thankfully, I live right next to a fire station and the response was amazing and the firefighters were amazing.'",
        "'speaker_6': 'And on a very private level, we're going to express our gratitude to the team that responded to our home. But the point is, when you're and my kids called 911 and when you're in that kind of a situation, the response of the fire department getting to your house in a timely fashion is the only value that you'",
        "'speaker_6': 'care about in terms of what the city is doing for you at that moment. The only thing you care about is 911 getting to your house as soon as possible because your family member's life is in danger. I experienced this last week and everybody in this city should have faith that 911 is going to respond to their'",
        "'speaker_6': 'home within a couple of minutes, not 13 minutes, a couple of minutes. That is the one thing that we should be promising and guaranteeing to our residents. And if we can't do that, we're falling short and meeting their expectations.'",
        "'speaker_6': 'So, you know, I think and, you know, we've seen a 15.9% increase in crime citywide. We have seen property crimes on the rise, theft related crimes on the rise. And we're asking our police department and our fire department to do more with less.'",
        "'speaker_6': 'And I've said repeatedly, looking at the deficit years that are coming ahead, I cannot imagine a scenario where I personally I speak for myself would ever vote to reduce the number of police officers or firefighters or fire resources that we have available in the city.'",
        "'speaker_6': 'I would probably vote to cut many other things, but those are two areas that I cannot imagine I would vote in favor of. So going into the deficit years, I mean. I have shared with this council very openly that I don't know that the amazing work that the council before us did in trying to cut costs by'",
        "'speaker_6': 'use of. Policies such as proportional share. I don't know that that would work for us moving forward because we have a public safety crisis in California that we did not have at the time that we instituted those policies.'",
        "'speaker_6': 'And so for me, going into the deficit years, I don't know where the cuts are going to be made. I really don't. And so it's a matter of of really taking a hard look.'",
        "'speaker_4': 'At the.'",
        "'speaker_6': 'Resources that we have available to us. Looking ahead at 2019, 2018, 20, 19 years that we are expecting to see major budget challenges for the city and granted, yes, they're not as big as budget challenges as they were in the past.'",
        "'speaker_6': 'But we can't lose any officers right now. We really can't. We can't lose any fire resources. And so I think this is a conversation that we need to have and figure out how are we going to pay for this?'",
        "'speaker_6': 'And, you know, I think ultimately it's going to be a decision that our voters are going to have to decide what where the value proposition is and where they want the resources spent. I agree with the comments that my colleagues made regarding infrastructure.'",
        "'speaker_6': 'We have the ability to pay one street a year. One street a year. So I represent more than 50,000 people who live in the third district and I can promise them one st a year. This year we actually did some very creative patchwork and we paved portions of a couple of streets in order to be able to'",
        "'speaker_6': 'serve a couple of different communities. We had our team go out and drive every single street and make a list of where we felt the need was greatest. It was a ridiculous process to service, you know, just a few small streets.'",
        "'speaker_6': 'That is that is problematic. Fortunately, through the great work of our city staff, we were able to get some grant funding to fund the repaving of Ocean Boulevard and a couple other major public works project. But that was really because of creative grant writing efforts by our team, which I'm grateful for, and I don't know that those'",
        "'speaker_6': 'are sustainable funding options for us. The deferred maintenance option or discussion is huge. We have no option for deferred maintenance. We have city buildings and facilities and we've talked about this before as a council. I'll use the ranchos as an example.'",
        "'speaker_6': 'The ranchos have a partnership with Long Beach Unified School District. Every Long Beach Unified student in the grades that are targeted for the two ranchos visit the ranchos. Both of the ranchos every single year. And yet we as a city do not have the money to be able to take care of some of the infrastructure needs of'",
        "'speaker_6': 'these city facilities, historic city facilities. That is a shame because it's it's very, very important that we maintain these beautiful, historic gems that we have in the city that a lot of the newer cities don't have and can't claim.'",
        "'speaker_6': 'So I'm glad we're having this discussion. I'm curious, to me, tonight was more just about information. I learned a lot in terms of the various options that are available. I can tell you that, you know, I personally I know this is something that the voters ultimately decide, but I personally would have trouble with any sort of additional'",
        "'speaker_6': 'burden that we would place on our business owners with any increase in licensing fees. I think we've made great strides as a city to be business friendly and attract more businesses here, and I do not want to do anything that would deter that.'",
        "'speaker_6': 'But beyond that, I'm open to hearing and talking and sharing with my constituents their thoughts. But, you know, when people call me and say, how are we going to how are we going to deal with this public safety crisis?'",
        "'speaker_6': 'I say we need more officers. I mean, that's that's the solution. There's only so much community watch groups can do. We need more officers driving up and down the streets because that is a proven deterrent to crime. That's just a fact.'",
        "'speaker_6': 'We need paramedics that can respond in time. That's just a fact. It is what it is. I'm so grateful for the work of our fire department and our police department. This is not at all a reflection on the work that they do.'",
        "'speaker_6': 'They do amazing work. Their leadership is fantastic. I cannot imagine a city that's doing as much as they are with the limited resources that they have. And for anyone who says, you know, there's a lot of fat and we're wasting money, you have no idea what you're talking about.'",
        "'speaker_6': 'You have no idea what you're talking about. I challenge you to actually look at the books and stop the rhetoric, because that's not what we've been focused on for the last two years. We've been living very prudent times here in the city of Long Beach, and that's just the truth.'",
        "'speaker_6': 'So thank you. And I have no questions. Thanks.'",
        "'speaker_3': 'Thank you. Councilmember Supernova.'",
        "'speaker_2': 'Thank you, Mayor Garcia. And I guess I'd like to start off on a positive note has been too positive tonight. So I have some good news for Councilmember Gonzales. Oil is not below $30 a barrel. It closed tonight at $31 a barrel.'",
        "'speaker_2': 'So we can all appreciate that. I'm going to I have a very just a couple of questions, but one is very specific on the on the parking tax for staff. You said that you didn't know exactly how many private lots we have.'",
        "'speaker_2': 'Do you know if that would include Cal State, Long Beach and Long Beach City College?'",
        "'speaker_11': 'Councilman. Councilman. Supernormal, I. Those would if they're if they were open to the public, you know, and there was public parking, then they would be included. And so we don't know how many private it's more we don't know the revenue estimates from the private parking lots.'",
        "'speaker_2': 'Okay. That might be a great resource, but I'm I'm in a parking impacted district. And one of the chief complaints is the price of parking at Cal State Long Beach. That's something I really want to scrutinize moving forward.'",
        "'speaker_2': 'Councilwoman Pryce mentioned remembering her campaign days and see if I can remember mine. Oh, yeah, it was less than a year ago, and I talked to a lot of residents in the fourth District. And specifically the hot button issue one year ago was a utility users tax.'",
        "'speaker_2': 'So the first question I have is what was it before I think you said 10% and where would that put us on this list here of all the cities? I think that would put us at the very top and put us above Los Angeles, is that correct?'",
        "'speaker_11': 'Council member, super or not. It was at 10%. And this is just of some of the the benchmark cities that are listed on Slide eight. There are other cities in California, though, that are at 10% or higher.'",
        "'speaker_2': 'Okay. So this is just a regional listing here that that you showed.'",
        "'speaker_11': 'Yeah, it was like some benchmark cities. So, for instance, Santa monica is at 10%, SEAL Beach is at 10%. And those are not listed on the chart.'",
        "'speaker_2': 'Okay. Also, I think Councilmember Price mentioned, you know, the idea of putting this in front of the voters. If we do decide on a on a June date for the election, 128 days, would that be enough time to run a campaign on this and educate the voters?'",
        "'speaker_2': 'Oh. Council Member Councilmember You know, the council's decision is really whether or not to put something on the ballot. At that point, the city really doesn't get involved in whether or not there's a campaign. We don't spend city dollars on a campaign, so we wouldn't be able to answer that question right now.'",
        "'speaker_2': 'But that those are the legal deadlines as you have a certain amount of time to make a decision to put it on the ballot. Okay. Thank you. Also, with all the analysis of these various taxes, we've never it's not described as to whether or not some of these taxes are regressive.'",
        "'speaker_2': 'And that was certainly a topic one year ago when I was walking my district. And I'll just give you a dictionary. Dictionary definition. Definition of a regressive tax is a tax. It takes a larger percentage from low income people than from high income people.'",
        "'speaker_2': 'A regressive tax is generally a tax that is applied uniformly. This means that it hits lower income individuals harder. Would you describe the utility users tax as a regressive tax?'",
        "'speaker_11': 'Councilman. Super or not it the rate is uniform. If someone has a smaller home, their actual tax amount would be smaller. So if you had like a five bedroom house, your utility bills are probably higher. So it does vary.'",
        "'speaker_11': 'But I, you know, I can't answer if it's so it has some reactionary aspects to it, but it also has some non regression aspects to it because it really does vary by the size and your consumption of utilities.'",
        "'speaker_2': 'Okay. Thank you. I think it's all I have.'",
        "'speaker_3': 'Thank you, Councilmember Andrews.'",
        "'speaker_2': 'I yes, I thank you, Mayor. You know, I myself I really think that this is you know, I know that this is the right thing tonight in asking the city manager and the city attorney to explore options for revenues and has for the city of Long Beach.'",
        "'speaker_2': 'You know, our mayor and the city council has shown that we have been very smart in using taxpayers money to pay for city services. And making every dollar count for much needed infrastructure improvement. When the recession hit very few years ago, we made it necessary cuts to ensure.'",
        "'speaker_2': 'Long Beach didn't go broke. And still, we found a way to provide services to the people of my city. It was painful. It was the right thing to do at that time. Now it is appropriate for us to look at revenues, you know, incentives so that we can continue to properly serve the people of our great city'",
        "'speaker_2': '. You know, the impact of public safety is a deep concern of mine. We have had an impact on federal, state and county early release programs with little or no support from these agencies. As a result, crime has crept up from the historical low, and we cannot expect police to do more with less.'",
        "'speaker_2': 'I'm not sure we will even keep up with the current police level with only one police academy a year. And in saying that, you know, we think of I'm sure that the retirement rate of our police force would maybe 80 or 90 individuals retired at a certain age.'",
        "'speaker_2': 'And we can only, I think, have 50 an academy. And you would think that only maybe out of that, maybe maybe 25 of them will, you know, move on. And that will let you know that we're still below the level that we would need.'",
        "'speaker_2': 'Well, you know, when we talk about public safety. And I know in my area, most crime they talk about is public safety. And that is very important. Infrastructure, we know we need that. But like I say, I think our most important thing, especially yet in my district, they talk about, you know, police and fire.'",
        "'speaker_2': 'And this is why it's so important to me when I think about things that we know we have to do, it's a must that we do that. How are we going to get the money? We're going to have to find a way.'",
        "'speaker_2': 'I've also been concerned with the cut of that fire department that has taken over the past seven years. We've had cuts, six fire engines, one truck company cut, rescue 12 that an engine eight, engine 15, engine 17, engine 18, engine 23, engine one or two and truck 14.'",
        "'speaker_2': 'We had three fire station with no fire engine in them, station eight, station 17 and station 18. Now, with that said, individuals, you know, I'm going to leave all of this up to our chief of police and the chief the fire chief, because I know what the decisions they're going to come up with, something that we know'",
        "'speaker_2': 'will definitely take care of the city of Long Beach because of the fact that we have ideas, we have things that we know we have to do. But I think I put total confidence in our chief, both for fire and police.'",
        "'speaker_2': 'And this is what we're going to do when we have these discussions to let them know that we're behind you no matter what decision that you make. So in the city of about 500,000 people, our fire department received about six 60,000 emergency calls for services each year.'",
        "'speaker_2': 'That a lots of calls and it makes Long Beach Fire Department one of the busiest fire departments per capita in all of America. So what I'm doing is am. I'm requesting the following from the city manager. Please ask the Chief of Police and fire to list or reduce or eliminate positions or programs in the past four years'",
        "'speaker_2': 'and what the report priorities are for each department for restoration with the corresponding costs from financial, financial management and each team. And I support this action tonight and look forward to seeing the options that you present to us and when it returns to the city.'",
        "'speaker_2': 'And thank you very much.'",
        "'speaker_3': 'Thank you, Councilman. Vice Mayor Lowenthal.'",
        "'speaker_9': 'Thank you, Mr. Mayor. I wanted to ask the staff about how we assessed our infrastructure needs. I know all our colleagues here addressed the various aspects of our needs, ongoing needs, whether it's infrastructure, public safety, other services. But the $2.8 billion in infrastructure needs that the mayor mentioned and highlighted.'",
        "'speaker_9': 'Could you describe for us how we got to that?'",
        "'speaker_2': 'So, Mr. Mayor, members of the City Council, Vice Mayor I'll take a crack at it and then Craig Beck can join us and add additional if we need to. So what we did is we, you know, we have a number of different lists where we try to assess what our capital needs are.'",
        "'speaker_2': 'We look at our street backlog. We've done a project paper management plan just recently, and that gave us a very robust number of an accurate assessment of our street impact. Air street needs are. We're in the process of doing that on our sidewalks.'",
        "'speaker_2': 'We've got capital needs in our parks. We've got technology infrastructure. And so the $2.8 billion in the presentation that we gave you back in December, December 22nd was really an estimate over the ten years. It's not engineering assessment.'",
        "'speaker_2': 'It's not to that level. But it really is a pretty well-grounded estimate of what our need is, and that if you were to fund that over ten years, it'd be roughly $280 million projects, and it's by no means a complete list.'",
        "'speaker_2': 'There's certain projects that could be added there, some that might be addressed through other needs. But it's a picture kind of snapshot in time of what our needs are.'",
        "'speaker_9': 'Thank you. Mr. Beck, did you want to add to that?'",
        "'speaker_2': 'Actually I think Mr. Modica summarized it well. I would just add that some of the categories that were included on that list include streets, bridges, sidewalks, alleys, public safety facilities, storm drains and pump stations, community centers in our parks.'",
        "'speaker_2': 'Parks, amenities including restrooms. Energy efficiency improvements such as LED lighting and technology. Infrastructure.'",
        "'speaker_9': 'And does that. I may have missed this. Does that include our water systems as well in that infrastructure estimate?'",
        "'speaker_2': 'To my knowledge, it does not. And if you're talking about potable water, right, you're talking about storm drains, then? In some aspects, yes.'",
        "'speaker_9': 'Right. I was talking about potable water. Thank you. And Mr. Mota, Modica city manager, the mayor also alluded to the rainy day fund that was established with the former council. Could you describe what the set aside is and what the policy is or the finance manager?'",
        "'speaker_2': 'Actually, I like Mr. GROSS to answer that. We are set we set aside half a half a percent of of.'",
        "'speaker_1': 'Our surplus.'",
        "'speaker_2': 'Revenues each year. And we have, I believe, several million dollars to set aside. Yeah, I did that. Answer your question.'",
        "'speaker_9': 'It did. And and while that doesn't sound like very much, it really was quite a bit to do at a time when this council was considering the huge deficits that it it was starting ten years ago. Councilman Andrews and I, as well as Councilmember Richardson, who was staffing a council office at the time.'",
        "'speaker_9': 'Really? Walked into a council that looks very different from our state of financial affairs than than it does today. And Councilmember Price is right. The deficits that we are looking at going forward will feel. More steep, even if numerically they are less because we have cut all the fat.'",
        "'speaker_9': 'And so it could be $100 million less than what we had to do over the last ten years. But it will feel much more difficult to extract those those cuts. And it's not even savings. I don't I don't I hope none of us refer to that as savings or actually just cuts.'",
        "'speaker_9': 'There is really nothing to save when you are operating on a very lean, lean set of services, lean set of operations. And as it was stated earlier, the city services, including public safety, but all of the other quality of life services that the city is part of in making a city and providing the city life is a'",
        "'speaker_9': '. It's beneficial to all of us. Councilman Suber not asked about the regressive tax. Something I'd like us to also consider is not not just whether a tax is regressive, but when we look at the proportion of dependents on on our services, whether it's police and fire.'",
        "'speaker_9': 'Councilwoman Gonzalez just shared with me what the December numbers are for calls to police and fire for service just in the first District for the month of December. And it was over 700 calls, and that might be proportionally different from another district.'",
        "'speaker_9': 'And so when I think of the term regressive and the impacts that we have, the disparity and the dependance that we have across our districts on public services, we have to regard that as a citywide issue and a citywide policy.'",
        "'speaker_9': 'I've worked in water services, potable and recycled water services for almost 20 years now, and in the late nineties, then-Governor had created the state's commission on building for the 21st century, and it was to identify the infrastructure needs for the entire state.'",
        "'speaker_9': 'And I don't recall what the sum was. I think it was in the hundreds of billions of dollars, while ours is at 2.8. But one thing that was very glaring for me at the time in observing the process and also looking at the report is.'",
        "'speaker_9': 'That it was a moment of truth on infrastructure planning and investment, and it highlighted the long silence and really terrible state of inaction that we had experienced as a state. And we were looking at what this bill would be.'",
        "'speaker_9': 'And these were just public infrastructure items, such as highways and roads. It did not address what we needed to do at our local level. And I'm proud of this council that had very, very, very fiscally prudent policies and had the ability to cut the reduce the 700 positions that the mayor talked about and to save more than'",
        "'speaker_9': '$250 million over the last ten years on pension costs and has leaned this government, as he said. But in leaning the government, we still kept our eye on maintaining quality of life. And so. For me. And I hear from all of us, everyone that has spoken, that this doing more with less is not sustainable going forward.'",
        "'speaker_9': 'The question now becomes, now that we have stabilized our economy here locally, our our city operations and our budgets, what is the city that we want to be today and what is the city that we want to be going forward?'",
        "'speaker_9': 'Not paying as you go is a very painful exercise in in water. We actually have a fund called Pay As You Go. And there are other funds to to address infrastructure and capital needs. But that it's a very direct statement pay as you go when you're in a fiscal deficit, paying as you go makes it very difficult'",
        "'speaker_9': ', especially when you're looking at a $2.8 billion bill for just infrastructure needs. And as we've seen in the city of L.A., on their tree trimming schedule and their sidewalk schedule, they could be at it for dozens and dozens of years and still not catch up because it is hard to catch up.'",
        "'speaker_9': 'And so I'm thankful that we're not in that dire a situation, but we are in a dire situation. And we do need to look at solutions and we do need to collectively come up with a response that we perhaps we decide we ask our voters or not.'",
        "'speaker_9': 'But I'm delighted for the opportunity for us to be able to look at this, to actually have a conversation about the future where we're not struggling to just crawl out of the struggles of the present. I think it's a great opportunity.'",
        "'speaker_9': 'I mean, I know, Councilman Zubrin, I said this was a depressing conversation or not very good news, but it is a great opportunity to actually be able to talk about what the future of this city can look like if we make certain policy decisions and budgetary decisions and if we ask collaboration from from our residents, what can'",
        "'speaker_9': 'the city look like? That is a very positive conversation for me. And doing more with less is not sustainable. And. And I echo councilwoman. Price's statement that anyone who thinks that there is fraud really has not done their homework, that hyperbole and invective and rhetoric and all of that really has to stop because that is just the'",
        "'speaker_9': 'purpose of that is just distraction. Ten years ago, before I ran for council, when I was working on improving our development projects here in downtown Long Beach, I had coined the phrase about our city, and it's not a nice phrase and and I wasn't happy to call our city that, but I said that we we suffered from'",
        "'speaker_9': 'a collective municipal inferiority complex. We did not think that we could actually deserve better or do better. And so we took what was good enough. And I think what we have to do is. Look at ourselves today and exercise some confidence.'",
        "'speaker_9': 'We have city employees that are talented. We have city employees that we have to compete to to have them work with us here as opposed to work elsewhere. I think paying for talent is what you do in every industry, and I am not embarrassed or shy about the fact that we will pay for talent because this city'",
        "'speaker_9': 'deserves it. And so let's crawl out of that collective municipal inferiority complex that this city suffered from for so long and that we have actually come away from. And let's not revert to that and let's join with our residents and look at these solutions together and ask them what it is that they want this city to be'",
        "'speaker_9': 'going forward. Thank you, Mr. Mayor.'",
        "'speaker_3': 'Thank you, Vice Mayor. I think everyone's had a chance to to weigh in. And I know it's an important topic, so I appreciate all the questions. Public comment. Please come forward.'",
        "'speaker_2': 'Good evening, everyone. I'm Jack Smith. I live at 240 Chestnut. That's in Plymouth West in the first district. Ten years, not ten years ago. Six years ago, when I was running for council, the term revenue enhancement came up and at one of the public forums I reminded everybody that that was really a government term for tax.'",
        "'speaker_2': 'It occurred to me about halfway through the terrific presentation this evening how many times that word showed up. And it occurred to me also that that is probably the most reviled word in the history of humankind. Tax. When I was a kid and suddenly my life needed more money than my father's allowance was providing me, I went'",
        "'speaker_2': 'to my father and said, Well, we need to increase the tax I have on you and get me some more money. And he responded, No, there was another word in front of that. You can fill in the blank yourself.'",
        "'speaker_2': 'So I had to do something that I think this city can do. I had to delve into economic development. I had to go find other means of raising money. Not by taxing my family. I mowed lawns. I babysat.'",
        "'speaker_2': 'I created my own little business. I did whatever it took. We have an economic development commission that I believe has some of the smartest, most powerful movers and shakers in our city. They are really an incredible group of folks.'",
        "'speaker_2': 'Now, you just sent them a hot potato on the minimum wage increase. The meat of what they want to do is help this city increase its revenues and therefore increase the amount of tax it has coming. That will solve the problems that you're talking about without necessarily increasing the taxes.'",
        "'speaker_2': 'I found it interesting that probably the largest number. Of increase was in the sales tax. That was the biggest possibility there. Now, rather than increase the sales tax 1%. Why don't we increase the tax base by 1%? Don't you imagine our very, very good economic development commission might be able to do that?'",
        "'speaker_2': 'I would suggest you take the time over the next few months. Not rush into throwing something on the ballot that will cause the voters to say that word. No. And let the Economic Development Commission come up with a plan for you.'",
        "'speaker_2': 'Do what you want them to do. Don't send them off on some ten year plan or something. Do something right now within the next year or the next few months and make some real suggestions. There are smart group.'",
        "'speaker_2': 'They know what they're talking about and increase the revenues in this city that therefore will increase the amount of taxes that we collect without raising taxes. Thanks.'",
        "'speaker_3': 'Thanks, Jack. You also you'll be happy to know that that's actually next on their agenda. And so the the economic blueprint is actually on their agenda at their February meeting. And I know they're all looking forward to that.'",
        "'speaker_3': 'So thank you. Our next speaker, please.'",
        "'speaker_4': 'Laurie Angell. I live in the eighth District and I have to mirror an awful lot of what Jack said. This is we're looking at tax increases and not really looking at opportunities to increase revenues, actual revenues like bringing in industries.'",
        "'speaker_4': 'We have industrial space in the ninth and ninth district that's just fallow that could be utilized. So we haven't even really looked at that. And, you know, we need to do some work on that. A tax increase should be the very last resort.'",
        "'speaker_4': 'And we have to look at the commitments that have been made over the past couple of years that helped.'",
        "'speaker_2': 'To get us into this situation.'",
        "'speaker_4': 'I mean, the Civic Center, how much is the additional cost per year for the new civic center? How much money have we lost in sales tax incentives? So we've taken away the sales tax revenue that we would have received from some of the largest sales tax generators as a business incentive for them to stay.'",
        "'speaker_4': 'Well, they're here and they've been here for decades, so I don't imagine that they would be leaving. So continuing to eliminate your sales tax revenues to provide incentives isn't really helping you at all. I think that if you are to consider taxes, it does have to be the last resort.'",
        "'speaker_4': 'But if you are going to go down that dangerous, bumpy, scary road and probably be denied, you need to have a very robust.'",
        "'speaker_2': 'Discussion with.'",
        "'speaker_4': 'The public, not throw at them at the last minute. This is what you think that you need and this is how you need it. That's why the last measure failed. There were budget discussions several years ago and Mayor O'Neill was here and General Manager Gerry Miller was here with the entire community.'",
        "'speaker_4': 'I mean, hundreds and hundreds of people showed up and we discussed the budget in detail and there were stations for every element of the budget for the people to decide what they thought might be best. So you're saying that it isn't really your your.'",
        "'speaker_2': 'Problem.'",
        "'speaker_4': 'To put a tax measure, but how you packages package it is everything. The options are huge and that's where you need to rely on the public if you're even going to plan on going down that road. But if you can figure out a way to increase the value of our property and our homes and don't influence that'",
        "'speaker_4': 'with poor decisions about land use, then you might be getting somewhere as well.'",
        "'speaker_3': 'Thank you. Next speaker, please. This is our final speaker. Mr. Good. He wants to come down after this. Thank you.'",
        "'speaker_1': 'Like most of you seeing this sign before, I had to break it out from an inventory. I'm really sort of shocked that this is like Groundhog Day. I've lived here since 1986 and every five or six years. This Hogg's.'",
        "'speaker_1': 'Come on again. I mean, it's ridiculous. We did it with Mayor Foster. You know, he came up with this measure I concoction. That was terrible. It was free money. You guys could have spent it on anything you wanted.'",
        "'speaker_1': 'That's why it died. You talk about raising money. He raised $700,000 from California to New York. What the hell is somebody in New York care about my street? He just called in all these chips. He's a lobbyist. Now you're going to do the same thing again.'",
        "'speaker_1': 'We heard Lakewood Mansion. Why is Lakewood in better shape than us? One word, two words. Contract City. It's a lot less expensive for them than it is here, no matter how much money we have here. The residents, taxpaying residents will never get the benefits that city employees do.'",
        "'speaker_1': 'The family will always come first. It's been said by this council many times that our first priority is to take care of the family. And when you try to run this mayor, this proposition, I around $700,000 in just about every department head in the city was out there stomping for it.'",
        "'speaker_1': 'Your latest study says that only 23% of city employees actually live in the city. That's pretty amazing. So all those people that are asking us to raise our taxes, take their check and go to another city. That study you did on minimum wage, you even mentioned it up here, 23%.'",
        "'speaker_1': 'I thought that was only police and fire. You know, none of them live here. Well, 23% is about right. 25. So I think you need to rethink this drastically. You talked about cutting 700 positions. That was that those things were kept.'",
        "'speaker_1': 'The police department used theirs to fund overtime. They even admitted it when a department had to make a cut, they cut a phantom position so that give it a rest. The pension reform. You said if we have such great reform, wire pensions, $100 million.'",
        "'speaker_1': 'Why are they going to go up between 130 and $150 million by 2021? And then from 2021, for the next 20 years, we're going to be paying that $150 million. It's not fair. The family shouldn't come first. Residents should you know, they they had a article in the paper to.'",
        "'speaker_1': 'But that $10,000 club it used to be. Thank you.'",
        "'speaker_3': 'Mr. said that.'",
        "'speaker_1': 'It was a 200,000. Now we have a three times. Thank you. Members of that $300,000 club sitting here.'",
        "'speaker_3': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Very good in a number of points. First of all, let me start with a very. On point. Astute observation the councilman from the third district led. Mention a relative to increase the crime. And that's not going to get any better.'",
        "'speaker_2': 'That's what we can expect in that ratio of increase for the next ten years. Later on in the month, we're going to have the details of why that. But if you just check the birth rates at the hospitals and so forth, you can project that out.'",
        "'speaker_2': 'But I think you have to take a few things that come sharply. Hopefully it's sharp in people's mind is obviously. The rebuild of city hall as projected and as people want is dead D.O.A. buried? What will happen? This will be replaced with either an office building or a hotel.'",
        "'speaker_2': 'All right. Library will be at the Renaissance School. A paradise in there. And the port will relocate where it should from which it the area should never left in the first place back within the port period. It was the disease process of kicking them out of there to start with.'",
        "'speaker_2': 'But one of the things I think you need to address yourself is the fact that within the next certainly 90 days, 220. There will be a federal master administering this city. And if you don't doubt that, how fast that has been pushed up in the agenda.'",
        "'speaker_2': 'Look at the article from the L.A. Times last week. Relative to the Speaker of the Assembly. Coming out and supporting the attorney general to rebuke Kamala Harris. Who the court opined had almost all but suggested she resign for the epidemic of corruption she has engendered.'",
        "'speaker_2': 'The who but a crook which supported another crook. The feds have now realized that the original epidemic of corruption, which is slowly moving to pandemic, has surpassed their pandemic level and is now we are California. California is in a state of what's called kleptocracy.'",
        "'speaker_2': 'And if you don't know what it is, look it up. Gail EPP. G o. C. R e. Y. Period. They recognize that. So we will have a federal master to oversee what needs to be done. I'm not sure what the answer is, but I do know that we can expect with a federal master overseeing the city, just'",
        "'speaker_2': 'like they're overseeing the L.A. Department, the L.A. District Attorney's Office. Now, whether that was for incompetence or not for corruption. We can get a better handle on what we're going to have to do. And it's not going to be pleasant, but at least we'll know.'",
        "'speaker_2': 'It will be honest.'",
        "'speaker_3': 'Thank you. Facing no other public comment. There is a motion to receive and file the report as presented by city staff members. Please go ahead and cast your votes.'",
        "'speaker_4': 'Motion carries.'"
    ],
    "Recommendation to either A.) adopt resolution pursuant to the provisions of Long Beach Municipal Code Section 1.21.070, providing for the appointment of Daryl Supernaw to the Office of Councilmember, Fourth Council District for the term of four years commencing on the third Tuesday of July, 2016; and the cancellation of election in Council District Four previously called by the City Council on November 10, 2015; or B.) receive and file this report.": [
        "'speaker_3': 'Thank you. Next up, Madam Court, do you want to read the next item?'",
        "'speaker_4': 'Please report from City Clerk recommendation to adopt a resolution providing for the appointment of Darryl Super nine to the Office of Council Member for Council District for the term of four years and the cancelation of election in Council District four, previously called by the City Council or receive and filed this report.'",
        "'speaker_3': 'OC with the motion and a second Councilwoman Price.'",
        "'speaker_6': 'Although I'm tempted to ask a lot of questions on this one, I'm not going to.'",
        "'speaker_3': 'Count some Councilmember Ringa.'",
        "'speaker_7': 'Congratulations. Council member Supernormal. Well done.'",
        "'speaker_3': 'Councilmember Richardson.'",
        "'speaker_5': 'I guess we can go ahead and bring them back to the council. He's done an okay job.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Councilman Mongo.'",
        "'speaker_4': 'I'll have to disagree with Councilmember Richardson. I think he's done a fantastic job being a council member who borders my district. I have significantly appreciated his partnership on a lot of our business initiatives, and so I'm going to give him an A-plus.'",
        "'speaker_4': 'And we've been filling out a lot of reviews. I'll give him a five out of five.'",
        "'speaker_3': 'Councilmember Austin.'",
        "'speaker_1': 'I'm just going to call him Lucky.'",
        "'speaker_3': 'Councilman Gonzalez.'",
        "'speaker_6': 'Is it possible to do this for all of our elections, by the way? I'm just saying. No, I it's been a pleasure working with Councilmember Super now. So if this is any space to do that, I want to say a great job.'",
        "'speaker_3': 'And Council member.'",
        "'speaker_2': 'Andrews Council member who.'",
        "'speaker_3': 'Thank you. Vice Mayor Lowenthal.'",
        "'speaker_9': 'So does he have to stay in the back if we don't act? Is that is that why he left? Yes. I just want to congratulate him. Thank you. Yeah, let's not vote with delay.'",
        "'speaker_3': 'I just want to add before we go to a vote, Councilmember Super now has been a complete delight to work with. He is has high integrity. He's a hard worker. He's got a good staff. And I think he's been a great addition to this council and body.'",
        "'speaker_3': 'I think we've all really enjoyed working with him and we want to congratulate him. He was clearly doing such a great job in the district that no one chose to run against run against him. And that, I think, says a lot about his his first year or so that he's been on the council and it even been'",
        "'speaker_3': 'a year, it seems like. So congratulations council member Superman and any members of the public on this item seeing none members, please go out and cast your votes.'",
        "'speaker_4': 'The motion carries for the first time.'"
    ]
}