{
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and adopt resolution continuing the Long Beach Tourism Business Improvement Area assessment for the period of October 1, 2018 through September 30, 2019; and, authorize City Manager, or designee, to extend the agreement with the Long Beach Convention and Visitors Bureau for a one-year term.  (Districts 1,2,4,5)": [
        "'speaker_0': 'So we'll kind of try to take all this together. But before we get to that, I want to start with the first hearing, which is I'm sorry, it was the our first hearing tonight, which is the LV Tourism Improvement Area hearing on the CVB.'",
        "'speaker_0': 'And if I can please have the hearing read into the record.'",
        "'speaker_1': 'Report from economic development recommendations received supporting documentation into the record to conclude the public hearing and adopt a resolution continuing the Long Beach Tourism Business Improvement Area Assessment for the period of October one, 2018 through September 30th, 2019, and authorize the City Manager to extend the agreement with the Long Beach Convention and Visitors Bureau for one year'",
        "'speaker_1': 'term. Districts one, two, four and five.'",
        "'speaker_0': 'Thank you, Mr. Modica or Mr. West. Mr. Mayor, council members have.'",
        "'speaker_8': 'A brief report.'",
        "'speaker_12': 'From Eric Romero, who runs our Business Improvement Associations through the City and our Economic Development.'",
        "'speaker_8': 'Department. Eric. Honorable Mayor and members of the City Council. This item is the annual approval of the Long Beach Tourism Business Improvement Area Annual Ongoing Assessment.'",
        "'speaker_0': 'The Long Beach.'",
        "'speaker_8': 'Convention and Visitors Bureau as advisory board to the Long Beach Tourism Business Improvement Area promotes and markets. The City of Long Beach as a tourism destination using funds generated assessment of hotel properties located in tourism business improvement areas throughout the city.'",
        "'speaker_8': 'State law provides that the City Council shall here and consider all protests against the assessment program.'",
        "'speaker_11': 'And boundaries of the area proposed in the annual report.'",
        "'speaker_0': 'On September 18, 2018, the City Council.'",
        "'speaker_8': 'Approved a resolution granting approval of the annual report and set today's date for the public hearing. The recommended action of this item continues the assessment for another year.'",
        "'speaker_11': 'There are no proposed changes to the basis of the assessment, nor changes in proposed activity.'",
        "'speaker_8': 'Staff request. The City Council received the supporting documentation into the record. Approve the resolution. Continue the levy of the assessment and authorize the city manager.'",
        "'speaker_11': 'To extend the agreement for one additional year. That concludes my staff report.'",
        "'speaker_0': 'Thank you. We do have a motion in a second, but we're going to go ahead and do now, I believe is here. Correct me if I'm wrong here, Mr. West, but we are going to hear from Mr. Goodling, who will be making the presentation.'",
        "'speaker_0': 'Mr. Goodling.'",
        "'speaker_12': 'Thank you, Mayor. Thank you, Mr. West. Good evening. On behalf of the Long Beach Convention Visitors Bureau and our 400 members. Thanks for taking the time tonight so that we could share with you an update on what's been happening within tourism.'",
        "'speaker_12': 'The this past year has been a record year. If we can get this slides up here. Okay. So this past year, as I mentioned, has been our best year yet in the history of the Long Beach Tourism convention visitor.'",
        "'speaker_12': 'We had over $2 million in the top. For a total of $28 million. And over a six year period, that's been 130% increase in total. So it's gone from 12.4 million to 28 million. Interestingly enough, this is the fourth largest tax revenue generator for the city of Long Beach.'",
        "'speaker_12': 'So behind property taxes and behind also sales tax. This is the fourth largest tax revenue generator for the city. Every dollar invested has returned over $6. And in doing so, it's been a very competitive field for us to play in.'",
        "'speaker_12': 'We have sales representatives in major cities, north in San Francisco, Midwest, Chicago, North Atlantic, also two in the D.C. area and one down in Atlanta. In addition, we have half the sales team based in Long Beach. That is also backed up by a convention service team who services the customers when they're here, and also a marketing team'",
        "'speaker_12': 'that helps to provide the marketing materials not only for conventions, but also for other tourism and pleasure travel. Our sales team attended 28 tradeshows, basically one every other every other week this past year. In addition, we've had over 122 site inspections.'",
        "'speaker_12': 'That's basically two clients. And these aren't just individual clients. Often they come with several people. So 122 site inspections looking at the city of Long Beach. The great news is, is when we get them into the city is when we have a high closure rate once they see it.'",
        "'speaker_12': 'What we always hear is, gee, I didn't know changed, but we hear one of the two. The other thing that separates us from our competition is when we bring site inspections in. We create a community event. These are two clients out of Atlanta, and we either do a breakfast or a community luncheon.'",
        "'speaker_12': 'We had a client recently say that in 30 years of doing this, she's never had any other city in the U.S. pull together a committee of people that she'd be working with to greet her and actually have a meal.'",
        "'speaker_12': 'And that left an indelible impression. And because of that, they get to meet our working committee, our team, the team they'll be working with. As I was talking with a few a few people lately, as you all know, by this point, we're very much relationship driven, not transactional driven.'",
        "'speaker_12': 'Many cities today are transactional driven. They get a lead. They disseminate it to their hotels. They don't actually act as an ombudsman between the client or the hotel. We actually serve as both navigating through it. Several years ago, we had the privilege of hosting TEDx.'",
        "'speaker_12': 'And with that, we learned several things from TEDx. There is a recent article today that was just published on how decisions on choosing a destination for a convention have changed. Back in the eighties and nineties, people chose destinations primarily based upon ancillary activities.'",
        "'speaker_12': 'A lot of people used the convention as an extension of their vacation time. And what's transpired since then is people are using conventions now for more for networking and learning job skill sets to make them more competitive, either for their company, organization or within their industry as a whole.'",
        "'speaker_12': 'Ted epitomized this new generation of meetings at the TED conference. They had seating throughout the throughout their entire campus. The whole idea was if you saw somebody that you wanted to talk to, you could grab that moment instantaneously, sit and have a conversation.'",
        "'speaker_12': 'Think of the last time you were back in a convention center not in Long Beach. You had to walk down a long corridor, sometimes to the food court. Sometimes you found maybe a long metal bench. And that was where your conversation had to take place.'",
        "'speaker_12': 'We don't believe in that. We believe in the TEDx style. We believe in creating an environment that encourages you to network with your colleagues. And in doing so, we have transformed the Long Beach Convention Center into being a facility that basically has been designed to encourage networking.'",
        "'speaker_12': 'So throughout our campus we have a variety and I love this shot. This is a gentleman that at Twitch Con and regardless of where you want to hang in, in the convention center, there are seating everywhere. And in addition, the arena has been a wonderful boon for us because it's created it, yet at 40,000 square feet, an'",
        "'speaker_12': 'additional meeting space. And it can be used for General Sessions. It can be used for special events. But it's multi-use. It can also be used as an arena. Since transforming this space in 2013. Its days in use has gone from 154 days a year to 258 days a year.'",
        "'speaker_12': 'It's practically booked all the time. The other thing that we learned from Ted is you not only do create this great environment to network, but you have to have a wow party at night. You have to have something that really sets you apart.'",
        "'speaker_12': 'And it has to be something that you feel. If you're vibrancy, it feels great. And so the Arena was the first party that Ted did, and that was where we got the inspiration for this new project. In addition, they used the underpass under Seaside Way and they brought in food trucks, they brought in picnic tables and they'",
        "'speaker_12': 'brought in crystal chandeliers and hung them under and created a. Southern California food truck party. Well, as Ted has moved on, the other phenomenon that has occurred is Instagram. You can't go to a party now without someone wanting to take a photo.'",
        "'speaker_12': 'The great news about these Instagram moments is if they're provocative enough, if they're cool enough. Not only does it market your city, i.e., Long Beach, but it also markets the association and it markets it to their colleagues and friends saying, Gee, you should be here, too.'",
        "'speaker_12': 'So what has been created at this campus is a turnkey facility that lets national associations which have limited budgets. They don't have budgets like Google and Facebook and others, but their budgets nonetheless now can be used for food and beverage while we add the rest to create those instagrammable moments.'",
        "'speaker_12': 'So with that last July, we opened up the cove and we like to thank Councilwoman Janine Parrish for the help on the lighting in there. It's become a very safe area to walk. A boon for our residents, but also a boon for our conventioneers.'",
        "'speaker_12': 'And I'd like to share with you in the past 12 months how this special space has been used.'",
        "'speaker_7': 'I can't believe.'",
        "'speaker_10': 'This is history.'",
        "'speaker_1': 'It's a party now.'",
        "'speaker_4': 'Everything's turnkey.'",
        "'speaker_9': 'It's just very creative.'",
        "'speaker_4': 'You know, there's so many opportunities to do phenomenal things with your event here. Long Beach is definitely one of the most innovated convention centers that I've worked in across the country.'",
        "'speaker_12': 'So what was a sleepy underpass? And quite honestly, foreboding at nighttime has now become an active, vibrant space. And last year, the Port of Long Beach was host to the National Association of Ports. And Mario introduced me to a lady from Puerto Rico, and she told me that she'd been coming for 25 years to these conventions.'",
        "'speaker_12': 'But she thought that their Long Beach convention was the best yet. They had used the arena and they had also used the cove two great spaces. In addition, Mayor Garcia came up with a request, which of course we love his request because it's always fun.'",
        "'speaker_12': 'And this one was Steve. Let's let's take care of the fountains out front. And the fountains were 40 years old, and they really needed help. And so with that, again, Councilwoman Jeanine helped as well. And we got there and Charlie Byrne from the Convention Center and I worked on this project and we now have our third turnkey'",
        "'speaker_12': 'space complete with trusses, outdoor stage lighting and all of you got to experience that at the inauguration in July. But we'd like to share with you what Medallia and other companies have used this space. But again, think of Instagrammable moments, think of cool parties, think of other cities.'",
        "'speaker_12': 'And I will share with you there is no other city like Long Beach. At nighttime when you walk around the fountains, it's beautiful. We were out there recently. There was a father with his two kids. It was 10:00 at night.'",
        "'speaker_12': 'It was. It was during the summer. And and they were just having a blast. And, you know, it's really a fun environment and it's a great, great spot with that. We also have our challenges ahead of us. And a couple of us have had conversations about what those challenges are.'",
        "'speaker_12': 'The as we've moved forward and we moved ahead of the pack, quite honestly, in the private sector, there is a there is a group called Gaylord Hotels, and they call them Convention Center Hotels. They're large hotels. They have an average of 1200 to 2, basically 3000 rooms.'",
        "'speaker_12': 'They have about the same footprint as the same size of our convention center. And Marriott Corporation bought them a few years ago. And they're growing them quickly. They're opening one in the Rockies. There's currently one in Washington, D.C. there one is open in Texas and of course, Nashville, which was the founding one of the Opryland.'",
        "'speaker_12': 'This for a meeting planner is almost a dream come true because you sign one convention and Gaylord Hotels usually try to sell three years consecutively. So you sell one convention under the same contract language and you do it for three years, so you get a three year run.'",
        "'speaker_12': 'And so we've had to compete with that. In Long Beach, for example, when you book Long Beach, you have a convention center contract, you have various hotel contracts anywhere from 4 to 10 on average. And so we really have to oversell on how we're so different.'",
        "'speaker_12': 'And we are different. And what makes us different is what we just went through our turnkey spaces and our great seating, but they are catching up to us. And one of the things and these are just a couple shots, of course, down in Opryland.'",
        "'speaker_12': 'And then the new Texan resort. So in essence, if you put a little roof over downtown Long Beach, that's what we're competing with, in essence. And in addition, our regional competition, Sacramento, is asking their city council for 360 million to redo their civic center, basically their convention center.'",
        "'speaker_12': 'They want $30 million to add a 40,000 square foot arena. Our adaptive reuse program for the Pacific Ballroom was only 10 million. And so we've taken our assets. We utilize them, given them birth in new fashions. Unfortunately, we've not had to bond or go after significant moneys to do what Sacramento is doing.'",
        "'speaker_12': 'But this will become a competitor as it's finished. In addition, Portland is adding a new hotel, Hyatt Hotel, right next to their convention center. For those of you who have been to Portland, you'll know there's not much to do around the convention center because they don't have a lot of hotel inventory.'",
        "'speaker_12': 'Now they're starting to grow. And so for us, we have the Gaylord, the the large box projects. We have large hotels in San Diego, Anaheim and L.A. that we're competing with that are 800 to 1200 rooms in size.'",
        "'speaker_12': 'And so for us, we need to continue to invest in the building. We've strategically taken the position we've invested in the exterior or the customer feeling of the building. We've, fortunately, have been ahead of the curve with that.'",
        "'speaker_12': 'Thank you to city management. Thank you to the mayor. Thank you to all of you for supporting that. And now we need to take care of the behind the house. It's a 1960s building. We have a lot of work that needs to be done on infrastructure.'",
        "'speaker_12': 'And so with that, we have to address that. And we've had those conversations. And, of course, we look forward to the leadership as we move forward into resolving those issues. We also have the Olympics coming up in 28, and that's less than ten years away.'",
        "'speaker_12': 'All of you have been involved in commercial projects. It really takes a good two years to get things up and running, which means then you have six years, six, seven years left to make sure you bring them under completion.'",
        "'speaker_12': 'So the time is now to do what we need to do at that facility. These are some of the renderings that you've seen in the past. It's going to be wonderful. Long Beach will be home to the world.'",
        "'speaker_12': 'And so it's going to be a great time for us to showcase our city in addition to progressive leadership. Four years ago. And Julia Wang came and said, Steve, we have this great idea. It's called Powwow. I reached out to the mayor.'",
        "'speaker_12': 'The mayor loved it. We reached out to city management Peyton Tom. They loved it. We reached out to the port and the port got on board. And before we knew it, we had the support of bringing pow wow to Long Beach.'",
        "'speaker_12': 'The artists that were here this past year, they personally and individually had contracts with Prada, Tiffany, Nike, Adidas and others, and they were here.'",
        "'speaker_0': 'It forgot DC Comics.'",
        "'speaker_12': 'And DC Comics. And go Superman. And so with that, we we've had the best artist in our city. And with that, these are the murals that they have left behind. This year alone, four pow wow. We had over 128 million in print and also digital press advertising equivalency, close to $1,000,000 in power alone this year.'",
        "'speaker_12': 'And we brought 43 press in just for powwow. The fun thing is, I think Pat West calls this the best urban renewal program going. $2.7 million is the aggregate valuation of 73 murals in four years. So in addition to all the publicity, in addition to creating a lot of recognition for the city and bringing people in, it's'",
        "'speaker_12': 'also left. That left us a legacy that's continuing to last at this time. I'd like to have Lauren Simpson share with you. Other things that we've done to bring pleasure travel into the city in addition to our convention travel.'",
        "'speaker_12': 'Lauren.'",
        "'speaker_4': 'Hello. So this year we continued our partnership with the aquarium and the Queen Mary on a co-op at in Sunset and West Ways Magazine for a combined circulation of 15 million. Instead of purchasing ads separately, we partnered together, which allowed us to have this two page spread in front of you both being highly visible versus each of'",
        "'speaker_4': 'us going in individually and having smaller ads. Furthermore, we've driven as we've driven leisure travel. It's been an incredible year in terms of exposure for the city of Long Beach. This past year, we've hosted several media visits, including a group visit of 38 four world renowned artists.'",
        "'speaker_4': 'I'm sorry, journalist and digital travel. Sorry, let me come down. 38 group visits, including digital influencers and writers from around the world. We hosted 26 individual media visits, which included, again, digital influencers, writers as well as editors from around the nation.'",
        "'speaker_4': 'Now, as are sales. Just like our sales team. Excuse me, our team relies on relationship building because of relationships and our proven commitment to service. Once again, we've had the chance to host the Latino bloggers. Now, these bloggers had a choice of hanging out with YouTube, Mazda and Neutrogena to name a few.'",
        "'speaker_4': 'But we had 80 who decided to hang out in Long Beach. Now that 80 represents about a fourth of the attendees for that conference. Here's a recap video of their experience here in Long Beach. As you can see, I've had a great time hanging out with those here in the city of Long Beach in their first year'",
        "'speaker_4': '. The conference had an opening and sponsorship and the CVB stepped in to help them out and host a group. Well, now in their third year, Long Beach is chosen over top brands like a YouTube to hang out for their attendees.'",
        "'speaker_4': 'So we're doing something right. All of these efforts culminated into many amazing placements for us throughout the year. This one right behind you or in front of you was one placed in the New York Times. This one singular story had a circulation of 1.8 million.'",
        "'speaker_4': 'Now, just to backtrack a little bit, it took we pitched this outlet for over two years. The writer finally came out and hung out in our city. Had such a fantastic time that he wrote an incredible story. Again, one article equal a 1.1 circulation.'",
        "'speaker_4': 'And now to total it all out. For the past year we've had a total of 246 million in circulation. And this past year, we had an ad equivalency of 1.9 million. Our two overall impressions on print were 281,000 broadcast, 332 and again, 205 million impressions online.'",
        "'speaker_4': 'That includes both influencers. So social media posts, blog posts and online journalists. In terms of social media, we've seen double digit growth in our followership. As you can see, Facebook is nearing 50,000. We have over 20,000 on Twitter and Instagram is nearing 20,000.'",
        "'speaker_4': 'Now, keep in mind, all of our followers are organic. We've not paid for any of them. Aside from that, a lot of them consist of travel writers, digital influencers and editors who taught our city shared stories online or in print, and then continue to share their Long Beach experiences and throwback Thursday posts.'",
        "'speaker_4': 'We've had some great movement in terms of social and wanted to update our website. We had a soft launch, and something that's great about this new website is its way of harnessing social media. So on it you'll see tons of user generated content and great video.'",
        "'speaker_4': 'Another key component is that is the use of virtual reality and 362 hours. Once you launch the VR, you'll notice that there are blue waypoints towards the top, singling out hotels. Our website, I'm sorry, our Long Beach Airport.'",
        "'speaker_4': 'Major attractions as well as our convention center. The Tories also feature an interactive video component. We offer experiences like driving in a drift car where the user is able to put on their headsets, see everything that's in front of them, but then also see everything behind them.'",
        "'speaker_4': 'So as you know, when the drift cars go, all the smoke that flies up, all you have to do is turn your mouse or turn your headset, and you can see all of that happening behind you. Now, this is something that keeps us ahead of the competition.'",
        "'speaker_4': 'Especially since we know that today's consumer is all about the experience. With our new website we're right on target so have fun exploring. Visit Long Beach dot com. As you can see, we've had an incredible year in terms of exposure to the city of Long Beach and the ability to provide true experiences to those looking to travel'",
        "'speaker_4': '. Now I'd like to bring John Molina, former board member and current developer here in the city. He accompanied us to on our D.C.. Mission and pitched the city as well as his current project. Thank you.'",
        "'speaker_3': 'Pete.'",
        "'speaker_8': 'Thank you very much. I'm John Molina. Thank you for letting me speak in front of you, Mr. Mayor and council members. I've been on the board of the CVB for many years. I just recently got off the board.'",
        "'speaker_8': 'Ironically, I wasn't in the hospitality business when I was on the board. And now that I'm getting into the hospitality business, I'm getting off the board. You see the result of what these folks do? You see them when you go downtown in restaurants and you see the conventioneers walking around with their badges.'",
        "'speaker_8': 'You see them every time. It's August, September, and you're looking at the budget. You see how much money they bring in. You see the wonderful projects every year or two that Steve Goodling and the crowd of the CVB comes in, whether it's the Pacific Ballroom or Bogart's or the Fountains or the or the bridge.'",
        "'speaker_8': 'But what you don't see is the hard work that goes in behind it. And I had the opportunity a couple of months ago to go on a Washington, D.C. trip. And sit with the folks from the CVB and the other hotels in Pitch Long Beach.'",
        "'speaker_8': 'You have no better ambassadors for this city than this group of people. They love the city. They work hard. They know their city inside and out. And they really bond connect with the people that they're trying to get out.'",
        "'speaker_8': 'From, whether it's Washington, D.C. or New York or Austin, Texas. And believe you me, there is a lot of competition for this business out there. And these folks do a fantastic job. They build the relationships and they sell the city.'",
        "'speaker_8': 'For every dollar.'",
        "'speaker_0': 'You invest, you get $6.'",
        "'speaker_8': 'Back. That's a pretty good deal. And what Steve and his team have done in the convention is really invest in the long term for the city. And I have the pleasure of introducing a video that shows our experiences in Washington, D.C..'",
        "'speaker_4': 'I could do testimonials for Long Beach forever, only because it's near and dear to my heart. We have had the best experiences here because of contracting the space and working with the CVB and working with our sales people at the hotels.'",
        "'speaker_6': 'And every single hotel goes out of their way to make sure you.'",
        "'speaker_4': 'Have exactly what you need and they're with you the whole way through as the CVB is, as your convention salesperson is.'",
        "'speaker_9': 'And all of the staff at the convention center.'",
        "'speaker_4': 'Because there is such.'",
        "'speaker_6': 'A connection, the passion that they have.'",
        "'speaker_4': 'For the destination. It's contagious.'",
        "'speaker_6': 'And we end up for unit falling in love with the city the same way because they're truly invested in their city. And it shows. I loved Long Beach because of the sense of true partnership I get and bringing my meeting to their city because again, it starts with the Convention and.'",
        "'speaker_10': 'Visitors Bureau down.'",
        "'speaker_1': 'Pension center.'",
        "'speaker_10': 'To the hotels, to the.'",
        "'speaker_1': 'Restaurants.'",
        "'speaker_6': 'The whole.'",
        "'speaker_10': 'Entire city.'",
        "'speaker_6': 'And you walk away feeling, I have a true partnership with Long Beach. The Long Beach CVB is.'",
        "'speaker_16': 'Such an extraordinary partner for event planners. They know the city in their hands. And at the same time, there's a lot of cooperation with the different organizations within the city.'",
        "'speaker_4': 'The building works with us when we're moving stages. Three days before the event starts, all hands on deck, whether it's the fire department, police department, the building itself.'",
        "'speaker_10': 'We also had a very special situation.'",
        "'speaker_4': 'We really wanted to do a party on the beach in Long Beach since we were there.'",
        "'speaker_6': 'And the club went to bat for us, called in a lot of favors so we could actually do a beach party.'",
        "'speaker_4': 'On the beach. So it was great and they were great.'",
        "'speaker_8': 'We came in and we were actually fashion first floor. You know, that's kind of our concept. You got to have good lighting to show color. And the lighting and convention center wasn't the best. So within 24 hours, we had an answer from Steve and the crew at the Convention Center in the CVB, letting us know that they're'",
        "'speaker_8': 'guaranteeing they're going to put in new lights for our group.'",
        "'speaker_10': 'And one of the key things that Long Beach did differently than any other destination we've had the pleasure of working with, is that without asking, without prompting, I received an economic impact statement.'",
        "'speaker_0': 'We were able.'",
        "'speaker_10': 'To see directly that our meeting allowed people in the.'",
        "'speaker_0': 'Destination to.'",
        "'speaker_4': 'Work during that week.'",
        "'speaker_10': 'So kudos to.'",
        "'speaker_0': 'Long Beach for offering that.'",
        "'speaker_6': 'Without me asking. Everybody goes above and beyond the call of duty to try.'",
        "'speaker_8': 'And make sure.'",
        "'speaker_6': 'That your program is outstanding. And they want you to come back. They want you to have a great experience. So you'll want to continue to come back. And we do the top notch. It's wonderful. I think in the.'",
        "'speaker_1': 'Convention center, for instance, I had.'",
        "'speaker_6': 'A meeting. We were in a ballroom. I needed some cushy chairs for my panel discussion. And no question, the my convention services person picked up the.'",
        "'speaker_1': 'Chairs from outside, brought them.'",
        "'speaker_6': 'In. Done. And you don't always get that kind of service at a convention center. It's great. You know what? Honestly, I have to say, you know, I know that people say things because they think it's the right thing to say.'",
        "'speaker_6': 'But I'm a very honest person and I can tell you, I love Long Beach. They are the most terrific, terrific place to be. Long Beach. The people are great. The venues are great and they really take that personal touch.'",
        "'speaker_6': 'They really do. They take a personal touch to make sure that your event goes well, that you're happy.'",
        "'speaker_0': 'And the people are as friendly as they appear.'",
        "'speaker_3': 'They are definitely.'",
        "'speaker_0': 'Very easy to work with. They are willing to.'",
        "'speaker_4': 'Be flexible.'",
        "'speaker_10': 'And create spaces, even in spaces that they have already set.'",
        "'speaker_3': 'Up, that you can do something new and different with your event.'",
        "'speaker_8': 'Working with the crew at the Long Beach Convention and Visitors Bureau is an amazing experience. It is so imaginative and innovative. I think those are probably the most innovative cities in the country. The world. This year was best in the West.'",
        "'speaker_8': 'Maybe next year will be best in the U.S.. Mr. Goodling talked about the Gaylord talked about what's going on in Portland, in Sacramento. I'm biased, but those folks don't hold a candle to the uniqueness of Long Beach with our convention center and the hotels and the waterfront and the restaurants, etc. But we need your continued support to'",
        "'speaker_8': 'put on a top notch CVB to return the money back to you. Now I'd like to introduce John Thomas, who I'm sure you all know, who's also a board member. People.'",
        "'speaker_12': 'Good evening, council members. Mr. Mayor, nice to see you again. What also makes Colombia so unique is our collection of nonprofits.'",
        "'speaker_8': 'These non-profits work hard every day to leverage their resources to deliver services and programs that, frankly, the city couldn't deliver and maybe that the public sector cannot deliver. The CVB has.'",
        "'speaker_12': 'Long enjoyed a relationship with these nonprofit partners. It's been strategic in our values and our mission statement in the city as well as in all the districts to assist where we have an opportunity and one special occasion.'",
        "'speaker_8': 'We'll be celebrating.'",
        "'speaker_12': 'Here pretty soon. Another month or two is our very own Ronald McDonald House, who's since its building in the city of Long Beach. And thanks to the CVB.'",
        "'speaker_8': 'Our hospitality partners.'",
        "'speaker_12': 'Our restaurants and catering partners.'",
        "'speaker_8': 'Not one meal has been missed at the Ronald McDonald.'",
        "'speaker_12': 'House because of these partners, and I think that's a very significant sign of how the CVB. Our partners play in the city.'",
        "'speaker_8': 'To make sure that our nonprofits are accommodated. Without further ado, I have a guess what a video to show you. I think it might be the last. Get it up, but we'll keep your video. And thank you so much for your participation in your support of the CVB.'",
        "'speaker_1': 'The CVB is beyond just events. They actually connect the community to other national resources and also build our capacity as an organization. The participants weren't all.'",
        "'speaker_5': 'Of the space.'",
        "'speaker_1': 'They were so proud to be Cambodian and they.'",
        "'speaker_4': 'Felt like they were valuable.'",
        "'speaker_1': 'Contributors to the larger.'",
        "'speaker_6': 'Society.'",
        "'speaker_8': 'Unfortunately, I've attended a lot of funerals in my time in the union and as president of Local 372, I can tell you I have never attended a service where a convention or center bureau or an organization like the CVB has gone to the extent.'",
        "'speaker_8': 'Long Beach, CVB have done. The CVB and the Convention Center gave discounted rate to the firefighters who traveled from across the nation, and they were given a discounted rate, which was absolutely a blessing to our people.'",
        "'speaker_17': 'What's been wonderful this year is that the CVB actually became one of our corporate sponsors. And that's wonderful because what it really does is it promotes the bridge building between two organizations within Long Beach. And what everybody wants is to always be included.'",
        "'speaker_17': 'Everybody wants a seat at the table, and anytime you go to CVB, they make sure that happens.'",
        "'speaker_4': 'You know, as nonprofits, you know, we all.'",
        "'speaker_5': 'Have our.'",
        "'speaker_1': 'Specialty.'",
        "'speaker_10': 'Like Central Cha, like the core of the Cambodian community. And we were given a specialty chef who designed our.'",
        "'speaker_4': 'Food for.'",
        "'speaker_5': 'Our events to celebrate our.'",
        "'speaker_4': 'Culture. So really, because I know that they will do.'",
        "'speaker_3': 'So much for.'",
        "'speaker_6': 'Us that we won't have to do and I don't have to stress about it. I know it's going to be a successful event. They work with the nonprofits. They want us to succeed. And that's so.'",
        "'speaker_4': 'Rare. There was this unused space and and the people at the CDB had a fantastic vision for it. They redecorated it. They opened it up, made it beautiful and new, and brought these different performing arts groups. And here we are and we're part of it.'",
        "'speaker_4': 'And we're so excited to be part of the Beverly O'Neill Theater. Thanks to the CDC.'",
        "'speaker_16': 'Let's face it, the CVB works daily on trying to get the word out and bring attention to our great city. They've increased marketing, which is helping all the arts and creating greater awareness in the community. And I think they do all this because they understand and value the importance of quality arts in our community.'",
        "'speaker_6': 'One of the most visionary initiatives that they've launched in the last few years that has greatly benefited the symphony and all the artistic partners is the creation of an arts brochure that publicizes all of the different happenings at the center.'",
        "'speaker_6': 'And we are so fortunate that they provide that kind of marketing support, and it's a brilliant idea.'",
        "'speaker_10': 'They are more than a convention center. They are our best friends, and that's for sure. They were step by step and made that.'",
        "'speaker_9': 'Unique experience.'",
        "'speaker_10': 'Marvelous.'",
        "'speaker_3': 'It has become a dynamic force for the city of language.'",
        "'speaker_10': 'We have groups, we have so many nonprofits in this region, and they utilize the facilities for their fundraisers. Plus, they're charming to work with and they work hard.'",
        "'speaker_8': 'When you call the city, you're not just renting a room. You're not just getting a meal. You really are getting in touch with people that care and they care deeply. And you just can't find that other large cities.'",
        "'speaker_17': 'They love plumbing.'",
        "'speaker_5': 'And they know the value of.'",
        "'speaker_1': 'What makes Long Beach beautiful.'",
        "'speaker_5': 'Which is the diversity.'",
        "'speaker_4': 'What people also don't know about the Convention Visitors Bureau is that.'",
        "'speaker_3': 'They also support the.'",
        "'speaker_4': 'Youth, but that's part of their community involvement, and they've done that for many years without asking for us to broadcast that.'",
        "'speaker_6': 'They have pride and community because they invest.'",
        "'speaker_3': 'In this community. Great.'",
        "'speaker_12': 'On behalf of our entire tourism partners behind us, if I could ask our CVB staff first to stand so we could thank them for their hard work this year. And as all of you know, without our convention center partners, we couldn't even begin to do what we do.'",
        "'speaker_12': 'If Charlie Byrne and your team, Veronica, if you could all stand as well. And our hotel partners. You heard about it, the rates that were given for the fire. Sadly, what happened with Captain Rose this year and others, again, it's a great partnership.'",
        "'speaker_12': 'So could all of our membership stay if we could just thank them for doing what they do? The best thing. And I think Beverly O'Neil said it, and that is we're Long Beach. We're collective. Not only does this entire group sell the city every day.'",
        "'speaker_12': 'Not only do we welcome conventioneers and let them know that we what we can do for them. But we're also bringing in press. We're showing them how to sell the city. And beyond that, we're working with our nonprofits because if they're successful, we're successful.'",
        "'speaker_12': 'And that's what we should be doing. So all these folks behind me make it all happen. We appreciate your support in making it happen. And again, thank you for another wonderful year.'",
        "'speaker_0': 'Thank you so much, Mr. Goodling. We have we have a couple we have a couple of items as part of this. The general public comment is not here. This is just on the hearing comments. And then we have any any any other comments on the hearing, which we don't.'",
        "'speaker_0': 'Councilman Pearce and he comes for we vote. We have one other item at CPB related as well. Okay. So, members, please cast your votes on the hearing.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute the Sixteenth Amendment to Agreement No. 28164 with the Long Beach Area Convention and Visitors Bureau, Inc., to extend the agreement for a one-year period and provide funding in the amount of $4,958,676 for Fiscal Year 2019.  (Citywide)": [
        "'speaker_0': 'Okay. Then we have the companion item is 20, which is the CVB Agreement Item.'",
        "'speaker_1': 'Report from City Manager Recommendation to execute the 16th Amendment to agreement with the Long Beach Area Convention and Visitors Bureau to extend the agreement for a one year period and provide funding in the amount of 4,958,676 for fiscal year 2019 citywide.'",
        "'speaker_0': 'Thank you. Again, we don't have the general public comment is next. There's no public comment on this item. We're going to go ahead and go to control reporters so we can take will vote as the package. I don't think we have a do we have a staff full staff report on this or not.'",
        "'speaker_0': 'I don't think we did this for America.'",
        "'speaker_11': 'I think that was that was extortion.'",
        "'speaker_8': 'Yeah. So.'",
        "'speaker_0': 'Councilmember Pierce.'",
        "'speaker_5': 'Okay. So. The genius move that you did is that we get to give you $5 million and we get to hear your big presentation. So we're paying you to hear about how great you're doing. I want to say that, obviously, I think you guys have done a great job.'",
        "'speaker_5': 'I think the work at the convention center has really transformed. I loved the numbers that you shared with us. I know you and I have talked several times about what a great job everybody in the city is doing.'",
        "'speaker_5': 'I want to also recognize, you know, taking on transforming the vision of of our city. Right. We know that 15, 20 years ago that that is what you're up against when you bring people in and that you're changing their mind about what a great city it is.'",
        "'speaker_5': 'And so for that, I want to thank you. I also want to thank my colleagues that you recognized me a couple of times, and I definitely appreciate it. But knowing that it is a full council that votes on this and a lot of times those are tidelands funds that we're using for that.'",
        "'speaker_5': 'And so I want to recognize my council colleagues for their support in transforming our convention center. Also, I think one thing that you mentioned was the competition that we have. And I think it's important to recognize I think it's important to to look at how are we addressing those challenges.'",
        "'speaker_5': 'And I think the market and what we've done with the downtown plan has really been fantastic in ensuring that we now have, you know, John Molina that purchased the Breakers Building, that we have a hotel that slotted for our civic center, that that Long Beach is bringing in more hotels into the mix.'",
        "'speaker_5': 'And so I think that that's also wonderful. I had I guess I had one question that I wanted to ask you. You guys mentioned everybody having a seat at the table, everybody wanting a seat at the table. And so I cued up Tom, just to ask, because I had somebody asked me last week on your board, does'",
        "'speaker_5': 'the city have a position on the board for the CVB? And because I know we have one with our DBA advisory board and I know with the aquarium, but it seems like such a great party that I think the city, you know, we want to be at the table.'",
        "'speaker_0': 'Mr..'",
        "'speaker_11': 'MODICA So if I remember the. So if I remember the agreement correctly, we do not have a sitting a seat on this board. We're in constant contact with the CVB. We control a lot of what we expect for the CVB to be doing through our contract language.'",
        "'speaker_11': 'But we do have and from some other boards we do have ex-officio or we sit on the board that the city tends not to be a voting member on any of those because really we want to make sure that we're being the contract partner rather than sitting at the table.'",
        "'speaker_11': 'But I do not believe we have a staff seat at the board, but we show up. Steve What? Somebody is there. Probably every board meeting from one of the departments is my guess.'",
        "'speaker_12': 'In the past, council member, the city was actually invited and declined. And the reason is, is because, as Mr. Modica said, the city prefer to keep it a contractual basis and a deliverable basis. And tonight was our sharing of our deliverables.'",
        "'speaker_5': 'Great. Yes. Thank you for that. Real quick, before you before you have a seat. Mr. Goodling, I wanted to ask one question. I think the Olympics is something we're all, you know, excited about on some level. How are you guys going to position Long Beach in that conversation?'",
        "'speaker_5': 'What are your plans? And it doesn't need to be long, but just a recognition that I know that it's built underneath Los Angeles, but that we as the city the.'",
        "'speaker_12': 'The challenge with the Olympics. Is one. It's in 2028. Los Angeles, it will be known as Los Angeles. However, the events that are being held here are being held in such a concentrated space. It's an opportunity for us, like in 2004 when we hosted the Olympic swimming trials to actually have the role down here with that awesome'",
        "'speaker_12': 'view of the beach and that crescent shaped beach at that point. NBC called it eye candy. It is. And I know if we bring the press in and we create these venues to do that, we can showcase, quite honestly, our waterfront and therefore the downtown.'",
        "'speaker_12': 'But fortunately, all these events are concentrated, so it gives us that opportunity.'",
        "'speaker_5': 'Great. Thank you for that. And then I just have a question for staff, but thank you for the amazing presentation and for all the videos. And I know everybody cares very deeply about their work with the CVB and it really shows.'",
        "'speaker_5': 'My last question is on this item in particular. Can you talk about staff where those funds are going to be used and how that relates to Rainbow Lagoon as well?'",
        "'speaker_11': 'So the vast majority of these contract dollars are from our special advertising and promotions fund. When we generate tot 12% tot that goes to the city. Half of it goes into SAP and the other half goes in the general fund.'",
        "'speaker_11': 'And then a portion of the general of the SAP goes back to the CVB to help us generate more and more tax. There is a very small amount off the top of my head. I think it's 3 to 400000, and that is for the Rainbow Harbor Sub Fund, which is Tidelands.'",
        "'speaker_11': 'It's a very small amount. It's been there ever since I've been here, so at least 15 years or so. And it's just it's a remnant. It's a very small portion.'",
        "'speaker_5': 'Great. Thank you, everybody, for coming out today. Thank you for all everybody that works for the CVB, for the hotels, for everyone that makes our city great. Really appreciate.'",
        "'speaker_3': 'It.'",
        "'speaker_0': 'Thank you. Councilman Price.'",
        "'speaker_9': 'I, too, want to thank you for your presentations. I know that Steve puts a lot of effort and time into tailoring the presentation so that there's an aspect of the presentations that speak to the interests of each and every one of us.'",
        "'speaker_9': 'And I appreciate that you do that. You're incredibly thoughtful in that way. The entire team together as a collective unit has done amazing things to message the city. We were so far behind in terms of how we were messaging the city, how we were marketing ourselves, the types of individuals and groups that we were attracting to the'",
        "'speaker_9': 'area. And we are now so much further along than even five years ago when I started on this body. And it gets better and better every year. I'm very mindful of the fact that in order for you to do the work that you do, you need a partnership that involves not just beautiful words spoken at the dais'",
        "'speaker_9': ', but also an investment in resources into the facilities that you've worked so hard to market. And I assure you that the Council is committed to that. We continue to work on that to the best of our ability. We do have always challenges and limitations, but I don't think it's lost on a single member of this body.'",
        "'speaker_9': 'How important the work that all of you do every day is. And we see it when we come and visit the facility for a function or when we talk to visitors in the city who have come from another area.'",
        "'speaker_9': 'You've really done your best to showcase along the beach in such a positive way. I love the presentation. The only thing that is rubbing me the wrong way is the big letters saying Los Angeles on top of the arena and the rendering of the what the Olympics will look like.'",
        "'speaker_9': 'So if there's anything that we can do to make sure that future renderings don't have that, I'd really love to see that. Even if it's just for us living in bliss for a few years, believing that it's going to say Long Beach or Colby or something, something like that.'",
        "'speaker_12': 'Just don't put posted on Facebook and we'll get that to you in the morning.'",
        "'speaker_9': 'Thank you very much to all of you for the work that you do.'",
        "'speaker_0': 'Thank you. And Vice Mayor Andrews. Yes.'",
        "'speaker_2': 'Real quickly, I just wanted to thank and congratulate Steve and his team for the amazing work that you guys do know as a city. I don't know what we would do without you guys because the fact that this is strong beach, you know, and I want to thank all you guys, you know, and for giving back to'",
        "'speaker_2': 'the community. I would just only hope next year we could probably have a convention center because of the individuals you bring. You are the crowd pleaser, Steve, I tell you and your crew. Thank you guys again for coming out and showing us how great you really are.'",
        "'speaker_4': 'Councilman Mongo I just want to thank Steve and the team also. Many of you know that this year we were so fortunate to have Hawaiian Airlines join the number of airlines at the Long Beach Airport. Steve and his team have already started to work with our local individuals who sell travel because so many individuals are coming here'",
        "'speaker_4': 'in advance of their trips to Hawaii and staying for a few nights. So I really appreciate the investment not only downtown but also on the east side, as do a lot of our hotels that are on the east side that are getting that great business.'",
        "'speaker_4': 'So if any of you want to join us for that evening, well, we're going to be working with and promoting the Long Beach Airport to our travel agents in the region, and we're very much looking forward to it.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you. And I'm just going to just to say again, guys, fantastic job. And, you know, Steve, I think you do amazing work. You guys are the magic makers, the ambassadors of the city. And we just thank you for all your incredible work and great presentation.'",
        "'speaker_0': 'And thank you, Councilman Richardson.'",
        "'speaker_15': 'Thank you. And sorry for chiming in. Last, I thought we would have a few more people here, but I couldn't have all of you all come here and not be able to just acknowledge that. The best thing about the two years I served as vice mayor was working with you, Steve, and your team, Lauren, Charlie, Barbie, everybody'",
        "'speaker_15': 'to help welcome these conventions to our city. It was a tremendous honor. I had a great time and learned so much about our city and all the hard work that you all do to present present our city to the world.'",
        "'speaker_15': 'So thank you for that. I also want to say every time we've called you and your team have stepped up and delivered for. For all of us. So any time there's you know, there's anything on the line, you know, and our latest call was simply, my family's coming to show us what to do.'",
        "'speaker_15': 'Right. We had 250 McCreary. My mother's maiden name in town. And I got to tell you, this was the best family reunion we've ever had. And we've been doing this since the since the fifties, for every other year in a different city every year.'",
        "'speaker_15': 'And this is the best one we've ever had. So I just want to sincerely say thank you for what you do. You know, at one point that was really incredible. Here was the fact that you lifted up that total is the fourth largest revenue generator in our city.'",
        "'speaker_15': 'So it is smart. It is a good business strategy for us to continue to invest in you and to make sure that we are supportive of you and what you do. So thank you so much. And we get it.'",
        "'speaker_0': 'Thank you. Thank you very much. Is there is there any general public comment on the ACP? Just Mr. Goodhue, and then I'll close the speakers list and we'll go to a vote.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'I do obviously support the tremendous job they've done and they bring into sharp focus the importance of the image of the city of Long Beach.'",
        "'speaker_8': 'That the millions, millions.'",
        "'speaker_0': 'Millions we get from that positive image. And that goes to the issue of making sure that we have elements in this city that does not detract from that image, such as the documented documents that each of you have gotten delivered in relative to the necessity and necessity.'",
        "'speaker_0': 'Of divorcing from this city. Excommunicating at any disease. Decadent. Conduct the type of which Councilman Rex Richardson has engendered in his. A small patch of his area. By supporting his. His the deviant. Decadent. Snoop Dogg, the criminal as the press telegram and the police label in Long Beach is number one.'",
        "'speaker_0': 'But. In this day of the state trend. Look at the state TV for the past three weeks. What's on their treatment of women? All right. Period. The councilman needs not only to be censured. He needs to be run.'",
        "'speaker_0': 'That district where that patch disease patched is must be divorced from the city of Long Beach. That the state may have to do that. I don't know where the lines are going that that will undermine undermine that which everybody here in this room.'",
        "'speaker_0': 'And protect all those people to support the convention center. Do it because in this day and age in the MeToo movement. Nobody is going to come to anything and put their dollars.'",
        "'speaker_3': 'Where right now we're in.'",
        "'speaker_0': 'Here in a city that that's deviant. Deckhand. Behavior relative to treatment of women. Period. And more of that will be coming down, incidentally. From the headquarters of the YMCA, which apparently is in that same disease area the Rex Richardson has engender as formulated.'",
        "'speaker_0': 'They will not put up with that. But again, that's that undermines the good work these people have done for years. And the cost will run into the billions. Action needs to be taken by this council on that subject.'",
        "'speaker_0': 'Thank you. Thank you. Members, please go and cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Congratulations, everybody. It's given a round of applause. There. There are a few people that signed up for for general public comment. They're kind of related to this. So I'm going to just put those folks together and just call you up right now.'"
    ],
    "Recommendation to declare ordinance amending and restating in its entirety Southeast Area Development and Improvement Plan (SEADIP) (PD-1), read and adopted as read.  (District 3)": [
        "'speaker_0': 'We're going to hearing item number one. Please take a seat. Please take a seat. We're going to hearing at our number one. Thank you.'",
        "'speaker_10': 'All. I'm here for that.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Hearing Item number one Report from Development Services Recommendation to receive supporting documentation of the record. Conclude the public hearing. Declare ordinance amending the Southeast Area Development and Improvement Plan. Incorporating the modifications by the California Coastal Commission. Read for the first time and lead over to the next regular meeting of the City Council for Final Reading and adopt'",
        "'speaker_1': 'a resolution to submit amendments to the Long Beach zoning regulations and supporting material to the California Coastal Commission for Approval and Certification District three.'",
        "'speaker_2': 'Thank you. Thank you. I'd like to turn this over to the city manager.'",
        "'speaker_12': 'I thank you, Vice Mayor, council members. We have a report on this by our director of Development Services, Linda Tatum.'",
        "'speaker_10': 'Good afternoon, Vice Mayor, a members of the City Council. This item is a procedural matter.'",
        "'speaker_4': 'It is the return of an ordinance that the City Council adopted earlier this year to amend.'",
        "'speaker_9': 'The.'",
        "'speaker_4': 'Sea dip.'",
        "'speaker_9': 'Zoning and sea dip, which is SD one. It was designed to.'",
        "'speaker_4': 'Facilitate the low Cerritos Wetlands Restoration Project. That project was.'",
        "'speaker_10': 'Also approved by the.'",
        "'speaker_4': 'City Council. The city is required to.'",
        "'speaker_10': 'Submit a local coastal development.'",
        "'speaker_9': 'Program amendment to.'",
        "'speaker_4': 'The Coastal Commission.'",
        "'speaker_9': 'In order.'",
        "'speaker_4': 'To effectuate the ordinance changes. That is what this ordinance represents. The Coastal Commission heard the ordinance in August. They adopted the ordinance with the changes that Council is being asked to consider tonight. So that.'",
        "'speaker_10': 'Concludes.'",
        "'speaker_4': 'Staff's presentation, and I'm available to answer any questions you might have. Thank you.'",
        "'speaker_2': 'Find.'",
        "'speaker_10': 'And just a reminder, this item includes both the new ordinance, the revised ordinance and the resolution.'",
        "'speaker_8': 'Returning it back to the Coastal Commission for their final approval.'",
        "'speaker_2': 'Thank you. Mrs. Price, you have anything to say?'",
        "'speaker_9': 'I just asked my urge my colleagues to support this item. It's been through Coastal Commission. I want to thank Councilman Aranda for the work that he did on the Coastal Commission when this item came forth. And I ask for your support.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman, you have a.'",
        "'speaker_13': 'As noted by staff, it's a procedural effort here that we're doing, and it's basically affirming what the commission has already done and we'll continue from there.'",
        "'speaker_2': 'Thank you. The only public comment on this item. Please state your name.'",
        "'speaker_0': 'Very good. You work as it is. I support this with this one caveat. And I'm not quite sure, but I want to make sure that this has nothing to do, nothing to do, nothing to do whatsoever with the pending plan to redo the breakwater.'",
        "'speaker_0': 'I just because I've received communications back and forth and I quite frankly, wasn't sure. Okay. So this has nothing to do with the break of the breakwater. I fully support this. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Goodwin. Next public comment.'",
        "'speaker_17': 'Good evening. And Cantrell. And I'm representing citizens about responsible planning and the protect the Law Cerritos Wetlands. In September 2017, this council approved a new zoning plan for the southeast area. It's known as Southeast Area Specific Plan or C CIP.'",
        "'speaker_17': 'The city spent over $100,000 on a consulting firm, plus hours of citizens time in preparing this plan. However, instead of using this revised plan for the proposed new oil drilling project within the zoning area, the old outdated sea dip plan was used for the air and coastal.'",
        "'speaker_17': 'Commission applications. This has required a number of changes to CDEP to allow for different land uses in four parcels, including oil drilling in places where it was not allowed previously. We are confused by these changes to sea dip, since Sea Dip will now be updated by tonight's changes.'",
        "'speaker_17': 'Does that mean that C CIP will not be sent to the Coastal Commission for approval? If C sip is to replace c dip with all of these changes you're making tonight, be automatically transferred to c sip or we'll see cip also have to be amended to allow the oil drilling.'",
        "'speaker_17': 'Especially troubling is item M on page 28, which discuss an extension of Studebaker Road. The extension of Studebaker Road was removed from c cip. And must be removed from sea dip on August 18th. The Coastal Commission approved oil drilling on the most storied US Wetlands Authority, five acres and pumpkin patch with many requirements.'",
        "'speaker_17': 'What you will find listed in your staff report. It wasn't read to you tonight in the in this report.'",
        "'speaker_10': 'Although Coastal.'",
        "'speaker_17': 'Commission staff has worked very hard to attempt to modify and mitigate the potential.'",
        "'speaker_10': 'Harm.'",
        "'speaker_17': 'Which might be done by new oil drilling in an environmentally sensitive area. We find that most of these modifications are inadequate. There is an argument as to whether the five acres in the pumpkin patch are esher but there is no argument that the lost Cerritos Wetlands, the San Gabriel River, Alamitos Bay and the Pacific Ocean could be'",
        "'speaker_2': '. You know, your time is up.'",
        "'speaker_17': 'By an oil.'",
        "'speaker_2': 'Spill. Thank you.'",
        "'speaker_10': 'Corliss Lee, of course.'",
        "'speaker_2': 'Thank you very much. Next, the next speaker.'",
        "'speaker_17': 'I see.'",
        "'speaker_3': 'Yeah. Okay. Thank you.'",
        "'speaker_17': 'Okay. Carelessly. And my address is on file. I am also a member of carp, continuing on monitoring sensors and shut off valves will have little use in a large earthquake. Your yes vote tonight is saying that you are willing to add the following 15 modifications to sea dip in order to allow oil drilling.'",
        "'speaker_17': 'Please consider carefully what you are voting for. Here are just a few. Modification five environmentally sensitive habitat areas as defined in the Coastal Act shall be protected against any significant disruption of habitat values and only users dependent on those resources shall be allowed with these areas.'",
        "'speaker_17': 'And the carp comment on that is, I repeat, that oil drilling will be disrupting the habitat areas. The pumpkin patch contains wetland, obligate plant and animal species, which will be permanently destroyed by both drilling and industrial uses. Modification seven.'",
        "'speaker_17': 'All development that would be adversely impact archeological or paleontology or logical resources shall include reasonable mitigation measures. And the question is what are these measures and reasonable to whom the local Native Americans do not find digging in, drilling on or degrading their sacred lands as reasonable?'",
        "'speaker_17': 'Modification eight The scenic and visual qualities of coastal areas shall be considered and protected. And here's the carp comment. Most people do not consider a 160 foot drilling rigs and 18 foot block walls as scenic or visual qualities.'",
        "'speaker_17': 'Modification nine All development shall minimize risks to life and property in areas of high geologic flood and fire hazard. And the carp comment is both. Both of these proposed drilling areas are near the Newport-Inglewood fault area in a tsunami and flood zone.'",
        "'speaker_17': 'The best way to minimize risks to life and property in these areas is to not allow oil drilling. Modification ten All development shall assure stability and structural integrity and neither create nor contribute significantly to erosion, geologic instability or destruction of the site or surrounding area.'",
        "'speaker_17': 'And the carp comment is it will be impossible to drill hundreds of feet down next to an earthquake fault, extract oil and then force water back into the void and guarantee geologic stability. So there's several more on here, and I don't think I can get through them in the next 15 seconds.'",
        "'speaker_17': 'But you might want to look intensely at this report and realize what you're signing up for. This isn't something to take lightly, and you don't want to commit to something you can't do. So thank.'",
        "'speaker_2': 'You. Thank you very much. Speaker.'",
        "'speaker_10': 'And Christensen protect the Long Beach Low Cerritos wetlands. It said in the agenda item that you've read all the enclosed materials, but I'm just going to highlight some of our statement from Protect the Long Beach Low Cerritos Wetlands.'",
        "'speaker_10': 'And it really has a lot to do with environmental racism. So we would hope that people could find a moment to listen. The city's stated intent is to amend Sea Sick to comply with a new oil drilling project that that you guys already approved over the objections of many tribal members.'",
        "'speaker_10': 'Given the fact that oil production facilities proposed for both the site, the new sites were completely altered the surface areas and allow for toxic chemicals to be used and stored on these sites. Given the fact that oil drilling operations would extend for miles under the low cerritos wetlands and include the instruct extraction in re injection of millions'",
        "'speaker_10': 'of gallons of water. Given the fact that the construction of massive storage tanks, pipelines, methane burn off towers will disrupt damage and destroy wildlife and habitat. Given the fact that the operation of these on any new or other new oil accessories will extend the life and massively increase the volume of fossil fuel extraction from the Sea City'",
        "'speaker_10': 'area, pollute air and water and involve spills, possibly on a scale that cannot be contained. Given the fact that fossil fuels contribute to global warming and sea rise, one must conclude that all of the above are to be sacrificed in order to promote new oil drilling operations in the coastal zone and in and adjacent to the low'",
        "'speaker_10': 'cerritos wetlands over and adjacent to the Newport-Inglewood fault in an area subject to liquefaction. And in an urban area because Caesar proposes housing 4000 new residents. Actually, it's apartments, I think, more or more along the edge of the low cerritos wetlands.'",
        "'speaker_10': 'Place is central to the identity and continued existence of tribal peoples. The history, the health, the future of tribal peoples is rooted in the connection to specific lands and waters. The connection is one of stewardship, not exploitation or extraction of resources.'",
        "'speaker_10': 'To remove is to disconnect the people from the land, to remove the evidence and erase the tribal history of the land, and to devalue the meaning it has to present and future generations. Directly to Coastal Commission staff member Kate Hucker Bridge Chief Anthony Ramos.'",
        "'speaker_10': 'You honored a couple of chiefs tonight. Here's another one. Chief Anthony Morales. Gabriel Nino. Tonga. San Gabriel. Band of Mission Indians voiced his tribe's opposition, his tribal council's opposition to the proposed amendments to the LCP, which is what you're voting for tonight.'",
        "'speaker_10': 'Chief Morales raised concerns that proposed oil and gas production activities would adversely impact sacred sites and anti ancestral mean. He called them genocide.'",
        "'speaker_2': 'Fine. Thank you for telling me that.'",
        "'speaker_8': 'Uh, good evening, Mayor Garcia and council members. My name is Michael Assad, on which the beautiful mineral sport bump. I'll keep it brief. I just wanted to say thank you to the city staff for their diligent work and coordinating with Coastal Commission staff to get this LCP approved at the Coastal Commission and under a year.'",
        "'speaker_8': 'That's truly remarkable. So we say thank you. I also wanted to say thank you to all the public support we got here at city council hearings at the Coastal Commission, especially by the CWA, the nation, the coast, Reno's Wetlands, Land Trust and the El Dorado Audubon Society.'",
        "'speaker_8': 'Um, so I wanted to thank all of them as well, and we urge you to support the staff recommendation and the Coastal Commission's actions on this. Thank you.'",
        "'speaker_2': 'Thank you very much. Is there any more public comment on this item? If not, please take a vote.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, and grant an Entertainment Permit with conditions on the application of ABP Food & Beverage, LLC, dba The Sails, 6285 East Pacific Coast Highway, for Entertainment With Dancing.  (District 3)": [
        "'speaker_2': 'Thank you. Now we'll go to a hearing. Number three.'",
        "'speaker_1': 'Report from a financial management recommendation to receive supporting documentation into the record, conclude the public hearing and grant an entertainment permit with conditions on the application of the sales located at 6 to 8 five East Pacific Coast Highway for Entertainment with Dancing District three.'",
        "'speaker_2': 'Thank you. There's an oath required.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'All witnesses. Please stand. Do you and each of you solemnly state that the testimony you may give in this cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_11': 'Mr. Vice Mayor, the staff report will be given by Brett, Jackie's our business services officer, and Emily Armstrong, our business from the Business License Division.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_1': 'Good evening, honorable mayor and members of the city council. Tonight you have before you an application for entertainment with dancing for ABP.'",
        "'speaker_5': 'Food and Beverage.'",
        "'speaker_4': 'LLC.'",
        "'speaker_1': 'Doing business as.'",
        "'speaker_5': 'The sales located at.'",
        "'speaker_1': '6285 East Pacific Coast Highway. Operating as a restaurant with alcohol in a council district three. For some background.'",
        "'speaker_17': 'This hotel.'",
        "'speaker_1': 'With a restaurant has been operating at this location with entertainment since.'",
        "'speaker_5': '1991.'",
        "'speaker_1': 'The ownership changed in June 2017, which required the new owners to submit this application. The new owners have since been operating under a temporary entertainment permit. All of the necessary departments have reviewed the application and have provided their recommended conditions as contained in the hearing packet.'",
        "'speaker_1': 'I, as well as the police department, stand ready to answer any questions Council may have. And that concludes staff's report.'",
        "'speaker_2': 'Thank you. Is there any public comment on this item?'",
        "'speaker_0': 'I think this is a very good view, clear consideration. This is a commendable project. The only concern I have is relative to the dancing and what type of dancing there will be. Will we be saddled with the type of.'",
        "'speaker_0': 'Sidestepping or tap dancing around the truth, such as we get almost every time Robert Garcia opens his mouth. You can see what can be done to stop that type of dancing. That's something you have to consider before you approve it.'",
        "'speaker_0': 'And I think you have excellent examples of how proficient he is if dancing around the truth and sidestepping the facts and truth. Give that some consideration when you issue this permit.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Thank you. General public comment on this item. Mrs. Price was not clear if he thinks.'",
        "'speaker_9': 'Ask urge my colleagues to support this item. This hotel is located right next to the Gaslamp, where it currently is dancing. There's no dancing, sidestepping the truth, but there are sidesteps when they do their country Sunday line dancing.'",
        "'speaker_9': 'But this is this is just straight up dancing. Mr. Good here.'",
        "'speaker_2': 'Councilman.'",
        "'speaker_14': 'I thank you. And I'm happy to support this. I'm not sure how this has progressed, but I can remember several years ago entertained going to the Golden Cells Sunday nights for reggae and having a great time. So I wouldn't want to deprive anybody of that experience here in Long Beach.'",
        "'speaker_14': 'So I'm happy to support.'",
        "'speaker_2': 'Thank you very much. Cinnamon public comment. Would you please cast your vote, please? Now. We're going to have a clip. Yes. Now we can go to public comment. But these individuals, you can eat our lineup. First of all, we have a just tiny ranga.'"
    ],
    "Recommendation to suspend Council rule contained in Long Beach Municipal Code 2.03.020 (B) to cancel the meeting of November 6, 2018.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Next item will move item 17 with a clock rate. Please read the item.'",
        "'speaker_1': 'Communication for Mayor Garcia. Recommendation to cancel the City Council Meeting of November six, 2018.'",
        "'speaker_2': 'I swear every second. Is there any public comment on that? You please cast your vote.'",
        "'speaker_0': 'Right? Yep. Very good.'",
        "'speaker_2': 'Here. Yes, sir.'",
        "'speaker_0': 'Thoroughly object. This meeting should not be canceled. Period. And when this city council. Can conduct. Their business in a manner in which the council agenda is not jerked around by the mayor like. Seinfeld's Kramer enters and leaves a room.'",
        "'speaker_0': 'Then then you can do that. But there's there's too much business. This council has to deal with. I think this will probably be the first night in probably six months. Before it got out before midnight. You should come next week and figure out.'",
        "'speaker_0': 'How and the remaining. Six months before he goes to prison. This Council will operate. Thank you.'",
        "'speaker_2': 'Thank you, Mr. GOODYEAR. Mr.. Also when you speak.'",
        "'speaker_14': 'I'm over the support item.'",
        "'speaker_2': 'Thank you. It's just. Oh, you took your name up in Supernova?'",
        "'speaker_8': 'Yes. I was just going to mention that the next meeting, not this one, but the next one that we're missing in October. It's not that we're not going to be working. We're going to have a meeting for community hospital at the Rec Park clubhouse.'",
        "'speaker_8': 'So please be there at 7 p.m. if you'd like to express your vision for the community hospital the future.'",
        "'speaker_14': 'I would also add, if you really want to be at City Hall on Tuesday, November six, you can come down here and hang out.'",
        "'speaker_2': 'Thank you, Councilman Richardson. Fine. Thank you. Please cast your vote.'"
    ],
    "Recommendation to request City Manager and City Attorney to review the drafted Neighborhood Transformation Partnership Agreement and report back within 45 days on the feasibility of participating in the program.": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Please note item 18 1:00, please.'",
        "'speaker_1': 'Regarding communication from Councilmember Durango. Councilwoman Gonzales Recommendation to request city manager and city attorney to review the drafted Neighborhood Transformation Partnership Agreement and report back within 45 days on the feasibility of participating in the program.'",
        "'speaker_13': 'Is there a is there a second point? No. Okay. First of all, I want to thank my colleague, Lila Gonzales for staying out of the salon with me and for her leadership in bridging the digital gap, the digital divide here in Long Beach.'",
        "'speaker_13': 'I'm pleased to bring the title forward tonight. As the city of Long Beach prides itself on leadership for our residents, including the Long Beach College Promise Everyone Home Initiative, the Clean Air Action Plan, and our city's ongoing ability to lead in technical innovation and much more.'",
        "'speaker_13': 'There is still, however, room for improvement as certain sectors within our community continue to remain affected by the digital and social economic divide, most notably our residents in West Long Beach who lack access to basic internet and technology on a greater scale than the rest of the city.'",
        "'speaker_13': 'We have taken a large step in not only acknowledging these divides within our city, but passing on a number of initiatives which we hope will help bridge these divides. As a result, we believe now is the time to continue to invest in our neighborhoods through a Neighborhood Transformation Partnership Agreement in conjunction with the California Emergent Technology Fund'",
        "'speaker_13': ', a nonprofit group that has partnered with the YMCA of Greater Long Beach to work collaboratively, collaboratively, collaboratively to define the greater impact to our community as it relates to digital inclusion. I have issues with multi syllabic words. Tonight, the city of Long Beach must continue to lead in the fight to promote and produce equitable opportunities for our'",
        "'speaker_13': 'youth, especially those who reside in our most economically disadvantaged communities. This partnership would act as a pilot program centered around the Stephens Middle School community, allowing for a multiagency, collaborative effort to provide services to the local families, which will ensure that we provide the technology to communities such as West Palm Beach.'",
        "'speaker_13': 'Do have the best opportunity to attain academic, social and economic success. Therefore, I ask my colleagues to support this item and to allow the city manager and city attorney to analyze the Neighborhood Transformation Partnership Agreement and report back to us within 45 days on the feasibility of participating in this partnership.'",
        "'speaker_13': 'An agreement I ask for you as well.'",
        "'speaker_2': 'Thank you, Councilwoman. Mrs. Linda Gonzalez.'",
        "'speaker_9': 'Thank you so much, Councilmember Ranga, for bringing this forward, and I thank you very much for being a part of this initiative. We are in the midst of our discussions about digital inclusion and have yet to include even more partnerships.'",
        "'speaker_9': 'And I think this only creates an even more robust discussion. So just a few points of clarity on what the findings were from the Tech and Innovation Commission. They conducted a survey this past summer with Long Beach residents, and it was said that 51% of respondents could only afford a maximum of $20 for Wi-Fi service each month'",
        "'speaker_9': ', and another 26% couldn't afford paying for Wi-Fi at all. Unfortunately, a lot of times we we need the YMCA as the libraries, the nonprofits that are doing the work every day to not only provide Wi-Fi, to provide technological services.'",
        "'speaker_9': 'And so we thank you again. And I think Councilmember Wodonga especially pointing out the West Side neighborhood as we know that that's a desert for technology. We thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Margo.'",
        "'speaker_4': 'I want to thank you guys for bringing this forward. I think it's important to look at the digital divide, but also recognize that a big component of that is seniors. And the more and more we are out in the community and talking with our senior community, it's really, really important that we also include them in the program'",
        "'speaker_4': '. So thank you for bringing this forward and I hope we don't forget them.'",
        "'speaker_2': 'Thank you. Councilman Pearce.'",
        "'speaker_5': 'I yes, I also wanted to thank my council colleagues for bringing this forward, but also the nonprofits and all the organizations that really assist in trying to bridge that divide. And I know that at the city level, we are doing what we can and we're also advocating at the state level.'",
        "'speaker_5': 'But it really does take a village. And so I just wanted to thank you all for being here and great job on doing community outreach on this item. Thank you.'",
        "'speaker_2': 'By the way, I'd public comment on this. By Stafford, please.'",
        "'speaker_8': 'Good evening, council members. I just want to embarrass myself. My name is Jonathan Gray. Grew up in the seventh District. I was born and raised in Long Beach. I want to talk about the struggles of my life growing up and why I think the neighborhood transformation is going to make a big difference to the teens and the'",
        "'speaker_8': 'families around the Stephens Middle School neighborhood. My dad was on disability and he became on disability when I was in the third grade. During that time, my mother was unemployed and it was a very hard time for my family.'",
        "'speaker_8': 'We were on welfare. I remember going to the check cashing places and getting the food stamps, then going to buy groceries or ripping them out of the book with the cashiers. I thought that's what all kids did. I went to Longfellow, I went to Hughes.'",
        "'speaker_8': 'I went to the prep academy. I went to Long Beach Poly, and I went to us through that. I had to get loaner uniforms because my family couldn't afford it. I was on free lunches. I couldn't fit in with my peers and my education.'",
        "'speaker_8': 'And my attendance dropped. Soon after. However, I'm glad to say that I graduated from Lombard City College with my associates, and I graduated from Cal State Long Beach with my bachelor's in political science. And now I work for the YMCA development branch to help teens there in similar situations.'",
        "'speaker_8': 'I support the Neighborhood Transformation Agreement because I believe that creating this integrated service team between the state, county, city and school levels can really help a student. That was like in my shoes who is struggling, especially in the areas of West Long Beach.'",
        "'speaker_8': 'I can relate to the five outcomes of the Neighborhood Transformation Agreement. Education. I clearly struggled. And clearly the school district wasn't there to support me as well as they could have. Employment. I had a hard time finding a job, writing resumes and applying for them.'",
        "'speaker_8': 'I was a victim of a crime in my own neighborhood and I had the scars to show for it. I know what it is like to grow up low income and to grow up in poverty here in Long Beach.'",
        "'speaker_8': 'And let me tell you, it was a struggle. And the last member sorry, the last issue that the last five outcomes of health I've been to the Long Beach Comprehensive Health Clinic multiple times and I can relate to being on medical and the supports that it can provide in the help that it can provide.'",
        "'speaker_8': 'I think by creating a plan, having a family navigator with the neighborhood transformation would really make a difference and will help create the next generation of leaders of Long Beach. There are many fabulous families here in Long Beach who share a similar story of mine, their struggle struggling to navigate, navigate the in the systems in order to'",
        "'speaker_8': 'get the help they need. The Neighborhood Transformation Initiative will help those families get a pathway out of poverty. So please join Assemblymember Patrick O'Donnell. The Long Beach Unified School District, the California Emerging Technology Fund, the YMCA grid in Long Beach, and myself in supporting the Neighborhood Transformation Agreement.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_2': 'Thank you very much. Next speaker.'",
        "'speaker_8': 'Good evening and thank you for the opportunity. My name is Augustin Jealous. I am here on behalf of the California Emerging Technology Fund, where statewide foundations are established by the California Public Utilities Commission with a mission to close the digital divide.'",
        "'speaker_8': 'This means that we are ensuring that all households have access to a high speed Internet service in order to fully participate in the digital economy. Unfortunately, we know that the most economically disadvantaged members of our communities are the ones that are on the wrong side of the divide.'",
        "'speaker_8': 'Bless you. I also want to say that we have admired the leadership role that the city of Lombard Lombard has taken in this area of digital inclusion. We're very proud of our partnership with with the Lombard YMCA. For nearly a decade, we have invested nearly $1,000,000 because we believe in the leadership of the of the Y and'",
        "'speaker_8': 'and their approach of integrating digital literacy, digital inclusion into their work of youth development and leadership development. I am in charge of a program called School to Home that supports underserved middle schools with the integration of technology, making sure that they are successful at supporting their teachers so that they can use the technology effectively training parents so'",
        "'speaker_8': 'that they can communicate with schools. And by doing that, we make sure that they can transformed a learning environment into something that's more engaging. Parents have access to student information so they can track progress, and that really helps us address a lot of the academic needs.'",
        "'speaker_8': 'However, we know that a lot of the really underserved intelligence communities, the academics is just part of the problem. A lot of the kids, as you've just heard, have a lot of the families actually have a lot of other challenges, whether it's not knowing where their next meal is coming from, where they're going to sleep at night'",
        "'speaker_8': '. Substance abuse issues. So that's the other piece where, you know, the the support that is going to be brought together, brought to the table through this neighborhood transformation initiative. And what it is really is looking at the resources and services that are already there through the county, the city, the school district, and putting together a comprehensive, coordinated'",
        "'speaker_8': 'plan that has a navigator that helps family families navigate through the different services so we can have a more accountable system. So we're saying that families are able to get themselves service and address their various issues. So we're happy to be the organization that's convening this, using our resources to bring everyone to the table.'",
        "'speaker_8': 'And we're very pleased about the response that we've gotten from all the stakeholders at the government level and also organizations like the YMCA. So thank you very much. And we're excited.'",
        "'speaker_2': 'Thank you. Thank you. Next speaker.'",
        "'speaker_8': 'Good evening. City Council Members Mayor Robert Garcia, Vice Mayor.'",
        "'speaker_0': 'De Andrews. My name is Bob Cabezas. I'm the vice president of YMCA of Greater Long Beach. And I need to start out.'",
        "'speaker_8': 'By commending you and thanking you and showing my tremendous respect to you for the work that you do for our city every day. And I think.'",
        "'speaker_0': 'Not enough of that has been said tonight.'",
        "'speaker_8': 'So I wanted to thank you. Secondly, I wanted to really advocate for the Neighborhood.'",
        "'speaker_0': 'Transformation Initiative from the standpoint of. Of a citizen in Long Beach. I've lived in the city for 26 years, between third and fourth on Temple Avenue.'",
        "'speaker_8': 'And Jenny.'",
        "'speaker_0': 'You're my you're my representative.'",
        "'speaker_8': 'I have known you throughout the city as just big advocates.'",
        "'speaker_0': 'For our city.'",
        "'speaker_8': 'But also be an advocate for our city's underserved. Our youth, our families, our seniors are homeless. And I believe that the Neighborhood Transformation Initiative really would raise up.'",
        "'speaker_0': 'Services for those families and more importantly, coordinate those services so our families.'",
        "'speaker_8': 'Really have a chance to.'",
        "'speaker_0': 'Get access and equity in our city. And I really want to commend you.'",
        "'speaker_8': 'Because I believe what Lena Gonzalez is doing with the Digital Divide.'",
        "'speaker_0': 'Initiative and all of you signing on to that.'",
        "'speaker_8': 'Really talks to the progressive answers to some of these difficult questions we have.'",
        "'speaker_0': 'In our city and some of the issues. I really want to commend Roberto or.'",
        "'speaker_8': 'His office for just collaborating with us in.'",
        "'speaker_12': 'Making sure that this works and that and that.'",
        "'speaker_8': 'We can move.'",
        "'speaker_0': 'Forward.'",
        "'speaker_8': 'I want to commend Linda Chico and.'",
        "'speaker_0': 'County Supervisor.'",
        "'speaker_8': 'Janice Hahn's office for helping.'",
        "'speaker_0': 'Us move this forward, as well as Christina, which was obviously with the school district and Megan Care.'",
        "'speaker_8': 'On the Columbia Unified School Board. But I also want to thank Rex Richardson for his dire commitment, just tireless commitment to under-served children and youth of this city and his leadership on my My Brother's Keeper initiative and working to bring that to Long Beach.'",
        "'speaker_8': 'You know, you folks are doing phenomenal work and you make me proud to be a citizen of this city. So I just wanted to commend you and also speak to this initiative.'",
        "'speaker_0': 'Thank you so much.'"
    ],
    "Recommendation to receive and file the Citywide Strategic Plan on Early Childhood Education from the Health and Human Services Department.  (Citywide)": [
        "'speaker_2': 'Thank you very much. Any more comments on this item? If not, please cast your vote. Now we'll go back to 21.'",
        "'speaker_1': 'Report from Health and Human Services recommendation to receive and file the city wide strategic plan on early childhood education from the Health and Human Services Department citywide.'",
        "'speaker_2': 'To purchase secondary schools.'",
        "'speaker_12': 'Yes, Mr. Vice Mayor, council members, we have a.'",
        "'speaker_8': 'Report from our Health and Human Services.'",
        "'speaker_12': 'Department, led by Kelly Collopy and her teammates.'",
        "'speaker_3': 'Good evening, Honorable Vice Mayor and city council members.'",
        "'speaker_17': 'Two years ago in the budget process, you are funded a.'",
        "'speaker_9': 'Half time early childhood.'",
        "'speaker_3': 'Education liaison for the Long Beach Health Department.'",
        "'speaker_17': 'This report stems from the work that they've been doing.'",
        "'speaker_10': 'It's been a strong partnership between the health department.'",
        "'speaker_3': 'Our early childhood education committee, and also our our school district.'",
        "'speaker_4': 'So with that, I'd like.'",
        "'speaker_3': 'To introduce you to Alejandro, Brian Rosette, who's our early childhood liaison.'",
        "'speaker_10': 'Coordinator, and she will.'",
        "'speaker_3': 'Give you an update on our strategic plan.'",
        "'speaker_4': 'Good evening on the role of vice mayor and city council members. My name is Dr. Alejandro Alvarado Moses, the city's early childhood education coordinator. I'm here to present the cities or the cities of long beaches, early childhood education strategic plan.'",
        "'speaker_4': 'This project was funded through a Pacific Gateway U.S. Department of Labor grant in alliance closely with the city's Long Beach Violence Prevention Plan and My Brother's Keeper plan, as well as Pacific Gateway, strengthening working families efforts. This plan outlines actionable strategies to support all young children in Long Beach.'",
        "'speaker_4': 'The Early Childhood Education Strategic Plan, identify programs, policies and systems recommendations that support children ages 0 to 5 to ensure they are ready to learn in kindergarten. Research shows that during the first few years of life, 700 new neural connections are formed every second.'",
        "'speaker_4': 'Laying the foundation for all future learning behavior and development experiences in early, in the early years starting at birth are critical in developing and predicting lifelong success. Children who have strong relationships with their caregivers, spaces that encourage lots of language development and who live in safe, healthy homes are more likely to have lifelong success.'",
        "'speaker_4': 'We also know that children who enter kindergarten behind their peers are less likely to be reading by third grade and less likely to graduate from high school. Thus, this focus on young children. The Department of Health and Human Services led the development of this plan with special insight from an ad hoc advisory group that included the Long'",
        "'speaker_4': 'Beach Early Childhood Education Committee and the Long Beach Unified School District. Developing this plan was truly a cross-sector collaboration to understand the strengths and gaps that exist in Long Beach for families raising young children. The Department of Health Staff held over 22 focus groups with parents, community partners, early childhood professionals, and even a group of young children'",
        "'speaker_4': '. 19 key informant interviews were held with elected officials, including some of you here today. Parents and other professionals. A thing we heard from the conversations across Long Beach was that many social and economic factors are important for preparing young children for kindergarten.'",
        "'speaker_4': 'These include a lack of early childhood resources, overall difficulty in access and accessing resources that exist because of transportation, hours of operation, and the high cost of early childhood education programing. A need for parent training, building social connectedness for parents of young children, ensuring community safety and a need to focus on the whole child, not just education'",
        "'speaker_4': '. A desire and a desire to ensure that children of all abilities and backgrounds are included in early childhood education programing. Parents and professionals also noted the need for affordable housing, a need for mental health, support for parents and children, and a need for everyone to understand the impact of early childhood on lifelong success.'",
        "'speaker_4': 'This plan is organized around a set of guiding principles that focus on strengths. Seek to remove barriers and ensure that all children in Long Beach and their families receive the respect and opportunities they need to succeed. The plan considers the whole child, which means that children's health, safety, social, physical, emotional and intellectual needs are addressed.'",
        "'speaker_4': 'The seven goal areas that were identified by professionals and parents are goal one to support and build strong and resilient families. Goal two to increase access and affordability of infant through pre-K care and education services. Goal three Increase access and affordability of infant through pre-K.'",
        "'speaker_4': 'Care and education services. Oh, sorry. Goal three to support the development of a stronger workforce for children. Goal four to improve quality of programs and services for birth through age eight. Goal five. To ensure that children of Long Beach live, learn and play and safe and healthy and accessible environments.'",
        "'speaker_4': 'Goal six To promote partnerships to address access to quality, basic needs and services. And Goal seven to strengthen the alignment of existing birth through age governance structures and early childhood support systems. Within these goals, there are over 100 activities that were developed based on the information gathered through the focus groups and interviews.'",
        "'speaker_4': 'We know that we cannot do this alone. The stakes are too high for our young children and our communities. Future. It will take all of us. The Department of Health and Human Services in partnerships with the Mayor's Fund for Education invite you and members of the community to enjoy to join us this Thursday at the Long Beach'",
        "'speaker_4': 'Day Nursery for a presentation of the plan and commit to being a part of the solution. We know that we all have a role in ensuring that all the children in Long Beach reach their full potential for success.'",
        "'speaker_4': 'Both the full plan and the executive summary can be found at WW w dot Long Beach dot gov forward slash ECP. Thank you for your time. That concludes my report and we are open for questions.'",
        "'speaker_2': 'Thank you, Councilman Franco.'",
        "'speaker_13': 'Thank you, SBA. I strongly support this program, obviously. The research is is is indisputable. Early childhood education really raises good kids. And it's an opportunity for us here in Long Beach to really get involved and engage in that aspects of our of our youth.'",
        "'speaker_13': 'We build strong communities. We build the strength of our kids. So I can certainly support this. And I look forward to the full. Length of the program in the strategic plan so that we could move this forward. On a side note.'",
        "'speaker_13': 'When I first started with the city back in a few years ago, we used to have early child development programs here in Long Beach through our parks and recreation programs. And unfortunately, over the years, through budget cuts and hard economic times, we had to restructure our our program, our parks programs and early childhood development went away.'",
        "'speaker_13': 'And I'm glad to see that we're making a comeback. And I'm looking forward to seeing it gained strength and continue to be an important, integral part of city services. So thank you very much for bringing this forward.'",
        "'speaker_2': 'Thank you. Congressman Ewing. That Councilman Richardson.'",
        "'speaker_15': 'Thank you, Vice Mayor. So Dr. Moses and entire health team. Kelly and the team, I think, you know, you've done a good job. You've done a great job once again. I think, you know, the traditional sense of what city should do has changed.'",
        "'speaker_15': 'There's a greater focus on the role of cities to lead on these broader social issues. You know, frankly, you know, there's there hasn't been really been leadership at higher levels of government or bureaucracy really slows it down. And so the real focus and the burdens been placed on cities to really move the needle.'",
        "'speaker_15': 'I think we've you know, we've talked about this through the work on things like My Brother's Keeper, acknowledging that, you know, there are important milestones to having a successful life, you know, from a health standpoint, an education standpoint, an economic standpoint.'",
        "'speaker_15': 'And some of those milestones are literally directly linked to early childhood education. Reading by third grade, the key switch from learning to read to reading to learn. So the the, the better and more strategic we are about being intentional about these focuses, then it will have long term downstream impacts on all of our services.'",
        "'speaker_15': 'We know that. And so I really love that we have this strategic plan. I look forward to, you know, better understanding how me as a policymaker, how I can help to support the systems change involved with this. And I look forward to ensuring that we keep that lens on early childhood education with all the rest of our'",
        "'speaker_15': 'decisions in terms of sort of our parks, recreation, our health departments, our libraries, how we can really work together toward that goal. So I spoke a little more than I initially thought I would. But, you know, I read to my kids when I get in early enough and it's something that doesn't come naturally to me.'",
        "'speaker_15': 'It's something that I have to work toward. And we have a team and we're trying to build an environment, a culture to support that. Right. And I think that the more we can model this as a city, the better habits and behavior we can do.'",
        "'speaker_15': 'And I tell you, there's just so many opportunities from the fatherhood initiative that you're doing to, you know, all the work in our libraries and My Brother's Keeper. I just think this is really incredible and strategic. So thank you for your work.'",
        "'speaker_2': 'Thank you. Spears.'",
        "'speaker_5': 'Thank you. I want to echo my council colleagues sentiments. I you know, your presentation was great, but it still doesn't give the weight to the work that the vision and the plan. I just think that continuing to talk about this weekly, continuing to talk about how we're implementing this as much as we can and really having this'",
        "'speaker_5': 'lens on everything that we do when we talk about investing in our children, when we talk about public safety and how important it is to cities, when we talk about economic development and how important it is to cities, it doesn't matter what we do on the back end if we're not investing in early childhood development.'",
        "'speaker_5': 'And so I really just I want to echo the comment, particularly around the role of cities. And I know that some of us might have a different understanding of the role of cities. My work at Lane, a nonprofit for a decade, it really was under the the understanding that cities is where change happens.'",
        "'speaker_5': 'Cities is where we can get our hands in there and really make change, that people can feel that impact. And then when we start leading in cities, that that change goes up. And so looking through this, a couple of things that I just wanted to to highlight for folks.'",
        "'speaker_5': 'You know, 9813 is one of the zip codes in my district. And it says that a few miles away from 90803 in zip code 90813, the percentage of children under 18 living in poverty increases to 46.1%. We talk about equity a lot.'",
        "'speaker_5': 'And I know sometimes it's a it's a word that can trigger us to feel divisive on the council. That number right there, 46.1% of children are living in poverty. One zip code over that is what we talk about when we talk about equity.'",
        "'speaker_5': 'That is what we talk about. We talk about investing in our children and how how do we have an impact on public safety? How do we make sure our city is thriving and in changing and recognizing that that's a problem is the very first step.'",
        "'speaker_5': 'And so I just I think this is a wonderful lens to be able to look at how we govern. I know that some of us on the council have talked about initiatives for children, and I want to recognize the families that are here tonight with their children, because we know that it's now 830, so I'm not going'",
        "'speaker_5': 'to talk extremely much longer, but that this is a time when you should be at home reading to your kids. Right, or your kids are going to bed. So I want to thank you guys and know that at the city level, we are looking at opportunities for us to have child care on key nights and we have'",
        "'speaker_5': 'issues where we might have families. And so that is coming soon and I'll be there on Thursday. And I want to just echo again any opportunity with any item that we have come forward where we can talk about investing in youth and in families.'",
        "'speaker_5': 'I expect that this council will fully support and I look forward to partnering. Thank you guys very much.'",
        "'speaker_2': 'Thank you. Councilman Gonzalez.'",
        "'speaker_9': 'I just want to say thank you as well to Kelly, Alejandro and your team for doing this really great work. I know I had been interviewed for this. And, you know, similar to what Councilmember Pearce said, you know, we don't like to highlight the negative attributes of the city and the things that we like to work on'",
        "'speaker_9': '. But they're the reality oftentimes and I happen to represent and I know when three and that has been a really big not only challenge for our city but it's also been a very big priority for me to ensure that all the students in 98 went through all the kids and families really have opportunities and this provides goals'",
        "'speaker_9': 'and a real good baseline because we can talk about park equity and digital inclusion without really starting with a baseline for for the work. And I think that this report absolutely does that. So thank you very much for that work.'",
        "'speaker_9': 'And you know, in that regard, I spoke a lot about greenspace and access for kids. So in addition to early education and the goals we have here, it's like, what are they doing after school? What are they doing during the weekends?'",
        "'speaker_9': 'How can we really supplement a lot of the work we're doing in the early education realm with other policies that really help that? And I just had the pleasure of congratulating UN Mundo, the Amigos, the right in central Long Beach on 14th and Long Beach Boulevard.'",
        "'speaker_9': 'They just celebrated ten years. They offer free daycare and a very high quality daycare and I'm really proud to have that in my district. So thanks again for your work.'",
        "'speaker_2': 'Thank you very much. Councilwoman Gonzalez, any public comments on this item? Please state your name.'",
        "'speaker_8': 'Hello. My name is Andrew. Hello, Mayor. In the City Council. My name or face me or say my name is Enjoyment of HANO, a community organizer with Long Beach Forward supporting the best art central Long Beach Initiative, which is comprised of residents, families and service organizations with a focus on children ages zero through five.'",
        "'speaker_8': 'We have supported collaborative spaces such as the Home Visitation Collaborative and also the Long Beach Child Abuse and Neglect Network. Several of our leadership team members are here today, along with our partnership members. Some of them had to go home and everything, and some of you may actually know some of them.'",
        "'speaker_8': 'But these are some of the most dedicated parents I have ever came across. And I think that is shown by their commitment of staying here for over 3 hours with their children who are so tired and ready to go home and sleep.'",
        "'speaker_8': 'Some of them actually just left. I'm sorry. We work to ensure central Long Beach is a community where babies, children and their families are healthy and safe with the passion for life and learning. We are here to show support for the city wide early childhood education strategic plan.'",
        "'speaker_8': 'Several of these goals, such as increasing access and affordability of early care and education services and improve the quality of birth through age eight. Programs and services are exactly what central Long Beach needs for our community to thrive.'",
        "'speaker_8': 'We look forward to working with you in the future to see these goals through. Special shout out and thank you to Kristina Boatright, who is also on our leadership team, and Alejandro Moses and the countless of others who've worked on this plan.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Thank you. Next speaker.'",
        "'speaker_5': 'Good evening, Honorable Vice Mayor and members of the City Council. My name is Whitney Leathers, executive director for the Long Beach Day Nursery and chair for the Long Beach Early Childhood Education Committee. I'm so excited to be here tonight.'",
        "'speaker_5': 'More excited than you can probably tell. This plan has been long in the making and it's been a true partnership. I'm here to thank you for your support of the Early Childhood Strategic Plan and for the support of staff support from the Health Department to make this come to fruition.'",
        "'speaker_5': 'This plan didn't come alone as a solo effort. It came with an inclusive community, partners and process. In the creation of this plan, as you saw above with is the focus groups and what have you. We came together as a diverse group of stakeholders, and the outcome is an inclusive plan greater than we could have anticipated.'",
        "'speaker_5': 'As you've heard, research supports early education is key to college and career success. This plan, I'm so proud to say, not only addresses the needs of our children, but also the necessary resources and supports for our workforce and families in order for them to be successful.'",
        "'speaker_5': 'It's a real four feet to create this plan as a community, and the momentum around it is palpable. Now the real excitement lies within what's next implementation and expanding programs and services to young children and families. We look forward to continuing our work with the Health Department on the shared programs and events that we host, such as'",
        "'speaker_5': 'the Week of the Young Child, the Early Childhood Symposium and the Early Learning Festivals. We also look forward to adding to these supports, as you'll see in this strategic plan. The success of this plan will take a collaboration of partners many city departments, the ECB committee and the Long Beach Unified School District.'",
        "'speaker_5': 'We look forward to building these partnerships with the charge before us and meeting the goals in the plan. Before I say thank you, I want to acknowledge all of you for seeing the importance in early childhood education. LLENA Councilmember John Gonzalez In our district, I have a site and I know 813 and we're working on expansion so'",
        "'speaker_5': 'that we can support children and families more. We also have a site that will be hosting on Thursday and I'm excited to see many of you there and I can't wait to continue the work with our partners. So thank you so much for your ongoing support for early childhood education.'",
        "'speaker_5': 'I look forward to continued engagement as we move forward with the implementation over the next five years.'",
        "'speaker_2': 'Thank you. Thank you very much. And you know, I myself truly support this this item because the fact that my chief of staff every Saturday, she's with her little child at every one of our cleanups. So I'm just letting you know.'"
    ],
    "Recommendation to request City Attorney to amend Long Beach Municipal Code 10.38.020 (B) to expressly ban electric or motorized scooters, electric motorized boards (CVC 313.5), and throttle driven Class II and Class III electric bicycles (CVC 312.5), from the beach bicycle path while allowing for continued non-motorized use and lower speed pedal assisted Class I electric bicycles.": [
        "'speaker_2': 'Mrs. Mongo, get ready. Yes. Thank you very much. Would you like to take the vote, please? Now we're going to move on to item 19.'",
        "'speaker_1': 'Motion carries. Item 19 Communication from Councilwoman Price Councilmember Pearce, Councilwoman Mongo Councilmember Your UNGA recommendation to request city attorney to amend the Long Beach Municipal Code to expressly ban electric and motorized scooters, boards and bicycles from the beach bicycle path while allowing for continued non-motorized use and lower speed pedal assisted electric bicycles.'",
        "'speaker_2': 'Thank you. Councilman Price.'",
        "'speaker_9': 'Thank you. So I want to hear my colleagues thoughts on this item before I make a motion, but I want to share with you the background of where this came from and put it into context a little bit.'",
        "'speaker_9': 'So I know that our public works director is here and our city manager, of course, is here. And over the last many years that we've that I've been involved, mobility has been a major issue and something that we have become a regional leader on.'",
        "'speaker_9': 'And I'm proud of that. I am a little bit concerned, however, that our efforts to add mobility elements throughout the city are being done in a manner that maybe isn't providing for as much input and feedback and warning as, frankly, some of the residents in our community may want.'",
        "'speaker_9': 'And the Scooter Pilot program is one such example. It's possible that I may have missed something along the way, but the pilot program and perhaps this is a good question for the city manager, the pilot program was kind of put on to us.'",
        "'speaker_9': 'It wasn't something that we voted on as a council. Is that correct?'",
        "'speaker_12': 'Yes, we to prevent basically the business disruption program where we have 2000 scooters dumped on us. Like many other cities across America. We implemented a pilot program to invite people to come in for a three month period.'",
        "'speaker_13': 'Yes.'",
        "'speaker_9': 'Okay. And and and I get the reasons why we did it. I just I kind of want to just factually. Establish that the council did not vote on that. It was it was correct. It was offered to us.'",
        "'speaker_9': 'And as such, there was no input that was gathered in terms of the parameters of such program, at least input from residents with that. That my understanding I.'",
        "'speaker_12': 'Wouldn't say that I think there was you know, we have our traffic engineers who work with the community and stuff and perhaps maybe not specific residents or.'",
        "'speaker_8': 'Community groups.'",
        "'speaker_12': 'But we listen to what we're hearing from residents through our mobility program and also look at what's happening in cities across America.'",
        "'speaker_9': 'Okay. Well, I wasn't aware of any listening tours or any discussions in the third district. And the reason I, I raised that is because we. And Michelle Mallory knows this probably all too well. We have received complaint after complaint from our residents regarding the scooters.'",
        "'speaker_9': 'And the biggest issue has been the discarding of the the scooters in locations that do not that are not one of the areas where scooters are supposed to be dropped off. And some of the operators, I think, maybe more responsive than others, because there are some vendors that are actually putting them away more regularly.'",
        "'speaker_9': 'Others are not. I'm not sure what's going on there, but there's been a lot of frustration in the community with the existence of the scooters and the lack of input in terms of traditional community input, where we have meetings and we allow people to come forth and be educated on a topic.'",
        "'speaker_9': 'So this item really has come about as an attempt by me and my colleagues to try to mitigate some of the impacts that are being felt by the residents now that the scooter program is on us have upon us.'",
        "'speaker_9': 'Having said that, I'm open to talking to my colleagues about what a potential ban could look like, even if not immediate. And let me explain that, first of all. We've heard a lot of feedback from residents regarding the motorized bicycles.'",
        "'speaker_9': 'And although we attempted to exclude those from the language that we had presented in the item. Class one and Class two bicycles are apparently utilized a lot in the city of Long Beach, and they're utilized by a lot of our residents of all ages.'",
        "'speaker_9': 'And some of our aging population has indicated that they really find them useful in terms of having mobility on the beach, which which I respect, and I certainly don't want to interfere with that. So I would if we were to move forward with this, I'd want to make sure that Class one and Class two, e-bikes or motorized'",
        "'speaker_9': 'bikes are permitted on the path. But what I want to ask before we move there is do we allow scooters to be on the beach path under the current pilot?'",
        "'speaker_12': 'Right now, electric scooters are prohibited in our missile code. We've been talking to the city attorney about altering that. We believe potentially that when this municipal code was enacted, there probably e-scooters didn't exist. They were talking about vespers, perhaps those types of those types of scooters.'",
        "'speaker_12': 'So this is a brand new product that wasn't envisioned. So we were, you know, on the path of potentially talking to the city council about.'",
        "'speaker_8': 'About this just specifically when this popped up.'",
        "'speaker_12': 'But right now, the electric scooters are banned on the path.'",
        "'speaker_9': 'And my understanding is that the pilot, the handbook for the pilot program, actually prohibits them from being on the path.'",
        "'speaker_12': 'Yes.'",
        "'speaker_9': 'Okay. So if that's the case, then why do we have the beach path as one of the heaviest use areas in the city for scooters?'",
        "'speaker_12': 'I think it's just a very attractive place and for the use of the scooters. And right now and I don't think that we have the resources right now to police it.'",
        "'speaker_9': 'Okay. And I get that. However, there is technology available that would limit those scooters from getting onto the beach path. And my understanding is that a lot of the major companies have that technology available. And so is there some is there someone on the staff that might be able to answer any questions about that?'",
        "'speaker_12': 'Mr. Beck.'",
        "'speaker_0': 'Vice Mayor, Members Council Councilmember Price. I think as discussed in your opening, the city is moving forward or is engaged in right now a pilot program with the E-SCOOTERS. It was done in a way to try to create some structure around what other serious other cities have experienced as really a haphazard deployment of scooters where it's significantly'",
        "'speaker_0': 'affected areas within the right of way. As a manager talked about, we wanted to avoid that in Long Beach. We did not want companies to come in and drop simply drop 2000 scooters on our streets overnight and have our staff have to run around and try to chase and collect those scooters.'",
        "'speaker_0': 'So we worked with various vendors. There are six companies that have been authorized to deploy under this pilot program. The current pilot program is scheduled to run through the end of October. At that time, the plan is to come to city council to talk about information that we've gained through this pilot program.'",
        "'speaker_0': 'One example would be, and I think I've shared this with council through our bike share program is a heat map. Staff is very interested to understand where people are picking scooters up, where they are driving to or scooting to, I guess how far they are going, what the frequency of use is, because we think that that's really'",
        "'speaker_0': 'going to drive some policy decisions at this council we'll have to deliberate on and decide upon. We anticipate getting all of that data from the scooter companies. That was part of their permit to be able to operate in our city.'",
        "'speaker_0': 'They owe us that data by the end of October. We have put them all on notice that they need to provide that to us and will be coming forward with not only that data to the Council, but also staff's recommendation, what we believe a a permanent scooter program would look like.'",
        "'speaker_0': 'And so things like geofencing, miles per hour limits, helmet use, areas where riding would be allowed for examples in the in the bike lanes areas were riding would be restricted would all be part of staff's recommendation that we would plan to bring forward with that report.'",
        "'speaker_9': 'Okay. And I appreciate that. The question I had was, are there companies that have the technology, the geofencing technology that could implement it tomorrow? If we were to direct them to do so, to keep the scooters off the beach path.'",
        "'speaker_0': 'I don't have that answer for you. I anticipate the answer is yes, that there are companies that can do geofencing. How long it would take them to implement that? I don't have the answer for what ability we would have to regulate that with them.'",
        "'speaker_0': 'I don't have the answer for that either.'",
        "'speaker_9': 'Okay. So when you say this pilot ends at the end of October, will the pilot then end, meaning the.'",
        "'speaker_10': 'Scooters will be removed.'",
        "'speaker_9': 'From the streets until council votes on whether or not we want a permanent program?'",
        "'speaker_0': 'We're discussing that as an option. We're also discussing the option where we would allow it to continue until council makes a decision on what a permanent program would look like.'",
        "'speaker_9': 'Do we have any money for enforcement of any of the regulations that we've placed on the pilot or would in the future?'",
        "'speaker_0': 'This pilot program has collected minimal amounts. I think the permitting is about $2,000. So if we have six companies, we've collected roughly $12,000 today.'",
        "'speaker_9': 'Is there any. And so my team has reached out to a lot of other cities that have dealt with this. As I'm sure you're aware of, Santa monica just just banned these from the beach path. What happens is when they get left on the beach path, it's a hazard for anyone who's biking.'",
        "'speaker_9': 'If they're in the bike lane or if it's left on the walking path, it's a hazard for those running and walking on the path and they get left there and people don't pick them up. I'm not sure what the since they're not supposed to be on the beach to begin with.'",
        "'speaker_9': 'I'm not sure what regular patrols these companies are doing to get them off the beach, but it's not happening, at least not with all providers consistently.'",
        "'speaker_0': 'No, but in but I do agree with you that we are seeing vendors that are being more responsible about collecting their scooters, and that would be part of staff's presentation at council and would go along with our recommendation.'",
        "'speaker_0': 'We would want to recommend vendors that have been working with the city and within the city's rules on the pilot program.'",
        "'speaker_9': 'Along those lines, I know there's nothing the vendor can do about this, but I can count on one hand the number of people I've seen wearing a helmet on these scooters. And as long as somebody in your group has a license, they can rent multiple scooters.'",
        "'speaker_9': 'And I happen to have a teenage boy who's tested that theory. So the whole having a 16 year old with a driver's license read them is not happening. So my question is, do we and in talking with some of the other cities that have scooter programs in place, one of the things we've been advised in terms of'",
        "'speaker_9': 'my staff reaching out and talking to individuals and me talking with my counterparts in those cities, is that should the city move forward with a permanent program? We would need to make sure that we have cost recovery sufficient to cover the cost of enforcement.'",
        "'speaker_9': 'Have we contemplated that? And I know that's still come back on a staff report, but that that all goes into this item tonight because I'm trying to figure out how to mitigate this impact between now and the end of October.'",
        "'speaker_9': 'And if I know that what's coming at the end of October would include enforcement, that could be something we factor into the equation.'",
        "'speaker_0': 'I think the short answer is yes, that what would come back is staff's recommendation on a more appropriate cost to operate within the city. I don't have a recommendation this evening on what that cost would look like, but I do anticipate it would be greater than the $2,000 that we've charged to date.'",
        "'speaker_0': 'And we are closely watching what other cities are doing. We are also watching what Sacramento is doing. And I'm sure, Councilmember, you're aware of what the governor just recently signed, where helmets are not now required for adults 21 and over who are utilizing scooters.'",
        "'speaker_0': 'And we find it also interesting that the governor included a miles per hour limit in that bill that he signed at 15 miles an hour, which is, as you may know, what we set in our luggage pilot program here in our city, a 15 mile an hour limit on speed.'",
        "'speaker_9': 'And I think that's good. That's very prudent on his part. I look, I have a question for Charlie real quick, and then Mr. Beck, I'm going to come back to you. But Mr. City Attorney, if you were if an item was to pass tonight to change the municipal code, would it come back in time to be implemented'",
        "'speaker_9': 'before the end of the pilot?'",
        "'speaker_12': 'The answer would be no. We'd have to do first reading on the 23rd. Second reading wouldn't occur until the middle of November, and then 31 days after it's signed by the mayor would go into effect.'",
        "'speaker_9': 'So there's really nothing that we can do tonight to mitigate impacts of the pilot because the pilot will end. I mean, there's nothing we can do in terms of a municipal code change because the pilot would end prior to us adopting the municipal code change.'",
        "'speaker_12': 'That's correct. But as was stated earlier, they are currently banned under the current municipal code right now. So it's an enforcement and issue that exists today.'",
        "'speaker_9': 'That's true. And they're specifically banned in the pilot handbook, but we're not enforcing it. So my question would be to to Mr. Beck.'",
        "'speaker_4': 'If we were.'",
        "'speaker_9': 'To ask you to investigate whether or not these six companies have the technology available to be able to preclude these scooters from going onto the bike path during the pendency of the pilot program, or until such time that the issue comes before Council for further consideration.'",
        "'speaker_9': 'Is that something you can come back to us with next week? And report back on?'",
        "'speaker_0': 'Certainly. Councilmember We can reach out to the vendors that that are working under the pilot and understand what technology they possess that would allow them to move forward and get timelines for when that would be whether we could present that at council next week.'",
        "'speaker_0': 'Certainly I think we could get a memo to council in roughly that timeline.'",
        "'speaker_9': 'Okay. And I know that we you could probably get a memo to council, but what I would ask tonight is that if that technology is available. That the city require those vendors who have that technology available to employ that technology in order to prevent scooters from getting onto the beach path.'",
        "'speaker_9': 'For the pendency of the pilot. Is that something that you think is feasible?'",
        "'speaker_0': 'Again, I would have to check with the companies on how long it would take them to implement it. But if they were able to implement it, we can certainly ask them if that's the wish of this council.'",
        "'speaker_9': 'Okay. And then a memo back could indicate whether they can't or they can't. Okay. Because I think that's very important. And I want to hear from my colleagues on this. But that would address many of my concerns. I know we're going to come back.'",
        "'speaker_9': 'Staff is going to come back with some recommendations and some data on this topic. And I'm hopeful for I'm hopeful that the report back will include things like the number of scooter related incidents we've had in the city, whether they be collisions or people tripping and falling over scooters that have been left on sidewalks.'",
        "'speaker_9': 'The number of scooters on the bike path that are pilot scooters, because those are the only ones that we can track. We can't track personal scooters, which can go much faster than the 15 mile per hour that we've set.'",
        "'speaker_9': 'The number of resident complaints we've received from scooters at city. At the city I know we've been routing them to an email address, so data on that would be really important. What other cities are doing about Beach Pass in particular?'",
        "'speaker_9': 'Because we want to encourage access to the beach and make it safe for all folks with various types of mobility to be on there. And how we address the cleanup issues of scooters being dumped in locations that are hard to get to like beaches.'",
        "'speaker_9': 'And I'm sure that's something that was heavily considered by Santa monica when they banned the scooters on their beaches. It's just for whatever reason, the the scooters that are abandoned on the beach aren't picked up as regularly as others, assuming others are picked up regularly.'",
        "'speaker_9': 'So with that, I'd like to hear from my colleagues. But if but if my colleagues are okay with that, my motion would be that staff reach out to the existing six vendors and determine which of them have the capability to control the scooters access to the beach path.'",
        "'speaker_9': 'And if they do have that technological ability that that be implemented immediately pending the the the termination of the pilot program. Thank you.'",
        "'speaker_14': 'Councilmember Mongo.'",
        "'speaker_4': 'Thank you. I think that the biggest concern that I've heard about scooters has been that they whiz by the bikers and create cut. They cut in and out, and they do this on both bike paths and park paths throughout the city.'",
        "'speaker_4': 'Many people know 70% of the parks are in my district. And when people want to be out on a normal bike ride and they have these little zippy scooters, and again, I'm a supporter of scooters. My office helps get scooters into the community for using for community watch all of that's great but there's a safe way to'",
        "'speaker_4': 'ride in an unsafe way to ride and a lot of the scooters have the ability to specifically limit their speed. And so I don't know what we can do about that. And I also think that it's important to note, at least on my side of town, most of the scooters are not the loaner scooters.'",
        "'speaker_4': 'While we have had loaner scooters dropped off at random places, specifically around Long Beach City College. I would say that a majority of the scooters used in our side of town are own scooters. And so figuring out and understanding and working with the providers that sell the scooters to do a better job of.'",
        "'speaker_4': 'Communicating to people who purchased scooters what the expectations are or if there was a scooter registering program in the city. I'm not quite sure how we get there. But then there would be some ability to provide communication on the matter related to the city policies.'",
        "'speaker_4': 'So I look forward to an opportunity to make it sure that. Our paths remain safe for our bikers, whether they're class one or class two bikers, and that there's some kind of leveraging of. Quite frankly, bike and scooter safety and civility.'",
        "'speaker_4': 'Through the process. Thank you.'",
        "'speaker_2': 'Yes. Mr. Olsen.'",
        "'speaker_14': 'Thank you very much. I want to thank the authors of this item for bringing it forward. I think it's overdue for us to have a conversation. I think it was I mentioned earlier that this was. The electric scooters were.'",
        "'speaker_14': 'The pilot program was initiated as an administrative action and not a council action. But however, I don't necessarily disagree with that. I'm a huge supporter of our Bike Boulevard program and active transportation modes in an effort to to to get people out of their cars and not pollute our our our.'",
        "'speaker_14': 'Our environment. I think these electric scooters are all Ray. Who knows what they they turn out to be and whether or not this is going to be the the the thing of the future or thing of today. I can recall just two or three years ago, you know, there was there were people lined up and they were'",
        "'speaker_14': 'upset over hoverboards. I don't see anybody riding hoverboards anymore. So I think I would just I'd like to see us. I'd like to see us proceed with caution on this. This particular item we just heard a great presentation from our Convention and Visitors Bureau.'",
        "'speaker_14': 'Our beach is one of the greatest assets that we have in the city, and I personally don't want to restrict it. I want to I want to just just touch on a couple of things. And I do respect where my colleagues are coming from.'",
        "'speaker_14': 'They're hearing from their constituents. This is a new phenomenon. They're probably seeing more scooter activity than in and in my district. But at the same time, people go to the beach to have a good time and have fun.'",
        "'speaker_14': 'I, I, um, I'm looking at the, the ordinance 10.3 8.02. It speaks to driving on sidewalks a speaks to automobiles, trucks, tractors, motorcycles or power driven scooters. So not drive on a sidewalk except at a permanent or a temporary driveway.'",
        "'speaker_14': 'And B, there's no operator of any motorized scooter shall drive upon any bike path on the beach or any bike path adjacent to a city marina. And so my my question for the city attorney regarding that particular ordinance.'",
        "'speaker_14': 'Was that in reference to the scooters, were scooters defined in 2002 as they are defined today?'",
        "'speaker_12': 'And the answer is no. But the section that you read, we believe, bans all those scooters until the council gives direction to amend that ordinance to clarify what, if any, electro electric type scooters you would prefer to have on the bike path or not.'",
        "'speaker_14': 'Own to motorized scooters. And they are probably 200. They they require gas. They are defined as scooters. These electric scooters are like razor scooters that were not were not in play in 2002. And I just want to I don't I don't feel like this this this language is speaking to that type of scooter.'",
        "'speaker_12': 'And I think at the time at the time it was written, it was these were not contemplated. I would certainly agree with that. I think that what we have asked for is we need clarity and direction from the council so that we can amend this section.'",
        "'speaker_12': 'Either way, you'd like to go on that. But currently as written, we believe that that distinction is not made when in that section.'",
        "'speaker_14': 'I also like to point out the fact that I was on this council when we made a very controversial decision to expand our our bike path. Right. And go from one bike path or walking path to a bike path.'",
        "'speaker_14': 'And that was a significant investment from our tidelands. And it was controversial, but it actually expanded capacity on our beach. And I think part of what we were seeking to do and I'm going back because I took a vote on that, but I think part of what we were seeking to do is to to expand opportunities for'",
        "'speaker_14': 'for for folks to use alternative transportation without impeding pedestrians. Right. It was a pedestrian safety concern. And so I think we need to be open as a council to to new modes of transportation, particularly those modes of transportation that don't emit don't emit knocks into the environment, but also just be be open minded to to to to'",
        "'speaker_14': 'the future, because I think that that is the future. I don't like I said, I don't know where these these moderate these these electric scooters are going to go. You know, they may be they may be obsolete in two years.'",
        "'speaker_14': 'But I think we need to allow the pilot program to work. I think there's a lot of information that still can be collected, a lot of feedback that we can can get from residents and stakeholders. And I would say all stakeholders, I mean, our convention and visitors bureau, I would be interested to know what their take is'",
        "'speaker_14': 'on this. I'd be interested, obviously, our neighborhood folks and beach goers, but we need to engage, I think are stakeholders a little bit more on this item before we move, before I can support a outright ban. Right. And that and it's.'",
        "'speaker_9': 'Not on the floor.'",
        "'speaker_14': 'But but but so did you make an amendment?'",
        "'speaker_9': 'Yeah. No, I made a motion to ask that the director reach out to the companies that are part of the pilot to see if they have the technology that would keep the scooters from getting on to the beach path, which is currently part of the pilot rules and regulations.'",
        "'speaker_9': 'They're currently not allowed to go on the beach path pursuant to the pilot program. They have a handbook that they're supposed to follow, and if they have the technology, they can they can actually cause the scooter to slow down as it approaches a particular location or stop.'",
        "'speaker_9': 'So the companies I've talked with that are operating here have that technology.'",
        "'speaker_14': 'Okay. And so I think the disconnect here is you knowing about the handbook and reading the regulations and the person who is accessing and getting a scooter, probably not getting that information is so part of this pilot program and part of the conversation that we're having here tonight.'",
        "'speaker_14': 'I think there can be some some good policy coming out of this possibly in the future in regards to how we educate folks throughout the city in terms of use of of electric scooters, safety and everything else that goes along with that.'",
        "'speaker_14': 'But I just think we're at this point, I think we're jumping the gun because it's only been a few weeks. Right. And yes, we need to be responsive to some complaints. I think you've heard from staff that they are responding and collecting data and getting taking that information in and reviewing best practices in other cities.'",
        "'speaker_14': 'These are things that we do when we bring in new policies. And so with that, I think there's there's some education, obviously, that needs to be done. I think we talked about, you know, massaging policy out in committee.'",
        "'speaker_14': 'A little bit more. I think this is an opportunity to do that. And so I'm open to hearing from from everyone else on this. But I would just just be hesitant to to jump into banning in a new a new mode of transportation that we really don't know much about at this point.'",
        "'speaker_2': 'Thank you, Councilman. Your anger.'",
        "'speaker_13': 'Thank you. You know, I have a favorite quote that I always. Use regarding change. Change is inevitable, and in a progressive society, change is constant. Benjamin Disraeli, philosopher, said that. I use it on my on my screen every now and then on my computer, just to remind me that we're always in the midst of change.'",
        "'speaker_13': 'And this issue here is one of those issues where change is happening as we see it. When I first signed on to this item, I was very much into what's going on in Santa monica, what's going on with a lot of other big cities regarding scooters.'",
        "'speaker_13': 'It's an issue up and down state because of the potentials and some of the the accidents that happen because of the irresponsible use or irresponsible operation of these of these scooters. But then again, at the same time, I could see that there's other types of of motorized or electric methods of transportation can be used on these bike'",
        "'speaker_13': 'trails that are very beneficial for people, especially those with mobility issues who want to have access to the beach. So access becomes an issue here in regards to people with a disability or with a mobility disability to access the beach.'",
        "'speaker_13': 'So I could see what the issue is here. Well, my recommendation and my my my spin on this, I guess, would be at this point is that it seems like we do have an issue with with data. I mean, we don't have enough of it.'",
        "'speaker_13': 'I think we still need to gather gather more. I would be especially interested in knowing. We're learning how many of those motorized scooters or bicycles that are along the bike path and especially here in Long Beach that are driven or used by people with mobility issues.'",
        "'speaker_13': 'I don't think we have enough of that data available. I see. So some people in the audience are raising their hands being there's three right there. Right. But, you know, we need I think we need to have more information on this.'",
        "'speaker_13': 'And, you know, I'm not sure that right now changing the municipal code would be the most viable path to take at this point, pun intended in regards to the. Nobody got that one. Okay. In regards to way forward with with with a full ban, I feel uncomfortable with it because obviously the information is not totally there.'",
        "'speaker_13': 'The maybe a question to the public works director would be, do you think that you have all the information you need right now? Do you need it? How much how much time do you think you would you would need to get to get the all the data that you would be required to make a a sound recommendation'",
        "'speaker_13': 'to the City Council in regards to moving this forward.'",
        "'speaker_0': 'Councilmember Urunga So we under the original pilot program had pointed to the end of this month, we're now in October. So the end of October we anticipate getting information from all the scooter vendors. I think the heat map and some of the things that Councilmember Price brought up about where are we seeing scooters that are dropped outside'",
        "'speaker_0': 'of the the pre-approved drop zones? Where are we experiencing the most complaints? What are those complaints? How are they characterized getting all that data together and bringing back to council? I anticipate doing that sometime in November at the latest early December.'",
        "'speaker_13': 'Okay. Well, I think that's that's good to know, because I think that we need to take our time with this and putting it through to the end of October when the end of the pilot program would be a little premature at this point.'",
        "'speaker_13': 'But continue the conversation. Thank you.'",
        "'speaker_2': 'Thank you. Councilman, you want to go? Councilwoman Pierce.'",
        "'speaker_5': 'Thank you. And I want to thank you. Good conversation here today. You know, originally when it was first presented to me, I thought it was just enforcing existing policies. And then I thought through our research that this was not in place.'",
        "'speaker_5': 'And honestly, I think the conversations are right. Conversation to have in the future probably fleshed out a little bit more before having it at the council. So I just I want to say I appreciate the conversation in my district.'",
        "'speaker_5': 'Our districts are so different, Suzy. Well, I haven't had complaints about the bike path in the district. I've had probably three or four of folks in our senior community that have, you know, been walking on the sidewalks and have had challenges with it just overall, but not necessarily on our beach path.'",
        "'speaker_5': 'And I so first, I have a question for the city attorney, as the conversation is now with the comments that Councilmember Price has made. If a yes vote tonight would not be on the recommendation that's listed in the item, it would just be to have our public our public works director work with these six businesses and to'",
        "'speaker_5': 'come back with with that information. But there's not an additional ban that is on the table anymore.'",
        "'speaker_12': 'I agree with you that the original motion has been amended. However, I think as I understood the motion, it would be to reach out to the vendors and if they have the technology available to implement that technology immediately to ban them from the bike path.'",
        "'speaker_12': 'So it wasn't I think, if I heard you correctly, it was a report back, but it was changed subsequently to if that technology avail is available, implement it through the remainder of the pilot program consistent with the handbook.'",
        "'speaker_9': 'Just for clarification, the handbook is the current existing regulations for the pilot program. So it would be if they're able to monitor the technology such that there they are in compliance with the existing regulations. I'm not asking for a ban there.'",
        "'speaker_9': 'Was that cleared?'",
        "'speaker_12': 'That's correct. There would not be a ban to any of the other type of electrical electric bikes or scooters. It just too would prohibit them from operating on the bike beach bike path for the remainder of the pilot program.'",
        "'speaker_5': 'If they have that capability. And I guess that that so one is thank you for that. That's been my understanding. So there's not a need to make any other changes if that's something that we're all comfortable with. My question to Public Works director would be, do we have any idea say they do have that technology if it's'",
        "'speaker_5': 'even possible for them to implement it in a quick turnaround? Do we know that?'",
        "'speaker_0': 'Councilmember I do not have that information as I sit here tonight. Okay. We will reach out to them this week and hopefully we can get quick responses and return to council, as I mentioned, with a memo and share that with all of you.'",
        "'speaker_5': 'Great. Okay. So just a couple of comments. As I support, you know, reaching out to them and trying to implement the technology, if that is something that is possible, I would imagine that some of them might have it and not use it unless we are actually in a binding contract with them.'",
        "'speaker_5': 'But I do want to say how much I appreciate having pilot programs. You know, I know that sometimes it can feel frustrating because staff goes out and does a pilot program and then the constituents call our offices. But we did a pilot program with the free ride, and I think it was a great opportunity for us to'",
        "'speaker_5': 'just say, okay, if this was going to happen in the open market, how would it work? What are the challenges, what are the opportunities? And I know we're working with your office to bring back that conversation so that we can look at the best way to implement it.'",
        "'speaker_5': 'So I appreciate being able to do pilot programs quickly. I think they operate, they identify, you know, what, we need to change in the city and don't set us up to be in a bind in relationship. So I respect that.'",
        "'speaker_5': 'I do want to say, as we look forward to the changes that you've mentioned being made around the scooters or bike conversation, I want to make sure that we don't create a two tiered system where if you're able to afford one type of transportation that's electric, but you're renting another one, that we're not creating opportunities where they're'",
        "'speaker_5': 'both not allowed to be on the same path, whether it's a bike path or whether it's a sidewalk. I also think our city's done a great job with our bikes and doing the registration with them and also having like Tony Cruise go out and do something.'",
        "'speaker_5': 'So I would ask that as we come back that not only are we looking at a plan and changing our policies, but that we're looking at an outreach strategy on education. So maybe we have one in each district or five throughout the city based on need and where the heat map shows us.'",
        "'speaker_5': 'I also wanted to ask, I think I heard a number about what makes a viable scooter program is something like three rides a day per scooter, and we're exceeding that. Is that correct?'",
        "'speaker_0': 'I don't have any of that data yet. I've not seen.'",
        "'speaker_5': 'The numbers, he told me. That number in City Hall is something like five per scooter instead of three, and I think that it just shows how excited people are. And so I want to applaud you guys for thinking outside the box on that.'",
        "'speaker_5': 'I support the change that Councilmember Price made to work with the vendors as possible and bring back some of those recommendations. And I look forward to a good discussion in October or November or December.'",
        "'speaker_2': 'Thank you, Councilwoman Pierce. Councilmember.'",
        "'speaker_15': 'I thank vice mayor. So just you know, this conversation gives me a few thoughts. First of all, thanks for thanks Councilmember Price for, um, you know, saying that you want to hear from the council on this because I really, I haven't spent too much time thinking on this issue.'",
        "'speaker_15': 'But, you know, I have some, some thoughts here. So, one, it sounds like that the problem we want to address could be twofold. One, the dumping of the dropping of the scooters in the path and to the speed of the scooters.'",
        "'speaker_15': 'Right. I think we need to spend some time thinking about fixing the fixing that problem. And maybe maybe we begin evaluating how to fix that problem while we're in the process of this pilot program. So one strategy that that cities and agencies are using to change behavior is pricing, right?'",
        "'speaker_15': 'So there could literally be a process where if you if you're a company, well, the other parties, this concept that we have about if you have the technology to geofence and get off the path, then you should come off the path.'",
        "'speaker_15': 'That's counterintuitive, my opinion. The better technology should be the ones that we allow on the path and the ones that do not have the technology come off the path. And the reason is because if they have the technology, what if there was a way to say, you can ride the ride, but if you drop your your scooter'",
        "'speaker_15': 'outside of the designated drop zone on the bike path, then you are fined. Right. Or. And that way we can use pricing to discourage the behavior potentially. And if you don't have the technology, then your scooter cannot be on the bike path if you don't have the technology.'",
        "'speaker_15': 'I just think we need to probably take some time in inverse and try to resolve the problem.'",
        "'speaker_8': 'I I'm sorry.'",
        "'speaker_15': 'So anyway, so I think we should look at it that way. So I would I would suggest that tonight maybe we don't say if you have the technology, get off the path. The ones with the technology are the ones I'm most interested in seeing how they behave and respond.'",
        "'speaker_15': 'The other parties, the pilot. We should be able to distinguish to this pilot which which of these are the good actors and which ones are the bad actors as well. And that's something we should be tracking on our on our beach path.'",
        "'speaker_15': 'So I think we should go through the pilot. We should have a conversation with these companies about, you know, if they have the technology and it sounds like they're doing that. But I think it should go from the we should be rewarding the better technology, rewarding the folks who are using geofencing and the ones who don't.'",
        "'speaker_15': 'We should be encouraging them to do so. Or maybe they don't they don't get to participate in the full program once it rolls out. Those are my thoughts.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_2': 'Thank you so much. Councilwoman Gonzalez.'",
        "'speaker_9': 'Thank you. So I have similar thoughts as well in terms of and I want to pull back and say to that we should have definitely gotten a little bit more information on the pilot program and what it entailed, because I remember I was just really sort of shocked that they just started showing up right in front of'",
        "'speaker_9': 'my building. And I was like, Oh, is this a random scooter? Did someone leave their scooter? I had no idea. So it's sort of taken a lot of residents I know in downtown to back a little bit, but now we see everybody on the scooters.'",
        "'speaker_9': 'Well, that's just what I'm hearing from from residents. So but I see a ton of people on the scooters. So students, downtown residents. And, you know, it's it's a really good and positive thing. And I do agree I know we're going to get the data back and the analytics back between October and December.'",
        "'speaker_9': 'And I think that the analytics will absolutely tell us a really good story of of where people are using them. And I just know from my residents a few sample cases, some of them have told me because Long Beach transit routes were changed or removed in some areas that they now use these scooters, which I think is'",
        "'speaker_9': 'a really, really big deal. So I also think in addition to the data we get back, although this item doesn't call for it, is just to be a little bit heightened of a sense. And I know we are in terms of Long Beach transit routes that have been changed or removed.'",
        "'speaker_9': 'So we know where these are. So we know where this data will lie. I just want to clarify as well the e-bike discussion. I'm having a little trouble with that. So are we removing are we saying that we're going to allow e-bikes on the path?'",
        "'speaker_9': 'Well, I think for this particular item, I'm trying to narrow the discussion to just the pilot program. The pilot program for the scooters, which has a specific clause in regards to the bike beach path. So I didn't want to confuse the discussion with the e-bikes because a lot of people do use them and they're not the biggest'",
        "'speaker_9': 'source of concern. We have a pilot program in place that says they can't no riding on sidewalks, no riding on the bike beach path and use of a helmet at all times. So this is something that they all had to sign to agree to participate in the city.'",
        "'speaker_9': 'So I thought we would take the e-bike discussion out of it, since that's not really the problem and just focus on the pilot program because we don't have any way to enforce the rules that the companies already agreed to.'",
        "'speaker_9': 'Okay. Sure, I guess. And I understand that we want to compartmentalize and be really focused. And I would just say just over on that e-bike discussion, those can go up to 30 miles per hour. So that's another issue.'",
        "'speaker_9': 'I think just in terms of mobility we do need to address because although a lot of people are using them, as Councilmember Pearce said, yes, they're not rentable so much. But they you know, a lot of people a lot of people purchase them and, you know, access, I think, for many of us is a is a it's'",
        "'speaker_9': 'a huge point that we need to amplify because there are a lot of downtown residents that want access to the beach. And the best way to do that is to provide to be provided a cheap scooter. And so we need to look at some other facet to be able to address e-bikes at some point as well in'",
        "'speaker_9': 'that discussion. What I like as well. And I know that there is technology to slow down the scooters and pause in certain areas. And I while I appreciate the discussion about implementing that with the six. With the six companies we have now.'",
        "'speaker_9': 'There are other areas that also need to be looked at. You know, I think a lot of downtown residents, especially with senior buildings that have major mobility issues, we can't even get the bike bicycle issue sort of down, you know, and we're sitting here talking about E-Scooters on the bike that we had to pull back a little'",
        "'speaker_9': 'bit more and start talking about how we address enforcement on just bicycles and scooters in these very vulnerable neighborhoods. A lot of my residents in downtown and I have a lot of senior residents do not have a lot of mobility.'",
        "'speaker_9': 'They have had Long Beach Transit cut some routes. And now on top of that, we have this scooter discussion. So I just want us to think about that a little bit more largely, but I love the idea. Councilmember Price, about the complaint data and cleanup issues, because I think those are absolutely issues we need to start addressing'",
        "'speaker_9': 'a bit more. So I'm still a little weary from this. I'm going to I'm going to listen to a few more people. But those are sort of just my thoughts preliminarily. Thank you.'",
        "'speaker_2': 'Thank you very much, Councilwoman Soprano.'",
        "'speaker_8': 'Thank you. Just to follow up on the last comments. If there's some mission creep here, I'm going to do the same thing. I'm going to talk about Cal State, Long Beach, but it occurs to me that there's an immediate public safety need on the bike path, and it'd be nice if we could get that resolved here tonight'",
        "'speaker_8': '. But that was kind of an unintended consequence, something that was anticipated by Cal State Long Beach before, as soon as the scooters showed up, is that they would be blamed for students riding them into the neighborhood. So we have an elaborate preferential parking district system north of the campus along Atherton.'",
        "'speaker_8': 'I believe it's a total of 18 north south streets have preferential parking. For the scooters to be lined up on the perimeter on Atherton of the school. You could not have invented a better system to screw up a preference of parking, because now you extend that distance that people can go can drop off their cars.'",
        "'speaker_8': 'So you're just going to anger the folks who are just north of the Prfecture parking district. So as I said, Mr. Beck, I don't want to get into mission creep here, but if that can be on your radar, also, if we're talking about some type of system where they can electronic electronically monitor that or prevent them from'",
        "'speaker_8': 'going to certain areas, that would be helpful. Thank you.'",
        "'speaker_2': 'Thank you. Congressman Stupak. Now, Councilwoman Pryce.'",
        "'speaker_9': 'I believe Council on Super now that they can. We're certainly not the first city to be dealing with this. And I know that there are cities that have limited access to certain areas. I just want to clarify, because I heard several of my colleagues say they're not going to support the item because it's a ban.'",
        "'speaker_9': 'So I started off my comments with saying, let's move away from the ban and enforce try to enforce our current existing policy, which all six of the providers had to sign, which has five provisions that they have to follow.'",
        "'speaker_9': 'They have to educate the consumer that they need to be 18 years old, must be in possession of a valid driver's license, must agree to the liability waiver. Covering the city of Long Beach contained in the vendor's end user agreement, must agree to comply with the California Vehicle Code and Long Beach Municipal Code, which shall be provided'",
        "'speaker_9': 'by the vendor to all users prior to use of the scooters. Notification of laws should emphasize the following No riding on sidewalks, no riding on the beach path and use of a helmet at all times, and may only park scooters outside of the sidewalk path of travel, allowing a minimum of four feet of clearance and compliance with'",
        "'speaker_9': 'the Americans with Disabilities Act. Americans with Disabilities Act. So these are rules that and everyone here is right. We were not consulted when the handbook was created. So a lot of the things we're talking about we didn't have a policy decision on.'",
        "'speaker_9': 'What I'm asking my colleagues to do is for the remaining next three weeks, can we try to hold the companies accountable such that the scooters don't end up on a prohibited area if the technology for that company allows it?'",
        "'speaker_9': 'If after that, we want to allow it and we want that to not be a perhaps prohibited area anymore, we can have that discussion. We can absolutely have that discussion and say, you know, what the of the rules and regulations and the pilot program didn't make sense.'",
        "'speaker_9': 'I don't like them. I want them on the beach path. But right now they're not allowed on the beach path. So I and and Councilwoman Pearce hasn't received these complaints. We've received a lot of them. And what we hear is, why can't you enforce this?'",
        "'speaker_9': 'Why aren't you enforcing this? And the reality is because we don't have police officers to have standing on the beach path enforcing these rules. But we do have technology. And I've checked I know at least one of the vendors, Bird, has the technology available now.'",
        "'speaker_9': 'They can implement it tomorrow to allow the the the the scooters to not go on the bike path. So I think, you know, what I'm asking my my colleagues to do is support our director reaching out and saying, if your company has the technology, please prohibit the scooters from going on the beach path, as you've agreed to'",
        "'speaker_9': 'do by signing on to our pilot. I'm hearing some resistance to that. I'm not exactly sure what the basis of the resistance is, other than what I'm hearing is that maybe people don't like the existing policy that prohibits them from being on the beach path, which I didn't write the policy.'",
        "'speaker_9': 'I'm just trying to figure out a way to enforce it. If people don't like that and they feel more comfortable, I would be open to a report back from the director on what of the companies have the geofencing technology that they could implement.'",
        "'speaker_9': 'But remember, the pilot ends at the end of October and we have folks that have expressed a lot of concern about us not enforcing our own agreement with these vendors. We we entered this agreement with these vendors, and we have the ability to force them to comply.'",
        "'speaker_9': 'And what we would be saying is, no, no, no, it's okay. Feel free to violate the terms of your agreement. We're not going to hold you accountable to it. So I'm open to hearing from my colleagues. I'm advocating on behalf of my residents at this point, and I'm asking for your support.'",
        "'speaker_9': 'But I'm also very, very open to any suggestions folks have on I mean, I understand the tenor of what folks are saying here, which is maybe you're not seeing a problem with it on the beach path and you're okay with them being on the beach path.'",
        "'speaker_9': 'And if that's what you're saying, I hope that you'll be very clear about that, because I know when I go back to my communities, I'd like to say these of my colleagues did not have an issue with this, because I do because the issue is presented a safety hazard in on the beach path.'",
        "'speaker_9': 'So I would like us to do whatever we can to adhere to our current policy and contract if folks would like to do a study instead. Totally okay with that as well.'",
        "'speaker_2': 'Thank you. Thank you very much, Councilwoman Price. Councilman, also.'",
        "'speaker_14': 'Thank you, Councilmember Price. And I, like I said earlier, I do I do respect your position. I understand I'm not getting the calls from my constituents. I try to go down to the beach as much as possible. And for me, it hasn't been a hazardous.'",
        "'speaker_14': 'So seeing these electric scooters on here and as I mentioned in my comments earlier, I prefer a less restrictive model as opposed to creating restrictions for them. The the regulations that that you you mentioned were administrative in nature.'",
        "'speaker_14': 'They weren't legislative. Again, it wasn't something policy that the council developed. I think it was, you know, staff trying to do their best to come up with something to get this this this new transportation system or mode implemented into our city quickly.'",
        "'speaker_14': 'And so, I mean, I commend them for the work that they did. But, you know, again, this is this is an evolving issue. Just since we've implemented here within the last several weeks, there's been legislation in Sacramento regarding these these these electric scooters.'",
        "'speaker_14': 'And I would venture to say that over the next several months or a few months, we're going to see a lot of new ideas and possibly even some some best practices from other municipalities where they're dealing with them and these issues.'",
        "'speaker_14': 'And so I would I would offer a friendly to the stroke staff to do exactly what you suggested. But I also would recommend that this issue be studied further in committee. I think there might be two committees that that would be appropriate public safety and then Infrastructure and Transportation, Transportation Infrastructure Committee.'",
        "'speaker_14': 'I would recommend, if you're open to a friendly amendment that these these these committees also study these issues, this issue concurrently to to hopefully get to a place where we can develop some sound public policy.'",
        "'speaker_9': 'Kept that friendly. I think that's an excellent suggestion and I would recommend it go to the Transportation Committee because our public safety committee meeting is pretty packed for next week. So I don't want to add to our agenda and I know that committee, I'm not sure how often they meet, but this would be the perfect issue for'",
        "'speaker_9': 'them to take up.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_9': 'Kind of if they're open to it.'",
        "'speaker_2': 'Councilwoman Pierce.'",
        "'speaker_5': 'Thank you. And Councilmember Alston, I perfect. I think that that's where we needed to land. I do think I know that there's there's agreement is out there. I know that we've shared it with our constituents just in the first week that these were implemented.'",
        "'speaker_5': 'And so if we can maybe share that one more time, the agreement that we had with all six vendors so that the council offices can see that. I also think I have a question for staff. I know that we in our budget said that we were going to have more bike officers.'",
        "'speaker_5': 'What's the timeline for that?'",
        "'speaker_11': 'So part of that is we have not identified the revenue yet. To add those, we were going to come back to money falling from mid-year and come back with a plan for how to both fund Engine 17 and also to fund six additional motorbike officers.'",
        "'speaker_5': 'Thank you for that motorbike.'",
        "'speaker_4': 'Motorbike.'",
        "'speaker_11': 'It was going to be a team that was bikes, but also the ability to do motorbikes or bikes. It was a rapid response team that could use both bikes or motorbikes, either one.'",
        "'speaker_9': 'They just put them on scooters.'",
        "'speaker_4': 'We put a pin in.'",
        "'speaker_10': 'And say, For.'",
        "'speaker_11': 'Scooters? Sure, why not? Anything that's mobile, anything that gets them quickly around.'",
        "'speaker_5': 'And I, I think what I like the friendly amendment. I fully support the friendly amendment. I think, you know, studying this in committee is a great place to do that. I also just want to recognize that kind of a process.'",
        "'speaker_5': 'And sometimes I feel like we're trying to implement where we get a lot of challenges, whether it's with our homeless community or scooters, where people feel like we don't have enough officers that are enforcing and that maybe we need to discuss how we handle those those complaints.'",
        "'speaker_5': 'Because I feel like this is one that, like I said, I originally almost didn't sign on because I felt like it was just saying we need to be enforcing our laws. And the challenge is that we're not we're not going to have enough officers to enforce every single bike policy, every single helmet out there, and that we'",
        "'speaker_5': 'have to do some creative community engagement programs. And I think looking at models like we have with our bikes, whereas if you return a bike to a station that you get money back into your account. So instead of saying we're going to fine, I think the deal with our rental bikes is that you get money back if'",
        "'speaker_5': 'you return it to to a station instead of leaving it somewhere. So just I look forward. Mr.. Back to your creative presentation when this comes back and fully support the friendly and thank you everyone for the conversation.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'I appreciate Councilman Price's flexibility in this. I think that the financial incentives is a huge one, and I look forward to that opportunity. In kind of working through what our next steps are. I think that a lot more of our work should be done in committee.'",
        "'speaker_4': 'So I really am supportive of the friendly and look forward to hearing what the Infrastructure Committee and Transportation Committee does with us. So thank you.'",
        "'speaker_2': 'Fine, thank you. And do we have any public comment on this item?'",
        "'speaker_12': 'Vice Mayor If I could, was the public comments coming? Just to clarify the friendly amendment.'",
        "'speaker_2': '1/2, please.'",
        "'speaker_12': 'The friendly amendment by Councilmember Austin was to adopt the motion by the council person to reach out to the vendors and implement.'",
        "'speaker_11': 'Immediately the technology of available to.'",
        "'speaker_12': 'Ban it from the bike path and also send it to.'",
        "'speaker_8': 'The.'",
        "'speaker_12': 'Transportation and Infrastructure Committee for further study. Is that correct?'",
        "'speaker_9': 'I, I actually think it may have been modified with Councilman Austin's friendly that instead of banning it immediately, we're going to send it to committee.'",
        "'speaker_12': 'Okay. Thank you.'",
        "'speaker_14': 'Well, I think we still want staff to study. Look at what the geofencing, the possibilities for geofencing are.'",
        "'speaker_3': 'Right.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Vice Mayor. I'm cute if possible, just because of the seconder of the motion when we talked about telling these organizations at least we should send them an email that says, Friendly reminder, you agreed that X, Y and Z and it should be all of them.'",
        "'speaker_4': 'The dumping in random places. I mean, leave it. I mean, if we could just remind them there are 30 days left in the pilot program. Here are the things you agreed to. Any technology you have to help us to ensure you meet the terms of your agreement would be helpful.'",
        "'speaker_4': 'Just a thought, Councilman Price, are you okay with a friendly reminder of the terms they already agreed to?'",
        "'speaker_9': 'And like I said, I know there's different providers and there's different levels of responsibility. I don't know personally all the representatives, but I do know Bird has a representative at the meeting. They've been very engaged with us and very responsive.'",
        "'speaker_9': 'So I think it doesn't hurt to give them another reminder.'",
        "'speaker_4': 'And our office has had to reach out to them multiple times, two for just scooters left next to the water, next to everywhere. So I appreciate the opportunity to remind them of what they agreed to. Thank you.'",
        "'speaker_2': 'Thank you. No public comment.'",
        "'speaker_4': 'Okay. Karen, recite. I'm a resident of the First District and I live in a senior building of which there are many downtown. And I just want to share my experiences.'",
        "'speaker_6': 'With the scooters.'",
        "'speaker_4': 'I didn't see the articles about them coming until after they were on the streets. The first week I was almost run over by three. They don't make noise. I'm hard of hearing and I have poor vision, as many seniors do, and I could not hear the scooters and the people riding them.'",
        "'speaker_4': 'Don't yell. They don't have bells or buzzers, so you can't tell that they're coming up behind you and you're not looking at who's writing these scooters. They are young men, primarily, and I travel all over the downtown area.'",
        "'speaker_4': 'They're young men. They never got the rules, so they are not abiding by them. They ride them on the sidewalks, they turn them up for grabs. And another big concern is that there groups of them I saw two groups within three days going down Atlantic Avenue of eight young men in the middle of Atlantic Avenue, both sides'",
        "'speaker_4': 'of the street. And this, I understand, is is getting to be a growing problem.'",
        "'speaker_10': 'They do a.'",
        "'speaker_4': 'Meetup or a Facebook post and they gather in a spot. So this is a huge potential problem. I live in a 17th floor of a high rise building and on Saturday, Friday nights, if you could put a time limit on them, they get them at night and they ride up and down Pacific Avenue, disturbing the residents.'",
        "'speaker_4': 'Fortunately, a lot of us are hard of hearing, but I'm on the top floor. The sound rises. So I've been awakened several times by the scooters and the youth yelling back and forth if we're going to have scooters.'",
        "'speaker_4': 'And I believe that any mobility devices that help people to move and get them out in the community are a good thing if we do it safely and responsibly. I don't know how you're going to work.'",
        "'speaker_6': 'With these young men so that.'",
        "'speaker_4': 'They follow the rules. And Susie, you're lucky I have not seen one person with a helmet, not one. And I've probably seen 150 people on these scooters in my travels. So. Pilot programs. We need to if we're going to do pilot programs, we need to think them through a little bit better.'",
        "'speaker_4': 'There's no signage indicating what the rules are on the scooters. And as a senior, I would like to ride one, too. But my balance is not good enough for a two wheeled vehicle. And I know there are three wheeled kind of trikes out there.'",
        "'speaker_4': 'And seniors like to get around and do things that are fun too. So please consider that when you take these things into a final vote.'",
        "'speaker_2': 'Next.'",
        "'speaker_0': 'Hello.'",
        "'speaker_8': 'My name is Greg NZ. I've been a resident of Long Beach for about 30 years. I lived in the third district for 15 years and I currently live in the seventh district. I have been there 15 years also, and as a owner of two electric bikes, I want to commend you for deleting the bike language from that'",
        "'speaker_8': '. That concerned me and made me sit through the whole meeting. But I just want to reiterate and give you some information because I don't know if all of you have been on electric bike in the.'",
        "'speaker_10': 'Last three years.'",
        "'speaker_8': 'But what they're able to do is assist you. You could ride further, longer, harder. They don't make the noise that the gas powered by cycles do and they don't emit, you know, fossil fuels into the air. So they do a lot of good things.'",
        "'speaker_8': 'In fact, I'm working on a website to encourage people to use this as a mode of transportation rather than their vehicles for short distance rides to the gym or to a restaurant or to the bike path. With the class three bikes, they only go 28 miles per hour.'",
        "'speaker_8': 'You're closed. You have to go downhill. Really hard to go a little bit over that. But they're pretty much maxed out. The accelerators on the bikes, both class two and three, they top off at 20 miles an hour.'",
        "'speaker_8': 'So there was a recommendation for the e-bike language that there's a speed limit. I think all bikes should adhere to that because I have a race bike also that has no motor and I can get that over 20 miles an hour if I pedal really hard.'",
        "'speaker_8': 'So I think maybe he's putting speed limits posted throughout the bike path would be a good recommendation and then maybe citations if they don't adhere to it. But it's not just the class two and three bikes that are able to speed, it's all bikes.'",
        "'speaker_8': 'So I think we need to put that into consideration. But one of the things, Councilmember Price, for looking at the language and realizing that the Class two and three are not in the same category as the scooters. So thank you.'",
        "'speaker_2': 'Thank you. Next speaker.'",
        "'speaker_17': 'Anything. I'm Beth Black, co-owner of Pedigo Electric Bikes of Greater Long Beach. And I want to thank you for your careful and thoughtful discussion this evening. It really became clear to us as we sat and listened that you have learned a lot about the bikes in the process.'",
        "'speaker_17': 'I do want to clarify that for Councilwoman Gonzalez, that Class two electric bikes are considered to be low speed electric bikes along with Class one. They are governed to a top speed of 20 miles per hour. They can be governed lower.'",
        "'speaker_17': 'And we've had some of our our customers request that it really is not an issue of speed. We always follow the speed limits on the bike paths. We're very cautious. We have six years in business with membership at times with the the convention visitors bureau.'",
        "'speaker_17': 'Lovely presentation tonight, by the way, and an excellent record of safety with zero accidents. Nobody leaves my bike shop on a bike without wearing a helmet. And one last thing before you go. I do have to say, guys, that we just last year sold a couple of bikes to the SEAL Beach Police Department.'",
        "'speaker_17': 'Just this morning, I was out riding with a guest and we ran into foot, not literally, but we ran into one of the police officers in her car. And she said just two weeks ago they had to pack their bikes up for the winter and they're hoping to get appropriations so that they can ride year round.'",
        "'speaker_17': 'There was one point where they had a lot of traffic. Now it's a little town. I know SEAL Beach is a small town, but they get a lot of congestion down there. And the officers in a car chase after a fellow in a car, they couldn't catch him.'",
        "'speaker_17': 'But the guy on the e-bike rode right up and had them pull over. So think about that. They can really help with crowd situations and beach patrol and that sort of thing. Thank you very much. We'll be in touch.'",
        "'speaker_2': 'Thank you. Next speaker.'",
        "'speaker_3': 'My name's Evan Lockwood. Um.'",
        "'speaker_11': 'I do have a disability.'",
        "'speaker_8': 'And I use class two e-bikes to get around. And also to commute. One of the introductory.'",
        "'speaker_11': 'Paragraphs said that people on the beach pets don't primarily commute there, which I.'",
        "'speaker_8': 'Feels is wrong. A lot of the spandex guys also commute and then change at work.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_2': 'Thank you. Next speaker.'",
        "'speaker_8': 'Hi. Good evening, counsel. Thank you for having this discussion. My comments that I wrote initially have changed, obviously, because of the nature of the conversation has changed. But my name is Nick Rousseau. I work for Petal Movement, which is a local bicycling services company with headquarters here in Long Beach and operations throughout L.A. and Orange County areas'",
        "'speaker_8': '. Pedal movements. The operator of the Long Beach Bike Shares program, as well as the city's bike station facility. We also work with Petco in Greater Long Beach to operate their service department, and we're a program provider for many bicycling and active transportation initiatives throughout the city.'",
        "'speaker_8': 'So we obviously understand the many concerns, safety and otherwise, that motorized scooters and bicycles present in our city and on our roadways and public infrastructure. We understand these concerns because we are bicyclists, pedestrians and motorists ourselves and many of our companies.'",
        "'speaker_8': 'Employees use the bicycling infrastructure our city has built to commute to and from work, perform their job duties and enjoy in their free time. And this includes the beach bike path as well as protected bicycling infrastructure downtown and elsewhere.'",
        "'speaker_8': 'So to the gentleman's last statement, the beach bike path is a place I regularly commute on, so I just would make sure that that's something we'd consider in the future. On a personal note, I can't count the number of times that I've been nearly injured while riding peacefully on the bike path by a triathlete attempting to break'",
        "'speaker_8': 'the land speed record. But their use of the bike path wouldn't have run afoul of the ordinance as it was presented earlier in might have realized some other injuries along the way. I also will note that I have a separate folder of photos on my phone that I take of cars, trees, street lights and other things like'",
        "'speaker_8': 'that, blocking my ways while I walk around the city. Any any time I see a car, you know, parked on the hood in my neighborhood, the ramp in front of their driveway that blocks my access to walk on my sidewalk.'",
        "'speaker_8': 'I take a picture of that and report it where I can. So the issues of dumping scooters, to me, not really that big of an issue when I have cars and street lights and other things like that that I need to regularly contend with.'",
        "'speaker_8': 'And I'm a fairly able bodied person. So I only imagine what it's like for folks who need to use assistive devices to get around. Anecdotally, cities across the country that have adopted scooter pilot programs have found that a lot of the users of these vehicles are overwhelmingly young and of color.'",
        "'speaker_8': 'So ordinances like bans, which obviously has changed now, are just another way to add to the list of justifications used to hassle young, black and brown neighbors to keep them from getting to where they need to go. And the same is true for a lot of other assistive and mobility devices.'",
        "'speaker_8': 'So thanks for the comments. Obviously, things have changed a little bit, but we appreciate it.'",
        "'speaker_2': 'Thank you. Next, bigger.'",
        "'speaker_10': 'My name is John Cannon. And not to be redundant, but I'm here for the same reason to thank you for removing the Class two ebikes from the list of things that might be prohibited in the future. I ride a bike often and I'm sort of representing seniors, I guess, at this point in time, because all those young'",
        "'speaker_10': 'people that came up here and they ride them and what they said, all true. I've been riding on the Long Beach path for 17 years. Not any bike all the time. I used to be able to ride a real plain old, hard working bike, but I'm considered a senior.'",
        "'speaker_10': 'And that means seniors definition is you're old, so you can't do things like you used to do. I like to. I would love to, but it doesn't happen that way. So I came across the e-bikes and was quite happy to find them and I've been writing them along with a group of seniors, mostly locally, and we do'",
        "'speaker_10': 'come on the Long Beach path. Often we stop and eat at your restaurants. So we're bringing some business into the community as well. The the throttles that are on those bikes actually are like a.'",
        "'speaker_3': 'And a.'",
        "'speaker_10': 'Excuse me, an accommodation for safety. I use it when I start up my ride and. To get a start. It's because it's too hard to get started on pedaling and that gives me the start I need. Then I can pedal and I have pedal assist to help combat the throttles are also helpful in I am sorry to'",
        "'speaker_10': 'keeping balance at times and we don't generally use them for racing or anything else. I never have done that, but I just want you to know that for seniors, these bikes are have been extremely helpful. Many, many people that have different kinds of ailments or artificial knees backs bolted together, all of which I have.'",
        "'speaker_10': 'I've had a heart attack. I have asthma, I can still ride a bike and I'm going to keep riding as long as I can. I don't want to have to ride on the streets. It's too dangerous. So I appreciate your consideration to continue to allow class to e-bikes on the paths.'",
        "'speaker_2': 'Thank you. Thank you. Next speaker.'",
        "'speaker_10': 'Thank you, Vice Mayor and City Council. And I want.'",
        "'speaker_0': 'To thank Council Woman Price for reconsidering.'",
        "'speaker_10': 'The class.'",
        "'speaker_8': 'Two E-bikes. My name is Brian Ballard.'",
        "'speaker_10': 'I'm co-owner of.'",
        "'speaker_0': 'Pedal Electric Bikes with Beth Black, who you just heard of. I want to read a statement here real quick. I've been a type one diabetic for 45 years.'",
        "'speaker_10': 'I work in the health care industry. And in addition to.'",
        "'speaker_0': 'Owning the bike shop and I do diabetic education and I do diabetic support groups. About nine years ago, Beth and I were riding on a regular pedal, pedal bikes. We were about ten miles from home, and my blood sugar started dropping rapidly.'",
        "'speaker_0': 'Fortunately, I had some couple.'",
        "'speaker_8': 'Bottles of.'",
        "'speaker_0': 'Juices. I had.'",
        "'speaker_8': 'To lie on the.'",
        "'speaker_0': 'Grass waiting for my blood sugar to rise.'",
        "'speaker_10': 'However, the experience scared.'",
        "'speaker_0': 'Beth and I both, and we did not ride regular pedal bikes for a while. About a year later, Beth and I.'",
        "'speaker_10': 'Discovered electric bikes.'",
        "'speaker_0': 'I was excited about this because I was able.'",
        "'speaker_10': 'To ride a long distance and not worry about pedaling home. If my sugar dropped, a low blood sugar can be deadly if not treated quickly. High blood sugar does not kill you immediately, but contributes to long term complications.'",
        "'speaker_0': 'Having to pedal a regular bike or pedal a class.'",
        "'speaker_10': 'One electric bike while my sugar is low.'",
        "'speaker_0': 'Can still drop my glucose drastically. Having a throttle to get me somewhere where I can get.'",
        "'speaker_10': 'Something to eat or drink without pedaling is a benefit and.'",
        "'speaker_0': 'Helping me prevent my hyper hypoglycemia.'",
        "'speaker_10': 'From getting worse. Beth and I have owned two electric.'",
        "'speaker_0': 'Bikes now for eight years.'",
        "'speaker_10': 'In addition to owning the electric bike shop. Since I started writing my electric.'",
        "'speaker_0': 'Bike, I worry less about.'",
        "'speaker_10': 'My sugar dropping too low.'",
        "'speaker_0': 'When I'm writing. And yes, I do get exercise on my class to e-bike.'",
        "'speaker_10': 'As you just heard the speaker before, me too occurred. To control diabetes, you need exercise, diet and medication. My class to bike motivates me to exercise.'",
        "'speaker_8': 'Gives me peace of mind.'",
        "'speaker_10': 'And when I'm writing, it helps me control my blood sugar. Exercise is hard. My father was a runner and a marathoner. He once told me, You have to make exercise fun for people to do it.'",
        "'speaker_0': 'Well, class two e-bikes do make exercise fun. Also.'",
        "'speaker_8': 'Many of our.'",
        "'speaker_10': 'Customers are seniors. Many seniors have orthopedic problems, a hip replacement, knee replacement. And many of their doctors tell them, we want you to.'",
        "'speaker_0': 'Exercise with.'",
        "'speaker_10': 'Caution.'",
        "'speaker_0': 'These bikes allow those orthopedic patients to exercise without overdoing it.'",
        "'speaker_10': 'And these are perfect for those seniors. Patients who do have knee problems, hip problems. Thank you once again for reconsidering the.'",
        "'speaker_8': 'E-Bike situation.'",
        "'speaker_10': 'On this subject.'",
        "'speaker_2': 'Thank you. Thank you. Next speaker.'",
        "'speaker_0': 'Hi. My name is Bob Nolan and I also have a Pedigo Ebike and my wife does too. And that was one of the reasons why.'",
        "'speaker_12': 'We.'",
        "'speaker_0': 'Started writing down here is we wanted it to be both our exercising. My wife has a bad back. And I have bad knees and the pedagogs allow us to get on the bike path and ride. She pedals more.'",
        "'speaker_0': 'I throttle more, but I still pedal. They just help us have mobility. And as far as I know, in our group. No one has has run into anybody. And we are just super cautious. We wear helmets, we follow the speed limits.'",
        "'speaker_0': 'So and I'm glad that you folks have looked at. The changes that might be needed. Scooters. Yeah, they do zip around you. But we actually have breaks. We have. I bell's to let people know we're behind them so.'",
        "'speaker_0': 'In summary, I just wanted to say thank you for reconsidering this. Thank you.'",
        "'speaker_2': 'Thank you, sir. Next speaker.'",
        "'speaker_18': 'No. Mr. Dean. The Vice and the city council to. We are always concerned about the. But. No more Palm Springs. I think the boat, the pismo wait is to solve this is to make a better law. Little red riding in the street.'",
        "'speaker_18': 'I think that's worth it to go down and meet these spray bys, be legally for leaving. Well, I know people hear me on the tape. Tell me tomorrow. I know we are and it is certain A-word out. When I think of fans, they save the import.'",
        "'speaker_18': 'They can write it or. Not that they've decided on that beach. I think that there's a lot more riding in the street. They can ride illegally in the street and everything will be okay. Right. And in the long.'",
        "'speaker_18': 'If they can. If they they can be respectable riding in the street. And if they can be respectable and riding. Without breaking the loading so much run. I think running illegally in the streets and being more safe.'",
        "'speaker_2': 'Thank you, sir.'",
        "'speaker_18': 'Thank you to the council for listening to me tonight. Good night.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_8': 'Good evening, counsel. My name's Thomas Lord. I'm the general manager for Lime. We're one of the operators in the pilot. I think that this conversation's obviously evolved quite a bit since the original agenda item. Um, and I think you guys are on the right track.'",
        "'speaker_8': 'Um, there seem to be two issues. One is the leaving of scooters on the beach and the other is, you know, speed. Um, there I can speak for lime. We definitely have the technology to address both of those.'",
        "'speaker_8': 'I think one thing to keep in mind is that there are operators that do not have that technology. And in turning that technology on, we then put ourselves in a no bird has the technology as well at somewhat of a competitive disadvantage from a consumer experience.'",
        "'speaker_8': 'Um. You know, if you're if you're writing a line and it doesn't work on the beach or you're writing another company, and it does, you're going to continue to read the other companies. And so revisiting the pilot and asking operators to if they have the technology to turn it on.'",
        "'speaker_8': 'I would also ask that you either somehow penalize operators that, you know, refuse to or don't have that technology to put on. But that's it for me. Thank you.'",
        "'speaker_2': 'Thank you. 1/2, please.'",
        "'speaker_14': 'I had just a follow up question. You said you do have the technology to be able to to cut them off or not make them inoperable. Do you have that? Does the technology afford you the ability to govern the speed?'",
        "'speaker_8': 'Yes. So actually, the technology we we have the technology to stop them, although we generally, as a policy don't do that because we find it unsafe. The speed is the solution that Santa monica went with. So we govern them on the beach in Santa monica at eight miles per hour.'",
        "'speaker_8': 'Um, along with that, we also do what we call no chip. No chip. And which is you can't begin a trip on the beach path. Um, and no trips stop, which is you can't stop your trip on the beach.'",
        "'speaker_8': 'So you would kind of address your problem of a lot of scooters being left on the on the path.'",
        "'speaker_14': 'Thank you. And I appreciate you being here this evening.'",
        "'speaker_8': 'Yeah, good to be here.'",
        "'speaker_2': 'Thank you, sir. Anyone? Yes. Go ahead. Miss me. Councilwoman.'",
        "'speaker_4': 'Two things. One, appreciate your coming today and being open to answering some questions. Your competitive advantage would be that because you followed the rules, you're in a better position to actually have a long term contract with our city.'",
        "'speaker_4': 'Yeah. And I guess my question would be, what would we need to be providing you as a city to create those geo fences? Or when you check it out on the app, would it be able to say like, note, you're near Eldorado Park, don't leave a thing on the beach path or you will be fined or I'",
        "'speaker_4': 'mean, could you do pop up messages of any kind?'",
        "'speaker_8': 'Yeah. So we can do it, not messages that that describe what what's what's happening. So if someone isn't confused, I think that what we've seen in in the past is that a lot of cities will say, you know, during our pilot, if you do X, Y and Z, you won't be considered for for, you know, the permanent'",
        "'speaker_8': 'program and then you're still considered for the permanent program.'",
        "'speaker_5': 'Yeah.'",
        "'speaker_8': 'So I think that it needs to kind of like. Concrete like this is what's going to happen if you if you don't. And so that all we're all on the same same page. That would be my suggestion. But I do see that as a competitive advantage for the long run.'",
        "'speaker_8': 'It'd be shortsighted not to consider that. Right.'",
        "'speaker_4': 'So just so you know, on any given Tuesday, we can change the laws by five votes on this council so we can say anything we want. This week and next week, five votes changes the law. So that's just how local government is.'",
        "'speaker_4': 'But I appreciate you and thank you for your feedback. And my office will probably be reaching out.'",
        "'speaker_8': 'Thank you. All right. Thanks, guys.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Next Vice.'",
        "'speaker_4': 'Mayor and.'",
        "'speaker_5': 'Members of the city council. My name is.'",
        "'speaker_9': 'On a consolidated man. I work for a government.'",
        "'speaker_4': 'Relations firm sanctioned by we represent Bird.'",
        "'speaker_6': 'I want to thank Suzy Price and the rest of the council for tonight's motion.'",
        "'speaker_5': 'We really appreciate that.'",
        "'speaker_4': 'We look forward to working with the Transportation Committee. Craig, your your office has been great and so we're looking forward to working with you.'",
        "'speaker_6': 'We believe that our client has gone way and beyond to reach out to most of the organizations.'",
        "'speaker_5': 'In.'",
        "'speaker_4': 'Various neighborhoods to make sure that we're a community partner. We want to continue to do that. So thank you for tonight.'",
        "'speaker_2': 'Thank you, Mr. Chairman. Councilman Richardson and Councilman Gordy.'",
        "'speaker_4': 'I also just wanted to thank you all for listening to the discussion and adjusting your comments. Oftentimes, people come to council and they're dead set on communicating what they came here to communicate despite the changes. And I think that one of the things that we really try to do on this council is start a dialog.'",
        "'speaker_4': 'Even if the original policy might be the most extreme, but to at least give us a range, an understanding of where we can go. And so I hope that you'll communicate back out to your constituents in the same way you did before to let them know where we are and what additional opportunities there will be for input'",
        "'speaker_4': 'and advocacy. Thank you.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_15': 'Thanks. I just wanted to raise up one thing that I just heard from the gentleman from lime. So you said you can you have the ability to limit stops, made trip stops in a geofence area. So what happens if someone gets off the you know, gets off the, you know, the bike?'",
        "'speaker_15': 'And goes to the beach and hangs out. Do they continue to get charged while it's just sitting there? Because that's a pretty good penalty.'",
        "'speaker_8': 'Yeah, that's exactly what we're. What would happen? So you wouldn't it would give you an error code in the error code would explain you're in an area where you can't and the chip and if you were to leave it in the the sender on the on the path, you would continue to get charged.'",
        "'speaker_15': 'And how have you implemented that somewhere in Santa monica? And do you have any evidence of, you know, what the response was or the behavior change? I mean.'",
        "'speaker_8': 'It's tough to to measure that because you could continue to ride at eight miles per hour through that geofence. It has drastically changed the scene in in Santa monica. You know, it went from Santa monica having to use a lot of their.'",
        "'speaker_8': 'Resources to have enforcement on speed and stuff like that to I think it's drastically come down.'",
        "'speaker_15': 'Thanks. Thanks. Thanks for that point. Staff. That's a great point. If we're going to evaluate something in the pilot, I want to know if we deploy something like that, what the what the impact is. That's what I'd like to see.'",
        "'speaker_15': 'If, you know, we may not have to create a fine, we can literally just have the clock keep running if they don't park it the right way. Seems like a good idea to me.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract, and any necessary amendments, with SCI Consulting Group, of Fairfield, CA, to study the feasibility of establishing a benefit assessment for vector control services, in an amount not to exceed $200,000, for a period of one year, with the option to renew for two additional one-year periods, at the discretion of the City Manager.  (Citywide)": [
        "'speaker_2': 'Thank you. Senior morning comments which placed catchable. And now she can substitute motion. Right. Thank you. Okay. Let's go down to item 21, 22. Excuse me.'",
        "'speaker_1': 'Item 22 Report from Health and Human Services recommendation to adopt a resolution to execute a contract with SDI Consulting Group to study the feasibility of establishing a benefit assessment for vector control services in an amount not to exceed 200,000 citywide.'",
        "'speaker_2': 'Well, probably coming from this item.'",
        "'speaker_12': 'Mr. Vice Mayor, council members, this is something we've been talking about for about the past five years.'",
        "'speaker_8': 'And Health and Human Services.'",
        "'speaker_12': 'To help them regarding their budget, which gets pretty tight. So we're asking permission to look into this program and come back to the city council with results. I'm going to turn this over to Kelly Collopy and Nelson Kerr.'",
        "'speaker_3': 'Good evening.'",
        "'speaker_11': 'Honorable vice mayor and council members. I'm going to ask Nelson Kerr, who's our bureau manager for Environmental Health, to share a little bit about the program that we're going to be moving forward with and that consultant, and then we'll be open for questions.'",
        "'speaker_8': 'Okay. Thank you. The item before you tonight, council is a request for approval for the Health Department to enter into a contract with the engineering consulting group SCA. The purpose of the agreement is to study the feasibility of establishing a benefit assessment to fund vector control services in parts of the city that are not currently covered by'",
        "'speaker_8': 'a benefit assessment. This area represents over 60% of our city, including areas in north Long Beach, west, Long Beach, south and southeast Long Beach. And there should be a map attached with your item. And you can also note that the whole East Side is covered by Greater Los Angeles Vector Control District.'",
        "'speaker_8': 'To be clear, the order before you tonight is wanting to explore the level of support among parcel owners for such a benefit assessment. And we would need a simple majority from those folks eventually to approve it. We will return to council with a recommendation on whether or not to move forward within 3 to 6 months.'",
        "'speaker_8': 'Just a little bit of background. As our world becomes more connected, we are seeing more new vector borne diseases that have been previously unseen in Southern California. We're seeing these diseases emerge, such as West Nile virus, Zika, and now again with Saint Louis encephalitis.'",
        "'speaker_8': 'Just recently, the developments of emerging vectors and diseases reinforce the need for a sound public health vector, public health oriented vector control programs to protect our most vulnerable residents against these emerging diseases are emerging vector control issues are more resource intensive and require highly specific approaches that tend to be more labor intensive and research focused and past'",
        "'speaker_8': 'issues that we've dealt with. For example, addressing the AIDS aegypti mosquito that we've recently discovered in Long Beach required door to door education and outreach and in certain impacted neighborhoods as well as extra staff. Time for researching new approaches to address these new threats.'",
        "'speaker_8': 'The benefit assessment, if if supported, eventually would provide Long Beach Health Department's vector control program with a sustainable and dedicated source of funding for a stable and long term comprehensive vector control program. If there is adequate support, the General Fund and Health Fund would save a significant amount of revenue which could be freed up for other uses'",
        "'speaker_8': '. And vector control in Long Beach would have a dedicated and sustainable funding source to guarantee sustained services to protect our residents and visitors from these emerging diseases. This concludes my report.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilwoman Pierce.'",
        "'speaker_5': 'Thank you. I want to thank staff for their work on this. I know it was an area that I was not well-educated on before having my briefing with, uh, with our director of our health department and looking at the map, I think it is really eye opening to see how much of our city is not covered by'",
        "'speaker_5': 'the county. And so I fully support, you know, this discussion and moving forward with this. I wanted to ask, you know, should this happen, should this go forward? And they assess what what do you see possible for our for the budget, for the health department.'",
        "'speaker_5': 'I know we talked briefly about this. I guess I understand that it would free up some moneys in our health department.'",
        "'speaker_0': 'Well, that's a good question.'",
        "'speaker_8': 'And the the engineering firm that we're working with will be conducting what we call a scientific survey, and that will determine the level of support among the parcel owners. And depending on what level that is, these these benefit assessments for vector control are generally inexpensive, running between ten and $20 per year.'",
        "'speaker_8': 'So if we were to we have about 100,000 parcels in play here. So we would if it was a low amount of support, we could maintain our program status quo, but we would have a sustained funding source and it would also free up money from the health fund where they wouldn't need to support our vector control program'",
        "'speaker_8': 'anymore to the tune of approximately $500,000.'",
        "'speaker_5': 'Okay, great. Thank you for that. Appreciate it.'",
        "'speaker_2': 'Thank you. Councilman Richardson.'",
        "'speaker_15': 'Thank you, Vice Mayor. So is the idea that you would pull areas that don't already have a vector control district or if you have overlapping vector control districts, will still pull those areas as well.'",
        "'speaker_3': 'This would be this would be only.'",
        "'speaker_11': 'For those areas that are not currently covered by the Los Angeles area district. So Ann Compton as well. So those two are already covered and we would cover the remaining. Okay.'",
        "'speaker_15': 'And I was going to raise up the Compton Creek Mosquito Abatement District. I didn't hear that earlier. So and I'm curious to know which area. I know that North Palm Beach has the Compton Creek Mosquito Abatement District. I know that we appoint a representative there.'",
        "'speaker_15': 'I know that I receive outreach from them. But I'm curious to know how much of North Long Beach is in that district or would be in the city potentially this district? In theory, I think this is smart to, number one, acknowledge that we have a health department and we need to take steps to to engage them so'",
        "'speaker_15': 'they can better inform our residents on how to how to remain safe. I think that makes sense. I also think, you know, with our ongoing conversation about identifying structural ways to support the health department in its work, I think this makes sense.'",
        "'speaker_15': 'And I think finally, this is a smart approach to engage in the scientific survey to see if it's even feasible for all of those reasons. This is smart and I support it. Thanks.'",
        "'speaker_8': 'Councilmember, to answer your question. Compton Creek covers the extreme north west corner, which we would call the coolies triangle. About maybe about 10,000 people in that area are covered by Compton Creek, which is just a very small portion of the Compton Creek Creek.'",
        "'speaker_8': 'Mosquito Abatement District.'",
        "'speaker_15': 'Clarification. It's not just the coolest triangle that the coolest triangle. That means you get the College Square Star King and Longwood Neighborhoods. Just want to be clear on that. That's three neighborhoods, four neighborhoods, things.'",
        "'speaker_2': 'When it comes to immigration. Okay, fine. I know I'm asking either, sir. Yeah, I'm fine. Okay.'",
        "'speaker_4': 'WOMAN Yes. Nearly all of the fifth district is already covered by L.A. County. And so I'm not really. For or against this at any time, but I will support the item for the feasibility study. But it would not impact that district.'",
        "'speaker_4': 'It would actually. Currently, the fifth district is paying for vector control and receiving vector control. And so it's almost as if you don't do this. The Fifth District's actually double taxed. So things.'",
        "'speaker_8': 'Huntsman Soprano responded to that last comment. The fourth District is a little more complicated. The border between Long Beach and L.A. County is Lakewood Boulevard and then PCH from South, a traffic circle. So about splits the fourth District in half.'",
        "'speaker_8': 'So I'm just curious. So. Mr. Kirk so so the the county system doesn't get changed at all or we wouldn't even have the authority to do that. So this Long Beach. Well, the results of the study show that we'll have a similar system to L.A. County's.'",
        "'speaker_8': 'Ah, how does it work? Yes, the. The services would be large, largely similar. However, we would have some as a health department, we would have some expanded services in our assessment area. However, we would also provide those same services in the greater L.A. area.'",
        "'speaker_8': 'Any any service that Greater L.A. doesn't cover, we would cover in greater Los area. My next question is, does it make sense to have these dueling systems if we're going to convert part of Long Beach, this is it.'",
        "'speaker_8': 'We just don't want to bite off that much at this point. The in order to have the city health department cover the entire city, it would be a very complex process involving LaRocco in a changing of district borders.'",
        "'speaker_8': 'And I don't know that there's an appetite with greater Los Angeles or Compton Creek at this point, but perhaps we could discuss that at a later date once we get our assessment done.'",
        "'speaker_2': 'Okay. Thank you. Yes. This comes from last year.'",
        "'speaker_14': 'Thank you so much and I appreciate the great questions. I'm going to be supporting this item because I think it's it's as Councilmember Richardson said, it's smart for us to at least look at this. I do have a question regarding a comment made earlier regarding the how are vector control program is currently the current cost and the'",
        "'speaker_14': 'impact of on the general fund. What are we looking at in terms of general fund today?'",
        "'speaker_17': 'So currently the.'",
        "'speaker_11': 'The vector work is funded through our Health Department's Realignment.'",
        "'speaker_3': 'Fund. So that is that that is a.'",
        "'speaker_6': 'Small portion of funding that we receive.'",
        "'speaker_3': 'From state that we.'",
        "'speaker_11': 'Utilize for all services not covered through grants so that the current budget for us that is about.'",
        "'speaker_3': '50 little.'",
        "'speaker_11': 'Over half million dollars. In addition and then in the general fund is another approximately.'",
        "'speaker_10': '$100,000.'",
        "'speaker_3': 'That we that is.'",
        "'speaker_11': 'Build back to the general fund for certain services requested by the department.'",
        "'speaker_14': 'Okay.'",
        "'speaker_8': 'And then I was just going to add that, that if we were to achieve the benefit assessment, we would no longer need to charge those services to the general fund. So the general fund would realize that $100,000 savings.'",
        "'speaker_14': 'Great into councilmember supernovas. Just to follow up on his point regarding the the county, obviously, you know, we prefer local control, but I'd like to at least understand what the what the options would look like. I mean, if if that was an expanded service with L.A. County for for the taxpayers.'",
        "'speaker_14': 'Right. We want to make sure that they are getting the biggest bang for their buck with the and the bottom line is, it's it's the delivery of services. And so I really I mean, his question was was was a good one.'",
        "'speaker_14': 'I think it should be explored as well, but I'll be supporting this item.'",
        "'speaker_2': 'Thank you very much. Is there any more any or no, any more that any public comments on this item? If not, would you please cast your vote?'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_2': 'Item 24. 23. Excuse me, I'm 23.'"
    ]
}