{
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract, and any necessary documents including any necessary subsequent amendments, with Tevora Business Solutions of Irvine, CA, for the creation of the Resident ID Management pilot system for residents to access multiple City of Long Beach services, at no cost to the City, for a maximum six-month pilot period.  (Citywide)": [
        "'speaker_0': 'The motion is carried nine zero.'",
        "'speaker_3': 'Thank you. And then we'll hear item 13, please.'",
        "'speaker_0': 'Item 13 is a report from technology and innovation. Recommendation to adopt resolution authorizing the manager to execute a contract with Tavira. Business solution for the creation of the Resident ID Management Pilot System for residents to access multiple services at no cost to the city citywide.'",
        "'speaker_3': 'If a motion by councilmembers in Dallas and Councilwoman SA councilman's in Dallas.'",
        "'speaker_1': 'Thank you, Mia. I would like a brief staff presentation on this, if possible.'",
        "'speaker_5': 'Yes. I'd like to introduce Lia Eriksen, our new Our Tide director, to make a brief staff report on this item.'",
        "'speaker_2': 'Thank you, honorable mayor and members of the City Council. With the approval of the City Council, the Technology and Innovation Department will be engaging in a small pilot project to enable single find on access for two or more of the city's public facing applications.'",
        "'speaker_2': 'The ultimate goal is to create a community friendly, web based portal for accessing resident facing applications and to provide the one beach community with the ability to sign into multiple city applications while eliminating the need for a separate login information for different city services.'",
        "'speaker_2': 'This initiative stemmed from a city council action in late 2019 to explore opportunities to streamline resident connectivity and access to city services. In the aftermath of the COVID 19 pandemic.'",
        "'speaker_5': 'Providing simple and accessible digital.'",
        "'speaker_2': 'Services is critical for all Long Beach stakeholders and residents. This pilot opportunity is part of the city's 2021 Smart City Challenge, which follows the principles of a challenge based procurement, where city staff articulate their challenge without prescribing how they want to solve, and interested submitters have the opportunity to respond with a proposed solution.'",
        "'speaker_2': 'City staff reviewed submissions from.'",
        "'speaker_5': 'Multiple vendors before landing.'",
        "'speaker_2': 'On to More Business Solutions, which is an established leader in cybersecurity and identity and access management. Tibor is partnering with OCTA, an industry leader in identity management solutions for the pilot. The pilot services by two board business solutions will be provided to the city at no cost.'",
        "'speaker_2': 'The pilot period will last 4 to 6 months, at which point the city will make a determination based on pilot success and IDs of funds available with how to proceed. With that, I conclude my report and I'm happy to take any questions.'",
        "'speaker_1': 'Thank you very much for that staff report. Leon. That was very helpful. I know I've been getting calls about this item in my office, so I really appreciate the staff report.'",
        "'speaker_3': 'Thank you. Councilman, sorry. When you think.'",
        "'speaker_2': 'That I just support the item.'",
        "'speaker_3': 'Any public comment?'",
        "'speaker_2': 'Mayor Garcia?'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Yes, absolutely, councilman.'",
        "'speaker_2': 'Thank you. This comes from a couple of community input things that happened back before the pandemic, where we discussed the challenges for residents when they have so many different systems. I think that this, along with the potential to merge other systems into one, is really a way for us to have one footprint moving towards what I know'",
        "'speaker_2': 'the mayor was very, very supportive of, which is a 24 seven online city hall available to residents at any time to make requests and recommendations and reports. So I really want to thank the tie department and all of their work.'",
        "'speaker_2': 'I think that we are moving forward and making it more accessible for residents to interact with the city and the more accessible that we can be, the better we can provide service. Thank you.'",
        "'speaker_3': 'Thank you so much, Councilwoman. Attorney public comment.'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item 13, please line up at the podium. If you were in the zoom, please use the raise hand feature now. In person. You have 3 minutes.'",
        "'speaker_6': 'Thank you again. Thank you for the staff report and for requesting it from the council. One of the things that was mentioned is that after the Orange County Transit Authority is one of the partners with this pilot. That's interesting.'",
        "'speaker_6': 'And what's more interesting is which specifically which public facing applications for the applications that have unique and sensitive resident data we're talking about specifically, are we talking about gas bills, talking about sewage bills, water bills? Are we talking about being able to call the city with the city calendar?'",
        "'speaker_6': 'You know, like, what is this for? But also, you know, I mean, the Smart City Challenge bid process, you know, I mean, there's a lot of different way to do these things. But but generally speaking, I mean, you know, why is it that this just happened to be the first real action coming out of the data privacy'",
        "'speaker_6': 'initiative by this very same city commission? Presumably, there's simpler ways hiring people. To achieve these same goals during the six month maximum pilot period. I personally, I think this item should be opposed and not even not even voted up.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_2': 'Hello, Karen Reside. I'm the president of the Long Beach Gray Panthers. And all these technology issues that are coming forward, we have a lot of concerns and our members have a lot of questions about what's involved. We would definitely like to see more community outreach and discussion on these initiatives, particularly for low income seniors who don't have'",
        "'speaker_2': 'access to technology. They're being left out of so many things. The event that was held by the DLP, you could only go if you responded to a QR code and no information was distributed to the senior buildings and a lot of the seniors, only 10% of the people that live in the senior buildings have access to technology'",
        "'speaker_2': '. So last I looked, I thought we were members of this community too. And all these things that are leaving out the seniors we are objecting to. And seniors need to understand more about what these initiatives are going to involve.'",
        "'speaker_2': 'And I'll be speaking later on the fire incidents. So, I mean, there are so many gaps for seniors and we need to start addressing them. This is just not acceptable.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'We have a motion in a second to approve the item roll call vote.'",
        "'speaker_0': 'Councilwoman Cindy has.'",
        "'speaker_2': 'I am.'",
        "'speaker_0': 'Councilwoman Allen. I'm Councilwoman Pryce. Councilwoman Price.'",
        "'speaker_2': 'I. I.'",
        "'speaker_0': 'Councilman Sabino.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman Sara. I. Councilmember Oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_7': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'The motion is carried nine zero.'"
    ],
    "Recommendation to increase appropriations in the General Fund Group in the City Manager Department by $500, offset by the Eighth Council District One-time District Priority Funds, transferred from the Citywide Activities Department to provide a donation to Khalo Creative LLC to support the Absolute Best of Long Beach event; and  Decrease appropriation in the General Fund Group in the Citywide Activities Department by $500, to offset a transfer to the City Manager Department.": [
        "'speaker_3': 'Thank you very much. We have a fund transfer items 28 and 29.'",
        "'speaker_0': 'Item 28 Communication from Councilman Austin. Recommendation to increase appropriation in the General Fund Group in the City Manager Department by 500 to provide a donation to Kahlo Creative. And item 29 is a communication from Council Councilwoman Price recommendation to increase appropriations in the General Fund Group in this event in the City Manager Department by 500 to provide'",
        "'speaker_0': 'a donation to Carlo Creative.'",
        "'speaker_3': 'Thank you. I got a motion in a second. Councilman orson, any comments? Councilman in dallas. Is your public comment at there?'",
        "'speaker_5': 'Any members of the public that would like to speak on item 28 or 29? Please line up at the podium. If you're in the zoom, please use the raise hand feature or dial star nine now. See none. That concludes public comment.'",
        "'speaker_3': 'Okay. Thank you. We do have to roll call.'",
        "'speaker_2': 'Vote, please.'",
        "'speaker_3': 'I'm sorry. Let's see the roll call vote. And we have to make the announcement. Go ahead.'",
        "'speaker_0': 'Councilwoman Sandy has. Hi, Councilwoman Allen. Councilwoman Price. Hi, Councilman Sabrina.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'Councilwoman Mango.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Councilwoman zero. Council Members. Ranga.'",
        "'speaker_6': 'Hi.'",
        "'speaker_0': 'Councilman Austin.'",
        "'speaker_7': 'Hi.'",
        "'speaker_0': 'Vice Mayor Richardson. All right. The motion is carried nine zero.'",
        "'speaker_3': 'Thank you. Okay. And now we have two presentations. I'm going to start with the the anniversary presentation of the L.A. riots. I mention this over to Councilwoman Cynthia.'"
    ],
    "Recommendation to request City Council to receive and file a presentation in recognition of Cambodian Genocide Remembrance Day.": [
        "'speaker_3': 'Thank, thank you, Mary said. Well, we will. We'll chat with you on the site. Thank you, Mary. Next up is item number 14.'",
        "'speaker_0': 'Adam, 14, is communication from Councilwoman Sara recommendation to request City Council to receive and file a presentation in recognition of Cambodian Genocide Remembrance Day.'",
        "'speaker_3': 'Thank you. I'm going to go out and turn this over to Councilwoman Sara.'",
        "'speaker_2': 'Thank you, Mayor. I want to thank everyone who came out today to commemorate Cambodian Genocide Remembrance Day, as well as our day of mourning. Johnny Depp sought an auctioneer to come on. As a child genocide survivors that was born in a refugee camp.'",
        "'speaker_2': 'It's an honor for me to present this item today. This year it marks the 47th anniversary of the Cambodian genocide. Beginning on April 17th, 1975, the Khmer Rouge government seized control of Cambodia. Khmer Rouge seized control of Cambodia and carried out a series of atrocities that lasted for four years, which was from 1975 to 1979.'",
        "'speaker_2': 'Each year in April, we remember the lives of all those who died and survived. And the Khmer Rouge had executed government officials, doctors, monks, artists, scholars and had forced many into their labor camps. It's been estimated that over 2 million, arguably between 1.5 to 3 million lives were lost due to execution and starvation.'",
        "'speaker_2': 'Tens of thousands were made widows and orphans, and those who lived through the regime were severely traumatized by their experiences. Of those who survived, several hundred thousand fled their country and became refugees resettling in countries across the world which made Long Beach the largest population of Cambodians.'",
        "'speaker_2': 'With strength and resilience, the Cambodian people survive and has been rebuilding the community, our community. Over the decade, Cambodian immigrants and children and their descendants have enriched the city in countless ways. It's becoming grocers, owning restaurants, as well as becoming public servants, working in firefighter the fire department to our city clerk office, to our various depart as'",
        "'speaker_2': 'city attorney office. So as we forge our path forward, we remember the tragic history that brought so many of our elders here and those who survived. So let's share our story today. As far as those who are going to be making public comment, we cried and got creative there and remember the tragedy and our history to ensure'",
        "'speaker_2': 'that what happened is never repeated. And to think about those and support those who are going through this challenging period right now. So I want to thank the Killing Field Memorial Center for their work for ensuring that they continue to remember April 17th every year by and now by creating the Killing Fields Memorial Garden.'",
        "'speaker_2': 'The genocide in Cambodia is referred to as the Killing Fields because it was the site of where people were killed and buried. And and they're building this garden to ensure that we always have a place to honor those whose lives were lost and those who survived.'",
        "'speaker_2': 'And so due to COVID, they're project was delayed. But I'm just so happy to share that they broke ground recently and are starting the construction process. So just honored that I was able to join their commemoration event that they hosted every year and it was beautiful and a moving and I look forward to continue to support the'",
        "'speaker_2': 'Killing Field Memorial Garden so that we can have a place where we can mourn and remember. I want to thank KPA also for hosting a great event Sunday evening. And today's presentation, we're going to have some public comments and a song in the end called Bong Saavedra.'",
        "'speaker_2': 'I think a hand that was given to you so you could follow along either try to sing along in my in an interpretation in English. Just wanted to share that this was written by the late Cambodian monk Chun not who preserved the camp.'",
        "'speaker_2': 'My language and identity. And. And some of his greatest achievement were his effort to kung to conserve the Khmer language in the form of the first my dictionary and one of his most well known ballad is this Bong Sabado My or my history, which is what will be sung and the song the song will be sung by'",
        "'speaker_2': '. I just want to thank Charles Song and Dr. Lee and Peng Long and Boo songs for some song Tay who will lead the group in the song later on. So thank you again so much for being here as we honor and remember April 17th.'",
        "'speaker_3': 'Thank you. Vice me, Richardson. Second on the motion shot.'",
        "'speaker_6': 'I'll just add.'",
        "'speaker_4': 'First of all, thank you, Councilwoman Ciro, for bringing this presentation forward. I think remembrance is incredibly important, not only just to honor those that you've lost in the past, but also so that we can learn from the past in order to chart a better future for the next generation and generations to come.'",
        "'speaker_4': 'So thank you for bringing this forward, and I look forward to the presentation.'",
        "'speaker_3': 'Thank you. Councilman in the house.'",
        "'speaker_1': 'Thank you, Mayor, and thank you, Councilwoman Ciro, for for bringing this presentation forward. I think it's very, very important. It's important to know our history in order to learn both from the bad and the good that has happened or in this case, the horrors that happened in the past.'",
        "'speaker_1': 'This part of history tells the story of millions of lives that were lost during the bloody regime. But it also tells the story of the survivors, thousands of which fled and began to build a new home for their families in other countries, including here in Long Beach.'",
        "'speaker_1': 'Thus, though, this anniversary may bring back memories of a period in history filled with so much devastation. There is a purpose here in honoring the courageous and resilience of all of those who survived. I am proud to live in a city that is home to so many of these survivors.'",
        "'speaker_1': 'Our Cambodian population in so many ways continues to strengthen and enrich our city. And I'm proud to see our city council honoring this day, recognizing the history and honoring all the beautiful and strong Cambodian communities that we have here in the city of Long Beach.'",
        "'speaker_3': 'Thank you. Councilwoman Pryce.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And thank you, Dr. Charo, for bringing this item forward. I love to hear the history that we all have, as tragic as and painful of a history as it may be for some of us, those of whom especially who immigrated here, were refugees.'",
        "'speaker_2': 'I, I very much appreciate hearing those stories and seeing the diversity of our city and the struggles that we all have gone through to get to this point, the histories that we all have, and the context that that creates for us to also from a place of commonality, not a place of difference.'",
        "'speaker_2': 'And I'm so appreciative of the opportunity to learn about your specific background and history, about the sorrow, but also that of the Cambodian community with whom I've had the opportunity to learn from and grow with. Just during my service on the City Council.'",
        "'speaker_2': 'I very much support this item. Appreciate you bringing it forth. Sometimes in politics and in the day to day, we forget to stop and remind ourselves of how important it is to embrace the history of the cultures that we all have and not be dismissive or shortsighted about them because they make the values that we all have'",
        "'speaker_2': '. And I'm so grateful for the Cambodian community and for Dr. Charo introducing so much of their history and culture to all of us as a council. So thank you and thank you, Mr. Mayor.'",
        "'speaker_3': 'Thank you, Councilwoman. Councilman Allen.'",
        "'speaker_2': 'Yes, I thank you, Mayor. And I also am very appreciative of Councilwoman Dr. Sorrow for this item. And I just think everyone for for being here today. The cultural influence of our Cambodian population in Long Beach is something that I am extremely grateful for.'",
        "'speaker_2': 'And as we celebrate Cambodian culture, we must also remember what brought Cambodians here to Long Beach in the first place. There was so much violence and devastation. And just a massive human tragedy. And many refugee refugees came here in search of a welcoming and safe community.'",
        "'speaker_2': 'So I think, you know, to honor the resilience of our survivors, the memories of those that we lost and just all of the mixed cultures that make us great here in Long Beach.'",
        "'speaker_3': 'Thank you. Councilmember Ringa.'",
        "'speaker_7': 'Thank you. And thank you, Dr. Shah, for bringing this forward. We must always remember, never forget. I have had a long history with the Cambodian community since they came here in 1978. I was working at Long Beach State at the time, and I did a study about the impact so of the commuter community into the Long Beach'",
        "'speaker_7': 'Unified School District. So since then, I've been very much involved with with you. I also was the Latino representative when the Centro de la Raza sold the building.'",
        "'speaker_6': 'And the U.S.S..'",
        "'speaker_7': 'United Memory Community bought the building and built their center there. And I was part of that groundbreaking ceremony there and very happy to have participated in a very proud that I was the one that did that transition from a center, La Raza to united Cambodian community.'",
        "'speaker_7': 'It was an awesome experience. And you and you've grown strong ever since then. Very proud to have also hired the first Cambodian chief of staff. My wife was on the city council. She hired the first Cambodian chief of staff in Long Beach.'",
        "'speaker_7': 'Ray Polk was the first cellist of Comorian descent here in Long Beach back in 2000 to 2010. And then Yvonne worked in my office for a short minute, and I think she also worked with Hill Councilmember Sarah. So my my connection with the camera community is strong and remain strong.'",
        "'speaker_7': 'And there's no question that the temple is in the seventh District, which I always, always support. So thank you for bringing this forward. And always remember. Never forget. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Austin.'",
        "'speaker_7': 'Thank you. And I echo all of the words that you've heard thus far. Have a deep respect for the Cambodian community. Any time we remember remember the genocide. It's very humbling. And I think sometimes through through the pain, through through the history, it actually binds us as a community.'",
        "'speaker_7': 'And so this Cambodian genocide remembrance, I can recall just a few years ago was actually during the first. Recognition of it at the Expo building was just seems like a few years ago and we partnered to make that happen.'",
        "'speaker_7': 'Understanding that that Cambodians are citywide here in every district, you are part of the fabric of Long Beach. And again, understanding your history, understanding your plight, understanding the pain and suffering, the trauma that you're. First generation Cambodians went through hearing the United States.'",
        "'speaker_7': 'We should never forget that. We should honor that. And again, I think the understanding and binds us again as a community, I'm happy to support this item. And, you know. I don't celebrate this, but we remember. We will never forget.'",
        "'speaker_3': 'Councilman. I'm just going to. I think obviously everything has been said, but I just want to add a few a few remarks. Obviously, it's important, first of all, to always call out genocide when it happens. And it's important for us to know that throughout human history and throughout the world.'",
        "'speaker_3': 'There have been acts so horrific, an act so tragic and painful that they are genocide. And I don't think anyone uses that word lightly. And the Cambodian people have suffered immensely by the horrific actions of tyrants and their own government.'",
        "'speaker_3': 'And so to to be here today, where we have such a flourishing community in Long Beach, and I've always said it's one of the best things about Long Beach and that we're here to honor an important portant time in our history that we have learned from and we continue to learn from, but also recognize the horror and'",
        "'speaker_3': 'the suffering that is that has come from this time in history is really important. I want to also just just uplift as well that it's really important that the the memorial that is being built get completed and that we have a an important space within our community to commemorate this real tragic time in our world history and'",
        "'speaker_3': 'certainly within the Cambodian people's history. And so very supportive of that. And I look forward to to that process and the completion of of that memorial space. I want to I know this is a huge agenda item. I do have a proclamation I'm going to present to to the group.'",
        "'speaker_3': 'But before we do that, is public comment on this item.'",
        "'speaker_5': 'If there are any members of the public that would like to speak on this item in person, please line up at the podium and in the zoom. Please use the raise hand feature or dial star nine now. You'll have 90 seconds.'",
        "'speaker_6': 'Okay. Good. Good evening. Our old mayor and council members. So I got. No. No. My name is Seward Kim. I live in the fourth district. I'm currently assigned to Fire Station Seven in the sixth District. I am supporting the city's recognition of the Cambodian genocide.'",
        "'speaker_6': 'Remember, Stan? My parents fled from the killing fields in Cambodia and sought refuge in the United States in 1981. They were they were among the over 140,000 Cambodian refugees to find a safe haven in the U.S., making the city of Long Beach, home to the largest Cambodian population outside of Cambodia.'",
        "'speaker_6': 'Under the Khmer Rouge regime, over 2 million lives were lost, including two of my sisters and several other family members. The Cambodian genocide targeted government officials, doctors, artists, scholars seeking to erase the Cambodian culture, which was embodied by tradition, grace and elegance.'",
        "'speaker_6': 'Fortunately, the Khmer Rouge, led by Pol Pot, was unsuccessful in their efforts, thus allowing Cambodia to restart their redevelopment, in turn allowing us to undergo the healing process, a healing process that must include honoring the many lives lost, as well as acknowledging the survivors dealing with PTSD.'",
        "'speaker_6': 'We must honor them by sharing their stories, struggles and sacrifice that the Cambodian culture does, in fact, live on. We must educate ourselves about the tragedies that occurred in Cambodia, so history cannot and will not repeat itself there or anywhere else.'",
        "'speaker_6': 'With that, I am honored and grateful for the city of Long Beach, in which I was born and raised for all the opportunities that was made possible for my family and me. Also thankful for the city's recognition of the Cambodian Genocide Remembrance Day.'",
        "'speaker_6': 'And I'm ready to embrace the healing process. And we thank Councilmember Suzano and my friend Turk Nam for bringing this. Thank you. Thank you.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_6': 'Good evening, honorable mayor and member of member of City Council.'",
        "'speaker_2': 'My name is Pang Long.'",
        "'speaker_6': 'I live here. I'm a resident of Long Beach for 42 years. And in. I live in District six for 36 years. April 17, 1975, is the darkest day for Cambodian people in three years. Eight months, 20 days under the Khmer Rouge regime, more than 2 million lives were lost.'",
        "'speaker_6': 'That is approximately 33% of Cambodian population at the time. 1975 is only.'",
        "'speaker_2': '7.5.'",
        "'speaker_6': 'Or seven and a half million population. Therefore, I am supportive of the recognition of Cambodian genocide, memory and days. April 17. Thank you. Thank you very much.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_6': 'Jury pool. Hello? Good evening, ladies and gentlemen. Respectfully, honorable council member and all of the staff by name to panel Ted. I'm a Cambodian born a former killing field survivor, the longtime advocate activist and a very proud Cambodian American who live and work raising children.'",
        "'speaker_6': 'Now four grandchildren in the city of Long Beach for 40 year. I am today to why my support for the proposal as a special presentation recognition the Cambodian Genocide Remembrance Day that long overdue. I would like to express my gratitude to what's also the official who I understood about the needs of Cambodian people more.'",
        "'speaker_6': 'It's not about politics. It's about a nation who people nearly destroy and survive in the foreign clan. Before we used to question, I said, Are we here to stay? Are we continue to carry out my pack and keep on running?'",
        "'speaker_6': 'Because we got used to round and round and round for our life. The companies have destroy our route, chasing us nonstop. I would say 99.99% of the Cambodian people are here today in this room. It's a victim of the atrocity, an unfortunate Cambodian encounter.'",
        "'speaker_6': 'Now, please help us find peace. Keep peace after United States of America has done the unthinkable. Act by giving us peace of mind.'",
        "'speaker_0': 'Thank you. Your time is up.'",
        "'speaker_6': 'Free and three. Yeah.'",
        "'speaker_0': 'Thank you. Your time is up.'",
        "'speaker_6': 'Please help us.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_6': 'And I can feel District six resident growing up in the central area, I've made uh, uh, a childhood bond with many of the children of the people that you see here. And as a student at Lombard Unified, we were very much, uh, made aware in the nineties about the killing fields and the impact it had had on'",
        "'speaker_6': 'a lot of our neighbors. I know for my family in particular, you know, the fall of PanAm Pan, uh, led to a large increase of people coming into the community. My uncle, uh, had a dry cleaner on 17th and Alamitos, and a lot of the early workers that he had in the seventies were recent refugees trying to'",
        "'speaker_6': ', uh, foundationally rebuild themselves in a new city. And I think that the the atrocity and this attempt to stamp out the intelligentsia of Cambodia was attempted by Pol Pot and the communist regime. Long Beach has been blessed in a similar fashion with the entrance of this community into the fabric of the city.'",
        "'speaker_6': 'And so I just come in support, in solidarity for all of my aunts and uncles here. And, you know, I hope to continue continually in the community and use any opportunity to bridge the gap between the two of us.'",
        "'speaker_6': 'So thank you, Dr. SA, for bringing this item to the agenda. Thank you. Speaker Thank you. Before you start my time, I brought in another survivor of the killing field to get enough time for me to talk. Thank you so much.'",
        "'speaker_6': 'Ottawa Mayor, Vice Mayor and Council Member. I am Charles Song a five time. Genocide survivor. I have a key to this country and a proud Cambodian American Apr 17, 2022 will mark both the 47th anniversary of the Khmer Rouge seizing control of Cambodia and the beginning of the Cambodian genocide.'",
        "'speaker_6': 'On April 17, 1975, was the date the Khmer Rouge marched into the capital city of Phnom Penh, and what happened afterward forever changed the lives of Cambodians. More than millions of Cambodians were slaughtered, executed, hostile to death by the brutal killer wrecking public schools, pagodas, mosque, churches, university, government, building and shop were completely shut down, destroy or'",
        "'speaker_6': 'turn into prison reeducation camps and granary.'",
        "'speaker_0': 'Thank you. Your time is up.'",
        "'speaker_3': 'I thank you, people. Maybe he's speaking for you. I think so. That's.'",
        "'speaker_6': 'The legacy of the Khmer Rouge atrocity is a nightmare for the survivor of the for all of us for generations to come. The Cambodian population have higher prevalence of trauma related mental health disorders. And Cambodians who fled Campbell who fled the Khmer Rouge persecution in the US also have a much higher prevalence of PTSD and other mental'",
        "'speaker_6': 'health issue. As a former refugee, we have endured a painful memory. Our resilience allow us to transform our lives successfully in the beautiful country, particularly in this city that has not only accept us with heart, but hope to inspire others.'",
        "'speaker_6': 'It is here where we have learned to love and forgive those who did us harm. With profound gratitude, I appreciate and thank you to our sixth District Council gunman, Dr. Sooley Sara for her recommendation brought forth in Rakhine and recommendation of the Cambodian Genocide Remembrance Day.'",
        "'speaker_6': 'I would also like to thank you, honorable mayor, vice mayor and the rest of the Council members for your love and your continued support and my sincere thanks to my boss at the TCC family house.'",
        "'speaker_0': 'Thank you. Your time is.'",
        "'speaker_6': 'Up, Nicholas. For her support by encouraging her staff.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_2': 'City Council members. My name's Susanna Thiam and I'm the executive director of UCC. Thank you, Councilwoman Dr. Sara, for presenting and honoring the Cambodian community and remembering the Cambodian genocide. During the genocide, the Khmer Rouge. We will repeat this statement to the Cambodian people.'",
        "'speaker_2': 'To keep you is no benefit. To destroy you is no loss. The Cambodian community carried this toxic narrative with them, making them feel invisible and not valuable. Your recognition tonight of the Cambodian genocide makes the Cambodian community history visible, and it shows how the city of Long Beach values the Cambodian community.'",
        "'speaker_2': 'So tonight we break the cycle of trauma and heal together as a community by honoring those that were lost and honoring our history. I would like to speak this affirmation that was posted by Satya Lim from the Renaissance in his show, and it says, Keeping you alive is a benefit.'",
        "'speaker_2': 'To destroy you is a loss. We need you cry. We need you to create, to thrive, to tell our stories, to live. The work you're putting in is necessary. You living is necessary. Thank you. Speaker. Good evening, honorable mayor and council members.'",
        "'speaker_2': 'I'm Dr. Lindsey Chia and I live in the District one and I work in the city of Long Beach, Atcc Family Health as a program manager. This year marks the 47th anniversary of the most tragic time period in Cambodia and for my family.'",
        "'speaker_2': 'I find myself at times at a loss for words to describe this horrific event and feelings that surfaces around this time period. I do want to express to my fellow Cambodian neighbors, colleagues, friends and relatives that you are not alone and we will continue to heal together as a connected community.'",
        "'speaker_2': 'Also, I acknowledge that regardless of how much time has passed, we will always treasure their memories and remember our loved ones by sharing their personal stories to our next generation. I, on behalf of TCC Family Health and also our CEO, Dr. Elisa Nicholas, I want to share that we are committed to continue serving our most valuable community'",
        "'speaker_2': 'members. So TCG Family Health was founded in 1939 by a group of physicians and community leaders who recognized the importance of access to health care for all children, particularly those who are from low income families and who are at risk for health problems.'",
        "'speaker_2': 'We've been serving the Cambodian community and we will continue to serve the community for more than 30 years. And I just wanted to say that we noted there's not a lot of resources to our community members at the time.'",
        "'speaker_2': 'So TCC has made sure that we create monthly clinic sessions with volunteer physician Dr. Cha. Sorry, Dr. Sung ten.'",
        "'speaker_0': 'Thank you. Your time is up.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_6': 'Good evening. My name is Steve Shukla, a resident of the third district and someone who grew up in town. And as the previous speaker mentioned, we were fortunate in LBC to learn a bit about the history of the Cambodian people, especially as they had been recent arrivals here.'",
        "'speaker_6': 'I'd like to read just the title, not the whole article, obviously, something that was written by Linda Charlton on May 5th of 1970. The article from the New York Times Anti War Strike Plans in the Colleges Pick Up Student and Faculty Support.'",
        "'speaker_6': 'What many people may not know about our own country's history, especially the history of the sixties, the Kent State shooting, the Kent State massacre of students by the Nixon administration in 1970 was something that was possible because there are already hundreds of campuses in this country, university campuses, where students and faculty were already out striking in opposition'",
        "'speaker_6': 'to the expansion of the war in Southeast Asia, the Vietnam War into Cambodia, and the bombing of Cambodia, as it was perceived rightly at the time, that it would lead to a situation where something like the Khmer Rouge would fill the vacuum.'",
        "'speaker_6': 'But the actions of our own government. It's important to recognize our own role in perpetuating some of these systems that lead to some of these outcomes. Thank you. Good evening, Mayor and council members. I am bendable. Just in.'",
        "'speaker_6': 'Who is a Cambodian American Buddhist monk on behalf of the Cambodian and the Cambodian American Buddhist monks, five monk, five most wonderful monks and I are here to intone the benevolent Dharma to the Cambodians who were killed and pass on due to starvation.'",
        "'speaker_6': 'During the Cambodian genocide. Please understand that intoning the benevolent dharma is the Cambodian tradition and the Cambodians culture, which concatenate to Buddhism. Perhaps some of you may not comprehend what's going on when we intoning the Dharma. However, those the benevolent dogmas that we intoning for those who could understand and listen to it.'",
        "'speaker_6': 'The Cambodian culture. Had been suffered quite a bit. I don't need to say much more. Are most of you known what's going on already? This is my third ordination. The reason I ordained it is because my parents, my father passed on during the Khmer Rouge.'",
        "'speaker_0': 'Thank you. Your time is up. Next speaker.'",
        "'speaker_6': 'Good evening, Meyers and member console. Today I'm going to give the chanting and the meaning of the chanting is that we want all of you to be relaxed and. Be open hearted to all that human being and bring the waste and make your wish to God with good heart.'",
        "'speaker_6': 'God willing to all being by saying in your mind that may our being be happy. May all being be free from our suffering. And may of being free from sorrow and lamentation. The camp died in the Bay Band ten years ago, but that is the band that lie on the line to ignite some ideas and man thinking'",
        "'speaker_6': 'night to night. I know why. Some years, man. I don't know. I think. Is this man thinking, though? Uh. Thank you.'",
        "'speaker_3': 'Thank you very much. Really, really powerful and important presentation. I want to go ahead and. Oh, look, we're going to get a song. Even better.'",
        "'speaker_6': 'I had to draw down.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_6': 'Um. Um. Uh. But, uh.'",
        "'speaker_8': 'Yeah, I don't know. But, um. Uh. I guess I am.'",
        "'speaker_6': 'I am. I am. I am who I am.'",
        "'speaker_8': 'And, uh, I'm glad I did.'",
        "'speaker_6': 'Some some it and.'",
        "'speaker_8': 'All. Uh. Yeah. Oh, come on.'",
        "'speaker_6': 'What?'",
        "'speaker_2': 'Yeah, I.'",
        "'speaker_6': 'Uh, I.'",
        "'speaker_8': 'I, uh. I don't know. Yeah. Um.'",
        "'speaker_6': 'I'm in. Uh.'",
        "'speaker_2': 'And I want you to know that.'",
        "'speaker_8': 'I want you to know that I am I. You know, I mean, sometimes, uh, uh, uh. You know.'",
        "'speaker_6': 'But yeah. Um hum.'",
        "'speaker_2': 'Um hum.'",
        "'speaker_8': 'Um hum. Um hum. Um hum. Um hum. Um hum. Um hum. Um hum. Um hum. Uh um.'",
        "'speaker_6': 'I say, yeah, yeah.'",
        "'speaker_2': 'Yeah, right, yeah. Right. Uh, but, um. But, uh, I'm.'",
        "'speaker_6': 'Thank you. Thank you.'",
        "'speaker_3': 'Thank you very much. We're going to go ahead and I'm going to ask if all of our friends at joins us can just please come forward. We're going to I'm going to present a certificate to actually do the proclamation for the Cambodian Community Genocide Remembrance Day.'",
        "'speaker_3': 'And if I can also have I know the vice president of our Killing Field Memorial Center is going to join us. Mr. Connor Noon is also going to come forward, and I'm going to present the certificate. But if anyone else in the community wants to join us, please do so.'",
        "'speaker_3': 'And certainly the council would like to join as well. That'd be great. Thank you very much for that. I'm going to walk as we exit. We're going to go on to the next item, please. Madam Clerk, can you please read 15?'",
        "'speaker_0': 'Mr. Mayor, we still need to to actually.'",
        "'speaker_3': 'Have a vote on this item. So let's take a vote and we'll do it in 15. Roll call, please.'",
        "'speaker_0': 'Councilwoman Sun has a councilwoman Ellen. Councilwoman Price.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Sabrina, i. Councilwoman Mango. Councilwoman Mango. Councilwoman Ciro.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilmember Warangal. Hi, Councilman Austin. Hi. Vice Mayor Richardson.'",
        "'speaker_6': 'Hi.'"
    ],
    "Recommendation to receive and file a presentation from Philosophy on National Poetry Month; and  Direct the Department of Library Services to partner with the Arts Council of Long Beach to prepare and update on the Youth Poet Laureate Program and return to council within 30 days.": [
        "'speaker_0': 'The motion carries. The motion is carried.'",
        "'speaker_3': 'Thank you. Item 15, please.'",
        "'speaker_0': 'Item 15 is a communication from Vice Mayor Richardson recommendation to receive and file a presentation from Philosophy on National Poetry Month and Direct Department of Library Services to partner with the Arts Council of Long Beach to prepare an update on the Youth Poet Laureate Program.'",
        "'speaker_3': 'Vice Mayor.'",
        "'speaker_4': 'Thank you, Mr. Mayor. The month of April is National Poetry Month, and we're taking today as an opportunity to recognize poetry and also to have an update and receive an update on our Youth Poet Laureate program. Arts is an incredible part of our community.'",
        "'speaker_4': 'It's a, you know, something that brings us all together. And we've been incredibly supportive of arts through murals and performing arts and a whole host of things. And what we're seeing here is, oh, I have the clicker. There it is.'",
        "'speaker_4': 'Fantastic. Okay, great. So National Poetry Month is something that is a program that was established in 1996 by the Academy of American Poets. It's an opportunity to celebrate the impeccable body of literature created by poets. It acknowledges the wealth of humor and humor, human emotion found in poetry.'",
        "'speaker_4': 'And the it was approved by we brought the Youth Poet Laureate program to City Council back in 2019. I brought it forward along with Councilmember Urunga, Councilmember Andrews and Councilmember Pearce, and the goal was to capture the essence of our city, inspire creativity and all residents, bring literary arts to all, to people who may have limited access'",
        "'speaker_4': 'or few opportunities to to poetry or expressive writing and enhance the city's current literacy and arts program and overall to uplift, cultivate and celebrate the youth voice. The program was initially stood up and the idea was to target kids 14 to 19, and they were encouraged to apply and submit poems throughout the city.'",
        "'speaker_4': 'We went through an initial first year where 30 teens were invited to perform at public events. It was set to launch. The full program was set to launch in 2020, but then we were impacted by COVID 19, and so we thought it would be a good opportunity to now bring it back and has staff to take another'",
        "'speaker_4': 'look at how we can make sure that, you know, we continue this incredible program that that really was was stopped short due to COVID 19. According to library staff, the plan is to bring is to have the program up and running by January 2023.'",
        "'speaker_4': 'And I want to support that effort. I think our city council should support staff in that effort to get this program back up and running. So this recommendation is. Today we're celebrating National Poetry Month, but also sort of reaffirming our commitment to making sure that poet poetry is accessible to all.'",
        "'speaker_4': 'And that's sort of the idea of the president of the the motion today. And at this point, I want to invite up philosophy. There is I want to divide up philosophy. Philosophy. He's a good friend, a Long Beach poet, grew up in North Long Beach.'",
        "'speaker_4': 'His entire family, he's he went to Hamilton Middle School, Jordan High School in Long Beach State. And he's well regarded as a leading poet, not only just here in Long Beach, but around the nation, as we've been highlighted in, you know, verses and Flow Def Poetry Jam.'",
        "'speaker_4': 'And he's a North Long Beach guy and a good friend. And so, without further ado, I handed over to philosophy.'",
        "'speaker_6': 'Good evening, everyone. Doing tonight. Thank you for such an opportunity to speak on the artistry that we have here in Long Beach. Coming from North Long Beach. It's one of those things that we are I am rooted in this city and being able to hold that flag all over the world and saying poems.'",
        "'speaker_6': 'And people say, where are you from? Not Long Beach. So that being said, I'll delve right into this poem. Through the Youth Poet Laureate program. We are planting seeds of strength in our communities, tending to the soil of our youth, cultivating their mentality with mentors and placing their fingers in the enriched soil of creativity.'",
        "'speaker_6': 'We are watering the seeds of their success, growing competence, teaching tenacity, and engaging young leaders to express themselves for healing and resolution. Raise your pen and write from the epicenter of your truth. Write for healing. Write until the silence becomes tears.'",
        "'speaker_6': 'Write until tears become smiles. Write from the core of your being. Be the voice for the voiceless. And listen and listening ear for hearts that are not heard. We have our thumb pulse on the rib cage of society, pulsing with every smile, teardrop, laughter or hugging of loved ones.'",
        "'speaker_6': 'We are harvesting the spoils of their hard work with integrity and a positive attitude. The children are the catalysts to change. They blossom as the stem of a sunflower, illuminating their lives as a guiding light or lighthouse, guiding ships to the shore of their success, floating on an ocean of opportunity at the telescope, seeking the horizon and'",
        "'speaker_6': 'morning sun. We are birthing the vision of a new generation. We are steadfast in the fortitude of our beliefs. We believe in kindness, compassion, love, literary arts, dance, dedication to the craft, and never failing to be a beacon of truth.'",
        "'speaker_6': 'We are honest and deeply rooted in Long Beach. We sidestep obstacles and find freedom at the edge of a pen or pilot. Gita. We shoot for the stars as supernovas in the night sky. We write with artistry and expression as a rose through concrete, pushing its petals through the cement.'",
        "'speaker_6': 'We are resilient as using our thorns to break ground. The lower yet program is ground breaking. It will change the landscape of the literary arts and Long Beach. It is a charging forward. It is spearheading the charge. It will create literary spaces of free thought for our youth.'",
        "'speaker_6': 'And plant seeds of success for their future. So bring forth the laureates. It is their time to lead. I am philosophy. And I thank you humbly for this time with you.'",
        "'speaker_4': 'Thank you. That satisfies our presentation. Again, we you know, we're coming out of the pandemic and we need to make sure that we get back to where we where we were and and make sure that this youthful program gets the support that it needs.'",
        "'speaker_4': 'Thank you so much.'",
        "'speaker_3': 'Thank you. Councilman Austin.'",
        "'speaker_7': 'Yes, I'm happy to second this motion and always move. Then touched by the artistry and the great words of our good friend, dear friend philosophy. He said A lot of powerful words in there, but I caught on to a few.'",
        "'speaker_7': 'And is that there? Was that. That that concept of free thought, which is the antithesis of groupthink. And I think we could all learn from that, particularly as public officials, that we are able to think for ourselves and have free thought and not necessarily subscribe to the thought that everyone else wants us to.'",
        "'speaker_7': 'We don't talk on talking points. Thank you for your presentation, sir.'",
        "'speaker_3': 'Thank you, Councilwoman in the house.'",
        "'speaker_1': 'Thank you, Mayor. Thank you, philosophy. You know, I am one of your biggest fans. I remember when we first met. Your words just inspired me so much. And I continued to be inspired by your so very powerful and sincere words.'",
        "'speaker_1': 'One of the things that I love about you is your focus on the youth and giving them the opportunity to find their own voices and really make a difference in not only here in Long Beach, but everywhere. So I got to say, when I saw you on the agenda, I got really excited and I even contemplated writing'",
        "'speaker_1': 'a poem for you. But I don't know that it's going to be as good as what you write. But I know that I continued to be inspired by you, and I thank you for that. And I thank you for all that you do for the city of Long Beach and putting us on the map.'",
        "'speaker_1': 'And you continuously do that. And I will continuously be a big fan of yours. Thank you so much for your powerful words and for your love for this city and our youth.'",
        "'speaker_3': 'Thank you, Councilwoman Sara.'",
        "'speaker_2': 'Yes. I want to thank Vice Mayor for bringing this forward and what an important program that we need to bring forward and to update given our recovery process. And I think that our young people have so much to express and there needs to be an outlet and a way to shape their identity and and find their place'",
        "'speaker_2': 'and to lift up Long Beach altogether. So look forward to hearing back about the program when it comes back in philosophy. I love your shoes. Where can I buy a pair? Seriously, I need it in pink, though.'",
        "'speaker_3': 'Thank you. We have a motion and a second. I don't believe there's any additional public comment.'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item 15, please line up at the podium in the zoom. Please use the raise hand feature or dial star nine now. See none. That concludes public comment.'",
        "'speaker_3': 'Members roll call vote.'",
        "'speaker_0': 'Councilman Sun has. Councilwoman Allen i. Councilman Price. Councilman Sabino. All right. Councilwoman mango.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilwoman Sarah I. Councilmember Oranga.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Councilman Austin. Vice Mayor Richardson.'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'The motion is carry nine zero.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any necessary documents, subcontracts, or subsequent amendments, including amendments to the award amount and agreement term, with the City of Los Angeles to accept and expend grant funding in an amount not to exceed $6,869,171 for Department of Homeland Security 2021 Urban Area Security Initiative Grant, for the period of  September 1, 2021 through May 31, 2024; and  Increase appropriations in the General Grants Fund Group in the Disaster Preparedness and Emergency Communications Department by $590,000, in the General Grants Fund Group in the Fire Department by $3,327,666, in the General Grants Fund Group in the Health and Human Services Department by $307,500, in the General Grants Fund Group in the Parks, Recreation and Marine Department by $125,235, in the General Grants Fund Group in the Police Department by $1,886,270, and in the General Grants Fund Group in the Technology and Innovation Department by $472,500, offset by grant revenue.  (Citywide)": [
        "'speaker_3': 'Thank you very much. We now are moving on to item 16, the rest of the items on the agenda, I believe our staff items. So we'll go ahead and begin with item 16.'",
        "'speaker_0': 'Item 16 is a report from Disaster Preparedness and Emergency Communications, Fire, Health and Human Services, Parks and Recreation. Marine, please. Technology and Innovation. Recommendation to authorize City Manager to execute agreement and necessary documents with the City of L.A. to accept grant funding in an amount not to exceed 6.8 million for Department of Homeland Security 2021 Urban Area'",
        "'speaker_0': 'Security Initiative Grant Citywide.'",
        "'speaker_3': 'Thank you. There's a motion and a second. Is there any public comment?'",
        "'speaker_5': 'Are there any members of the public that would like to speak on item 16 in person? Please line up at the podium. If there are any members of the public that would like to speak in the room, please use the raise hand feature or dial star nine now.'",
        "'speaker_5': 'Yes. That concludes public comment.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Covered District one.'",
        "'speaker_1': 'High.'",
        "'speaker_0': 'District two high. Desert three.'",
        "'speaker_2': 'High.'",
        "'speaker_0': 'District four. District five. District six. I. District seven.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District eight.'",
        "'speaker_7': 'High.'",
        "'speaker_0': 'District nine.'",
        "'speaker_6': 'High.'",
        "'speaker_0': 'The motion is carried. Nine zero.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents necessary to amend Contract No. 34597 with Falcon Fuels, of Paramount, CA, and Contract No. 34598 with Merrimac Energy Group, of Long Beach, CA, for the purchase and delivery of petroleum fuels, to increase the aggregate contract amount by $2,300,000, for a revised aggregate contract amount not to exceed $13,600,000, and extend the term of the contract to October 31, 2022.  (Citywide)": [
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'The motion is carried. Nine. Zero.'",
        "'speaker_3': 'Thank you, Madam. 20.'",
        "'speaker_0': 'Item 20 Report from Financial Management Recommendation to authorize City Manager to amend contracts for the purchase and delivery of petroleum fuels for a revised aggregated amount not to exceed 13.6 million and extend the term of the contract to October 31st, 2022.'",
        "'speaker_3': 'City by City Motion in a second. Any public comment on this item.'",
        "'speaker_5': 'At their any members of the public they would like to speak on item 20. Please line up at the podium in the zoom. Please use the raise hand feature in Dagestan. I now. We have one member in person.'",
        "'speaker_5': 'Your time begins now.'",
        "'speaker_6': 'Thank you. My name is Dave Shukla. I'm a resident of the third district. And I'd just like to say that for a town that sells so much oil, how is it that we have to purchase our own refined petroleum fuel products?'",
        "'speaker_6': 'I mean, we've got refineries ringing around us on at least one side. But more generally, I mean, you know, Friday's Earth Day, right. I'd love to hear why why item 18 was withdrawn. I mean, we've got money to pay for fuel.'",
        "'speaker_6': 'We've got grant money to pay for other things. But apparently we can't schedule things. It's hard to make sense of how these agendas get thrown together and then chunked up in the meeting and just kind of at will punched back together on the the the city archive.'",
        "'speaker_6': 'But it should be said, you know, oil run town, you can't make it in fuel. Thank you.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'Thank you, Councilman Allen.'",
        "'speaker_2': 'Yes, I thank you, Mayor. I just wanted to add, you know, I can't wait until petroleum contracts are no longer necessary. And I know that we have staff working on that to make sure that's a sometime in the future a reality.'",
        "'speaker_2': 'But we're not there yet. So I support the contract amendment while we put out a competitive, competitive invitation to bid.'",
        "'speaker_3': 'Coulson was in the house.'",
        "'speaker_1': 'Going the comments of Councilwoman Allen. And also would like to see if staff could. Maybe you can answer this right now. Maybe not. But what our local air district quality regulations require and whether they'll and whether it's through this item, we can or don't meet that standard, if that makes sense.'",
        "'speaker_5': 'Councilwoman. We do have Dan Berlant back from our Fleet Services. He may be able to answer that question regarding the air quality standards. Dan.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Yes, Mayor Garcia, Councilwoman, we meet all the local standards. There are different ones depending on the type of vehicle that's in question. But we meet or exceed all those standards with what we operate.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'There's a motion in the second. Please roll call vote.'",
        "'speaker_0': 'District one and district two I visit three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four i. District five. District five. District six, i. District seven.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District eight. I. District nine.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'The motion is.'",
        "'speaker_2': 'Clear moment I.'",
        "'speaker_0': 'Received. Thank you. The motions carry nine zero.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any necessary subsequent subcontracts and amendments, including any amendment to the award amount, with the Business Consumer Services and Housing Agencys (BCSH) California Interagency Council on Homelessness (Cal ICH), to accept and expend grant funding in the amount of $1,322,281 for the Encampment Resolution Funding Program, for the period of April 1, 2022 through June 30, 2024, with the option to renew for an additional two-year period, at the discretion of the City Manager; and  Increase appropriations in the Health Fund Group in the Health and Human Services Department by $1,322,281, offset by grant revenue.  (Citywide)": [
        "'speaker_3': 'Thank you. And 22.'",
        "'speaker_0': 'Item 22 is a report from Health and Human Services recommendation to authorize city manager to execute an agreement with business, consumer services and housing agencies. California Interagency Council on Homelessness in the amount of 1.3 million for the Encampment Resolution Funding Program City.'",
        "'speaker_3': 'I think there's a. Can I get a motion, please? In a second. Thank you. Any public comment on this?'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item 22 and person, please line up at the podium in the zoom. Please use the raise hand feature or dial star nine now. See none.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'Thank you. Customers in Dallas. Vice manager of any comments?'",
        "'speaker_4': 'No, thank you.'",
        "'speaker_3': 'And Councilman, sir?'",
        "'speaker_2': 'Yes. I just want to thank our Health and Human Services staff for applying and getting this grant. I really just am so excited about the $1.3 million that we're going to get to increase the assistance for our inter-departmental team to address homelessness and doing cleanups around MacArthur Park and Mark Twain Library.'",
        "'speaker_2': 'And I think this is going to be a great step forward for us to be able to find creative and alternative ways to work, where are in the house community and giving them the support and services they need.'",
        "'speaker_2': 'Thank you so much.'",
        "'speaker_3': 'Thank you. And roll call vote, please.'",
        "'speaker_0': 'District one. I'm District two. I disagree. I District four. District five. District five. District six.'",
        "'speaker_2': 'High I.'",
        "'speaker_0': 'District seven. I District eight.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District nine.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any necessary documents, subcontracts or subsequent amendments, including amendments to the award amount, with the Conrad N. Hilton Foundation to accept and expend grant funding in the amount of $1,500,000 for the Futures First, Office of Youth Development, for a three-year period beginning May 1, 2022, with the option to extend for three additional one-year periods, at the discretion of the City Manager; and  Increase appropriations in the Health Fund Group in the Health and Human Services Department by $1,500,000 offset by grant revenues.  (Citywide)": [
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'The motion is Cory nine zero.'",
        "'speaker_3': 'Thank you, Adam 23.'",
        "'speaker_0': 'Item 23 Report from Health and Human Services Recommendation to authorize city manager to execute an agreement with Conrad and Hilton Foundation to accept grant funding in the amount of 1.5 million for the future first Office of Youth Development Citywide.'",
        "'speaker_3': 'There's a motion for a second, Councilman Austin. Any comments?'",
        "'speaker_7': 'Yes, I think this is a great opportunity. $1.5 million that's going to benefit youth in our city. I did have a question regarding the grant. Did we apply for the grant with the. The nature of the grant? And is this the same Hilton, Conrad Hilton, with the hit associated with Hilton Hotels?'",
        "'speaker_5': 'Yes it is. And we have our homeless services manager, Paul Duncan, available to answer any questions you have. But yes, that is the same Hilton. It's their charitable foundation.'",
        "'speaker_7': 'Great. Good. Glad to see them giving back to our community.'",
        "'speaker_6': 'It's personal time by Wendell and ask and answer any questions. She's much more informed on the specific grant. Why?'",
        "'speaker_5': 'Or were you looking for a presentation or was there a specific question?'",
        "'speaker_7': 'The question was whether or not we.'",
        "'speaker_5': 'Saw that was okay. Thank you, Paul. I think we're good.'",
        "'speaker_2': 'I. Good evening, Carol. Mayor and city council people, this is.'",
        "'speaker_6': 'Dr..'",
        "'speaker_2': 'Davis, so we can get back to you about that. I'm not 100% sure if we applied or how exactly the.'",
        "'speaker_6': 'The.'",
        "'speaker_2': 'Process went for us to receive this grant. But I can get.'",
        "'speaker_6': 'Back to you.'",
        "'speaker_2': 'On that.'",
        "'speaker_7': 'I thank you. I'm supportive of that. Either way, I think this is a good for the city. Are you.'",
        "'speaker_3': 'Thank you. Any public comment.'",
        "'speaker_5': 'That there are any members of the public they would like to speak on item 23 and person please, please line up at the podium in the zoom. Please use the raise hand feature podcast are nine now. We have one member in person.'",
        "'speaker_5': 'Your time begins now.'",
        "'speaker_6': 'Thank you. Dave Shukla again. It's wonderful to be in person. You can catch things in real time and wonder why they're happening. Like item 17. It's really kind of funny, you know, that we have a couple of years left.'",
        "'speaker_6': 'If you've read the latest APEC report on climate impacts, only a couple of years left to do anything to have a livable future for any of us. And uh, we have a couple of proposals here for half of the grant money that we're supposed to have a presentation about November 18 regarding our youth climate program, state funding'",
        "'speaker_6': 'for which but this is private money from the Hilton Foundation, which apparently has deep reserves after the pandemic to direct Pacific Gateway. If any of you can read or have your staff even read the staff report for either the 17 or 23, I mean, it's fucking ridiculous, you know, like, oh, we're going to take disadvantaged youth, you'",
        "'speaker_6': 'know, a couple hundred of them and stick them in space. The moment where you use all the last resources, we have to send a couple of balding white assholes to space. I mean, seriously, like, what is this all for?'",
        "'speaker_6': 'But more generally, I mean, when it comes to the fact that I mean, this is a city government and you are charged technically with the safety and security and well-being of all of your residents. Uh, it's kind of surprising that we would direct our social and public resources in this way.'",
        "'speaker_6': 'Um, the data collection protocols will be developed by the evaluator and the Institutional Review Board to allow for the use of data in future publications. Uh, yeah. I mean, you know who's going to read them? Thank you.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'Restaurants in the UK up again that.'",
        "'speaker_4': 'So just wanted to highlight this program. I think this is incredible. So based on the staff report and based on what I understand from the program, it's you know, the Office of Youth Development is going to start a really great program for 300 youth from, you know, different communities, disadvantaged communities across Long Beach.'",
        "'speaker_4': 'And half of those youth will be connected directly with the Pacific Gateway Space Beach program. So they're going to get access to the emerging aerospace jobs that are in our city. I think that's incredible. I think also just to acknowledge that this is the first year that we actually have an Office of Youth Development, the youth of'",
        "'speaker_4': 'these office youth development's brand new. And we already see really good things. One and a half million dollar grant. So special thanks to the Conrad Hilton Foundation for for helping, you know, provide some much needed resources to this brand new office youth development that's going to make a real difference.'",
        "'speaker_4': 'All of this is sort of in alignment with the initial work around youth development with the boys, Women of Color, My Brother's Keeper work, which was the roots of this years ago. So I'm excited to see this. This is great.'",
        "'speaker_4': 'And I look forward to seeing, you know, following this program in the years to come. Thanks a lot.'",
        "'speaker_3': 'Thank you. Councilman's in the house.'",
        "'speaker_1': 'I think you just briefly wanted to say how much I appreciate this item. The Embraer forward. Thank you. I truly believe that empowering and investing in our youth is a key driver to a strong and growing future local economy.'",
        "'speaker_1': 'So thank you for this program.'",
        "'speaker_3': 'Thank you. We have a motion and a second. Let's go ahead and. The roll call. Vote on this, please.'",
        "'speaker_0': 'District one. I am district two. I did it. Three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four. I. District five.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District six. I. District seven. I. District eight. District nine.'",
        "'speaker_4': 'Yes.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an agreement, and any necessary documents, subcontracts or subsequent amendments, including amendments to the grant term or award amount, with the Conrad N. Hilton Foundation to accept and expend grant funding in an amount up to $1,670,000 for the creation of a new Space Beach program, a skills training program to enroll opportunity youth in aerospace careers, for a three-year period beginning May 1, 2022.  (Citywide)": [
        "'speaker_0': 'The motion is carried. Nine. Jo.'",
        "'speaker_3': 'Thank you. Let's go and go back up now to 17, because we should probably take these together. They're both related. I think there's maybe just one issue that there's we're clear about each item and why don't we go ahead and do I was going to ask for a short I skepticism to come back to it but I'",
        "'speaker_3': 'want to just offer a short presentation and 17 so that people get a good grasp of what we're doing here.'",
        "'speaker_5': 'Nick Shultz, our manager of our workforce development, will give a presentation on this item.'",
        "'speaker_0': 'Item 17 is a report from economic development. Recommendation to authorize City Manager to execute an agreement with. Oh 17. Yeah.'",
        "'speaker_3': '17.'",
        "'speaker_0': 'Adam 17 Report from Economic Development Recommendation to authorize the manager to execute an agreement with Conrad Hilton Foundation to accept grant funding in the amount not to exceed 1.6 billion for the creation of a new Space Beach program.'",
        "'speaker_5': 'I would like to introduce Nick, but I just wanted a clarification that there are two items where the city has received grants from the Hilton Foundation. One is item 23 that you just approved, and this is the second item where the city is receiving grant.'",
        "'speaker_5': 'And collectively between those two program, it achieves the training for the 300 youths that vice mayor mentioned. Right, Nick?'",
        "'speaker_6': 'Thank you, Linda. Good evening, honorable mayor. Members of the council. The item you have in front of you is an award to the city through Pacific Gateway from the Hilton Foundation, $1.67 million over three years. And it will serve 125 youth.'",
        "'speaker_6': 'I'm going to delve a little bit into the program aspect for you, but I want to say that this is important on a couple levels. Number one, it elevates all the great work that's been done across the city to scale Space Beach and the growing aerospace defense cluster we have here within the city.'",
        "'speaker_6': 'It recognizes that there's a significant portion, maybe one in four or one in five youth in the city who fall within the opportunity, youth or disadvantage youth category, as some funding sources use those terms interchangeably. And third, it is the Hilton's foundation first ever investment in the county of Los Angeles.'",
        "'speaker_6': 'This was an invite to participate, and it came to Long Beach and it came in two tranches. You've already heard about the Health Department and the Office of Youth Opportunity, and we look we look forward to them scaling up in parallel to our effort.'",
        "'speaker_6': 'So we're particularly proud of those three things with this Space Beach Youth Workforce Program is going to do is really three things. It's going to focus on career exploration for disadvantaged youth, meaning workplace tours, career days and project based mentoring and matching.'",
        "'speaker_6': 'The second thing it's going to do is actually career preparation. So that project based learning activity will occur with the youth in those manners. It will lead to a showcase, industry centric showcase and a conference where industry leaders will give youth feedback on their specific projects related to their company and mentor.'",
        "'speaker_6': 'And finally, it all culminate with paid internships in the actual aerospace companies for 125 Opportunity Youth. We've been moving along as this award was in process. Our first planning event is going to occur next week on 427. And I just want to read to you the list of companies who've already committed and will attend with us on'",
        "'speaker_6': 'the 27th to begin preparation for their mentorship activity. So it's more of 3D ABL Aerospace, the going, the Boeing Company, M4 for Aerospace, Rebel Aerospace, GCU, Space X Rocket Lab, Relativity Space, Otis Aviation Virgin Orbit Spin Launch. And NASA's actually spending sending representatives to participate in our planning day.'",
        "'speaker_6': 'So we're looking forward to a successful program. We're looking forward to connecting 125 of our opportunity youth to better opportunities, career pathways and meaningful labor market attachment through the partnership with Hilton. And I'm happy to take any questions you might have.'",
        "'speaker_3': 'Thank you. And I wanted to hear maybe we should have had that 1/1, but they're both related. I pulled it out of order because they wanted to spend a little bit of time on this, because I just want the council I think staff know this already, but the council to just kind of take in just the massive'",
        "'speaker_3': 'accomplishment and pride that we should feel in the creation of this space ecosystem that has developed in the city of Long Beach. Obviously a love that we are all all in on Space Beach. It is, you know, before I got on this body and many of us and some of us that have been here a little bit'",
        "'speaker_3': 'longer, like Councilman Austin and Councilman Ranga, and when when when Virgin Orbit first was coming to Long Beach. And we thought that was an enormous step forward. And it was and, you know, touring with them and seeing all the incredible things that that were that were happening there.'",
        "'speaker_3': 'And then, of course, to go from create from Virgin orbit, which we already have, of course, of the presence of Boeing here to then grow into into Space X and Rocket Lab and Spin Launch and UBL and all these incredible companies that are now here.'",
        "'speaker_3': 'We have created the most dense space economy, I believe, on the West Coast. And certainly we are the jobs that are being created, the relationships are being built at Cal State, Long Beach, particularly the engineering department. Have you talked to any faculty member at Cal State, Long Beach?'",
        "'speaker_3': 'And they will tell you that this is one of the. Best thing that ever happened to the engineering department at the university. And with the connections being made at Long Beach Unified School District and through programs like this one, I think are something that we should be incredibly, incredibly proud of.'",
        "'speaker_3': 'For those that have not had a chance to tour some of these facilities or to see what's actually happening within our broader can of Space Beach community, I would encourage you to do so. It's phenomenal what is going on.'",
        "'speaker_3': 'The technology that is being built right here in Long Beach, right adjacent to the Long Beach Airport, is incredible to see. So I'm incredibly proud of the work of staff in getting us here. And I do want to just take a minute to recognize both the economic development team that have worked just incredibly hard to help provide'",
        "'speaker_3': 'the space for for this ecosystem to prosper. Because what's happening here is not happening anywhere else. Instead of California, like period, it is. It's quite something to see. And so and with that wanted to thank you know, you know, Nick, you and your your whole team and of course on the health department side with the partner in'",
        "'speaker_3': 'this project. But this ability for us to connect our young people to these companies and to these jobs and just to have that opportunity to to have our own in-house, you know, visionaries, I think is really, really incredible.'",
        "'speaker_3': 'Let me also just ask and maybe this is more of a formal request to Ms.. Tatum, but I do think it's I think we're probably at the appropriate time where we should probably have a study session or a broader just presentation for the council about Space Beach and just all that is happening on site and around the'",
        "'speaker_3': 'airport. And because we know there's a lot more interest that's kind of breaking down the door right now as well. And so it'd be really great to have in front of the council to kind of talk about what all that's happening here in our community especially that's it's so unique right now to Long Beach from a California'",
        "'speaker_3': 'perspective. And I'm for the council. Everywhere I go, everyone knows what's going on here with with, with, with Space Beach. And so it's very it's very exciting. And I'm just very, very grateful to to the work that's gone into this project in particular.'",
        "'speaker_3': 'So we do have folks that are lined up. Councilman Austin, do you have any additional comments on this?'",
        "'speaker_7': 'Yeah, obviously, I support this item motion to support this. I mean, you said a lot and I certainly agree with the the opportunities that are created with the many companies that are now occupying. What was the former McDonnell Douglas Boeing site?'",
        "'speaker_7': 'I want to just say that I think Long Beach, obviously, is the place to to embark on a space beach. We have a workforce that is built in here. And, you know, we are we once had 40,000 plus jobs at that site.'",
        "'speaker_7': 'I never want to forget that. I always want to remind us of that frequently. And so while Space Beach represents a rebound and I think in many respects we're still operating from a jobs deficit, and we shouldn't forget that I was fortunate to be one of those opportunity youth, you know, 30 some years ago, right out of'",
        "'speaker_7': 'high school, getting a job in an aerospace industry and it gave me a great foundation on life, opened up all kinds of doors for me. I got an opportunity to work for a Fortune 500 company. And so to know that 150 to 300 youth are going to be benefiting from many of the same opportunities that I had'",
        "'speaker_7': 'as a kid, a young man coming out of high school. I think this is a great, great program and so happy to support it and look forward to the results.'",
        "'speaker_3': 'Thank you, Councilman Allen.'",
        "'speaker_2': 'Yes. Thank you, Mary. This is just a fantastic grant. I'm sure the Hilton Foundation is tuning in and just to see how grateful we all are for this money that's supporting our youth. I'm also just a huge thank you to Pacific Gateway for making the request and securing the funding.'",
        "'speaker_2': 'The funding. And thank you, Nick. For more details about the program. My goodness. The companies that are coming to your to your planning day. Even NASA's sending representatives. It's just huge. And it's just really exciting for our youth.'",
        "'speaker_2': 'And it's just a great opportunity to train the youth for jobs of tomorrow and also for these youth to get to live and be able to work in Long Beach and have good paying jobs. I look forward to watching this program take off over the next three years, and I also hope and can't wait until I can'",
        "'speaker_2': 'share more information about the program with youth and constituents. And who can also apply for that. I also just have to say just a big thank you to our mayor, to all the folks that were involved in creating these ecosystems.'",
        "'speaker_2': 'It's just an incredible opportunity for our youth and I couldn't be more excited. So thank you.'",
        "'speaker_3': 'Thank you, Vice Mayor Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. So that was the that was the presentation we were looking for earlier. Good job. Good job, Nick. So a few things. So, one, I think it's incredible that these things are happening with with Space Beach and the new life of aerospace.'",
        "'speaker_4': 'But the story that I think we really need to highlight is the fact that all these things are happening at once. The Office of Youth Development is finally standing. It's our first year after the city council funded it.'",
        "'speaker_4': 'Last year it's standing. There's grant funding connecting all the strategies that came from My Brother's Keeper to the Youth Strategic Plan that highlights the focus on disconnected youth that we started talking about years ago, that if youth are connected to a pathway to a job or education or training, then they're less likely to be connected to the'",
        "'speaker_4': 'criminal justice system or to be a victim of violent crime. And so by targeting the opportunities that we have with Space Beach to Opportunity youth, that's a way that we make sure that our entire city is organized in a way that youth have world class opportunities.'",
        "'speaker_4': 'And so and frankly, it needs to happen. You know, I love hearing when Councilman Alston talks about his opportunities. My mom had the same opportunity. She worked on an assembly line at General Motors when she had a GED.'",
        "'speaker_4': 'Today, you can't do that. You can't graduate high school and go get a job right out the gate. You need to require some connection, some training, some development. And the fact that we are organizing at this at this early stage in space speech to have that direct alignment to our youth and our workforce agency and our health'",
        "'speaker_4': 'department, I think it's smart. And so I look forward to much more. You know, I look forward to like following this program at the Ron Arias Center, and it's going to work with youth across the whole city. But the fact that it's even anchored the Office of Youth Development in the community right next to Jordan High School'",
        "'speaker_4': 'says a lot that these kids can get direct access to world class jobs. Right. Coming out of Jordan High and every other high school, for that matter. So thank you so much. I think this is this is probably the coolest thing on the agenda.'",
        "'speaker_4': 'On the agenda. Thank you.'",
        "'speaker_3': 'Thank you. In the house.'",
        "'speaker_1': 'Thank you, Mayor. Nick, thank you for that great, great presentation. I'm so excited for the out of this world experience that space speech is going to bring to our youth. I think it's so amazing. I love this item and that it highlights the unique opportunity that will be provided to our youth with exposure to emerging technologies, as'",
        "'speaker_1': 'well as equip them with a path to earning family sustaining jobs, which is the most important thing. Like like both make place mayor and councilwoman council member Austin alluded to this is truly an opportunity like no other. And it makes me so proud to know that it is Long Beach Focus and that we have it here in'",
        "'speaker_1': 'Long Beach. Again, I will say it, youth empowerment, I believe, is really the key driver for a stronger local economy. So I'm really excited about this. I think that it's going to be amazing. I'm looking forward to seeing the outcomes of this program.'",
        "'speaker_1': 'I'm I can't wait to see the 150 students that will our young youth that will be able to take advantage of the program. I cannot wait to see them at the other side of the program after they've gone through the program.'",
        "'speaker_1': 'It's going to be amazing. So thank you to everyone who brought it forward and a huge thank you to the Hilton Foundation for funding such an important program here in Long Beach.'",
        "'speaker_3': 'Councilman. Sorry.'",
        "'speaker_2': 'Thank you, Mayor. Just don't want to be repetitive and just, you know, thank my colleagues for their great comments. But I do want to add to that I hope will take into serious consideration doing outreach to young women of color.'",
        "'speaker_2': 'As somebody who thought about entering the science world, it wasn't a friendly environment that made me want to even go into that career. So I'm hoping that, well, this will help increase the equity level of gender in the science and aerospace field.'",
        "'speaker_2': 'And, you know, love to see our young women demonstrating their not only passion but skill in this field, and that we create an environment that contributes to equity in that respect to. And so I look forward to seeing who these young people are in the program and how are you going to set this motto up for the'",
        "'speaker_2': 'nation. So thank you so much. And thanks to the Economic Development Department for this hard work.'",
        "'speaker_3': 'Thank you. Public comment.'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item 17 in person, please line up at the podium in the zoom. Please use the raise hand feature or dial star nine now.'",
        "'speaker_6': 'Mr. Mayor. I know space is your moniker, so don't take my decision towards the item as a personal affront to you. That said, you know, I'm I'm glad we're over the Hilton Hotel boycott. You know, obviously, we're taking this money because I'm just so confused.'",
        "'speaker_6': 'For one, I'm so confused. Long Beach State has failed the at eat opportunity youth of the city. Proportionately speaking, Long Beach State does not and the lobby's promise does not serve as opportunity youth in this city at all.'",
        "'speaker_6': 'You can look at the numbers there showed. They'll show you themselves. And when I look at Mr. C's statements, mark markup on even the page referencing Space Beach, it does even say opportunity UV on the page it says engineering, the engineering program students.'",
        "'speaker_6': 'So as we know, that's mostly foreign exchange students in that opportunity, youth that are being serviced by the program. So I'm just confused by how we're going to like semantically, you know, play three card monte about who actually is the services that doesn't service opportunity youth in the city of Long Beach with respect to what they say'",
        "'speaker_6': 'they're servicing opportunity youth like in my in my neighborhood. 90813 where one in three are living in abject poverty, aren't being serviced by these kinds of programs. So I don't appreciate Pacific Gateway and whatever endowment relationship they have with Long Beach State trying to weasel their way into, you know, using language, to my knowledge, when I look'",
        "'speaker_6': 'up the call to Mr. Biden, when I look up opportunity youth, the definition of it's a 16 to 24 who are not in school. So how can an engineering program student qualify for for qualifying for this when they're in school?'",
        "'speaker_6': 'Mr. AUSTIN So eloquently put it, we're at a deficit this space beach entities that come in here and gentrify our communities and our neighborhoods when they bring high earning engineers and professionals to come in and filter into our neighborhoods where they're okay, we're paying 30 $500 or more in rent and the rest of us are not.'",
        "'speaker_6': 'That's not what we want coming into the city. We want locals getting jobs. These these type of antics don't do that at all. They don't service locals. My great grandfather came out of World War Two working on the line.'",
        "'speaker_6': 'My grandfather worked on the line. 18 people in my family worked on the line at McDonnell Douglas. These aren't the type of communities that are being serviced by these types of programs. So you have to forgive me, Mr. Mayor, council for, you know, engaging with this like this is not service an opportunity.'",
        "'speaker_6': 'I don't have no problem. I'm not you know, I love my environmentalist friend. I'm not a contrarian. You know, I don't have no problem. But when I see certain terms being used, I'm like, that's not servicing the community that you say it's servicing.'",
        "'speaker_6': 'And I have enough will. I'm mindful enough to know what language means. So please think of the use of the locals. Thank you.'",
        "'speaker_0': 'Next speaker.'",
        "'speaker_6': 'They should quit their district. Hello again, Nick Schultz. Good to see you. Before I get into this whole good cop bad cop routine, I'd just like to ask you. Per million dollars of capital investment, what are the actual job creation?'",
        "'speaker_6': 'Career pathways, 20 years, 30 year pension track, career pathway, jobs being created by these funds. Do you know, Nick? It's the kind of thing I'd like to be able to geek out with with Uber. All right. I'm not a contrarian tonight, but I do care very much about the limited window.'",
        "'speaker_6': 'We have to insure the future survivability of our species and habitability on this planet. And quite frankly, Robert Garcia, for all of your efforts towards making sure that everyone you speak to about free speech, news about space speech, how many ventilators have these companies in that city boundaries of Long Beach actually created?'",
        "'speaker_6': 'How many ventilators? We stand here today, two years, not even two years after the Long Beach economic recovery team, was it? And a couple of other choice outfits in town made a couple of recommendations about how to proceed for the good of business.'",
        "'speaker_6': 'Right for the good of business. We didn't need to. Follow obvious, easy to absorb, you know, public health protocols. We just needed to keep business moving. Uh. Uh, true story. I had a pack of Cigarets stolen last week, and it was either the carpenters or the police.'",
        "'speaker_6': 'I'm not sure which, but the Carpenters were here to talk about wage theft, something I've done some research about in the industry, something that's happened and is expanded as we've been in such a rush to service the interests of certain industries and firms in this town.'",
        "'speaker_6': 'But more to the point, I mean, for all these these folks that you're attracting. What happens if we have an earthquake big enough that it actually affects things above Spring Street? But Willow Street. I mean, I know it's firmer ground, but I mean, what happens all these people that you're telling, you know, it's a great investment.'",
        "'speaker_6': 'Get come, come, get all these, you know, luxury condos that we just built while we, you know, pissed away our own population. Um, what are they going to do? I mean, these are small, you know, small money donors, right?'",
        "'speaker_6': 'I mean, what are you going to do? What are they going to do when they realize they kind of, you know, sold a lemon? Got six weeks to figure that out. I mean, you know, they can return. They can ask for the money back, right?'",
        "'speaker_6': 'I mean, if you know, as I said, some of you are better investments than others. You're saying, you know, five years from today, ten years from today, I mean, who's going to be a good investment?'",
        "'speaker_0': 'You know, your time is up.'",
        "'speaker_6': 'Should I should I look up?'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'Thank you. And then we're going to go and take a roll call vote before we do that. I do want to ask Ms.. T.A., I think let's definitely do that. The study session to the council. I think it's a great opportunity to continue to discuss all the all the great things going on with with with the space'",
        "'speaker_3': 'meets, and then also be able to answer some of the questions the Council has. And and particularly on this issue, which is really important for for the community. So thank you. Go ahead and do a real cover, please.'",
        "'speaker_0': 'It took one district to.'",
        "'speaker_2': 'Write.'",
        "'speaker_0': 'This actually.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District for my district five. District five.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District six, District seven.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'District eight. District nine.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'The motion is carried. Nine zero.'",
        "'speaker_3': 'Thank you. 24.'",
        "'speaker_2': 'I Mr. York.'"
    ],
    "Recommendation to adopt Specifications No. RFQ HE22-017 for Long Beach Recovery Act Black-Serving Mental Health Services, and award contracts as-needed to the 27 agencies for Black-serving mental health services, in a total annual aggregate amount of $1,000,000 for a period of one year, with the option to renew for four additional one-year periods, at the discretion of the City Manager; and, authorize City Manager, or designee, to execute all documents necessary to enter into the contracts, including any necessary subsequent amendments.  (Citywide)": [
        "'speaker_0': 'Item 24 is a report from Health and Human Services Financial Management. Recommendation to adopt specification for Long Beach Recovery Act. Black serving mental health services and a work contract as needed to 27 Agency for Black Serving Mental Health Services in a total annual aggregated amount of 1 million CDI.'",
        "'speaker_3': 'There's a motion in a second council in Austin. I think.'",
        "'speaker_7': 'I fully support this.'",
        "'speaker_3': 'Investment. Richardson.'",
        "'speaker_4': 'Thank you. Just want to congratulate Gwen Manning and Alana and everyone who worked really, really hard on this grant. This was the only agency in California to receive $1,000,000 to help support black serving, help mental health services. And so there's going to be a lot of great work and we're going to be leading in this effort.'",
        "'speaker_4': 'Thanks so much.'",
        "'speaker_3': 'Thank you very much. Any public comment on this?'",
        "'speaker_5': 'If there are any members of the public, they would like to speak on item 24 in person. Please line up at the podium in the zoom. Please use the raise hand feature or dial star nine now. Seen none.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'Thank you. We're going to go back and do it in 21 and then we'll go back to 25.'",
        "'speaker_0': 'Or covert, please.'",
        "'speaker_3': 'A roll call.'",
        "'speaker_2': 'Vote.'",
        "'speaker_0': 'District one. District two. I did it. Three. District four by district five.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'District six. District six.'",
        "'speaker_2': 'I.'"
    ],
    "Recommendation to adopt resolution authorizing City Manager, or designee, to execute a contract, and any necessary documents including any necessary subsequent amendments, with Los Angeles Truck Center, LLC dba Velocity Truck Center of Whittier, CA, (Velocity) for the purchase of eight Roto-Pak side loader refuse trucks, on the same terms and conditions afforded to Sourcewell (formerly the NJPA), of Staples, MN, with Crane Carrier Company, LLC, and Scranton Manufacturing Company, Inc., to be provided by local dealer, Velocity, in a total amount not to exceed $3,259,651, inclusive of taxes and fees;   Authorize City Manager, or designee, to execute a lease-purchase agreement, and related financing documents, with Banc of America Public Capital Corp., of San Francisco, CA, for the financing of eight Roto-Pak, side loader refuse trucks, in an amount not to exceed $3,556,571, inclusive of capital purchase, interest, and fees, payable over a seven-year period; and  Increase appropriations in the Fleet Services Fund Group in the Financial Management Department by $3,556,571, offset by ": [
        "'speaker_0': 'District seven. I. District eight. District nine. Yes. The motion is carried. Nine zero.'",
        "'speaker_3': 'Thank you. So now we'll go back up to 21. Yeah. You know.'",
        "'speaker_2': 'I don't like that.'",
        "'speaker_0': 'Item 21 is report from Financial Management and Public Works. Recommendation to adopt resolution authorizing City Manager to execute a contract with Los Angeles Truck Center, LLC for the purchase of eight rotor packs. C loader of refuse trucks in a total amount not to exceed 3.2 million.'",
        "'speaker_0': 'City.'",
        "'speaker_3': 'Thank you. There's a motion any second. These are public comment on this.'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item 21 in person, please line up at the podium in the zoom. Please use the raise hand feature or Dr. Knight. We do have one person in Zoom, Pete Marsh.'",
        "'speaker_5': 'Your time begins now. You have 3 minutes. Check if your muted press star nine.'",
        "'speaker_6': 'And can you hear me now?'",
        "'speaker_5': 'Yes.'",
        "'speaker_6': 'Okay. Very sorry. Good evening, Mr. Mayor. Council members. Thank you very much. Pete Marsh, District two. I submitted you comment on this also, and I wanted to actually walk that back very slightly. The comment encouraged you to consider deferring this purchase until electric versions of these trucks are available.'",
        "'speaker_6': 'And but I remembered hearing a brief last summer to the Sustainable City Commission by our Fleet Services Department and being impressed. And I went back and found that and learned relearned that they're rated as one of the top fleets in the nation and even in heavy duty trucking with plans currently in development to go zero emissions on'",
        "'speaker_6': 'metal and heavy duty trucks. I think in advance of the requirements from CARB but and councilmember Al staff also confirmed that they had talked with public works about this. So basically this is it's a fantastic opportunity to think about where we need to go with our purchases as soon as the market allows, which is evolving very, very'",
        "'speaker_6': 'rapidly in the right direction. And that's electric electric vehicles in all size scales, but also electrified machines in every other way we can. Essentially, the way to cut demand for fossil fuels is to electrify things at every opportunity and use our purchasing power to do that on our purchasing program.'",
        "'speaker_6': 'So anyway, I just wanted to basically acknowledge that the fleet services folks have been already for several years. Looking ahead, I was hoping that we could get this purchase to be electric. It doesn't seem like that's feasible, but please just counsel.'",
        "'speaker_6': 'Keep encouraging the staff to lean forward into electrifying everything and thank you for what you've done so far.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'We'll call that, please.'",
        "'speaker_0': 'Michigan Eye to.'",
        "'speaker_2': 'Eye.'",
        "'speaker_0': 'District three. District four, District five. District five. District six.'",
        "'speaker_2': 'I think that District six.'",
        "'speaker_0': 'I. District seven, i. District eight. Right. District nine.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'The motion is carried. Nine zero.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute all documents, including any necessary amendments, with the Federal Aviation Administration, to accept an increased Airport Improvement Program Grant award for federal Fiscal Year 2022 funding, for capital improvements to the Rehabilitate Runway 12-30 Lighting Project (formerly Runway 12-30 Electrical Improvements Project) at the Long Beach Airport, and increase the award amount by $1,700,000, for a revised amount not to exceed $8,700,000.  (Districts 4,5)": [
        "'speaker_3': 'Thank you. Back down to item 25, please.'",
        "'speaker_0': 'Item 25 is a report from Long Beach Airport. Recommendation to authorize city manager to execute all documents with Federal Aviation Administration to accept grant award for capital improvements to the REHABILITATE Runway 1230 lighting project for an amount not to exceed 8.7 million.'",
        "'speaker_0': 'Districts four and five.'",
        "'speaker_3': 'Think.'",
        "'speaker_2': 'Mango.'",
        "'speaker_3': 'Act. I'm sorry. I actually wanted to hear a short presentation on this place from the airport.'",
        "'speaker_5': 'We'll have our airport director, Cynthia Guidry do a brief presentation.'",
        "'speaker_9': 'Thank you, honorable mayor and City Council. This item is to replace the existing lighting fixtures on the main runway at the airport. The existing lighting system is in need of repair, and this project allows the city manager to accept an additional grant funds for this project by the FAA.'",
        "'speaker_3': 'Thank you. Councilman Mongo. I think I know. I believe you have maybe had a comment or want to make a motion.'",
        "'speaker_2': 'As I think the airport for always applying for these funds and the improvement of much needed. Thank you.'",
        "'speaker_3': 'Thank you, Councilman. Super.'",
        "'speaker_6': 'Thank you. I'd just like to make my standard request that with any construction project going on at the airport and overnight hours, that we be mindful of the construction noise. Director Guidry was incredibly responsive the last time we had an issue.'",
        "'speaker_6': 'So I'd like to see going into that the contractor is made aware of the sensitive sensitivity of the neighbors. Thank you.'",
        "'speaker_2': 'Absolutely.'",
        "'speaker_3': 'Councilman Nelson, I just want to add that it's been really, I think, just great to see all the investments being made to the airport in this last year to just the runway projects, and obviously very appreciative of all the grants we've been receiving, but particularly as we prepare to open up so much of the new facilities in'",
        "'speaker_3': 'the concourse. So it's just I love seeing all these airport items. We really are, you know, modernizing this airport in a way that's, you know, just making it even better than it already is. So it's great to see.'",
        "'speaker_3': 'So congratulations to the whole airport team. Is there any public comment.'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item 25 in person, please line up at the podium in Zoom. Please use the raise hand feature by pressing start nine now. See none. That concludes public comment.'",
        "'speaker_3': '26.'",
        "'speaker_0': 'Roll Call. Vote. Roll Call one.'",
        "'speaker_3': 'The Roll Call Things to Me.'",
        "'speaker_0': 'District two. Getting District three. It three. I did. I received this before i. District five. I. District six.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District seven.'",
        "'speaker_6': 'I.'"
    ],
    "Recommendation to authorize City Manager, or designee, to execute an amendment to the Amended and Restated Access and Demolition Agreement with Plenary Properties Long Beach, LLC, Mid Block Site Devco, LP, and Mid Block Demo, LLC, all of Los Angeles, CA, and any necessary documents or agreements, to address a change order to the Civic Center Project and the demolition of the old City Hall; and\n\nIncrease appropriations in the Civic Center Fund Group in the Public Works Department by $375,000, offset by a reduction in the $6,375,000 receivable from Plenary Properties Long Beach, LLC, to $6,000,000 for early demolition of the former City Hall.  (District 1)": [
        "'speaker_0': 'District eight. District nine. All right. The motion is carried. Nine zero.'",
        "'speaker_3': 'Thank you. Next is 26.'",
        "'speaker_0': 'Item 26 is a report from Public Works recommendation to authorize city manager to execute an amendment to the amended and restated access and demolition agreement with plenary properties to address a change order to the Civic Center Project and the demolitions of the Old City Hall District one.'",
        "'speaker_3': 'Can I get a motion in a second, please? Any public comment on this item?'",
        "'speaker_5': 'If there are any members of the public, they would like to speak on item 26 in person. Please sign up at the podium in Zoom. Please use the raise hand feature or dial star nine now. See. Now that concludes public comment.'",
        "'speaker_3': 'Roll Call vote.'",
        "'speaker_0': 'District one.'",
        "'speaker_1': 'I am district.'",
        "'speaker_0': 'To district three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District for.'",
        "'speaker_6': 'My.'",
        "'speaker_0': 'District five. District five. District six i. District seven.'",
        "'speaker_6': 'I.'"
    ],
    "Recommendation to adopt resolution decreasing appropriations in Fiscal Year 2021-2022 (FY 22) in the Water Fund Group in the Water Department by approximately $9,000,000.  (Citywide)": [
        "'speaker_0': 'District eight. District nine. Hi. The motion is Kerry eight zero.'",
        "'speaker_3': 'Great. Thank you. Item 27, please.'",
        "'speaker_0': '27 is report from water. Recommendation to Adobe Resolution Decreasing Appropriation in fiscal year 2021 2022. In the water fund group in the water department by approximately 9 million.'",
        "'speaker_3': 'I going to motion in a second please. Give us a motion in a second, madam. Quickly public comment.'",
        "'speaker_5': 'If there are any members of the public they would like to speak on item 27. Please line up at the podium in Zoom. Please use the raise and feature. We have one member of the public in person.'",
        "'speaker_6': 'Thank you, Dave, again. I'd just like to point out, um. Robert Garcia. That a lot of the arbitrage, a lot of the wasted time, a lot of the back and forth, a lot of the uncertainty, a lot of frankly, the just wastage on this item is a direct result of your leadership.'",
        "'speaker_6': 'Now, yesterday I was at the Climate Policy Summit hosted by the Climate Center in Sacramento. And unlike your predecessor, Councilwoman Allen, I wasn't drunk driving it. I would love to know if we could rewind the tape. And if you were to remember everything that you said, how you would feel today, and how long ago it would feel'",
        "'speaker_6': 'today about some of the arguments that were made for a measure of triple H, B, C, triple B to B plus. You know, these are one size fits all proposals. And, you know, if you're going to be ordering study sessions because this city had the contract tracing to tell you determine how your parents got COVID.'",
        "'speaker_6': 'My parents get COVID? Would they be able to tell me? For two years, I've been washing my hands. I've been wearing masks. I've been doing a whole lot. Wasn't really, you know, result of any of my actions that do something I rolled with rain.'",
        "'speaker_6': 'That's what you do. Could have done it better someplace else, maybe. Certain people responding to different pressures. But you know, we're all corrupt anyway. And, you know, none of this really matters, right?'",
        "'speaker_5': 'We have one member of the public in the zoom. And control. Your time begins now.'",
        "'speaker_2': 'Good evening. In Control formerly fifth district gerrymandered into the board. I'm glad that finally. The Water Department and.'",
        "'speaker_6': 'The city of Long.'",
        "'speaker_2': 'Beach will be returning. At least $9 million of the money that was illegally obtained from our. Water bill. It is incredible to me that it took the Supreme Court of.'",
        "'speaker_6': 'California.'",
        "'speaker_2': 'To finally get the city to do the right thing. Many of the residents.'",
        "'speaker_6': 'Protested against this.'",
        "'speaker_2': 'Transfer of funds. We argued that this was illegal. But because we didn't have over 50% of the ratepayers.'",
        "'speaker_6': 'Saying.'",
        "'speaker_2': 'This, the city council went ahead.'",
        "'speaker_6': 'And.'",
        "'speaker_2': 'Obtained this money illegally. Now that we're getting 9 million back, I would like to know when we're going to get the other 30 million back. Thank you for your time.'",
        "'speaker_5': 'That concludes public comment.'",
        "'speaker_3': 'Thank you. There's a motion in a second on the item. Please roll call vote.'",
        "'speaker_0': 'District one. District one.'",
        "'speaker_2': 'I am.'",
        "'speaker_0': 'District two.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District three.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'District four I, District five I, District six I, District seven I, district eight I, district nine.'",
        "'speaker_6': 'All right.'",
        "'speaker_0': 'The motion is Cory nine zero.'",
        "'speaker_3': 'Thank you. Next up is item number 20, please.'",
        "'speaker_0': 'Item 30.'"
    ],
    "Recommendation to adopt resolution to accept and expend grant funding from the California Department of Housing and Community Development (HCD), in an amount not to exceed $45,000,000; and  Authorize City Manager, or designee, to execute all necessary documents, and any necessary subsequent amendments, including amending the terms or award amount, with HCD relating to the grant application and award of grant funds, for acquisition and conversion of a hotel property, and construction of modular non-congregate shelter units for interim housing, for persons experiencing homelessness.  (Citywide)": [
        "'speaker_3': 'It's 30 over 20. But you're absolutely right. It's a it's a new business item 30.'",
        "'speaker_0': 'Item. Thursday's report from Health and Human Services and Economic Development. Recommendation two Adobe Resolution to accept and expand grant funding from the California Department of Housing and Community Development in an amount not to exceed 45 million for acquisitions and conversion of a hotel, property and constructions of a modular non conjugated shelter unit for person experiencing homelessness citywide'",
        "'speaker_3': '. Thank you. We have a most interesting customer option that we want to short report on this.'",
        "'speaker_7': 'Would love a short report on this.'",
        "'speaker_3': 'Okay, great. Please, staff.'",
        "'speaker_5': 'Yes. We have Paul Duncan, our homeless services manager, who can give a brief presentation.'",
        "'speaker_6': 'An evening mayor and council member. So the, uh, this is a authorization to enter into a contract for the state through the project homekey funding. We are currently in the process of applying for funding to purchase a number of modular shelters, 30 to 35 at the Multi-Service Center.'",
        "'speaker_6': 'And then we are in process currently around purchasing another motel for the utilization of non congregate shelter. So similar to the purchase of the best western. This would allow us to serve more people experiencing homelessness here in Long Beach that are our most vulnerable on the street.'",
        "'speaker_7': 'Gentlemen, thank you for the report. I just think it's important that we highlight this. This is a this is a pretty significant grant. Acceptance, but also application that we are engaging in every day. Residents ask, What are we doing about homelessness?'",
        "'speaker_7': 'I think this is a huge step forward and something that we need to definitely highlight and look forward to. Seeing tiny homes built and acquiring more hotels to serve as transitional housing for for those experiencing homelessness in our city.'",
        "'speaker_3': 'Councilmember Ringo.'",
        "'speaker_6': 'Glad to support.'",
        "'speaker_3': 'Thank you. My only question and maybe it's mistaken for somebody from staff because obviously this is really fantastic for the city and for I hope folks that are in-house on the Tiny Homes Initiative. What's the current timeline looking like?'",
        "'speaker_3': 'Is there anything updated from the last time we discussed? Are we still.'",
        "'speaker_5': 'There isn't an update. But what I would say is that once we get the the grant funding from the state, the idea is that we would use modular homes as a way to expedite that timeline. And the key there in terms of the timeline from the purchase to the installation is just making sure that the homes that'",
        "'speaker_5': 'we get are certified by the state so that we don't have to go through the planned check and inspection process locally. So that is something that we're in the process of exploring so that when we get the funding, we can identify the the manufacturer of homes that are certified by CD so that we can expedite.'",
        "'speaker_5': 'They're being put up and occupied pretty quickly. I can coordinate with the staff and get a rough timeline for you, but we're thinking it's probably somewhere between 60 and 90 days. And just keep in mind, I think we talked about it during the closed session when this item came up, is that we do have a requirement as'",
        "'speaker_5': 'a condition of the grant that once we receive that funding, we have a very quick turnaround to get the the that the units up and occupied. So we're planning ahead to be expeditious so that we can get them turned around in compliance with the grant procedures.'",
        "'speaker_3': 'Thank you. And from an I remember you had been be looking at narrowing down locations. Has that gotten any further on the modular housing initiative?'",
        "'speaker_5': 'Well, we are in addition to the tiny homes, we continue to explore other potential locations in the city and that effort will continue. We haven't identified a specific location yet, but we are we do have a number that we're looking at and we'll be bringing something forward once we have a site that we'd like to recommend to'",
        "'speaker_5': 'move forward.'",
        "'speaker_3': 'Great. Thank you very much. Madam Quirk, can you comment on this?'",
        "'speaker_5': 'If there are any members of the public that would like to speak on item in person, please line up at the podium in the zoom. Please use the raise hand feature by pressing star nine. See. Now, that concludes public comment.'",
        "'speaker_3': 'Let's go into our roll call vote.'",
        "'speaker_0': 'District one. Hi. District two, I. This took three. District three. District four I, District five I, District six.'",
        "'speaker_2': 'I, District.'",
        "'speaker_0': 'Seven I, District eight.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'District nine.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'The motion is Kerry eight two.'"
    ]
}