{
    "Recommendation to receive supporting documentation into the record, conclude the hearing and approve the hearing officers recommendation to deny the business license application submitted by Alsace Lorraine Fine Pastries, Inc., dba Alsace Lorraine Fine Pastries, located at 4334 Atlantic Avenue.  (District 8)": [
        "'speaker_0': 'We're going to move that item up. And we're also item 14 has also been withdrawn. And there are also no presentations tonight. And so with that, we're going to go ahead and get right into the hearings. And Madam Clerk, if we can begin with hearing item number one.'",
        "'speaker_1': 'Report from financial management recommendation to receive supporting documentation into the record, conclude the hearing and approve the hearing officer's recommendation to deny the business license application submitted by all seats. Lorraine Fine Pastries located at 40 334 Atlantic Avenue.'",
        "'speaker_1': 'An oath is required.'",
        "'speaker_0': 'If we can do. The oath.'",
        "'speaker_1': 'Okay. Everyone is going to be speaking on this. Please raise your right hand. You and each of you do solemnly state that the testimony you may give in the cause now in pending before this body shall be the truth, the whole truth, and nothing but the truth.'",
        "'speaker_1': 'So help you God.'",
        "'speaker_0': 'Thank you. With that, we're going to go ahead and turn this over to city staff for the report.'",
        "'speaker_2': 'Mayor. City Council members giving the presentation today will be Bret Jacobs from the Finance Management. Good evening, our mayor and members of the city council. Tonight you have before you a recommendation to uphold the hearing officer's decision to deny the business license application for Alsace-Lorraine Fine Pastries Inc doing business as RC salary and find pastries located at'",
        "'speaker_2': '4334 Atlantic Avenue in Council District eight. The hearing was continued at the October 18th, 2016, council meeting. The direction provided at that time was for the city to conduct outreach to the attorney representing the property owner, Mr. No.'",
        "'speaker_2': 'As a last good faith effort to see if a reasonable settlement offer would be forthcoming prior to tonight's hearing. Outreach was conducted by the City Attorney's Office, and it is my understanding that there have been no reasonable settlement offers submitted to the city.'",
        "'speaker_2': 'They will conclude my staff report and I stand ready to answer any questions council may have. Thank you.'",
        "'speaker_0': 'Thank you. With that, let me go ahead and turn this over. Is there any public comment on the hearing before we get into council comments? Please come forward.'",
        "'speaker_3': 'Good evening. My name is Ten West and I'm actually the attorney from the bar, the law firm for also sorry fine pastries. I'm to update the city council on this issue. There actually has been a settlement offer communicated to the city attorney, Mr. Zinger, dated November 17th.'",
        "'speaker_0': 'And just so you know, if we can just stop the clock because it's a hearing, you're going to have a reasonable amount of time. So 10 minutes under 10 minutes, if you can give you.'",
        "'speaker_3': 'Share, it will be less than five, hopefully. Okay. But just show up to the city council. A sort of make communication has been has been delivered to the city attorney's office. I don't know if the council has received that information.'",
        "'speaker_3': 'Hopefully, the city council can take that into consideration. But mainly I just wanted to discuss. This matter only in the sense that the denial of the business license to assist Lorraine was was due purely to the failure, I'm quoting.'",
        "'speaker_3': 'Failure of the property owner to comply with the global laws and regulations. It wasn't anything that the bakery did. It was what the landlord did. And such a license was denied to the bakery. I also want to point out that there was an article recently in the press telegram that stated that.'",
        "'speaker_3': 'The city expected the issue to issue a final denial and that the decision cannot be appealed again. The statement is actually not true. The appeal will take its course in the Superior Court, where it is now pending and thereafter.'",
        "'speaker_3': 'The bakery is ready and willing to take the matter to the Second District Court of Appeal if necessary. So. So. The City is aware and the City Council is aware. The matter does not end tonight. If needed, we can take the matter to court.'",
        "'speaker_3': 'And with that, I just wanted to update the city council on that information.'",
        "'speaker_0': 'Great. Thank you. Any other public speakers on the hearing? Seeing none. I'm going to go ahead and close the public comment for the hearing and go back to the council. So, Councilmember Austin.'",
        "'speaker_2': 'Thank you, Mr. Mayor. And and I want to thank the council and the rest of city staff for indulging us over the last several weeks. We did continue this matter in an effort to get a reasonable settlement agreement, as I understand it, and I've read some some news reports, press reports about this particular matter that I think'",
        "'speaker_2': 'we need to really work to to clarify this matter in terms of what's really at stake and what we're really dealing with here. And as I understand it, this case really boils down to the property owner does not have a business license to lease a commercial property because it was revoked doing due to his leasing space to'",
        "'speaker_2': 'an illegal marijuana dispensary. Because the property owner does not have a business license, the city cannot issue a business license for a business to operate at that location. Is that correct, Mr. City Attorney. That is correct. So I'd like to go over a few questions over the regarding the timeframe.'",
        "'speaker_2': 'And as I recall, the City Council enacted a ban on medical marijuana dispensaries in February 2012 after a court ruling. And before that time when the city was allowing a limited number of permitted dispensaries to operate. Was the medical marijuana dispensary operating at this location prior to the ban going into effect affected the city?'",
        "'speaker_2': 'Was it was it operating prior to the ban going into effect? Does anybody have knowledge of that? Councilmember Austin Yes, it was operating. However, it was not one of the lottery winners or one of the approved applicants under 5.7.'",
        "'speaker_2': 'So it was operating illegally. So it was an illegal operation, correct. Okay. And it was not one of the lottery winners permitted to operate under our order? That's correct. So even when the city had an ordinance in place allowing certain dispensaries, the dispensary at this property location was operating illegally in violation of our ordinance.'",
        "'speaker_2': 'Is that correct? That's correct. And was the property owner owner ever notified that he was leasing his property to an illegal business prior to the revocation of his business license to lease the property? Correct. We gave several warnings and then there were also 424 citations issued to the property owner, letting him know that he had an illegal'",
        "'speaker_2': 'business operating on his property. Did you how many citations did you say? 424. 424 citations. And what period of time was that? We issued citations from March 13, 2012 to August nine, 2014. Okay. Thank you. And according to the information in this agenda, item, ALSACE-LORRAINE applied for a business license in June 2014 to operate as a bakery'",
        "'speaker_2': '. However, the bakery was in operations before 2014. Was there a previous business license issued to Alsace-Lorraine? No. So Mr. No had the bakery license under his personal name, and that license was suspended on April 30th, 2014. We then received an application from All Syrian Fine Pastries Inc on June 19, 2014.'",
        "'speaker_2': 'So. So is the same Mr. No. Is it the same Mr.. No. Who had the business license under also is lowering the bakery the same property owner? So the property owner was also the bakery owner at one point in time.'",
        "'speaker_2': 'And so since April 30th, 2014, there has not been a valid business license for a bakery at that property. Okay. And so less than two months after his license was suspended, a new license application was received by a new owner from all states.'",
        "'speaker_2': 'Lauren, is that correct? That's correct. But Mr. No is still the property owner. That's correct. Okay. I'm just trying to get some clarification. I want to make sure that we're clear on this. So the bakery has been going has been operating without a business license in the city since 2014.'",
        "'speaker_2': 'Well, it goes to the appeal process. Is that correct? That's correct. So there has been, in my opinion, some some leniency in that regard, because do we normally allow businesses to operate without a business license knowingly? No. We knowingly do not allow businesses to operate well without a license.'",
        "'speaker_2': 'And what does the property owner currently owe the city? And fines and penalties. Can you work? Currently the amount that's owed is over $1,000,000 with penalties and interest. Okay. Last month, I made a motion to continue this hearing for 30 days to give the property owner an opportunity to reach a settlement with the city.'",
        "'speaker_2': 'Can the city attorney provide an update on what, if any, communications have taken place over the past 30 days to reach that objective? Councilman. Yes, our office did reach out to the business owner, the applicant, through his attorney, and indicated the motion that was made last month and gave them an opportunity to make what we would have'",
        "'speaker_2': 'considered to be a meaningful offer. We did not receive anything substantial compared to the outstanding debt of over $1,000,000. Okay. In terms of what we define as substantial. Ken, is is that is it possible for us to share the find the amount that they offered was $25,000.'",
        "'speaker_2': 'Okay. And as I recall, this appeal was referred to an independent hearing officer prior to it coming to the city council 30 days ago. That's correct. And what was the recommendation of the independent hearing officer? The recommendation was to uphold the decision to revoke the business license.'",
        "'speaker_2': 'Okay. In this matter, I think the city has has expended a tremendous amount of resources with a a property owner that has really shown no contrition, no remorse, and no regard for the the law for that established by the city.'",
        "'speaker_2': 'I don't think we have any other choices as a city at this point. And so I'd like to move to receive the supporting documentation into the record and conclude the hearing and approve the hearing officer's recommendation to deny the business license application submitted by Alsace-Lorraine Front Pastries, Inc.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_4': 'I support the motion.'",
        "'speaker_0': 'Okay, there is a motion any second. Is there any any council comment on this? There's a motion and a second on the floor. There's been public comment for the hearing. So at this time, we'll go and call a vote on the motion for the hearing.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the public hearing, consider the appeal by Warren Blesofsky and Long Beach Citizens for Fair Development, and uphold the Planning Commissions decision to approve an Addendum to the Shoreline Gateway Environmental Impact Report (#18-05 and #26-07), and approve a Modification to Site Plan Review to allow a 35-story mixed-use building with 315 residential units and 6,711 square feet of retail/restaurant space, previously approved for 221 residential units and 6,367 square feet of retail/restaurant space as part of the Shoreline Gateway Master Plan (Application No. 0510-27), to be constructed on a vacant parcel located at 777 East Ocean Boulevard in the PD-30 area.  (District 2)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Thank you. Please, if we can just go on to hearing number two.'",
        "'speaker_1': 'Report from Development Services recommendation to receive supporting documentation into the record, conclude the public hearing and consider the appeal by warm Lisowski and Long Beach Citizens for Fair Development and uphold the Planning Commission's decision to approve it. Approve an addendum to the Shoreline Gateway Environmental Impact Report and approve a modification to site plan review to allow a'",
        "'speaker_1': '35 storey mixed use building with 315 residential units and 6711 square feet of retail restaurant space, previously approved for 221 residential units and 6367 square feet of retail restaurant space as part of the Shoreline Gateway Master Plan to be constructed on a vacant parcel located at 77 seven East Ocean Boulevard District two and authors required.'",
        "'speaker_4': 'See City clerk. Go ahead with the oath, please.'",
        "'speaker_1': 'Okay. Anyone who's going to speak on this, please raise your right hand. You and each of you, do you solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_4': 'Thank you. Let's go ahead and turn it over to staff.'",
        "'speaker_2': 'Mayor, members of the city council providing the report today will be Linda Tatum, planning bureau manager and Christopher Koontz advance planning officer.'",
        "'speaker_3': 'Good evening, Mayor, and members.'",
        "'speaker_5': 'Of the Council. I'm pleased to present to you this project.'",
        "'speaker_3': 'Called the Shoreline Gateway Project. This is phase two of a master planned project. The project site is located at 777 East Ocean Boulevard, and that's on the corner of Ocean Boulevard and Alamitos Avenue. It is also located within the city's PD 30 downtown plan.'",
        "'speaker_3': 'And for just for context, it is diagonally north and west of the Villa Riviera project and other towers in the area are the International Tower and the Current.'",
        "'speaker_5': 'This project is part of the.'",
        "'speaker_3': 'Shoreline Shoreline Gateway Master Plan. This project was originally approved by the city's Planning Commission in 2007. The West Tower of this project, called The Current IS has now been constructed and is under occupancy.'",
        "'speaker_5': 'The East Tower, which is the subject.'",
        "'speaker_3': 'Power, the subject tower for tonight's discussion, was also approved by the Planning Commission, and that approval included a tentative track map for condominiums for this project, as well as an administrative use permit which allows.'",
        "'speaker_5': 'Shared parking between the two towers of this project.'",
        "'speaker_3': 'The site upon which.'",
        "'speaker_5': 'The tower will be built is.'",
        "'speaker_3': 'Currently vacant and is now used for parking.'",
        "'speaker_5': 'Just to familiarize you with the site plan. Vehicle access to the project will be from Medio Street.'",
        "'speaker_3': 'That is the first street in the north and parallel to Ocean Boulevard. The site is the project will be developed with a five level subterranean parking garage that has 458 spaces. Pedestrian access to the project is from a public plaza that shared.'",
        "'speaker_5': 'Between the two towers.'",
        "'speaker_3': 'And the project will be designed with retail on the ground floor, with the residences above. And the retail has been designed so that it faces both Ocean Boulevard and the Alameda Street corridor. The site is lushly landscaped with street trees and other rich landscape plantings.'",
        "'speaker_3': 'Let's talk a little.'",
        "'speaker_5': 'Bit about the project proposal. The details of the project is that it was approved with.'",
        "'speaker_3': '221 condominium units, and that also.'",
        "'speaker_5': 'Includes 6300 square feet of.'",
        "'speaker_3': 'Retail and restaurant space. The project is intended to complement other developments within the PD 30, which call for a mixed use project that provide a restaurants and retail and other commercial establishments to service not only restaurants, but generally the population of the greater downtown area.'",
        "'speaker_3': 'The modification of this project.'",
        "'speaker_5': 'Which has been requested as a part of this approval or is a part of the Planning Commission approval was to increase.'",
        "'speaker_3': 'The number of condominium units in the project by 94 units and also a total of four, a total of 315 units in the project and that's within 67 100 square feet of residential area. The previously approved project was 35 storeys in height and that will not change to arm.'",
        "'speaker_3': 'This project is at 35 storeys, approximately 417 feet in height, and that this is not any change from the previously approved height of the project. Briefly. Some of the project amenities include a common open space area on the project, both a podium level garden and open space area.'",
        "'speaker_3': 'There is also a roof deck, an approximately 8300 square.'",
        "'speaker_5': 'Feet of roof deck.'",
        "'speaker_3': 'There are also common indoor. Com. An indoor open.'",
        "'speaker_5': 'Space area is inclusive of two community rooms.'",
        "'speaker_3': 'And lounges. And that's in about 7300 square feet of common indoor open space area. That also includes a 2200.'",
        "'speaker_5': 'Square foot gym.'",
        "'speaker_3': 'Rooftop pool and spa. And the.'",
        "'speaker_5': 'Project has.'",
        "'speaker_3': 'About 93% of the total units in the project, which come in a range of sizes, but they are mostly about 93% of them have private balconies. Briefly to the building design, the the.'",
        "'speaker_5': 'Tower is designed.'",
        "'speaker_3': 'To represent a a sale of the mass of a sail, a very graceful curvature of the building accented by the balconies. The exterior materials of the building are primarily glass, but it does have bird safe glazing on the windows and the concrete slabs that give you the vertical elements of the building.'",
        "'speaker_3': 'It very nicely complements the existing current building in both in terms of the design and the materials of the project. This design, as I mentioned before, is not changed from the previously approved project in height or in design.'",
        "'speaker_3': 'I would also note that in terms of the project's parking, the height.'",
        "'speaker_5': 'The setback requirements.'",
        "'speaker_3': 'And all of the other PD 30 or the downtown plan requirements have been met within this project. As a matter of fact, the project exceeds the parking by 50 approximately 58 parking spaces.'",
        "'speaker_5': 'I'd like to turn briefly to the environmental issues on the project.'",
        "'speaker_3': 'The project, as I mentioned earlier, previously, had a certified EIA back in 2026. And in 2007 the project changed slightly and had a supplemental air that was also.'",
        "'speaker_5': 'Certified for this project with the requested.'",
        "'speaker_3': 'Change in the addition of units, an initial study checklist was proposed or was conducted, and the purpose of that checklist.'",
        "'speaker_5': 'Was.'",
        "'speaker_3': 'To look at each one of the 18.'",
        "'speaker_5': 'Categories of potential impacts to determine if there were any additional impacts. And that was done due to the unit and the square footage increase. What did occur was the consultant looked at excuse me, they prepared updated traffic studies, NOI studies, air quality.'",
        "'speaker_3': 'Analysis and greenhouse.'",
        "'speaker_5': 'Gas emissions for the project. So those were the extent of the technical studies that were prepared.'",
        "'speaker_3': 'In the basis of.'",
        "'speaker_5': 'Those studies fundamentally determined that there were no additional significant project impacts. And the basis of these studies.'",
        "'speaker_3': 'Was the cities or the the decision to proceed with an er addendum and because.'",
        "'speaker_5': 'The studies demonstrated.'",
        "'speaker_3': 'That no significant impacts were were going to be resulting from the addition of the 94 units. The addendum was the choice that was made in terms.'",
        "'speaker_5': 'Of pursuing the.'",
        "'speaker_3': 'Environmental determination and seek what does allow this when no additional significant effects can be determined? In summary, I'd like to just note that the Planning.'",
        "'speaker_5': 'Commission hearing on October 26.'",
        "'speaker_3': '26 or.'",
        "'speaker_5': 'October 20th, 2016.'",
        "'speaker_3': 'The Planning Commission conducted a public hearing on this.'",
        "'speaker_5': 'Project, and they unanimously voted to approve the project.'",
        "'speaker_3': 'They certified the Environmental Impact Report Addendum. They also approved the the site plan review.'",
        "'speaker_5': 'Modification for the project.'",
        "'speaker_3': 'And I would note that during the public hearing there was there.'",
        "'speaker_5': 'Were.'",
        "'speaker_3': 'There were residents or members of the public that.'",
        "'speaker_5': 'Spoke against the project.'",
        "'speaker_3': 'But there were a substantial number of supporters of the project. Both residents, business.'",
        "'speaker_5': 'Owners, as well as the.'",
        "'speaker_3': 'Local business associations came out to support the project.'",
        "'speaker_5': 'I'd just like to briefly note that the appeal of this project.'",
        "'speaker_3': 'By a third party, Mr. Warren Plus AFC, he's an individual as well as representing a group called the Citizens for Fair Long Beach Development, they said. They cited the grounds for the appeal as the improper use of an ER addendum and because the planning commission was the deliberative body, an approval body for the those actions that I'",
        "'speaker_3': 'noted earlier. The City Council by.'",
        "'speaker_5': 'By our code is slated to hear the appeal.'",
        "'speaker_3': 'However, Planning Commission.'",
        "'speaker_5': 'Decided to.'",
        "'speaker_3': 'Approve the project and in closing, staff recommends that the City Council uphold the Planning Commission recommendation.'",
        "'speaker_5': 'To deny they.'",
        "'speaker_3': 'Deny the appeal and to uphold the Planning Commission's decision to approve.'",
        "'speaker_5': 'The project.'",
        "'speaker_3': 'And also to certify the previously certified addendum to the Environmental Impact Report, as well as the site plan review application to allow the.'",
        "'speaker_5': '35 storey mixed use project with.'",
        "'speaker_3': '315 units and 6700 square feet of retail residential space. This project completely complies with all of the city's development standards and the environmental impact reported. Denim was appropriately prepared in conformance with sequel requirements. That concludes today's presentation. And we have staff available as well as the city's traffic engineer, to answer any questions.'",
        "'speaker_5': 'Regarding the project or the environmental document.'",
        "'speaker_0': 'Thank you. With that. Before we get to the council, I want I know there's a few folks that that raise your hand took the oath, did some public comment. So let me go to the public comment for the hearing and then we'll go to the city council.'",
        "'speaker_0': 'So if you have public comment. Well, hold on 1/2 before we go. If we have public comment, we're going to go line up after the I believe the appellant goes first.'",
        "'speaker_2': 'Let's go first. Okay.'",
        "'speaker_0': 'So if we can, please have the appellant, please come first. M city attorney believe that a reasonable amount of time, if they want, is up to 10 minutes.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_0': 'Okay. And then everyone else will get 3 minutes of public comment. So please.'",
        "'speaker_6': 'Hi. Thanks for having me here tonight. Thanks for taking this appeal. And I just want to introduce myself. My name is Warren Lisowski. I represent myself personally as well as Long Beach Citizens for Fair Development. I'd like to start out tonight by addressing a couple of the concerns I had with the staff's oral report tonight.'",
        "'speaker_6': 'She stated that the original EIA that was approved changed slightly when they created the supplemental air, I believe it was in 2008. That originally was, I believe, a 21 or 22 storey tower. The West Tower changed to a 35.'",
        "'speaker_6': 'So calling that a slight change, I think is a little bit of a misrepresentation. And also, I just wanted to note the term no significant impacts because that's going to be a theme tonight as we review the school guidelines and how the city has addressed how to proceed here.'",
        "'speaker_6': 'So let me just start out by saying that. We're here to establish ourselves as an aggrieved status. One of the ways that we become aggrieved is to register our objections with the City Council and then come and speak here for or against that particular approval in a hearing.'",
        "'speaker_6': 'I just wanted to go ahead and make the point that this hearing would not be happening here tonight if we had not made the appeal. The city was fine with the developer to just push this through the planning commission and never have this come up at full council.'",
        "'speaker_6': 'So I just wanted to know the fact that this may seem like a normal approval process, but it was only due to the objections of some stakeholders that we are now going through the appeal. So we feel that the city is colluding with the developer in attempting to make what are significant changes to this project with with'",
        "'speaker_6': 'significant impacts to the environmental to the environment without environmental impact report is a violation of California Code 15162, which governs subsequent environmental impact reports. So I just want to make a couple points as to why the site plan, revision and addendum to the EIA should not be approved.'",
        "'speaker_6': 'And in fact, it just popped into my mind while staff was speaking that most of the focus has been on the environmental review. But we should also note that in revising the site plan review, that that I believe falls outside of environmental law.'",
        "'speaker_6': 'And so, you know, there's a lot of emphasis being placed on what are the effects of the environment and is the city and the developer following the law in terms of environmental review. But I just wanted to put it out there that by significantly changing the site plan, the Planning Commission had an opportunity to really let the'",
        "'speaker_6': 'stakeholders and community members review the changes that were being made to see what best suited not only the environmental regulation, but also what's best for downtown Long Beach residents. So just a couple key points here on the supplemental addendum to the EIA.'",
        "'speaker_6': 'The project was approved as a condominium and I believe both of the towers were approved as condominiums. And it sounds like from the developer's testimony at the Planning Commission that these are going to be used as apartments. I might be mistaken, but I think there's some evidence that the environmental impact of a rental high rise is possibly'",
        "'speaker_6': 'different than an owner owned condominium development. Number two, the change in the number of units. The developers proposing to change the number of units from, I believe, 221 to 315. If you do some simple arithmetic, you will find that this is a 40% increase in the number of units.'",
        "'speaker_6': 'When we look at the supplement to the E.R. that the staff has accepted from the developer and I believe it was Rincon consultants, you'll find that 18 categories of environmental impact with something like 100 subcategories have all been determined to have no significant impact.'",
        "'speaker_6': 'Now, let's just think about that logically for a moment. If you have 220 some units and now you have 315 units, an increase of over 40%, I think it would be logical even for a child to understand that this will have significant impact on traffic, parking, ingress and egress of the building.'",
        "'speaker_6': 'Regardless of what staff might say and the developer about the parking being overstated by 67. Some units, parking is in fact understated, depending on how you count by 2 to 300 spaces. Also number four, I'd like to bring up the administrative permit for these shared commercial and guest spaces that was issued in 2007.'",
        "'speaker_6': 'I don't know how many of you used to live in downtown Long Beach or use any of the businesses parking in downtown Long Beach. But. Shared commercial and guest spaces is just not it's not going to work. And this administrative permit that was issued in 2007, which is now almost ten years old, the downtown parking plan requirements'",
        "'speaker_6': 'have changed since then. The densities and ratios have changed. And I saw no evidence that the staff or the developer or the consultants had addressed the issue of the change in the code and if the administrative permit is still valid.'",
        "'speaker_6': 'At the Planning Commission meeting, staff stated that because the developer used a tentative condominium map that there is indefinite extensions under state law for both the administrative use permit as well as the tentative condo maps. I find no evidence of that under state law that a tentative condominium map would result in an administrative use permit being extended'",
        "'speaker_6': 'indefinitely. So. Basically to summarize, it appears that staff and the developer, with the help of their consultants, have, quote unquote, backed into the result they wanted. They wanted to make significant changes to the building. The environmental code says that if there's no significant impacts, that there's no new air is needed.'",
        "'speaker_6': 'And surprisingly, they have a 35 page report with over 150 different sub items, all resulting in exactly that result, no significant impacts. That's very suspect on its own. Finally, I just wanted to wrap up with the history of this project.'",
        "'speaker_6': 'It was originally approved at, I believe, a 21 or 22 storey towers. There was a subsequent amended E-R that was issued later and now. So it has grown from a 21 storeys to 35 with 220, 221 units now to 35 storeys with over 300 units.'",
        "'speaker_6': 'You can see how the city approves one project. And then over a ten year period the project changed and grows. This is called piece mealing and it does not give the stakeholders an opportunity to properly see how these developments are going to affect the community.'",
        "'speaker_6': 'Also, I believe that the each of these should not stand alone. They should be looked at as a whole per the school guidelines. And so just to wrap up, I see a couple of past forward. I spoke here a couple of months ago about a different project.'",
        "'speaker_6': 'I told the city council that I've been a long time Long Beach resident. I feel that you never listen to public comments. The votes are almost all unanimously rubber stamped eight to nothing, and that I feel that the only thing that the city listens to is litigation.'",
        "'speaker_6': 'And so I see two paths forward. We can go back, we can accept this appeal. We can make the developer go back and follow the law just like everyone else has to follow the law. Or we can once again litigate, which we're prepared to do.'",
        "'speaker_6': 'So if you guys have any questions for me, I'm sure you don't. I'd be happy to answer them. And with that, we'll wrap up. I'll stick around for the rest of the hearing. Maybe we'll have some surprise tonight, but I appreciate your time.'",
        "'speaker_6': 'This is sincerely an important issue to me and many other of the residents of Long Beach. And so thank you for your time.'",
        "'speaker_0': 'Thank you. And now we're going to go ahead and have the public comment, please. So this is for 3 minutes each. So please come forward if you're doing public comment on this issue. And yes, so please come forward.'",
        "'speaker_5': 'My name is and Prophet. I've been a resident of Long Beach since 1975 and a homeowner in the East Village for more than seven years. I also used to own a home in Belmont Heights, and I'd like to congratulate the Planning Commission and City Council for running once again, showing callous disregard for citizens quality of life.'",
        "'speaker_5': 'Last month, the Planning Commission rubber stamp the sea, towered ocean and Alamitos. Even though the project is added 13 stories, 94 units and only added 65 parking spaces. How delightful. That does not conform to the horrid downtown plan and needs a new air and secure observation.'",
        "'speaker_5': 'Obviously, neither Council nor Planning Commission is thinking about the current residents of the East Village Arts District, where ponds do your desire for more people, more density, less light, less air, and insufficient infrastructure for incoming residents? Less parking, of course.'",
        "'speaker_5': 'I know nothing I say will have any meaning for you, but I ask you to consider the needs of the people currently living here. It's not right to dismiss us as chattel. The West Tower of this complex was approved as a very, very different building from what was constructed.'",
        "'speaker_5': 'It was supposed to be life like the one that you're going to construct later. No doubt the contractor will flimflam the city once again, send envelopes and make it just as ugly as the West Tower. So once again your callously disregard my comments as you always do, and act in your own benefit.'",
        "'speaker_5': 'Since none of you live in the East Village. You don't have a clue of the harm that you're causing. But you will once all of this is done, because we're all going to commission for diminished value of our properties, because that's what's going to happen to all of us that surround this area.'",
        "'speaker_0': 'Thank you. Next speaker, please sit down.'",
        "'speaker_2': 'Jim. Danno. I live at 539 Daisy Avenue. Do we have any white sage? Because I'm here to support this project. I think it's a fantastic project. The developer's done a great job. Ten years ago, Long Beach was not the city we are right now.'",
        "'speaker_2': 'Thank goodness we're starting to see some skyscrapers and cranes in our skylines. We need some density. I personally see the maintenance issues on the city on a daily basis. We need people that are going to be living here.'",
        "'speaker_2': 'More units are better for us. I'm glad that they've switched from whatever it was, 200 condos to 300 apartments where more people can come in and enjoy our city. It's a it's a wonderful development. I support it wholeheartedly.'",
        "'speaker_2': 'I know local businesses here support it. They need people here to support the ideal that we're trying to have in downtown. Thank you very much. Appreciate you.'",
        "'speaker_0': 'Thank you very much. Next speaker, please.'",
        "'speaker_2': 'Hello, I'm Joel Weinstein. I live in the eighth district. I'm speaking on behalf of myself and on behalf of members of citizens about responsible planning whom you may have learned recently had a favorable settlement with the developer with the Riverwalk project.'",
        "'speaker_2': 'A little over a year ago. We were here to oppose that project, not because we're opposed to density per say in every place, not because we're opposed to development, but because we want good development in the right place.'",
        "'speaker_2': 'And because we want to see. The laws of the state of California, which, after all, is what charters the city of Long Beach. We want to see those laws upheld. We don't want to see scofflaw try to cut corners on the law.'",
        "'speaker_2': 'Behavior by our city council. But that's what we got a year ago. For example, you approved a new zoning for Riverwalk, which did not exist and could not legally have existed until a week after you approved the project.'",
        "'speaker_2': 'It just didn't make any sense. Why not do things in the proper order? Take a little more time if it's even more time at all and do it right. We have a situation like that here. Here is an air which is almost ten years old, refers really to a different project.'",
        "'speaker_2': 'The right thing to do is to do an air that actually refers to the parameters of this project. Well, in place of that, there is this proposed addendum that allegedly finds no significant impacts. Our number 100 category. Well, you know, whatever you ever note about the straw that breaks camel's back, each little bit of straw has no'",
        "'speaker_2': 'significant impact together. Its tremendous impact. Let me take one example. That is carefully elided over into so-called no significant impacts. And by the way, the addendum tries to use qualitative language when in fact the big impact is that every single impact is going to be an impact on or by 94 additional units.'",
        "'speaker_2': 'How many of you have ever been trapped in a tower? Lights off because an earthquake has just disrupted the power. How are you going to clear a building with 94 additional units? I have been in that situation and to my good luck, I was not 35 storeys up or even 18 storeys up.'",
        "'speaker_2': 'I was only five storeys up. I can tell you that even if the building is pronounced safe by the engineers, you're not going to want to stay there. And the emergency services that allegedly exist.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_2': 'Not will exist on paper. Just see how well they perform.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Next speaker, please.'",
        "'speaker_7': 'Yes. My name is Jess Johansen, 700 East Ocean Boulevard. I've been a homeowner at the International Tower for 14 years. I'm here in support of the project. I think it's fantastic for the neighborhood. I remember when it was a different project, but over the years, which has been quite a few, you know, there have been changes and'",
        "'speaker_7': 'I think they've all been for the better. Obviously it seems like the focus has been on the increase of the number of units, but from what I understand of the real estate environment these days, I mean, that is kind of the the way things are.'",
        "'speaker_7': 'I mean, you are getting smaller units. So affordability is still available for as many that can possibly buy or rent in a tower like this. Long Beach should be very proud to have a developer who wants to erect a tower like this.'",
        "'speaker_7': 'I'm still lamenting the fact that Lennar decided to give up their tower and go with a box for the ocean air. I think that's unfortunate. This not to trash them. But the point is, I think we have a fantastic opportunity with seven, seven, seven tower.'",
        "'speaker_7': 'I bought it International Tower because that was an iconic tower. I'm excited to be across the street from the Village Riviera, another iconic tower. And I'm looking forward to the time when we have seven, seven, seven tower complementing the corner of shoreline and ocean.'",
        "'speaker_7': 'So with that, again, you have my support and I would encourage you to follow through with the approval that the Planning Commission made and allow the developers to move forward with the project. Thanks.'",
        "'speaker_0': 'Thank you. Next beacon, please.'",
        "'speaker_7': 'Yes, my name is Rick Hopper. I'm the chief information officer for Molina Health Care here in Long Beach. Molina currently has over 8500 employees that work in Long Beach. Personally, I moved to Long Beach two years ago and a year ago I purchased a condominium for my mother here.'",
        "'speaker_7': 'It's a wonderful area. I work on Sixth and Pine in the old Meeker Baker building and Seventh and Pine and I have almost 800 full time employees in those facilities. Many of them live in Long Beach. I'm looking at opportunities to continue to attract more employees here.'",
        "'speaker_7': 'And the more housing we have, the better. I think you've built a beautiful building with the current and very much in favor for this project. So thank you.'",
        "'speaker_0': 'Thank you so much. Next speaker, please.'",
        "'speaker_5': 'Thank you. My name is Jane Netherton, and I'm not representing a company or a group, but I'm here as an individual who has watched this project from inception. I was on Redevelopment Agency looking at what we wanted to do in the downtown with the community, wanted to do and what the spirits told us they wanted in the'",
        "'speaker_5': 'downtown in this project was everything we had hoped it would be. It took a long time to get it going. And I'm here to talk not about the square or the air, because what the staff is has documented and that is appropriate.'",
        "'speaker_5': 'I've looked at a lot of ERs during my redevelopment days, and even now looking at it through the Oversight Commission that I sit on, what I'm here to talk about is the developer, the integrity, the developer, the stamina of the developer who from 2004 on went to the public constantly to find out what it was they wanted'",
        "'speaker_5': ', what they didn't like, what he could change to make them happy. You know, you might block the sun for 35 minutes if you put a building up. There's just too many things you can go through to say why you shouldn't do something.'",
        "'speaker_5': 'However, he stuck with it oh, eight, nine tough times. He stuck with it. He could have walked away. He didn't walk away. And he got very involved in the downtown, actually recommended him to be on the downtown Long Beach Associates board, which he did, and then ended up being chair for either two or four years.'",
        "'speaker_5': 'So he was very involved in what went on downtown and very passionate about the downtown. He does what he says he's going to do. He carries forward great partner. Led court came along. I must say that not only was I redevelopment, but I did an interim financing for the project through International City Bank.'",
        "'speaker_5': 'But led court to me just said, Hey, this is a great project I want to be involved in as well. And I think it just showed the strength of the project 2000 2016 and he has 75% occupancy in a building that hasn't even been open a year.'",
        "'speaker_5': 'That tells us that there is a need for the for the project. There is a need for that for the units. The more people we have downtown, the livelier downtown is going to be. And we have businesses coming in.'",
        "'speaker_5': 'We need to have housing for them. So I just think the developer is a stand up developer follows follows the guidelines and I would urge the council to approve the project. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker, please. But I close the speakers list, so. Okay. Mr.. Good to hear the final speaker.'",
        "'speaker_2': 'Good evening. My name is James Sullivan. I reside at the Villa Riviera at 800 East Ocean Boulevard. I actually own there as well. I've been an owner for nearly 14 years. I owned more than one unit. And I also some of the previous speakers have kind of stolen what I was going to say.'",
        "'speaker_2': 'So I'll just echo what Mr. Netherton said. The builder came and was very, very responsive and open with our homeowners association. I was president of the board back when they first started proposing this. They were very receptive to what all of the owners had to say.'",
        "'speaker_2': 'And our comments and it's reflected in the project that we see today. I'd also like to echo what one of my neighbors at the International Tower said. I do. This is another iconic building. It's going to fit very nicely, I believe, with the nature of that intersection.'",
        "'speaker_2': 'And I look forward to it. And I urge the council to uphold what has already been approved. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, please.'",
        "'speaker_2': 'Good evening, Mr. Mayor. Members of the.'",
        "'speaker_4': 'Council. My name is Craig Cogen with the downtown Long Beach Alliance. We're here in support of the project for the same reasons that we've supported this project since day one, spanning over ten years. We have included those reasons and our public letter of support that we'll provide to the city clerk and certainly look forward to your support'",
        "'speaker_4': 'this evening as well. Thank you.'",
        "'speaker_0': 'Thank you. And finally, you're good to.'",
        "'speaker_2': 'Very good. You click as the address. As I see this. This Council is presented with a very rare opportunity that very few councils. They find themselves in this situation they're in are presented with. You have a chance. To try to mitigate or ameliorate.'",
        "'speaker_2': 'The disastrous decision you made relative to urinating away near $9,000,900 million or whatever the figure is for the $100 million for the new city hall. Following a paradigm that almost bankrupt the California state judicial system. My suggestion is you look at this project.'",
        "'speaker_2': 'And look at it not as the. It's presented now, but it is an opportunity to relocate the city hall. In that structure period. You've got the parking. You've got the building. You know, it's you're going to have to make the requisite arrangements with the developer, do the mea culpa and try to salvage as much as you can'",
        "'speaker_2': '. But this you. To pass up this opportunity really would be an indictment. Of this council that will last forever. You represented you made a mistake. You lacked the character as a council to step up to it. And again, as if my information is correct, you were told in a closed session that aside from the elevators.'",
        "'speaker_2': 'Structurally there's nothing wrong. There's no great earthquake, that potential damage to this building. You've got an opportunity to correct that mistake. I would suggest you lay this over. And review the option that I suggested. Thank you.'",
        "'speaker_0': 'Q That concludes public comment. At this time, I'm going to give the appellant, if you want a couple minutes to say anything else at the close if if you didn't say.'",
        "'speaker_6': 'Thank you, Mr. Mayor. Just one thing. I just wanted to say that we're not against development. We're not against density. We're not against the general plan. We just want the city to follow the law. If I jaywalk, I get a ticket, I pay the fine, and the city runs roughshod around environmental guidelines.'",
        "'speaker_6': 'So follow the law and we won't have this issue. It's not that hard. We know why the developer doesn't want to do it. The Environmental Impact Report probably cost four or $500,000. So don't facilitate the developers circumventing the law.'",
        "'speaker_6': 'The law is there for a reason. We follow it for a reason. One more thing. There was a big court case from the Supreme Court on just this issue that came down last month, and it didn't really clear up the issue very much.'",
        "'speaker_6': 'The one thing it did clear up is that the standard possibly was changed a bit. And you don't have to do a new air just because you've made small changes. But if there's significant changes, you do need to do it the air.'",
        "'speaker_6': 'And that's exactly what situation we're in. So thanks so much for having me. Those final comments. Appreciate it.'",
        "'speaker_0': 'Thank you. With that, we're going to conclude the comments with the public hearing and go back to the city council. Councilmember Pierce.'",
        "'speaker_8': 'Thank you. I really want to first just get a question out of the way before I share my remarks. City Attorney Are we following the law? Yes. Thank you. I would like to very much thank the people at Anderson Pacific for their diligent work on this.'",
        "'speaker_8': 'This has been a project that's been 12 years in the making with literally hundreds of neighborhood meetings, a thorough review by Development Services, Planning Commission and secret process. One of the biggest concerns for my district, of course, is about process over development and parking.'",
        "'speaker_8': 'But this project is not that the developers have made sure that the Shoreline Gateway provides community benefits. They've created a temporary park that will become permanent, which provides much needed green space in our district and a path to the beach.'",
        "'speaker_8': 'We've also included on the lobby floor they've included public space with public art, which is accessible to everyone to come through. Although the city parking requirement is is different in the downtown plan, when they've increased the units in this development, they've also increased the number of parking units.'",
        "'speaker_8': 'My understanding is roughly around one per bedroom, which is more than the downtown plan. And so when constituents ask about parking, this obviously is the first thing. And I think they've gone above and beyond what the downtown plan has requested.'",
        "'speaker_8': 'In their first building, the current was LEED certified Silver Tower in Long Beach and Shoreline Gateway will be the first LEED Neighborhood Development Gold Project in the city of Long Beach. They're bringing more good paying jobs to Long Beach by committing to pay their workers prevailing wage.'",
        "'speaker_8': 'And Shoreline Gateway is is just that gateway from east side of Long Beach that welcomes people into our downtown. It will act as a catalyst for the East Village and these pieces of land that have remained dormant for decades.'",
        "'speaker_8': 'Shoreline Gateway continues to be the goal of creating a good, walkable, livable city. And I look forward to continued development in downtown. I think we've done a great job about that challenge we had with enough market rate housing in downtown.'",
        "'speaker_8': 'And so I see this is one of those projects that continues to do that, knowing that future developments. You know, we will obviously have conversations around diverse housing options in downtown and throughout my district. But tonight, I really want to make sure that my community knows that I've had I have a big stack of letters in support'",
        "'speaker_8': 'of this project, and I have two letters opposed to this project. And so definitely when thinking about community support and where community is on an issue, that's something that's really important to me. And so I want to ask my colleagues to deny the appeal and to support moving forward with this project.'",
        "'speaker_8': 'Thank you so much.'",
        "'speaker_0': 'Okay. And that's the motion, Councilwoman Gonzales.'",
        "'speaker_3': 'Yes. I also would like to just copy the sentiments of my my colleague, council member Pearce. I think what she said is definitely true. I know many of her residents have been in support, have had many discussions and community meetings.'",
        "'speaker_3': 'I want to thank Anderson Pacific Development staff as well as our planning commission as well. And I know when we look at many of these being the other half of downtown, if you will, we look at what is going to create a new wave of urban living growing.'",
        "'speaker_3': 'I'm a downtown resident myself. I think myself along with the mayor downtown residents. We love being there. It is where we raise our families. It is where we patron many of our local businesses. And it's where I hope to continue raising my families and growing many different opportunities there.'",
        "'speaker_3': 'And when we are looking at projects, we're not just looking them at looking at them solely just as a project, but building a place that creates an atmosphere as this would also transit. We have to think about that as well.'",
        "'speaker_3': 'Transit oriented development when we're looking at development and growing demand for walkable, bikeable cities, which I think this exactly exudes. So thank you so much for this. I support the denial of the appeal and also Councilmember Pearce's comments.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And I just want to just briefly, you know, I think it's no surprise I'm a huge supporter of this project. I've been supportive of this project ever since I first heard about it. And I probably attended, you know, half a dozen meetings as a as a local downtown resident who had just bought a, you know'",
        "'speaker_0': ', a place downtown and wanted to get involved and wanted to learn about what was going on. And so I just want to I know this is in some ways, a conclusion of the of some of this process. And I just wanted to thank, you know, Jim, Jane, Ryan, Craig, everyone that's been involved in this.'",
        "'speaker_0': 'Thank you for the dozens and dozens of community meetings that you all hosted to get public input on this project over the course of all those years. And this is we need more housing of all kinds, but we also need more housing for for people that want to work.'",
        "'speaker_0': 'One of the things I hear all the time from the engineers at Virgin Galactic and the people that are that are moving in over at Douglas Park is how difficult it is for them to to find homes or apartments in Long Beach.'",
        "'speaker_0': 'And so this is going to provide another opportunity. And I want to just thank you for a stellar project. And we'll also, by the way, be the tallest tower in the city of Long Beach when completed. So that is also, I think, something to be very.'",
        "'speaker_0': 'Proud. And so, Mr. City attorney.'",
        "'speaker_2': 'In there, I just wanted for the record to make sure that the Council understood that the approval of this motion includes approving the addendum, approving the site plan, review modification as described by staff, and the increase in the various numbers that were presented in the staff report and the recommended action.'",
        "'speaker_0': 'Thank you, Councilman Pierce. Perfect. Okay, so there is a motion in a second on that. Please cast your votes.'"
    ],
    "Recommendation to receive supporting documentation into the record, conclude the hearing and grant an Entertainment Permit with conditions on the application of Ramon Orozco, dba Barbies Bar, 1008 East Artesia Blvd., for Entertainment Without Dancing.   (District 9)": [
        "'speaker_1': 'Lucian Karis.'",
        "'speaker_0': 'Thank you. We'll be going on to hearing number three.'",
        "'speaker_1': 'Report firm financial management recommendation to receive supporting documentation into the record, conclude the hearing and grant an entertainment permit with conditions on the application of Ramona Orozco doing business as Barbie's Bar, located at 1008 East Artesia Boulevard for Entertainment Without Dancing District nine and oath is required.'",
        "'speaker_0': 'If we can do the oath, please.'",
        "'speaker_1': 'Everyone is going to speak on this. Please raise your right hand. You and each of you do solemnly state that the testimony you may give in the cause now and pending before this body shall be the truth, the whole truth, and nothing but the truth, so help you God.'",
        "'speaker_0': 'Thank you. We can have a staff report, please.'",
        "'speaker_2': 'Mayor, members of the city council providing the report today will be Brett Jaquez, business services officer for Finance Management. Good evening, honorable mayor and members of the city council. Tonight you have before you an application for entertainment without dancing for Ramon Orozco doing business as Barbie's Bar located at 1008 East or TiSA Boulevard.'",
        "'speaker_2': 'Operating as a bar tavern lounge in Council District nine. All of the necessary departments have reviewed the application, have provided their recommended conditions as contained in the hearing packet. I, as well as Police Department, stand ready to answer any questions Council may have, and that would conclude staff's report.'",
        "'speaker_0': 'Thank you. Anything else on the staff report side?'",
        "'speaker_2': 'Not at this point.'",
        "'speaker_0': 'Okay. Any public comment on the hearing? Please come forward.'",
        "'speaker_5': 'Hi. My name is Mon about a bear and I am a homeowner. I'm representing myself as resident board member in the community, as American Youth Soccer Association Organization, board member, Little League Board member, program manager, as a home visitation program for Healthy Families America and a member for Prevent Child Abuse and Neglect in the City of Long'",
        "'speaker_5': 'Beach. So I have a couple of concerns in regards to Barbie's Spa. I've been a resident for 13 years. I am the second home in the area and I don't know for what reason. Things have changed in regards to having loud music.'",
        "'speaker_5': 'We've had noise control issues, parking. They have about 8 to 9 parking spots. They're able to manage to squeeze in anywhere from 20 to 22 cars in that area. We can no longer play catch outside with our kids.'",
        "'speaker_5': 'I brought my family. We are in baseball and soccer. Like I mentioned before, as well as softball. And we have a big charter bus that parks right on our street. And so along with taking having that big view, wonderful view, as you guys can imagine, we also have trumpets.'",
        "'speaker_5': 'I love Mexican music. I am a mexican myself. But when you are dealing with a large band like they've been bringing in as the beginning, I would say about this year, the bar has always been there. We're not opposed to that.'",
        "'speaker_5': 'I didn't even know it existed for many years. There must be a new owner. I don't know what it is, but now the interest is in the back. We have various women coming in and out being dropped off.'",
        "'speaker_5': 'So that's kind of a concern for me. I cannot come home and get out of my car without sleazy comments. I do not need to be talked to inappropriate. I do not need to come out in the morning and find all these bottles in the front of my house.'",
        "'speaker_5': 'I don't I want to come home and be able to park in my parking lot without asking people to move. Now they have a taco truck and they are bringing in taco trucks. So we have people ordering, thinking it's drive thru and that it's okay to come and park and block the residents driveways as you can.'",
        "'speaker_5': 'As you might already know. Been aware a lot of people are scared. Residents are scared to speak up ever since our election. So you won't have residents speaking up at this moment. I wish this hearing would have been before our election, but it's not.'",
        "'speaker_5': 'And so, therefore, we are speaking with the residents. They're not going to be speaking up. But I can tell you that here I brought my family to represent that we are role models in the community and that I hope that as much as we live Long Beach, that language allows us to.'",
        "'speaker_0': 'Thank you very much. And the next speaker. Please, please come forward. Oh, yeah. Please just come to the mike.'",
        "'speaker_2': 'Hi. I'm a mayor and city council manager. I'm one of those condos, owner of Bobby's bar and 449 of the occupancy that I have, I have probably one security guard as the police department advised me to do so.'",
        "'speaker_2': 'I also do neighborhood watch in the neighborhood. I have provided the building with lighting and in the street of of California, which it did not have any lighting. It was very, very dark. I have provided that also. I'll provide.'",
        "'speaker_2': 'I have. Lighting in the sidewalk for a bit for a safer. Safer neighborhood. We check everybody's IDs as they go in and out. If I was provided with the entertainment permit, I could bring more business to the uptown side of Long Beach.'",
        "'speaker_2': 'I also do walks neighborhood walks around the neighborhood on Lois and California and Artesia. The neighborhood has been safe. And. Well, that's all I have to say about that.'",
        "'speaker_0': 'Thank you. Any other speakers? Please come forward.'",
        "'speaker_5': 'Evening. My name's Vivienne Span.'",
        "'speaker_2': 'Homeowner in the north district.'",
        "'speaker_5': 'Not too far from this location. I wasn't aware of this. The gentleman says he does. Patrols and neighborhood watch.'",
        "'speaker_2': 'But there was a.'",
        "'speaker_5': 'Shooting at that location maybe three months ago where someone, I believe was killed. There's a church in next door to that facility, as well as another church on the corner. And it's only a couple of blocks from Jordan High School.'",
        "'speaker_5': 'And like the lady said. You would pass.'",
        "'speaker_2': 'By. I think it's.'",
        "'speaker_5': 'A nonstop party. They are parked on the sides of the street, which is a residential street.'",
        "'speaker_2': 'You're only getting, you know.'",
        "'speaker_5': 'That little view. And there is development coming to the north district. And I don't think this is the development that we need. Thank you.'",
        "'speaker_0': 'Thank you. Casey, no other comments. Well, sir, I think you did there the your public commentary. Mr. Attorney, can the owner speak one more time?'",
        "'speaker_2': 'Is this under the hearing?'",
        "'speaker_0': 'Under the hearing?'",
        "'speaker_2': 'Yes. If there is a rebuttal to anything or should come forward. I have an I have an example of the neighborhood watch. One of the churches left its doors unlocked. I was doing my patrol work. I have pictures of it.'",
        "'speaker_2': 'They left their door locked. Other equipment was inside of the church when I opened it. I went in. Light up the place when my flashlight took video recordings of others stuff still in place. I locked up the church for them.'",
        "'speaker_2': 'I put a chain and I text the owner of the of the church. That is that his church is safe. Now, there was no break in. That's all I have to say about. I never watched.'",
        "'speaker_0': 'Thank you. Okay, we're gonna take this back to the city council so much that it's over to Vice Mayor Richardson.'",
        "'speaker_4': 'Thank you, Mayor Garcia. And thank you to the speakers who came down. This is pretty easy for me. I. I think there's. Mr. Roscoe, thank you so much for your interest in doing business in North Long Beach. But there's sort of a new pep in its step.'",
        "'speaker_4': 'And the standard of operation in the past is no longer the standard of operation today. And the bars on Artesia Boulevard, it's been a significant area of focus for our city in cleaning up those bars and making sure that the nuisance activities that have plagued residents for a long time, that we've abated those and gotten rid of'",
        "'speaker_4': 'those. So I don't think this application is quite ready today. So I'm not going to I'm not going to reject it or approve it. I'm going to make a motion to the council to continue it for two months and try to give you an opportunity to.'",
        "'speaker_4': 'You've never come in to meet with my office. The neighborhood association hadn't heard about this. Let you do a little bit of due diligence and try to build some neighborhood support, because if we vote on this today, it will not be approved.'",
        "'speaker_4': 'So my motion is to continue for two months. Thanks.'",
        "'speaker_0': 'There's a motion and a second to continue the item. I see no other council questions or comments. Members, please go ahead and cast your votes.'",
        "'speaker_1': 'Motion carries.'"
    ],
    "Recommendation to request City Manager to evaluate new and ongoing revenue sources, and make the necessary preparations to restore Paramedic Rescue 12 in January 2017, according to the Fire Chief's restoration priority list;  Further request City Manager to evaluate and report back to the City Council the feasibility of a short term and long term plan for additional public safety restorations within 90 days.": [
        "'speaker_0': 'Thank you. We're going to be moving on to the regular agenda. Now, one councilmember has to leave a little bit early tonight. There's been a request to move one of the items up. So we'll be carrying item number 13 and then going into public comment.'",
        "'speaker_1': 'Item 13 Communication from Vice Mayor Richardson, Councilwoman Gonzalez, Councilwoman Mongo, Councilman Andrew's recommendation to request city manager to evaluate new and ongoing revenue sources and make the necessary preparations to restore Paramedic Rescue 12 in January 2017. Further request City Manager to evaluate and report back to the City Council the feasibility of a short term and long term'",
        "'speaker_1': 'plan for additional public safety restorations within 90 days.'",
        "'speaker_4': 'Thank you. So as this is my item and I made the motion, I'll go ahead and speak first. Mayor Garcia had to step out. So first, I want to thank my COSIGNERS for signing on Councilwoman Gonzalez, Mongeau and Andrews, as well as all the council members who have expressed an interest over the years in placing a greater'",
        "'speaker_4': 'focus on public safety. I also want to thank the residents and the leaders who are out here tonight for coming out this evening and joining us the week of Thanksgiving. This is important and I'm great. I'm glad to see this turnout.'",
        "'speaker_4': 'Our public safety personnel serves more than more than 500,000 people. 5 million, 5 million visitors a year protects 55 square miles of our city, the busiest, busiest port in the West Coast and the airport. In fact, the fire department, emergency responders, some of the busiest per capita in California.'",
        "'speaker_4': 'Rescue 12 was eliminated in FBI 2011 budget during do due to the great great recession. That's almost seven years ago. And since since it's being eliminated, calls for service have increased by 16 and a half percent, according the fire department's presentation to the city.'",
        "'speaker_4': 'The increase in call volumes with elimination of resources has created the worst response times in our department's history. We are we are currently only meeting national average response times 44% of the time. Beginning in 2010, the Long Beach Fire Department had to continually restructure its its deployment strategy due to budget cuts.'",
        "'speaker_4': 'And since then, the number of calls have continued to grow. Response times have increased. Safety of our residents is being compromised. For example, the average of all emergency response times in 2005 was 5 minutes and 29 seconds, with 72.8% of calls.'",
        "'speaker_4': 'Meeting Response Standards. Ten years later, in 2015, the average of all emergency response times was 6 minutes and 16 seconds, with only 46.1% of the calls meeting standards. And that's just unacceptable. So for too long, we've been forced to cut rather than invest.'",
        "'speaker_4': 'And even as the local economy has improved, we were unable to bring back critical services that we need to maintain a vibrant world class city. This year, local leaders asked residents to step up and make investments in our city and county through adopting a number of new revenue sources.'",
        "'speaker_4': 'And because they all passed, our general fund will see benefits from new revenue opportunities. And now's the time to invest in quality public services that our residents need and deserve. We've already started to bring back some of those services we've lost due to the Great Recession, and past budget cuts will soon see those police departments south division'",
        "'speaker_4': 'restored with new police officers. We're seeing we've seen the fire department's Belmont Shore Station restored with Engine eight. These investments are all important because they help us work toward a safe and long, safer Long Beach. The way to improve response times, to add resources and people to respond to 911 calls for service.'",
        "'speaker_4': 'Remember, Rescue 12 is a benefit to the entire city, not just north Long Beach. Restoring Rescue 12 will help reduce response times throughout the city by helping other rescues in their respective areas, rather than have to wait for units to become available from across town.'",
        "'speaker_4': 'But now's the time to do even more. We need to push for a full restoration of public safety services and new strategy, direct to direct services to the areas of greatest need. It's time to restore Paramedic Rescue 12 by adding a ninth paramedic in the system.'",
        "'speaker_4': 'We can be better assured that when there's an emergency, help will be on its way faster. Additionally, evaluating the responsibility of the feasibility of long a short term plan for further restorations will ensure a path to a safer Long Beach.'",
        "'speaker_4': 'The public's trust is in us, and I'm committed to doing all I can to work toward a safer, more equitable city. And so I strongly encourage my colleagues to approve this motion, which does two things. It calls on the city manager to specifically take steps to to reduce, restore rescue 12 at the beginning of the year, based'",
        "'speaker_4': 'on the prior list set forth by our fire chief. And it allows us to further explore of public safety restorations with our police department to establish some sort of a plan to implement them. We, we, we when we want to see some balance here, we know that needs are not just in the fire department, but also in'",
        "'speaker_4': 'the police department. So as we, you know, further implement the fire chiefs priority list, we want to talk with and engage with our police chief about his priority list and see additional additional restorations on the PD side as well in the fleet in the future.'",
        "'speaker_4': 'I want to I want to recognize that Restoring Rescue 12 also puts us on a path to further restorations in the fire department. There is if we stick to the fire chiefs restoration once 12 is out of the way, you have a path to engine 17, which I know is very important to Councilmember Darrell Super now and'",
        "'speaker_4': 'some of the folks in central and east Long Beach but tonight is about 12 and our paramedic services that that have not yet been restored. So my question for city staff. Mr. City Manager, how would you respond to this request tonight?'",
        "'speaker_2': 'Mayor. Council members will be coming back with a report that provides the financial information to the city council can make decisions to begin those restorations, whether it's fire restorations and or police restoration. So we'll have a financial plan that the city council will then make decisions on how it's going to be funded and what it's going to'",
        "'speaker_2': 'cost.'",
        "'speaker_4': 'Thank you. And so that concludes my remarks. And that's my motion. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Gonzalez.'",
        "'speaker_3': 'Yes, I think in light of many of the funding sources that we will see come down to us as we receive more information on what those projections will look like, I am supportive of this item because that was the rescue.'",
        "'speaker_3': '12 was the next immediate item on the priority list. And I think it is only fair that we respond to that and make sure that we're not only responding to rescue 12, but I assume, like Councilmember Rex Richardson said, that we will have an overall discussion on public safety and what those priorities will look like with both'",
        "'speaker_3': 'police and fire and even with our Marine and harbor area as well. I think that's very important. And so I wholeheartedly support this item. I think what we've done in South Division and in eight in Belmont Shore has been incredible.'",
        "'speaker_3': 'I look forward to seeing more and thank you both for being here as well.'",
        "'speaker_0': 'Thank you, Councilmember Superman.'",
        "'speaker_4': 'Thank you. I would like to ask for a friendly amendment. And that would be to add engine 17 to the language here. So Rescue 12 and Engine 17 are considered simultaneously. I've spoken at council on a couple of occasions expressing the need for Engine 17, how critical it is.'",
        "'speaker_4': 'So I'll take a little different approach tonight. If we look at the project management, management model of cost schedule quality. I think the cost has been well established that it's 2.2 million to restore Engine 17. Measure A gives this $48 million a year.'",
        "'speaker_4': 'So you think if you divide that in third place, fire and public works, that's 16 million. So that's 2.2 million out of that 16 million for for fire. So if we add up, let's say all of the if we take that restoration of engine eight, the second fire academy at 1.3, four, 4 million.'",
        "'speaker_4': 'Rescue 12 and Engine 17, I get a grand total that is only 43 and a half percent of that 16 million. I believe that is feasible cost wise if we go to schedule. I believe Chief Tory told us the last time he spoke here that he can restore this engine company immediately and schedule.'",
        "'speaker_4': 'When you talk about fire is it's unique in a couple of ways. It's one of the few resources that can be restored immediately. And secondly, you never know when that need is going to be. We're entering the winter season and just ironically, I believe, the duplex that burnt down across the street from Station 17 that took place'",
        "'speaker_4': 'in January. If we want to talk about the third item and that is quality, I've spoken of that before here and that is I think I talked about how the calling areas, the areas of the city, 17 calls on a but several other engine companies and I think it affects five different council districts.'",
        "'speaker_4': 'So I'll just talk about 17 specifically. They cover the four or five freeway from Lakewood Boulevard to approximately Bellflower Boulevard, and that works in tandem with Engine 22. So if there's a fire or crash on the freeway, Engine 17 would approach from Lakewood Boulevard heading south, and 22 Wood would head north from Palo Verde.'",
        "'speaker_4': 'And the reason that's critical to have these two engine companies work in tandem is when you get a report of a crash on the freeway, sometimes they don't know what side of the freeway it's on. And so they can kind of approach from both directions.'",
        "'speaker_4': 'Also, if you think of I haven't talked before about the number of structures in Engine 17 area, some actually multiple, multiple story buildings. The Holiday Inn at Lakewood and Willow comes to mind. Community Hospital near the traffic circle is in Seventeen's area.'",
        "'speaker_4': 'I talked about council districts five and three. I think Park Estates probably has the largest number of wood shingle roofs per capita than any other neighborhood in the city. So for those reasons, I'm asking my colleagues to support a friendly amendment or extra Vice Mayor Richardson and approve us moving forward with Rescue 12 and Engine 17.'",
        "'speaker_4': 'Thank you. Thank you. And I'll I'll I'll certainly take it in advisement. Here's what I would here's what I would say I admire and I know how important that engine is. And so we just restored an engine in East Long Beach, engine eight.'",
        "'speaker_4': 'The paramedics, we haven't yet. The fire chief is, you know, run data back in the day. And then we asked them to rerun the data a year ago after the elimination R&D about his priorities. And they came back the exact same priority list as they were back in 2011.'",
        "'speaker_4': 'So it came back that the priority list was Rescue 12, then Engine 17, and then I believe it was 1 to 1 and they can speak to that. But tonight is really not about like we didn't dogpile engine eight and say we need everything else at that time.'",
        "'speaker_4': 'We supported it everything in the order. And I'm I'm willing to add to my motion to ask staff to evaluate the feasibility of of of engine 17 or provide some sort of a timeline for 17. But this motion and I don't want to diminish that this is really about paramedic services and communities waited seven years so that'",
        "'speaker_4': 'that would be my response and I hope I hope that a suture request.'",
        "'speaker_0': 'Councilwoman Price.'",
        "'speaker_3': 'Thank you, Mr. Mayor, and thank you to my colleagues who brought this item. This is definitely a priority and one that I support wholeheartedly. And I know that we as a council, all of us want to see police and fire services restored, and we've been working on this for some time.'",
        "'speaker_3': 'So I really appreciate Councilman Richardson bringing this forward. I'm also very supportive of Councilman super nice, friendly and would hope that you would consider bringing accepting it. I can't speak for him, but it sounds to me like he's basically trying to say, can we can we find a path for both, is what I think he's trying to'",
        "'speaker_3': 'say rather than one over the other. But we actually have an item on the public safety agenda that was filed in, I believe it was in October. Our meeting got canceled because of one of the members not being able to be there.'",
        "'speaker_3': 'But we do have an item that's on file and it is asking it's similar. It's asking for the city staff to take a look at measure a revenue sources and look at our public safety priorities so that we as a council can talk about whether or not we want to reallocate the priorities that we have set under'",
        "'speaker_3': 'Measure A and this is a discussion that we had at the budget cycle, and I believe it's very consistent with the logic that Councilman Supernova just articulated a few minutes ago, and that is we have $48 million that we can reasonably anticipate receiving as a revenue source related to Measure A, and perhaps we need to reevaluate still'",
        "'speaker_3': 'within the guidelines of public safety and infrastructure where we're going to be allocating that money. We are facing some challenges in the city, as Councilman Rich or Vice Mayor Richardson has mentioned, that are new and different. And every day we are challenged with more public safety challenges that our police and fire departments are not equipped to handle'",
        "'speaker_3': 'in the manner that they should. We're not meeting the standards, and and that's certainly something that we want to improve upon. So I support this this motion completely, especially with the friendly. I do expect that will provide a report to the full council after we have our public safety meeting.'",
        "'speaker_3': 'And we're already planning on preparing a written report for my council colleagues so that we can hopefully have a broader discussion as a as a body in terms of measure a money and how we may want to allocate that money within the different public safety and or infrastructure categories.'",
        "'speaker_3': 'So thank you again for bringing this. And the more resources that we can allocate to public safety, I think the better off we'll be as a city. So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Mongo.'",
        "'speaker_5': 'Thank you. I'm a big supporter of ensuring that our neighbors have the most safe and most safe environment. I appreciate that. Councilmember Richardson and I worked strongly on this back before the budget, and there does have to be a path one at a time.'",
        "'speaker_5': 'I think we are all on board. That 17 is next. And I hope that within the context of the report, at least we could get a timeline on what that might look like. If that's a possibility, I think that that's a strong indicator to the community that will help us make those decisions for the next rounds of'",
        "'speaker_5': 'measure funding that we have coming down the pipe. So with that, I appreciate and we'll support the motion.'",
        "'speaker_0': 'Thank you. Councilmember Everingham.'",
        "'speaker_2': 'Thank you, Mayor. I to support this motion. I think that we have a plan. When we passed Measure eight, we said that we're going to be looking at all of our public safety deployments and where we need and and restoration while the other stations and the units that we were missing or had taken away because of our'",
        "'speaker_2': 'culture and the economy. So I'm very supportive of this measure. And I think that if we are to be successful and we are to be within our budget, we need to stick to the plan that we set it initially and let's stick to it.'",
        "'speaker_2': 'So I will be supporting the original motion.'",
        "'speaker_0': 'Thank you, Councilmember Supernova.'",
        "'speaker_4': 'You know, I talked about stats and whatnot just a minute ago, and I'd like to go to the intangibles. I think by definition, that's not quantifiable. That's usually not the area I quote. But I'd just like to make one other point about Station 17 and the lack of an engine company in that house.'",
        "'speaker_4': 'To say that it's next to the training center is kind of an understatement. It's it's on the same prop property, basically. And this is what all of our recruits see as a working station in our city. And you think of that recruit class that we're paying, you're spending $110 million on.'",
        "'speaker_4': 'If there are 20 recruits there, that's $67,000 per recruit. I would like those recruits to be really enthused about working in the city of Long Beach to see that this city supports a fire station with a fire engine in it.'",
        "'speaker_4': 'I would like to see that we spend that money and they don't go to another agency after they've received the training here. And I think it's just a critical piece, as I said, morale, whatnot. Those are the intangibles.'",
        "'speaker_4': 'But I think this is the display. This fire station is a display for every one of our recruits to see working next to the training center. And that's just another reason why I think we need Engine 17 in place there.'",
        "'speaker_4': 'I if if my friendly is not going to be accepted, I'll go a different course. Thank you.'",
        "'speaker_0': 'Thank you. I'm going to go to Councilman Pearce. I'll make a few comments and make it a public comment and we'll go back to council. Councilman Pearce.'",
        "'speaker_8': 'Thank you. I think it's great that we're, you know, have this item in front of us that we're looking at restoration again. I think during the budget process, we talked about having this come back in January and doing everything we could do to restore fire.'",
        "'speaker_8': 'I think that there are a lot of questions that I still have. So forgive me for going through a little bit of a process. So I have that the priority list is 17 one, two, one. Is that correct?'",
        "'speaker_8': 'I know our police chief is in here about 12, 17, 12, 17, one, two, one. And it's my understanding that those, as Daryl said, could be turned on immediately. Should we take a vote to restore all of those today?'",
        "'speaker_8': 'We could restore those.'",
        "'speaker_2': 'I'll turn that over to our deputy chiefs. We have Deputy Chief Chris Roe and Jim Rex McCool. Many are members of the council. My name is Jim Erickson, assistant chief of operations.'",
        "'speaker_7': 'As far as turning them on tomorrow, that would be a possibility. Yes, we can absolutely do that.'",
        "'speaker_8': 'Do we have the staff to if we turn them on, say, tomorrow or January 1st to staff all of those?'",
        "'speaker_7': 'The way we do our constant staffing, we would we would use overtime for that and until the recruit class graduated. But as far as staffing them, we would staff them. Yes, ma'am.'",
        "'speaker_8': 'Okay. And my concern is representing a majority of downtown, as we just supported a you know, one of the tallest buildings that we're going to have in downtown. Is that the response times that council, that vice mayor mentioned, 46% meeting standards.'",
        "'speaker_8': 'That's to the door. That's not to the 35th floor. That's not all the way up. And so how are we making sure that we're covering our downtown constituents and also we're leaving our firefighters and paramedics to impact the areas and get out to their folks as quickly as possible.'",
        "'speaker_8': 'So it's I'm supportive of restoring 12 because we said that we were going to do that and we said we were going to do that during the budget cycle. My expectation is that when we talk about that second part, which is staff coming back in 90 days about what it would mean that we're having a conversation about'",
        "'speaker_8': 'all the email money, all the funds that are coming in and really being able to act quickly to restore to restore as fast as possible, and that our fire would be able to do that. When it comes to restoring PD, I know that there are restorations that need to be made citywide, and particularly on the West Side'",
        "'speaker_8': 'and North Side, but also wanting to have that conversation be something that is rooted in an equity lens, that it's not just about more PD on the ground, but it's about supporting things like data and some of the projects that they're doing in New York.'",
        "'speaker_8': 'And how are we policing in a way that's consistent with our values as a city? So if we bring that back, I just don't want it to be a report about what does restoration look like? That was there before, but I would want to have a fuller discussion about it.'",
        "'speaker_8': 'So I don't know. Vice Mayor, if you have any comments on that, I just. Okay.'",
        "'speaker_0': 'Vice Mayor Richardson.'",
        "'speaker_4': 'Sure. I just want to be able to respond more directly to Councilmember Supernormal. So so I don't think I was maybe I wasn't clear before. I didn't think that it was necessary to do an accept or a rejection of the motion.'",
        "'speaker_4': 'I express support that. I think the motion says go ahead and, you know, explore, evaluate further restorations. I'm not saying we depart from the Chiefs priority list. That priority list calls for Engine 17 directly after Rescue 12. So I'm committed to that fully.'",
        "'speaker_4': 'And I have no problems or reservations with asking staff, Hey, if they find the ability to do more than rescue 12, great. I'm not saying limited. Well, I'm going to wait till councilmember spinoff is. So what? I just want to be clear.'",
        "'speaker_4': 'I'm not saying if staff comes back and says we can restore engine 817 101. Go for it, by all means. But the fire chiefs priority list for going on seven years, which is where you spent about a year ago, has come back and said the priority list is the priority list.'",
        "'speaker_4': 'And that has not changed. And I support that completely. But I think thank all the council members for their comments tonight.'",
        "'speaker_0': 'I'm going to make a couple comments, make a public comment, and then I'll go back to the to the actually, if the other two councilmembers want to jump back in. I think that's fine as well, obviously. Just just a couple of things.'",
        "'speaker_0': 'I think first is I do want to just start off by thanking, obviously, Vice Mayor Richardson, that you've been advocating for this for a very long time. And so I appreciate that in the community we've seen out here multiple times on this very issue.'",
        "'speaker_0': 'So thank you. A couple of things I think are important. Just in just to note, it is always been certainly my intention and I think the council's intention to be able to make more restorations on public safety side beyond the first two that were made in the first year.'",
        "'speaker_0': 'The budget that was passed part of of Measure A was obviously focused on a large public works program, which is beginning, which we're very excited about, but also making public safety restorations. And we've made the first two. We're very excited about those two.'",
        "'speaker_0': 'In addition to that, I think having this discussion around 12 is the next part of the restoration, as is the discussion that Councilman Supernova's bringing up when it comes to 17 as well as other public safety needs. So what I also am hoping for is a couple of things, I think.'",
        "'speaker_0': 'One, I think it's I think it's very appropriate. It's clear from the chief that rescue 12 is the next the next priority of a restoration. But it's also clear that 17 is the next priority of the chief after after that rescue.'",
        "'speaker_0': 'And so it is obviously important for us to begin that process of looking at 12, but also right following up behind 12 is 17. And so staff should also begin that preparation of looking at those numbers and seeing what the cost is and and how would it be able to do that or not do that?'",
        "'speaker_0': 'But I think we need to have that discussion. And so I am supportive of the process to begin looking at 17, I think, Councilman Shoop, when I think that's appropriate. But I also obviously I know that 12 is the next priority and I think that's got to be dealt with first.'",
        "'speaker_0': 'In addition to that, I think we need to here in these, you know, then when staff comes back, I think that is going to be an appropriate time to have a council discussion about what are the next priorities of both the fire department and the police department long term?'",
        "'speaker_0': 'What does all the revenue that's coming in mean for the city? And also what does the revenue mean when it comes to Measure eight? I just want to remind everyone, measure is not a permanent tax. So any restoration that is not public public infrastructure, we have to figure out how to pay long term because what we are'",
        "'speaker_0': 'not going to do and what I will not support is making a bunch of restorations and then cutting those and cutting all of those apparatus across the city. So I think the the approach that the council is taking is very smart, which is easing into the restorations while the economy is growing, while incredible projects are being developed'",
        "'speaker_0': 'and built across the city. So that from a fiscal point of view, we're being both we're both listening to the community and doing the right thing, which is making restorations. And by the way, once we restore Rescue 12, we're going to continue to restore more public safety, hopefully restorations.'",
        "'speaker_0': 'And I think that's a conversation this council supports and wants to have. But I just also caution is that we have to be able to figure out and have a plan on how to pay for these long term, which and we're talking about these next five years and then the ten years.'",
        "'speaker_0': 'And so that is, I think, needs to be part of this, a greater, larger discussion when we have it in a couple of months or whenever you bring it back. Mr. West. I think what everyone said here has absolute merit.'",
        "'speaker_0': 'I think Councilwoman Price has been very clear about her interests here, and I appreciate that. And we should discuss those. We should be discussing 17, should be discussing all the needs, but also talk about what what do we really have in terms of dollars?'",
        "'speaker_0': 'When will those dollars disappear and at what rate is the economy moving to be able to cover some of these expenses long term? So I just wanted to make those comments. I am supportive of moving forward on 12.'",
        "'speaker_0': 'So that's the next restoration, but also to begin to look at 17 because that clearly should be the restoration that we that we focus on beyond beyond 12. And so I hope that's where we end the motion ends up, is that we can find some sort of compromise to do that.'",
        "'speaker_0': 'Let me go back to the to the council, and then I'm going to go to public comment. Councilmember Soprano.'",
        "'speaker_4': 'Okay. I'd just like to clarify something here. There seems to be some language that I'm somehow deviating from the chief's recommendation. I am not. I am in lockstep with what the chief has recommended. All I'm saying is that we came out with the restoration of Engine eight and a fire academy.'",
        "'speaker_4': 'Those are two items. So I'm saying, okay, now the chief is recommending in order rescue 12 and engine 17. Who says we have to stop it? Why not? Item we did two items before. So let's get both of these items restored tonight.'",
        "'speaker_4': 'That's my point. I'm not deviating from anyone's list, but I didn't hear the chief say, Oh, you can only restore these one at a time. That's my rule. That did not happen. So I'm saying let's restore both tonight.'",
        "'speaker_4': 'If we're going to come back with a report, the dollars are here. It's in black and white right now. I don't know what the report is going to tell us later that we don't know tonight. So I would like to move forward with this item.'",
        "'speaker_4': 'I would like the friendly accepted that we're going to add engine 17 to the rescue 12 restoration. Thank you.'",
        "'speaker_0': 'Thank you. And to clarify, Vice Mayor, I don't think you're asking for any restorations tonight, is that correct? Okay. Just want to make sure that clarify that as well. Okay. Let's go to the public and then we'll. Okay, let's go to the public.'",
        "'speaker_0': 'And then after we'll come back to the council. So if you have a comment, please come forward and 3 minutes, state your name.'",
        "'speaker_5': 'Good evening, Councilman and Mayor. My name is Eileen, and I live on Saint Francis in the ninth district. And I come before you to voice his support for Rescue 12. We have a number of seniors living alone in my neighborhood, and I know there's in other areas as well.'",
        "'speaker_5': 'But it's we have been without a rescue 12 or a rescue truck for quite a number a number of years now. And we have had to rely on other districts for that kind of service. And it's very important.'",
        "'speaker_5': 'Some of my neighbors have had to wait for quite a while before some have shown up, except maybe for the engine to show up. In fact, yesterday I was out doing some of business and as I came home was approaching the street where I turned to go home.'",
        "'speaker_5': 'Here had been a head on collision right at the street where I was going to have to turn. The only vehicle there to support the accident was a police car. No paramedics. Nobody else was there. And as I came around the corner and it was the car was sitting right there, it was obvious that somebody had hit'",
        "'speaker_5': 'the windshield. And I would have liked to have had somebody there to to help. And so. It wasn't until I got home, which is several blocks away, that I finally heard the fire department start to come. Because we have we live I live close to a hospital.'",
        "'speaker_5': 'So I hear those kind of sirens a lot. So I recognized what it was. So I want to encourage you to support this consideration and for listening to me. And thank you, Vice Mayor Richardson and Councilmember Gonzalez and Mungo and Andrews for going along with him.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Counsel. I'm sorry. I'm actually next for the speaker. I apologize for that. Yes, sir.'",
        "'speaker_7': 'Good evening, Mayor and council members. I'm getting over a call right now, so if I sound kind of funny, it's because of that. I'm in favor of the I'm Phillips. I'm here and I've been a resident of Nord Long Beach for about 50 years and I'm also on the board of the Uptown Business District.'",
        "'speaker_7': 'I'm in favor of this. And North Long Beach has has a significant amount of industrial properties in their area and which is the equivalent of high rise. But I think the industrial has stands more of a chance of of injuries than than something of that wood type wood.'",
        "'speaker_7': 'The. 90805 zip code. Is roughly the size of Bellflower or Paramount or Lakewood. And all of these cities have rescue units that they have or they have contracted with someone to provide the service for them. When Fire Station 12 was was built, it was designed to be an emergency response center for the area.'",
        "'speaker_7': 'And I would assume that being an emergency response unit, that they would have a paramedic there. On a more personal note, I am personally in favor of it because both me and my neighbors have used the service in the past, and I've had a daughter that when she was having a babysitter over there, had a had convulsions'",
        "'speaker_7': '. And we found out later that the paramedics came there and brought her back. Also, my wife walking the dog fell and broke her hip and she was couldn't get up. And by the time I got it and got the word and got there, the paramedics were there and helping her and they were putting her on a board'",
        "'speaker_7': 'and taking her to the hospital. So I appreciate the help that they provided. And I would think it's your duty to return this service to to to North Palm Beach. It's a great city. And I think North Lawn, which deserves it.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_4': 'Please.'",
        "'speaker_5': 'Good evening, Mr. Mayor, Vice Mayor, city council members and staff. My name is Margaret Dudley and I live in the ninth district and I'm here to support the restoration. The full restoration of paramedics, rescue 12 in my district is long overdue.'",
        "'speaker_5': 'It's been on you guys agenda since 2010, I believe. And I fully support Chief Tory's priority and having this paramedic restored. And as my my neighbors in my community in the ninth District, we were very concerned about not having this paramedic in our district.'",
        "'speaker_5': 'But as you said, Supernormal, we live in the city, the whole of Long Beach, and that's going to be a priority.'",
        "'speaker_2': 'To have.'",
        "'speaker_5': 'Rescue 17 fire in 17 there. So I just urge the city manager and to go ahead when these funds come in for measure in May that you you restore you fully restore and fund rescue paramedic rescue 12. And I thank you for hearing me and I hope that you all have a wonderful Thanksgiving and a safe holiday'",
        "'speaker_5': '. And to my citizens, my residents of North Long Beach. Thank you all for hearing me. And please restore paramedic rescue 12. Thank you.'",
        "'speaker_0': 'Thank you so much. Hello.'",
        "'speaker_5': 'Good afternoon. Afternoon. Glad to see you again. See the honorable mayor and Vice Mayor Rex Richardson to all of the city council representatives. I'm here. My name is Linda Wilson, and I'm a resident in the ninth district in North Long Beach.'",
        "'speaker_5': 'And I live in the College Square Neighborhood Association area, and I've lived there for over 20 years. I do also I am also one of the community, I guess, activists or community representatives in my area. And while I empathize and feel for what Councilmember Boehner is saying about 17, I just want to remind everyone that our priority'",
        "'speaker_5': 'here tonight is 12. We've waited a very long time for 12. We've talked about it for years. We've agonized over it for years. We've waited and we've waited and waited for a rescue that was taken away from us.'",
        "'speaker_5': 'And so this is just a restore of something that was taken away. And that's what we're looking forward to. We appreciate the fact that you're preparing this fiscally sound plan, responsible plan and planning on money that you know you're going to get.'",
        "'speaker_5': 'And then priorities down the line, addresses additional funds that may come in. But we need stability. We need the assurances we need to bank on money and revenue that is actually planned for allocate it and that we expect mightily to present itself.'",
        "'speaker_5': 'And so tonight. We're really pleading with you, restore 12. Let me just share a quick story with you. If you could imagine closing your eyes for 3 minutes. Or 5 minutes would even be longer. And I say those time frames because my husband.'",
        "'speaker_5': 'One night did not respond to me. And I called for paramedics. And I waited and I tried to call him and tell him, don't leave me. I shook him. I tried to breathe for him. I remembered I needed to unlock the door.'",
        "'speaker_5': 'And so I ran to the front and unlocked the door. Then I needed and came back to him waiting. It hurt. No sirens. I prepared. I said, okay, well, I need some clothes on. So this was in the middle of the night waiting?'",
        "'speaker_5': 'Nothing. Nothing. It took a very long time. It took 5 minutes. That was an agonizing 5 minutes for paramedics to come. And had we had 12, it would not have taken that long. So tonight, I just want to leave that with you as you consider and as the city manager actually takes a look at the money and'",
        "'speaker_5': 'all of you give your considerations. 12 We need. Thank you. Go Long Beach.'",
        "'speaker_2': 'Go Long Beach and go uptown.'",
        "'speaker_0': 'That's why I love you. Next. Bigger us. Go uptown. That's right.'",
        "'speaker_5': 'And good evening again. My name's Greenspan, homeowner in the ninth district. And as most of you know, the ninth District is the most populated this district in the city. We don't have access to medical centers, urgent care center.'",
        "'speaker_5': 'So this rescue 12 would act as a go between. And it actually is a no brainer. I mean, we have new development coming. We have new interests in the north district, which is always on the short end of the stick.'",
        "'speaker_5': 'Some of these other areas you have Long Beach Memorial St Mary's and we can go on and on. But you know, at the Long Beach we rely on the rescue. Well, not only the service, but because the new station has actually increased our home values, which.'",
        "'speaker_5': 'Causes us to pay more taxes, to generate, you know, the service. So it's a no brainer to restore the service in an area that is so.'",
        "'speaker_2': 'Populated with.'",
        "'speaker_5': 'Young people under 18 years old. And again, thank you, Mayor Rex Richardson, for your due diligence and have a good night.'",
        "'speaker_0': 'Thank you. Last for the comment.'",
        "'speaker_2': 'Very good. You, Clark, is the address. I obviously support the restoration of all the fire department equipment and resources and particularly with the council. And so, again, I said that there's no reason why we can't do it all.'",
        "'speaker_2': 'I would, though, once again to point out. That we would not be having this discussion. Had you not? Put the city on the road to bankruptcy by the new city hall. And you had that job. You still had that opportunity, as I outlined earlier, to recapture that some of that money by replacing by building the city hall'",
        "'speaker_2': 'down on Ocean Boulevard. I fully support also the art and the concept which you talked about, where it's not limited to the fire department says, but restoring the integrity of the police paradigm. And particularly restoring what has been dismantled by the disease, the mindset that now prevails, i.e., destroying, dismantling the neighborhood watch program.'",
        "'speaker_2': 'I don't know if you're aware of this or not. But if you're one of your neighbors called. And didn't reference. It's the house that had been broken into. There were a home invasion. Was yours? And they were raping or assaulting your family members.'",
        "'speaker_2': 'The response out of the the disease policy from our. Dispatchers are. Well, that's not your residence. We have to have the owner call period. That is the standing de facto de jury policy of the city of Long Beach.'",
        "'speaker_2': 'That is disease and demented thinking. We don't need to spend dollar one to change that. We just need to fire the people that put that in place, period. Somebody. Earlier this evening pointed out a glance, another classic example of that.'",
        "'speaker_2': 'They had reported that a neighbor's wall had been severely damaged. Somebody had driven into it. Teetering on falling over to a public area. The response out of the disease dispatch center. You're not the owner. You have to have the owner call.'",
        "'speaker_2': 'You don't need to reconvene the Council of Trent to change that. But I think what we're going to have to do is change. A number of people within the police department. Hopefully we'll be able to retain Chief Luna, who's been ill served, as I said, and I'm going to address that a little later that evening.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Kate, we're going to go ahead now and go back to the council for a vote. Vice Mayor Richardson.'",
        "'speaker_4': 'Thank you, Mr. Mayor. And I just want to thank the speakers who came down. You made really compelling points. And it hadn't even occurred to me that we opened our new fire station in 2013, and it hasn't had a rescue once since.'",
        "'speaker_4': 'It's been since I've been there. We had the R&D situation, but that was a full rescue. We haven't had a rescue since that structure is open. So that's. So thank you for acknowledging that and for recognize that moment and and for all of you coming down and speaking.'",
        "'speaker_4': 'And I want to just I want to I want to get the city manager or the city attorney just to restate the motion for me so I can be clear, so we can be clear on what it does include.'",
        "'speaker_4': 'Okay. Well I'll I'll restated. It's the motion as is the motion as written. I want to accommodate I want to make sure that we do acknowledge and accommodate what Councilman Supernova is saying about, you know, making sure that if we have the ability evaluate, if we have the ability to restore 17 as well as one on one'",
        "'speaker_4': ', then put us in a position to do that immediately. So not. So this isn't saying if we, you know, come back with just one plan for 12. Yes. We're not deviating from the chief's plan. But if we have the ability to do further restorations, put us in a position for the council to do so.'",
        "'speaker_4': 'So does that. Councilman Hooper not is that satisfy your sentiment, Councilmember Pearce? That satisfy your sentiment? Okay. So that said, I want to go ahead and call for a vote and urge my colleagues to support this. Thank you.'",
        "'speaker_0': 'Okay. There's a motion on the floor. Please cast your votes.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': 'Great. Thank you all very much. We're going to go ahead and now go on to public comment. I'm going to let let me name the first few speakers. First up, the first three, please lineup Larry Goodhue, Zo Nicholson and Steve Updike.'"
    ],
    "Recommendation to request City Attorney to draft an amendment to Ordinance No. C-7814, which describes the requirements for service on the Belmont Shore Parking and Business Improvement Area Advisory Commission.": [
        "'speaker_0': 'We're going to go ahead and move on to number. 15.'",
        "'speaker_1': 'Communication from Councilwoman Price. Recommendation to request City Attorney to draft an amendment to ordinance number c7814, which describes the requirements for service on the Belmont Shore Parking and Business Improvement Area Advisory Commission.'",
        "'speaker_0': 'Can I get a motion in motion in a second? Councilman Price.'",
        "'speaker_3': 'Thank you. This is just a cleanup item. We're just changing the residential requirement to be in at large as opposed to a resident from any particular organization. Thanks.'",
        "'speaker_0': 'Any public comment on this? Mr.. Here, please come down.'",
        "'speaker_2': 'Larry, could you click as the address, as I suggested to counsel in the Council of Advisors office that. This item be held over pending a review by the city auditor. I have attended a number of the meetings and certainly the commission does a credible job.'",
        "'speaker_2': 'But. It never struck me until somebody pointed out. At a different hearing. The inherent conflict of interests that now exist. And we need to make sure that does not exist. We have. Members that are residents. Members that are property owners, business owners.'",
        "'speaker_2': 'But we have a situation where we have. One is a landlord and the other is a tenant. Other the landlord. So that raises the red flag to. Any form of equity. I.e. You've got to vote this way or your rents going up.'",
        "'speaker_2': 'So I think to make for the integrity of the process. Let's first. See what the city auditor finds and get some direction out of the city attorney's office. So the. Cloud of hankie. Panky does not exist. I think.'",
        "'speaker_2': 'And I think that would best serve. Not only the business businesses there, but the residents and the city as a whole. It's just a question of ethics and that I don't know why. No one's ever caught that before, but that's certainly not a terrible situation.'",
        "'speaker_2': 'And waiting a couple of weeks to examine the facts is not going to rock the boat rushing into it. Ignoring that fact would not speak well for this city council. Thank you.'",
        "'speaker_4': 'Thank you. Members, please cast your vote.'"
    ],
    "Recommendation to approve the Magnolia Industrial Group Property and Business Improvement District Annual Report and Assessment for the period of December 1, 2016 through November 30, 2017, automatically extending the current agreement with the Magnolia Industrial Group, Inc., for a one-year period; and authorize payment of $1,511 in City property assessments from the General Fund (GF) in the Public Works Department (PW).  (District 1)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you. Item number six Please.'",
        "'speaker_1': 'Report from Economic and Property Development and Public Works recommendation to approve the Magnolia Industrial Group Property and Business Improvement District Annual Report and assessment for the period of December 1st, 2016 through November 30th, 2017, automatically extending the current agreement with the Magnolia Industrial Group and authorize payment of 1500 dollars in city property assessments from the General Fund'",
        "'speaker_1': 'in the Public Works Department District one.'",
        "'speaker_4': 'Thank you, City Manager West.'",
        "'speaker_2': 'With a report from Jim Fiske Garman, one of our managers in economic development and property management department, honorable vice mayor and City Council Members. This item is the annual approval of the Magnolia Industrial Group Property and Business Improvement District and report and ongoing assessment.'",
        "'speaker_2': 'The recommended action on this item continues the assessment for another year. There are no proposed changes to the basis of the assessment, nor any significant changes with proposed activities or programs. Therefore, staff request that City Council receive supporting documentation of record and approve the recommendation to continue the levy of the assessment and authorize the city manager to'",
        "'speaker_2': 'extend the agreement for one additional year. That concludes my report.'",
        "'speaker_4': 'Thank you. Councilmember Gonzalez.'",
        "'speaker_3': 'Yes, I'll just say, Jim, you know, you do such an incredible job with our business improvement districts, especially MiG. And they also are great, incredible, hard workers. So it was great seeing you last month at the meeting and continue the amazing work.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you. Councilmember Arango. Okay. Is there any public comment on this item saying non please cast your vote.'",
        "'speaker_1': 'Motion carries.'",
        "'speaker_4': 'Thank you. Number 17, please.'",
        "'speaker_0': 'Before we go to 17, just an announcement that will be we continued the closed session earlier. We'll be continuing that to the end of the meeting. So just wanted to make sure that we announce that as well.'"
    ],
    "Recommendation to adopt resolution amending Section 19 of Resolution No. RES-16-0083 (Salary Resolution), authorizing City Manager, or other appropriate appointing authority, to extend the use of accumulated carried over vacation and in-lieu holiday time for a period not to exceed 180 calendar days.  (Citywide)": [
        "'speaker_1': 'Motion carries.'",
        "'speaker_0': '18.'",
        "'speaker_1': 'Report from Human Resources Recommendation to adopt resolution amending Section 19 of Resolution Number Rez 16 Dash 0083. Authorizing City Manager or other appropriate appointing authority to extend the use of accumulated carried over vacation and in lieu holiday time for a period not to extend 180 calendar days citywide.'",
        "'speaker_0': 'Thank you. There's a motion and a second. Any public comment? CNN. I'm sorry. Council. We're asking that you have something. Let's let's hold 1/2, please.'",
        "'speaker_2': 'Yes, just clarification of Mr. two to the city manager to what employees does this implies apply? Is this across the board for all employees, city wide? It'll be mayor councilmembers. It'll be managed by the department, through the city, managed by the city managers, through the department.'",
        "'speaker_2': 'So primarily we're concerned about our police and fire departments, but it certainly will be available to some of the other departments that have staff that are not been able to take vacations. Okay. And and does this preclude a bargaining unit of employees that have contracts in place?'",
        "'speaker_2': 'I'm going to turn that over to our deputy director of h.r. Cindy stafford.'",
        "'speaker_5': 'Good evening. This is an amendment to the Saudi resolution. Was it adopted by council, which means it affects all of our employees with a representative non represented.'",
        "'speaker_2': 'Okay. Thank you very much.'",
        "'speaker_0': 'Question.'",
        "'speaker_1': 'Motion carries Councilwoman Price. That's all right. Motion carries. Item 19 Report from Human Resources Recommendation to adopt resolution approving the amendments to the existing Memorandum of Understanding with the Long Beach Lifeguard Association citywide.'"
    ]
}